{
  "id": "topic_5498443",
  "title": "GiftedMAN",
  "author": "GiftedMAN",
  "created_time": "May 31, 2024, 03:21:36 PM",
  "content": "Personally, I don't think I have the right answers to this question otherwise I wouldn't have brought it up here for members of the forum tohave a discussion about it but I hope you don't mind to give your honest thoughts.Over the years there has been a lot of sad stories regarding the people who lost money as a result of wrong investment plans on cryptocurrency (Bitcoin) we see them channel most of the stories to bitcoin mainly because it is the most popular cryptocurrency they know or the people who told them the stories mentioned bitcoin since they believe people will give them more attention if they talk about the most known cryptocurrency( Bitcoin).1) My question now is this, does it mean people no longer profit in Bitcoin investment but yet there are informations about the increasing number of Bitcoin investors?2)  Why are people not bold enough to use fake social media accounts to talk about their success stories after making profits in Bitcoin investments since they want to maintain privacy?3) Why does it take my family members who abused me when I encountered a loss in my investment to listen to my success story even when they have seen enough evidence?4) Why do people find it difficult to announce here when they recover from their losses but they come out to cry when they have a little loss?.I stand to be corrected if this thread is not suitable in this board but I think we need to be Intentional in what ever thing we post here since it will encourage some people and also discourage some people depending on their level of understanding, this post is the result of my experience and I think I can boldly say my investment journey has been 70% profit, 30% loss, the enemies of Bitcoin did a bad work by helping me to know more about Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5498443",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "May 31, 2024, 03:32:18 PM",
      "body": "The reason most people do not pay attention to success stories of Bitcoin investors is because most people who are truly successful in Bitcoin prefer remaining hidden and will never flaunt their wealth on social media. Majority of people who share their supposed success stories turn out to be scammers looking for who to lure into their schemes. They make it look like when you invest into their project or the projects they are following, you will become rich overnight. People have fallen victims to these kinds of things, hence most people are skeptical about people sharing their success stories, especially online. I understand that sharing your success stories with close friends and relatives that you want to also invest in Bitcoin will motivate them so much, but I think there should be a limit to the level of information you divulge to people to avoid exposing yourself to risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "May 31, 2024, 03:42:05 PM",
      "body": "Simple: it's due to ignorance.Op you will easily believe any other bitcoiners success story about his investment in bitcoin because you have a good knowledge about bitcoin and how the digital currency can be utilized to make profit overtime. But to an ignorant person who have chosen to become completely ignorant about bitcoin or perhaps who had a wrong foot with cryptocurrency by investing his money into one of those many shitcoins out there and lost it all to a dump, it's most likely such persons wouldn't have a reason to believe a success story coming from you about your bitcoin investment. Feel free to do your research, you'll find out that a lot of people that refute bitcoin success stories were either involved in ponzi schemes and shitcoins thereby misconceptualizing it to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "May 31, 2024, 03:44:05 PMLast edit: May 31, 2024, 03:56:39 PM by Promocodeudo",
      "body": "The things is that people are not really interested in your story, they want to see your practical evidence, if you have successfully achieved or profited in Bitcoin, what are the evidence thag shows that you have truly achieved, lets not forget that there still individuals that doesnt believe in Bitcoin because reason best known to them, many success story  about Bitcoin that we see online today are just cooked up by fradulent individuals in other to get the attention of the harmless populace to defraud them of their hard earner money, I maintain my stands Bitcoin achievement is practical not just virtual statement of individuals online, I know that some person may see it as unwillingness  of people to embrace investment opportunity, personally i don't think thats the case here, many people are aware of bitcoin investment already, so success stories don't trigger them anymore because they understand the system perfectly well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "May 31, 2024, 03:45:41 PM",
      "body": "Quote from: Odohu on May 31, 2024, 03:32:18 PM People have fallen victims to these kinds of things, hence most people are skeptical about people sharing their success stories, especially online. There are a lot of fake stories about Bitcoin on social media which people have actually read and believed to be true even when they don't know the people who wrote them, it's not totally bad to talk good about yourself and how you have gained in your investment but it becomes totally bad and privacy abusing if you begin to explain the total amount you have made in your investment or the amount you have in your portfolio and your location. Now my question is this, why have people not harmed some notable investors whom I believed have granted a lot of live interviews and explained how they started and how well they have profited in their various businesses why are they still breathing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "May 31, 2024, 03:45:57 PM",
      "body": "Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM1) My question now is this, does it mean people no longer profit in Bitcoin investment but yet there are informations about the increasing number of Bitcoin investors?That's because each person has a portion or benchmark of success that is appropriate to what he does. We have often heard stories of success, but in essence those who listen are sometimes only motivated. Because Bitcoin success stories and any success stories will be accepted by their respective groups. Then the important point is that telling about someone's success in Bitcoin must be age appropriate, because it would be useless telling it to older people over 60-70 years old.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM2)  Why are people not bold enough to use fake social media accounts to talk about their success stories after making profits in Bitcoin investments since they want to maintain privacy?Validation is a natural human trait that wants its existence and social status in the eyes of others to be appreciated, praised and also used as motivation which ultimately has an impact on self-fame. I think those who are successful in Bitcoin are now famous names, they don't need to be named but we are aware of that. Not everyone really wants to hide privacy regarding personal choices and criteria.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM3) Why does it take my family members who abused me when I encountered a loss in my investment to listen to my success story even when they have seen enough evidence?There's no need to bother proving it with sweet stories, because that will only make you lose time. Just let it go as time goes by, your behavior towards them will prove everything without needing to tell the bitter and sweet story. Other people don't need that kind of thing but they will judge the final result from what they can see from us.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM4) Why do people find it difficult to announce here when they recover from their losses but they come out to cry when they have a little loss?.Want to get empathy, where we feel we need to feel caring from other people and try to share this sadness as if we want to receive attention, advice and special treatment. Even though other people don't actually care about you, they also have their own stories and journeys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alphakilo",
      "created_time": "May 31, 2024, 03:48:20 PM",
      "body": "Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM1) My question now is this, does it mean people no longer profit in Bitcoin investment but yet there are informations about the increasing number of Bitcoin investors?Why we see that there is an increasing number of bitcoin investors can be attributed to the fact that we are seeing a shift in the attitudes and beliefs of the general public towards bitcoin. There is an increase in bitcoin awareness worldwide more than we have ever seen. And some of the things that contributed to this is the bitcoin ETF approval/institutional adoption, then the bitcoin halving that happened earlier,  and generally people just have a positive feeling about bitcoin. They have watched from the sidelines and seen how resilient it is. In 2023 it jumped to around $16k up to $67k as at today. New investors are optimistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 31, 2024, 03:59:10 PM",
      "body": "I think it's a very general statement that people aren't interested in such stories. I, for one, enjoy reading stories of how Bitcoin changed someone's life or was used for a positive impact on someone's life. I've also seen such posts often get merits on the forum, so I'm sure I'm not the only one who likes such stories.As for sad stories, they happen all the time, but I haven't noticed there being more negative experiences now than before, to be honest. And generally, people react stronger to those things that evoke negative emotions and remember negative things better than positive things, which might explain why some can't move on after hearing about losses and recognize one's success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "May 31, 2024, 04:04:58 PM",
      "body": "Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM3) Why does it take my family members who abused me when I encountered a loss in my investment to listen to my success story even when they have seen enough evidence?If you do not have enough evidence to yet prove your success then you do not need to waste your words rather focus more effort so that your evidence will show and then you would not need to talk much to convince those family members who abused you when you first made a loss in your investment.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM4) Why do people find it difficult to announce here when they recover from their losses but they come out to cry when they have a little loss?.Most individuals are sorry collectors; they just like to be in a position where people pity them, which is why they do not keep the story of their losses to themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 31, 2024, 04:37:11 PM",
      "body": "Quote from: GiftedMAN on May 31, 2024, 03:45:41 PMQuote from: Odohu on May 31, 2024, 03:32:18 PM People have fallen victims to these kinds of things, hence most people are skeptical about people sharing their success stories, especially online. There are a lot of fake stories about Bitcoin on social media which people have actually read and believed to be true even when they don't know the people who wrote them, it's not totally bad to talk good about yourself and how you have gained in your investment but it becomes totally bad and privacy abusing if you begin to explain the total amount you have made in your investment or the amount you have in your portfolio and your location. Now my question is this, why have people not harmed some notable investors whom I believed have granted a lot of live interviews and explained how they started and how well they have profited in their various businesses why are they still breathing?I have to agree with you on the fact that most stories about Bitcoin are fake and transfer aggression from wrong cryptocurrency investors who may have made their investment decision out of the lack of knowledge of what cryptocurrency and Bitcoin is all about and the best way to invest in them, most times, just as you rightly said, Bitcoin is being blamed because Bitcoin is the most popular crypto in the market so regardless of they invested in some shitcoins or ponzi when they get scammed the become aggressive with Bitcoin.What I advice us as Bitcoin believer is not to try to defend anything those set of forks put up against Bitcoin, but rather try to enlightened them on the wrong approach to Bitcoin investment, and how to avoid anything that promises quick returns such investment normally ends in sad stories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Salahmu",
      "created_time": "May 31, 2024, 04:41:39 PM",
      "body": "The thing is that for most of the people who doesn't really understand what cryptocurrency is all about they normally channel all their frustration on Bitcoin when they venture into wrong investment without knowing that their is different between Bitcoin and other cryptos and sometimes because of how popular Bitcoin is most people could possibly use it as an avenue to lure people into investing on a wrong platform or crypto thinking that they are actually investing on Bitcoin so perhaps when it fails they blame Bitcoin or saying all sorts of things things about Bitcoin. However in terms of sharing success stories of Bitcoin by creating a fake social media may not actually be advisable because social media has grown to the extent at which most people believe that almost all investment success stories are fake, so for me I believe sharing a success stories on social media is actually another way of scaring people away, however sharing our success stories with even friends about our Bitcoin investment may not actually be advisable also because we could be putting ourselves in a harms way by showing people our achievement, and secondly one thing we should also understand about Bitcoin investment is that if someone is very successful on there investment doesn't mean every other person could also be successful because each investors has their method or pattern at which they would loved to use because most people prefer trading and their is a higher chance of being success and their is also more higher chance of losing everything, while majority of the successful investors comes from long term investment because with long term investment their is a higher chance for becoming success on Bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "May 31, 2024, 04:53:02 PM",
      "body": "Seriously those who are successful in Bitcoin neither wants to showoff nor they want to be bothered about creating fake social media accounts to share their success story and those stories which you see on social media may or may not be true, But if people shares their true story then those who have lost the investment will realise where did they go wrong it would indeed be helpful but successful people don't flaunt about their success stories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "May 31, 2024, 04:57:26 PM",
      "body": "Personally I think people around the world pay more attention to success stories than failed or unsuccessful stories and not the other way round. if you observe carefully you will find only a few sad or failed stories in the internet not because only few had failed attempts but who will want to post to discuss their failures when others are doing it right? I guess only a very minor number of people, because what triggers people's interest is success. Successful if very visible, so most people don't even tell the testimonies only the changes in them tells the story especially when people knows they are into bitcoin investment. Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM3) Why does it take my family members who abused me when I encountered a loss in my investment to listen to my success story even when they have seen enough evidence?4) Why do people find it difficult to announce here when they recover from their losses but they come out to cry when they have a little loss?.3. Do you have to tell anyone that you're successful?  for me No! Successful announces itself, when you see successful in any area of life they don't need to come tell you that they are successful, so you too don't need to tell anyone that you're successful, whether your family believes you or not that shouldn't be your problem, what you shoukd be concerned about is yourself and not what they think about you. Hence you don't need validation from your family. 4. Traders have to characteristics but I think I haven't seen any bitcoin trader cry out because he or she lost, most people I see are not trading bitcoin but other assets maybe that is because I'm more focused on saving up my bitcoin than trading them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "May 31, 2024, 05:09:39 PM",
      "body": "BTC is not a new cryptocurrency and its growth is organic, so if you are not an early adopter who got a lot of BTC in the early days or someone who can afford to buy a lot of coins, then you cannot really make 'crazy profit' if you understand what i am saying. 'Success stories' is popular amongst shitcoins, a common situation is when someone buys so many shitcoins and one of them pumps so high and the persons makes returns which they withdrew before it dumped. You hear a lot of such stories with people who 'gamble' with altcoins.I believe with BTC things are much different, however, you don't even need to tell anyone a success story in a discussion about BTC, it has enough use cases you can talk about and there are many reasons to give people on why they should use BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 31, 2024, 05:23:14 PM",
      "body": "Quote from: GiftedMAN on May 31, 2024, 03:45:41 PMQuote from: Odohu on May 31, 2024, 03:32:18 PM People have fallen victims to these kinds of things, hence most people are skeptical about people sharing their success stories, especially online. There are a lot of fake stories about Bitcoin on social media which people have actually read and believed to be true even when they don't know the people who wrote them, it's not totally bad to talk good about yourself and how you have gained in your investment but it becomes totally bad and privacy abusing if you begin to explain the total amount you have made in your investment or the amount you have in your portfolio and your location.  Now my question is this, why have people not harmed some notable investors whom I believed have granted a lot of live interviews and explained how they started and how well they have profited in their various businesses why are they still breathing?They do attack them and it is the one that goes viral that we will hear or see on social medias and on air. I could remember a forum member wrote a thread that a bitcoin trader that flaunts his wealth on social media was attacked and robbed of his funds, but he foolishly came online again to continue his showoff. The thing is that people don't need to hear of bitcoin success stories anymore for they are seeing the wave that bitcoin is paving as the government are talking about it based on regulation and the rest, all these is enough for people to know that bitcoin is a good investment to invest in and make profit. I think those that tell fake stories of their success in social media are influencers who is advertising an exchange and making it look as if trading is simple. Long-term investors don't tell you about their success in hodling because they don't want anybody to know how rich they are in bitcoin, but lousy traders are the ones making noise even when they are running at loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "May 31, 2024, 05:41:30 PM",
      "body": "Quote from: Frankolala on May 31, 2024, 05:23:14 PMQuote from: GiftedMAN on May 31, 2024, 03:45:41 PMQuote from: Odohu on May 31, 2024, 03:32:18 PM People have fallen victims to these kinds of things, hence most people are skeptical about people sharing their success stories, especially online. There are a lot of fake stories about Bitcoin on social media which people have actually read and believed to be true even when they don't know the people who wrote them, it's not totally bad to talk good about yourself and how you have gained in your investment but it becomes totally bad and privacy abusing if you begin to explain the total amount you have made in your investment or the amount you have in your portfolio and your location.  Now my question is this, why have people not harmed some notable investors whom I believed have granted a lot of live interviews and explained how they started and how well they have profited in their various businesses why are they still breathing?They do attack them and it is the one that goes viral that we will hear or see on social medias and on air. I could remember a forum member wrote a thread that a bitcoin trader that flaunts his wealth on social media was attacked and robbed of his funds, but he foolishly came online again to continue his showoff. I didn't come across the thread but I think it is totally wrong for someone to flaunt his wealth online I believe there are better ways to talk about your success story  without calling names or figures, the investments you have alone can do the advertisement for you but in the case where I talked about my family members, they deserve to listen to me because they motivated me to get better and better every day due to the way they talk about cryto inveators and sad stories.Personally, I think for the person to come online again after be robbed, nothing really happened to his funds or he's into something else while people felt he was a crypto investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "May 31, 2024, 06:27:33 PM",
      "body": "Let me go bit by bit with the best I can go about this.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM1) My question now is this, does it mean people no longer profit in Bitcoin investment but yet there are informations about the increasing number of Bitcoin investors? Bitcoin is a decentralized financial holding and most government commissions aren't in support of it so the restrictions of governments over the adoption of the bitcoin intends to insight distrusts and discouragement to the masses but the masses knowing the true potentials of bitcoin has been ingnoring the criticisms on bitcoin. So Op, you must understand the loudness of criticisms that it may not be so effective but the rumours could travel far.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM2)  Why are people not bold enough to use fake social media accounts to talk about their success stories after making profits in Bitcoin investments since they want to maintain privacy?I don't think if there'd be necessary reason of an investors trying to stay anonymous with their prosperities on bitcoin coming in to social media to disclose about their success in their Bitcoin investment. Infact, using a fake identity to make such disclosure would foster bitcoin a scheme of hyping which may be translated as fraudulence scheme to the audience. Bitcoin doesn't require such an advert because it's a reputable financial technology. Besides if bitcoin had made you rich that's to your Portfolio so no need taking it to the public awareness. Investors vibes is that keep to grow on your income while they can't determine your worth for security purposes Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM3) Why does it take my family members who abused me when I encountered a loss in my investment to listen to my success story even when they have seen enough evidence?Bitcoin is a kind of investment that only those who're into it understands volatility nature of the coin.  Only family members involving in real stock trading may understand a bit by relating the volatilities of bitcoin to inflations and deflations being encountered in the economy system . So don't force yourself just to let people believe your experiences in your investmentSo don't let anyone feed with bad energies towards your success ventures.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM4) Why do people find it difficult to announce here when they recover from their losses but they come out to cry when they have a little loss? Every concious Investors always learn from sad experiences and wouldn't keep calm to learn about how they could avoid the losses for further occurance. We're essentially here to learn about bitcoin and have discussions towards what'd be beneficial to us.Bitcoin investments isn't a game of lucky projects as gambling or the MemeCoins where investors or participants comes to announce their lucky opportunities of them being rewarded where others failed.  This is a genuine project and we're more concerned to avoid looses and grow on our portfolio because profits are certain as long we keep holding and understanding the markets nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "May 31, 2024, 06:42:15 PM",
      "body": "Quote from: GiftedMAN on May 31, 2024, 03:21:36 PMPersonally, I don't think I have the right answers to this question otherwise I wouldn't have brought it up here for members of the forum tohave a discussion about it but I hope you don't mind to give your honest thoughts.Over the years there has been a lot of sad stories regarding the people who lost money as a result of wrong investment plans on cryptocurrency (Bitcoin) we see them channel most of the stories to bitcoin mainly because it is the most popular cryptocurrency they know or the people who told them the stories mentioned bitcoin since they believe people will give them more attention if they talk about the most known cryptocurrency( Bitcoin).1) My question now is this, does it mean people no longer profit in Bitcoin investment but yet there are informations about the increasing number of Bitcoin investors?2)  Why are people not bold enough to use fake social media accounts to talk about their success stories after making profits in Bitcoin investments since they want to maintain privacy?3) Why does it take my family members who abused me when I encountered a loss in my investment to listen to my success story even when they have seen enough evidence?4) Why do people find it difficult to announce here when they recover from their losses but they come out to cry when they have a little loss?.I stand to be corrected if this thread is not suitable in this board but I think we need to be Intentional in what ever thing we post here since it will encourage some people and also discourage some people depending on their level of understanding, this post is the result of my experience and I think I can boldly say my investment journey has been 70% profit, 30% loss, the enemies of Bitcoin did a bad work by helping me to know more about Bitcoin.From then until now, people prefer to pay attention to the failures that happen to people because most people today, especially on social media platforms where a little problem or even a serious problem is immediately posted on social media like Facebook.It's rare to have an interest in other people's success stories because there are just as many people who interfere in other people's lives instead of their own being interfered with. Because that's the mindset of others, they're happier with that lifestyle, but I don't agree with it at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "May 31, 2024, 07:08:20 PMLast edit: May 31, 2024, 07:32:51 PM by aoluain",
      "body": "Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM1) My question now is this, does it mean people no longer profit in Bitcoin investment but yet there are informations about the increasing number of Bitcoin investors?There are of course people who are in profit from Bitcoin investment. Some \"on paper\" as in they have not sold Bitcoin. Others are after HODL'ing Bitcoin for a number of years and who have sold recently.The amount of Bitcoin investors is growing because Bitcoin is an obvious musthave top performing asset....which will yield profits in time.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM2)  Why are people not bold enough to use fake social media accounts to talk about their success stories after making profits in Bitcoin investments since they want to maintain privacy?Maintain privacy also ties into the principal of not seeing the need to publicise yourprofits. If I want to go to the hassle of shouting about my wealth through a fake accountI could easily falsify it by X50.Quote from: GiftedMAN on May 31, 2024, 03:21:36 PM3) Why does it take my family members who abused me when I encountered a loss in my investment to listen to my success story even when they have seen enough evidence?Maybe they expect you will make a loss againQuote from: GiftedMAN on May 31, 2024, 03:21:36 PM4) Why do people find it difficult to announce here when they recover from their losses but they come out to cry when they have a little loss?.Maybe those people dont recover their losses",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "May 31, 2024, 07:14:03 PM",
      "body": "Quote from: Odohu on May 31, 2024, 03:32:18 PMI understand that sharing your success stories with close friends and relatives that you want to also invest in Bitcoin will motivate them so much, but I think there should be a limit to the level of information you divulge to people to avoid exposing yourself to risk. That's the truth. Most times the people who we find on line sharing their success stories are those who probably are wanting to get potential newbies and scam them. Not that there aren't genuine testifies out there to share their stories with others, but who do we believe and how do we know they are telling the truth. These people design Bitcoin in a way to make it sound easy and people can just make quick profits like it's magic money. Imagine telling us how you make 100k from investing in Bitcoin in one day. I dont think that's a success story. It's a means to lure people into scam and total loss of funds. We can share our stories and we can also listen to those of others but we have to be careful of what we listen to, and avoid be told lies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}