{
  "id": "topic_5432045",
  "title": "Cookdata",
  "author": "Cookdata",
  "created_time": "December 27, 2022, 04:26:44 PM",
  "content": "What happened: ThermoFinance Plagiarized whitepaper and attempted stealing of conceptSuspect's Profile: Silent SamSuspect's Website: https://thermofinance.com/ | archivedSuspect's Whitepaper: https://thermofinance.com/papers/WHITE-PAPER.pdf | archivedSuspect's Bounty Page: https://bitcointalk.org/index.php?topic=5431395.0Plagiarized Source: https://betafinance.org/BetaWhitepaperAndDisclaimer.pdfSupport/oppose flag: https://bitcointalk.org/index.php?action=trust;flag=3075Quote from: https://www.whois.com/whois/thermofinance.comDomain: thermofinance.comRegistrar: NameCheap, Inc.Registered On:2022-10-25Expires On: 2024-10-25Updated On: 2022-11-13Plagiarized contents:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432045",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "December 27, 2022, 04:55:26 PM",
      "body": "On top of plagiarized whitepaper and overall look of a worst no effort 2017 type of ICO, they also used stock photos for their team members. I just checked one (so called \"Robert Sover\" , but since he is fake it is same to assume that they sued stock photos for others as well. Anyway, good catch OP!It doesn't look like that person who started their bounty thread is their team member and instead was probably just hired, but he should have known better and check it out before publishing as this isn't his first bounty campaign. Anyway, I left him negative feedback (and sent him a PM to answer these allegations) so hopefully that makes him to lock all these threads that he opened it for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 27, 2022, 08:43:51 PM",
      "body": "Nice catchProjects that plagiarize white papers have nothing to offer except try to scam people. I hope the bounty manager sees the scam accusation and responds postively by deleting and locking the thread. Supported and left a negative tag as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 27, 2022, 09:26:11 PM",
      "body": "Quote from: Rikafip on December 27, 2022, 04:55:26 PMOn top of plagiarized whitepaper and overall look of a worst no effort 2017 type of ICO, they also used stock photos for their team members. I just checked one (so called \"Robert Sover\" , but since he is fake it is same to assume that they sued stock photos for others as well. Anyway, good catch OP!Yes, you're right. It's clear that there are serious red flags with this operation, as I also discovered that all members of the team are using fake profiles and stock photos. This is highly suspect and it seems clear to me that this is a scam. And the fact that they went through the trouble of creating all these fake profiles just adds to their credibility. I'm sure this is a totally legitimate and trustworthy operation.  Great work, OP. The account has been tagged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "December 27, 2022, 10:39:05 PM",
      "body": "They have a bounty campaign right now[BOUNTY]Thermo Finance-Bounty Campaign Total Budget-2Millon Token Worth 200K USDI hope those promoting this project will stop promoting this project I'm sure they will be made aware of this after they see the red tag of their manager.And the manager is also looking for community managers for 11 countries Hiring Community Manager.They are on good momentum until they get busted, this is really a good catch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 28, 2022, 11:16:39 AM",
      "body": "Quote from: fortunecrypto on December 27, 2022, 10:39:05 PMThey have a bounty campaign right now[BOUNTY]Thermo Finance-Bounty Campaign Total Budget-2Millon Token Worth 200K USDYeah we know, OP mentioned it in the first post.Quote from: fortunecrypto on December 27, 2022, 10:39:05 PMI hope those promoting this project will stop promoting this project I'm sure they will be made aware of this after they see the red tag of their manager.The only ones who may stop are higher ranking members that are part of signature campaign, and only because I sent them PM explaining what will happen if they don't remove it. Other than that, I am sure that majority of other bounty hunters don't really care whether something is scam or not as long as they get their tokens. In this case they probably won't get anything and then they will come here to cry how they did \"hard work\" for nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "December 28, 2022, 12:05:41 PM",
      "body": "Quote from: fortunecrypto on December 27, 2022, 10:39:05 PMAnd the manager is also looking for community managers for 11 countries Hiring Community Manager.They were here to make money, even without paying anything lol. They were hiring community manager by offering their token, don't know who would accept that job offer. Nice attempt lol.Quote from: Rikafip on December 28, 2022, 11:16:39 AMI am sure that majority of other bounty hunters don't really care whether something is scam or not as long as they get their tokens. In this case they probably won't get anything and then they will come here to cry how they did \"hard work\" for nothing.As usual lol. I have managed only a few bounty campaigns so far, have paid reward for campaigns already. For the other one, I can't contact with project owner for the last few weeks, don't know why suddenly he got inactive but I'm pretty much sure that he will pay the hunters. But hunters can't have the patience. Threaten me to create thread in reputation. They will participate in every campaign but they can't do a little home work even.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "December 28, 2022, 02:01:58 PM",
      "body": "If a team is too lazy to construct a whitepaper for their project and ended up copying other project's whitepaper, such project can not be trusted by the community because they naturally have nothing to offer other than to scam and disappear. They have no zeal for what they claimed to be their own originality. Nice investigation OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "December 28, 2022, 02:18:04 PM",
      "body": "Quote from: Little Mouse on December 28, 2022, 12:05:41 PMQuote from: fortunecrypto on December 27, 2022, 10:39:05 PMAnd the manager is also looking for community managers for 11 countries Hiring Community Manager.They were here to make money, even without paying anything lol. They were hiring community manager by offering their token, don't know who would accept that job offer. Nice attempt lol.You'll be surprised to know that many so-called community managers will take it, I've seen how people apply to be their community managers on telegram in exchange for the project's token, people will do this in the hope that the token they are going to receive will have value in the market, these community managers are dime a dozen now there are very few new projects and there are so many bounty hunters and managers, the community of bounty hunters is overcrowded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 28, 2022, 03:09:00 PM",
      "body": "Flag supported from my end, a copied whitepaper and stock images equal to a scam project.The social media pages of the guy named \"Troy Barmore\" is linked to the twitter page of \"Andrew Belko\" but using the former's name and has just signed up in Nov' 22. Similar mixup of names and images on \"Nancy Ochs\" and \"Erin fexy\" twitter page. All of these accounts have be recently made.On a scale of 0-10 as per how convincing these guys are, I would give them a negative ten.Quote from: aioc on December 28, 2022, 02:18:04 PM..the community of bounty hunters is overcrowded. They still dont get it, that they need to move on from hunting shittokens of zero value/get scammed by running after vaporware/made to work like free labor in the promise of fake money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "December 28, 2022, 05:04:17 PM",
      "body": "Quote from: Yawa2020 on December 28, 2022, 02:01:58 PMIf a team is too lazy to construct a whitepaper for their project and ended up copying other project's whitepaper, such project can not be trusted by the community because they naturally have nothing to offer other than to scam and disappear. They have no zeal for what they claimed to be their own originality. Nice investigation OP. Their first goal is to somehow create and launch a project, and run away with money from crypto investors. It is not right to expect anything original from them where their intentions are towards evil. As they want to prepare everything quickly and launch the project, they don't have much time. And they don't have the talent to create original content. OP did a good job exposing this project which saved many investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 28, 2022, 06:06:09 PM",
      "body": "Our Sam remains silent, he was online earlier today and certainly was aware of this current situation, but didn't choose to say anything. As I can't trust a BM and CM who didn't do the slightest DD, I supported the flag and added a tag as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 28, 2022, 09:21:26 PM",
      "body": "Quote from: holydarkness on December 28, 2022, 06:06:09 PMOur Sam remains silent, he was online earlier today and certainly was aware of this current situation, but didn't choose to say anything.Yesterday I sent him PM as well so there's no chance that he missed all that. My guess is that he decided that money he got for promoting them on bitcointalk is worth more than his Member account so he decided to just continue with it.Regarding those who joined their signature bounty campaign, last night I contacted all of them, and from what I can see only 3 still have their sig on but as expected those who are doing social media part of the campaign keep joining in, not caring about flag & tags.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 28, 2022, 10:09:29 PM",
      "body": "Quote from: holydarkness on December 28, 2022, 06:06:09 PMOur Sam remains silent, he was online earlier today and certainly was aware of this current situation, but didn't choose to say anything. As I can't trust a BM and CM who didn't do the slightest DD, I supported the flag and added a tag as well.Could be that he already got half or the whole of his payment and decided to keep it there's no disclaimer either on his campaign thread that makes everyone thinks that he is part of the team, checking on the campaign thread there are still members applying on the campaign and there are still members reporting on the thread but what we're sure of it will not get investors coming from here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "January 06, 2023, 04:28:46 PM",
      "body": "They have started the bounty thread again by a new account GusfallLink to new thread - https://bitcointalk.org/index.php?topic=5433271This account seems to have been active in 2017 in Indonesian section, maybe our Indonesian friends can give us some insight? After that bounty hunting in 2017 and then one post in 2018 and suddenly posts a bounty thread today.I can bet that the account was bought just for this, while the older bounty manager continues to remain silent, while just accepting their mistake would reduce their punishment to a much easier form.Note : Slient Sam merited Gusfall on this \"very knowledgeable\" post.https://bitcointalk.org/index.php?topic=5411474.msg60873940#msg60873940",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "January 06, 2023, 05:27:38 PMLast edit: January 06, 2023, 05:52:18 PM by Rikafip",
      "body": "Quote from: TheUltraElite on January 06, 2023, 04:28:46 PMThey have started the bounty thread again by a new account GusfallAn amateur hour. They obviously know nothing about this forum thinking that they will avoid getting tagged if they used new account. Anyway, I tagged him and it would be a good idea to flag him as well.I see that some high ranking accounts joined signature campaign. I guess I'll have to send PMs again, to warn them of the consequen ces of their actions.edit: flagged him as well in order to warn the newbies joining that campaign https://bitcointalk.org/index.php?action=trust;flag=3078",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}