{
  "id": "topic_5411301",
  "title": "Jemzx00",
  "author": "Jemzx00",
  "created_time": "August 26, 2022, 10:29:07 AMLast edit: September 16, 2022, 03:23:29 PM by Jemzx00",
  "content": "Ayon sa article na nilabas ng Inquirer, ang unang Banko sa Pilipinas na nag-offer ng mobile cryptocurrencies trading ay Unionbank. QuoteUnion Bank of the Philippines (UnionBank) is poised to become the first universal bank in the country to offer virtual asset exchange services through its mobile banking application.This marks another major milestone in the bank’s efforts towards future-proofing while creating customer-centric solutions powered by technology and innovation. The recently unveiled feature is part of UnionBank’s “Tech-Up Pilipinas” advocacy, which aims to promote digital literacy among Filipinos, in line with its goal of enabling inclusive prosperity in the country.Unfortunately, hindi pa sya available para sa lahat na nag roll out lang sa sila sa limited na mga UnionBank users. Kahit ako tinignan ko kung available sa akin kaso nga lang hindi ako kasama sa na-rolled out na accounts.  Anyways, kasama rin naman sa plano nila ang massive roll out sa susunod na mga buwan.Makikita rin natin sa ibabang picture na nabanggit sa article ay ang mismong screenshot sa application kung papaano ang trading sa kanilang mobile application. Simple lang yung trading process nya tulad ng sa coins.ph application lang din. Also, makikita rin natin sa dulo ng article ang plano ng Unionbank sa pagpasok rin sa Metaverse. QuoteThe Bank is hoping to launch the country’s first-ever Metaverse Center of Excellence sometime in the next few months.“By launching this new feature, we are hitting two birds with one stone —future-proofing the Bank and satisfying the needs of customers who use cryptocurrencies,” Henry Aguda, Senior Executive Vice President Chief Technology and Operations Officer and Chief Transformation Officer said. “This is one of the things we are working on as we clear our path towards the metaverse.”Ano sa tingin nyo guys ang update na ito mula sa Unionbank? Sa tingin nyo ba, magagamit nyo rin yung \"Cryptocurrency Trading\" na ito sa mobile application ng Unionbank?  Source & Reference:https://business.inquirer.net/358856/unionbank-becomes-first-philippine-bank-to-offer-mobile-cryptocurrency-trading",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411301",
  "comments": [
    {
      "author": "blockman",
      "created_time": "August 26, 2022, 01:04:28 PM",
      "body": "Parang kay Maya yung trading niya. Sana itong dalawang bank na ito ay maging open sa deposit at withdrawal ng actual na supported cryptocurrencies nila.Magiging blow yun sa kanila kapag ganun ang nangyari kasi mas dadaming mga kababayan natin ang magkaka-access sa paghohold at pago-own ng cryptocurrencies. At dadami ang matututo na sila mismo ang maghohold kesa iasa nila sa third party. Pero overall, good news yung mga ganito para sa atin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 26, 2022, 01:26:14 PM",
      "body": "Quote from: blockman on August 26, 2022, 01:04:28 PMParang kay Maya yung trading niya. Sana itong dalawang bank na ito ay maging open sa deposit at withdrawal ng actual na supported cryptocurrencies nila.Magiging blow yun sa kanila kapag ganun ang nangyari kasi mas dadaming mga kababayan natin ang magkaka-access sa paghohold at pago-own ng cryptocurrencies. At dadami ang matututo na sila mismo ang maghohold kesa iasa nila sa third party. Pero overall, good news yung mga ganito para sa atin.Sa pagkakaalala ko. Matagal ng nagpapakita ng interest ang Unionbank sa pagintroduce ng crypto sa service nila. Ang alam ko ay mayroon na silang sariling stablecoin na $PHX na gagamitin sa sarili nilang blochchain pero mukhang wala pa dn silang mula sa BSP para mag offer ng crypto services dahil sa risk involved dulot ng volatility. Hindi ko lang alam ano na ang stand ng government sa crypto pero ang huli kong balita ay SEC mismo ang nagbibigay babala sa mga consumer na wag mag invest sa crypto. Hindi ko alam kung paano ito magagawa ng Unionbank pero sana makapag open sila ng sariling exchange.https://www.bworldonline.com/editors-picks/2019/07/26/244560/unionbank-launches-stablecoin-phx-for-use-on-its-blockchain-platform/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 26, 2022, 03:02:36 PM",
      "body": "Quote from: blockman on August 26, 2022, 01:04:28 PMParang kay Maya yung trading niya. Sana itong dalawang bank na ito ay maging open sa deposit at withdrawal ng actual na supported cryptocurrencies nila.Magiging blow yun sa kanila kapag ganun ang nangyari kasi mas dadaming mga kababayan natin ang magkaka-access sa paghohold at pago-own ng cryptocurrencies. At dadami ang matututo na sila mismo ang maghohold kesa iasa nila sa third party. Pero overall, good news yung mga ganito para sa atin.Based dun sa given na screenshot sa Unionbank application, marami talaga syang similarities sa ibang local trading platform like coins.ph at maya. Sobrang hoping ako dito sa Unionbank dahil sila yung nakikita ko na crypto friendly na bank at may mga plano sa crypto mismo. Pero to be honest, nakukulangan ako sa crypto trading nila dahil literal na buy and sell lang sya. Quote from: AbuBhakar on August 26, 2022, 01:26:14 PMSa pagkakaalala ko. Matagal ng nagpapakita ng interest ang Unionbank sa pagintroduce ng crypto sa service nila. Yup, tama ka dyan, sobrang interested sila na pumasok sa crypto industry dati pa. Tsaka, Isa rin ito sa dahilan kung bakit ako gumawa ng UB account dahil crypto friendly sila. Wala rin ako masyadong narereceive na issue kapag nagcashout ako through UB from crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "August 26, 2022, 06:04:56 PM",
      "body": "Andami kong nakikita sa facebook post na anti-cryptocurrency na ang Unionbank. Most of them is pinapapull out na lahat ng funds ni Unionbank once ni reason nila na galing sa crypto yung pera. This came from my facebook crypto friends and 3-4 people na ata yung kilala ko na same case sila kaya medyo nag iingat ako gumamit ng Unionbank ngayon for the reason na ma close ang account ko due to my crypto transactions. This is why I doubt Unionbank sa kung ano magiging take nila sa crypto especially ngayon na about sa post na mag ooffer ng crypto trading ang Unionbank. Sila ang pinaka una na crypto friendly bank sa bansa natin and nag iba yung tingin ko sakanila due to closure of account of my crypto friends. Sana maging open padin sila sa crypto in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 26, 2022, 06:23:16 PM",
      "body": "Quote from: abel1337 on August 26, 2022, 06:04:56 PMAndami kong nakikita sa facebook post na anti-cryptocurrency na ang Unionbank. Most of them is pinapapull out na lahat ng funds ni Unionbank once ni reason nila na galing sa crypto yung pera. This came from my facebook crypto friends and 3-4 people na ata yung kilala ko na same case sila kaya medyo nag iingat ako gumamit ng Unionbank ngayon for the reason na ma close ang account ko due to my crypto transactions. This is why I doubt Unionbank sa kung ano magiging take nila sa crypto especially ngayon na about sa post na mag ooffer ng crypto trading ang Unionbank. Sila ang pinaka una na crypto friendly bank sa bansa natin and nag iba yung tingin ko sakanila due to closure of account of my crypto friends. Sana maging open padin sila sa crypto in the future. I agree sa point mo at marami na rin akong narinig at kilalang nagkaproblema sa kanilang Unionbank account nila about crypto transactions. Halos lahat ng issue na narinig ko about Unionbank ay about crypto at P2P transactions from Binance. Pero, I think hindi lang naman sa Unionbank may issue about crypto transactions dahil may mga kilala ako na gamit ay BDO at BPI bank kaso nagkaproblema rin sila. Hopefully, Magbago at mabigyan ng chance muli yung mga users ng mga bankong ito lalo na ang Unionbank since crypto friendly financial institutions sila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "August 26, 2022, 08:58:22 PM",
      "body": "Quote from: abel1337 on August 26, 2022, 06:04:56 PMAndami kong nakikita sa facebook post na anti-cryptocurrency na ang Unionbank. Most of them is pinapapull out na lahat ng funds ni Unionbank once ni reason nila na galing sa crypto yung pera. This came from my facebook crypto friends and 3-4 people na ata yung kilala ko na same case sila kaya medyo nag iingat ako gumamit ng Unionbank ngayon for the reason na ma close ang account ko due to my crypto transactions. This is why I doubt Unionbank sa kung ano magiging take nila sa crypto especially ngayon na about sa post na mag ooffer ng crypto trading ang Unionbank. Sila ang pinaka una na crypto friendly bank sa bansa natin and nag iba yung tingin ko sakanila due to closure of account of my crypto friends. Sana maging open padin sila sa crypto in the future. I also have my close friend with the same case, though ang pinagawa sa kanila is to withdraw all their money and close their account, while yung iba naman is they are forced to create business account kase mas ok daw ito. Kung ganito lang den sa Unionbank, paano nalang ito magiging crypto friendly? Unionbank nangunguna talaga ito sa crypto updates pero yun nga recently marame ang nagkakaroon ng problem so I think better for them to make things clear kung ano ba talaga ang regulations. Well, baka update lang nila ito sa security nila pero hopefully, mas maging friendly sila in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "August 26, 2022, 10:24:20 PM",
      "body": "Quote from: Johnyz on August 26, 2022, 08:58:22 PMI also have my close friend with the same case, though ang pinagawa sa kanila is to withdraw all their money and close their account, while yung iba naman is they are forced to create business account kase mas ok daw ito. Kung ganito lang den sa Unionbank, paano nalang ito magiging crypto friendly? Unionbank nangunguna talaga ito sa crypto updates pero yun nga recently marame ang nagkakaroon ng problem so I think better for them to make things clear kung ano ba talaga ang regulations. Well, baka update lang nila ito sa security nila pero hopefully, mas maging friendly sila in the future.Totoo ito, marame akong kakilala na nagpullout ng pera sa Unionbank because of this issue though humihingi lang naman ng other supporting documents pero ang hassle lang talaga especially if full time crypto ang ginagawa mo and ang source of income mo, no choice kundi iwithdraw. Good update naman ito with regards to adoption, and sana maging fair then kase lagi nalang sila humihingi ng additional documents kahit na nakapagpasa ka naman na same thing with other crypto wallet. Kung magiging ok ito, panigurado mas lalo pang lalaki si Unionbank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "August 26, 2022, 10:36:53 PM",
      "body": "Unionbank is very innovative pero sa tingin ko, I won’t use this as my trading portfolio, siguro pag cash-in or cash out pwede pero kung trading, I think real exchanges are still better and probably kapag naging live na ito sa Unionbank, baka mataas lang den ang fees like the other wallet. Kung gusto mo lang naman mag hold, ok na itong Unionbank yun nga lang di paren talaga advisabel kase may mga cases talaga with regards to regulations na patuloy hinihingian ng mga supporting documents, at sana maadress ito ng Unionbank kase alam naman naten, we all want privacy and that’s the purpose of crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "August 26, 2022, 10:45:24 PM",
      "body": "[quote author=Jemzx00 link=topic=5411301.msg60826040#msg60826040 date=AtAno sa tingin nyo guys ang update na ito mula sa Unionbank? Sa tingin nyo ba, magagamit nyo rin yung \"Cryptocurrency Trading\" na ito sa mobile application ng Unionbank?  [/quote]Buy and sell yes, pero dipende paren kung gaano ka strict yung KYC nila at syempre kung ok at fair naman ba ang kanilang fees and conversion rate.Sobrang active talaga ni Unionbank sa crypto adoption, although my mga recent problem nga with regards to KYC update pero sa tingin ko ay normal lang naman ito just like the other coin na almost every year ay humihingi ng additional KYC. Unionbank leads the local bank to adopt cryptocurrency, they are ahead and I believe alam talaga nila ang ginagawa nila and that’s good for everybody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "agustina2",
      "created_time": "August 26, 2022, 11:22:37 PM",
      "body": "Since before, talagang kilala na ang UnionBank dito sa atin bilang pinaka-crypto friendly na banko.Paanong trading kaya ang gagawin nila, against sa kanila or iyong usual trading platform gaya ng coins.pro.Quote from: Scripture on August 26, 2022, 10:36:53 PMUnionbank is very innovative pero sa tingin ko, I won’t use this as my trading portfolio, siguro pag cash-in or cash out pwede pero kung trading, I think real exchanges are still better and probably kapag naging live na ito sa Unionbank, baka mataas lang den ang fees like the other wallet. Kung gusto mo lang naman mag hold, ok na itong Unionbank yun nga lang di paren talaga advisabel kase may mga cases talaga with regards to regulations na patuloy hinihingian ng mga supporting documents, at sana maadress ito ng Unionbank kase alam naman naten, we all want privacy and that’s the purpose of crypto.Dapat understood na yang ganyang scenario kasi banko yan e. Need nila sumunod sa regulations ni BSP.Kung privacy ang habol mo, just simply use non-custodial wallet. Walang privacy2x sa mga centralized exchanges especially sa banko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 27, 2022, 07:10:14 AM",
      "body": "Quote from: Jemzx00 on August 26, 2022, 03:02:36 PMQuote from: blockman on August 26, 2022, 01:04:28 PMParang kay Maya yung trading niya. Sana itong dalawang bank na ito ay maging open sa deposit at withdrawal ng actual na supported cryptocurrencies nila.Magiging blow yun sa kanila kapag ganun ang nangyari kasi mas dadaming mga kababayan natin ang magkaka-access sa paghohold at pago-own ng cryptocurrencies. At dadami ang matututo na sila mismo ang maghohold kesa iasa nila sa third party. Pero overall, good news yung mga ganito para sa atin.Based dun sa given na screenshot sa Unionbank application, marami talaga syang similarities sa ibang local trading platform like coins.ph at maya. Sobrang hoping ako dito sa Unionbank dahil sila yung nakikita ko na crypto friendly na bank at may mga plano sa crypto mismo. Pero to be honest, nakukulangan ako sa crypto trading nila dahil literal na buy and sell lang sya. Oo ganyan talaga siguro parang beta phase sila tulad ni Maya. Pero optimistic at hopeful tayo na magiging ok yan at magkakaroon ng actual trading, withdrawals at deposits sa susunod na mga updates nila. Si gcash nalang hinihintay natin.Quote from: AbuBhakar on August 26, 2022, 01:26:14 PMQuote from: blockman on August 26, 2022, 01:04:28 PMParang kay Maya yung trading niya. Sana itong dalawang bank na ito ay maging open sa deposit at withdrawal ng actual na supported cryptocurrencies nila.Magiging blow yun sa kanila kapag ganun ang nangyari kasi mas dadaming mga kababayan natin ang magkaka-access sa paghohold at pago-own ng cryptocurrencies. At dadami ang matututo na sila mismo ang maghohold kesa iasa nila sa third party. Pero overall, good news yung mga ganito para sa atin.Sa pagkakaalala ko. Matagal ng nagpapakita ng interest ang Unionbank sa pagintroduce ng crypto sa service nila. Ang alam ko ay mayroon na silang sariling stablecoin na $PHX na gagamitin sa sarili nilang blochchain pero mukhang wala pa dn silang mula sa BSP para mag offer ng crypto services dahil sa risk involved dulot ng volatility. Hindi ko lang alam ano na ang stand ng government sa crypto pero ang huli kong balita ay SEC mismo ang nagbibigay babala sa mga consumer na wag mag invest sa crypto. Hindi ko alam kung paano ito magagawa ng Unionbank pero sana makapag open sila ng sariling exchange.https://www.bworldonline.com/editors-picks/2019/07/26/244560/unionbank-launches-stablecoin-phx-for-use-on-its-blockchain-platform/Narinig ko din yan at parang stable coin nila yan. Mas ok na yung ganitong may update at ginagawa si Unionbank at sana nga maging totally crypto friendly bank siya kasi meron akong ibang mga nabasa na naging redflag yung account nila sa mismong support ng UB nung sinabing galing crypto ang deposit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 27, 2022, 09:34:25 AM",
      "body": "Quote from: samcrypto on August 26, 2022, 10:45:24 PMQuote from: Jemzx00 on August 26, 2022, 10:29:07 AMAno sa tingin nyo guys ang update na ito mula sa Unionbank? Sa tingin nyo ba, magagamit nyo rin yung \"Cryptocurrency Trading\" na ito sa mobile application ng Unionbank?  Buy and sell yes, pero dipende paren kung gaano ka strict yung KYC nila at syempre kung ok at fair naman ba ang kanilang fees and conversion rate.Sobrang active talaga ni Unionbank sa crypto adoption, although my mga recent problem nga with regards to KYC update pero sa tingin ko ay normal lang naman ito just like the other coin na almost every year ay humihingi ng additional KYC. Unionbank leads the local bank to adopt cryptocurrency, they are ahead and I believe alam talaga nila ang ginagawa nila and that’s good for everybody. Wala naman nareceive at narinig na issue when it comes sa KYC nila. Hindi rin ako kakabahan about my identification since kilala silang financial institution sa bansa natin. Also, kung magkaproblema man, marami tayong mapupuntahan na branches para gawin yung KYC or magtanong at magpatulong sa problema. Anyways, May I know kung ano yung issue na nareceive mo about KYC?Kung sakaling buy and sell lang yung function nung trading nila, siguro hindi ko muna siya gagamitin at maghihintay ng additional features like transfer to different address at iba pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "August 27, 2022, 05:23:23 PM",
      "body": "Quote from: Jemzx00 on August 27, 2022, 09:34:25 AMQuote from: samcrypto on August 26, 2022, 10:45:24 PMQuote from: Jemzx00 on August 26, 2022, 10:29:07 AMAno sa tingin nyo guys ang update na ito mula sa Unionbank? Sa tingin nyo ba, magagamit nyo rin yung \"Cryptocurrency Trading\" na ito sa mobile application ng Unionbank?  Buy and sell yes, pero dipende paren kung gaano ka strict yung KYC nila at syempre kung ok at fair naman ba ang kanilang fees and conversion rate.Sobrang active talaga ni Unionbank sa crypto adoption, although my mga recent problem nga with regards to KYC update pero sa tingin ko ay normal lang naman ito just like the other coin na almost every year ay humihingi ng additional KYC. Unionbank leads the local bank to adopt cryptocurrency, they are ahead and I believe alam talaga nila ang ginagawa nila and that’s good for everybody. Wala naman nareceive at narinig na issue when it comes sa KYC nila. Hindi rin ako kakabahan about my identification since kilala silang financial institution sa bansa natin. Also, kung magkaproblema man, marami tayong mapupuntahan na branches para gawin yung KYC or magtanong at magpatulong sa problema. Anyways, May I know kung ano yung issue na nareceive mo about KYC?Kung sakaling buy and sell lang yung function nung trading nila, siguro hindi ko muna siya gagamitin at maghihintay ng additional features like transfer to different address at iba pa. Wala rin akong naging issue sa KYC nila. Good thing nga at protected at safe sa kanila ang personal details in. Mabuti na lang at mayrooa ring active bank na sinusuportahan ang crypto. Matagal na ring nagaadd ng crypto features and Union bank kaya maraming crypto users are mas gumagamit nito. Kahit nga sa pagopen ng account sa kanila ay hindi rin mahirap. Waiting din ako sa mga features pa nilang ilalabas. I'm sure na marami pa silang ilalabas soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "August 27, 2022, 07:29:26 PM",
      "body": "Pagdating talaga sa cryptocurrency adoption at applications, talagang laging nangunguna ang Unionbank.  Isang napakagandang pagkakataon para sa ating mga Pilipino ang pagkakaroon ng isang bankong aktibo sa implementasyon ng mga bagong technology tulad ng cryptocurrency dahil nagiging aware tayo sa current financial industry trend at mararanasan pa natin first hand kung paano ang pagtransact nito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "August 27, 2022, 09:53:15 PM",
      "body": "Puro good news ang nababasa ko lately dito sa atin, and good talaga na makipag partner si Binance sa mga Universities since sila ang may magandang experience with regards to cryptocurrency and they really give good trainings and informations to those who are willing to help. Sana hinde lang sa mga top universities ito maging available, sana sa mga ibang school den dito sa Pinas para mas marame pa ang magkaroon ng knowledge about cryptocurrency, malaking tulong den ito para maiwan na ang pagiging biktima ng mga scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "August 27, 2022, 11:02:20 PM",
      "body": "Quote from: blockman on August 26, 2022, 01:04:28 PMParang kay Maya yung trading niya. Sana itong dalawang bank na ito ay maging open sa deposit at withdrawal ng actual na supported cryptocurrencies nila.Magiging blow yun sa kanila kapag ganun ang nangyari kasi mas dadaming mga kababayan natin ang magkaka-access sa paghohold at pago-own ng cryptocurrencies. At dadami ang matututo na sila mismo ang maghohold kesa iasa nila sa third party. Pero overall, good news yung mga ganito para sa atin.Every time nakakita ako ng ganitong news, naiisip ko na one step closer tayo towards full implementation and integration of cryptocurrencies sa bansa. Since mismo si BSP na nagpapakita ang kanilang leniency dito, mas may hope ako na maiintegrate ito sa ating financial system and methods sa bansa.It is definitely nice to see Union Bank utilizing this feature sa kanilang users. It makes it very convenient para makabili and transact ng BTC. Though feeling ko ang kalaban dito is documents and limitations, pero for that price to pay, willing ka talagang ipakita lahat para magamit ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "autumnleaf",
      "created_time": "August 28, 2022, 05:48:07 AM",
      "body": "Para sa akin isang malaking good news nito. Hopefully na ma push nila ito very soon kasi naniniwala ako na malaking tulong itong mobile cryptocurrency trading sa atin lalo na sa younger generation na siyang magiging market nito lalo na sa pag hold at own ng cryptocurrencies. I support this innovative na ginagawa ng Union Bank as well as sa ibang pang existing  local trading platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 28, 2022, 01:22:51 PM",
      "body": "Quote from: qwertyup23 on August 27, 2022, 11:02:20 PMEvery time nakakita ako ng ganitong news, naiisip ko na one step closer tayo towards full implementation and integration of cryptocurrencies sa bansa. Since mismo si BSP na nagpapakita ang kanilang leniency dito, mas may hope ako na maiintegrate ito sa ating financial system and methods sa bansa.It is definitely nice to see Union Bank utilizing this feature sa kanilang users. It makes it very convenient para makabili and transact ng BTC. Though feeling ko ang kalaban dito is documents and limitations, pero for that price to pay, willing ka talagang ipakita lahat para magamit ito.Tama ka dyan kabayan, sobrang good news nito lalo na't in compliance sya with BSP. Sana lang sumunod yung ibang banks para maraming option tayo dahil hindi naman lahat satin ay user ng Unionbank. Yung iba satin BPI at BDO users since sila rin kilalang banko sa bansa natin. Anyways, malaki naman yung tsansa na sumunod sila pero siguro hindi pa ngayon since nagsisimula palang naman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "August 29, 2022, 02:59:53 PM",
      "body": "Quote from: Jemzx00 on August 26, 2022, 10:29:07 AMAno sa tingin nyo guys ang update na ito mula sa Unionbank? Sa tingin nyo ba, magagamit nyo rin yung \"Cryptocurrency Trading\" na ito sa mobile application ng Unionbank?  Depende ito sa mga feature na ino-offer nila... Sa ngayon, mukhang wala pa itong trading feature [parang limited lang ito sa pagbili or rather converting PHP sa BTC].Quote from: abel1337 on August 26, 2022, 06:04:56 PMThis is why I doubt Unionbank sa kung ano magiging take nila sa crypto especially ngayon na about sa post na mag ooffer ng crypto trading ang Unionbank. Sila ang pinaka una na crypto friendly bank sa bansa natin and nag iba yung tingin ko sakanila due to closure of account of my crypto friends.May point ka at \"gumawa pa ako ng thread dati\" tungkol dito, pero sa tingin ko hindi magkakaroon ng similar issues pag sa kanila mismo manggagaling yung crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}