{
  "id": "topic_5415728",
  "title": "LyonGT",
  "author": "LyonGT",
  "created_time": "October 02, 2022, 11:14:53 PM",
  "content": "Hi, I'm new on bitcoins, got into it a few weeks ago, a friend recommended me to use foxexchange-bit.com and i did, it was working well until yesterday i tried to withdraw some of my coins.When i tried first i yesterday i couldn't get it, but time later their support sent me a Tax Bill, which i paid to continue using the withdrawal, they then freed the coins and tell me to resubmit the withdrawal order, i resubmitted it to withdraw some of the coins to my Binance wallet, the process has been stalled like 6 hours, so my friend told me to contact their support, which i did and they told me: Hello, your withdrawal blockchain address: (my Binance wallet) The system detected that the anti-money laundering risk supervision warning has been triggered. In order to ensure the safety of your account funds, please provide the front and back of your ID card and a photo of yourself holding the ID card, and send to email support@foxexchange-support.com, and you need to deposit 2000USDT as a security deposit required by the legal department into your account. The funds will be used for process review and account verification, and will be processed and verified by the legal compliance department. Normal withdrawal will be made to the blockchain address you have withdrawn, then you can withdraw all your assets, and the system will refund your 2000USDT deposit within one working day after you complete all the procedures. Your processing time is 48 hours, please Pay attention to your processing time, thank you!I have verified both my accounts on Foxexchange and Binance, and don't know why its abnormal to deposit to Binance, when i got trough Binance all my bitcoins. What can i do? If i don't pay will i lose all my bitcoins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415728",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "October 02, 2022, 11:22:49 PM",
      "body": "It is a scam exchange. The site domain was registered just a month and some days ago, and not a reputed exchange.Code:Domain:foxexchange-bit.comRegistrar:NameCheap, Inc.Registered On:2022-08-13Expires On:2023-08-13Updated On:2022-08-13Status:clientTransferProhibitedHow did you know this scam exchange?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 02, 2022, 11:22:57 PM",
      "body": "Quote from: LyonGT on October 02, 2022, 11:14:53 PMWhat can i do? If i don't pay will i lose all my bitcoins?You don't have any bitcoin to lose. What you see as your balance there is only a fake number for deceiving you. Take note that any service asking you to make a deposit to be able to make withdrawal is surely a scam. There's nothing you can do. If you deposit again, you will lose more money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LyonGT",
      "created_time": "October 02, 2022, 11:34:36 PM",
      "body": "Quote from: Charles-Tim on October 02, 2022, 11:22:49 PMIt is a scam exchange. The site domain was registered just a month and some days ago, and not a reputed exchange.Code:Domain:foxexchange-bit.comRegistrar:NameCheap, Inc.Registered On:2022-08-13Expires On:2023-08-13Updated On:2022-08-13Status:clientTransferProhibitedHow did you know this scam exchange?I got to know this site trough a friend who i have being talking some months now, so i trusted their recommendation. I thought it was a scam when they stalled after the taxes.Thank you for the reply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 02, 2022, 11:38:31 PM",
      "body": "It's scam. An old scam trick. Don't send them any more money or else you will lose it as wellNo legit exchange will ask you money for the tax bill or a security deposit by the \"legal department\"Also desist from sending your KYC documents to random sites. Your documents can be sold on darkweb and used for crimes which might put you in trouble in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 02, 2022, 11:40:58 PM",
      "body": "Quote from: LyonGT on October 02, 2022, 11:34:36 PMI got to know this site trough a friend who i have being talking some months now, so i trusted their recommendation. I thought it was a scam when they stalled after the taxes.Thank you for the reply.Make research yourself. If you want to know about an exchange for example, you can begin to check if the the exchange is on Coinmarketcap or Coingecko to begin with. Then you can check the site rating on reviewing sites like Trustpilot. Then further it using search engine to search if the site is reputable or not.But to make things easy and fast, you can just ask on this forum. Assuming you have asked about the site before using it, we would have told you not to use the scam exchange site and this would have been avoided. Just forget about it and never send any coins to the fake exchange again.You can report the exchange: How to report the scammers to registrar. So it can be taken down if many other people report it.Avoid phishing email messages from the email you used to register with them. Avoid phishing attack generally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LyonGT",
      "created_time": "October 02, 2022, 11:51:14 PM",
      "body": "Quote from: Charles-Tim on October 02, 2022, 11:40:58 PMQuote from: LyonGT on October 02, 2022, 11:34:36 PMI got to know this site trough a friend who i have being talking some months now, so i trusted their recommendation. I thought it was a scam when they stalled after the taxes.Thank you for the reply.Make research yourself. If you want to know about an exchange for example, you can begin to check if the the exchange is on Coinmarketcap or Coingecko to begin with. Then you can check the site rating on reviewing sites like Trustpilot. Then further it using search engine to search if the site is reputable or not.But to make things easy and fast, you can just ask on this forum. Assuming you have asked about the site before using it, we would have told you not to use the scam exchange site and this would have been avoided. Just forget about it and never send any coins to the fake exchange again.You can report the exchange: How to report the scammers to registrar. So it can be taken down if many other people report it.Thank you, I got tricked so I'll be more cautious and will check before any exchange. I'll report the site, so hopefully no more victims there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 03, 2022, 08:13:54 AM",
      "body": "Quote from: LyonGT on October 02, 2022, 11:34:36 PMI got to know this site trough a friend who i have being talking some months now, so i trusted their recommendation. I thought it was a scam when they stalled after the taxes.Thank you for the reply.Is that friend maybe \"female\" and did that \"friend\" contact you through one of the social media networks, or even through platforms like Tinder? I am asking because this is the common M.O of those who use sites like you mentioned. Some of them are very patient and play long game, pretending that they are interested in you, and after some time they switch conversation to \"excellent investment opportunity\". Quote from: LyonGT on October 02, 2022, 11:51:14 PMThank you, I got tricked so I'll be more cautious and will check before any exchange. I'll report the site, so hopefully no more victims there.Rule of thumb: anyone contacting you offering great profit= scam. Trust no one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}