{
  "id": "topic_5473176",
  "title": "EdBar79",
  "author": "EdBar79",
  "created_time": "November 07, 2023, 08:16:30 AMLast edit: November 07, 2023, 02:40:23 PM by EdBar79",
  "content": "Hi everyone.Can anyone help me with this information?I trying to start on Bitcoin market and I received an indication of this site AISG:I supposed start buying Bitcoin from binance and then transfer by blockchain.Anyone know it? Is it reliable?ThanksPS: Thanks everyone for your answers. I didn't use this site and I'm not to trying defraud anyone, just need to undestand if this is reliable.So I'll try the options you suggested here..Thanks again.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473176",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "November 07, 2023, 08:19:23 AM",
      "body": "It's definitely not something I would use, and whoever sent you the site is probably not someone you should trust. Just use Binance as you were going to, and then withdraw your funds to a personal wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 07, 2023, 08:21:21 AM",
      "body": "Stay away from the site if you want to avoid being scammed. How did you know about the site? Better to go for Binance.But if you want a privacy way of buying bitcoin, go for a decentralized exchange like https://bisq.network (desktop) or https://agoradesk.comIf you use Binance, do not leave you coins on an exchange. If it is not your key, it is not your coin. Move your coins to a noncustodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 07, 2023, 08:21:32 AM",
      "body": "I don’t know what your main aim is but according to Whois the domain of the site is clearly less that two weeks old so I really don’t know how you were able to come across it.Code:Domain:btcdbssg.comRegistrar: GoDaddy.com, LLCRegistered On: 2023-10-29Expires On: 2024-10-29Updated On: 2023-10-29Status: clientDeleteProhibitedclientRenewProhibitedclientTransferProhibitedclientUpdateProhibitedStay far away from the site if you don’t want to lose your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 07, 2023, 08:31:54 AM",
      "body": "There are only two chances here:1. You're the scammer who promote btcdbssg.2. You're an innocent by asking the legitimacy of this exchange.Looking at your account registered, time of this post was created and the weird domain, I pick the first option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LL_LuxLait",
      "created_time": "November 07, 2023, 08:37:31 AM",
      "body": "Don't trust this site, it's looks like a big Scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "November 07, 2023, 08:52:04 AM",
      "body": "Quote from: EdBar79 on November 07, 2023, 08:16:30 AMHi everyone.Can anyone help me with this information?I trying to start on Bitcoin market and I received an indication of this site AISG:https://m.btcdbssg.com/#/tabbar/homeI supposed start buying Bitcoin from binance and then transfer by blockchain.Anyone know it? Is it reliable?ThanksMost likely you are the owner of the site that is obviously looking like a scam site. This is your first post in this forum, you have neither asked any other question anywhere nor made any suggestion whatsoever,  maybe the reason you created this account is to push this scam site to collect some Sats. Well, anyone who pays attention to this and actually puts any money into it deserves to be scammed. It is high time people stop spoiling the image of Bitcoin and other digital assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "November 07, 2023, 09:07:37 AM",
      "body": "Quote from: Odohu on November 07, 2023, 08:52:04 AMMost likely you are the owner of the site that is obviously looking like a scam site. This is your first post in this forum, you have neither asked any other question anywhere nor made any suggestion whatsoever,  maybe the reason you created this account is to push this scam site to collect some Sats.I don't know why but I was thinking the same. Most newbies in this forum are not genuine newbies. Even if they are genuine newbie, some of them are here just to promote their shit. We have seen a couple of accounts promoting a single scam trading website a couple of weeks ago. Turnes out those accounts were handled by the same person. I highly doubt that the account owner is the owner of that scam site as well. I am curious why they promote their website with a negative point of view. Do they still get visitors by promoting it negatively?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "November 07, 2023, 09:23:15 AM",
      "body": "If you are interested in Bitcoin investment and you start get phishing links, the best thing is to ignore and go for the one you trust. I believe you must have researched on sites that are trustworthy to get your Bitcoin purchase. It's not news that scammers are getting innovative but I think there's nothing super about this one that should cause you confusion. If you are not comfortable with it, walk past. That's if you are not the person who's looking for unsuspecting individuals to fall for the trap of clicking the link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 07, 2023, 10:16:00 AM",
      "body": "Quote from: EdBar79 on November 07, 2023, 08:16:30 AMI supposed start buying Bitcoin from binance and then transfer by blockchain.Anyone know it? Is it reliable?The website domain name looks weird with likely random letters. I don't trust any website like this without more checking.If you want to check basic information in cryptocurrency including cryptocurrency exchange, you can start with two big websites.https://coinmarketcap.com/https://www.coingecko.com/If you don't find any information about an exchange, a token on those websites, you can stop because what you are searching for information is probably very newborn exchanges, projects and can be scam ones too.Don't waste your time on it.Not your keys, not your bitcoins. Hence after buying your bitcoin, withdrawing it as soon as possible.Reminder: do not keep your money in online accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 07, 2023, 10:56:01 AM",
      "body": "Don't accept any offer given by anyone out of these forum, I don't trust that site either, you need to learn how to start first, then follow all the required informations already given to you and the reference links that could help you know where to track bitcoin market price, don't join any platform or sites, use only the information that had been given to you from this platform and learn first before any action, you needed time to understand what is ahead and don't rush in other not to make mistakes, this is the only place you can get the most reliable information that will not mislead you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "November 07, 2023, 01:45:05 PM",
      "body": "Never trust any site that is not recommended to avoid being scammed. Binance is a trusted site and one of the largest exchanges ever. Never hesitate to make transactions there, when you have successfully exchanged Bitcoin there, immediately withdraw your assets to a wallet where you can control the private key. Invest safely, never believe anything that seems strange, only you can protect the security of your assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EdBar79",
      "created_time": "November 07, 2023, 02:30:46 PM",
      "body": "Quote from: OmegaStarScream on November 07, 2023, 08:19:23 AMIt's definitely not something I would use, and whoever sent you the site is probably not someone you should trust. Just use Binance as you were going to, and then withdraw your funds to a personal wallet.Thanks for your help",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EdBar79",
      "created_time": "November 07, 2023, 02:41:58 PM",
      "body": "Quote from: Jawhead999 on November 07, 2023, 08:31:54 AMThere are only two chances here:1. You're the scammer who promote btcdbssg.2. You're an innocent by asking the legitimacy of this exchange.Looking at your account registered, time of this post was created and the weird domain, I pick the first option. I'm nothing promoting this, i don't understand about bitcoins and received this option and now I'll forget about it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BABY SHOES",
      "created_time": "November 07, 2023, 05:47:02 PM",
      "body": "It's good that you asked here so many people advised you not to go through what you mentioned because it's obvious that there are indications that you will be scammed, maybe that's what I think.I always buy bitcoin on Binance and withdraw it immediately, never store coins there because it doesn't have a key when the exchange is having problems, the important thing is that you already know how to buy on the exchange then withdraw it directly because it will be much safer than storing it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 07, 2023, 05:57:38 PM",
      "body": "Quote from: EdBar79 on November 07, 2023, 02:41:58 PM I'm nothing promoting this, i don't understand about bitcoins and received this option and now I'll forget about itYeah, for sure be super careful about who you put your trust in.  I've seen a lot of folks get ripped off by shady scammers making offers that are just too good to be true and  if you aren't totally sure about something or don't wanna risk it, always ask around first in places like this.  Watch out for stuff that seems super urgent too - thats how those jerks get people all the time.  They make you feel like you gotta decide right this second and get you all worked up so you don't think straight.  Just relax and think it all through first.  Better safe than sorry! Plenty of scumbags out there just waiting to take advantage of nice folks who want to believe the best in people.  Don't let yourself get played.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 07, 2023, 06:20:46 PM",
      "body": "How do beginners find such services? The site has only been created for two weeks, so you will not find it archived in search engines. So how did you get it?Code:Domain:btcdbssg.comRegistrar: GoDaddy.com, LLCRegistered On: 2023-10-29It is a scam until proven otherwise, and if it is promoted through social media, block the account that recommended this service and try not to talk to strangers about cryptocurrencies or investment.Binance is good and does not use blockchain.com is better than Electrum for computers and BlueWallet for phone wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "November 07, 2023, 06:27:45 PM",
      "body": "Well the truth be told that who ever introduced you to that link shouldn't be trusted if you don't know he or she in person and if by any chance you transfer your funds there, there are high possibilities of you getting scammed because the name isn't an obvious one and there is actually no sort of guaranty on it.Please don't get me wrong, I'm not trying to talk down anymore or firm but I'm just I'm just preaching carefulness and since you already know binance and maybe know how to use it, then you should stick to buying your coins over there and maybe transfer it to a decentralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "November 07, 2023, 07:43:29 PM",
      "body": "Quote from: Cantsay on November 07, 2023, 08:21:32 AMI don’t know what your main aim is but according to Whois the domain of the site is clearly less that two weeks old so I really don’t know how you were able to come across it.Stay far away from the site if you don’t want to lose your money. I don't know from where you all got the website link, or maybe the Op might have edited the post because all he mentioned is QuoteAISG, about which I did not get anything related to crypto. Well, I think I have to give oil to my rusted searching skills. For now, I can say that most of the newbies are the ones who become victims of such scams, and it can be proved because they don't know the rule that everything you see on crypto is not promising if you make an account on X or Twitter and ask a newbie to get into crypto.He will definitely not leave any airdrops posted on X behind and forget about Telegram. Most scams occur when a newbie thinks everything on social media is for sure and they will definitely get something out of it.In this case, I think the OP doesn't know how the BTC blockchain works or how transactions are being made. All he need is some education about BTC blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 07, 2023, 08:13:04 PM",
      "body": "Quote from: ZAINmalik75 on November 07, 2023, 07:43:29 PMQuote from: Cantsay on November 07, 2023, 08:21:32 AM~~~I don't know from where you all got the website link, or maybe the Op might have edited the post because all he mentioned is Yes he did edit the link out of his post, probably because if the first few replies that he received in this thread but you can still see the original post if your check ninjastic.space[1]. But with the way he responded to the replies here in his thread I’m starting to believe that he was indeed recommended to the site because most users that do come to share scam site don’t even bother to return back to their thread as soon as they drop the link. [1] https://ninjastic.space/post/63117906",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}