{
  "id": "topic_5449944",
  "title": "Bullion-n-BTC",
  "author": "Bullion-n-BTC",
  "created_time": "April 24, 2023, 03:23:16 AMLast edit: April 29, 2023, 04:55:27 AM by Bullion-n-BTC",
  "content": "LuckyFool Physical BTC release update***NEW UPDATE: All coins have shipped to MinerJones and will be arriving within the next few days!  Thanks again for the patience and support!Hey guys! Order update for those of you that bought one or more of the LuckyFool Funded BTC pieces: Orders start going out tmr and I will contact each individual person as their package goes out! All packages will be sent out with tracking by mid / end of work week. Apologies on slight delay in shipping guys I grossly underestimated the time and supplies needed to properly and securely package, label, and mail 40+ packages. If you have any questions, comments, or concerns please feel free to message me at any time day or night. I work shift work so am available one way or another throughout the day. Thanks again guys and I hope you enjoy the coins when they reach you!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449944",
  "comments": [
    {
      "author": "Kryptowerk",
      "created_time": "April 24, 2023, 05:36:17 AM",
      "body": "No worries about a slight delay, it’s great that you keep us in the loop.And yeah, if it’s a one man army project, getting 40+ packages ready can be surpisingly much work if you are not used to it, especially if it’s additional to your main occupation. Looking forward to the coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minerjones",
      "created_time": "April 24, 2023, 11:21:22 AM",
      "body": "There are people who can help out with this sort of thing......",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JanEmil",
      "created_time": "April 24, 2023, 05:19:52 PM",
      "body": "Send the Lot to MJ and we pay from there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bullion-n-BTC",
      "created_time": "April 24, 2023, 07:47:06 PM",
      "body": "Quote from: minerjones on April 24, 2023, 11:21:22 AMThere are people who can help out with this sort of thing...... Lol I know brother I actually have most of these sorted and will be sending to you before I send anybody else’s. Most of this releases sells went to a group a padnah and I run for physical crypto and bullion. I also wanted to get some experience in fine tuning the process as my next release is going to be a 999 silver release and I Volvos a couple hundred coins. I’d rather work the kinks out now with a 50 coin release as opposed to a 400-500 coin release. Will have them sent very shortly though. Thanks again for the help man",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}