{
  "id": "topic_5450090",
  "title": "trendcoin",
  "author": "trendcoin",
  "created_time": "April 25, 2023, 08:29:52 AM",
  "content": "Kesin yalandır borusunu takamazlarBaşkası döşer boruyuHep aynı yalanDeist, ateist olduk sizin yüzünüzdenKesin zam yapacaklar gazaDin ile uyutuyorlar herkesiDiyanet kapatılsın, hdp onlardan daha iyiPol Pot'a, Apo'ya, Stalin'e oy vericemSenin beynini yıkamışlarEnerjide dışa bağımlılığımız azalacak Sondaj, üretim ve taşıma gibi prosesler istihdama katkı sunacakDoğalgaz diğer fosil yakıtlara göre daha çevrecidirPandemi sonrası yaşanan global kriz bir enerji kriziEnerji maliyetleri arttığında enflasyon katlanıyorDoğalgaz birçok endüstride hammadde olarak kullanılıyorKeşke daha önce bulsaydık, çok geç kaldıkEndüstriyel üretim hacmi artacak ve global rekabette avantaj kazanacağızÜretim maliyetleri düşecek ve ihracatta avantaj elde edeceğizel emeği göz nurudur, izinsiz kullanabilirsiniz.bir şey eklemeyeceğim konuya; bunlardan tiksiniyorum, bir şeyler eklesem hoş olmayan şeyler ekleyeceğim. en iyisi bir habere dair bir link eklemek olur. https://www.ntv.com.tr/galeri/ntvpara/karadeniz-gazi-bugun-karaya-ulastiriliyor,0s5XhTg8fUqsa69Ehojyow",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450090",
  "comments": [
    {
      "author": "Lachrymose",
      "created_time": "April 25, 2023, 09:11:08 AM",
      "body": "tam kirası ödenemeyen evde giymekten gevşemiş don lastiğiyle komşunun internetine girip yazılmış başlık. seviyorum seni trendo kaliteni hiç bozmuyosun Çilekli Pasta Tarifi İçin Malzemeler\"keki için;2 adet yumurta1 su bardağı şeker1 su bardağı sütYarım su bardağı sıvı yağ1 yemek kaşığı dolusu kakao1 paket vanilya1 paket kabartma tozu1 buçuk su bardağı unkreması için;5 su bardağı süt1 su bardağı şeker4 yemek kaşığı un2 yemek kaşığı nişasta1 paket toz krem şanti1 kase çilek\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "April 25, 2023, 09:26:09 AM",
      "body": "Quote from: Lachrymose on April 25, 2023, 09:11:08 AMtam kirası ödenemeyen evde giymekten gevşemiş don lastiğiyle komşunun internetine girip yazılmış başlık. seviyorum seni trendo kaliteni hiç bozmuyosun ;D...ben de senin 180 derecelik değişimlerini ve dönüşümlerini seviyorum larcyciğim ama konumuz bu değil. konumuz gaz aramak için bir filo oluşturulurken ve gaz aranırken konu ile alay etmeye çalışanların yaptıklarını ve bugünümüzü anlatıyor. üstelik dahası da var; bunların hepsi %100 olarak tarihin içinde yaşamış kanlı-canlı insancıkların ağzından dökülmüş sözler...bu arada, gevşek don lastiği iyidir, iz yapmaz. :))) başlık da aday bile çıkaramadıkları dönemde hemen seçim acil seçim diye bağırarak kırılgan ekonomiyi daha da zor hale getirmeye çalışanların gaz hazımsızlığına bir vurgu. yawww orijinal bir başlık, neresi kalitesiz bunun aga, yüzde yüz orijinal ve altında sağlam kurgularla oluşturulmuş güçlü bir vurgu var. :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "April 25, 2023, 10:36:46 AMLast edit: April 25, 2023, 02:00:29 PM by mandown",
      "body": "Ekonomi kırılalı çok uzun zaman oldu. Al sana grafik. Bak grafiğe inanmıyorsan bankadaki döviz makas aralığına bak. O kadar iyiysen bu rezillik ne. Ne dış güçmüş arkadaş o kadar fabrikayı sattınız utanmazsınız. Paranın nerelere gittiği hala savunmandan belli nasıl olsa çeşme akıyor değilmi? Çeşme durmasın yeterki.Sana savaş zamanı en çok lazım olacak telekom ve tank palet fabrikasını sattınız. Bundan gurur duyacak kadar da cahilsiniz.Son zamanlarda cidden seni sevmeye başladım. Ekonomideki başarılı işler demekki böyle sonuçlanıyor. Aşağıdaki 2 grafik deki 7 farkı bulun -----------------------------------------------------Aradaki gün farkı sadece 7. Gaz bedava Hemen soda acil soda.. Şişkinliğin gitmedimi  domates, soğan, salatalık kg fiyatı 25 TL ona paran yetişmedimi? Sindiremedinmi? Gazın varsa sana Şu 3 dakikada  bir üretilen togg verelimmi? 1 milyon verir lastiğinden yemeye başlarsın.     Quote2023 yılında Togg 20 bin akıllı cihaz üertimi gerçekleştirmeyi planlıyor. Bunlar yıl boyunca sipariş ile teslim edilecek. 16 Mart'ta başlayan sipariş sürecinde ise 12 bin elektrikli otomobil bireysel kullanıcılara teslim edielcek. Togg ön sipariş kurası 12 bin araç için yapılacak.Kaynak: https://www.timeturk.com/genel/togg-kac-kisiye-cikacak-kurayla-kac-adet-togg-satilacak-togg-kurasi-kac-kisi-arasindan-cekilecek/haber-1762808Quote'Yok dedikleri fabrikada 3 dakikada bir araç üretiliyor\" dedi.https://www.iha.com.tr/haber-cumhurbaskani-erdogan-yok-dedikleri-fabrikada-3-dakikada-bir-arac-uretiliyor-1165401/Her 3 dakikada 1 araç üretiyor ha 1 yılda yüzbinlerce araç üretiliyor ama vatandaşa sadece 20bintanesini mi veriyorsun? Gerisini ne yapıyorsun hangi depoya koydun söylede gidip bakalım. Ortada böyle bir üretim olsa 7 24 videolarla gösterip 1 numaralı seçim  propagandası yapmazmıydınız?Ne demiştik herşey ülkede çok iyi değilmi? Ozaman bu millet niye icralık oluyor? her 4 kişiden biri icralık bak bunu ben demiyorum biricik en güvenilir kurum tüik söylüyor.Ama Karadenizden gaz çıkartıyoruz değilmi? açın kombileri açın camlarıÇOK GAZMI YAPTI SODA İÇ iyi gelir.BÜYÜK RESMİ GÖRDÜM ABİ.PARAMIZ BU KADAR BAŞARIYA GÖRE HER GEÇEN GÜN DEĞER KAYBEDİYORSA BİTCOİN DEĞERLİ DEĞİL ÇÖP OLUYOR. SONUÇTA O DEĞERLERNİYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "April 25, 2023, 11:57:30 AMLast edit: April 25, 2023, 12:29:55 PM by SUPERSAIAN",
      "body": "Yemek paylaşım konusu açılmışken hazır bende bildiğim bir tarifi bırakayım Vezir Parmağı Tarifi - Tam ölçülü lezzet garantili İçin MalzemelerHamuru için;1 adet yumurta125 gr tereyağı1 çay bardağı sıvı yağ1 paket kabartma tozuYarım su bardağı yoğurtYarım çay bardağı şeker3,5 su bardağı un1 paket vanilyaŞerbeti için;3 su bardağı şeker3,5 su bardağı su1 yemek kaşığı limonÜzeri için;Yarım su bardağı irmiküBOL irmikli şahane. Yanına içecek tercihi tamamen size kalmış. Soda da olurhttps://www.nefisyemektarifleri.com/video/vezir-parmagi-tarifi-tam-olculu-lezzet-garantili/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "April 26, 2023, 02:29:28 AM",
      "body": "Quote from: mandown on April 25, 2023, 10:36:46 AMEkonomi kırılalı çok uzun zaman oldu.konunun ekonomi ile bir alakası yok ama sen bu forumun en kalitesiz boş beleş trolü olduğun için ve konuları sulandırmayı çok sevdiğin için görevini yapmaya gelmişsin yine. galiba karargahtan sana bu görevi özel olarak veriyorlar ve sen de utanmadan hep aynı şeyi yapıyorsun. bu durumun başka bir makul açıklaması olamaz.yıllara göre dolar1980   76,032002   1.506.4312002   1,52023   20yıllara göre asgari ücrethttps://edirnejethaber.com/wp-content/uploads/2022/12/asgari-ucret-yillara-gore-degisimi.jpgal bak, bu da doların yatay seyrettiği, demokratik hakların en yüksek seviyede olduğu, faizlerin ve işsizliğin en düşük seviyelerde olduğu yıllardan bir örnek:sanki ekonomi çok iyiyken farklı tepkiler veriyormuşsunuz gibi numara çekmenize gerek yok. sizin nemenem bir şey olduğunuzu herkes biliyor.Quote from: mandown on April 25, 2023, 10:36:46 AMŞu 3 dakikada  bir üretilen togg verelimmi?haaa \"fabrikası yok\" ve \"üretim bandı yok, elde üretiliyor\" faslını geçip \"yıllık üretim adedine ulaşılamaz\" faslına geldiniz yani! ben sizi epey hafife almışım, sizde iyi-kötü bir gelişme var. ben görür müyüm bilmem ama adam olma ihtimaliniz var yani.bugün her şey çok iyi değil ama pkk'nın siyasi uzantısı ile işbirliği yapanlar bundan daha iyisini yapabilecek kapasitede değil. ayrıca, senin daha iyi bir seviyede yaşaman için dışa bağımlılığını azaltacak önemli gider kalemlerinden biri olan enerji sorununu çözmen gerekiyor. bu sorunu da insanların inançlarına saldıranlar ya da din düşmanlığı yapanlar çözemez. forum köşelerinde mikrop gibi trollük yapanlar çözemez. otogara sandalye koyulduğu için sevinenler çözemez. oraya giden, kazmayı vuran ve iğne ile kuyu kazarak gaz arayanlar çözer.ülkeme faydalı işler yapanlardan allah razı olsun. rahatsız olanlar sonsuza kadar rahatsız olmaya devam etsin. bu ükede her şey çok iyi değilse bu gelişmelerden rahatsız olan takoz zihniyetli insanların yüzünden iyi değil; bu ülkede bir şeyler biraz iyiyse takoz zihniyetli insanlara rağmen iyi (ki bu aslında çok büyük bir başarıdır).iki de bir \"pen çeni ençeledim çenin yaçdıklarını göymücem aytıkım\" deyip birkaç haftada bir ayağımın altına paspas olmaya geliyorsun. sen ki test kitlerinin parasını atatürk ödemiş diyebilecek seviyede birisin (https://bitcointalk.org/index.php?topic=5234799.msg54080851#msg54080851). sen ki sınırımızda terör koridoru oluşturulurken ne işimiz var suriye'de diyen birisin (https://bitcointalk.org/index.php?topic=5227282.msg53878013#msg53878013). sen ki diyanet hakkında dezenformasyon yayan tescilli bir trolsün (https://bitcointalk.org/index.php?topic=5442003.msg61917315#msg61917315). benim karşıma çıkmadan önce abdest al, avesta'dan ayet oku, odanın içinde semah dön, sonra tabeladan milliyetçilik yap; hadi yallllah!test kitlerininin parasını atatürk ödedi demiş birisini muhatap almak istemiyorum ama doğru düzgün türkçe yazmaktan aciz bu herif her defasında ayağımın altında dolandığı için onu itina ile ezmek zorunda kalıyorum.Quote from: SUPERSAIAN on April 25, 2023, 11:57:30 AM...aynen bilader, söylediklerine sonuna kadar katılıyorum. pkk'nın siyasi uzantısı olmakla övünenler ile işbirliği yapanlar, küçük kız çocukları üniversiteye girmesin diye (laiklik değil) laikçilik yapıp ordu göreve diyerek milleti kutuplaştıranlar, demokrasi yerine darbelerden medet umanlar, onlar iktidar olur ama muktedir olamaz çünkü biz asılız diyenler de bedeevaaaa gazı kullanacaklarmış. acaba diyorum onlar kanları gereği bunu suistimal eder mi? acaba diyorum herkese ilk ay bedeevaaaa gaz verilmeseydi daha mı iyi olurdu? yalnızca mutfak masraflarına denk gelen 25 m3 yeterli olmaz mıydı? bu arada, seninle aynı fikirde olduğuma çok sevindiğimi belirtmeden geçemeyeceğim; aynı fikirde olduğumuz başka konularda görüşmek üzere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "April 26, 2023, 05:54:51 AM",
      "body": "Zaten 1.5 milyon lira şimdinin 1.5 milyonu degilmi ne hikmetse 1.5 milyon şimdinin ve sıfır silindiğindeki 1.5 lirasına eşdeger. Senin o 20 kıran 20 değil eskinin 20 milyonu..  utanmadan birde örnek olarak onu yaziyirsun. Ha o iki örnek arasında satılan fabrikaları hesaba katmiyorum. Bu arada togg İHA Siha gibi özel şirketler tarafından üretilen urunleri kendi malın gibi gurur duymakta ayrı komedi. Bu cikarttigin gazın acaba yüzde kaçı özel şirkete ait hava attığınız bir yıl gaz bedava dediğin şeyin acaba hükümete bir yıllık zararı ne tabi bunları ionusmazsiniz. Zafer havalimanini unuttuk sanma hani şu binlerce insan garantisi verdiğiniz.Diğer yazdıklarına cevap vermeye gerek bile duymuyor ve okumuyorum. Forumda okuyan oldugunuda sanmıyorum.Forumda seni ciddiye alan nadir kişilerden biriyim  kim trol forumda herkes çok iyi biliyor.Hadi sen git biraz trol pastasi yap.Millet seni ciddiye almayıp dalga geçiyor utanmayip cevap veriyorsun mesajlar bana yazılsa utanırdim.Toggun fabrikası olsa ne olmasa vatandaş alamadiktan sonra neydi bilgi emekti. Ülkenin asgari ücret çalışan oranına bak sonra aracın fiyatına belki utanırsin ama nerdeSen boşver pasta yap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "April 26, 2023, 09:22:50 AM",
      "body": "Kızılay içmeyin bu arada!Önerim Beypazarı.https://www.birgun.net/haber/birgun-skandali-ortaya-cikardi-kizilay-maden-suyu-uretimini-durdurdu-426018",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "May 02, 2023, 04:47:00 AM",
      "body": "Quote from: mandown on April 26, 2023, 05:54:51 AM...özel şirketler tarafından üretilen urunleri kendi malın gibi gurur duymakta ayrı komedi. ...o siha'lar israil'den alındığında ve operasyon sırasında görüntü kapattığında hiçbiriniz cıvataları yerli mi hastalığınıza dair belirtiler göstermediniz, ne zaman ki birileri mehmetçik'i koruyan yerli ve milli teknolojiler geliştirdi işte o zaman içinizdeki hastalıklarınız gün yüzüne çıkmaya başladı.yabancı ülkelerde uğruna dillere destan şarkılar yapılan, çocuklarına isim olarak koyulan, azerbaycan'da karabağ'ın özgürlüğüne damga vurmuş, hani şu sizinkilerin boraltan'da sırtını döndüğü azeri kardeşlerimize, hani şu sizinkilerin türkiye maalesef azerbaycan'a yardım ettiği dediği karabağ'da destan yazmış, pkk'ya karşı mücadelede etkin başarı göstermiş bir teknolojiye hazımsızlık duymanız sizin gibilerden beklenecek türden davranışlar. siha'lar özel şirketmiş, lafa bak! şakir zümre'nin soba fabrikası faciası bir daha yaşansın istiyorsanız, nurikilligil'in başına gelenler bir daha yaşansın istiyorsanız, vecihi hürkuş'un başına gelenler bir daha yaşansın istiyorsanız avucunuzu yalarsınız.siz hdp ile iş tutan tıynette insanlarsınız, siha fabrikalarını kamulaştıracağız deyip soba fabrikasına dönüştürmek sizden beklenecek türden işler tabii ki ama bunu forum köşelerinde trollük yaparak başarmanız çok zor.enerjide dışa bağımlı olduğu 100 yıldır bilinen bir ülkede, dünyada bir enerji krizi yaşanmadan önce, gaz arama ve çıkarma maksadıyla çalışmalar yapılmış ama hem aramalar esnasında hem de keşiflerin duyurulması esnasında bütün çalışmalar malum kitle tarafından alay konusu edilmiş...üzerinize geldiğim için özür dilerim, \"bizler rezil bir topluluğuz, siyasi saplantılarımız gereği ülke menfaatine olan şeylere bile karşı çıkarız, gerekirse hdp ile işbirliği yaparız, gerekirse mehmetçik'e kurşun sıkanların siyasi uzantısı ile işbirliği yaparız, bir oy atamızın partisine bir oy apo'nun partisine deriz ama saplantılarımızdan vazgeçmeyiz\" itirafında bulunmanızı beklemek benim yaptığım en büyük büyük hatalardan biri oldu. sizlerden tekrar özür dilerim. sizler doğaları gereği davranmak zorunda olan bir topluluksunuz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 02, 2023, 06:09:33 AMLast edit: May 02, 2023, 06:48:12 AM by mandown",
      "body": "Hocam mehmetçiği koruyacak projelere lafım yok isterse bunun 1000 misli harcansın ama burada propaganda yapma.Sen siha iyi mehmetçiği koruyacak diyorsun diğer taraftan tank palet fabrikasını satıyorsun olacak işmi. Sanırım tank palet fabrikasının teröristlerle verilen mücalede yeri yok ama sihanın var öylemi?Aynı söylemi altay tankı için düşünebiliriz. Tank yapıp palet fabrikasını satmakta ayrı bir komedi. Araç yapıp lastik fabrikasını satmak sana ne kadar doğru geliyor? Bırak artık propaganda yapmayıTank palet fabrikası satılabilir ama iha dokunulmazmıdır? Nedir bunun özelliği? Daha önce benzerleri yapılan iha'lardan özel kılan nedir neden onlara destek verilmemişte bunlara sınırsız destek verilmiş? Türk telekom bile satılabilir ama iha'ya kimse birşey diyemez değilmi? Hüdaparın başındaki zatın neler söylediğini söylememe gerek yok sanırım. Sevdiğiniz partinin bakanlarından biri çıkıp milletin seçme hakkına siyasi darbedir diyor. Benim görüşümdeki bir parti bunu diyecek yemin ediyorum utanırım. Milletin yüzüne bakacak halim olmaz. Birde lgbt'ye hayvanla ilgili muhabbetleri konuşmuyorum bile. Midesizsiniz. İnsanın az onuru gururu varsa 14 mayıs'a söylenen bu söz için ya istifa eder yada özür diler.  Birde bu söylem için utanır. Aynı şekilde seçimle gelenlerin tekrar seçime attığı kusmuk.Cidden miden hala nasıl kaldırıyor anlam vermekte zorlanıyorum. Mecliste yemin etmeye laf edip üstüne bayrağımıza olan rahatsızlığına kadar dil uzatan bir başkanın yanında durup onu meclise sokmaya çalışmak, insanların mehsepleri üzerinden siyaset yapıp üstüne millete tür demek, birde en değerli konularımızdan biri olan seçme ve seçilme hakkına siyasel darbe diyenlere alkış tutmak cidden nasıl bir mideniz var anlamakta zorlanıyorum. İnsan utanır. Tabi o yüz varsa.Cidden komik duruma düşüyorsun.  HDP bir terör partisimi mecliste çoğunluk bende değil sanırım sizde. kapatır elini kolunu bağla. Yasanı uygula kardeşim elinden tutanmı var. Anayasayı değiştecek kadar gücün var ama hdp'nin elini kolunu bağlayacak kadar gücün yok öyle mi? Bu ülkede hdp resmi devletin bir partisimi bu millet bu partiye oy atıyormu? Birkere orada o insanlara saygı duyacaksın. Fetö ile bağı olan her siyasetçi yargılansın neden demiyorsun? Kimin bağı varsa cezaevine atılsın neden attırmıyorsunuz?  Elinizden tutanmı var. Sen gelip burada bana bir milletvekilinin nasıl olurda maaş ile gemiler, maden ocağı alır sen onu söyle.21 Yılda ülkenin geldiği durum belli daha dün suriyelinin teki vatandaşımızı vurdu. Suriyeli bir itin gelip burada senin vatandaşını vurması hoşuna gidiyormu? Kızamık gibi komik hastalıklar ülkemizde bitmişken geri türemesi sana normal geliyormu?Ev kiraları olmuş 5000 tl üstü asgari ücret 8000 lira isterse 10.000 lira olsun ne önemi var.  Karadenize gelen bir deprem'de eviniş kaybeden vatandaş ile konuştuö ankarada 8000 tl kira istemişler asgari ücret kaçtı?Ama dogalgaz çıkartıyoruz 1 ay bedava değilmi? Çay var içersen. Ama sen soda içmeye devam et. İnsanda biraz gurur olmalı. Omurga olmalı.Birde neydi hudut namustu değilmi?  Bu ülkede hatay iline giremeyen bir millet vekili var ama suriyeden elini kolunu sallayarak suriyeli girebiliyor. Ama hudut namusdu değilmi?Yukarıda yaptığın gibi işine gelmeyen mesajları görmezden gelip işine gelene cevap verirsin. Devam et paşam aynen böyle devam et. Milletçi sizsiniz vatnadaş sizsiniz. Terör ile arasına mesafeyi koyan sizsiniz. Açılım sürecini zaten ben yaptım. Omurga çok önemli bir organ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "May 02, 2023, 07:12:40 AM",
      "body": "tescilli trol, ben propaganda yapmış olsaydım her arama ve keşif çalışmasının konusunu övünerek açardım. ben propaganda yapmıyorum ama siz bu gelişmelerin antipropagandasını iki-üç yıl boyunca yaptınız. şimdi utanmanız gerekirken, biz bu ülkenin menfaatine yaşanan gelişmelere karşı trollük yaptık, çünkü siyasi olarak saplantılıyız demeniz gerekirken ekonomi ya da başka mevzularla konuyu rayından çıkararak sulandırmaya çalışıyorsunuz. bak bu gemiler orada arama yaptı. bu propaganda değil. bu ülke menfaatine yapılmış bir iş ama sen bunu anlayamayacak kadar sığ ve saplantılı bir herifsin.senin gibi troller malum zihniyetin ürünü olduğu için tıpkı suriye'nin kuzeyinde terör koridoru oluşturulurken yaptığınız gibi \"ne işimiz var orada\" diye onlarca konu altında profesyonel çalışma yaptı. biraz utanman olsa insan içine çıkmaman gerekir ama \"bir oy apo'nun partisine, bir oy atamın partisine\" deyip seçime katılacaksın, mehmetçik'e sayısız fayda sağlayan yerli ve milli teknolojilere çamur atacaksın, sonra da tabeladan tc'yi söktüler diye numaradan ağlayacaksın...https://bitcointalk.org/index.php?topic=5340328.0https://bitcointalk.org/index.php?topic=5283029.0https://bitcointalk.org/index.php?topic=5393563.0https://bitcointalk.org/index.php?topic=5315617.0https://bitcointalk.org/index.php?topic=5269968.0Quote from: mandown on May 02, 2023, 06:09:33 AM...Cidden komik duruma düşüyorsun.  HDP bir terör partisimi mecliste çoğunluk bende değil sanırım sizde. kapatır elini kolunu bağla. Yasanı uygula kardeşim elinden tutanmı var. ...heh, akp-mhp hdp'yi kapatmadı, o halde yaşasın chp-hdp işbilirliği sıvaması da gelmiş.ben komik duruma düşmüyorum, sen işbirliğini gizlemek için ve normalleştirmek için ve hatta propaganda amacıyla trollük yaptığın için cahil durumuna düşüyorsun.QuoteSiyasî Partilerin kapatılması, Yargıtay Cumhuriyet Başsavcılığının açacağı dava üzerine Anayasa Mahkemesi tarafından karara bağlanır. Anayasa Mahkemesi, temelli kapatma yerine, dava konusu fiillerin ağırlığına göre ilgili siyasî partinin Devlet yardımından kısmen veya tamamen yoksun bırakılmasına karar verebilir.https://www.anayasa.gov.tr/tr/mahkeme/gorev-ve-yetkileri/siyasi-parti-kapatma-davalari/sen ki tescilli bir trol olarak utanmadan 7/24 propaganda yapacaksın da biri çıkıp burada olduğu gibi senin arkanı yaktığında karşındakini propaganda ile suçlayacaksın öyle mi? Quote from: trendcoin on April 26, 2023, 02:29:28 AMsen ki test kitlerinin parasını atatürk ödemiş diyebilecek seviyede birisin (https://bitcointalk.org/index.php?topic=5234799.msg54080851#msg54080851). sen ki sınırımızda terör koridoru oluşturulurken ne işimiz var suriye'de diyen birisin (https://bitcointalk.org/index.php?topic=5227282.msg53878013#msg53878013). sen ki diyanet hakkında dezenformasyon yayan tescilli bir trolsün (https://bitcointalk.org/index.php?topic=5442003.msg61917315#msg61917315).gel kuchu kuchu gel, altımda çırpınmaya devam et! konu, iki-üç yıldır burada ve başka yerlerde yapılan antipropagandanın çöpe gitmesini detaylandırıyor. biraz omurgası olan biri varsa çıkıp o caps'deki şeyler yanlış desin, konuyu sulandırmaya çalışarak trollük yapmasın, trollüklerine de verilecek cevabım var elbette ama milletin cahilliğini giderecek kadar boş vaktim yok çünkü ben 7/24 internet kafede yaşayan ve trolümsü davranışlarda bulunan bir canlı türü değilim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 02, 2023, 07:22:13 AM",
      "body": "Quote from: trendcoin on May 02, 2023, 07:12:40 AMtescilli trol, ben propaganda yapmış olsaydım her arama ve keşif çalışmasının konusunu övünerek açardım. ben propaganda yapmıyorum ama siz bu gelişmelerin antipropagandasını iki-üç yıl boyunca yaptınız. şimdi utanmanız gerekirken, biz bu ülkenin menfaatine yaşanan gelişmelere karşı trollük yaptık, çünkü siyasi olarak saplantılıyız demeniz gerekirken ekonomi ya da başka mevzularla konuyu rayından çıkararak sulandırmaya çalışıyorsunuz. bak bu gemiler orada arama yaptı. bu propaganda değil. bu ülke menfaatine yapılmış bir iş ama sen bunu anlayamayacak kadar sığ ve saplantılı bir herifsin.senin gibi troller malum zihniyetin ürünü olduğu için tıpkı suriye'nin kuzeyinde terör koridoru oluşturulurken yaptığınız gibi \"ne işimiz var orada\" diye onlarca konu altında profesyonel çalışma yaptı. biraz utanman olsa insan içine çıkmaman gerekir ama \"bir oy apo'nun partisine, bir oy atamın partisine\" deyip seçime katılacaksın, mehmetçik'e sayısız fayda sağlayan yerli ve milli teknolojilere çamur atacaksın, sonra da tabeladan tc'yi söktüler diye numaradan ağlayacaksın...https://bitcointalk.org/index.php?topic=5340328.0https://bitcointalk.org/index.php?topic=5283029.0https://bitcointalk.org/index.php?topic=5393563.0https://bitcointalk.org/index.php?topic=5315617.0https://bitcointalk.org/index.php?topic=5269968.0Quote from: mandown on May 02, 2023, 06:09:33 AM...Cidden komik duruma düşüyorsun.  HDP bir terör partisimi mecliste çoğunluk bende değil sanırım sizde. kapatır elini kolunu bağla. Yasanı uygula kardeşim elinden tutanmı var. ...heh, akp-mhp hdp'yi kapatmadı, o halde yaşasın chp-hdp işbilirliği sıvaması da gelmiş.ben komik duruma düşmüyorum, sen işbirliğini gizlemek için ve normalleştirmek için ve hatta propaganda amacıyla trollük yaptığın için cahil durumuna düşüyorsun.QuoteSiyasî Partilerin kapatılması, Yargıtay Cumhuriyet Başsavcılığının açacağı dava üzerine Anayasa Mahkemesi tarafından karara bağlanır. Anayasa Mahkemesi, temelli kapatma yerine, dava konusu fiillerin ağırlığına göre ilgili siyasî partinin Devlet yardımından kısmen veya tamamen yoksun bırakılmasına karar verebilir.https://www.anayasa.gov.tr/tr/mahkeme/gorev-ve-yetkileri/siyasi-parti-kapatma-davalari/sen ki tescilli bir trol olarak utanmadan 7/24 propaganda yapacaksın da biri çıkıp burada olduğu gibi senin arkanı yaktığında karşındakini propaganda ile suçlayacaksın öyle mi? Quote from: trendcoin on April 26, 2023, 02:29:28 AMsen ki test kitlerinin parasını atatürk ödemiş diyebilecek seviyede birisin (https://bitcointalk.org/index.php?topic=5234799.msg54080851#msg54080851). sen ki sınırımızda terör koridoru oluşturulurken ne işimiz var suriye'de diyen birisin (https://bitcointalk.org/index.php?topic=5227282.msg53878013#msg53878013). sen ki diyanet hakkında dezenformasyon yayan tescilli bir trolsün (https://bitcointalk.org/index.php?topic=5442003.msg61917315#msg61917315).gel kuchu kuchu gel, altımda çırpınmaya devam et! konu, iki-üç yıldır burada ve başka yerlerde yapılan antipropagandanın çöpe gitmesini detaylandırıyor. biraz omurgası olan biri varsa çıkıp o caps'deki şeyler yanlış desin, konuyu sulandırmaya çalışarak trollük yapmasın, trollüklerine de verilecek cevabım var elbette ama milletin cahilliğini giderecek kadar boş vaktim yok çünkü ben 7/24 internet kafede yaşayan ve trolümsü davranışlarda bulunan bir canlı türü değilim.Yine her zamanki gibi sorduğum sorulara  farklı şekillerde cevapler vermişssin. 21 yıllık iktidarın yıllardır yaptığı gibi.Cidden altında çırpındığımı mı düşünüyorsun. Yukarıda sorduğum soruya ve daha önceki sorduğum sorulara bozuk teyp gibi aynı şekilde konudan alakasız cevapler veren sensin. Forumun en kral trolüsün seni ciddiye alıp mesaj yazan nadir kişilerden biriyim.Yukarıdaki arkadaşların dediği gibi sana bir pasta tarifi lazım. Daha önce ne demiştim. Omurga çok önemli bir organ.Sanırım 18 Yıl cafe işlettim senin ne iş yaptığını bilmiyorum sana bakınca yaptığım meslek ile gurur duyuyorum. En azından omurgalıyım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "May 02, 2023, 07:33:08 AM",
      "body": "konu: soytarılık yaparak dalga geçtiğiniz şey gerçek oldu.birtakım cevaplar: - açılım yaptınız, insanlar sokakta kürtçe konuşabiliyor ve şarkı söyleyebiliyor. o halde biz de hdp ile birlikte olacağız.- vecihi hürkuş, nuri demirağ ve diğerlerinin dün yaşadıkları bugün yeniden yaşanabilir sorun yok.- ekonomi çok kötü, viskici yıldız teyzem aç kaldı.- selahattin demirtaş ve osman kavala içeriden çıkınca bir daha bu ülkede adalet yok demeyeceğiz.- emre uslu'nun geri dönüş biletini yeşile döndüreceğiz.- biz herkesle helalleştik.- akp bizi dinsiz yaptı, eskiden çok tapardık biz. - gaz buldunuz, biz de hazımsızlık çekeceğiz.cidden problemlisiniz, omurganızdaki probleminizden bağımsız olarak zihinsel problemleriniz de olabilir. sizinle sağlıklı diyalog kurmak mümkün değil şu devasa şehir hastanelerini sizi tedavi etmek için yapmış olabilirler. ya sen benim gözümde tescilli bir trolsün, senin bu forumda bir sürü fiyaskon var ama kafası azıcık çalışan muhaliflerin hepsi senin gibi insanlar yüzünden çekildikleri/düştükleri bataklığa lanet ediyor ve seçimleri senin gibi insanlar yüzünden kaybettiklerini biliyorlar. ben erdoğan'ın yerinde olsaydım senin gibi insanlara ekstradan önem verirdim ve sayınızın artması için habitatınızı genişletirdim. sen ve senin gibiler doğru düzgün türkçe yazamıyor olsalar bile onlar için son derece değerli varlıklarsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 02, 2023, 07:42:40 AM",
      "body": "QuoteÇilekli Pasta Tarifi'nin MalzemeleriKeki için;2 adet yumurta1 su bardağı şeker1 su bardağı sütYarım su bardağı sıvı yağ1 yemek kaşığı dolusu kakao1 paket vanilya1 paket kabartma tozu1 buçuk su bardağı unKreması için;5 su bardağı süt1 su bardağı şeker4 yemek kaşığı un2 yemek kaşığı nişasta1 paket toz krem şanti1 kase çilekTarifi yazmıyorum hayal gücünle hallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kastoriante",
      "created_time": "June 12, 2024, 09:55:35 PM",
      "body": "Boruyu Esad döşüyormuş. Bir döşeyişte 10 milyon sığınmacı çakrtıyormuş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}