{
  "id": "topic_5501197",
  "title": "Riginac111",
  "author": "Riginac111",
  "created_time": "June 27, 2024, 02:10:33 AM",
  "content": "At this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?If you love bitcoin don't ignore this thread.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5501197",
  "comments": [
    {
      "author": "Hazink",
      "created_time": "June 27, 2024, 02:36:56 AM",
      "body": "First, at what value will they use at the end of the day to determine how much the three bitcoins are worth? Will the value be captured as of the time it was given to you, or will they use the price it will be worth in 3 months to do the math?  3 months to me is too short to start up any tangible business or investment and expect a return at the end of the day, and if you also decide to invest in other crypto currencies, how sure will one be that the value of those once's won't go down under that given period? 3 months is actually too small, so if you ask me what I will do, I would rather hold that bitcoin for the next 3 months and take whatever profit it will give me at the end of the third month. or if they say I can't keep the bitcoin, then I will have to go into spot trading, sell out the bitcoin I was given, and still buy it back after a few hours or days with a little price difference, and store it for the next three months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "June 27, 2024, 02:53:09 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMAt this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you?If I have 3 BTC, what will I do next three months?I definitely will hold the 3 BTC next three months and I will hold it longer than 3 months. 3 years or 8 years, I will hold my bitcoin because if you know that there are very limited people who have 3 BTC, why do I need to sell it or convert it to other things like real estate or altcoins, to say I find other investments and look for profit. While with Bitcoin, I have a good investment asset that will help me to get profit.Don't buy altcoins because they are top altcoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 27, 2024, 03:35:59 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMmy question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?If I am given 3 BTC, I will sell almost all and use it to setup a business that can be generating me more money. I can use parts of the profit that I am making from the business to invest in bitcoin. In making money, what that is most important to me is business while the money made from business can be used for other things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "June 27, 2024, 03:37:54 AM",
      "body": "Op 3bitcoin to be spent in three months as at now that the price of bitcoin is around 61k I can't think of any better investments than the bitcoin investment it self. Holding the bitcoin would definitely be the better option for me but is it a must for the profit to come within the said time of 3 months what if I don't generate profit is there a clause to return the bitcoin that was given to me if yes is the answer I will consider holding some bitcoin then switch into trading since I can generate profit under three months while trading.There is no way to think of something different from bitcoin investment because anything aside bitcoin investment under 3 months you can't guarantee yourself of making profit unless you choose to gamble or run into some ponzi scheme since they are the only investment that talks about doubling your investment capital within a short period but since bitcoin investment is not a quick money given business 3 months in making profit will be determined on the price of bitcoin when it was given to you and the current price after 3 months after your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "June 27, 2024, 03:49:54 AM",
      "body": "If there are no other interesting investment, I don't have to spends my Bitcoin to other investment because Bitcoin is enough for me to be the main investment. I prefer still holds my Bitcoin for the next 3 months or longer than that but if I have to spends 3 Bitcoin, maybe I will buy land or property or gold. But I don't knows how big the return of income when I buy my Bitcoin with that three things.This situation is difficult to buy and sell land or property but Gold maybe a good things for me to buy. But with Bitcoin in my hands, that will be enough for me to gets a big return of profit. I don't minds to holds Bitcoin for a long term because I already sees Bitcoin performance.In my country, the possibility to have the other investment is gold, land and property. But that still makes me thinks that it is not easy to have investment of land and property. That is why I still prefer to hold Bitcoin than to convert it to other investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "June 27, 2024, 04:18:39 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMmy question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?The only investment oppurtunity I can think of that can give you the same or maybe even more profit from bitcoin is if you set up a business. Even then it might not be a complete success but with 3 bitcoin, you can venture out into anything and the chances of you being successful raises immensely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 27, 2024, 04:19:14 AM",
      "body": "We're not living in dream, I don't see there's a quality by asking this kind type of question.I don't want to tell what will I do if someone give me 3 BTC for free, first thing I would ask where is my 3 BTC? so I can know if it's serious or just a joke. So, @OP are you have 3 BTC right now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "June 27, 2024, 04:20:08 AM",
      "body": "Quote from: Riginac111At this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?I don't think, I have idea on any investment that I will invest three Bitcoin and it will bring me three Bitcoin in three months, because many investments use to take a long years before someone can start receiving income that will make you to improve financially in the environment. Even in Bitcoin investment, it use to take a long time before you will begin to see the good side of the investment, because some time, the bullish season use to take like three or four years before it can appear massively for investors to achieve Bitcoin. Even the Real estate investment that can give someone huge amount of Bitcoin, it will going to take some years in my country before you can achieve three Bitcoin, I like Bitcoin investment because is a decentralized investment that is not control by the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jatiluhung",
      "created_time": "June 27, 2024, 04:29:06 AM",
      "body": "Quote from: _act_ on June 27, 2024, 03:35:59 AMQuote from: Riginac111 on June 27, 2024, 02:10:33 AMmy question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?If I am given 3 BTC, I will sell almost all and use it to setup a business that can be generating me more money. I can use parts of the profit that I am making from the business to invest in bitcoin. In making money, what that is most important to me is business while the money made from business can be used for other things.I like this way. because the 3 BTC given is intended to make more money, the only way to go is to use it as business capital. And if the business runs smoothly then we can spend every profit on bitcoin so that we can have 3 BTC back within a certain period of time and make us still have the business in the end and also have 3 BTC back. But that's all if it goes smoothly and successfully. because in business there is a risk that is as big as in the world of investment. Because if we choose the wrong business and fail to manage the business, bankruptcy will await us.But if 3 BTC is given to me not to earn more then I would rather keep it longer. And waiting for the bull market to really come and reach its peak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "June 27, 2024, 05:00:34 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMAt this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?If you love bitcoin don't ignore this thread.Diversifying the money from the exchange of the gifted Bitcoin will be my best option. I will have to consider buying some precious stones like gold and silver because they have proved to be effective hedges against inflation. My next business will be real estate. I might consider buying some land and building residential houses in some cities in my country. House rents have kept increasing with the rate of inflation. So owning a house will help to sustain the money and save it from losing its value over time. My country is currently giving out licences for modular refineries. I could also decide to start up one after considering the capacity three Bitcoin can afford. Quote from: BlackBoss_ on June 27, 2024, 02:53:09 AMIf I have 3 BTC, what will I do next three months?I definitely will hold the 3 BTC next three months and I will hold it longer than 3 months. 3 years or 8 years, I will hold my bitcoin because if you know that there are very limited people who have 3 BTC, why do I need to sell it or convert it to other things like real estate or altcoins, to say I find other investments and look for profit. While with Bitcoin, I have a good investment asset that will help me to get profit.Don't buy altcoins because they are top altcoinsI think you partially misunderstood the question. OP said in his illustration that you have been mandated to invest your Bitcoin in other areas within three months. So if you keep it more than that, I guess you have not kept the terms of the agreement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Egii Nna",
      "created_time": "June 27, 2024, 05:25:05 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMAt this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?If you love bitcoin don't ignore this thread. Investments are classified based on what everyone wishes and believes. If not, any investment requires risk, and the higher the risk you take, the higher the profit or reward you will have, and it is a fact that 3 BTC in any country is a huge amount of money that will be enough for you to start up another investment that can be more risky than a bitcoin investment or less risky, so it will be based on your intelligence to choose the one that will be best for you. But for me, I have two investments that I might join, and I know any of them might take me to the next level or even give me the opportunity when investing best in bitcoin to buy more than 3 BTC. Thus, there are no other investments but real estate or forex trading. However, I know that forex trading is a higher-risk investment, which is why it is more risky than real estate, but considering the profit, or, let's say, the rewards you will get, it is also very high. So I will consider it also, which I have to go and have a higher knowledge of it before I join, because if it is not the same as bitcoin trading, but for that of real estate, I already have a bit of knowledge about that and it entails lower risk, but it is also an alternative to joining apart from bitcoin investment, so these two investments that I mentioned are capable of taking to the next level and have more profit, simpler or even more than in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "June 27, 2024, 06:59:57 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMAt this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?While three BTC are without a doubt a nice amount to begin your journey, three months is too short for any of your movements to be called an investment, to start a business or implementing any long term plan.With such a time limit your only realistic choice to try to earn money is by trading, but this scenario will require for you to be an expert trader already, otherwise you will waste all of those three months just trying to learn the basics, so besides that option, I do not see how could someone use those three BTC to earn money reliably during such a short time frame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "June 27, 2024, 07:08:15 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMAt this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?If you love bitcoin don't ignore this thread.Dude, are you using Google Translate or something?I don't give investment advice or financial advice. There were thousands of forum threads about \"If you had X amount of money, where would you invest them?\" Just search for an old forum thread and don't spam the forum with low quality posts.If you are looking for an investment opportunity with a ridiculously high ROI two things will happen:1.You might get scammed, because the investment projects offering absurd ROI are scams.2.You might lose your money, because higher ROI also means higher risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "June 27, 2024, 07:14:31 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMAt this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?If you love bitcoin don't ignore this thread.As you said, with inflation and the economy still in a difficult period, doing business or doing any job will face many challenges. Meanwhile, as we have seen bitcoin's performance quite well from last year to now, why do we have to sell our bitcoins to participate in other fields when the investment is still potentially profitable? Even if I get 3 bitcoins or the bitcoins I currently hold, I will continue to hold them instead of selling them to invest in other areas. I don't know what the situation is like in other countries, but my observation is that my country's economic situation is still very stagnant and gloomy, it is still not the right time to do business or invest in any field, IMO. Investing in bitcoin is still a better choice than any traditional investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "June 27, 2024, 07:15:06 AM",
      "body": "Now I cannot Ignore this thread because of what you said OP, i love bitcoin. Anyway, kidding aside, I think diversifying cryptocurrency to other coins would make you even more money the buy BTC again. it is the most effective way to profit in this current market. I don’t think that the country is that much of a factor except if it is illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Katherine_Alicia",
      "created_time": "June 27, 2024, 08:21:29 AM",
      "body": "I may be a little bit biased here, but if it were me I`d buy a mining rig and sort some kind of deal for cheap electricity and get mining! or buy mining time from those that can do it cheaper than I could and point them at something like KAS or BCH, and then buy BTC with the proceeds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "June 27, 2024, 09:09:33 AM",
      "body": "Quote from: _act_ on June 27, 2024, 03:35:59 AMIf I am given 3 BTC, I will sell almost all and use it to setup a business that can be generating me more money. I can use parts of the profit that I am making from the business to invest in bitcoin.Within three months? What kind of business can you set up within three months to give you more than the value of the bitcoin? I want to know because I am someone that loves business and I have the thinking that no matter the amount of money spent to start up a business, the business can still fail and then three months is still a very short time for any big business to accumulate enough profits to even cover the cost of setting it up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 27, 2024, 09:20:04 AM",
      "body": "Quote from: Riginac111 on June 27, 2024, 02:10:33 AMAt this present economic inflation in some countries and you are given three (3 btc) bitcoin to be spend within period of three (3) months for other investment that will give you return of income that worth values of three bitcoin that has been given to you to spend within three months time...my question is that as a cryptocurrency investor and bitcoin investors what investment can you join differently that will give you more than the value of bitcoin given to you? Both in your country and any other countries you maybe?Such person that could give you money to look for it kind within the space of three months is a wicked person, don't think he's trying to help you, instead to put one in debt because you may have eventually loose the entire money at the cause, no investment made is guaranteed for anyone and if a y promises to give you high returns within a shor time, then its likely to be a scam, if you can have enough time, bitcoin could yield same but no one want to have patience to earn and be safe than taking unnecessary risk on what can gives quick money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "June 27, 2024, 10:54:45 AM",
      "body": "I would like to diversify my investment portfolio. First of all I would not take out all of my 3 btc. To be honest just 2 btc would be enough for me to go and explore more diverse investment opporutnity.I would like to invest in real estate and set up a rental business in which will give me passive income. The rest, I would also use to set up a business. Something that sells and is trendy at the current time. The remaining 1 btc, I will keep holding it in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}