{
  "id": "topic_5469077",
  "title": "Macoach",
  "author": "Macoach",
  "created_time": "October 03, 2023, 03:46:18 PM",
  "content": "Going back a full month, in late August or early September, many people on several site and on the cryptocurrency Twitter were suddenly very vocal in saying that September was bound to be bearish for Bitcoin because the previous two had seen significant dips and because September is simply historically one of the worst performing months for cryptocurrency.But this time was different: Here, we can see that despite the lack of significant bullish news, with the possible exception of the release of the Ethereum ETFs, September did close a full +3.9% higher than August. Even so, with such low levels of liquidity as they are at the moment, we don't need much news to impact prices.In any case, this is yet another example of how previous performance is not a guarantee of future performance. While I personally believe that the past will always and forever be a part of the future, many people simply have a tendency to anticipate the future and base their financial decisions on the past, which I believe to be reckless and nothing more than gambling.While history can never be exactly the same, it does frequently rhyme, therefore this does not mean that we should dismiss it entirely. The past, present, and future must all be balanced, and we must pay attention to both the past and the present as well as the future.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469077",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "October 03, 2023, 04:20:54 PM",
      "body": "There is something that has pushed the price to rise below $26,000. No one knows what it is and it may appear as purchases in the records of one of the companies when this quarter’s report is issued. But in any case, a 4% rise does not mean that we will witness an upward wave for this month, as we may remain below 30k most likely as there is not enough momentum for this historical resistance level, but before the end of the year we will be between 30k to 40k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 03, 2023, 04:23:24 PM",
      "body": "This thread is best fit into the speculation section and not bitcoin discussion as you think, you can move the thread to the appropriate section from the bottom of the page by your left bottom you get the option to move or lock thread from there. Back to the topic of discussion, although Bitcoin hard a rough start for the month of September but towards the middle of that month, bitcoin began to build a momentum that brought us to the current position, although, many spectators thought Bitcoin was going to do a more downtrend movement, but the end justifies the means and Bitcoin was able to end the month of September in around 28k which is a highly remarkable point for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "October 03, 2023, 06:12:56 PM",
      "body": "Quote from: hugeblack on October 03, 2023, 04:20:54 PMThere is something that has pushed the price to rise below $26,000. No one knows what it is and it may appear as purchases in the records of one of the companies when this quarter’s report is issued. But in any case, a 4% rise does not mean that we will witness an upward wave for this month, as we may remain below 30k most likely as there is not enough momentum for this historical resistance level, but before the end of the year we will be between 30k to 40k.I'm bit confused about the phrase \"rise below\". I assume this is a typo but you are right about the momentum. The month of October historically appears to be bulish and previously the bitcoin price managed to rally more than 50%. The $30k is crucial resistance level which needs to be broken, and as long as bear holds it the confidence level won't rise.It appears to be a strong year for bitcoin. Despite some significant fud from Luna, FTX, Binance, and Mt. Gox, we are still close to the $30k level which is significant. I am not confident that bitcoin will be around $40k by the end of the year. I think the market will continue its movement sideways until the first ETF approval deadline in January 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "October 04, 2023, 05:58:30 AM",
      "body": "Quote from: Ojima-ojo on October 03, 2023, 04:23:24 PMThis thread is best fit into the speculation section and not bitcoin discussion as you think, you can move the thread to the appropriate section from the bottom of the page by your left bottom you get the option to move or lock thread from there. Back to the topic of discussion, although Bitcoin hard a rough start for the month of September but towards the middle of that month, bitcoin began to build a momentum that brought us to the current position, although, many spectators thought Bitcoin was going to do a more downtrend movement, but the end justifies the means and Bitcoin was able to end the month of September in around 28k which is a highly remarkable point for Bitcoin.I agree that not reaching the cycle thingy, because it has been going up and that's the most important thing when you could do that. The end of September has been something that we could reach to a point.I believe that we are going to be something that you could calculate and we need to be careful about it but that doesn't mean that we are going to end up some risks that we are going to take as well so we should be careful about that too. Take the risk as much as you want to take but also be careful about the drop and that is going to be something that prevents it for the drop so you should be helping each other out. So, always end up with getting that type of return one way or another which should be something that could profit you while also making sure that you are not going to hurt your finances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 04, 2023, 10:08:06 AM",
      "body": "Quote from: Sophokles on October 03, 2023, 06:12:56 PMIt appears to be a strong year for bitcoin. Despite some significant fud from Luna, FTX, Binance, and Mt. Gox, we are still close to the $30k level which is significant. I am not confident that bitcoin will be around $40k by the end of the year. I think the market will continue its movement sideways until the first ETF approval deadline in January 2024.Betting that any ETF will cause a change in price may not be wise. It is true that we do not have deadlines for this year, but there is no guarantee that it will be approved in January.The price of $30,000 seems strong and the momentum is not enough to break through, but we still have 3 months and several times to meet the resistance level, one of which I think we will succeed in. Therefore, it is most likely that we will test 31,800 before the end of the year, and from there it will be determined whether we will see 40,000 or whether the price will continue its sideways movement.But if we drop below 26,700, there will be a double bottom pattern, meaning we will touch $17,000 again, but I think the possibility is $40-$41k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 05, 2023, 10:48:51 PM",
      "body": "We know that Bitcoin has some price history, but that doesn't mean that the price of Bitcoin some years ago would be the same as for the current year and in the same month. We know that the price of Bitcoin is usually affected by different factors, and as such, every year the price will slightly or significantly be different. The price of Bitcoin and other crypto currencies is so dynamic that one cannot just decide what the price will be or what it will not be next. We mostly only speculate on the price of cryptocurrency because we want the price to go up so we can sell to make a profit, while some also want the price to fall so they can buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "October 05, 2023, 10:57:34 PM",
      "body": "well history can be used for reference but of course people with logic will never think that everything will just be the same like in the past surely there will be difference even more so in the case of price speculation like this things would always differs compared with the past, same with stock.therefore referencing is always a thing to do but also judging from current condition of the market is just more relevant in this case.I personally would just invest at price suited for entry and then simply just don't care for next two year so that I don't need to do some complicated analysis since everything is so uncertain anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "October 05, 2023, 11:05:57 PM",
      "body": "Quote from: Macoach on October 03, 2023, 03:46:18 PMGoing back a full month, in late August or early September, many people on several site and on the cryptocurrency Twitter were suddenly very vocal in saying that September was bound to be bearish for Bitcoin because the previous two had seen significant dips and because September is simply historically one of the worst performing months for cryptocurrency.But this time was different: Here, we can see that despite the lack of significant bullish news, with the possible exception of the release of the Ethereum ETFs, September did close a full +3.9% higher than August. Even so, with such low levels of liquidity as they are at the moment, we don't need much news to impact prices.In any case, this is yet another example of how previous performance is not a guarantee of future performance. While I personally believe that the past will always and forever be a part of the future, many people simply have a tendency to anticipate the future and base their financial decisions on the past, which I believe to be reckless and nothing more than gambling.While history can never be exactly the same, it does frequently rhyme, therefore this does not mean that we should dismiss it entirely. The past, present, and future must all be balanced, and we must pay attention to both the past and the present as well as the future.I think that this whole cycle is already canceled. When everyone predicts something (like impact of halving), they also prepare for it. And when this happens in a big enough scale, it means that the fundamental reason people see for the price growth, is already priced in. And that what i think has happened. So we are in uncharted waters now.Maybe it will affect in other halvings more when people aren't counting on it and haven't bought everything they could before it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "October 05, 2023, 11:06:22 PM",
      "body": "We're all that belief that history repeats itself but when it doesn't, that's not an unsual thing. What we can conclude for this September is that the always thing that matters for Bitcoin as a description and that is it's being unpredictable.No matter how tallied your analysis and predictions backed and based with good and accurate data, you'll never know how its attitude towards the market is when its feature is unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "October 06, 2023, 12:37:11 AM",
      "body": "Quote from: o48o on October 05, 2023, 11:05:57 PMQuote from: Macoach on October 03, 2023, 03:46:18 PMGoing back a full month, in late August or early September, many people on several site and on the cryptocurrency Twitter were suddenly very vocal in saying that September was bound to be bearish for Bitcoin because the previous two had seen significant dips and because September is simply historically one of the worst performing months for cryptocurrency.But this time was different: Here, we can see that despite the lack of significant bullish news, with the possible exception of the release of the Ethereum ETFs, September did close a full +3.9% higher than August. Even so, with such low levels of liquidity as they are at the moment, we don't need much news to impact prices.In any case, this is yet another example of how previous performance is not a guarantee of future performance. While I personally believe that the past will always and forever be a part of the future, many people simply have a tendency to anticipate the future and base their financial decisions on the past, which I believe to be reckless and nothing more than gambling.While history can never be exactly the same, it does frequently rhyme, therefore this does not mean that we should dismiss it entirely. The past, present, and future must all be balanced, and we must pay attention to both the past and the present as well as the future.I think that this whole cycle is already canceled. When everyone predicts something (like impact of halving), they also prepare for it. And when this happens in a big enough scale, it means that the fundamental reason people see for the price growth, is already priced in. And that what i think has happened. So we are in uncharted waters now.Maybe it will affect in other halvings more when people aren't counting on it and haven't bought everything they could before it.When everyone is really that anticipating for something and expecting for those common patterns which on based up on the things that happened in the past and everyone is really just doing on the same move.Then expect that the market would really be always loving on going to the opposite side of things which would be leaving into those people who are waiting for the right opportunity whether to sell or to buy.Its true that not all things that happened in the past would reflect out and would really be happening in the future on which we do know that market isnt something that predictable or could really be knownon which it would really be that causing up for tons of people had move into the other direction. Always put up into our minds that probabilities of opposite things to happen would be always there.Manipulators or market movers are the ones who would really be dictating this market and same goes with a little bit mix of sudden adoption.Quote from: jossiel on October 05, 2023, 11:06:22 PMNo matter how tallied your analysis and predictions backed and based with good and accurate data, you'll never know how its attitude towards the market is when its feature is unpredictable.Always anticipate those probabilities or chances and this is why it would be always relevant on setting out some plan B just in case the market didnt move as planned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "October 06, 2023, 07:27:19 AM",
      "body": "Quote from: Macoach on October 03, 2023, 03:46:18 PMGoing back a full month, in late August or early September, many people on several site and on the cryptocurrency Twitter were suddenly very vocal in saying that September was bound to be bearish for Bitcoin because the previous two had seen significant dips and because September is simply historically one of the worst performing months for cryptocurrency.But this time was different: Here, we can see that despite the lack of significant bullish news, with the possible exception of the release of the Ethereum ETFs, September did close a full +3.9% higher than August. Even so, with such low levels of liquidity as they are at the moment, we don't need much news to impact prices.In any case, this is yet another example of how previous performance is not a guarantee of future performance. While I personally believe that the past will always and forever be a part of the future, many people simply have a tendency to anticipate the future and base their financial decisions on the past, which I believe to be reckless and nothing more than gambling.While history can never be exactly the same, it does frequently rhyme, therefore this does not mean that we should dismiss it entirely. The past, present, and future must all be balanced, and we must pay attention to both the past and the present as well as the future.We should understand the matter of speculation and especially according to historical data, many people seem to believe it as an indicator, and really I think it should only be a reference. We need to combine research with many other things to evaluate the current state, over the past month the news is really not too special and most of it focuses on negative issues. There are also some expectations that many people speculate about the future, but I see that anyway, the strategies are different so I personally don't pay too much attention to whether it has to increase or decrease, a new bullish cycle that many hopelessness can happen in the next 2 years, so a short game will only increase tension.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "October 06, 2023, 09:16:57 AM",
      "body": "Quote from: Macoach on October 03, 2023, 03:46:18 PMGoing back a full month, in late August or early September, many people on several site and on the cryptocurrency Twitter were suddenly very vocal in saying that September was bound to be bearish for Bitcoin because the previous two had seen significant dips and because September is simply historically one of the worst performing months for cryptocurrency.Well, some people did it but not me. These are some reasons I see, we haven't heard of huge scams and hacking incidents in big exchanges nor have we heard of another big issue against the SEC. This has a significant impact on the investors who feel that the market is good and reliable which leads them to buy more. This will eventually tell us that sometimes history never repeats itself and has no assurance at all. Plus, the volatility of the market makes things and the upcoming trend become unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 06, 2023, 12:11:28 PM",
      "body": "We cannot isolate a specific month of the year and start making assumptions based on similar months in past years, and everyone who tries to promote this is looking for facts that do not exist in this data. A fixed 30-day interval in the chart will not lead you to a correct conclusion, and it is better to read the technical analysis. According to the available conditions and taking into account the support and resistance points.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "October 06, 2023, 09:59:34 PM",
      "body": "Quote from: dunfida on October 06, 2023, 12:37:11 AMQuote from: jossiel on October 05, 2023, 11:06:22 PMNo matter how tallied your analysis and predictions backed and based with good and accurate data, you'll never know how its attitude towards the market is when its feature is unpredictable.Always anticipate those probabilities or chances and this is why it would be always relevant on setting out some plan B just in case the market didnt move as planned.I agree.Having a plan is a must because you'll not know if from this cycle, there will be some catch or it will just the same in the past. And that's why it is better to be prepared than not.There will be good analysis with history of back up but still the unpredictability remains for Bitcoin that you should always expect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "October 07, 2023, 10:50:26 AM",
      "body": "After all, we can't expect either to see the market keep on bearing when there is a change in market demand. If we see that the month of August is in bearish condition, we can never expect this will happen the next month. Absolutely, it all depends on the situation and September is quite moving high a little as people are taking advantage of the situation. A sudden increase in buying demand will result to a price increase and that is what we experience. And also, this October, neither we experienced the same as in September - that is what we called market volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaberwock",
      "created_time": "October 08, 2023, 06:06:32 PM",
      "body": "Quote from: Sophokles on October 03, 2023, 06:12:56 PMQuote from: hugeblack on October 03, 2023, 04:20:54 PMThere is something that has pushed the price to rise below $26,000. No one knows what it is and it may appear as purchases in the records of one of the companies when this quarter’s report is issued. But in any case, a 4% rise does not mean that we will witness an upward wave for this month, as we may remain below 30k most likely as there is not enough momentum for this historical resistance level, but before the end of the year we will be between 30k to 40k.I'm bit confused about the phrase \"rise below\". I assume this is a typo but you are right about the momentum. The month of October historically appears to be bulish and previously the bitcoin price managed to rally more than 50%. The $30k is crucial resistance level which needs to be broken, and as long as bear holds it the confidence level won't rise.It appears to be a strong year for bitcoin. Despite some significant fud from Luna, FTX, Binance, and Mt. Gox, we are still close to the $30k level which is significant. I am not confident that bitcoin will be around $40k by the end of the year. I think the market will continue its movement sideways until the first ETF approval deadline in January 2024.Same here. At first I thought it's about disruption of the hike but after reading again, I think it means the price are now above $26k. The increase wasn't big enough, that is why we haven't heard a cause of it but it can be a normal buy out of the retail investors and the whales. There is no momentum yet because it's not that long since we witness the price rise.It can also be an impostor like other previous months where it is only positive in the beginning but the rest where full of reds, so lets not assume too much. Luna, FTX and Mt. Gox issue are I think old already but I know it was only Binance who got involved in the issue last time. There is no need to worry though as the issue seem to be fixed already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "October 09, 2023, 01:00:26 AM",
      "body": "Bitcoin becomes even less volatile every year. The fluctuation is not as good as before. Trading on the spot is every harder than before caused by there was no enough fluctuation. The small capital traders are impossible in making decent profit from bitcoin trading. The small shrimp shall go to the futures to get decent profit. It's likely there will be no huge gain or loss during october. The price seems stuck in the same place. Bitcoin was not increasing a lot last month. The main question is how long this trend will happen? The same thing is also happening with the altcoin as well. The big coins are not worhy anymore to be used for spot trading. The price swing is not that good as before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 10, 2023, 01:37:10 AM",
      "body": "Quote from: makishart on October 09, 2023, 01:00:26 AMhttps://i.postimg.cc/tTjbvhms/b4whw.pngBitcoin becomes even less volatile every year. The fluctuation is not as good as before. Trading on the spot is every harder than before caused by there was no enough fluctuation. The small capital traders are impossible in making decent profit from bitcoin trading. The small shrimp shall go to the futures to get decent profit. It's likely there will be no huge gain or loss during october. The price seems stuck in the same place. (.....)This is also what I observe, for me, as time goes by every year, we are going healthy and becoming healthier, maybe because of a lot of factors. For me, the first is because of the volume and adaption.Volume by there are already lot of money pouring in the cryptocurrency market plus a lot of new people is getting introduced to cryptocurrencies everyday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "October 10, 2023, 07:00:58 AM",
      "body": "Quote from: makishart on October 09, 2023, 01:00:26 AMBitcoin becomes even less volatile every year. The fluctuation is not as good as before. Trading on the spot is every harder than before caused by there was no enough fluctuation. The small capital traders are impossible in making decent profit from bitcoin trading. The small shrimp shall go to the futures to get decent profit. It's likely there will be no huge gain or loss during october. The price seems stuck in the same place. Bitcoin was not increasing a lot last month. The main question is how long this trend will happen? The same thing is also happening with the altcoin as well. The big coins are not worhy anymore to be used for spot trading. The price swing is not that good as before. It is natural that this is the case, the behavior of assets changes over time as they get closer to their real value, when bitcoin was worth just a few cents people could buy a few dollars worth of bitcoin and become millionaires, but this is no the case anymore, spot trading was way more profitable due to the volatility of bitcoin being extreme, but as its market cap has increased its volatility has gone down, fortunately it is not as if traders lack assets to trade in this market thanks to the high number of altcoins that exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}