{
  "id": "topic_5453903",
  "title": "Mywayismylife",
  "author": "Mywayismylife",
  "created_time": "May 24, 2023, 05:26:12 PM",
  "content": "Hallo,sorry ich bin neu hier und habe ein Problem.Ich hatte Ingesamt 2 BTC Zahlungen in der Electrum Wallet durchgeführt, leider sei die Zahlung nie angekommen. Was kann ich tun? Besteht die Möglichkeit die Transaktion rückgängig zu machen, oder die BTC irgendwie zurück zu bekommen, oder feststellen zu lassen ob der Empfänger sie vielleicht doch erhalten hat?Für jede Antwort wäre ich sehr dankbarGrüße und Danke euch",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453903",
  "comments": [
    {
      "author": "DireWolfM14",
      "created_time": "May 24, 2023, 06:30:42 PM",
      "body": "Quote from: Mywayismylife on May 24, 2023, 05:26:12 PMHallo,sorry ich bin neu hier und habe ein Problem.Ich hatte Ingesamt 2 BTC Zahlungen in der Electrum Wallet durchgeführt, leider sei die Zahlung nie angekommen. Was kann ich tun? Besteht die Möglichkeit die Transaktion rückgängig zu machen, oder die BTC irgendwie zurück zu bekommen, oder feststellen zu lassen ob der Empfänger sie vielleicht doch erhalten hat?Für jede Antwort wäre ich sehr dankbarGrüße und Danke euchIf you need help in German, you'll need to post in your local section: https://bitcointalk.org/index.php?board=16.0To answer your question; if the transaction has any confirmations, it's unlikely that you'll be able to recover the money.  Mempool has been very busy in the last few weeks, so many transactions with low fees are lingering for a while before they get their first confirmation.  That might be why you are having trouble.Find your transaction in Electrum, and copy the Transaction ID, then check it in a blockchain explorer, such as Mempool.space.  That will show you if the transaction is confirmed, and to what address the transaction was sent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chris601",
      "created_time": "May 25, 2023, 02:30:32 AM",
      "body": "Um deine Fragen beantworten zu können, brauchen wir mehr Informationen.Grundsätzlich ist es schwer bis unmöglich, Bitcoin-Transaktionen \"zurück zu holen\" also für ungültig zu erklären. Das ist praktisch nur für unbestätigte Zahlungen, also für Transaktionen, die noch nicht in einen Block aufgenommen, überhaupt möglich. Wenn die Transaktion bestätigt ist, ist sie praktisch in Stein gemeißelt. Somit kann man aber eine deiner Fragen zunächst einfach beantworten: Ja, man kann genau sagen, ob der Empfänger eine Zahlung erhalten hat. Das kannst du sehen (Transaktion bestätigt oder nicht), der Empfänger und jeder andere, der die Transaktionskennung oder die Empfangsadresse kennt. Da hilft auch kein Leugnen des Empfängers.Eine Hoffnung: Seit einigen Wochen ist der Mempool ziemlich voll und Transaktionen relativ teuer. Wenn du deine Transaktionen mit sehr kleiner Gebühr versendet hast, haben sie deine Wallet möglicherweise tatsächlich noch nicht verlassen und sind nicht beim Empfänger angekommen. Dann besteht die Chance, dass man sie wieder bekommt. Aber das kläen wir, wenn wir wissen, was passiert ist.Prüfe folgendes: - Schaue die Überweisung in der Wallet an. Steht dort so etwas wie \"xxx Bestätigungen\" oder \"unbestätigt\"?   - Falls bestätigt: Schaue dir die Transaktion genau an und prüfe, ob die Empfängeradresse wirklich exakt die ist, die dir der Empfänger mitgeteilt hat.- Falls ja, hat er sein Geld definitiv bekommen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "May 25, 2023, 12:26:48 PM",
      "body": "Herzlich willkommen Mywayismylife,wenn du magst (und es deine Privatsphäre zulässt) kannst du uns gerne ein paar mehr Infos zukommen lassen.Das korrekte Vorgehen um auch ohne uns mehr rauszufinden hat Chris601 bereits beschrieben.Ich hoffe das Problem lässt sich noch klären und du bleibst uns hier als neues Mitglied erhalten.Gruß",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Koal-84",
      "created_time": "May 25, 2023, 02:11:32 PM",
      "body": "Quote from: Mywayismylife on May 24, 2023, 05:26:12 PMHallo,sorry ich bin neu hier und habe ein Problem.Kein Thema und ein herzliches Willkommen.QuoteIch hatte Ingesamt 2 BTC Zahlungen in der Electrum Wallet durchgeführt, leider sei die Zahlung nie angekommen. Was kann ich tun? Besteht die Möglichkeit die Transaktion rückgängig zu machen, oder die BTC irgendwie zurück zu bekommen, oder feststellen zu lassen ob der Empfänger sie vielleicht doch erhalten hat?Das einfachste ist einmal deine Tx in einen Blockexlorer eingeben und du siehst sofort ob die Transaktionen bereits bestätigt wurden.Wenn der Empfänger korrekt ist kannst du dir dieses Thread ansehen, damit könnte dein Problem gelöst werden.Transaktion hängt fest? Was tun wenns klemmt.Wenn eine Transaktion bereits Bestätigt ist, gibt es kein zurück holen mehr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "May 25, 2023, 09:47:44 PM",
      "body": "@MywayismylifeWäre halt echt nicht schlecht wenn wir die Transaktion nummer falls es eine gibt bekommen würden oder du sie schreiben könntest wenn es ok ist.Dann könnten wir nachschauen was mit deinen Coins passiert ist , aber ohne diese Information ist es schwer was zu sagen.Vorschläge hast du ja bekommen was und wie man nachschauen kann , hoffe es nicht wieder ein Thread wo man danach vom Ersteller nichts mehr hört.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mywayismylife",
      "created_time": "May 27, 2023, 12:40:39 PM",
      "body": "Hallo😎✌️Vielen Dank erstmal für eure Antworten und Mühe.Ich werde in Kürze auf das ein oder Angebot zurück kommen und persönlich eine Nachricht zukommen lassen. ✌️😎Danke vielmals",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "May 28, 2023, 10:40:26 PM",
      "body": "Du solltest bedenken, daß man es deaktivieren kann, von Newbies PMs zu empfangen, weil das häufig für Spam mißbraucht wurde. Also nicht wundern, wenn es nicht klappen sollte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chris601",
      "created_time": "May 30, 2023, 10:51:14 AM",
      "body": "Außerdem solltest du KEINEM (hier) trauen. ;-)Alles, was öffentlich hier gepostet steht, kann von der Community widersprochen werden. Dumme Tipps, die dir jemand per PN gibt, nicht.Wenn du deine Transaktionskennung nicht öffentlich nennen willst, ist das absolut okay. Dann könnte man aber an Beispielen öffentlich zeigen, wie eine bestätigte oder unbestätigte Transaktion aussieht.Wenn deine Transaktionskennund nicht wirklich geheim ist, du sie aber trotzdem nicht öffentlich ins Internet stellen möchtest (absolut okay!), kann die jeder Nutzer hier tatsächlich sagen ob uns an welcher Adresse sie angekommen ist.Mehr private Hilfe solltest du aber nicht unbedingt annehmen. Lass und lieber öffentlich diskutieren - wir sind hier ja im Anfänger-Bereich, da gibt es kaum blöde Fragen. Das meiste sollte sich anhand von Beispielen auch erklären lassen ohne, dass du deine Details preisgibst.btw: Bitcoin ist pseudonym. Man kann anhand der Transaktion ziemlich viele Details sehen. Mitunter ließe das Rückschlüsse auf dein Bitcoin-Vermögen zu oder das des Empfängers.Die Welt hat aber anhand deiner Transaktionskennung praktisch keine Chance irgendwas zu deiner Identität oder näheres zu besagter Transaktion zu erfahren.Wir könnten aber vielleicht einen Betrug oder auffälliges Verhalten erkennen. Dann ist es zwar zu spät, aber es passiert jemand anderem nicht auch noch mal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}