{
  "id": "topic_5452121",
  "title": "jcojci",
  "author": "jcojci",
  "created_time": "May 09, 2023, 03:58:34 PM",
  "content": "We don't know exactly what causes bitcoin transaction fees to soar. I tried to take a look from mempools.space and found very high spikes.Then I try to see the 4 year cycle that occurs in bitcoin. There I saw that on January 14 2021, there was a spike in bitcoin.source: https://mempool.space/graphs/mempool#4yAnd I also try to see the altcoin season cycle for 4 years. And I saw on January 14 2021, that a spike triggered the altcoin season.source: https://www.blockchaincenter.net/altcoin-season-index/I don't know whether the spike in bitcoin transaction fees this time will trigger an altcoin season like before or if this is just an attack on the network. People seem to be holding their bitcoins and not sending them anywhere until the network stabilizes and transaction fees return to normal.Maybe it's time people will switch to altcoins for a while and looked to profit in altcoins. What do you think?I am sorry if this is not the right board. Please suggest me the right board if I make a mistake.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452121",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "May 09, 2023, 04:16:06 PM",
      "body": "Quote from: jcojci on May 09, 2023, 03:58:34 PMWe don't know exactly what causes bitcoin transaction fees to soar. I tried to take a look from mempools.space and found very high spikes.It is absurd that someone that you still don’t know the major effect causing the mempool congestion. There are have been many threads on it and each is pointing to the BRC20 tokens and ordinals. Go to the beginners board to find threads on it Quote from: jcojci on May 09, 2023, 03:58:34 PMMaybe it's time people will switch to altcoins for a while and looked to profit in altcoins. What do you think?This will definitely cause FOMO most especially on these BRC20 tokens. We can’t see how their market cap is increasing insanely everyday. Also the transaction fees on bitcoin transaction will also make some people to convert some of there bitcoin holdings to Alticoins either for fast transactions or anticipation for Alticoin pump. But this is certainly a risky move because all these Alticoins are just pump and dump coins. Maybe except the top ranking ones but it is bad to transfer one’s bitcoin to Alticoins.Personal I am sticking to holding on to my bitcoin till this transaction fee saga cools down before making any transaction. Atleast I know my funds is save on a currency that is trusted not some Alticoins that come dump any moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 09, 2023, 04:51:29 PM",
      "body": "Quote from: jcojci on May 09, 2023, 03:58:34 PMI don't know whether the spike in bitcoin transaction fees this time will trigger an altcoin season like before or if this is just an attack on the network. People seem to be holding their bitcoins and not sending them anywhere until the network stabilizes and transaction fees return to normal.Because so many people are forced to pay a high fee for their transactions to be processed in a short period of time, network congestion and high gas fees are becoming out of control. Although I have yet to see a spike in altcoins, if the Bitcoin transaction fee does not drop soon, perhaps some people will hold their Bitcoin rather than waste some of it due to the high transaction fees.QuoteMaybe it's time people will switch to altcoins for a while and looked to profit in altcoins. What do you think?I am sorry if this is not the right board. Please suggest me the right board if I make a mistake.Sure, some traders will now prefer to switch to altcoins for easy access and a good profit if there is a spike, but I can see that Bitcoin remains in control of the market, and who knows, maybe some altcoins will pump soon.Quote from: Zaguru12 on May 09, 2023, 04:16:06 PMPersonal I am sticking to holding on to my bitcoin till this transaction fee saga cools down before making any transaction. Atleast I know my funds is save on a currency that is trusted not some Alticoins that come dump any moment. Exactly! There is a very high risk in moving to altcoins at this time, and some people will begin to consider moving to BRC-20 Network tokens, which may not end well because it is a chain that is not as popular as ERC-20 and BSC Network, but people will risk theirs because of FOMO, which is not advisable at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 09, 2023, 05:08:21 PM",
      "body": "Obviously I don't know what will happen in the end, but the quote — \"past performance is no guarantee of future results\" will most likely be at play in this case. Especially if that's the only data you're going to base your decision off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "May 10, 2023, 12:48:09 AM",
      "body": "Quote from: jcojci on May 09, 2023, 03:58:34 PM...I don't know whether the spike in bitcoin transaction fees this time will trigger an altcoin season like before or if this is just an attack on the network. People seem to be holding their bitcoins and not sending them anywhere until the network stabilizes and transaction fees return to normal.Maybe it's time people will switch to altcoins for a while and looked to profit in altcoins. What do you think?I am sorry if this is not the right board. Please suggest me the right board if I make a mistake.It is better for you to not consider such tangential factors when it comes to something as important as deciding in which coin to invest, this is because as anyone knows the reason there is a spike on the number of transactions on the mempool has to do with ordinals, and this has nothing to do with an altcoin season, an altcoin season will for the most part only appear after the bull run has been in place for bitcoin for some time, and since this is not the case, it is a mistake to think the altcoin season will come so soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "May 10, 2023, 04:30:05 AM",
      "body": "Quote from: jcojci on May 09, 2023, 03:58:34 PMsource: https://mempool.space/graphs/mempool#4yit is indeed the Good spikes that year and it happens before the Bullrun .QuoteAnd I also try to see the altcoin season cycle for 4 years. And I saw on January 14 2021, that a spike triggered the altcoin season.source: https://www.blockchaincenter.net/altcoin-season-index/another one for altcoin chance , and yes it also happened as I monitored the marketthose days.QuoteMaybe it's time people will switch to altcoins for a while and looked to profit in altcoins. What do you think?but switching for altcoins instead of Bitcoin just to profit? meaning this market is truly not for something that will be useful in the future instead just a trading platform?I don't know what comes next but for me ? i will never let converting my bitcoin to altcoins literally , maybe some part? but not the whole funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "May 10, 2023, 02:17:57 PM",
      "body": "Quote from: Zaguru12 on May 09, 2023, 04:16:06 PMIt is absurd that someone that you still don’t know the major effect causing the mempool congestion. There are have been many threads on it and each is pointing to the BRC20 tokens and ordinals. Go to the beginners board to find threads on it Is it because of BRC20 tokens and ordinals? How about this article? But whatever it is, we can only speculate on it without knowing the real causes.Code:https://decrypt.co/139259/bitcoin-ddos-ordinals-inscriptions-attackQuote from: Zaguru12 on May 09, 2023, 04:16:06 PMThis will definitely cause FOMO most especially on these BRC20 tokens. We can’t see how their market cap is increasing insanely everyday. Also the transaction fees on bitcoin transaction will also make some people to convert some of there bitcoin holdings to Alticoins either for fast transactions or anticipation for Alticoin pump. But this is certainly a risky move because all these Alticoins are just pump and dump coins. Maybe except the top ranking ones but it is bad to transfer one’s bitcoin to Alticoins.Personal I am sticking to holding on to my bitcoin till this transaction fee saga cools down before making any transaction. Atleast I know my funds is save on a currency that is trusted not some Alticoins that come dump any moment. It's okay if it's a pump and dump way because it's fine for them as long as they can make a profit in usdt or btc. The important thing is that they can still make a profit and if other people follow the way, that will be up to them because no one is inviting them to participate in the pump and throw away.Quote from: peter0425 on May 10, 2023, 04:30:05 AMbut switching for altcoins instead of Bitcoin just to profit? meaning this market is truly not for something that will be useful in the future instead just a trading platform?I don't know what comes next but for me ? i will never let converting my bitcoin to altcoins literally , maybe some part? but not the whole funds.Who knows about that? But that could happen right? People with a lot of bitcoins would not mind moving to the altcoin market for a while while waiting for bitcoin transaction fees to decrease and stabilize again. But for those of us who don't have a lot of bitcoins, it's better if we keep holding the bitcoins. Well, we will see what is going happen later",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "May 12, 2023, 09:03:10 PM",
      "body": "Quote from: Hyphen(-) on May 09, 2023, 04:51:29 PMQuote from: jcojci on May 09, 2023, 03:58:34 PMI don't know whether the spike in bitcoin transaction fees this time will trigger an altcoin season like before or if this is just an attack on the network. People seem to be holding their bitcoins and not sending them anywhere until the network stabilizes and transaction fees return to normal.Because so many people are forced to pay a high fee for their transactions to be processed in a short period of time, network congestion and high gas fees are becoming out of control. Although I have yet to see a spike in altcoins, if the Bitcoin transaction fee does not drop soon, perhaps some people will hold their Bitcoin rather than waste some of it due to the high transaction fees.I don't think there is a big number of them. What I mostly see in the forum is complaints about how high the fee in Bitcoin right now. If you are an institution or a whale, you will not be bothered about this increase but you can continue your operations as usual. The network congestion in Bitcoin is caused by another thing while the high gas fees in ETH is not a new issue anymore.Even if the Bitcoin network returns to normal, many of us will still prefer to HODL our Bitcoin due to its future potential. I don't think what happened to Bitcoin lately has a relation to altcoin season but it might lead some people to use altcoins temporarily which can help to push their price upwards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 12, 2023, 09:48:26 PM",
      "body": "Quote from: fullhdpixel on May 12, 2023, 09:03:10 PMEven if the Bitcoin network returns to normal, many of us will still prefer to HODL our Bitcoin due to its future potential. I don't think what happened to Bitcoin lately has a relation to altcoin season but it might lead some people to use altcoins temporarily which can help to push their price upwards.We're still on the same page, I know the Bitcoin network congestion is temporary, and as many people have said, it's caused by BRC20 and the Ordinals, which has resulted in an increase in the Bitcoin network fee to a higher level than usual.However, some people will continue to hold their Bitcoin and divert their attention to Altcoins in order to profit, whereas the Altcoin price is not moving as expected, indicating that the network fee increase had no effect on the price movement of the Bitcoin Market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "May 13, 2023, 08:14:06 AM",
      "body": "In my opinion transaction on chain has nothing to do with the altcoin season the cause of spike is because ordinal that everyone talked about. one think that I know about altseason is bitcoin dominance as you can see by this image",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irsykes",
      "created_time": "May 13, 2023, 11:42:51 AM",
      "body": "Quote from: Hyphen(-) on May 12, 2023, 09:48:26 PMQuote from: fullhdpixel on May 12, 2023, 09:03:10 PMEven if the Bitcoin network returns to normal, many of us will still prefer to HODL our Bitcoin due to its future potential. I don't think what happened to Bitcoin lately has a relation to altcoin season but it might lead some people to use altcoins temporarily which can help to push their price upwards.We're still on the same page, I know the Bitcoin network congestion is temporary, and as many people have said, it's caused by BRC20 and the Ordinals, which has resulted in an increase in the Bitcoin network fee to a higher level than usual.However, some people will continue to hold their Bitcoin and divert their attention to Altcoins in order to profit, whereas the Altcoin price is not moving as expected, indicating that the network fee increase had no effect on the price movement of the Bitcoin Market. If the BRC-20 hype lasts a long time, it is likely that the expensive cost will continue for a long time, far from being cheap as it used to be. the effect is that transaction users who are always full make the network busy, more and more people use fees above normal, high hype will start to be quiet. because of complaints of disproportionate costs. on the other hand there is an airdrop that BRC-20 users have been waiting for",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "May 14, 2023, 12:53:05 PM",
      "body": "Quote from: jcojci on May 09, 2023, 03:58:34 PMWe don't know exactly what causes bitcoin transaction fees to soar. I tried to take a look from mempools.space and found very high spikes.Then I try to see the 4 year cycle that occurs in bitcoin. There I saw that on January 14 2021, there was a spike in bitcoin.source: https://mempool.space/graphs/mempool#4yAnd I also try to see the altcoin season cycle for 4 years. And I saw on January 14 2021, that a spike triggered the altcoin season.source: https://www.blockchaincenter.net/altcoin-season-index/I don't know whether the spike in bitcoin transaction fees this time will trigger an altcoin season like before or if this is just an attack on the network. People seem to be holding their bitcoins and not sending them anywhere until the network stabilizes and transaction fees return to normal.Maybe it's time people will switch to altcoins for a while and looked to profit in altcoins. What do you think?I am sorry if this is not the right board. Please suggest me the right board if I make a mistake.I think this is different. For example, everyone predicted Bitcoin would go to the 100K last year. But what happened? You can not guarantee anything based on past results. What you can do is look into the fundamental values of the alitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 14, 2023, 02:42:17 PM",
      "body": "I have to check the fee on mempool and good news, the highest priority is now down to $0.98 and that means that we've got cheaper fees as of now. Hopefully that this is going to keep going and the fees will be stable at cents and everyone can enjoy again these transactions coming in and out from bitcoin. This is the pride of bitcoin that we're all having even if the price won't be a lot as expected by many but it shall come there soon and probably after the halving.@op, the images that you've used aren't visible and I'm sure that you can see it as well. You might want to reupload that using talkimg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ElmedoRator",
      "created_time": "May 16, 2023, 01:53:58 PM",
      "body": "This is likely to annoy the mob of Bitcoin maximalists even more than sharing their mempool with degeners and JPEGs. But if they are truly committed to the mission of scaling Bitcoin, maybe it's time to think more broadly. I see short-term hype about some things, the possibility that ordinals and tokens can actually exist on the Bitcoin network is still unclear, maybe the immediate problem for this needs to look at overcoming limitations It's happened with ERC20 before, but I'm still seeing it play out in the same way that the fees on the Bitcoin network will keep going up due to the increasing number of daily users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "May 17, 2023, 08:46:47 PM",
      "body": "Quote from: blockman on May 14, 2023, 02:42:17 PMI have to check the fee on mempool and good news, the highest priority is now down to $0.98 and that means that we've got cheaper fees as of now. Hopefully that this is going to keep going and the fees will be stable at cents and everyone can enjoy again these transactions coming in and out from bitcoin. This is the pride of bitcoin that we're all having even if the price won't be a lot as expected by many but it shall come there soon and probably after the halving.@op, the images that you've used aren't visible and I'm sure that you can see it as well. You might want to reupload that using talkimg.People were too much concerned, some even started panicking seeing the fees soaring so high it was obvious that the issue will get solved soon, but to be honest, I didn't expect the transaction fees to become normal so quickly, though I knew it's temporary I was expecting the problem to take about a week or so before things start getting normal again.This will obviously keep going since we all know that it barely happens with Bitcoin when the fees go this high, we have seen this happening with Ethereum more and the problem existed for way more time in the Ethereum network than this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "May 17, 2023, 09:08:52 PM",
      "body": "Quote from: blockman on May 14, 2023, 02:42:17 PMI have to check the fee on mempool and good news, the highest priority is now down to $0.98 and that means that we've got cheaper fees as of now. Hopefully that this is going to keep going and the fees will be stable at cents and everyone can enjoy again these transactions coming in and out from bitcoin. This is the pride of bitcoin that we're all having even if the price won't be a lot as expected by many but it shall come there soon and probably after the halving.@op, the images that you've used aren't visible and I'm sure that you can see it as well. You might want to reupload that using talkimg.I think, there's problem with the imgur site, because the images coming from this site is showing that error lately.Anyway, most already forgot what they created or posted, so I don't think he will upload the new images on this thread.And yes, talking about the fees, it has gone down a lot already as compared last week. This situation may be owed to the creation of BRC 20 tokens and ordinals but we can't fully categorize it as altcoin season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}