{
  "id": "topic_5436641",
  "title": "lizarder",
  "author": "lizarder",
  "created_time": "January 24, 2023, 06:24:40 PM",
  "content": "This time we are back to doing social service activities by involving the Lhok Kaju English Center (LEC) community and the Friends of Duafa Community, the heavy rainfall that occurred for these two days caused our area to be flooded, but there were several Subdistrict that experienced major flood impacts ? 1. Tangse2. Kembang Tanjong 3. Kota SigliOf the 23 sub-districts in our district, according to several sources we received, only three sub-districts were quite badly affected by the floods and access roads there are still unusable, these areas include the sub-districts of Tangse, Kembang Tanjong and Sigli City. However, only for several village areas where road access is cut off and temporarily inaccessible.Meanwhile, in Sigli City District, there are two villages that have had a severe impact on the flood, namely:1. Gampong Asan2. KeunireTo be honest, I don't have many sources of funds that can reach the three districts/districts, because if calculated from the number of needs, the money needed to help is very large, especially with the large number of people living there. Therefore, I took the initiative to sell some of my bitcoins to help the two villages. According to a survey conducted by the LEC community, Gampong Asan and Keunire needed to provide a public kitchen for two days, so we agreed to help in these two places.The assistance we provide is in the form of groceries in fulfilling public kitchens?1. Eggs2. Rice 5 Kg3. Indomie4. Unibis bread5. Mineral Water              Distribution of Food Packages for Public KitchensThe small efforts that we have made can at least help a little for the needs of public kitchens for the people there and the local government has also been present to help these needs which are more affordable in large quantities.Hopefully this flood disaster will be a warning to all of us, that protecting forests and the environment is a must. Today the alert status is still in effect until an undetermined time limit, because rainfall still has the potential to occur and the water in the river is still quite worrying, we hope this will pass quickly so that people can continue their activities as usual.As a commitment in the previous post, that I want to continue to spread kindness through the value of bitcoin, with a simple effort and not forcing what I can't do. Today many people ask me and LEC directly, they ask where the financial assistance that we have brought so far when carrying out activities has come from.\"I answer from the income I get so far in bitcoin\".At least this effort has influenced some people who have never heard of bitcoin before and now many people who used to not believe in the bitcoin investment that I did, have consciously acknowledged the truth that I once conveyed.To appreciate the great work created by Satoshi Nakamoto, I will continue to be committed to spreading the good values of bitcoin, even though the impact is not yet widespread in the area where I live, I will continue to do this with the LEC community and also do not rule out collaborating with the community others in our area.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436641",
  "comments": [
    {
      "author": "Hyphen(-)",
      "created_time": "January 24, 2023, 06:49:04 PM",
      "body": "This is a job well done; your kindness is acknowledged, and it is something that some people here are capable of. I wish you luck and hope you can continue the good work you've started.I believe that people in that community will now take Bitcoin very seriously, even if some of them still believe Bitcoin is a scam, because they can now see the results of Bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 24, 2023, 08:17:36 PM",
      "body": "This doesn't translate to Bitcoin helping flood victims, it's more like a philanthropist trading their Bitcoin to provide aid to those in need. A more direct example of Bitcoin playing a role would be if it was used in areas were bank accounts were being frozen and Bitcoin was the only means of circumventing government regulations.Great job nonetheless. Acts of kindness such as this goes a long way to those who are in need and shows the good side of humanity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "January 24, 2023, 08:48:24 PM",
      "body": "I wouldn’t exactly say it’s a role bitcoin has to play in efforts to alleviate the suffering of the communities affected by flooding cause it doesn’t. I could as well say “the role of fiat currency in efforts to alleviate poverty in the world”. I do think you’re doing an admirable thing and a great service to the flood affected communities by providing relief materials to people In need. While also spreading the gospel of bitcoin along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "January 24, 2023, 08:59:02 PM",
      "body": "Quote from: Hyphen(-) on January 24, 2023, 06:49:04 PMThis is a job well done; your kindness is acknowledged, and it is something that some people here are capable of. I wish you luck and hope you can continue the good work you've started.I believe that people in that community will now take Bitcoin very seriously, even if some of them still believe Bitcoin is a scam, because they can now see the results of Bitcoin investment. In fact, this could be an eye- opener to the people especially to the flood victims that bitcoin is never a tool to scam people but to help people instead. Through your actions OP, people will eventually realized that bitcoin  should never be banned because the profits can be very helpful in times like this. Thank you OP for your generosity and I hope you will continue what you have started together with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "January 24, 2023, 09:16:31 PM",
      "body": "Quote from: Upgrade00 on January 24, 2023, 08:17:36 PMThis doesn't translate to Bitcoin helping flood victims, it's more like a philanthropist trading their Bitcoin to provide aid to those in need. A more direct example of Bitcoin playing a role would be if it was used in areas were bank accounts were being frozen and Bitcoin was the only means of circumventing government regulations.Great job nonetheless. Acts of kindness such as this goes a long way to those who are in need and shows the good side of humanity. Bitcoin won’t be valuable unless you start trading it. And OP had willingly trade some of his bitcoins because he think that’s the only way to provide funds for the flood victims and save them temporarily from their current situation. This act of kindness should always deserve the acknowledgement, and I think OP has received it well just by simply seeing how grateful the victims were by seeing their happy faces receiving some assistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "January 24, 2023, 09:43:18 PM",
      "body": "Keep up the good work, don't discourage yourself. You are making a big difference in the lives of people affected by the floods, both through the material aid you provide and through your attention and sensitivity to environmental issues and promoting positive values through bitcoin. Keep working together with the LEC community and other local communities to reach even more people and make an even bigger difference. Don't forget to follow your passions and goals, no matter how small they may seem. There are always opportunities to make a difference in the lives of others, even with small efforts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "January 25, 2023, 11:02:13 AM",
      "body": "Weldone OP. You did a good work. This act of kindness can not be hidden or swept under the rug. Your good works would speak for you in time to come. However, I believe you did not only just donated to them like that and also from what I have read, I am well pleased with your kind gesture. Hope you did teach them on how to save their bitcoin when they purchase it and letting them know that their bitcoin under their custody is very much safe being in the custody of a third party exchanges which the safety can never be guaranteed. They should be conversant with the phrase \" not your keys, not your coin\" and possibly tell them to check reviews in exchange before dealing with them. Letting them know about wallets is another because I believe they have no idea how it works. Let them know the Best wallet for them which will cost them little amount for gas fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "January 25, 2023, 12:23:01 PM",
      "body": "This is kindness at its best, thank you for helping those in need, I have a suggestion though I don't know if this is against the forum rules. Why not drop a funding address for these people? I as a person will be willing to help, I will do what I can to help those in need, may the almighty lord reward you for your kindness, thanks for helping and if you think that my suggestion makes sense pls do create a thread or edit this one and drop a funding address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 25, 2023, 03:31:13 PM",
      "body": "Anyone who helps others in need deserves the respect of the community because they have done a good and noble deed, but I appreciate even more those who do good deeds and remain anonymous. As for Bitcoin, in the whole story there is no doubt that it played a role, because the OP got part of his income, I assume, from signature campaigns, and in that way he helped those who needed help - in other words, if it wasn't for that income, he wouldn't have anything to help with. However, I think that Bitcoin can have a much bigger role in donations when the usual ways are blocked/disabled or in anonymous donations, as is the case with Ukraine, which received significant funds precisely with the help of Bitcoin.Quote from: lizarder on January 24, 2023, 06:24:40 PMAs a commitment in the previous post, that I want to continue to spread kindness through the value of bitcoin, with a simple effort and not forcing what I can't do. Today many people ask me and LEC directly, they ask where the financial assistance that we have brought so far when carrying out activities has come from.\"I answer from the income I get so far in bitcoin\".It's not a good way to spread awareness that Bitcoin exists, because you draw attention to yourself and become a possible target for hackers or even physical attacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ginsan",
      "created_time": "January 25, 2023, 04:44:08 PM",
      "body": "A very good deed to help others especially in a flood disaster like this. I am still not able to do this nor do I have a group as you show in this thread.btw but I agree with what @lucius said where every charitable act or thing that has been done so far is better for you to keep it anonymous. But I also encourage you to publish and it becomes a guide for other members to do good things in their lives.So do the members in your group also have income from bitcoin or does this only come from your income on this forum or from the results of trading cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "January 26, 2023, 05:37:03 PM",
      "body": "Quote from: Upgrade00 on January 24, 2023, 08:17:36 PMQuote from: Iroh on January 24, 2023, 08:48:24 PMIt's not bitcoin that helps flood victims, but I think this is inseparable from the efforts made through bitcoin trading, it's just that this role doesn't directly use bitcoin. Also, the example you gave is different from the current case and even if I were to force myself to give the bitcoins, I'm sure they wouldn't be able to use it and at that point all they need is simple help, in the form of meeting the needs of the kitchen for them to eat.And the bitcoins would be of no use to the flood victims if I gave them to them, especially since they don't know how to use them.Quote from: Lucius on January 25, 2023, 03:31:13 PMAs for Bitcoin, in the whole story there is no doubt that it played a role, because the OP got part of his income, I assume, from signature campaigns, and in that way he helped those who needed help - in other words, if it wasn't for that income, he wouldn't have anything to help with. However, I think that Bitcoin can have a much bigger role in donations when the usual ways are blocked/disabled or in anonymous donations, as is the case with Ukraine, which received significant funds precisely with the help of Bitcoin.And as I said before, even if I force myself to give them bitcoin directly, it will also be unusable and will not work for them, because so far they have no idea how bitcoin works to generate fiat currency as a frequent transaction they use.Long before I joined the signature campaign, we had already carried out social activities in the field of non-formal education Bitcoin Changes Lives, Touches Non-Formal Education for Underprivileged ChildrenQuote from: Lucius on January 25, 2023, 03:31:13 PMIt's not a good way to spread awareness that Bitcoin exists, because you draw attention to yourself and become a possible target for hackers or even physical attacks. This has been an initial consideration before I tried to venture out to spread awareness that bitcoin exists and to be honest I have another target in my efforts, because so far I have conducted a small survey regarding people's knowledge of bitcoin, but from the initial journey of the survey what I do, people adapt more quickly even though they haven't reached the investment stage yet.That also applies to members of my own community and they are also increasingly aware that bitcoin can do something not only serve as an investment, for example doing charity work that is not supported financially by other parties though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "January 26, 2023, 05:58:22 PM",
      "body": "Quote from: lizarder on January 24, 2023, 06:24:40 PMTherefore, I took the initiative to sell some of my bitcoins to help the two villages.Once again you have proven yourself to be a benefactor for anyone who needs help. Not only do I credit you in this effort, but your fellow community members deserve credit for their great efforts for humanity. It doesn't matter how much you sell your bitcoin for charitable purposes, as long as the goal is to help, I hope God will reward you in some other way.The title may be bit misleading, I don't think bitcoin plays direct and significant role in this charity but since you have your income paid out via bitcoin and some of it you donate to charity. This is just about you and how you spend your income for useful things like charity, but for whatever I really appreciate your efforts. Continue this great effort, best for you bro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "January 26, 2023, 06:03:43 PM",
      "body": "This to me translate to how btc is use to do charitable work in palaces that needed it most. Bitcoin is a decentralized digital currency that allows for borderless transactions on its network, even the remotely unbanked people can have access to funds in form of aids through the use of btc. And not only that, btc trades has helped a lot of people financially to be able to render help in whichever way they can. So indirectly, btc has somehow contributed to the efforts to help the flood affected communities. @OP keep the good work going and I sympathise with the victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Olubetty88",
      "created_time": "January 26, 2023, 06:22:04 PM",
      "body": "Wow, what a great idea of drawing the knowledge of the this people to Bitcoin trading. You just won most of their heart to the Bitcoin trading. Your constant checking on them will surely help those that are eager to learn.Keep it up @ OP, your reward is here on Earth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "indah rezqi",
      "created_time": "January 26, 2023, 07:20:10 PM",
      "body": "Quote from: lizarder on January 26, 2023, 05:37:03 PMIt's not bitcoin that helps flood victims,Of course it is, and it is actually you who are helping the victims of the flood by donating some of your earning from bitcoin regardless of whether it is from signature campaign or from your profit in trading. I see what you mean, but as others have said, your work is very noble.Quote from: lizarder on January 26, 2023, 05:37:03 PMAnd the bitcoins would be of no use to the flood victims if I gave them to them, especially since they don't know how to use them.I guess it will be useful even if you are sure not many of them know how it is valuable bitcoin and tradable. I mean, there's always way to tell them that bitcoin is valuable and tradable if you do it to spread awareness. So if you basically want to spread bitcoin awareness to people then you should donate bitcoin to each of the beneficiaries instead of helping them with their food needs but it sounds like this is not what you are saying. What is implied in my mind is that some of your money from bitcoin earnings is donated to flood victims.But, lizarder, believe me, you have done very well and I am really impressed with you. As you did the previous day, the Rohingya refugees are really benefiting from your efforts. Your good work is exemplary, it's a charitable act to look forward to when people need help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "January 26, 2023, 08:25:52 PM",
      "body": "Quote from: Iroh on January 24, 2023, 08:48:24 PMI wouldn’t exactly say it’s a role bitcoin has to play in efforts to alleviate the suffering of the communities affected by flooding cause it doesn’t. I could as well say “the role of fiat currency in efforts to alleviate poverty in the world”. I do think you’re doing an admirable thing and a great service to the flood affected communities by providing relief materials to people In need. While also spreading the gospel of bitcoin along the way. Don't get OP wrong, maybe he's using the earnings he realized from bitcoin investment or rather spending from his bitcoin wallet savings to ensure that he reach out to the flood disaster victim, but what i cannot ascertain from his claim is the genuity to this fact since I can't read clearly from the image he oost as payment evidence for the transaction made but i know quite alright that many times I've seen members on the forum doing something related.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "January 27, 2023, 04:22:07 PM",
      "body": "Quote from: Falconer on January 26, 2023, 05:58:22 PMQuote from: Bitstar_coin on January 26, 2023, 06:03:43 PMQuote from: Olubetty88 on January 26, 2023, 06:22:04 PMQuote from: indah rezqi on January 26, 2023, 07:20:10 PMQuote from: 348Judah on January 26, 2023, 08:25:52 PMIf it weren't for bitcoin, maybe this charity work that my community (LEC) does would not have happened, regardless of the role bitcoin has indirectly helped them. If we talk about the role, should it be directly related to bitcoin as a raw product of the efforts made by my community, we have to identify a more relevant direct approach for them to accept, so that the form of assistance will be delivered even if it is not bitcoin as a direct product given. Of course I have to sell bitcoins and convert them into fiat to buy some of the needs I mentioned, because of their transactions, I and the shop that provides the goods have not accepted bitcoins as a means of transaction.If you have ever heard of the role of rivers in influencing agriculture for people in need, was the intended audience for rivers? of course not because water is the basic fulfillment and other processes are as supports. This kind of role I mean, because trying to provide bitcoins directly will do nothing and can't be used for them. But whatever it is, I really appreciate the advice and input from all of you, because this will encourage me to do other charitable activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "January 27, 2023, 04:34:37 PM",
      "body": "Regardless of whether you are attempting to spread the word about bitcoin through this selfless act, I must applaud your charitable work for the good people in your community. I used to hear and believe that givers never lack, so I wish you more wealth and a brave heart to continue the good work you've begun. I'm sure your goal of spreading good news about bitcoin was also met, and I hope the good people who heard about it will also spread good news about it. Lizarder, you did an excellent job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "January 27, 2023, 07:53:58 PM",
      "body": "Quote from: Hyphen(-) on January 24, 2023, 06:49:04 PMThis is a job well done; your kindness is acknowledged, and it is something that some people here are capable of. I wish you luck and hope you can continue the good work you've started.I believe that people in that community will now take Bitcoin very seriously, even if some of them still believe Bitcoin is a scam, because they can now see the results of Bitcoin investment. This proves that bitcoin is legit and there is no traces of scam so people should start changing their negative perception about bitcoin. And after OP finally reveal that bitcoin is giving him huge profits which enable him to help and extend his assistance, then this will serve as an eye opener too that they should start investing in bitcoin rather than focusing on fiat alone and see depreciating value in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}