{
  "id": "topic_5410213",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "August 17, 2022, 10:52:17 AM",
  "content": "I made a small list, for everyone who does not know what to mine after ethereumEthereum Classic ETCEthereumPOW ETHWEthereumPOW  sp_ Ravencoin RVNConflux CFXErgoSeroBitcoin GoldBTCZGrinAIONXHVYEC NEOXBeamEtho(ETHO)Ubiq(UBQ)QuarkChain (QKC)Callisto(CLO)Metaverse(ETP)FluxFiroOther coinhttps://whattomine.com/I did not find the voting option.And all miners are interested in the question of the hash rate of asics on the Ethash algorithm. If it is at least 100 Th/s, then what will be on all coins with the Ethash algorithm? What if this hashrate is much higher?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410213",
  "comments": [
    {
      "author": "rdluffy",
      "created_time": "August 17, 2022, 05:47:06 PM",
      "body": "Quote from: FP91G on August 17, 2022, 10:52:17 AMI did not find the voting option.If you're talking about voting here in forum, I once struggled to find the poll option  You have to create a thread using post new poll instead of new topicLook here: It'll be interesting to see the end of POW to have a clue about the asics in ETH mining",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 17, 2022, 06:30:25 PM",
      "body": "The only other coins I've mined with GPUs in the last half a decade are (I believe) Ravencoin and Grin.  I think these two coins are good candidates for some hashrate after the ETH2.0 merge.  Grin maybe not so much as I don't think there's much support of it outside of this forum, but Ravencoin has always been a pretty profitable coin to mine with GPUs.  I wouldn't be surprised at all to see that hashrate move to RVN, but I think the network itself needs to show that it's capable of being used for real world things, or at least metaverse things...  Right now I'm not sure what people are doing with their RVN...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitKongy",
      "created_time": "August 17, 2022, 07:11:05 PM",
      "body": "BTCZ is nonsense, quiet and abandoned just like bitcoin cash, nothing new is happening around the projects if not they would have been a boss of their own by now, all attention for Flux and ETC, others are a no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 18, 2022, 11:21:45 AM",
      "body": "Quote from: rdluffy on August 17, 2022, 05:47:06 PMIt'll be interesting to see the end of POW to have a clue about the asics in ETH miningThank you, but I will not create a second topic.37 Th/s hashrate ethereum classic now. What are the ideas for determining the ASIC hash rate? This coin will be mined by both GPUs and ASICs after September 15 and I expect a minimum of 100 Th/s on this coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoATM",
      "created_time": "August 18, 2022, 12:17:00 PM",
      "body": "Quote from: FP91G on August 18, 2022, 11:21:45 AMQuote from: rdluffy on August 17, 2022, 05:47:06 PMIt'll be interesting to see the end of POW to have a clue about the asics in ETH miningThank you, but I will not create a second topic.37 Th/s hashrate ethereum classic now. What are the ideas for determining the ASIC hash rate? This coin will be mined by both GPUs and ASICs after September 15 and I expect a minimum of 100 Th/s on this coin.Meaning its never going to be profitable for miners especially those who have GPU rigs, but there is hope, the fork could actually makes sense and follows ETH market actions too, let people run their mouth but GPU mining will survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "August 20, 2022, 03:20:37 AM",
      "body": "We can estimate the ASIC hashpower but it won’t be accurate. Reason why is because there is no guarantee that all the hash power will switch to ETC after the merge.If the profitability is going to be extremely low, many ASICs will face doom as being another door stop pretty much. As much that hashpower will never switch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 20, 2022, 12:14:41 PM",
      "body": "Some miners believe that the recent increase in the hash rate in the Ethereum classic network is asics with new firmware that can no longer mine Ethereumhttps://www.coinwarz.com/mining/ethereum-classic/hashrate-chartIn the meantime, ASICs have no other good alternatives for mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "August 20, 2022, 04:26:49 PM",
      "body": "Quote from: FP91G on August 18, 2022, 11:21:45 AMThank you, but I will not create a second topic.37 Th/s hashrate ethereum classic now. What are the ideas for determining the ASIC hash rate? This coin will be mined by both GPUs and ASICs after September 15 and I expect a minimum of 100 Th/s on this coin.Honestly, I don't know exactly how to measure the total of Asics, as I said, I expect at least a clue after the ending of ETH mining, like division of hashrate, the percentage of miners pointing to coins etcIt will be hard, but this is exciting to be honest, all speculations we talked before is becoming real.We'll have some asnwers, all miners are probably anxious to see if a coin will replace ETH, maybe more than one coin, maybe a future coin will be the number one for miners...Only time will tell, and it's almost time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 20, 2022, 08:32:53 PM",
      "body": "Quote from: FP91G on August 20, 2022, 12:14:41 PMSome miners believe that the recent increase in the hash rate in the Ethereum classic network is asics with new firmware that can no longer mine Ethereumhttps://www.coinwarz.com/mining/ethereum-classic/hashrate-chartIn the meantime, ASICs have no other good alternatives for mining.So that is why I see a massive downgrade of how much of Ethereum Classic I can make in these last couple of days.I guess I should move the rigs to RVN or some other coins which are not that ASIC friendly or the problem will go further and the difficulty will increase much more making the ETC daily rewards even smaller and we are not yet in the end of Ethereum mining.Pretty bad days lie ahead at least until everything is sorted out after the Ethereum mining ending in 15 September approximately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Metroid",
      "created_time": "August 20, 2022, 10:45:03 PM",
      "body": "Quote from: adaseb on August 20, 2022, 03:20:37 AMWe can estimate the ASIC hashpower but it won’t be accurate. Reason why is because there is no guarantee that all the hash power will switch to ETC after the merge.If the profitability is going to be extremely low, many ASICs will face doom as being another door stop pretty much. As much that hashpower will never switch. This is too much fun, trolls spent too much money on mining and so far if they have not sold at top, they never even got close to roi, and worse, most have got the money from banks to invest and will end up in debt if they are not already, this is good, trolls need to learn that enough is enough, risk assessment is the first thing to do in cases like this, they should have checked crypto past history. Anyway, I warned them, not only me, many people here said not to buy gpus, I myself thought eth mining would last till february 2024 and end before next pre-bulrun, anyway, this is good, the faster the move the better, people will take their losses and learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "a1 Hashrate LLC2022",
      "created_time": "August 20, 2022, 10:59:46 PM",
      "body": "Quote from: FP91G on August 17, 2022, 10:52:17 AMI made a small list, for everyone who does not know what to mine after ethereumEthereum Classic ETCEthereumPOW ETHWEthereumPOW  sp_ Ravencoin RVNConflux CFXErgoSeroBitcoin GoldBTCZGrinAIONXHVYEC NEOXBeamEtho(ETHO)Ubiq(UBQ)QuarkChain (QKC)Callisto(CLO)Metaverse(ETP)FluxFiroOther coinhttps://whattomine.com/I did not find the voting option.And all miners are interested in the question of the hash rate of asics on the Ethash algorithm. If it is at least 100 Th/s, then what will be on all coins with the Ethash algorithm? What if this hashrate is much higher?I have an idea start moving to etc now.I have 10 gh hash.I now do 8.7 eth and 1.1 etcif diff lowers on eth now it will delay the bomb.moving 10% of your hash to etc will slow eth blocksdo this again in 5 days or so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YellowSwap",
      "created_time": "August 21, 2022, 07:46:48 AM",
      "body": "I prefer mining Ethereum still, why are miners trying to delay the bomb? I want the fork to happen faster than others because Eth will had incredible value once the merge is complete, there will be more scarcity and yes we have the ETHW anyway.Can someone tell me the difference between the ETHW and the sp_.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "August 21, 2022, 01:23:49 PM",
      "body": "Quote from: a1 Hashrate LLC2022 on August 20, 2022, 10:59:46 PMI have an idea start moving to etc now.I have 10 gh hash.I now do 8.7 eth and 1.1 etcif diff lowers on eth now it will delay the bomb.moving 10% of your hash to etc will slow eth blocksdo this again in 5 days or so.I didn't think about that, it's interesting, maybe you can create a thread to spread the idea.(I don't know how much we can delay doing this, we are small miners), maybe a couple of days?Quote from: YellowSwap on August 21, 2022, 07:46:48 AMI prefer mining Ethereum still, why are miners trying to delay the bomb? I want the fork to happen faster than others because Eth will had incredible value once the merge is complete, there will be more scarcity and yes we have the ETHW anyway.Can someone tell me the difference between the ETHW and the sp_.The value in USD of ETH is not guaranteed.I agree with you about having ETH, and yes, it's the cheap and easy way for us to mine some ETH and hold, but I'm doubt about the near future.Everyone is expecting a rising in value, but the merge can already be priced, and will depends of how BTC is going to be to follow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "a1 Hashrate LLC2022",
      "created_time": "August 21, 2022, 02:46:35 PM",
      "body": "Quote from: rdluffy on August 21, 2022, 01:23:49 PMQuote from: a1 Hashrate LLC2022 on August 20, 2022, 10:59:46 PMI have an idea start moving to etc now.I have 10 gh hash.I now do 8.7 eth and 1.1 etcif diff lowers on eth now it will delay the bomb.moving 10% of your hash to etc will slow eth blocksdo this again in 5 days or so.I didn't think about that, it's interesting, maybe you can create a thread to spread the idea.(I don't know how much we can delay doing this, we are small miners), maybe a couple of days?Quote from: YellowSwap on August 21, 2022, 07:46:48 AMI prefer mining Ethereum still, why are miners trying to delay the bomb? I want the fork to happen faster than others because Eth will had incredible value once the merge is complete, there will be more scarcity and yes we have the ETHW anyway.Can someone tell me the difference between the ETHW and the sp_.The value in USD of ETH is not guaranteed.I agree with you about having ETH, and yes, it's the cheap and easy way for us to mine some ETH and hold, but I'm doubt about the near future.Everyone is expecting a rising in value, but the merge can already be priced, and will depends of how BTC is going to be to follow.I am working on Math to figure how much eth bomb could be slowed by migrating your hash from eth to etc in stages.Quick estimate is about 21-28 days",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5W-KILO",
      "created_time": "August 21, 2022, 03:48:26 PM",
      "body": "I don't have problem mining few coins especially the new ones but the problem is if they will survive the bear market with good volume and be here till the next bull market, like Conflux and Sero for example, I always remember my losses in 2017 where u mined different set of coins and only few survived, feels like yesterday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john1010",
      "created_time": "August 23, 2022, 03:04:38 PM",
      "body": "Quote from: FP91G on August 17, 2022, 10:52:17 AMI made a small list, for everyone who does not know what to mine after ethereumEthereum Classic ETCEthereumPOW ETHWEthereumPOW  sp_ Ravencoin RVNConflux CFXErgoSeroBitcoin GoldBTCZGrinAIONXHVYEC NEOXBeamEtho(ETHO)Ubiq(UBQ)QuarkChain (QKC)Callisto(CLO)Metaverse(ETP)FluxFiroOther coinhttps://whattomine.com/I did not find the voting option.And all miners are interested in the question of the hash rate of asics on the Ethash algorithm. If it is at least 100 Th/s, then what will be on all coins with the Ethash algorithm? What if this hashrate is much higher?I would like to try a cpu mining again, I have spare ryzen computer in my house, do you have any recommendation of which the list are able to mine via cpu, and to everyone, what miner is best for ryzen cpu. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "August 23, 2022, 03:41:45 PM",
      "body": "Quote from: john1010 on August 23, 2022, 03:04:38 PMI would like to try a cpu mining again, I have spare ryzen computer in my house, do you have any recommendation of which the list are able to mine via cpu, and to everyone, what miner is best for ryzen cpu. ThanksWhat's the series of the Ryzen CPU you have? and how much the electricity cost on your countries per kWH?Another thing is mining with CPU is mostly wasting of time, you probably wouldn't get any profit, but you're lose since the electricity cost is more higher than the profit you get. Right now GPU is the another choice to mine if you don't have miners, I think sooner or later mining with GPU might not profitable anymore for top cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Markzuberg64",
      "created_time": "August 24, 2022, 04:05:10 AM",
      "body": "Dingocoin. A candidate worth consideration. Trading available on major exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 24, 2022, 10:20:44 AM",
      "body": "Quote from: john1010 on August 23, 2022, 03:04:38 PMI would like to try a cpu mining again, I have spare ryzen computer in my house, do you have any recommendation of which the list are able to mine via cpu, and to everyone, what miner is best for ryzen cpu. ThanksMining on the CPU will be effective during the hype or you will use parallel mining on the GPU and CPU, as in this article.https://medium.com/coinmonks/dero-cpu-mining-pool-9d92c9a5806bBut mining now on only one processor is very unprofitable, and in most cases 70-80% of the profit will go to pay for electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}