{
  "id": "topic_5433532",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "January 08, 2023, 09:59:48 PMLast edit: January 09, 2023, 09:54:27 PM by Ojima-ojo",
  "content": "This advice is not only suitable for newbies but even old members need ro hear this again to take action.Since the entire cryptocurrency market is an interconnected digital financial web, that comes with high security and risk since we know that once transactions are sent it is irreversible so the need to pay close attention to our actions in this space is very important.My advice to others most especially newbies is that, make sure you are holding your asset in your wallet and never trust any cryptocurrency third parties entity with custody of your coins until you have enough knowledge to manage the risk that is associated with such services.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433532",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "January 08, 2023, 10:06:38 PM",
      "body": "Imo, there's no \"until\" clause in that advice, if you're going to be your own bank then you have to take responsibility of the actions you take and the consequences of those actions. As a matter of fact, the more knowledge and experience you get, the more averse you should get to the idea of giving up custody of your assets.The surface risk is that of stolen, seized or hacked funds. But there is a whole privacy risk where users can have their personal information sold to government agencies or unverified ones, there can also be a privacy breach where malicious actors can get hands on your information and use that to try to create personalized scam attempts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "January 09, 2023, 01:23:31 AM",
      "body": "It's a great idea to take custody of your funds from the start (especially if you've only got a small investment) because you're going to be risking less when you really do need your funds in your own wallet (there was some warning FTX was going to collapse before it did, if you know how the network works, you'll be better at taking your funds out as early as possible). You're also missing the point of crypto if you're keeping funds on an exchange as you're not really investing in it (you're just investing in an exchange as they'll leverage your assets).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "January 09, 2023, 02:16:29 AM",
      "body": "Quote from: Ojima-ojo on January 08, 2023, 09:59:48 PMMy advice to others most especially newbies is that, make sure you are holding your asset in your wallet and never trust any cryotoxurrency third parties entity with custody of your coins until you have enough knowledge to manage the risk that is associated with such services.Wallets can be built from companies that build and provide wallet softwares only but they can come from exchanges too.Nowadays you can see exchanges have many products to expand their ecosystems. Centralized exchanges have their decentralized exchanges and their wallets too.For me I don't believe that any cryptocurrency wallet or decentralized exchange that is owned by a centralized exchange is non custodial wallet and really decentralized exchange. It's very logic to think so and you can agree or disagree with me but it is a good alarm for people who trust in open source, non custodial wallet and decentralized exchange launched by a centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 09, 2023, 06:00:53 AM",
      "body": "Quote from: OcTradism on January 09, 2023, 02:16:29 AMWallets can be built from companies that build and provide wallet softwares only but they can come from exchanges too.Nowadays you can see exchanges have many products to expand their ecosystems. Centralized exchanges have their decentralized exchanges and their wallets too.For me I don't believe that any cryptocurrency wallet or decentralized exchange that is owned by a centralized exchange is non custodial wallet and really decentralized exchange. It's very logic to think so and you can agree or disagree with me but it is a good alarm for people who trust in open source, non custodial wallet and decentralized exchange launched by a centralized exchange.Anyone can build wallets. A company or a person builds a wallet, but if it is decentralized, it can not be controlled by authority. The developer who builds that no custodial wallet does not have control over any users so I don't think there should be any problem at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 09, 2023, 06:19:08 AM",
      "body": "Quote from: Mahirap on January 09, 2023, 06:00:53 AM<snip>Being decentralized alone or presenting to be so does not make a wallet recommendable or a good option to use.Coinbase has a non custodian wallet, and wants everyone to believe that it's your keys and your coins without any interfering from them, but the wallet happens to be closed source and it is impossible to verify if coinbase does anything behind the scenes, like keeping backups or pre generated keys.A non custodian wallet should ideally be open source and verifiable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "January 09, 2023, 08:09:34 AM",
      "body": "Quote from: Mahirap on January 09, 2023, 06:00:53 AMQuote from: OcTradism on January 09, 2023, 02:16:29 AMWallets can be built from companies that build and provide wallet softwares only but they can come from exchanges too.Nowadays you can see exchanges have many products to expand their ecosystems. Centralized exchanges have their decentralized exchanges and their wallets too.For me I don't believe that any cryptocurrency wallet or decentralized exchange that is owned by a centralized exchange is non custodial wallet and really decentralized exchange. It's very logic to think so and you can agree or disagree with me but it is a good alarm for people who trust in open source, non custodial wallet and decentralized exchange launched by a centralized exchange.Anyone can build wallets. A company or a person builds a wallet, but if it is decentralized, it can not be controlled by authority. The developer who builds that no custodial wallet does not have control over any users so I don't think there should be any problem at all. A crypto wallet that's based on decentralised alone is not confusing enough, I will never keep my coins on such crypto wallet, open source is the real reasons why crypto OGs use and trust a crypto wallet, don't get it confused.Also it doesn't make sense for a centralized company or platform to build a decentralised tool and wallets, I will not trust them at all, if you want to be centralized then build everything based centralization, don't jump about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "January 09, 2023, 03:34:24 PM",
      "body": "Quote from: OcTradism on January 09, 2023, 02:16:29 AMWallets can be built from companies that build and provide wallet softwares only but they can come from exchanges too.Nowadays you can see exchanges have many products to expand their ecosystems. Centralized exchanges have their decentralized exchanges and their wallets too.For me I don't believe that any cryptocurrency wallet or decentralized exchange that is owned by a centralized exchange is non custodial wallet and really decentralized exchange. It's very logic to think so and you can agree or disagree with me but it is a good alarm for people who trust in open source, non custodial wallet and decentralized exchange launched by a centralized exchange.Instead of using a centralized wallet exchange product, it's better to use a hardware wallet that focuses on developing non-custodial wallets. As a beginner, you should know about the differences between which wallets are safe or not, and which wallets have full control or not. If you don't have full control it will be very risky, you don't have keys, you don't have a wallet and you don't have assets.nothing is more secure than a self-owned, self-managed hardware wallet. The centralized exchange is only a bridge for trade and exchange to fiat, do not make it the main repository.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "January 09, 2023, 04:08:55 PM",
      "body": "Quote from: Ojima-ojo on January 08, 2023, 09:59:48 PMSince the entire cryptocurrency market is an interconnected digital financial web, that comes with high security and risk since we know that once transactions are sent it is inreviseable so the need to pay close attention to our actions in this space is very important.Always make verification before confirming any transaction you're about to make because they are irreversible when sent, there's a way to recheck the beginning letters of the address and the last fee letter of the same address to be thesame, there's a copy and paste malware that aim attacks on the clipboard replacing the one you intentionally copied.Quote from: Ojima-ojo on January 08, 2023, 09:59:48 PMMy advice to others most especially newbies is that, make sure you are holding your asset in your wallet and never trust any cryotoxurrency third parties entity with custody of your coins until you have enough knowledge to manage the risk that is associated with such services.Dont also mishandled your keys if in your custody, get a good means to sefure it and avoid it getting exposed to a third party and don't use a centralized storage network in securing your keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "January 09, 2023, 08:59:52 PM",
      "body": "Quote from: Ojima-ojo on January 08, 2023, 09:59:48 PMThis advice is not only suitable for newbies but even old members need ro hear this again to take action.Since the entire cryptocurrency market is an interconnected digital financial web, that comes with high security and risk since we know that once transactions are sent it is inreviseable so the need to pay close attention to our actions in this space is very important.My advice to others most especially newbies is that, make sure you are holding your asset in your wallet and never trust any cryotoxurrency third parties entity with custody of your coins until you have enough knowledge to manage the risk that is associated with such services. This goes for everyone most especially for newbies who have less knowledge and control on their own coins. It’s a lot more secured for your coins to place them in your non-custodial wallet, aside from not operated online, you also don’t give any access to a third party so rest assured, as long as you are responsible with your own wallet, you will never experience hacking or stealing. You can trust exchanges but only when you’re good enough and knows how to deal the risk smartly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "January 09, 2023, 09:15:01 PM",
      "body": "Your advise should always be taken note by everyone, we keep on telling this so that everybody is aware that we should be the one holding our funds and not the exchanges.But even how badly we keep on telling this tip and reminder to everybody, there are still a few people that ends up badly by not having the custody of their own coins and soon they'll share their bad experience about an exchange or an unknown wallet.Quote from: Ojima-ojo on January 08, 2023, 09:59:48 PMinreviseable Just a minor correction, maybe you're typing too fast and haven't noticed it. It should be \"irreversible\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "January 09, 2023, 09:36:34 PM",
      "body": "This is absolutely correct, the discussion of self custody have been on the rise lately since the aftermath of the FTX collapse that dealt a heavy blow on the entire msrket for some time now, but then we still have some investors who are adamant to take action on time.One thing i have noticed is that, befor any project scams investors, there is always early warning, but investors will choose not to pay close attention to such warning.But for those with adequate knowledge, self-custody is the best form of storage and fhe real essence of Bitcoin, your coins, tour wallet and your bank= total freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "January 09, 2023, 10:26:34 PM",
      "body": "Quote from: jackg on January 09, 2023, 01:23:31 AMIt's a great idea to take custody of your funds from the start (especially if you've only got a small investment) because you're going to be risking less when you really do need your funds in your own wallet (there was some warning FTX was going to collapse before it did, if you know how the network works, you'll be better at taking your funds out as early as possible). You're also missing the point of crypto if you're keeping funds on an exchange as you're not really investing in it (you're just investing in an exchange as they'll leverage your assets). This is very interesting to point that exchanges are jut leveraging your assets given that most of them have conversion rates that are abysmal. I am actually guilty of this- I keep most of my BTCs inside our local exchange (coins.ph) due to the convenience that it provides. The downside is, whenever I convert my BTCs to our desired local currency, the conversion rates are relatively high to the point that it eliminates the point of investing it. In addition, this also puts me at the risk of the exchange losing my BTCs in the event that they are scammed, which I am hopefully not wishing it to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "January 09, 2023, 11:48:52 PM",
      "body": "Quote from: jackg on January 09, 2023, 01:23:31 AM You're also missing the point of crypto if you're keeping funds on an exchange as you're not really investing in it (you're just investing in an exchange as they'll leverage your assets). You said an exchange will leverage on one’s assets with them. Does that mean the funds being kept in the exchange with them will be used for trading and other purposes without us being aware of it, just like the way local bank does with our funds being kept with them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "January 10, 2023, 10:55:25 PM",
      "body": "Quote from: Ndabagi01 on January 09, 2023, 11:48:52 PMQuote from: jackg on January 09, 2023, 01:23:31 AM You're also missing the point of crypto if you're keeping funds on an exchange as you're not really investing in it (you're just investing in an exchange as they'll leverage your assets). You said an exchange will leverage on one’s assets with them. Does that mean the funds being kept in the exchange with them will be used for trading and other purposes without us being aware of it, just like the way local bank does with our funds being kept with them?I think that is what most excganges do, just lime the cebtralized traditional bank trade with customers' money and even borrow some from clients to receive interest on them.Some practices are also engaged with cryptocurrency exchanges take FTX issues for instance some of the customer's money is lent to others without the customer's permission so source practice exists with crypto exchange",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 11, 2023, 03:32:39 AM",
      "body": "Quote from: Ndabagi01 on January 09, 2023, 11:48:52 PMYou said an exchange will leverage on one’s assets with them. Does that mean the funds being kept in the exchange with them will be used for trading and other purposes without us being aware of it, just like the way local bank does with our funds being kept with them?The funds are in your control there when they reflect on your account balance. He meant is if you are just gonna stay put your money there then its at risk of being freeze or what, at least if you gonna put your funds there use it for exchange or trading to make profit, or to increase your asset value. Thats only my interpretation of what he said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "January 11, 2023, 08:24:12 AM",
      "body": "Quote from: Ojima-ojo on January 08, 2023, 09:59:48 PMMy advice to others most especially newbies is that, make sure you are holding your asset in your wallet and never trust any cryptocurrency third parties entity with custody of your coins until you have enough knowledge to manage the risk that is associated with such services.There is no point in going back to exchanges or any third party just because you have acquired a good knowledge of risk management.Your personal wallet is your freedom because you have no security tension since you have your private key stored with you; even if all the cryptocurrency exchanges are having security threats, you shouldn't panic because you are in control of your coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "January 11, 2023, 09:30:10 AM",
      "body": "Quote from: Ndabagi01 on January 09, 2023, 11:48:52 PMQuote from: jackg on January 09, 2023, 01:23:31 AM You're also missing the point of crypto if you're keeping funds on an exchange as you're not really investing in it (you're just investing in an exchange as they'll leverage your assets). You said an exchange will leverage on one’s assets with them. Does that mean the funds being kept in the exchange with them will be used for trading and other purposes without us being aware of it, just like the way local bank does with our funds being kept with them?That is the point here. Exchanges are like banks and banks use customers deposit for other businesses including giving as loan to others, doing all sort of businesses to gain some profit on the capital you dropped with them. This is same with exchanges. Binance have a lot of coins that are stakable and if you do that of course they use your coins for other businesses. I don't think banks inform the customers about what they will use their money for if they deposit them but all you know is to get your money when you need it and the difference with exchange is that it is not secured or backed by government like banks incase of any crash or scam like FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "January 11, 2023, 09:54:45 AM",
      "body": "Quote from: Gozie51 on January 11, 2023, 09:30:10 AMthe difference with exchange is that it is not secured or backed by government like banks incase of any crash or scam like FTX.This is the point why anyone must not leave their coins on exchange including Binance, most people think Binance is safe since it's regulated and licensed, SEC has been audited Binance and Binance has SAFU. But there's no transparency about how much the SAFU that Binance own currently and does they have tricky rules like Celsius where they wouldn't refund their customers if they don't have any money left.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "January 11, 2023, 10:28:09 AM",
      "body": "Upon reading about the recent case of an experienced member of this forum: I've been hacked, it appears that the self-custody of one's coins may not be appropriate for all. Some people may lack the necessary knowledge or simply don't care enough about the security measures required to properly protect their assets. I fear that some folks just aren't cut out for the task and I can only imagine with the influx of digital natives, we'll see more tales of woe like this.What do you think? Are we all just sitting ducks waiting to be plucked by crafty cybercriminals, or are some folks just too naive or ignorant?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}