{
  "id": "topic_5469769",
  "title": "alani123",
  "author": "alani123",
  "created_time": "October 09, 2023, 03:29:06 PM",
  "content": "In my view most \"licensed\" betting companies are more shady than others. Supposedly a sportsbook having paid a license to opperate in your territory should make gambling safer. But you probably pay for it in other ways. For instance, odds on online platforms that are licensed might tend to be worse than those that operate without being officially licensed but get around this by mostly accepting crypto deposits. So based on the above, the smarter gamblers should always go to a sportsbook that has better odds. But yet licenses are still to this day are promoted as something better. When in reality it's just probably states wanting a piece of gambling profits. I don't think anyone should be fooled by a platform being licensed. Because if a sportsbook wants to do wrong to people, it'll do it anyway. Odds and reputation are what matters.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469769",
  "comments": [
    {
      "author": "crwth",
      "created_time": "October 09, 2023, 03:52:44 PM",
      "body": "So you are taking the chance for the \"higher\" odds = chance to win higher gains with higher risk (because it's not licensed) compared to \"ok\" odds with safety on your mind?I would take the last part where it's licensed because I know that my money wouldn't be at risk and I would check its reputation as well. It's weird to have that view though, unless you are rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 09, 2023, 03:56:53 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PMIn my view most \"licensed\" betting companies are more shady than others. Who are the others? Unlicensed gambling sites. If a gambling site is licensed, it means it has been tested to be capable of running a gambling site, unlike unlicensed gambling sites that can be for scammers. Quote from: alani123 on October 09, 2023, 03:29:06 PMSupposedly a sportsbook having paid a license to opperate in your territory should make gambling safer. But you probably pay for it in other ways. For instance, odds on online platforms that are licensed might tend to be worse than those that operate without being officially licensed but get around this by mostly accepting crypto deposits. Licensed gambling sites have good reputation if you further your research to know if it is a good gambling site or not and know the gambling site pros and cons. Quote from: alani123 on October 09, 2023, 03:29:06 PMSo based on the above, the smarter gamblers should always go to a sportsbook that has better odds. But yet licenses are still to this day are promoted as something better. When in reality it's just probably states wanting a piece of gambling profits. I don't think anyone should be fooled by a platform being licensed. Because if a sportsbook wants to do wrong to people, it'll do it anyway. Odds and reputation are what matters.Licensed gambling sites have good odds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 09, 2023, 03:57:54 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PM When in reality it's just probably states wanting a piece of gambling profits. I don't think anyone should be fooled by a platform being licensed. Because if a sportsbook wants to do wrong to people, it'll do it anyway. Odds and reputation are what matters.If we're to start ignoring licensed sportsbook operators under the assumption that their platforms doesn't offer better odds don't you think we would be encouraging more and more unlicensed betting companies in the gambling community? There are licensed sportsbook that offers better odds that's why we don't have to generalize it if we happen to meet with those with a cheating oddsSupposed a non licensed sportsbook want to do wrong to people (of which they do) they probably without looking back on account of having nothing to lose but the licensed sportsbook would without fail have a second thought about what they stand to lose (their license to operate) if they are found culpable of an offense.  Something we should know is that no matter how the state authority fixate on gambling profits there's still a place for the law to take it course. It's safer playing with license gambling company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "October 09, 2023, 04:01:24 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PMSo based on the above, the smarter gamblers should always go to a sportsbook that has better odds. But yet licenses are still to this day are promoted as something better. When in reality it's just probably states wanting a piece of gambling profits. I don't think anyone should be fooled by a platform being licensed. Because if a sportsbook wants to do wrong to people, it'll do it anyway. Odds and reputation are what matters.Nowadays, it’s very hard to spot non licensed sportsbook not unless you are hanging outside the Bitcointalk forum. Comparing the odds of crypto sportsbook to the local sportsbook in my country shows huge difference on odds since crypto sportsbook much better odds than the one in my local despite both of them has license in different license provider.I believe even scam casino doesn’t offer too good to be true odds since they need to blend in to the legit one so that they will not be caught easily. For the reference on your context, Provide an example unlicensed sportsbook that offers high odds because I assume the majority is not aware here how it looks like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "October 09, 2023, 04:32:02 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PMIn my view most \"licensed\" betting companies are more shady than others. While there are tendencies of licensed betting companies abusing their privileges, we should not ignore the risk posed by unlicensed betting companies. Personally, I have not had any issues with licensed betting companies in my country but there have been rumours of shady deals from a handful of them that operate internationally.  Nevertheless,  shady deals are not perculiar to licensed companies... this is why it is necessary to perform due diligence when choosing the company to use. Quote from: alani123 on October 09, 2023, 03:29:06 PM For instance, odds on online platforms that are licensed might tend to be worse than those that operate without being officially licensed but get around this by mostly accepting crypto deposits. I don't think the odds have anything to do with being licensed or not because the competition now us so fierce that companies that even licensed companies uses good odds to remain in business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "October 09, 2023, 04:36:15 PM",
      "body": "Quote from: Odohu on October 09, 2023, 04:32:02 PMQuote from: alani123 on October 09, 2023, 03:29:06 PM For instance, odds on online platforms that are licensed might tend to be worse than those that operate without being officially licensed but get around this by mostly accepting crypto deposits. I don't think the odds have anything to do with being licensed or not because the competition now us so fierce that companies that even licensed companies uses good odds to remain in business. What he is trying to share is that non licensed sportsbook offer higher odds in purpose to have an advantage to licensed sportsbook. They already have a disadvantage for not having a license so it’s really make sense why they will offer a tempting odds just to get customers that is willing to risk just for an extra stretch of profit.There’s still a lot of people being a victim for this kind of scheme due to high odds offered. It’s more on choosing a safe sportsbook with normal odds or very risky sportsbook with insane odds. Safety or Higher odds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "October 09, 2023, 04:39:22 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PMIn my view most \"licensed\" betting companies are more shady than others. Supposedly a sportsbook having paid a license to opperate in your territory should make gambling safer. But you probably pay for it in other ways. For instance, odds on online platforms that are licensed might tend to be worse than those that operate without being officially licensed but get around this by mostly accepting crypto deposits. I have not noticed the difference, having a sportsbook that is crypto or not, licence over many protections and as such, they can't run away like how unlicensed sportsbooks run away from their responsibility. Small odd might be one of the ways to protect gamblers because they know that 70% of gamblers that start betting in their first years always lose money and that is why you might have noticed odd slash but while it is an advantage for people(gamblers in this case), it also an advantage for the sportsbooks because when people win a large amount of money, it will not have too much effects on their reserve when they pay winners.QuoteSo based on the above, the smarter gamblers should always go to a sportsbook that has better odds. But yet licenses are still to this day are promoted as something better. When in reality it's just probably states wanting a piece of gambling profits. I don't think anyone should be fooled by a platform being licensed. Because if a sportsbook wants to do wrong to people, it'll do it anyway. Odds and reputation are what matters.Sentiments on the ground, people still patronise license sportsbooks because they are recognized by government agencies, people feel safe when the safety of their money is guaranteed, playing sportsbooks itself is a risk but playing in a sportsbooks that run away with your money or going bankrupt one day in the future is another risk. Talking about state revenue, that is what the government does and I believe you one way or the other enjoys from this benefits of taxes, not just the government, whether you play or you don't, allocation will be done and your state will be included as beneficial state.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 09, 2023, 04:51:46 PM",
      "body": "OP I believe you know what it means a sportbook being licenced and that which is not licenced. You should put the safety of your funds and reputation of the sportbook first. Do you really mean patronising those without licence over those with licence ? What are you insinuating, what if this actions causes a big disaster whereby gamblers start going for unlicensed sports book as you have said and at the entire end of it all the sports book make away with their funds what will you say?I believe licenced sportsbook have a reputation to maintain so therefore would be of conduct bit will be ripping players off their funds just to make profit, pay tax and other activities which requires them to make payment so they could be up and doing with the government for which they got their licence through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "October 09, 2023, 04:52:13 PM",
      "body": "I'd say it's more or less the same because they use the same odds providers (BetRadar, Betby, etc), but a few sportsbooks can still adjust their juice/vig to stand out from the rest of the competition. I agree that other sportsbooks have slightly worse odds because they're more focused on securing profits, but they still utilize those profits to offer promotions. Others aren't fooled with their license, it's just they don't mind losing a bit of payout when it means getting better rewards because sportsbooks with better odds rarely have promotions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "October 09, 2023, 04:57:25 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PMSo based on the above, the smarter gamblers should always go to a sportsbook that has better odds. But yet licenses are still to this day are promoted as something better. When in reality it's just probably states wanting a piece of gambling profits. I don't think anyone should be fooled by a platform being licensed. Because if a sportsbook wants to do wrong to people, it'll do it anyway. Odds and reputation are what matters.I like the very last point that you have raised. It is essential that every Gambler take note of this. Of course one of the goals is to to play in a sport book where your odds of winning is higher whether it is licensed or not I think that is all that matters. But we shouldn't just consider the odds only, we should also take into consideration the reputation of the sport book where we do not have to be worried about transparency and fair play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 09, 2023, 05:20:32 PM",
      "body": "The odds on other sportsbook is not very different from the other though. The odds on Stake are not very different from what is in Sportsbet. Comparing it to a fiat base casino would be a different story but all fiat base casino odds are almost exactly the same as well.OP should give a name of which platform he means and compare it to another with screenshots so we can see there is a point of difference. Even the Decentralized sports betting platform like Betfury, their odds are close to the popular bookmakers in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "October 09, 2023, 08:55:53 PM",
      "body": "Quote from: cabron on October 09, 2023, 05:20:32 PMThe odds on other sportsbook is not very different from the other though. The odds on Stake are not very different from what is in Sportsbet. Comparing it to a fiat base casino would be a different story but all fiat base casino odds are almost exactly the same as well.With what I have noticed on gambling site bookmakers, it is true that the odds are different but very similar and no big difference. I have many sport gambling sites that I am gambling, but I do not bother to check their odds again individually because the odds are almost the same. Another thing is that I can not because of odd differences leave a licenced gambling site for unlicensed ones becuase my country allow gambling and make it legal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "October 09, 2023, 09:00:16 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PMIn my view most \"licensed\" betting companies are more shady than others. Supposedly a sportsbook having paid a license to opperate in your territory should make gambling safer. But you probably pay for it in other ways. For instance, odds on online platforms that are licensed might tend to be worse than those that operate without being officially licensed but get around this by mostly accepting crypto deposits. So based on the above, the smarter gamblers should always go to a sportsbook that has better odds. But yet licenses are still to this day are promoted as something better. When in reality it's just probably states wanting a piece of gambling profits. I don't think anyone should be fooled by a platform being licensed. Because if a sportsbook wants to do wrong to people, it'll do it anyway. Odds and reputation are what matters.It's a strange comparison you've decided to make, but then you need to give a bit more context. The casinos and sportbooks in my country, within Europe, are generally licensed and offer very competitive rates in comparison to crypto casinos. In many cases they will even use the same odds providers in the background and the method of payment they accept is completely separate from the odds they have on offer. You'll also find that many of the largest crypto casinos that are found here will be regulated or headquarters in places like Europe as well, even though they might rely on licensing out of places like Curacao. There is very little difference between the payment forms and odds offers any more, if there ever was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "October 09, 2023, 09:45:40 PM",
      "body": "Quote from: alani123 on October 09, 2023, 03:29:06 PM~While I do agree with having a license naturally being better (since they're easily obtained in the first place), I don't think they differ that much? The chances are said odds aren't even set by the bookies themselves, they probably hired providers to use for. In a sense, they probably wouldn't try to do this since it's earning money but losing players in the short run. Bookies tend to have a business model for the long run instead. It's why you always see most people say that the house always wins in the end, same thing with bookies afaik. And tbf, having a license is better than nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 09, 2023, 11:31:01 PM",
      "body": "When it comes to reputation, assuming it even exists, my question is: Would you consider placing a bet with an established and reputable unlicensed sportsbook? These unlicensed sportsbooks tend to have a track record of fair dealings and timely payouts, offering better and more competitive odds than their licensed counterparts, with slightly lower odds. Perhaps these unlicensed sportsbooks can afford to take more risks due to their lower overhead costs in order to attract customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}