{
  "id": "topic_5461881",
  "title": "Promocodeudo",
  "author": "Promocodeudo",
  "created_time": "August 02, 2023, 11:31:06 PM",
  "content": "The innovation accompanied with bitcoin can potentially pave way for the global prosperity, bitcoin has greatly risen in it's influence, despite that there some people out there that don't still see bitcoin as a good investment, I see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, I know this may take time to happen, but the actualization is the freedom itself. Bitcoins can not be easily manipulated by any central system or institution because of it finite available amount, this digital asset is an excellent store of value, particularly in the state or time of economic woes, uncertainty or inflation.  What high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461881",
  "comments": [
    {
      "author": "mk4",
      "created_time": "August 02, 2023, 11:43:14 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMWhat high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. Central entities can't directly manipulate or affect Bitcoin's protocol, but bitcoin's price can definitely be affected by inflation rates and economic news in general. We've seen this time and time again since the past 2-3 years when we get weekly/monthly updates from the Federal Reserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 02, 2023, 11:43:54 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMI see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currencyStop please!Bitcoin won't be able to reshape any national or international economy and it won't replace all national fiat currencies or local currencies. National economy is shaped and reshaped by their government not by Bitcoin or Bitcoin communities.Your post contains a view which is stronger than Bitcoin maximalists' view on Bitcoin future and its potential achievements.QuoteI know this may take time to happen, but the actualization is the freedom itself.It will never happens.Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMWhat high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. When a nation is in a high inflationary crisis which is a death spiral. Government only see that they have only one option that is printing more money but we know, it is a death spiral.Even if that government has to resign, a new government will not have many doable things to improve their national inflationary crisis as it already deeply affected many aspects in the nation which won't be resolved after one night and by a single change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "August 02, 2023, 11:53:31 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMI see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currencyIt won't happen anytime soon, stop being delusional about that idea of replacing local currency with bitcoin. Typical government system won't allow it.Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMWhat high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. In direct way, of course. But it is affected indirectly in many ways, and you will think it is not effected as inflation hedge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "August 03, 2023, 12:07:18 AM",
      "body": "Bitcoin is indeed a great invention of mankind, but it is not something so divine that can solve all problems in the world, so don't be too delusional and we need to be realistic. You and I, and many others come here for profit, so you need to be realistic about where you stand and what to do to avoid unnecessary losses instead of the illusion that bitcoin will replace the system of world currency or save the world. If you already know bitcoin is an inflation hedge, accumulate it as much as possible to save yourself, you need to save yourself before thinking about saving the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rikybrosh",
      "created_time": "August 03, 2023, 12:13:23 AM",
      "body": "I think it will not totally replace local currency because government can make rule to make sure the civilian use local currency only. but I think Bitcoin will dominating virtual transaction replacing paypal and etc. bitcoin has a lot of advantage rather than remittance service because it don't need employee to operate , so the operating cost will be lower, even it's only need internet and electricity. although bitcoin is still volatile but it is one of best way to avoid inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "August 03, 2023, 11:01:54 AM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMThe innovation accompanied with bitcoin can potentially pave way for the global prosperity, bitcoin has greatly risen in it's influence, despite that there some people out there that don't still see bitcoin as a good investment, I see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, I know this may take time to happen, but the actualization is the freedom itself. Bitcoins can not be easily manipulated by any central system or institution because of it finite available amount, this digital asset is an excellent store of value, particularly in the state or time of economic woes, uncertainty or inflation.  What high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. I don't think though that countries will go full retard and invest their government's wealth into bitcoin. Gold still take the sport as the go to assets for this government to store their wealth. It has been proven throughout history that gold will be the only one, not bitcoin and any other crypto for that matter.It's good that bitcoin has slowly risen to become a good asset for us. But it doesn't mean that it can replace fiat, it could be legal tender though, but due to it's volatility, government will have a hard time accepting it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "August 03, 2023, 11:08:46 AM",
      "body": "Correct, but is there anything new that you want to say?Everyone already know Bitcoin is a decentralized currency, it can't be manipulated, it can be used to store a value, inflation hedge etc, then what? any commodity or asset that the value is increased over time can be used as an inflation hedge, not only Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "August 03, 2023, 11:34:37 AM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMThe innovation accompanied with bitcoin can potentially pave way for the global prosperity, bitcoin has greatly risen in it's influence, despite that there some people out there that don't still see bitcoin as a good investment,If the government can be making a decision in recognising bitcoin to be a reliable investment and currency then every actors against bitcoin adoption will finally be left with no option than to adopt bitcoin for no other reason than not to be left out in bitcoin next opportunities coming and fast approaching, they will be left alone to choose when the results comes out and everyone enjoying bitcoin adoption, while some are just watching this opportunity happening.Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMI see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency,Bitcoin is already taking over, but still on a gradual approach and process till people have no choice and if bitcoin has been adopted by everyone, then USD may be an alternative to fiat since fiat currency cannot perform the exciting functions of what bitcoin does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "August 03, 2023, 12:06:47 PM",
      "body": "Quote from: rikybrosh on August 03, 2023, 12:13:23 AMI think it will not totally replace local currency because government can make rule to make sure the civilian use local currency only. but I think Bitcoin will dominating virtual transaction replacing paypal and etc. bitcoin has a lot of advantage rather than remittance service because it don't need employee to operate , so the operating cost will be lower, even it's only need internet and electricity. although bitcoin is still volatile but it is one of best way to avoid inflation.I think that's the reason why El Salvador wanted to adopt bitcoins as legal tender in their country and their government supported it until today. looks like their decision was good because we can see that they had good responses and positive results in their economy after they did that. That's why the other countries are willing to do the same but their government seems not unanimous towards it and they happened to not convince by El Salvador's current economy. Perhaps they just need a strong convincing impact where they don't have to doubt that decision and finally be like that country that fully made bitcoins legal tender in their country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "August 03, 2023, 12:36:57 PM",
      "body": "Quote from: yazher on August 03, 2023, 12:06:47 PMQuote from: rikybrosh on August 03, 2023, 12:13:23 AMI think it will not totally replace local currency because government can make rule to make sure the civilian use local currency only. but I think Bitcoin will dominating virtual transaction replacing paypal and etc. bitcoin has a lot of advantage rather than remittance service because it don't need employee to operate , so the operating cost will be lower, even it's only need internet and electricity. although bitcoin is still volatile but it is one of best way to avoid inflation.I think that's the reason why El Salvador wanted to adopt bitcoins as legal tender in their country and their government supported it until today. looks like their decision was good because we can see that they had good responses and positive results in their economy after they did that. That's why the other countries are willing to do the same but their government seems not unanimous towards it and they happened to not convince by El Salvador's current economy. Perhaps they just need a strong convincing impact where they don't have to doubt that decision and finally be like that country that fully made bitcoins legal tender in their country.I also follow the news about El Salvador but not much.  But honestly, I don't see any positive progress or improvement since they accepted bitcoin as a legal tender. bitcoin is just a highly volatile investment, an asset, how can it help a country's economy go up?  a country's economy cannot rely on investing in high-risk assets to get rich and prosperous, not to mention El Salvador buys a lot of bitcoin but at a very high price, meaning they are still losing money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 03, 2023, 12:47:17 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMThe innovation accompanied with bitcoin can potentially pave way for the global prosperity, bitcoin has greatly risen in it's influence, despite that there some people out there that don't still see bitcoin as a good investment, I see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, I know this may take time to happen, but the actualization is the freedom itself. If nations don't put in place the necessary mechanism or policies that will improve their economy Bitcoin has little or nothing to do. Bitcoin has the potential of revolutionizing the payment systems of nations to promote freedom and decentralization but it is not the sole solution to the economic problems of the world. For now, Bitcoin will continue to exist with fiat. People will have to choose their preferable payment systems between these two options. If your assumptions about Bitcoin are correct, the impact on the economy of El Salvador should be your example. QuoteBitcoins can not be easily manipulated by any central system or institution because of it finite available amount, this digital asset is an excellent store of value, particularly in the state or time of economic woes, uncertainty or inflation.  What high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. Since Bitcoin is decentralized, no central government can manipulate it. But some political and economic policies of some economically strong nations such as the US is always affecting the price of the currency. Even the way in Ukraine that led to the rise in the price of gas and electricity, affected the price of Bitcoin last year. Bitcoin will be a potent hedge against inflation for individuals or households.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 03, 2023, 12:56:36 PM",
      "body": "Who are you referring to with \"some people\"? Your friend/family, or those famous anti-crypto/Bitcoin on social media? If you want to convince people it will differ based on how opinionated they are and how familiar they are with crypto. I doubt you'll convince people with the reasons you mentioned above though, since even crypto maxi will probably disagree with your points.At the end of the day, some people already use Bitcoin as an inflation hedge. Services that accept Bitcoin or offer investment services related to crypto also increase slowly. I believe it will stay so you don't have to worry that much. There's no need to convince people that firmly believe crypto will fail, just keep DCA and manage your risk. You don't really have to worry that people won't buy Bitcoin because they don't see it as an inflation hedge, since most of them will likely trade it anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "August 03, 2023, 01:13:32 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMI see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, I know this may take time to happen, but the actualization is the freedom itself.  Bitcoin will not replace local currencies. The objective of Bitcoin is not even to replace local currencies but to be an alternative currency that can be used by anybody anytime in any part of the world. We have to be realistic in our assessment of Bitcoin. Bitcoin is not going to reshape the global economy.Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMWhat high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes.Bitcoin cannot be controlled by inflation spikes but factors that cause inflation and other economic and political factors can affect the price and adoption of Bitcoin. Bitcoin is not immune to all economic factors in the economy. The players (people that use, trade, and hodl) of Bitcoin are in the economy and they get affected by the economy so it will affect Bitcoin. Despite that, Bitcoin is still the best store of value among all other currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 03, 2023, 01:37:34 PM",
      "body": "Quote from: tranthidung on August 02, 2023, 11:43:54 PMQuote from: Promocodeudo on August 02, 2023, 11:31:06 PMI see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currencyStop please!Bitcoin won't be able to reshape any national or international economy and it won't replace all national fiat currencies or local currencies. National economy is shaped and reshaped by their government not by Bitcoin or Bitcoin communities.Your post contains a view which is stronger than Bitcoin maximalists' view on Bitcoin future and its potential achievements.This is the usual enthusiastic point of view of a newbie who has recently learned about bitcoin and has little idea about it. Enriched with experience and knowledge, he will surely change his current opinion and understand that the possibilities of bitcoin have limits and this is not a magic tool for all economic and financial problems.Quote from: tranthidung on August 02, 2023, 11:43:54 PMQuote from: Promocodeudo on August 02, 2023, 11:31:06 PMI know this may take time to happen, but the actualization is the freedom itself.It will never happens.Thanks to CBDC freedom will become less and less.Quote from: tranthidung on August 02, 2023, 11:43:54 PMQuote from: Promocodeudo on August 02, 2023, 11:31:06 PMWhat high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. When a nation is in a high inflationary crisis which is a death spiral. Government only see that they have only one option that is printing more money but we know, it is a death spiral.Even if that government has to resign, a new government will not have many doable things to improve their national inflationary crisis as it already deeply affected many aspects in the nation which won't be resolved after one night and by a single change.In order for countries with high inflation to keep their wealth at bitcoin, they first need to accumulate that wealth. The presence of high inflation is an indicator of the absence of these riches.A new government is not enough to solve the problem of a national inflationary crisis. Big changes will be required throughout the system, which, as you correctly noted, will require a lot of time and financial resources.Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMI see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, I know this may take time to happen, but the actualization is the freedom itself.What changes under the influence of bitcoin did you see in the economy? I think you are exaggerating this influence.Not sure if bitcoin will replace traditional currencies. This will not be allowed to happen, for the digital assets that have replaced traditional currencies will be CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "August 03, 2023, 01:44:28 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMThe innovation accompanied with bitcoin can potentially pave way for the global prosperity, bitcoin has greatly risen in it's influence, despite that there some people out there that don't still see bitcoin as a good investment, I see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, I know this may take time to happen, but the actualization is the freedom itself. Bitcoins can not be easily manipulated by any central system or institution because of it finite available amount, this digital asset is an excellent store of value, particularly in the state or time of economic woes, uncertainty or inflation.  What high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. We can use Bitcoin as an inflation hedge due to the below reason.1. historical performance: Bitcoin has shown some price appreciation during the period of the financial crisis.2. Decentralization: Bitcoin is not controlled by any central authority. but the price can be changed based on the market news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "August 03, 2023, 02:45:56 PM",
      "body": "Certainly Bitcoin has gained influence and notoriety over time and has been considered by some as an alternative to traditional currencies and a haven of value in times of economic uncertainty… Either because it is not controlled by any financial institution or central government, which provides greater autonomy and resistance against manipulation by third parties… or because some see Bitcoin as a way to store value in times of economic uncertainty or inflation, since its limited supply could protect it from the impact of depreciating currencies local… But what you are proposing is impossible to happen, Bitcoin cannot easily replace local currency… Observe the power that governments currently have and you will see why your dream is impossible… It is good that you like Bitcoin and see it as the best investment, but not you can idolize Bitcoin to the point where you think it can save the whole world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 03, 2023, 10:20:53 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMbitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, Do you really believe that Bitcoin can be replaced with the local currencies of every country in the world? Although Bitcoin is a valuable asset and can add value to one's investment instead of being caught up with inflation the way it is with fiat money, but that doesn't mean that local currency will still not exist. I think that along the line, in the future, more people will realise that Bitcoin is kind of a safe heaven to hold one's funds and avoid being affected by inflation, but worldwide, Bitcoin will not be accepted by every country, even to the extent of totally replacing their local currency. although we can't tell what the future will become.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "August 03, 2023, 10:49:04 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on August 03, 2023, 10:20:53 PMQuote from: Promocodeudo on August 02, 2023, 11:31:06 PMbitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, Do you really believe that Bitcoin can be replaced with the local currencies of every country in the world? Although Bitcoin is a valuable asset and can add value to one's investment instead of being caught up with inflation the way it is with fiat money, but that doesn't mean that local currency will still not exist. I think that along the line, in the future, more people will realise that Bitcoin is kind of a safe heaven to hold one's funds and avoid being affected by inflation, but worldwide, Bitcoin will not be accepted by every country, even to the extent of totally replacing their local currency. although we can't tell what the future will become.In any extent traditional fiat into usage won't be completely replaced by bitcoin. Even in El Salvador, the country that have considered bitcoin legal tender have given the choice with its people. There is no compulsion to use bitcoin, it is their choice whether to use bitcoin or continue using the dollar. The way bitcoin have been developed seems like functional against inflation. This makes bitcoin better over the traditional fiat into usage in the long run or when the world is hit by hard inflation. The acceptance level of bitcoin around the world is in better shape compared to the past years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 03, 2023, 10:52:40 PM",
      "body": "Quote from: Promocodeudo on August 02, 2023, 11:31:06 PMThe innovation accompanied with bitcoin can potentially pave way for the global prosperity, bitcoin has greatly risen in it's influence, despite that there some people out there that don't still see bitcoin as a good investment, I see the globally economy being reshaped by this digital asset, bitcoin will do this by being an alternative for traditional currency or by totally replacing local currency, I know this may take time to happen, but the actualization is the freedom itself. Bitcoins can not be easily manipulated by any central system or institution because of it finite available amount, this digital asset is an excellent store of value, particularly in the state or time of economic woes, uncertainty or inflation.  What high inflation countries need to store their wealth, is bitcoin, because it is not in anyway controlled by inflation spikes. This is applicable if and only if Bitcoin becomes stable in its up-trending market.  But if Bitcoin value becomes stable in going downtrend then can you say that it is an inflation hedge?  Although we know that its coins max supply is capped, its value is still dependent on its conversion to fiat currency.  If it becomes stable and stays at the same price value, then how can it be a hedge against inflation?I believe Bitcoin will only become a hedge against inflation if it meets certain criteria and that is always in an uptrend path.  Those who buy at $69k probably have other things in mind rather than Bitcoin being an inflation hedge.  HIgh volatility is something that counters the idea of Bitcoin being a potential inflation hedge, IMHO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}