{
  "id": "topic_5434788",
  "title": "Shobhikhan_007",
  "author": "Shobhikhan_007",
  "created_time": "January 15, 2023, 08:22:10 AM",
  "content": "What you guys already invest or looking to invest in 2023 instead of cryptocurrency?. I already brought 24K Gold biscuts.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434788",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "January 16, 2023, 04:08:02 PM",
      "body": "Mine would be anything that's good and related to my role in life. Basically things that are mobile and can easily be moved around to different places. Currently invested in mobile farming that produces foods all year round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 16, 2023, 06:48:10 PM",
      "body": "Bitcoin is the best investment you can make for the next 30-40 years in my opinion. There are some traditional investments that are a good option for a diversified portfolio. You can buy stocks, I specifically like managed funds like the S&P500. Historically it’s done very well.I don’t really like precious metals to be honest but each to their own. Do your own research before investing in anything obviously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shobhikhan_007",
      "created_time": "January 17, 2023, 01:33:24 PM",
      "body": "Quote from: DeathAngel on January 16, 2023, 06:48:10 PMBitcoin is the best investment you can make for the next 30-40 years in my opinion. There are some traditional investments that are a good option for a diversified portfolio. You can buy stocks, I specifically like managed funds like the S&P500. Historically it’s done very well.I don’t really like precious metals to be honest but each to their own. Do your own research before investing in anything obviously.Those things can't quickly turn in to paper money. So i will put 3% my money in crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oland4ever",
      "created_time": "January 18, 2023, 02:23:03 PM",
      "body": "Mostly in shares and equity funds and also som real estates. I'm really a newbie at cryptocurrencies. I have just bought a couple of Ledger Nano S and Trezor One hardware wallets but I haven't bought any cryptocurrency yet. I'm still learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yusrime",
      "created_time": "January 30, 2023, 01:17:15 PM",
      "body": "Domains, Gold biscuits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "violastan2",
      "created_time": "February 05, 2023, 12:55:12 PM",
      "body": "it's worth noting that investment decisions should be based on individual financial goals, risk tolerance, and research. Some common alternative investments to cryptocurrencies include stocks, bonds, real estate, and commodities. It's important to diversify one's portfolio and to consult with a financial advisor before making any investment decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "February 05, 2023, 03:22:51 PM",
      "body": "To be honest I don’t like to invest in much other than crypto if I am honest. This is a shot out of left field but it is good to invest on ourselves & by that i mean look after ourselves. We should eat well, spend quality time with family, do things we enjoy. Try to relax when not at work.If we are talking strictly about physical things to invest in that aren’t crypto then real estate is good, you rarely lose money over time on real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ashslm",
      "created_time": "February 08, 2023, 04:02:25 PM",
      "body": "I don't yet, but would love tech/AI stocks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr__ZACK",
      "created_time": "February 12, 2023, 11:37:50 AM",
      "body": "As already discussed in this thread that Bitcoin is the best investment, i also think that but let me tell you that ,one of the traditional investment, real estate is also very profitable. Real investors can make money through rental income. Real Estate values often rise over time, and with a good investment, you might benefit when it comes time to sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}