{
  "id": "topic_5410545",
  "title": "ugottabet",
  "author": "ugottabet",
  "created_time": "August 20, 2022, 12:01:01 AM",
  "content": "Started playing at bitdice. Seemed fun at first.I deposited 50$, won in the whole session 750$,  super excited but then I saw chats coming in that withdrawals took 20 days or ppl didn't get conformation emails on withdrawals, so I got scared.I withdrew 750$ and after 4 hours I got asked for kyc. I instantly send the documents and it has been 80+ hours and kyc hasn’t even been completed.Live support keeps saying they’ll ping the team but nothing happens. Payment team also said they didn't receive my proof of funds which I send 6 hours before that as asked.They keep making up reasons to delay the whole process and keep telling me to wait 24h and I'm sick of it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410545",
  "comments": [
    {
      "author": "yahoo62278",
      "created_time": "August 20, 2022, 01:28:48 AM",
      "body": "Quote from: ugottabet on August 20, 2022, 12:01:01 AMStarted playing at bitdice. Seemed fun at first.I deposited 50$, won in the whole session 750$,  super excited but then I saw chats coming in that withdrawals took 20 days or ppl didn't get conformation emails on withdrawals, so I got scared.I withdrew 750$ and after 4 hours I got asked for kyc. I instantly send the documents and it has been 80+ hours and kyc hasn’t even been completed.Live support keeps saying they’ll ping the team but nothing happens. Payment team also said they didn't receive my proof of funds which I send 6 hours before that as asked.They keep making up reasons to delay the whole process and keep telling me to wait 24h and I'm sick of it.Bitdice has a site rep you can contact https://bitcointalk.org/index.php?action=profile;u=238641 Try sending him a pm and see if he can expedite your wd request. You can also search for kolloh and boxxob whom are staff and have been more active then the owner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "August 20, 2022, 01:58:53 AM",
      "body": "Quote from: yahoo62278 on August 20, 2022, 01:28:48 AMBitdice has a site rep you can contact https://bitcointalk.org/index.php?action=profile;u=238641 Try sending him a pm and see if he can expedite your wd request. You can also search for kolloh and boxxob whom are staff and have been more active then the owner.This is absolutely a heart breaking situation, and the money isn't that huge for a casino like Bitdice not to pay. But however, I think contacting the rep is not the best idea, because it's almost a year now Bitdice forum rep was last seen active on his profile (September 12th 2021). So for me, I think the best option will be for him to fire a complaint on \"scam accusations\" board of the forum, while presenting all the needed proof that he actually won genuinely and was refused to be paid, with every needed screenshots.And you can also lay a complain on Askgambler.com, about Bitdice refusal to pay you your genuine winning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 20, 2022, 03:02:41 AM",
      "body": "This is a delaying tactics of some casino to prevent you from withdrawing your funds since you got huge profit from them. You should follow Yahoo advice to contact there representative here in the forum because security team will just keep delaying your approval since they know that you have no choice than to wait. Pressuring them in public will make them speed up a little there KYC process which can be then in few hours if they are doing there job properly.Update us if you successfully withdraw your funds for note on this casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "August 20, 2022, 03:18:57 AM",
      "body": "Considering the day, friday to weekend seems reasonable that you might receive delay response from their support team or any incharge for that matter. I will give them until tuesday to respond. For more info, they are more reputable and running longer years than any gambling site here too, so...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "August 20, 2022, 03:22:57 AM",
      "body": "Quote from: PX-Z on August 20, 2022, 03:18:57 AMConsidering the day, friday to weekend seems reasonable that you might receive delay response from their support team or any incharge for that matter. I will give them until tuesday to respond. For more info, they are more reputable and running longer years than any gambling site here too, so...The OP’s is not facing the problem from Today, he mentioned in the post that it’s already 80+ hours passed and he hasn’t got any positive updates from the support staff.It’s really shocking to hear that, now we listening these types of accusations against one of the oldest casinos bitdice. There might be a solid reason for which they are delaying the payout. Does any other person facing the same issue also? Or it’s just the OP ?Op you can try to contact there Bitcointalk manager here and the other staff as mentioned by Yahoo above. They will surely reply you and might also help you with your situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "August 20, 2022, 03:36:05 AM",
      "body": "Quote from: Nrcewker on August 20, 2022, 03:22:57 AMThe OP’s is not facing the problem from Today, he mentioned in the post that it’s already 80+ hours passed and he hasn’t got any positive updates from the support staff.The 80+ hours is related to KYC, which is really take much time considering he's not the only in the queue. It takes at least 5 days to a week or so in my experience and its nothing new. Support staff can't give any information regarding the KYC if there's no new updates regarding it, they are there to give updates only, also it's weekend. KYC procedures are probably on different staff mostly it's a third party.So patience is OP's only option right now and follow up update.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "August 20, 2022, 04:53:43 AM",
      "body": "Honestly with all the accusations of the failed ICO or whatever they are being accused of scamming investors of and the fact that the owner Alex hasn't been online in months, it's likely they are not gonna give you any sort of response on this forum. I would Def create a scam accusation thread and seek other ways to get the word out about your case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "August 20, 2022, 05:56:14 AM",
      "body": "Quote from: yahoo62278 on August 20, 2022, 04:53:43 AMHonestly with all the accusations of the failed ICO or whatever they are being accused of scamming investors of and the fact that the owner Alex hasn't been online in months, it's likely they are not gonna give you any sort of response on this forum. I would Def create a scam accusation thread and seek other ways to get the word out about your case. I think that this is the best action for OP to be given a look from the team( if there is still active members of Bitdice in Bitcointalk.org) I remember their days years ago when they have constant advertising and actively posting here but now as they have facing several issues from ICO and some players ? yeah this is a must to put an scam accusation so if there is a chance of being addressed from the team then it will come sooner.but it looks like OP will never get back His money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "August 20, 2022, 06:14:06 AM",
      "body": "Even though there are some complaints against bitdice and some issues since the ICO, but I cant say this accusation is a valid one since the OP do not provide a single proof of what he say. @OP As suggested and mentioned previously, due to the fact that the official representative of bitdice is no longer active in bitcointalk. I do not think you'll get an answer here but of course you can help other forum members by creating scam accusation or create a flag against them with valid proof. This way, it will be a warning for others who are playing or who are going to play in bitdice for the 1st time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "August 20, 2022, 06:22:22 AM",
      "body": "The bad thing about this is that it happens in a lot of casinos: instant deposits, but when it's time to withdraw, they start making problems. Since they can't withdraw, there is a percentage of players who end up gambling and losing their winnings. A reputable, well-functioning site doesn't need these tactics, as they make a lot of money anyway, and it doesn't do compulsive gamblers much good to have their withdrawals processed quickly either, as many will deposit again and lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "August 20, 2022, 06:31:29 AM",
      "body": "I would definitely create a scam accusation thread and rescind it (changed title too) once it is solved after contacting the rep of the site. Anyway but why do I feel that op is the same person as the one who created a scam accusation thread against duelbits?. Is it because of the account newly created and the person I said about got neg trust and many don't believe anything anymore both didn't provide any proof and just complaint about not getting paid after withdrawing because of KYC. What would you guys think?. It's just my gut telling what I feel and not what I think op is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 20, 2022, 07:14:55 AM",
      "body": "Quote from: nakamura12 on August 20, 2022, 06:31:29 AMI would definitely create a scam accusation thread and rescind it (changed title too) once it is solved after contacting the rep of the site. Anyway but why do I feel that op is the same person as the one who created a scam accusation thread against duelbits?. Is it because of the account newly created and the person I said about got neg trust and many don't believe anything anymore both didn't provide any proof and just complaint about not getting paid after withdrawing because of KYC. What would you guys think?. It's just my gut telling what I feel and not what I think op is.Exactly what should have been done by now. Screenshots to prove this and its all up to what DTs  would do. I'd give the benefit of the D for its just $750 but it shouldn't take more than 3 days for his KYC to be verified. Casinos don't self destruct for $750 but @yahoo62278 pointed out that the owner have not go  online for months, that's pretty much suspicious already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "August 20, 2022, 10:05:14 AM",
      "body": "I agree with yahoo on this, OP should make a proper report in the Scam Accusations board, with all the necessary evidence. We do not know for sure, but there are always two sides of the story. @ugottabet, it would help your case a lot if you could provide concrete proof to back up your claims, like screenshots or emails. But I also agree that if you were scammed by the casino, you should definitely report it in the Scam Accusations board. I hope it helps to resolve the matter.Quote from: cabron on August 20, 2022, 07:14:55 AM@yahoo62278 pointed out that the owner have not go  online for months, that's pretty much suspicious already.I'm not so sure about this. Some casinos don't have an official rep on the forum anymore, for example Roobet, but that doesn't necessarily mean anything suspicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ugottabet",
      "created_time": "August 20, 2022, 10:53:17 AM",
      "body": "well alot of hate as expected but thats fine it was 3am for me and i posted it sorry that people sleep what kind of proof do u need mate ill make gyazo links for all of you in an hour dw i can show everything",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ugottabet",
      "created_time": "August 20, 2022, 11:03:14 AM",
      "body": "UPDATE without KYC they are processing my withdrawls i got 3/15 50$ withdrawls now hoping for the rest later",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "August 20, 2022, 11:43:10 AM",
      "body": "Quote from: ugottabet on August 20, 2022, 11:03:14 AMUPDATE without KYC they are processing my withdrawls i got 3/15 50$ withdrawls now hoping for the rest laterYou should get all your withdrawals if they process the 3/15 of your funds, they've processed it, it just means that nothing is wrong with your account, and it's their system that's causing these issues, they should also issue an apology for the delay if they have specified the length of time they process the KYC and the withdrawal, this is one of the bad practice of some casinos delaying the withdrawals if players won a big amount, this will cause anxiety to players, they expect instant withdrawals if their account is clean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ugottabet",
      "created_time": "August 20, 2022, 11:55:02 AM",
      "body": "they have 1 guy processing all withdrawls and he only comes on on the weekend apparently they told me (the players) that 50$ withdrawls go faster so i did 15 of 50$ hoping for the rest soon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 20, 2022, 12:08:29 PM",
      "body": "Quote from: ugottabet on August 20, 2022, 11:55:02 AMthey have 1 guy processing all withdrawls and he only comes on on the weekend apparently they told me (the players) that 50$ withdrawls go faster so i did 15 of 50$ hoping for the rest soonWhen I see Support saying things like this.... I cringe... because that says a lot about the site and how it is being managed. The deposits and withdrawals must be super quick at casinos, because gamblers judge a site... based on that.  The scam accusations that #yahoo62278 are talking about, shows that they are \"bad\" operators... so I will not get my hopes up too high. Good luck.... it's going to be a battle getting your money out of this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ugottabet",
      "created_time": "August 20, 2022, 12:38:11 PM",
      "body": "every complaint on askgamblers is about my problem aswell extremely slow withdrawls and live supp telling people to be patient i hope to get all my money this weekend and yes indeed only 1 conformation for deposit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}