{
  "id": "topic_5517800",
  "title": "_act_",
  "author": "_act_",
  "created_time": "November 11, 2024, 10:19:11 AM",
  "content": "You can easily understand what this thread is about from the topic title. You can read it in details yourselves: https://cointelegraph.com/news/microstrategy-bitcoin-portfolio-surpass-20-billionBitcoin has disappointed bitcoin critics like Peter Sheriff and Warren Buffett. Those that hold their coins are not disappointed. I can remember Peter Sheriff saying bitcoin is backed by nothing that its price is going to zero. But bitcoin is over $80000 right now. Bitcoin also helped Microstrategy Inc MSTR to increase in price and value. Micheal Saylor is a good business man.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5517800",
  "comments": [
    {
      "author": "bettercrypto",
      "created_time": "November 11, 2024, 01:44:47 PM",
      "body": "If his ROI is like that, it's not surprising because he's a businessman. Also, he has a lot of trust and belief in Bitcoin because he knows that it really has a long-term investment potential.Maybe that 20B$ could possibly circulate three times more. Even if it's 60 Billion, you know the market is too unpredictable and long-term investors only expect that they will get a profit in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "November 11, 2024, 01:54:47 PM",
      "body": "You can get MicroStrategy's ROI of their Bitcoin portfolio with following sites. There are perhaps more websites can give you this information as well. When you compare information from different sites, maybe they're not the same, like one is correct and others are less accurate by not update on time. However, it's not too important, and by looking at these numbers, you will see amazing effects on an investment portfolio through DCA strategy. It's the key point you must take and learn from MicroStrategy.https://saylortracker.com/https://bitcointreasuries.net/entities/1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "November 11, 2024, 02:02:29 PM",
      "body": "Quote from: _act_ on November 11, 2024, 10:19:11 AM Micheal Saylor is a good business man.As a bitcoin investor, I admire Micheal Saylor's bitcoin investment but that doesn't mean he is the only good businessman, and Warren Buffett or Peter Schiff or anyone who doesn't believe in bitcoin are not good businessmen or investors. Warren Buffett is one of the legendary investors and one of the richest people in the world with a net worth of over $145 billion, three times the market capitalization of Microstrategy. Meanwhile, Peter Schiff owns a fortune worth $70 million without having to invest in bitcoin. In general, they are all talented and successful people in business and investment. However, they have different preferences and investment mindsets, so they have different choices to become rich.By the way, I just read that Michael Saylor just bought another 27,200 BTC worth over $2 billion, bringing their total bitcoin holdings to 279,420 BTC.https://x.com/saylor/status/1855959543508828428",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "November 11, 2024, 02:31:49 PM",
      "body": "When someone ask why do you hold rather than tradingOP post is the answer to my question. Saylor took a risk and saw something in Bitcoin that other great investors weren't seeing and this decision is paying off.The nigga doesn't really care about the dip, he buys even at a Top Trust / Titanium balls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "November 11, 2024, 02:41:05 PM",
      "body": "This is indeed a good one. The company is already seeing their profit grow even when Bitcoin is just starting; even with the pump, they still make another purchase worth over $2 billion to show they believe their faith in Bitcoin is very strong and don't see any reason for them to back down.  Warren Buffett might publicly be criticising Bitcoin, but I so much believe that he might hold some in secret and will be too ashamed to admit it after he has lambasted Bitcoin for the past years now, considering it to be worth nothing and an overhyped something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "November 11, 2024, 02:55:41 PM",
      "body": "Michael Saylor not only buys real bitcoins, his company also issues stocks and bonds. He is an experienced businessman from Wall Street and seeks to buy assets not with his own money, but by attracting funds from others. Michael Saylor is a businessman, I would be careful not to call him a convinced Bitcoin maximalist or crypto evangelist. It seems to me that in a critical situation he may well start selling his bitcoins (just like he is buying now). However, at present he is making purchases of the first cryptocurrency, which increases its popularity and has a beneficial effect on its price. Not long ago, Michael Saylor was heavily (and rightly) criticized for his commitment to custodial storage of cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l99l",
      "created_time": "November 11, 2024, 04:11:28 PM",
      "body": "Michael Saylor has been one of the pioneers in this sector without listening to anyone, that's why he has made good profits, I have no doubt that these profits will increase in the future. Microstrategy Inc MSTR has been well-valued in the past period and there has been an increase at the same time. Microstrategy is not only about buying bitcoins, it is possible to see it in many areas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 11, 2024, 04:30:21 PM",
      "body": "Quote from: _act_ on November 11, 2024, 10:19:11 AMYou can easily understand what this thread is about from the topic title. You can read it in details yourselves: https://cointelegraph.com/news/microstrategy-bitcoin-portfolio-surpass-20-billionBitcoin has disappointed bitcoin critics like Peter Sheriff and Warren Buffett. Those that hold their coins are not disappointed. I can remember Peter Sheriff saying bitcoin is backed by nothing that its price is going to zero. But bitcoin is over $80000 right now. Bitcoin also helped Microstrategy Inc MSTR to increase in price and value. Micheal Saylor is a good business man.In business world, ditching the conventional thought process is one great quality every businessman should possess. It doesn't mean that conventional thoughts are bad. Warren Buffett is an old guy with conventional thought process and Mike Saylor holds unconventional thought process. The result is what we can see! All we need is a little guts to go against the tide. More power to Michael Saylor! Strategic buying with a mindset of winning can make us all rich!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "November 12, 2024, 02:12:36 AM",
      "body": "Anyone who has been DCAing bitcoin from the bottom has made decent profit. Even though Saylor has got approx. more than 100% as per the current price, he is still under Elon Musk's ROI.It seems Bitcoin's price surge has been boosting all companies shares that invested in it. It is like a snowball effect, and it may still grow higher considering how fast BTC is moving up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "November 12, 2024, 03:45:18 AM",
      "body": "Quote from: _act_ on November 11, 2024, 10:19:11 AMBitcoin has disappointed bitcoin critics like Peter Sheriff and Warren Buffett. Those that hold their coins are not disappointed. I can remember Peter Sheriff saying bitcoin is backed by nothing that its price is going to zero. But bitcoin is over $80000 right now. Bitcoin also helped Microstrategy Inc MSTR to increase in price and value. Micheal Saylor is a good business man.Some people will always criticize what they don't understand instead of becoming teachable. Some of these investors that are profiting from Bitcoin investment might have doubted the genuity of Bitcoin but changed their views after they understood it.  Bitcoin is currently over $87k and there are possibilities that it will keep appreciating. These critics might not acknowledge openly their false predictions and unnecessary attacks but in secret, they are regretting not taking advantage of the opportunities that Bitcoin offers. I am also happy that nations like El Salvador and Bhutan invested in Bitcoin and will also be in profit now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 12, 2024, 05:12:48 AM",
      "body": "I don't know if it's a joke or something, but it's Schiff, not Sheriff.  Quote from: Die_empty on November 12, 2024, 03:45:18 AMSome people will always criticize what they don't understand instead of becoming teachable. Some of these investors that are profiting from Bitcoin investment might have doubted the genuity of Bitcoin but changed their views after they understood it.  Bitcoin is currently over $87k and there are possibilities that it will keep appreciating. These critics might not acknowledge openly their false predictions and unnecessary attacks but in secret, they are regretting not taking advantage of the opportunities that Bitcoin offers. I am also happy that nations like El Salvador and Bhutan invested in Bitcoin and will also be in profit now.   For the likes of Peter, I don't think it's merely ignorance that makes him a harsh Bitcoin critic. I guess it's purely stubbornness. You criticize Bitcoin for many years, you argue against it on national TV, you debate face-to-face against popular Bitcoin advocates, and so on, you must have learned a lot about it in the process. But he stands his ground until now. He sticks to his side of the argument. It seems it's all for the sake of standing by it now. Deep inside him he probably knows the potential is still huge for Bitcoin, but he seemed to have decided once and for all to just play his role.Bhutan didn't invest in Bitcoin. They're producing all of their coins by mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 12, 2024, 05:33:11 AM",
      "body": "Quote from: Ambatman on November 11, 2024, 02:31:49 PMWhen someone ask why do you hold rather than tradingOP post is the answer to my question. Saylor took a risk and saw something in Bitcoin that other great investors weren't seeing and this decision is paying off.The nigga doesn't really care about the dip, he buys even at a Top Trust / Titanium balls. for a volatile asset as Bitcoin, you just have to applaud  microstrategy for keeping there ground to DCA regardless of the price of Bitcoin. Skeptics that didn't understand the nature of Bitcoin and that fails to see what the future holds for Bitcoin are currently short off and I'm sure they are regretting why they kept calm and didn't take the risk of ever investing in Bitcoin. Micro strategy meant business and ignored all possible risk they saw and still went in big. It's a motivation to young investors to keep building thier Bitcoin investment knowing that you're far behind these big guys.Another thing about seeing investors getting huge ROI and getting motivated to start investing is that you tend to feel that you're late and should have invested in the past only to discover that Bitcoin continues to go up to the moon and never DIPing again. The likes of Peter sheriff and most anti bitcoinner would be having a double thought on wether it's best to swallow thier pride and just start investing now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 12, 2024, 05:50:51 AM",
      "body": "Congratulations to Michael Saylor and MicroStrategy on this great achievement.Michael Saylor has proven himself to be a wise economist indeed, he deserves this victory after all this long wait.As for the fools like Peter Sheriff and Warren Buffett, they can go to hell while Michael Saylor celebrates his victory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "November 12, 2024, 05:53:18 AMLast edit: November 14, 2024, 01:36:09 PM by Josefjix",
      "body": "Quote from: _act_ on November 11, 2024, 10:19:11 AMYou can easily understand what this thread is about from the topic title. You can read it in details yourselves: https://cointelegraph.com/news/microstrategy-bitcoin-portfolio-surpass-20-billionBitcoin has disappointed bitcoin critics like Peter Sheriff and Warren Buffett. Those that hold their coins are not disappointed. I can remember Peter Sheriff saying bitcoin is backed by nothing that its price is going to zero. But bitcoin is over $80000 right now. Bitcoin also helped Microstrategy Inc MSTR to increase in price and value. Micheal Saylor is a good business man.I followed Michael Saylor on x formally Twitter and I always wondered the kind of confident he has on bitcoin.  Before this time he has already predicted and buying in the top when almost everyone was selling.  Calling him \"a good business man \" is an understatement! This man has put all his mind on bitcoin and is not looking back soon. In fact he just buy 27200btc worth $2B, about two days ago and now holding over 279,400btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ishicryptic",
      "created_time": "November 12, 2024, 06:19:08 AM",
      "body": "Quote from: l99l on November 11, 2024, 04:11:28 PMMichael Saylor has been one of the pioneers in this sector without listening to anyone, that's why he has made good profits, I have no doubt that these profits will increase in the future. Microstrategy Inc MSTR has been well-valued in the past period and there has been an increase at the same time. Microstrategy is not only about buying bitcoins, it is possible to see it in many areas.This is true about real Bitcoin believers like Michael Saylor,  it's people like him that are motivating a lot of others to believe in the potentials of Bitcoin as a store of value, his undoubting confidence to be investing billions of dollars without a fear is worthy to note. His Bitcoin worth has no doubt put many haters like Warren Buffett, to shame, coupled with the enviable and mind-blowing returns on investment that is accruing to him. I firmly believe that Bitcoin will reach a height in the future that people who are still skeptical about it today will finally wish that they had done the right thing by investing in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 12, 2024, 06:21:23 AM",
      "body": "Quote from: _act_ on November 11, 2024, 10:19:11 AMBitcoin has disappointed bitcoin critics like Peter Sheriff and Warren Buffett. Those that hold their coins are not disappointed. I can remember Peter Sheriff saying bitcoin is backed by nothing that its price is going to zero. But bitcoin is over $80000 right now. I doubt these two ever dreamt that Bitcoin will surpass 80K in a small span of time. If everything goes as smooth as it is looking now Bitcoin may go beyond 90K by the month end. This is how Bitcoin has always reacted to those who have only spread hate against it. I was reading an article recently wherein they said if Germany had not sold it's 50KBTC at a value of 54K then they would have made a profit in billions with the current price of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "November 12, 2024, 06:50:19 AM",
      "body": "Michael Saylor is the most interesting man in the world, and soon to be the richest!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 12, 2024, 07:01:31 AM",
      "body": "It's impressive to see how MicroStrategy's Bitcoin strategy has paid off. Despite the skepticism from critics, Bitcoin continues to show its potential. Saylor's belief in Bitcoin has certainly transformed MicroStrategy, demonstrating the power of long-term vision in business. It's a fascinating case of how a bold bet on a volatile asset can pay off especially for those who truly believe in its future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 12, 2024, 07:04:37 AM",
      "body": "Quote from: _act_ on November 11, 2024, 10:19:11 AMYou can easily understand what this thread is about from the topic title. You can read it in details yourselves: https://cointelegraph.com/news/microstrategy-bitcoin-portfolio-surpass-20-billionBitcoin has disappointed bitcoin critics like Peter Sheriff and Warren Buffett. Those that hold their coins are not disappointed. I can remember Peter Sheriff saying bitcoin is backed by nothing that its price is going to zero. But bitcoin is over $80000 right now. Bitcoin also helped Microstrategy Inc MSTR to increase in price and value. Micheal Saylor is a good business man.OK, Saylor has placed his bet on the best financial asset, but to be honest, I don't care.We have to remember that every Bitcoin price is temporary and another price crash might be hiding behind the corner. The current price pump was caused by the hype around Trump's election and his promises about crypto. Let's wait and see if he is going to keep his promises.I know from personal experience that price pumps/bull runs, that are caused by pure hype are fragile and unsustainable.Haters gonna hate no matter what. Even if the Bitcoin price hits 100K USD, there will still be Bitcoin haters complaining about \"the Bitcoin price bubble\" and spreading all kinds of FUD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}