{
  "id": "topic_5411546",
  "title": "xtraelv",
  "author": "xtraelv",
  "created_time": "August 28, 2022, 11:42:44 PMLast edit: August 28, 2022, 11:56:05 PM by xtraelv",
  "content": "https://www.defendingbtc.com/On September 12 Hodlonaut and Craig Wright will be heard in the Norwegian court. Craig has tried everything to prevent this from taking place. Appealing each step along the way and has not paid the amounts ordered by the court to pay Hodlonaut. Craig has said that whether he is Satoshi will be proven in court. This is his chance to show all his proof in a court that requires him to provide the proof. This court case is a direct result of the BSV community doxxing of Hodlonaut for the $5000 bounty put up by Calvin Ayre. Craig is still pursuing Hodlonaut in the UK courts for defamation. The UK courts are particularly biased against defendants of defamation cases. Effectively requiring the plaintiff to offer no proof and requiring the defendant to prove that the statement was not defamatory. This is particularly expensive. Estimated to be around £5m just for a full hearing. Hodlonaut needs our help to take down this fraud* and his enablers. https://www.defendingbtc.com/*Craig was convicted of contempt of court in NSW and lost a civil case in the US for conversion. Ordered to pay $100m plus interest. (Still unpaid) Craig has failed to return BTC sent by reporters that he said he would send back. He has been found by 8 different judges on three continents to have provided false testimony and false evidence. Craigs funder Calvin Ayre is a former banned director in BC and former indicted money launderer (US). He appeared in the ICE ten most wanted. Later this was settled for a lesser charge to which he pled guilty after being a fugitive for many years.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411546",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "August 29, 2022, 09:47:02 AM",
      "body": "What could easily help hodlnaut is if he is able to publicly prove the other is not Satoshi without paying so much in court to prove that or to win a case... that is not justice. Proving this publicly should effectively cancel the defamation case brought against him, and possibly get him compensation for the doxing, unfair treatments and waisted time.All he need if he would listen is to have the Bitcoin community help him/her prove the other is not Satoshi. A convincing prove should be satisfactory and hard to contradict. Once this is done he automatically get justice without the traditional courts. I will probably help in the prove that the other is fake Satoshi. His current character heavily contradicts the real Satoshi we are aware of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "August 30, 2022, 01:58:03 PM",
      "body": "Quote from: Ucy on August 29, 2022, 09:47:02 AMWhat could easily help hodlnaut is if he is able to publicly prove the other is not Satoshi without paying so much in court to prove that or to win a case... that is not justice. Proving this publicly should effectively cancel the defamation case brought against him, and possibly get him compensation for the doxing, unfair treatments and waisted time.All he need if he would listen is to have the Bitcoin community help him/her prove the other is not Satoshi. A convincing prove should be satisfactory and hard to contradict. Once this is done he automatically get justice without the traditional courts. I will probably help in the prove that the other is fake Satoshi. His current character heavily contradicts the real Satoshi we are aware of. Bitcoin price moved up shortly after this 👆 comment. A sign that it is true and will definitely help.Let me know when you guys are ready to expose fake Satoshi. Do you need nothing but theTruth? Check out these very useful Threads: Extraordinary ways to move Bitcoin price without money | How to Bet without \"Gambling\" | Compilation of My Works on Bitcoin/Crypto | My Faith-based Posts Compilation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}