{
  "id": "topic_5459426",
  "title": "Question:",
  "author": "robelneo",
  "created_time": "July 11, 2023, 01:44:11 PM",
  "content": "Lottery here in our country is being run by our government and the majority of the citizen in our country are lottery bettors for many years, I personally know people who are betting for ten or more years but they still have not hit the jackpot I wonder what these people think or if you're a lottery bettor for many years and you read that one first time bettor hit a huge jackpot in a lottery.Will you feel envious? Ok with it? or motivated?Filipino first-time bettor wins 15 million Dirhams in Dubai lottery",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459426",
  "comments": [
    {
      "author": "mu_enrico",
      "created_time": "July 11, 2023, 01:50:34 PM",
      "body": "I'm okay with it and here are two things that come to my mind:- luck is random- the very definition of a successful gambler (if he doesn't come back and gamble again)Hopefully, he doesn't end up like most lottery winner, which is bankrupt after several years.QuoteThe winning combination was 6-29-34-17-25-22.Holy smoke, that's 11 digits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 11, 2023, 01:53:29 PM",
      "body": "Quote from: robelneo on July 11, 2023, 01:44:11 PMWill you feel envious? Ok with it? or motivated?Envy for what reason? I can not feel jealous at all. But does this not look off-topic? It looks off-topic to me because this is not about gambling but about how someone feels if another person won lottery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 11, 2023, 01:57:03 PM",
      "body": "QuoteHe added that 15 is his lucky number because he's in Dubai for 15 years. The lottery's ticket is worth 15 Dirhams and he won 15 million Dirhams.QuoteHe said that 6 was from his birth month, 29 for his birthday, 34 for his age, 17 for the age of his child, 25 for sibling's birthday and 22 for the birthday of his mom.I guess it's better to pick numbers that's somehow related to you or your family instead of just random numbers. The only thing I'm missing in this story is how the heck did he not choose number 15 if that was really his lucky number? Any other lottery ticket buyer would have added that in the mix.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 11, 2023, 01:58:49 PM",
      "body": "there is really a LOT of luck here in this win!Generally speaking, winning the lottery is really hard (there was a tool in another topic that help to complete simulations... although i played for hundreds of years i never won the top prize  )...envious I would say never. ok these are important figures that give security but there is not only money in this world, there are much more precious and \"priceless\" things",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "July 11, 2023, 02:12:02 PM",
      "body": "I'm kinda obvious we're just human for someone who accomplishes it on one bet while you still do it after so many years it kinda hurts your pride, but it just proved that the lottery is a game of luck and anyone can win a lottery with one bet, I also read one news online that it took him 25 years to hit the jackpot the man is already old and it's a good time to come just when he is retiring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 11, 2023, 02:15:45 PM",
      "body": "I am happy for everyone who wins it big,be it state lottery,sport betting,slot machines or any other game as long as they hit it big I am happy for these persons who if they are smart enough these are life changing events and should be taken with caution and not be arrogant toward the luck that favored you.Of course it is also motivational as every time I see such stories my moral goes up when I place sport bets or when I start playing a new session in a slot machine,I have higher hopes than I would normally have without seeing such great stories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "July 11, 2023, 02:33:08 PM",
      "body": "Well, maybe there is a little jealousy to see someone who managed to hit a big jackpot in the lottery.But we don't have to envy them long because their victory is certain.After all, they have luck so they can only get the jackpot after years of buying the lottery.I am not motivated to buy the lottery even though the tickets are cheap and I can budget some money to buy them weekly or monthly at a time.So I think they really deserve to be the winner and can get the big jackpot.If I'm interested someday, I may go ahead and buy it for fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "July 11, 2023, 02:40:27 PM",
      "body": "He was so lucky that his first bet on the Lottery instantly won a Jackpot of 15 Million Dirhams.Why should I feel jealous? It's common and I see so many lottery winners around the world so it's just random luck, but we keep betting on the lottery then never expect more because picking numbers is very difficult, so I'm just used to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 11, 2023, 02:45:13 PM",
      "body": "Quote from: robelneo on July 11, 2023, 01:44:11 PMWill you feel envious? Ok with it? or motivated?We all know the lottery, the type of gambling that many people often bet on, in other words, the lottery is easy to bet on and if you get a large amount of money, don't be surprised if lottery gambling can arise various fantasies for gambling bettors.I think everyone has lucky days and bad days, that's the main problem that is felt by every human being, for that for me someone is really big in lottery betting or not in my assessment referring to point number two, meaning: (I'm ok with it), envy and motivation are not the main factors in my assessment of that person's big win.Even though I chose number two, it doesn't mean I'm not motivated and jealous of getting money in 1-10 hours, one day and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 11, 2023, 02:47:18 PM",
      "body": "From the very start, it's known as a luck-based game so there's no heartbreak upon hearing someone wins the lottery for the very first time and I'd be even happier to hear that knowing someone won and beat the system. LOL.Those that have been betting in the lottery for a lot of years and haven't got a chance to win only believes on one thing. And that is winning the jackpot once and they'll break even.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "July 11, 2023, 02:54:18 PM",
      "body": "Even though I wasn't the winner and there's no relation about him with me, I feel happy with his win because I can relate about big achievement feeling.Don't feel sad with anyone else winning, maybe he's the winner now, but maybe in the next year it's your turn, just believe in yourself. I think the winner now worried about this privacy because anyone already know if he's the winner, pretty sure many people will ask money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "July 11, 2023, 03:03:38 PM",
      "body": "Definitely envious lol Who wouldn't want to make that much some people are just luckier than anyone else. And he got what he wished for in his first attempt, while others are just wishing it for years yet never got the wish. I remember buying a lottery ticket as well thinking I might win. There are days in my life when I got extra dollars to spend and a ticket wouldn't hurt if I get the chance. Sometimes I forget about the ticket the next day. Never knowing if I won. Sometimes I check.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "July 11, 2023, 03:53:05 PM",
      "body": "I would be lying if I would say I'm not jealous. Damn, what a lucky man he is! It's just so fascinating that there are extremely lucky people. I feel a little bit envious because the odds favored him so much, but I'm more than happy for him even if I don't know him. Money is very much needed nowadays so I hope he'll spend it properly so that he won't have to bet anytime soon because he have more than enough fund to sustain his needs and wants. Other people might find this motivating to bet on lottery, and there's nothing wrong with that. Just be reminded that there should be limitations in betting to avoid unmanaged finances that could lead to chaos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "July 11, 2023, 04:15:48 PM",
      "body": "No one can control the result of lottery and it is very difficult to predict it.  Winning the lottery is a matter of great luck. I have seen many people win the lottery front in my eyes but my luck never worked in the lottery and I never won the lottery. Lotteries with million dollar jackpots are not run in my country. In my country I have seen $25k max in lotteries and that was the first prize. Lottery is a form of gambling that's right but it is not predictable like all other gambling.  Lottery can be won by people who have a lot of luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "July 11, 2023, 04:22:22 PM",
      "body": "I feel like I need to bet on it too from now on mode. I will never be envious if that luck wasn't for me in the first place and I'm ok with it that they are winning something, it's just too immature to feel that envy. We all want to win or be successful even if it's just thru gambling, there's nothing wrong with it but getting envy from a first-time bettor is not that great, they deserve it if they win it. A fact, we want to be them too if they win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "July 11, 2023, 04:27:21 PM",
      "body": "I'm also okay with seeing another bettor win big, but I don't see the need to feel jealous or motivated because i'm already used to seeing others win big on crypto casinos. I guess i'm past that phase of hoping to win big that's why I don't feel anything aside from congratulating them but I understand if others feel that way when they see another bettor win big. Anyway, I have to say that this is probably the craziest beginner's luck since it's his first lottery ticket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "July 11, 2023, 04:43:04 PM",
      "body": "We all know that the lottery depends on luck, so there's no need to be jealous of the winners because they are chosen at random, so you don't have to be jealous of anyone, it will only make us more disappointed with this game, most people who see other people's success are motivated. to do so, it's the same as winning a big lottery, of course, people who see it will be motivated to buy the lottery.After all, we cannot predict and guess the lottery, so everything is really due to luck, even though we have been playing the lottery for decades but haven't won it, it all depends on ourselves whether we want to stop or not, because we don't know our luck might come when we stop. . no one knows when luck will come",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "July 11, 2023, 04:46:15 PM",
      "body": "It would be fine to envy someone who is in a state or place you desire, would only be bad if your actions would be affected by it. Lottery is a game wherein people who win is quite on a ratio of 1:10,000,000 or even more which simply means that things rely on your fate and luck. If someone you know actually won the jackpot, it won't still be advisable to go all out 'coz you won't be certain that the same thing will happen on your end. It is okay to be inspired or amazed by such instance but never allow your emotions to control your actions such as letting envy and inspiration push you to gamble more or what not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 11, 2023, 05:00:12 PM",
      "body": "Quote from: robelneo on July 11, 2023, 01:44:11 PMWill you feel envious? Ok with it? or motivated?This is a pretty simple case, if I come across a news or an article about a rookie who just got lucky with their first few lottery tickets and won a huge amount the first thought that comes to my mind will be \"what a lucky dude\".You can't possibly be envious of someone or something you know nothing about. If it was something that happened to someone close to me, I would have wished it was me and hope my turn comes.If you should become envious what exactly do you stand to gain? After all lottery winning is not something that's based on skills, so you trying to be envious would only drive you to buy more tickets which would lead to more losses rather then the winnings you anticipated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}