{
  "id": "topic_5436461",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "January 23, 2023, 12:02:04 PM",
  "content": "Обзадумался я тут одной проблемой. На самом деле, у меня лично нет такой проблемы, но у многих российских мужчин, кажется, она есть. Проблема в размере. Сами понимаете – чего. И надо как-то это компенсировать.       Итак, в России существует два вида мужчин. Настоящие мужики, которые могут себе позволить купить машину, и все прочие, которые ездят на метро и автобусах. Но этот пост не про них, про это категорию я напишу потом когданить.        Допустим, российский мужик, наконец, зарабатывает достаточную сумму денег и покупает себе машину. Сразу или в кредит. Какую? И тут встает ГЛАВНЫЙ вопрос. Большую (типа джипа) или маленькую (типа Мини-купер). Как показывает собранная мной статистика, обычно те мужики, у которых маленький член – те покупаю джипы. Чтобы скомпенсировать размер размером. А те, у которых достаточный или большой – те вышеупомянутых комплексов не имеют, а покупают небольшие машины, желательно навороченные.  Для удобства. Ибо с парковками все хуже и хуже. В Москве уже даже за большие деньги в центре проблема запарковаться.        Но слаб человек. И понимая, что жизнь коротка, а прожить ее нужно так, чтобы «мама не горюй» предпочитают покупать себе «что побольше». Ну, или на крайняк, микроавтобус. Чтобы показать всем «кто я такой» - когда других способов самоутвердиться уже не находится.        Мне кажется, что если будут ответы на данный топик, то они будут чисто от людей с комплексами на джипах. А владельцы автомобилей Ока будут тихо помалкивать и понимать, что я – прав!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436461",
  "comments": [
    {
      "author": "xandry",
      "created_time": "January 23, 2023, 03:39:15 PM",
      "body": "Quote from: bonfire66 on January 23, 2023, 12:02:04 PMБольшую (типа джипа) или маленькую (типа Мини-купер). Как показывает собранная мной статистика, обычно те мужики, у которых маленький член – те покупаю джипы. Чтобы скомпенсировать размер размером.Обратите внимание, что у владельцев джипов ещё одна фишечка теперь есть - они ещё букву \"Z\" на заднее стекло клеят.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pavel.Savelev",
      "created_time": "January 23, 2023, 09:37:06 PM",
      "body": "Quote from: bonfire66 on January 23, 2023, 12:02:04 PM      Обзадумался я тут одной проблемой. На самом деле, у меня лично нет такой проблемы, но у многих российских мужчин, кажется, она есть. Проблема в размере. Сами понимаете – чего. И надо как-то это компенсировать.       Итак, в России существует два вида мужчин. Настоящие мужики, которые могут себе позволить купить машину, и все прочие, которые ездят на метро и автобусах. Но этот пост не про них, про это категорию я напишу потом когданить.        Допустим, российский мужик, наконец, зарабатывает достаточную сумму денег и покупает себе машину. Сразу или в кредит. Какую? И тут встает ГЛАВНЫЙ вопрос. Большую (типа джипа) или маленькую (типа Мини-купер). Как показывает собранная мной статистика, обычно те мужики, у которых маленький член – те покупаю джипы. Чтобы скомпенсировать размер размером. А те, у которых достаточный или большой – те вышеупомянутых комплексов не имеют, а покупают небольшие машины, желательно навороченные.  Для удобства. Ибо с парковками все хуже и хуже. В Москве уже даже за большие деньги в центре проблема запарковаться.        Но слаб человек. И понимая, что жизнь коротка, а прожить ее нужно так, чтобы «мама не горюй» предпочитают покупать себе «что побольше». Ну, или на крайняк, микроавтобус. Чтобы показать всем «кто я такой» - когда других способов самоутвердиться уже не находится.        Мне кажется, что если будут ответы на данный топик, то они будут чисто от людей с комплексами на джипах. А владельцы автомобилей Ока будут тихо помалкивать и понимать, что я – прав!Я знаю пару человек, у которых микроавтобусы и по несколько детей. Фиг знает по размеру члена они выбирали машину или из-за того что детей в простом седане сажать некуда.Еше пару человек у которых было тысячи баб в своей жизни, они кайфовали от смартов-брабус пока их выпускать не перестали, но при этом имели гелики для встреч.Есть пару человек которые 8 из 7 дней в неделю проводят либо на трассе либо в сельской местности. У них прадики, дикавери, пахерики и тп.Вот реально не понимаю тех людей которые покупают рэмы и что то подобное. тут наверное точно члены виноваты.Не думаю что все зависит от того что ниже пояса. А вот когда пишут, что есть одна история которая случилась с моим другом, это всегда сомнительно. Почему блин у всех есть такие друзья, но это никогда не случалось ни с кем лично.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}