{
  "id": "topic_5416604",
  "title": "Editbar",
  "author": "Editbar",
  "created_time": "October 10, 2022, 02:11:05 PM",
  "content": "This is important especially at this point in the market because we are so low already with the prices of cryptocurrencies however the old saying is if we go down 80 nothing is stopping us from going down another 80 so we want to identify the best times to be buying altcoins for those longer-term swing trades my vision and opinion with cryptocurrencies is that there's still only a handful that is worth holding for a longer period but the vast majority of them should 100 be dumped as soon as possible to take those profits this has been my position throughout the entire 2021 bull market I was hated for it at the tops of the market but I guess now in the bear market everyone can see I went through it in 2017 I held the coins to the Lowe's reposition my portfolio made sure I got out of it so that I could be fresh for the next bull market and I think we're starting to fall into that period now however the good news is we still have a fair bit of time even if we see a little Bounce from this area that we're in maybe the little bounce feels huge maybe.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416604",
  "comments": [
    {
      "author": "dimonstration",
      "created_time": "October 10, 2022, 02:25:08 PM",
      "body": "This will be an interesting story if you can provide proof to all your claims such as screenshot of your buy and sell history to backed up your story. There is a lot of user here claiming this kind of success story without proof while getting the timing on when to buy and sell properly is still the biggest question here in the forum.Old coin should be evaluated first before anyone buy back again on it because some old coins is already stagnant with low trading volume. These are dead projects that just slowly abandoning the project. Buying these tokens is a trap. But most of the old coins with good trading volume can be bought near the all time low since the current market condition is already approaching towards it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "October 10, 2022, 02:50:05 PM",
      "body": "Depends on the coin you are planning to invest your money with. Not all Old coins have the potential; there might be a reason why it became old with a low market price (assuming that it is 'coz you are planning to invest into it), unless it is like Bitcoin and others. Check for market volume, demand and its popularity still or utility and check if it still has 'life'. There's no such thing as perfect time. Analyze and make a move whether to engage on a particular coin or not. But based on experience, those coins which are left behind by time, are having slightest chance to come back especially if it did not make an impact on its prime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "akbur.hossain",
      "created_time": "October 10, 2022, 03:04:04 PM",
      "body": "I don't understand what old coins you mean.  But some of the things found in older coins are development and community and blockchain technology is right.  They are playing a leading role in maintaining the market in a very good way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RussianEnglishTranslation",
      "created_time": "October 10, 2022, 03:22:13 PM",
      "body": "You can't time the market, the best you can do is buy when its' red and sell when it's green. TA is a meme. The best solutions for accumulating wealth in a bear market besides trading is staking and yield farming. I suggest staking ICP and yield farming on FTM or MATIC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "October 10, 2022, 03:44:48 PM",
      "body": "Probably never. I dont remember any Coin that has recovered ...Its really hard a coin that suffered a collapse in price should be able to recover from It.There are many reasons and explanations I would not be focused in that search. Yesterday I was reading a research that around 13000 coins/token have been delisted by exchanges just the last year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kesmex",
      "created_time": "October 10, 2022, 03:51:26 PM",
      "body": "Quote from: bitkanu on October 10, 2022, 03:39:43 PMQuote from: akbur.hossain on October 10, 2022, 03:04:04 PMI don't understand what old coins you mean.  But some of the things found in older coins are development and community and blockchain technology is right.  They are playing a leading role in maintaining the market in a very good wayold coins meant the coins that already exist since a long time ago just like bitcoin, ethereum etc. Those are old coins in the crypto that still exist till now caused by they have very strong fundamental. You have got the points mate. that's why he was looking for old coins as his investment. The fact that if old coins are also giving people more opportunity to make money as well as low cap coins. Old coins like Bitcoin, Ethereum, and BNB these three coins are unquestionable,by having strong fundamentals, the three coins are very suitable for long-term investments,profitable or not, it really comes back to how we trade",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbc23",
      "created_time": "October 10, 2022, 04:11:51 PM",
      "body": "Hope you recall not all old coins ever survived bear market some crashed for ever. It will be more straight forward if you point out specifically which old coin you could be referring to. For now Bitcoin is the most reliable and to time when to buy is simply buying where you met the price if it pumps take profit and what to buy lower again because no one can emphatically say where the next bear or bull price will hit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 10, 2022, 04:19:35 PM",
      "body": "There are tons of old coins that are in the market which are still available for the taking. It highly depends on the volume and market dynamics of the coin if it will make or break. A lot of them crashed heavily in the previous years and most are beyond recovery at this point. Though there are some that are still experiencing some pumps and dumps, but it's always safe to just invest on coins that are still active in the market than risking on old coins which has no activity or updates whatsoever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "October 10, 2022, 04:32:08 PM",
      "body": "It is proven that not all old coins has a chance to rise on the next bull run. I've also been on the 2017 bull market and the bear market that happened on 2018. Sadly I have a few coins that time that I kept and hoping to rise on the last bull market but nahh it fell to the ground and never survived the bear market. There are just very few who make it and those are some top notch quality project just like ethereum. This bear market, my personal strategy is to find new born altcoins who were created during the bear market since most of the top rising altcoins on last bull market is the coins that were born during the bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "October 10, 2022, 04:40:46 PM",
      "body": "Buy now or regret it later. It's hard to determine how bottom the altcoins will go. What you can do yo make sure if you are buying at the bottom price like this time. The global crisis is still happening and there will be more and more discount to the all of cryptos. The old coins have become the hottest investment this time, it can be seen from how many investors are putting their money to buy old coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdzahed134",
      "created_time": "October 10, 2022, 08:19:56 PM",
      "body": "So many old coins in the cryptocurrency market but i don’t considered all of the coins will be good investment for the long run. EOS,OMG,OX,PUNDIX,SIA & KNC those of coins was top 50 ranking in CMC but those decreasing and i don’t think those will again will increase their rank but still all of those good trading volume but i don’t invest even for the short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 10, 2022, 08:31:55 PM",
      "body": "I think you should follow the lowest value of a coin in the last 2 years. I believe that everyone can go to that line, but also (my opinion) that it is their lowest limit.of course, we are talking about coins that have some kind of real support, not one-season trash.I also won't be surprised if this bear period lasts for a long time, so somehow I'm not worried myself, there will still be time for a potential entry into altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "October 10, 2022, 10:01:08 PM",
      "body": "If that old coin/token is no longer active, with a small volume and not existed on many exchange I suggest not to deal with it anymore and just choose the old coin that are still part of the top 20 coins, BTC is the best option above all but other Altcoins are good as well. To know when is the best time to buy, you have to do your technical analysis and understand the movement of the chart, it can tell you when is a good time to timing the trend. TA works, so don’t forget to do this every time you trade or invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jaered",
      "created_time": "October 10, 2022, 10:54:26 PM",
      "body": "There is no good or perfect time to buy or interact with 'old coins'. This is because even though we are riding a bearish trend, no one knows when that much awaited bullish market to pop in, and take everyone by surprise. So just do it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NewRanger",
      "created_time": "October 10, 2022, 11:09:39 PM",
      "body": "Quote from: dbc23 on October 10, 2022, 04:11:51 PMHope you recall not all old coins ever survived bear market some crashed for ever. It will be more straight forward if you point out specifically which old coin you could be referring to. For now Bitcoin is the most reliable and to time when to buy is simply buying where you met the price if it pumps take profit and what to buy lower again because no one can emphatically say where the next bear or bull price will hitpick only on coins that have utility only , it will bring demand in market . not only bitcoin that will be good assets in this bearish market , some altcoin will give us good return too next year. look at algorand which is as blockchain partner in world cup 2023, it could be main trigger for algo movement.. and also RSR will finish its main net  in near time . both of them wil be beast coin in 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "October 10, 2022, 11:17:23 PM",
      "body": "Quote from: RussianEnglishTranslation on October 10, 2022, 03:22:13 PMYou can't time the market, the best you can do is buy when its' red and sell when it's green. TA is a meme. The best solutions for accumulating wealth in a bear market besides trading is staking and yield farming. I suggest staking ICP and yield farming on FTM or MATIC.You buy at red but the chart is going even deeper. That means you are still buying at high low. It will make you feel so difficult to make profit from what you have bought. I meant just try to tell you about the fact if your staking and farming may be affected with the price. You're staking while at the same time your capital gain got decrease and what's the difference?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 11, 2022, 07:12:53 PM",
      "body": "Quote from: Editbar on October 10, 2022, 02:11:05 PMmy vision and opinion with cryptocurrencies is that there's still only a handful that is worth holding for a longer period but the vast majority of them should 100 be dumped as soon as possible to take those profits this has been my position throughout the entire 2021 bull market I was hated for it at the tops of the market but I guess now in the bear market everyone can see I went through it in 2017 I held the coins to the Lowe's reposition my portfolio made sure I got out of it so that I could be fresh for the next bull market and I think we're starting to fall into that period now however the good news is we still have a fair bit of time even if we see a little Bounce from this area that we're in maybe the little bounce feels huge maybe.With my experience in the market, I agree to what you've said. Some are good to hold forever if not, then for a long time while the majority are good just to dump and take your profit from it.Well, as we grow on this market, we understand manage to see the differences every cycle although that's only a little and most of it are just the same. And we learn that not all of them goes back and healthy just as how they went when they're on the bull run.A new project launches and surges and people come into it hoping that they'll make a quick buck but gets the opposing result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "October 11, 2022, 07:54:49 PM",
      "body": "I feel that the old coin that is still worth holding is XRP. xrp has been around since before ethereum existed. (that's what I read). and I think this coin can hold up well. even continue to be patient through times of crisis in court. which finally now they have started to see a bright spot. but everything is risky. but some old coins are still worth holding on to. and Xrp which is my choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "October 11, 2022, 08:02:10 PM",
      "body": "Quote from: Editbar on October 10, 2022, 02:11:05 PMThis is important especially at this point in the market because we are so low already with the prices of cryptocurrencies however the old saying is if we go down 80 nothing is stopping us from going down another 80 so we want to identify the best times to be buying altcoins for those longer-term swing trades.I always have a hard time to buy Ethereum for 4000$ for example when i know that lot of people have bought it for below 1000$ a few years ago. That is the reason why for me a bear market, even though i hate that we are in a bear market at the moment because my portfolio worth is almost 0 now, is always a good chance to buy into projects that are already big and established.I personally have bought Cosmos (Atom) a few weeks ago for around 10$ per coin. I could have gotten it for 6$ also a few months before but then i was to unsure if we would not totally crash because that was when the Terra hack happened. That being said i am still happy with my buy because it is almost impossible to hit the perfect time. If you hodl enough i think you can do nothing wrong if you buy now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}