{
  "id": "topic_5473487",
  "title": "Question:",
  "author": "robelneo",
  "created_time": "November 09, 2023, 12:49:52 PM",
  "content": "Someone's 0 gonna go and take the two titles with it this is going to be a very exciting fight not because both fighters are undefeated but more so because both fighters have a great ring generalship, although Rodriguez packs more power than Edwards, Edwards movement is almost flawless so its going to be a battle of style and the winner will remain undefeated and takes the two titles.I have Bam Bam Rodriguez winning by knockout because between the two has a good knockout percentage he can land those left hands he had a good chance of winning by knockout or stoppage, Sunny Edwards, for him to win needs to take every round to accumulate points because he is not known to have a big punch.Jesse 'Bam' Rodriguez (Highlights/Knockouts)SUNNY EDWARDS HIGHLIGHTS ▶ ENTERING THE MATRIX",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473487",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "November 09, 2023, 01:20:45 PM",
      "body": "I'm taking Rodriguez here since he has the advantage in almost all tangible metrics. I like how he creates those angles like sliding to his right or left and unloading an uppercut or a hook. I also think he is the more disciplined fighter and will make Edwards suffer for his showboating tendencies.Current ML odds:Rodriguez @1.48Edwards @2.55",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "November 09, 2023, 01:49:02 PM",
      "body": "Rodriguez is very good at finding angles, and being a southpaw makes it hard for every fighter that he fought, I saw his highlights, it is hard to face someone who can shift like that, Pacquiao made it part of his arsenal but Rodriguez perfected it, even if Edwards has slick moves, Rodriguez punches will find its mark based on how he shift and prepare his left hand to land.I love it when both undefeated fighters go for the title, they are fully prepared to get the title and at the same time take the undefeated record of their opponent, I'm sure this is going to be an entertaining fight, this is a not to be missed fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "November 09, 2023, 02:02:06 PM",
      "body": "Both fighters are undefeated, but I'm leaning towards Rodriguez due to his higher knockout rate compared to Edwards. According to their BoxRec records, Rodriguez has 11 knockouts in 18 fights, while Edwards has only secured 4 in 20 bouts.This matchup is interesting as both remain undefeated, but I'm going with the underdog, Edwards. Even though he may not be a knockout artist, if he's a smart fighter in the ring, he has a good chance of extending his winning streak.-----Voted already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "November 09, 2023, 02:21:41 PM",
      "body": "It's contrasting style and power, but I see Rodriguez emerging here because of his power and his moves in the ring, checking the highlights of both fighters Rodriguez is the more relentless he is offensive guy who always goes for a knockout, while Edwards is a counter punching guy who loves to do showboating, but I don't think he can showboat against a fighter like Rodriguez.Rodriguez will be the heavy favorite here because of his power, Edwards only chance is through a decision and I doubt he can pile up points against a fighter like Rodriguez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 11, 2023, 11:22:53 PM",
      "body": "It's only four days to go before this fight, so I'm bumping this thread, what makes this fight exciting and worthy to watch?There are two belts on the line here :The IBO and the WBO World Flyweight ChampionshipBoth fighters are undefeated and we all know when two undefeated fighters collide in the ring, there is a lot of action because there's so much at stake.Watch their Face Off: Jesse Bam Rodriguez Vs Sunny Edwards (Full Feature)To get a glimpse of what's on their mind before the fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "December 12, 2023, 10:11:05 AM",
      "body": "I might go with the underdog this time, with Edwards winning by knockout or decision. Yes, Rodriguez is the favorite in this fight, because he has the knockout power. But I think Edward will use his feet in this fight, more movement and maybe he can dish out some of his power too.And then just to soften up Rodriguez and maybe in the champion rounds he will go for that knockout win or even take the championship rounds from Rodriguez.So let's see how it goes, another good weekend fight to watch for boxing fans. Definitely it's for a unification of 2 belts so this fighter will go all in in this fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 12, 2023, 11:08:53 AM",
      "body": "I'm pumped up for this fight. It's not just a battle for titles but a clash of fighters with distinct styles, the stage will be set for a thrilling encounter and the action in the ring tends to be explosive, and I’m expecting nothing less from this. I'll be checking out the Face Off feature to catch a glimpse of what's going on in their minds leading up to the fight, a battle for legacy not just for the records. I can’t wait for the showdown.I'm leaning towards Rodriguez by knockout. He has the power to hurt Edwards, and I believe he'll eventually land that big shot. However, Edwards's movement will make it a tough fight for Rodriguez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "December 12, 2023, 01:20:25 PM",
      "body": "This fight is not getting the attention it rightly deserves both fighters are champions both are undefeated and both have their style of fighting its worth watching this fight maybe because the division used to lord it over by Inoue, some of the fighters like Edwards and Rodriguez are shut out and this is their time to shine.The flyweight division is not a very interesting division for many boxing fans if not for Inoue, it would not get a lot of attention, but still when two undefeated fighters with good boxing skills it deserves our support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 12, 2023, 02:56:21 PM",
      "body": "Quote from: coin-investor on December 12, 2023, 01:20:25 PMThis fight is not getting the attention it rightly deserves both fighters are champions both are undefeated and both have their style of fighting its worth watching this fight maybe because the division used to lord it over by Inoue, some of the fighters like Edwards and Rodriguez are shut out and this is their time to shine.The flyweight division is not a very interesting division for many boxing fans if not for Inoue, it would not get a lot of attention, but still when two undefeated fighters with good boxing skills it deserves our support.Not hyped by the media and it's also on DAZN. If it were ESPN, it would be talked about a lot. It was announced months ago, people forget it when they have to wait that long.It's true these are 2 great boxers, I can see this is not a one-sided fight but I would expect Bam to KOed Sunny in the later rounds. He will dominate in the later rounds and he is even the significant betting favorite.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "December 13, 2023, 12:07:26 PM",
      "body": "Quote from: cabron on December 12, 2023, 02:56:21 PMQuote from: coin-investor on December 12, 2023, 01:20:25 PMThis fight is not getting the attention it rightly deserves both fighters are champions both are undefeated and both have their style of fighting its worth watching this fight maybe because the division used to lord it over by Inoue, some of the fighters like Edwards and Rodriguez are shut out and this is their time to shine.The flyweight division is not a very interesting division for many boxing fans if not for Inoue, it would not get a lot of attention, but still when two undefeated fighters with good boxing skills it deserves our support.Not hyped by the media and it's also on DAZN. If it were ESPN, it would be talked about a lot. It was announced months ago, people forget it when they have to wait that long.It's true these are 2 great boxers, I can see this is not a one-sided fight but I would expect Bam to KOed Sunny in the later rounds. He will dominate in the later rounds and he is even the significant betting favorite. Or it is just this two doesn't have the name right now that's why it wasn't been promoted as it should be. Or there are fights like the Haney vs Prograis and then Ryan Garcia vs Oscar Duarte who is more hype and well known scheduled fight.But in any case this is still a very good fight. As others have said, both undefeated and they want to continue and maintain that unblemished records. Rodriguez though is the clear favorite so I think I will go with Rodriguez here and I do agree that he can score a knockout victory and unify the two belts this weekend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "December 14, 2023, 06:57:51 AM",
      "body": "Quote from: cabron on December 12, 2023, 02:56:21 PMNot hyped by the media and it's also on DAZN. If it were ESPN, it would be talked about a lot. It was announced months ago, people forget it when they have to wait that long.It's true these are 2 great boxers, I can see this is not a one-sided fight but I would expect Bam to KOed Sunny in the later rounds. He will dominate in the later rounds and he is even the significant betting favorite. Normally there's no much much hype in the lower division. I think only Inoue is currently pass the hype level because he is moving up and he's winning his fights impressively.As for this fight, since I'm not too familiar but it's approaching so I could not resist but put a bet. I'm just gonna choose what majority of us here chose, and that is betting on Rodriguez over Edwards. The good thing with this match is both of them are undefeated, so I'm expecting it to be an entertaining fight. In terms of KO rate, Rodriguez has a high KO rate compared to Edwards. (check out boxrec of these 2).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "December 14, 2023, 08:27:54 AM",
      "body": "Another good scrap happening this weekend. Not that popular but on paper this is a better fight since this is an IBF-WBO unification duel which is why hardcore boxing fans should be loving this. Also, both are undefeated and it is good that they are willing to unify the belts. Edwards wanted to unify his IBF belt for years now and finally, he got it. Bam just won his second division belt and he is a 2 division champion.It's good that the fight happens in the state of Arizona so it'll be a neutral ground for both of them. Although Bam an American with Mexican roots will have the audience's support. I'd only seen Bam twice at 115 when he upset Carlos Cuadras and then stopped Srisaket Sor Rungvisai. Those are pretty big names compared to Edwards' resume so I guess Bam should be able to handle this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "December 14, 2023, 10:34:50 AM",
      "body": "Quote from: inthelongrun on December 14, 2023, 08:27:54 AMAnother good scrap happening this weekend. Not that popular but on paper this is a better fight since this is an IBF-WBO unification duel which is why hardcore boxing fans should be loving this. Also, both are undefeated and it is good that they are willing to unify the belts. Edwards wanted to unify his IBF belt for years now and finally, he got it. Bam just won his second division belt and he is a 2 division champion.It's good that the fight happens in the state of Arizona so it'll be a neutral ground for both of them. Although Bam an American with Mexican roots will have the audience's support. I'd only seen Bam twice at 115 when he upset Carlos Cuadras and then stopped Srisaket Sor Rungvisai. Those are pretty big names compared to Edwards' resume so I guess Bam should be able to handle this.Given the two yeah, it was Bam who really become a household name with his Mexican-American roots. And as you have said, those two in his resume is already a good accomplishments for him giving that those are legends in that division already.Edwards though is not that far away, although when I checked his resume, only Moruti Mthalane stood up as one name that is good.But in paper this is really good fight and so let's see if it can live up to the hype for hardcore boxing fans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "December 17, 2023, 07:13:11 AM",
      "body": "I thought that Edwards will somewhat make this fight close, but Rodriguez win a big win here, as he stopped after nine rounds. He scored a devastating knock down on round nine that forces the corner of Edwards to stop the fight. https://www.youtube.com/watch?v=_bHzw65W534&t=199sSo in the post fight interview, he said that he will go to 115 lbs and fight Juan Francisco Estrada. I think that is also a great fight as we all know that Estrada is also a great champion at Super Flyweight/Jr. Bantamweight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "December 17, 2023, 07:41:31 AM",
      "body": "Quote from: Kemarit on December 17, 2023, 07:13:11 AMI thought that Edwards will somewhat make this fight close, but Rodriguez win a big win here, as he stopped after nine rounds. He scored a devastating knock down on round nine that forces the corner of Edwards to stop the fight. https://www.youtube.com/watch?v=_bHzw65W534&t=199sSo in the post fight interview, he said that he will go to 115 lbs and fight Juan Francisco Estrada. I think that is also a great fight as we all know that Estrada is also a great champion at Super Flyweight/Jr. Bantamweight.Edwards was okay with the decision of his corner, he had respect to the decision as he said in his statement that his coach was with him since he's 18 years old, so he believe on the judgement. I didn't see the fight though, but judging on the highlights, I can tell it was a very entertaining fight that both fighters are not showing any dull moment, but you know, fights like this normally wouldn't end up to the judges scorecards, so as predicted, the heavy puncher wins this fight. Congratulations to Rodriguez... and what was the odds for Rodriguez to win by KO by the way?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 17, 2023, 09:37:59 AM",
      "body": "I'm on travel so I failed to give a timely update on the fight, but the fight turned out to be what we all expected it to be, a real slugfest between two undefeated champions.But Bam Rodriguez proved to be a more resilient and more tenacious fighter than the two, the end came in the 9th round when Rodriguez knocked down Edwards for the first time in his career seconds before the end of the round, Edwards did beat the count but the corner did not allow him to continue into the 10th round.Rodriguez Vs Edwards  round 9Jesse Rodriguez knocks out Sunny Edwards in 10 rounds and is now unified champion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distinctin",
      "created_time": "December 17, 2023, 11:42:18 AM",
      "body": "Quote from: robelneo on December 17, 2023, 09:37:59 AMI'm on travel so I failed to give a timely update on the fight, but the fight turned out to be what we all expected it to be, a real slugfest between two undefeated champions.But Bam Rodriguez proved to be a more resilient and more tenacious fighter than the two, the end came in the 9th round when Rodriguez knocked down Edwards for the first time in his career seconds before the end of the round, Edwards did beat the count but the corner did not allow him to continue into the 10th round.Rodriguez Vs Edwards  round 9Jesse Rodriguez knocks out Sunny Edwards in 10 rounds and is now unified championEdwards made a wrong decision to go toe to toe against a boxer who is a power puncher than him. I think he should have made an in game adjustment, like doing some reality check about his KO percentage. However, I'm still impress with his performance, I can see some durability in him because he lasted 9 rounds and it wasn't him who gave up, his corner did. Overall, I can say it's one of the most entertaining fights I've seen this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "December 17, 2023, 03:45:54 PM",
      "body": "Most of the time, during boxing matches, people only focus on observing the fighters and completely ignore the great work that the coaches have done during the fights. In this fight, Rodriguez's trainer noticed that Edwards' face was already injured. , that's why Rodriguez's trainer encouraged him to land more punches on Edwards' face, which in my opinion in round 9 was already completely broken, I don't even know how they allowed him to enter the ring in round 9, those cuts the guy had on his face were very big and I don't know if I heard but, but the fight commentator kept saying that at that rate the referee would eventually declare that Edwards had to stop fighting due to his facial injuries, but that wasn't even necessary because Edwards he got tired and lost his balance and lost the fight.Congratulations to Rodriguez for the victory, the guy fought well, he didn't leave with a badly injured face, on the contrary he was fine, it was a convincing victory, he knew how to manage the fight well, he didn't make many tiring movements, while his opponent was constantly doing a lot of tiring movements and my face was completely exposed and I was hit with a lot of strong punches. I also noticed that Rodriguez's punches were heavier than Edwards' punches. Edwards needs to put more power into his punches in my opinion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 17, 2023, 05:00:52 PM",
      "body": "Quote from: Slow death on December 17, 2023, 03:45:54 PMMost of the time, during boxing matches, people only focus on observing the fighters and completely ignore the great work that the coaches have done during the fights. In this fight, Rodriguez's trainer noticed that Edwards' face was already injured. , that's why Rodriguez's trainer encouraged him to land more punches on Edwards' face, which in my opinion in round 9 was already completely broken, I don't even know how they allowed him to enter the ring in round 9, those cuts the guy had on his face were very big and I don't know if I heard but, but the fight commentator kept saying that at that rate the referee would eventually declare that Edwards had to stop fighting due to his facial injuries, but that wasn't even necessary because Edwards he got tired and lost his balance and lost the fight.Congratulations to Rodriguez for the victory, the guy fought well, he didn't leave with a badly injured face, on the contrary he was fine, it was a convincing victory, he knew how to manage the fight well, he didn't make many tiring movements, while his opponent was constantly doing a lot of tiring movements and my face was completely exposed and I was hit with a lot of strong punches. I also noticed that Rodriguez's punches were heavier than Edwards' punches. Edwards needs to put more power into his punches in my opinionEdwards was slick in the earlier rounds but Bam could take his punches also so there is a good exchange until round 9. It was expected that the KO would be in the later rounds. I pictured a satisfying KO because, in later rounds, they'd gas out but it's not.  By their looks of it, It's obvious that Bam hurt Edwards the most in the fight. It is a convincing win. I think this is the end of Bam in the flyweight. He unified and had to move to 115.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}