{
  "id": "topic_5448527",
  "title": "I Need Membership",
  "author": "I Need Membership",
  "created_time": "April 12, 2023, 11:02:13 AM",
  "content": "Hello Everyone, I need a Bitcointalk rank account (up to full member) urgently. Who can help me to buy? Also looking for a trusted escrow person. I will pay him for escrow taking..Please Knock me to my Telegram accounts https://t.me/devi440",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448527",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "April 12, 2023, 11:03:58 AM",
      "body": "Quote from: I Need Membership on April 12, 2023, 11:02:13 AMHello Everyone, I need a Bitcointalk rank account (up to full member) urgently. Who can help me to buy? Also looking for a trusted escrow person. I will pay him for escrow taking..Please Knock me to my Telegram accounts https://t.me/devi440Buying of account is highly prohibited. No one will also act as an escrow for such trade. Be careful so that you don't get scammed. Any purchased account is also likely to get knocked down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I Need Membership",
      "created_time": "April 12, 2023, 11:10:01 AM",
      "body": "Quote from: Nwada001 on April 12, 2023, 11:03:58 AMQuote from: I Need Membership on April 12, 2023, 11:02:13 AMHello Everyone, I need a Bitcointalk rank account (up to full member) urgently. Who can help me to buy? Also looking for a trusted escrow person. I will pay him for escrow taking..Please Knock me to my Telegram accounts https://t.me/devi440QuoteBuying of account is highly prohibited I know its But i need once very urgently. QuoteNo one will also act as an escrow for such trade. Be careful so that you don't get scammed. How to Make escrow can you help me to Think about?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 12, 2023, 11:14:27 AM",
      "body": "Why do you need to purchase an account when you can do anything you want to do with this newbie account? If you also want to advertise any products here, you can just purchase a copper member from the forum. I will highly advise you not to think of account buying; it's of no use and just like buying someone else's identity, which you can't maintain. The trade will not happen, so there is no need for escrow service. Any one who contacts you via telegram might likely be a scammer who wants to scam you and promise you an account you might never get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "April 12, 2023, 11:19:21 AM",
      "body": "@I Need Membership, If I may ask what do you want to do with the account?? Maybe you might have been given a wrong information regarding how this forum work's, they don't buy Rank here, you earn those Rank the only custom rank purchase able is Copper member rank which you can get https://bitcointalk.org/index.php?topic=2385104.msg24371150#msg24371150",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 12, 2023, 11:58:44 AM",
      "body": "Question to answer, Why do you want to buy a bitcointalk account and what are you aim of buying account without you just signing up with your products name and brand to continue your business here. Anyway the forum is against buying of account just as few people have suggest before you can easily buy a copper member to display the images of your products and brands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "April 12, 2023, 12:18:23 PM",
      "body": "Quote from: I Need Membership on April 12, 2023, 11:10:01 AMHow to Make escrow can you help me to Think about?Buying/selling forum accounts is not prohibited, but it is certainly not what we want to see here. As the red tag is always included in the case of account trading, it is very difficult to find a reliable escrow service for such a thing. Hardly anyone wants to compromise their reputation for something like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "April 12, 2023, 12:34:22 PM",
      "body": "Quote from: I Need Membership on April 12, 2023, 11:02:13 AMHello Everyone, I need a Bitcointalk rank account (up to full member) urgently. Who can help me to buy? Also looking for a trusted escrow person. I will pay him for escrow taking..Please Knock me to my Telegram accounts https://t.me/devi440Before you should consider buying a Bitcointalk ranked account, it would be better for you to read this: Sales of bitcointalk account must be discouragedOr let me make it easy for you, read this:Quote from: Oshosondy on January 20, 2021, 03:05:19 PM1. Not supported by bitcointalk adminThere has been thread before about bitcointalk forum to be selling ranked accounts in the past, but according to theymos it will not happen.https://bitcointalk.org/index.php?topic=4419950.msg39398356#msg39398356Bitcointalk is not in support of account sales, then why want to buy one underground because people that boldly want to sell account here if noticed will be tagged red which to me if proper. 2. Hacked accounts can be soldThere are in history of this forum some members account are hacked and taken control over by the hackers, the hackers will not think twice in many cases to sell the account as be sold. The person that bought the account will happily make his first post while the account owner will report that his account has been compromised. If he signed staked address he will be given back the account thereby leading to the buyers to lost money. 3. Other fraudulent activitiesThe above is just a single fraud reason while there are still many other fraudulent reason s account can be bought, it can be bought by scammers to make people to trust the account and be used against good members on the forum. This type of scam can range from using the account to borrow bitcoin, do escrow service and take the bitcoin and exit to anything you can possibly think of scammers can achieved through that. This is the main reason I even hate sales of account. And the reason I proposed official seeling of account by admin which can possibly lead people selling account underground not to be able to again. https://bitcointalk.org/index.php?topic=5310026.0But this led to downturn because of some good reasons provided by some good members. 4. New members not knowing about the forum at allNewbies do not know about the forum at all, all they know if what they read online that bitcointalk signature can be used to earn up to 0.0003 btc per post like I read it online in 2020. From the same site you I read that a member can have up to 10 accounts, that you can buy account at a cost of $500 for legendary, $400 for hero and $300 for Sr member, though I do not fully remember the amount but appropriately correct. All these are lies, the merit system do not make it easy to have two accounts because building two accounts is difficult.5. Bought accounts can be banned and most likely will be bannedI was wondering before why legendary account and hero accounts are banned, later I noticed some can be bought accounts, newbies do not know about the forum, bought ranked membership account and was banned because he violate the forum rules which likely to occur to newbies, this is likely common the reason you should pass through the newbie period by opening newbie account for good. 6. Thinking they will buy account and join signature campaign quicklyNewbies know nothing about this forum, all they think is that they will buy account and join signature campaign immediately, not knowing all signature campaigns have one same rule, that a member to participate he must have at least 5 merits received in the last 120 days, but to get the merit will be difficult for newbies that bought account. Also that is just the rule, you will see campaign managers only taking people that have more than 50 to 100 merits while leaving the rest because slot are very limited, then when will you get up to that merits. Psychologically thinking, account sellers even leave no smerits at all and the account do not have single merit in the last 120 days. If you like you can buy Bitcointalk account, but it is better to build your account yourself. In the process of building your account, you are truly becoming higher rank member unlike if you buy an account. I hope you will read that quote or click on the link to go to the main thread and see the topic in full. If you read it and understand it, you will see the danger in buying ranked account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "April 12, 2023, 12:44:26 PMLast edit: April 12, 2023, 01:14:32 PM by Dzwaafu11",
      "body": "Quote from: I Need Membership on April 12, 2023, 11:02:13 AMHello Everyone, I need a Bitcointalk rank account (up to full member) urgently. Who can help me to buy? Also looking for a trusted escrow person. I will pay him for escrow taking..Please Knock me to my Telegram accounts https://t.me/devi440I'm not sure if you've read all the forum rules and guidelines, but if not, you won't take the prohibition against buying a forum account seriously.I wish you would develop your account independently so you could have the necessary understanding of the forum's operation and other things. How can you bother reading everything you need to know now that you require a high rank account?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 12, 2023, 01:00:57 PM",
      "body": "I am surprised that others do not know the reason for purchasing an account, most likely joining signature campaigns, as many campaigns are now accepting Full-Memeber rank, with about 120 posts (at least) and about 4 months of activity, that period is not enough to track the writing style  and therefore It's easy to buy an account without being noticed.The solution to this problem is that Sr. Member rank is the lowest rank to join signature campaigns, it will be very difficult for scammers/account sellers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 12, 2023, 01:16:57 PM",
      "body": "Quote from: hugeblack on April 12, 2023, 01:00:57 PMI am surprised that others do not know the reason for purchasing an account, most likely joining signature campaigns, as many campaigns are now accepting Full-Memeber rank, with about 120 posts (at least) and about 4 months of activity, that period is not enough to track the writing style  and therefore It's easy to buy an account without being noticed.It doesn't have to be that especially.He might now know that he only needs copper membership to raise the limits and post an image, he might try some different thing, like a loan, he might just want some shilling for some project, and so on. The fact that he needs it \"urgently\" does not really match only with signature campaigns. Interestingly he didn't mention the red tags criteria.Quote from: Nwada001 on April 12, 2023, 11:03:58 AMBuying of account is highly prohibited. Quote from: Dzwaafu11 on April 12, 2023, 12:44:26 PMI'm not sure if you've read all the forum rules and guidelines, but if not, you won't take the prohibition against buying a forum account seriously.There is no prohibition, anyone can sell and buy as they wish, but they must face the consequences if discovered which will make the account worthless for signature earnings if that is the purpose!But if you're here to advertise our scammy service like 1xbit, that will not stop you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 12, 2023, 07:38:01 PM",
      "body": "Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.  OP, I don't know the purpose for which you are buying the account, but according to rule 18 of the Bitcointalk forum, selling of accounts is discouraged.Quote from: Nwada001 on April 12, 2023, 11:03:58 AMBuying of account is highly prohibited. It's not prohibited but rather discourage, that means people still buy account but the act is not a very smart one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "April 12, 2023, 08:01:29 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on April 12, 2023, 07:38:01 PMQuote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.  OP, I don't know the purpose for which you are buying the account, but according to rule 18 of the Bitcointalk forum, selling of accounts is discouraged.Quote from: Nwada001 on April 12, 2023, 11:03:58 AMBuying of account is highly prohibited. It's not prohibited but rather discourage, that means people still buy account but the act is not a very smart one.not only this. Old members remember a period in the history of the Forum when the trading of accounts flourished, immediately after the hacking incident in 2015. In the same year, a site was launched (no longer working) with algorithms capable of analyzing any bitcoinTalk account according to its membership and the history of its publications to determine a price for it. Something like the Bitcointalk account price estimator that traders have taken advantage of.The forum does not prevent trading accounts because it cannot stop them. I know a forum (I won't mention its name so that no one will think of using it) that has a whole section dedicated to offers to sell bitcointalk accounts. Unfortunately, this will not stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 12, 2023, 08:27:26 PM",
      "body": "Quote from: coupable on April 12, 2023, 08:01:29 PM Old members remember a period in the history of the Forum when the trading of accounts flourished, immediately after the hacking incident in 2015.Wow, I don't know about these; is there any thread for them?QuoteUnfortunately, this will not stop.Unfortunately, this will not stop, and also unfortunately, people who buy accounts will end up receiving a red tag like I have seen on some profiles (account changed hands; don't trust these users). When this tag is placed on a bought bitcointalk account, I don't think there could be any good use of that account because trust is something that I understand the forum takes very seriously.QuoteThe forum does not prevent trading accounts because it cannot stop them.The forum cannot stop these acts, but the DT members can make those accounts useless if they find out about any one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "April 12, 2023, 09:54:35 PM",
      "body": "Quote from: I Need Membership on April 12, 2023, 11:02:13 AMAlso looking for a trusted escrow person. I will pay him for escrow taking..There are several trusted escrow providers but it is a matter of sorrow for you that there is no one who will act as an escrow for this type of activity (trading account). And you have no benefit by buying an account as you will be detected as a account trader and your account will be tagged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}