{
  "id": "topic_5404222",
  "title": "348Judah",
  "author": "348Judah",
  "created_time": "June 27, 2022, 10:39:39 AM",
  "content": "Bitcoin Mining Using SHA 256 Originate from NSAIn the year 2001 SHA 256 otherwise known as Secure Hash Algorithm 2 was said to be developed by the National Security Agency (NSA) and is believed to be used as one of the means to verifying bitcoin  transactions on the blockchain technology, i consider this when i discovered many challenges on bitcoin regulation and mining oppositions coming from the US these days, i asked myself why has the government developed such negative mindset approach on bitcoin adoption and it corresponding mining.This gives more reasons to ask why is the government still in doubt of bitcoin adoption knowing fully the origin and technology of blockchain it operate on, are they doing this because of the decentralization of bitcoin or is it because of Satoshi Nakamoto anonymity and tremendous success on bitcoin creation.I seem not to understand something clear, if SHA 256 was founded in 2001 right before the launch of bitcoin in 2009, what is the major intent of NSA when they created it before it application on bitcoin network? Is there any other applicable use of SHA 256 aside the verification of bitcoin transaction on the blockchain network?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404222",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "June 27, 2022, 10:55:18 AM",
      "body": "Quote from: 348Judah on June 27, 2022, 10:39:39 AMIs there any other applicable use of SHA 256 aside the verification of bitcoin transaction on the blockchain network?I would not be surprised if your passwords on various websites you use are not stored there either as MD5, either as SHA256/SHA512.However, another (main) use of various flavors of SHA is to create/save CRC-like information for files/data.Also I will add that the various SHA are also used for SSL (let's say for the HTTPS you see on all websites nowadays).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 27, 2022, 02:39:41 PM",
      "body": "A lot of RFID communications are also SHA 256 on the powered side. I don't know if it's a standard or just what the systems I have seen use.Also it's the standard of a lot of VoIP things, although that might just be coming from the SSL side in general.And so on.It's a popular standard, I would not read much into it being used for BTC.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "June 27, 2022, 04:30:56 PM",
      "body": "This is like saying \"Bitcoin runs on computers. Do computers have any other purpose besides Bitcoin?\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "June 28, 2022, 12:00:39 AM",
      "body": "Quote from: ymgve2 on June 27, 2022, 04:30:56 PMThis is like saying \"Bitcoin runs on computers. Do computers have any other purpose besides Bitcoin?\"Thanks, this made me chuckle; but it's totally correct.. The OP also honestly sounds a bit like a shitpost, but if 348Judah actually doesn't know yet, there's this great, free online resource that would have answered his question immediately. It's not very well-known, but it is commonly referred to as 'The Wikipedia'.Here's a super secret link that brings you directly to their article about SHA256:>> https://en.wikipedia.org/wiki/Sha256 <<Quote from: https://en.wikipedia.org/wiki/Sha256#ApplicationsThe SHA-2 hash function is implemented in some widely used security applications and protocols, including TLS and SSL, PGP, SSH, S/MIME, and IPsec. [...]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "garlonicon",
      "created_time": "June 28, 2022, 03:21:38 PM",
      "body": "QuoteQuoteI seem not to understand something clear, if SHA 256 was founded in 2001 right before the launch of bitcoin in 2009, what is the major intent of NSA when they created it before it application on bitcoin network?Are you trying to imply that Satoshi work at NSA and Bitcoin was NSA program?Of course, Satoshi was a well-known NSA employee, he created SHA-256 in 2001 just for Bitcoin, that was the only reason, it has no other use. And he waited from 2001 to 2009 to release it. He waited almost 8 years, just to create a Proof of Patience, he had no other function he could build Bitcoin on, SHA-1 was not an option (and that's why he included it in the Script, just to show everyone that it should not be used).Of course I know that, because I am also a well-known NSA employee. Take my avatar for example, it has Ghidra logo. Another NSA project! It is so evil that they released it as Open Source. Its main use case is disassembly and decompilation, they are so evil, that they made it easier than using a bunch of other tools like objdump, and made a convenient GUI to drive programmers away from using console, that was their plan from the very beginning.Also note that the first Bitcoin version was only for Windows. That means Satoshi also worked for Microsoft, there is no other option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 28, 2022, 04:31:02 PM",
      "body": "I could go into a huge counter-argument about how SHAs 2 and 3 were made by independent cryptographers and made into standards by NIST, but the entire debate is made irrelevant by observing that blocks are hashed twice before finalization (hence why the mining algo is called SHA256d - the 'd' stands for double)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "June 29, 2022, 12:09:29 AM",
      "body": "Quote from: garlonicon on June 28, 2022, 03:21:38 PMQuoteQuoteI seem not to understand something clear, if SHA 256 was founded in 2001 right before the launch of bitcoin in 2009, what is the major intent of NSA when they created it before it application on bitcoin network?Are you trying to imply that Satoshi work at NSA and Bitcoin was NSA program?Of course, Satoshi was a well-known NSA employee, he created SHA-256 in 2001 just for Bitcoin, that was the only reason, it has no other use. And he waited from 2001 to 2009 to release it. He waited almost 8 years, just to create a Proof of Patience, he had no other function he could build Bitcoin on, SHA-1 was not an option (and that's why he included it in the Script, just to show everyone that it should not be used).Keep in mind he also created secp256k1 at NSA, to make Bitcoin insecure from the very start, too.That's why we're here 13 years later still using it..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 29, 2022, 01:35:01 PM",
      "body": "Quote from: ETFbitcoin on June 28, 2022, 12:00:57 PMAre you trying to imply that Satoshi work at NSA and Bitcoin was NSA program?Yes and i just got the direct explanation from the user below.Quote from: garlonicon on June 28, 2022, 03:21:38 PMOf course, Satoshi was a well-known NSA employee, he created SHA-256 in 2001 just for Bitcoin, that was the only reason, it has no other use. And he waited from 2001 to 2009 to release it. He waited almost 8 years, just to create a Proof of Patience, he had no other function he could build Bitcoin on, SHA-1 was not an option (and that's why he included it in the Script, just to show everyone that it should not be used).Of course I know that, because I am also a well-known NSA employee. Take my avatar for example, it has Ghidra logo. Another NSA project! It is so evil that they released it as Open Source. Its main use case is disassembly and decompilation, they are so evil, that they made it easier than using a bunch of other tools like objdump, and made a convenient GUI to drive programmers away from using console, that was their plan from the very beginning.Also note that the first Bitcoin version was only for Windows. That means Satoshi also worked for Microsoft, there is no other optionthank you all for the information and enlightenment,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 29, 2022, 01:51:05 PM",
      "body": "Quote from: 348Judah on June 29, 2022, 01:35:01 PMQuote from: ETFbitcoin on June 28, 2022, 12:00:57 PMAre you trying to imply that Satoshi work at NSA and Bitcoin was NSA program?Yes and i just got the direct explanation from the user below.Quote from: garlonicon on June 28, 2022, 03:21:38 PM~I'm not sure if you got the hint but everything that you just quoted in this post was satire, not intended to be correct information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "garlonicon",
      "created_time": "June 29, 2022, 04:47:10 PMLast edit: June 29, 2022, 05:07:41 PM by garlonicon",
      "body": "QuoteI'm not sure if you got the hint but everything that you just quoted in this post was satire, not intended to be correct information.Well, there are two kind of people: those who understand that this topic is hilarious, and cannot be taken seriously, and those who don't, and can't be convinced they are wrong, no matter what you say. So, joking is the only option to give any answer fitting both groups at once, because those who really believe in such nonsense are beyond saving.Edit: Don't forget about clearing cookies, if there are too many of them, they can significantly increase your transaction fees: https://www.youtube.com/watch?v=TzoW_GO45vk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 29, 2022, 05:17:35 PM",
      "body": "Quote from: 348Judah on June 27, 2022, 10:39:39 AMand is believed to be used as one of the means to verifying bitcoin  transactions on the blockchain technology\"is believed\"? There's no belief or faith in this place, buddy. Transparency means that it is possible to verify everything yourself.Quote from: garlonicon on June 28, 2022, 03:21:38 PMOf course, Satoshi was a well-known NSA employee, he created SHA-256 in 2001 just for Bitcoin, that was the only reason, it has no other use.This is probably one of the most humorous posts I've ever read in this place. Quote from: 348Judah on June 29, 2022, 01:35:01 PMthank you all for the information and enlightenmentDude, he was joking! No NSA employee has the guts and courage to move onto Microsoft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "June 29, 2022, 08:51:29 PM",
      "body": "Quote from: 348Judah on June 27, 2022, 10:39:39 AMand is believed to be used as one of the means to verifying bitcoin  transactions on the blockchain technologyIf you're interested to know how Bitcoin transactions are verified, check the source code. No need to believe (or not to believe) in anything here.Quote from: https://github.com/bitcoin/bitcoin/blob/e4e201dfd9a9dbd8e22cac688dbbde16234cd937/src/consensus/tx_check.cppCode:#include <consensus/tx_check.h>#include <consensus/amount.h>#include <primitives/transaction.h>#include <consensus/validation.h>bool CheckTransaction(const CTransaction& tx, TxValidationState& state){ ...}As you can also easily see on the Bitcoin Wiki, SHA256 is actually more important for proof of work and creation of Bitcoin addresses, rather than for 'verifying Bitcoin transactions'.Quote from: https://en.bitcoin.it/wiki/SHA256SHA-256 is used in several different parts of the Bitcoin network: Mining uses SHA-256 as the Proof of work algorithm. SHA-256 is used in the creation of bitcoin addresses to improve security and privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}