{
  "id": "topic_5411169",
  "title": "Detritus",
  "author": "Detritus",
  "created_time": "August 25, 2022, 02:13:39 PM",
  "content": "Bitcoin mining has to do with some technical connection, Nodes, electricity, computer and some other software and hardware. Bitcoin is a store of value.Among all the minerals mined on Earth, Gold has the most useful. Bitcoin is also the most useful in the crypto space. Similarities between Gold and Bitcoin  1: they can both be invested on 2: they can both be mined with some sophisticated equipment 3: they can both be used for payment those are the three I can think of for now.according to my finding, computer electronics and some other sophisticated electronics/device has little pellets of gold in their chips/panel connection because it's the only metal that could conduct effectively without rusting/tarnishing as other metals does. Apart from gold mining/discovery, I have come to realize that Gold can be extracted from some sophisticated electronics like computers and other devices.I want to embark on the mission of extracting at least 0.25 - 0.5kg of gold from some disposed electronics that are no longer useful (useless). Aim of my mission I want to see if I can be able to extract like 0.25 - 0.5g of gold, then sell it and use the money to Buy Bitcoin.1kg of gold is about $56+Objectives1: assemble at least 300 KG of disposed computers, phones and any other electronic device.2: detached all metals & panels from the disposed electronics3: heat the metals/panels in a furnace at above 1000'C 4: run analysis for trace of gold in the metals.5: identification of gold from the other metals 6: separation of Gold from other metals 7: finally test the purity of my gold achieved if there will be any.Uses of gold in electronics and computers Gold have serve important purpose in some industrial use to manufacture some electronics. Solid state electronic devices use very low voltages and currents which are easily interrupted by corrosion or tarnish at the contact points. Gold is the highly efficient conductor that can carry these tiny currents and remain free of corrosion. Electronic components made with gold are highly reliable. Gold is used in connectors, switch and relay contacts, soldered joints, connecting wires and connection strips.   A small amount of gold is used in almost every sophisticated electronic device. This includes cell phones, calculators, personal digital assistants, global positioning system (GPS) units, and other small electronic devices. Most large electronic appliances such as television sets also contain gold.   Gold is used in many places in the standard desktop or laptop computer. The rapid and accurate transmission of digital information through the computer and from one component to another requires an efficient and reliable conductor. Gold meets these requirements better than any other metal. The importance of high quality and reliable performance justifies the high cost.  (GOLD COMPUTER CONNECTION) gold in computer memory chip. I forgot to mention, As an industrial chemistry, I have been thinking of getting an employment as a graduate have gotten non so I decided to go into business and cryptocurrency. Yet again this forum has given me another side of thinking, i got the idea of this mission on this forum while I was trying to reply to Virtualdn's post about \"Bitcoin scarce than gold\"Any one within my State that is interested can join me on this research mission, I love team work.  I am still looking out for more disposed electronics. currently I have just had  few disposed computer electronics and android phone that is only weighing 8kg.Opinion  I think some one can try this too, and if you archive any gold, you can invest it in Bitcoin. source 1:source 2:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411169",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "August 25, 2022, 02:23:54 PM",
      "body": "How are you going to dispose of the poisonous substances (such as lead and mercury) after heating the metals up? You can't just cool the back down again - in their liquid form it is very dangerous since it might get carried by rainwater to nearby rivers and contaminate water sources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "August 25, 2022, 03:09:45 PM",
      "body": "Quote from: NotATether on August 25, 2022, 02:23:54 PMHow are you going to dispose of the poisonous substances (such as lead and mercury) after heating the metals up? Ways of getting ride is substance is very easy in my county (Nigeria) here, their are abandon areas which are left by government and private investor's which they allow individual to go dispose everything metal and all material which can never decay , they come back over time to visit the area and pick out some of those object and convert it to something useful again just as they do for waste metals. Their are also bodies which move around and buy off such Waste, only them knows what they do with it. Quote from: Detritus on August 25, 2022, 02:13:39 PMI am still looking out for more disposed electronics. You can get those disposal electronics from Kondem and it will be shipped to you in which ever country that you are all you need do is order and give location. Quote from: Detritus on August 25, 2022, 02:13:39 PMAim of my mission I want to see if I can be able to extract like 0.25 - 0.5g of gold, then sell it and use the money to Buy Bitcoin.1kg of gold is about $56+Every determination will definitely lead you to success. If you put all you learnt in chemistry depending on your area of concentration I assure you, you will achieve what you really want with little of of your colleagues too you can also share your idea with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Detritus",
      "created_time": "August 25, 2022, 06:37:02 PM",
      "body": "Quote from: NotATether on August 25, 2022, 02:23:54 PMHow are you going to dispose of the poisonous substances (such as lead and mercury) after heating the metals up? You can't just cool the back down again - in their liquid form it is very dangerous since it might get carried by rainwater to nearby rivers and contaminate water sources.There are some restricted area in my state which is very far from human habitat, most hazardous wast are often disposed off in that place. I can disposed every hazardous waste obtained during the process in that area. I will carry out the work in a well equipped lab, so separation will not be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dlightag",
      "created_time": "August 25, 2022, 06:43:49 PMLast edit: August 25, 2022, 07:43:31 PM by dlightag",
      "body": "What you are really planning on going into extraction of valuables from crabbed electronics is one this that will cost you time and lots of money, what you learnt on your chemistry class alone won't be able to help you out all through the process. Like @Ever-young have stated you will also need to add people to your dreams in other to get experience out their. But come to think off it what quantity of metals, Bord and other electronic material will you actually have to gather and extract before you can achieve something that will worth selling out for good money?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}