{
  "id": "topic_5411432",
  "title": "auroroboros",
  "author": "auroroboros",
  "created_time": "August 27, 2022, 03:28:54 PMLast edit: August 28, 2022, 08:28:36 PM by auroroboros",
  "content": "AUROROBOROS Presents 'Conversations with Orion' - The Genesis Collection. The first of ten NFT Art Collections.Conversations with Orion drops on OpenSea + Polygon on September 1st, 2022!Chapter One of Ten: A generative art Genesis Collection that includes over 600 unique and original pieces in glorious 12K resolution. With themes that encompass a wide variety of topics, Conversations with Orion is an anthology of stories captured within single frames of existence and imagination. Stories that are energized by life and death and everything in between. Drawn from hard experiences and fantastical dreams and inspired by raw emotion. Life is beautiful and the contrasting themes depicted within are what convey the great balance of beauty. It’s what gives meaning to the human experience. I wanted to discuss these things with a machine and together we formed this collection of the things that exist between the lines; the real and the fantasy, the love and the loss, the well-known and the curiosities, the glory and the sadness, the exaltation and the pain, the terrifying and the whimsical, the dreams and the triumphs, and the basic tenets that make us all human. This is only the beginning…The first of 10 planned NFT collections. Buy, collect, print, display, share, trade, sell, invest.I started this project to help artists worldwide and as a way to express myself after a very close call last year. It was difficult, if not impossible, to put into words, so I put my feelings and dreams into this collection, the first of ten planned. I was always interested in art my whole life and now I’m putting my all into it to achieve my dreams. Proceeds will be invested into successive collections/chapters and community building, expanding auroraCollective- which aims to broaden the horizons for other artists globally that are struggling to find their place, and to further develop my abilities to produce quality art. These are the first goals of this Genesis Collection and its successors.AUROROBOROS ROADMAP: https://medium.com/@auroroboros/auroroboros-roadmap-40a45084179c?source=friends_link&sk=eb8d388e9fa7ab2119c98b75c7c861daJoin Us On Discord! https://discord.com/invite/sgPXUAAXgbWebsite: https://auroroboros.comTwitter: https://twitter.com/auroroborosVFXInstagram: https://instagram.com/auroroborosvfxMedium: https://medium.com/@auroroborosMarketplace: https://opensea.io/collection/cwoLinktree: https://linktr.ee/auroroboros DROPS ON SEPTEMBER 1, 2022!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411432",
  "comments": []
}