{
  "id": "topic_5452872",
  "title": "tread93",
  "author": "tread93",
  "created_time": "May 16, 2023, 03:08:11 AM",
  "content": "So they have been doing this for the past 3 years and i'm looking on the BTC Mag website for the Miami conference this year and I am sad to not see any mention of BitPay on the vendor list this year. Which would lead me to believe that they are not going to have a collab with APMEX this year and passing out free 1 ounce silver rounds this year....Could this be true? If so, this is completely tragic and I am now very bummed as I was looking forward to continuing my BitPay/APMEX BTC Miami Rounds collection. Say it aint soo!!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452872",
  "comments": [
    {
      "author": "MoparMiningLLC",
      "created_time": "May 16, 2023, 03:14:28 AM",
      "body": "bitpay is a shit company. I do have the round from last year but that's just the collector in me wanting one of everything. Personally, I hope the company goes under.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "May 16, 2023, 03:17:39 AM",
      "body": "Can one of you fine fellers possibly post said rounds..I’m not sure I know what you guys are speaking of 🤔",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "May 16, 2023, 04:35:11 AM",
      "body": "i think he means the bitpay coin that came out about that time - i dont think it was conference specific  thoughI was thinking he meant this one. tread correct me if wrong",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "May 18, 2023, 02:27:16 AM",
      "body": "Quote from: MoparMiningLLC on May 16, 2023, 04:35:11 AMi think he means the bitpay coin that came out about that time - i dont think it was conference specific  thoughI was thinking he meant this one. tread correct me if wrongYeah that's the one, I am laughing rn at miners comment lmao 🤣  I would have to say I can't disagree with his conclusions haha but honestly I did like their silver rounds haha I also got some sweet vans from them for free last year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "May 18, 2023, 03:02:31 AM",
      "body": "Right now bitpay is fucking up a huge txn for me crying i underpaid when i paid (in btc) what the invoice said to pay (in bitcoin) txn took 8 hours to confirm - they now claim I underpaid by $4ish and want to charge me 207.5k sats to do a refund so I can pay the invoice again…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "May 19, 2023, 02:34:46 AM",
      "body": "I can't remember if I knew that they were the company that partnered with Apmex to make these rounds or not, but I sure don't remember that these were a Miami conf release, is that definitely the case? And didn't you say there was a round for each year, so what was the other round? BitPay may be shit, I sure as hell wouldn't be surprised being that most exchanges are, but they are an early goer and as I'm sure you know Mopar they were the ones who sponsored the St Pete bowl, which I will always appreciate the work they put in on that and other early day endeavors/advertising for btc.  Tread you find us any treasures at the conf?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptogreatdane",
      "created_time": "May 19, 2023, 03:07:50 AM",
      "body": "They broke the 3 rules of successful coin making. No year, no mintage cap, not numbered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}