{
  "id": "topic_5440482",
  "title": "Remiscoin5",
  "author": "Remiscoin5",
  "created_time": "February 19, 2023, 09:23:50 PM",
  "content": "We all want a good relationship with our spouses or soulmates too .So what are the risks we should take 1 _when a marriage is about falling ,think about the kids and how divorce will make things wrong and difficult for them I have grown up as a young girl and has never leaved with both parents till last year when I started living with my dad ,don't you think I might have gone through alot ?? Without both parents by my side ,If you wanna give your kids the best in life you have to endure certain attitude Ms from both ur wife/husband ,when a home is seperated only one parent can't be able to take care of all the kids even if there is supplus money and second wife or husband ,when a single mother is set to take care of all the kids because she cought her husband cheating or what have you , she leaves ,she can't be fanacially stable to take care of all ,what if na 25 kids what's gonna happen?? The kids will start sleeping outside to care for them own selves ,how can a mother of 25 take such abilities all to her self More to talk about ,let's talk",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440482",
  "comments": [
    {
      "author": "bbigtart",
      "created_time": "February 19, 2023, 09:38:34 PM",
      "body": "My mother's father divorced when I was a toddler, in mother's arms.And I was raised by step grandparents.My memory is still sharp enough to remember that sad time.Mother's father already has another partner as well as another child..My life is tossing and turning without directionJealous of my friends and the happiness of a small child, invites the sadness back..Father and mother, I just need your love, like my friend.So far, I've never gotten it.Now my father is gone forever, look at your son, father, now I am an adult and can find food for myself without your love.Without you I can be independent, now my father has gone forever back to God's side.But hatred for you makes me furious and I want to destroy everything around me.And now, from the experience above, I always try to avoid divorce because it will affect the child's mentality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "February 20, 2023, 05:38:10 AM",
      "body": "Marriage is something you need to know before you get to it and you need to understand that your life will never be the same when you will marry the girl you love because when that happens, you gonna do everything to make her happy and comfortable. You just need to consider looking for the right spouse before thinking about marriage and you need to learn what are the criteria to become the right wife for your children. Because if you marry randomly without taking any considerations to do the tips above, then you are risking your marriage and your children's future because you might marry the wrong Man or Woman who will not care about you or your children or maybe they are abusive and you only found that out when you already married.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "February 20, 2023, 07:43:58 PM",
      "body": "Quote from: yazher on February 20, 2023, 05:38:10 AMMarriage is something you need to know before you get to it and you need to understand that your life will never be the same when you will marry the girl you love because when that happens, you gonna do everything to make her happy and comfortable.The risk in marriage is getting married to the wrong person, most people nowadays get married for the wrong purpose not love, is either because of money, beauty and so on. Which it will come to a time when those things might not be what you need anymore. Marriage is a beautiful thing, one just have to choose his or her partner wisely, because marriage comes with a lot of responsibilities, one just have to be prepared all round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "February 20, 2023, 07:57:46 PM",
      "body": "Parents should indeed consider their children before they start nursing the idea of divorcing because it would have some negative effects on their children. But some marriages are so toxic and abusive that it would be better that both parties go their separate ways. I don't think a woman should remain in a home where she is beaten and molested. Another problem in society now is the high rate of infidelity. Most men and women are not committed emotionally to their partners. They find satisfaction in having erotic relationships outside the marriage. Most people might not be able to cope with this abnormal behavior. Some might be scared because their partner can infect them with STDs due to their promiscuity. Yes, it is not too good to divorce at least for the sake of the children, but you won't die because you want to keep a marriage that is killing you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "February 20, 2023, 08:12:27 PM",
      "body": "Marriage is a mystery,let's imagine two imperfect people came together to live as one. If there is no tolerance and sacrifice in marriage, even if you get married to the right person,the marriage might still crash when nobody wants to sacrifice for love. In my country there is a say that 'marriage is a school that you can't graduate from'.Most marriages lack love and understanding, initially when the both parents come together,they think of sex and after that, pregnancy comes in. After giving birth to a child,the couples might begin to show their ugly character that might be unbearable by each other and before you know it,divorce is the case. It baffles me that these couples has forgotten that there is a child involved, which they don't care about that and put their own selfish desires from first. After divorce,the child ends up suffering the actions of their parent which might have a negative impact on the child.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "February 20, 2023, 09:50:38 PM",
      "body": "There are so many things we need to bear in marriage so it is not always about the kids buy about our family and how it is going to affects the children so they will learn from us on how to live a good life even with pressures on there side. Divorcing a woman or a man is not the a good alternative to end the marriage but enduring for as long as the marriage still hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "February 20, 2023, 10:19:29 PM",
      "body": "This particular topic has been treated here before the many people has been giving different kind of raisins why marriage is not difficult or risk measure so it depends on everyone's understanding concerning marriage and the person quickly eat on basic understanding of marriage redefine marriage with a thunder standing but from my own way of life marriage is not risk measure in any way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 20, 2023, 10:24:48 PM",
      "body": "Quote from: Remiscoin5 on February 19, 2023, 09:23:50 PM-cut-1 _when a marriage is about falling ,think about the kids and how divorce will make things wrong and difficult for them -cut-If the other option is constant fighting and threat of violence, divorce is way better option for kids. And if kids are lucky parents still both want to participate to raising them, even if that happens bi-weekly in seperate addresses. And usually they do. It just depends on the situation if they can do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "February 20, 2023, 10:33:53 PM",
      "body": "Quote from: Desmong on February 20, 2023, 09:50:38 PMThere are so many things we need to bear in marriage so it is not always about the kids buy about our family and how it is going to affects the children so they will learn from us on how to live a good life even with pressures on there side. Divorcing a woman or a man is not the a good alternative to end the marriage but enduring for as long as the marriage still hold.Sometimes when you take a marriage that is being separated you will notice that default of that family 100% will you come from them female gender so women always happens to be the problem of separation in any household, since separation is a threading means marriage life, so children of today will like to follow the steps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GideonGono",
      "created_time": "February 23, 2023, 10:48:42 PM",
      "body": "Quote from: Remiscoin5 on February 19, 2023, 09:23:50 PMWe all want a good relationship with our spouses or soulmates too .So what are the risks we should take 1 _when a marriage is about falling ,think about the kids and how divorce will make things wrong and difficult for them I have grown up as a young girl and has never leaved with both parents till last year when I started living with my dad ,don't you think I might have gone through alot ?? Without both parents by my side ,If you wanna give your kids the best in life you have to endure certain attitude Ms from both ur wife/husband ,when a home is seperated only one parent can't be able to take care of all the kids even if there is supplus money and second wife or husband ,when a single mother is set to take care of all the kids because she cought her husband cheating or what have you , she leaves ,she can't be fanacially stable to take care of all ,what if na 25 kids what's gonna happen?? The kids will start sleeping outside to care for them own selves ,how can a mother of 25 take such abilities all to her self More to talk about ,let's talk There are times that it is better to be separated than to continue on holding on to it, for example those who constantly fight in front of their kids, I am not just talking about physical but also verbal.It is draining both physical and mental for both of you then you should learn to take some rest and think if it would still be worth it to continue or is it better to just stop it.And for those who choose to be single parents you should also know how to communicate with your ex for your kids sake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 24, 2023, 05:09:55 AM",
      "body": "Divorce problems are endless and the biggest victim are children.Therefore, parents should think a lot about their children and their future before making the decision to divorce. They should avoid selfishness and think about whether this decision is good or bad about determining the fate of their children in the future.But at the same time, there are cases in which divorce is the best solution, because if the problems of the parents are many and they occur in front of their children, they will leave a great negative impact on their upbringing.The constant problems between parents leave a very bad effect on the children's psyche and behavior, and in this case divorce is better for the children's future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "February 24, 2023, 09:14:59 AM",
      "body": "Quote from: yhiaali3 on February 24, 2023, 05:09:55 AMDivorce problems are endless and the biggest victim are children.Therefore, parents should think a lot about their children and their future before making the decision to divorce. They should avoid selfishness and think about whether this decision is good or bad about determining the fate of their children in the future.But at the same time, there are cases in which divorce is the best solution, because if the problems of the parents are many and they occur in front of their children, they will leave a great negative impact on their upbringing.The constant problems between parents leave a very bad effect on the children's psyche and behavior, and in this case divorce is better for the children's future.If both of us really think about our children, we will never argue or fight in front of our children, it's all just our selfishness. When we get married, we need to know that then we are no longer living for ourselves but for our family and children.I also have a family, we also argued many times and thought about divorce. But like I said, if you think about your children's future, you know what's right, divorce is never a good thing for our children.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "February 24, 2023, 01:25:52 PM",
      "body": "One of the risk we don't all want to participate in taking is the risk of being responsible for marriage challenges, we must know that it's a lifetime of for better for worse and for richer or poorer, we need to understand that no condition is parmanent, therefore we must be ready to take our partners burden along with ours in facing marriage challenges a d tackle them one after the other, especially being the man who is the head of the house.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "February 24, 2023, 03:39:01 PM",
      "body": "At first I will say I feel sorry for you if you didn't really have the opportunity to grow up in the hands of your both parents, it really hurts, I know how it feels,Sincerely I don't really support divorce, but is better someone should divorce than dieing all in the name of marriage, I don't really think cheating is a major reason why couples divorce this days, because sincerely there are many married women and men(mostly men) that cheats this days, but yet their wives are still live  and be coping with their cheating attitudes, as long you provide their needs and the needs of the children..There are more to what people see in marriage that can lead to divorce rather than cheating, some spouse are really deadly and heartless, see I'm saying this out of experience, I know of a man that nearly killed his wife and the kids spiritually, all just because he's an occultic man, and in his coven they demanded for a family member if not God's intervention the woman and her kids would have died, so the woman has to divorce and leave the marriage.I know it will be so difficult for her now, taking care of their four kids and otherwise but I believe God will always see her through, because it's only who has life, that would have hope...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "February 24, 2023, 06:36:58 PM",
      "body": "Quote from: Doan9269 on February 24, 2023, 01:25:52 PMOne of the risk we don't all want to participate in taking is the risk of being responsible for marriage challenges, we must know that it's a lifetime of for better for worse and for richer or poorer, we need to understand that no condition is parmanent, therefore we must be ready to take our partners burden along with ours in facing marriage challenges a d tackle them one after the other, especially being the man who is the head of the house. It is true that marriage is meant to be forever until death. You are also right that marriage is for better for worst, sickness and health, richer and poorer, etc, but some marriages has subjected people to physically, psychological and mental torture. Some spouse are not marriageable because of their bad behaviors. Nobody will cope with an adulterous woman and no woman will love to live with a man that spends all his income on drugs, gambling or alcohol. There are some conditions that people can not cope with and the only option will be to seek divorce. Before I used to preach against divorce and I discriminated against divorcees but I have recently learned that the failure of their marriages might not be their fault. They might have tried all the could to sustain the marriage but their spouse was not marriageable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Remiscoin5",
      "created_time": "February 24, 2023, 10:13:06 PMLast edit: February 26, 2023, 10:22:42 PM by Mr. Big",
      "body": "Quote from: bbigtart on February 19, 2023, 09:38:34 PMMy mother's father divorced when I was a toddler, in mother's arms.And I was raised by step grandparents.My memory is still sharp enough to remember that sad time.Mother's father already has another partner as well as another child..My life is tossing and turning without directionJealous of my friends and the happiness of a small child, invites the sadness back..Father and mother, I just need your love, like my friend.So far, I've never gotten it.Now my father is gone forever, look at your son, father, now I am an adult and can find food for myself without your love.Without you I can be independent, now my father has gone forever back to God's side.But hatred for you makes me furious and I want to destroy everything around me.And now, from the experience above, I always try to avoid divorce because it will affect the child's mentality. yeah you're right these are one of the risk we should take , because of experience and it's good you took that decision decisions , because we aren't going to treat our kids and wife's or husband's the way we were treated too,Quote from: yazher on February 20, 2023, 05:38:10 AMMarriage is something you need to know before you get to it and you need to understand that your life will never be the same when you will marry the girl you love because when that happens, you gonna do everything to make her happy and comfortable. You just need to consider looking for the right spouse before thinking about marriage and you need to learn what are the criteria to become the right wife for your children. Because if you marry randomly without taking any considerations to do the tips above, then you are risking your marriage and your children's future because you might marry the wrong Man or Woman who will not care about you or your children or maybe they are abusive and you only found that out when you already married. you're right ,marriage isn't just a mare play like other primary relationships ,its a big step people should take ,but some don't care , expectially women ,some are just too desperate to get married,and prayers should be involved too, because it's till death do us appart they always say ,it's a very serious decision to take",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "February 27, 2023, 10:56:51 PM",
      "body": "The risk in marriage I will analyse based on my own understanding is when someone is incapable of getting married and they happened to Mary without making a proper foundation for itself so that is where I will say that the marriage is at stake because the marriage have no root anything can crush the marriage so it is very good for someone to build up its survey relationship and knowing the implication of marriage before both of them come together",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "February 27, 2023, 11:15:25 PM",
      "body": "All I know is that marriage is hard and we should not go into it if we know that we do not have the power or the strength to endure as much as we can. Everything about marriage is endurance so we need to make sure that we are fully ready to accept whatever we see before we think of going into marriage. Some persons enters marriage without you understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raceonsucced",
      "created_time": "February 28, 2023, 10:36:24 AM",
      "body": "Marriage must have a high tolerance for partners. Must love each other in times of trouble and joy. Accept your partner for who they are. Because marriage is full of struggles, loving each other, accepting each other. No human is perfect in this world, all complement each other (in pairs) and remind each other. I see many children who lack love from their parents, so they feel lonely and sad when their parents don't pay attention to their children. Actually what is the cause of all this? Family should be a place where we feel safe and peaceful in it. But, yes, we go back to the beginning that everything has risks and tests that make us sway in it. That's where the sense of family loyalty must exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}