{
  "id": "topic_5524787",
  "title": "IceLincoln",
  "author": "IceLincoln",
  "created_time": "December 31, 2024, 12:54:07 AM",
  "content": "Blackrock, the world’s largest asset manager, reached an all-time peak of $11.5 trillion in assets under management by the end of Q3 2024, thanks to significant net inflows and favorable market conditions. As the year wraps up, Bloomberg quoted Nate Geraci, president of The ETF Store, praising the Ishares Bitcoin Trust (IBIT) as the “greatest launch in ETF history.”Bloomberg reports that the IBIT fund now boasts more than $50 billion in bitcoin, with its holdings valued at approximately $52.4 billion as of Dec. 30—amounting to an impressive 552,554.76 BTC. Shukla summed it up in the report, saying, “Simply put, no ETF has ever had a better debut.” Since Jan. 11, 2024, Blackrock’s IBIT has attracted $37.31 billion in positive net inflows.Blackrock’s exchange-traded products (ETPs) are some of the world’s most dominant ETFs and they include Ishares Core S&P 500 ETF (IVV), Ishares Core MSCI Total International Stock ETF (IXUS), Ishares Core U.S. Aggregate Bond ETF (AGG), and Ishares Semiconductor ETF (SOXX).Source: https://news.bitcoin.com/bitcoin-boom-goes-mainstream-blackrocks-ibit-becomes-the-fastest-growing-etf-of-all-time/James Seyffart the Bloomberg intelligence analyst said “It’s the fastest ETF to reach most milestones, faster than any other ETF in any asset class”.The implication of Blackrock’s actions are far reaching and their influence can’t be overstated. This development suggests that this big companies are getting more relaxed and friendly with bitcoin.If more of them come in to bitcoin and invest largely, it could lead to more mainstream adoption and increased price.As the ETF market continues to evolve, it’ll be interesting to see how BlackRock’s competitors responds to the success of IBITHave a Wonderful new year !2025 is gonna be greater!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5524787",
  "comments": [
    {
      "author": "Dave1",
      "created_time": "December 31, 2024, 01:50:24 AM",
      "body": "Bitcoin has been taking center stage already specially this year as we hit new all time-high at $108k.And obviously, big players like BlackRock is into accumulation phase, no matter what, and if we continue this record breaking, for sure we will have the biggest bullish year we will have in Bitcoin's history.So this is a bullish signal!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 31, 2024, 02:26:58 AM",
      "body": "The influence of ETFs and BlackRock in the first quarter of this year was really significant and we witnessed the gradual gain of mainstream acceptance. Here we can also see the long-term implications especially if other major players follow suit. I think they truly served as the bridge to make Bitcoin accessible to other institutional investors and new players including those who previously doubted Bitcoin's potential. The stage has been set this year and I’m optimistic that the coming year will be a year of greater growth in adoption and innovation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "December 31, 2024, 05:56:45 AM",
      "body": "Quote from: Text on December 31, 2024, 02:26:58 AMThe influence of ETFs and BlackRock in the first quarter of this year was really significant and we witnessed the gradual gain of mainstream acceptance. Here we can also see the long-term implications especially if other major players follow suit. I think they truly served as the bridge to make Bitcoin accessible to other institutional investors and new players including those who previously doubted Bitcoin's potential. The stage has been set this year and I’m optimistic that the coming year will be a year of greater growth in adoption and innovation.Right, those ETF's really push Bitcoin to set a record of having a new all time pre-halving so that is huge already. And being still in it's infancy, just imagine how big it could be in the future considering that they have so many clients around the world and for sure they've purchase so much already the IBIT breaks record.So it's better for them to get in while the price is in the $100k, than $1,000,000 in the future.With that, everyone should be excited as how everything will unfold in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "December 31, 2024, 08:44:56 AM",
      "body": "Quote from: Dave1 on December 31, 2024, 01:50:24 AMAnd obviously, big players like BlackRock is into accumulation phase, no matter what, and if we continue this record breaking, for sure we will have the biggest bullish year we will have in Bitcoin's history.As the marketcap of an asset is increasing, the volatility and the extent the price can go up and down will reduce. Bitcoin is having a marketcap of almost $2 trillion now which can not be compared to when it has marketcap in millions and billions. The biggest bullrun that will have reflection on the price has been in the past, but you are right if it is marketcap because there will be more increase in the marketcap. This is good to know. But anyone that holds bitcoin will not lose but make profit is also my take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "December 31, 2024, 09:09:40 AM",
      "body": "Quote from: Text on December 31, 2024, 02:26:58 AMThe influence of ETFs and BlackRock in the first quarter of this year was really significant and we witnessed the gradual gain of mainstream acceptance. Here we can also see the long-term implications especially if other major players follow suit. I think they truly served as the bridge to make Bitcoin accessible to other institutional investors and new players including those who previously doubted Bitcoin's potential. The stage has been set this year and I’m optimistic that the coming year will be a year of greater growth in adoption and innovation.Yep. It's more about the message to the others hopping on than the amounts poured in - surely, they are big, and they are getting bigger each year and cycle that is favorable to do so, but it is clear as day that bigger guys are becoming more and more interested in Bitcoin. And that's great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "janet23wolf",
      "created_time": "January 02, 2025, 06:38:15 AMLast edit: January 03, 2025, 05:08:27 AM by janet23wolf",
      "body": "Quote from: IceLincoln on December 31, 2024, 12:54:07 AMBlackrock, the world’s largest asset manager, reached an all-time peak of $11.5 trillion in assets under management by the end of Q3 2024, thanks to significant net inflows and favorable market conditions. As the year wraps up, Bloomberg quoted Nate Geraci, president of The ETF Store, praising the Ishares Bitcoin Trust (IBIT) as the “greatest launch in ETF history.”Bloomberg reports that the IBIT fund now boasts more than $50 billion in bitcoin, with its holdings valued at approximately $52.4 billion as of Dec. 30—amounting to an impressive 552,554.76 BTC. Shukla summed it up in the report, saying, “Simply put, no ETF has ever had a better debut.” Since Jan. 11, 2024, Blackrock’s IBIT has attracted $37.31 billion in positive net inflows.https://talkimg.com/images/2024/12/30/D0G4z.md.jpegBlackrock’s exchange-traded products (ETPs) are some of the world’s most dominant ETFs and they include Ishares Core S&P 500 ETF (IVV), Ishares Core MSCI Total International Stock ETF (IXUS), Ishares Core U.S. Aggregate Bond ETF (AGG), and Ishares Semiconductor ETF (SOXX).Source: https://news.bitcoin.com/bitcoin-boom-goes-mainstream-blackrocks-ibit-becomes-the-fastest-growing-etf-of-all-time/James Seyffart the Bloomberg intelligence analyst said “It’s the fastest ETF to reach most milestones, faster than any other ETF in any asset class”.The implication of Blackrock’s actions are far reaching and their influence can’t be overstated. This development suggests that this big companies are getting more relaxed and friendly with bitcoin.If more of them come in to bitcoin and invest largely, it could lead to more mainstream adoption and increased price.As the ETF market continues to evolve, it’ll be interesting to see how BlackRock’s competitors responds to the success of IBITHave a Wonderful new year !2025 is gonna be greater! Wow, this is quite the update! BlackRock's incredible growth and the success of their Ishares Bitcoin Trust (IBIT) are certainly making waves in the financial world. It's fascinating to see how major asset managers are embracing Bitcoin and other cryptocurrencies, which could indeed pave the way for more mainstream adoption and potentially impact market prices significantly birthday freebiesAs for the new year, I'm optimistic too. With all these advancements and shifts in the financial landscape, 2025 is shaping up to be an exciting year. Have a wonderful new year, and here's to more groundbreaking developments and opportunities in the year ahead! Cheers to 2025!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 02, 2025, 07:49:10 AM",
      "body": "Unpopular opinion here, but normal people don't care about Blackrock's ETF. Or anyone's ETF.  Most of them can't (or won't) even buy one anyway, and would be better off buying actual bitcoins and self-custodying them, which is free and doesn't cost anything to do. Just download a wallet on an air-gaped computer and you're done.Or spend a small amount of money on a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 02, 2025, 07:53:45 AM",
      "body": "That's an indication of what's to come, we're at the bottom of the s-curve about to go up. Until now many institutional investors could not invest because they did not have the means to do so, such as bitcoin ETFs. Also individual investors, who for their pension plans cannot have bitcoin but they can have the ETF. So I see it as good news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "January 02, 2025, 08:09:30 AM",
      "body": "Bitcoin saved individual lives, saved hedge funds, saved WallStreet and even saved countries like El Salvador. Bitcoin the almighty is waiting for open arms to save anyone who believes in it. The heretics, nocoiners, naysayers like Peter Schitt are still in denial even after witnessing all them bitcoin miracles.Blackrock, Saylor of Microstrategy, Elon of Tesla, Bukalele of El Salvador, Trump of United Stated of America (V.V.I.P) are in the driver’s seat and soon others will also join.Even though Microsoft refused to join the party recently it doesn’t mean they won’t in the future.Microsoft, Amazon, Switzerland, Apple are on the waiting list of moon rocket train.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "January 02, 2025, 08:16:00 AM",
      "body": "Quote from: NotATether on January 02, 2025, 07:49:10 AMUnpopular opinion here, but normal people don't care about Blackrock's ETF. Or anyone's ETF.  Most of them can't (or won't) even buy one anyway, and would be better off buying actual bitcoins and self-custodying them, which is free and doesn't cost anything to do. Just download a wallet on an air-gaped computer and you're done.Or spend a small amount of money on a hardware wallet.Agreed. It's the news to know, surely, but they are just another factor to affect Bitcoin in the times to come: and I've never heard someone accumulating the shares",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}