{
  "id": "topic_5488827",
  "title": "larry_vw_1955",
  "author": "larry_vw_1955",
  "created_time": "March 14, 2024, 06:17:23 AM",
  "content": "https://cointelegraph.com/news/crypto-mining-tax-united-states-budgetUnited States President Joe Biden has revived the idea of a 30% tax on electricity used by crypto miners in his budget proposal for 2025. Lets just admit it. Biden is never going to try and stop taxing people involved in bitcoin.   Anyone that uses bitcoin here in the usa is directly accountable to the IRS even more than someone that owns a room full of firearms. enough said.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5488827",
  "comments": [
    {
      "author": "Helena Yu",
      "created_time": "March 14, 2024, 07:07:29 AM",
      "body": "To be more accurate with the proposal. At least they still have a lot time to prepare, so they could find a safe country that has a cheap electricity cost https://www.cable.co.uk/energy/worldwide-pricing/Quote from: https://home.treasury.gov/system/files/131/General-Explanations-FY2025.pdfThe proposal would be effective for taxable years beginning after December 31, 2024. The excise tax would be phased in over three years at a rate of 10 percent in the first year, 20 percent in the second, and 30 percent thereafter.Biden must read this project to know the reality instead of falsely accuse Bitcoin for using a lot energy and causing climate change https://bitcoincleanup.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "March 14, 2024, 07:35:19 AM",
      "body": "I'm starting to like Trump more and more. Although he is a Republican.  Good luck, America! God help us all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 14, 2024, 08:17:15 AM",
      "body": "due to how asic farms do deals with power companies. they already get discount compared to normal residential/industrial rates.. so a 30% tax is not that much... especially when smart asic farms can just file yearly gains/losses of mining when bitcoin bear markets post the 2025 ATH.. thus can offset losses against tax and thus not have to pay taxas for the rest of the hobby miners that get caught mining from home, well yes they have to declare their hobby as a business and pay tax, but that will just push underlying costs of mining up for some which will strengthen the underlying value of bitcoin support to never drop below $##k againso biden effectively gives bitcoin more value by making it more expensive for some to mine bitcointhe actual repercussions is not the tax cost... but the declarations of sources of income, where power companies will be more likely to become reporting agencies of high use residents, sending agents to peoples homes to investigate reasons for high use of energy (much like they did when weed farming was illegal and authorities used energy bills as suspicions of running a weed farm)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "March 14, 2024, 08:36:04 AM",
      "body": "Biden is a wannabe dictator. This idiot should know that he cannot unilaterally make the tax laws. That is the job of Congress.When the miners threatened to sue his sorry ass for trying to force them to disclose private information they threatened to sue and he was forced to back down.This harebrain idea will never get through the Congress or the courts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 14, 2024, 09:42:06 AM",
      "body": "30% of miner's electricity cost? It's not small, even considering miner usually get bulk/discounted price. Unless electricity company in U.S. can offer even cheaper rate within few years, we'll see miner leaving America.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "March 14, 2024, 09:57:11 AM",
      "body": "The only thing these governments are good at is, taxing people for everything they could think of and this will happen globally because we have already seen how Indian government has applied 30% tax of crypto profits and also 1% TDS on every trade and eventually banned foreign exchanges who cannot implement this and now Biden admin has planned this 30% crypto mining tax, though people will say it won't be that much considering the discounts they get but it's an additional cost for us and income for government which doesn't even support Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "March 14, 2024, 10:06:50 AM",
      "body": "Trump could at least probably do more than tax more than necessary. Biden is facing a comparable opponent for the second time, so if he wants the votes of the Bitcoin community then the decision he made today was the wrong one. Currently dealing with US policy is very difficult, strict and has too many rules, miners need to move if they want to get relief.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "March 14, 2024, 10:07:36 AM",
      "body": "Quote from: larry_vw_1955 on March 14, 2024, 06:17:23 AMhttps://cointelegraph.com/news/crypto-mining-tax-united-states-budgetUnited States President Joe Biden has revived the idea of a 30% tax on electricity used by crypto miners in his budget proposal for 2025. Lets just admit it. Biden is never going to try and stop taxing people involved in bitcoin.   Anyone that uses bitcoin here in the usa is directly accountable to the IRS even more than someone that owns a room full of firearms. enough said.Taxes on Bitcoin are inevitable, the more popular Bitcoin gets, the more restrictions we get in return. Situation can't be like it was in 2016. In 2016, Bitcoin wasn't popular, governments weren't much interested in it and there weren't regulations because Bitcoin wasn't even considered as a currency by many governments, companies and organizations. Now Bitcoin is a very popular currency used by millions of people and tax is inevitable.Yesterday I wanted to buy something from a shop that was accepting bitcoin payments and have bought many things from them via Bitcoin in the last year. Yesterday, I didn't see Bitcoin as a payment option and when I messaged the shop owner, he told me that he hated paying the capital gains taxes on Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 14, 2024, 10:27:25 AM",
      "body": "Quote from: larry_vw_1955 on March 14, 2024, 06:17:23 AMhttps://cointelegraph.com/news/crypto-mining-tax-united-states-budgetUnited States President Joe Biden has revived the idea of a 30% tax on electricity used by crypto miners in his budget proposal for 2025. I’m curious to know, is the \"30% tax on electricity used by crypto miners\" higher than the tax on production or used in commercial activities? If higher, then another question arises. Why is there such discrimination against mining? Does the government believe that this is an overly profitable industry, which means it needs to be strangled with taxes?If they wanted to allow this industry to develop, then taxes would, on the contrary, be reduced to attract new miners to the country. High taxes only discourage miners.Quote from: larry_vw_1955 on March 14, 2024, 06:17:23 AMLets just admit it. Biden is never going to try and stop taxing people involved in bitcoin.   Anyone that uses bitcoin here in the usa is directly accountable to the IRS even more than someone that owns a room full of firearms. enough said.It should be recognized that any government of any country will try to do this. Taxes are not the worst thing, but criminal prosecution is a completely different matter, like having a \"room full of firearms\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "March 14, 2024, 10:27:41 AM",
      "body": "Squeeze as much as possible is the actual new meaning of taxation, that now applied to crypto as well since it no more a thing that can be ignored since it's part of the world's economy. People may find ways to avoid taxes so they no need to shift to different country whenever something that is not favorable for their operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "March 14, 2024, 10:52:30 AM",
      "body": "I imagine that it will be a global trend for governments to start creating taxes for those who use cryptocurrencies, it is a path of no return, starting with ETFs, the traditional market and the government cannot do anything about it, just tax and try to censor, and that is what they will do. But a bitcoiner doesn't care about that. And there is nothing governments can do either.Just narratives to convince people to pay taxes on their currencies otherwise they will be compared to marginal. Who cares?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "March 14, 2024, 10:54:58 AM",
      "body": "That's a lot. IIRC, just after his proclamation as the POTUS, I think there were talks about him getting some of his attention into crypto/bitcoin but this is what I am not expecting to come. Since this is still a proposal, so I think that there's a big chance that it will be approved before the election on November.There might be miners that will just say that they're not into mining so their electricity that's being used for mining won't be taxed if this becomes a law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "March 14, 2024, 11:06:39 AM",
      "body": "Quote from: jrrsparkles on March 14, 2024, 10:27:41 AMPeople may find ways to avoid taxes so they no need to shift to different country whenever something that is not favorable for their operations.That is tax evasion and it is a crime, i don't think miners would want to take that risk, if this is implemented and some of them cannot cope with it as it eats into their profit, they will pack up their gears and move to another location with cheap electricity and favorable laws. I don't know if the government is doing this to attack BTC, because they know that the u.s. has most of the BTC miners, and a lot of them may be forced to leave if this gets implemented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 14, 2024, 11:24:21 AM",
      "body": "Quote from: larry_vw_1955 on March 14, 2024, 06:17:23 AM~snip~Lets just admit it. Biden is never going to try and stop taxing people involved in bitcoin.   Anyone that uses bitcoin here in the usa is directly accountable to the IRS even more than someone that owns a room full of firearms. enough said.Does anyone really think this is Biden's idea? Well, a man does not know who is alive and who is dead, in which country he is and with whom he is talking, and someone thinks that he personally has a problem with Bitcoin? Taxes have always existed and will continue to exist, and increasing taxes as in this case is just a cultural way of telling miners to pick up their equipment and find another home.On one occasion, I wrote that China and the US are not so different when it comes to human rights and freedoms, with the difference that China passed a law and banned Bitcoin trading and mining, while the US will do it in a much more \"democratic way\" by increasing taxes. As for whether Trump would be better than Biden, perhaps some have forgotten what Trump had planned for cryptocurrencies at the very end of his term, and the Biden administration rejected all of that. Whether it will be Biden or Trump is completely irrelevant for Bitcoin, the policy basically remains the same, which is the protection of the national currency and national interests.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 14, 2024, 11:44:53 AM",
      "body": "Quote from: Lucius on March 14, 2024, 11:24:21 AMDoes anyone really think this is Biden's idea? Well, a man does not know who is alive and who is dead, in which country he is and with whom he is talking, and someone thinks that he personally has a problem with Bitcoin? Taxes have always existed and will continue to exist, and increasing taxes as in this case is just a cultural way of telling miners to pick up their equipment and find another home.It is like lawsuits from SEC. against cryptocurrency companies like exchanges and it is considered as their over wrongly used power to force companies move out of the USA. In a Congressional hearing months ago, SEC. Chair Gensler was asked about it and he failed to response convincingly.QuoteOn one occasion, I wrote that China and the US are not so different when it comes to human rights and freedoms, with the difference that China passed a law and banned Bitcoin trading and mining, while the US will do it in a much more \"democratic way\" by increasing taxes. I agree with you but at least in the USA. there will be fighting between two parties and it's better for their citizens. It's better than in China when one party controls all aspects in that nation. No democracy in China and it is not only about Bitcoin mining industry.QuoteAs for whether Trump would be better than Biden, perhaps some have forgotten what Trump had planned for cryptocurrencies at the very end of his term, and the Biden administration rejected all of that. Whether it will be Biden or Trump is completely irrelevant for Bitcoin, the policy basically remains the same, which is the protection of the national currency and national interests.The end game will be defending their national currency but their politicians have to bargain with their citizens when they need votes. I see it is still good for human rights and benefit their citizens can fight for.If the Republic party takes over the White House with Trump and more improvements in the Congress, they might do something more positive for cryptocurrency industry, for Bitcoin community. If their actions in future are not enough, they will lose their positions next 2 or 4 years and the cycle will repeat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 14, 2024, 03:08:36 PM",
      "body": "Quote from: tranthidung on March 14, 2024, 11:44:53 AM~snip~If the Republic party takes over the White House with Trump and more improvements in the Congress, they might do something more positive for cryptocurrency industry, for Bitcoin community. If their actions in future are not enough, they will lose their positions next 2 or 4 years and the cycle will repeat.As if the outcome of the election depends on crypto-friendly voters, and we know that's simply not true. I'll just say that Trump with his \"cowboy\" behavior is much more dangerous than Biden, and I really don't know what should be better in the US when it comes to cryptocurrencies?The US has Coinbase, Grayscale, Microstrategy, BlackRock, Fidelity + the largest network of crypto ATMs in the world and more than a third of miners in its territory - it's not like we can say that they're not crypto friendly, right? However, lobbying and interests are always intertwined, and a proposal can always remain only a proposal if someone powerful lobbies to keep it that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "March 14, 2024, 03:32:46 PM",
      "body": "Quote from: headingnorth on March 14, 2024, 08:36:04 AMBiden is a wannabe dictator. This idiot should know that he cannot unilaterally make the tax laws. That is the job of Congress.When the miners threatened to sue his sorry ass for trying to force them to disclose private information they threatened to sue and he was forced to back down.This harebrain idea will never get through the Congress or the courts. He's not, he's proposing this to Congress. Just like every other president we've ever had. Jeez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "March 15, 2024, 06:13:46 AM",
      "body": "Quote from: franky1 on March 14, 2024, 08:17:15 AMthe actual repercussions is not the tax cost... but the declarations of sources of income, where power companies will be more likely to become reporting agencies of high use residents, sending agents to peoples homes to investigate reasons for high use of energy (much like they did when weed farming was illegal and authorities used energy bills as suspicions of running a weed farm)well yeah, bitcoin miners could turn into the new weed growers looked down upon just as much with just as much contempt and suspicion. i could see the  day when the government has a team of special agents just to seek out bitcoin miners and bust them and throw them in jail for evading paying excise taxes.Quote from: LuciusDoes anyone really think this is Biden's idea? Well, a man does not know who is alive and who is dead, in which country he is and with whom he is talking, and someone thinks that he personally has a problem with Bitcoin? of course it's not his idea but he signs off on everything. think \"democratic party\". the same people responsible for the border crisis, i mean invasion...Quote from:  m2017It should be recognized that any government of any country will try to do this. Taxes are not the worst thing, but criminal prosecution is a completely different matter, like having a \"room full of firearms\".people can own as many firearms in the usa as they want and go and shoot their guns as often as they want without having to report what they are doing to any government agency. it's no one's business. try and use bitcoin in any meaningful way other than shuffling it around from wallets you own and see if you can do that without reporting it to the irs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 15, 2024, 06:17:15 AM",
      "body": "Quote from: larry_vw_1955 on March 14, 2024, 06:17:23 AM30% tax on electricity used by crypto miners in his budget proposal for 2025.Enough time to make plans In any case, there is a good chance that more and more of such negative news would start coming out of United States in the following years. From increased taxes on miners, traders, crypto related businesses, etc. all the way to any individual that has ever thought about a cryptocurrency.The more Bitcoin grows, they more they'll fight it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}