{
  "id": "topic_5437995",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "February 04, 2023, 07:07:06 AM",
  "content": "Today too many people are in worries about Bitcoin adoption, they want to see the global adoption happens overnight, that is impossible, I had some chats yesterday within a mist of friends and they are talking about how they don't notice any fast global bitcoin adoption, I told them that it won't happen instantly. Bitcoin came into the world in 2009 and so far it's been doing so well. My last piece of advice to them is that Bitcoin adoption starts with us, let's forget about the global side, how many people have you lectured about Bitcoin this year locally, I asked. The same thing goes out to all of us on here, every part we take locally will have a big impact on Bitcoin adoption, never get tired of spreading the news, it's worthy.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437995",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "February 04, 2023, 07:40:43 AM",
      "body": "Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMThe same thing goes out to all of us on here, every part we take locally will have a big impact on Bitcoin adoption, never get tired of spreading the news, it's worthy. I'm the one who not act anything about Bitcoin in my local and never spread any news because there's no any reason for me to do it. In my country there's few local countries, but I never use one of them and only use P2P platform. I think even we're not doing anything in the country where we live, but it doesn't mean it will make Bitcoin adoption is decreased, because many investors and people who're looking to make money via online, will recognize if Bitcoin is one way from many.After all, any people who hold Bitcoin regardless how much the amount is, already give an impact on Bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "February 04, 2023, 07:42:15 AM",
      "body": "What Bitcoin has achieved in the last decade is beyond imagination as it was a totally strange means of payment and investment, yet it beat many prominent ideas just like that. However, it needs more adoption, but this will not happen overnight. You will hardly see anyone in an urban area that has not heard of Bitcoin now, only that some have not adopted it due to one reason or the other, while the government of some countries are not helping out.Notwithstanding, Bitcoin will always prevail and more time is needed for many countries to reconsider, and this will help in more adoption. Also, we have to do our homework if we are truly helping the situation as BTC enthusiasts.I have actually started mine already as I teach people about the coin for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "February 04, 2023, 08:00:53 AM",
      "body": "In life something good always win for itself even in the midst of all obstacles that no matter the oppression it receives the good in itself will make it prevail at the end. When the internet was first invented, it received so much criticisms from many angles but today everyone has seen how advantageous it is and it now have a universal acceptance, so if today bitcoin is not receiving the rapid global acceptance many bitcoiners has expected that doesn't mean it's ain't making a gradual progress. It's global acceptance is necessarily not about we preaching about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "February 04, 2023, 08:08:28 AM",
      "body": "I did not spread bitcoin to my community, close friends and even blood relatives. However, I am not hiding from those around me that I am a bitcoin believer and I have an investment in it. I provide genuine responses to questions they occasionally pose. I even explained to them what bitcoin is all about and my own predictions regarding the price of bitcoin in the future. Therefore, it is their decision whether or not to invest. I do not care, and I am not going to be criticized if something happens to the bitcoin price, which is normal given its volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 04, 2023, 08:36:04 AMLast edit: February 04, 2023, 08:49:35 AM by franky1",
      "body": "alot of people treat bitcoin as if it some entity with arms and legs and a mouth which will one day get on a plane and come to someones area and start a business in that area. or educate everyone at a conference it has organised.bitcoin is not AI nor an entity that hops on a planeit is very much users doing things in their area/ability.. working together and individually to do small parts which act as a whole to strengthen the bitcoin ecosystemmuch like how bitcoin workseach peer has its set rules and plays its part in communicating and storing information around it where the subsequent mass of people doing the same thing, which makes the network strong and robustdont rely or wait or hope for central point/entity to do it . each person plays their partif you are just waiting, following, hoping some influencer will be the next big thing for bitcoin. you are waiting and hoping for the wrong things..you do not need to be the next big thing for bitcoin in your areayou can simply be a person that finds a nice cafe in your area with enough seating for multiple people. and invite people to have a cup of coffee and chat about bitcoinfind out peoples interest in it, find out their involvement and skills. let them vocal-network with each other to find out who is a energised buyer who is a energised seller. let them be known as the people to go to, to do trades with face to facefind out who are the local business owners, promote them as stores that could sell produce for coinfind the miners and developers as the \"tech\" group who can teach what they know to others. ask each of them what are their main local shops they all prefer, like a hotlist of shops most would love to see accept bitcoin. and find the guy thats a good spokes person to go promote it to said hotlist. you dont need to be the techie, or the exchanger, or the spokes men if thats not your skillset. but starting off small like a coffee morning and see what others can offer can start a positive movementif your coffee meetings get popular upgrade them into seminars, conferences and such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "February 04, 2023, 08:54:06 AM",
      "body": "Bitcoin's popularity did not suddenly rise, it took years of tireless struggle and evolution to gain popularity. Bitcoin's popularity didn't suddenly spread worldwide after Satoshi Nakamoto invented Bitcoin. Rather, after the discovery of Bitcoin, few people knew about this Bitcoin, then with the evolution of time and necessity, Bitcoin has now become the most talked about digital currency in the world.I tried to explain the matter with a very simple example.  For example Bitcoin Forum was created in November 2009 when there were only four new members of Bitcoin Forum now Bitcoin Forum has 3516956+ members.November 2009 bitcoin forum new members 4November 2010 bitcoin forum new members 374November 2011 bitcoin forum new members 1993November 2012 bitcoin forum new members 2708November 2013 bitcoin forum new members 19683................................November 2017 bitcoin forum new members 97283So today bitcoin forum members amounts 3516956+See ref:https://bitcointalk.org/index.php?action=statsThe popularity of our bitcoin forum was close to zero in the beginning, now the popularity of bitcoin forum is very high worldwide and constantly new members are joining the world and trying to occupy an important place in the world. Just like the Bitcoin forum, the popularity of Bitcoin will not be created in a day, but more time is needed to spread the popularity of Bitcoin around the world and more advertising is needed to spread the popularity of Bitcoin widely around the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PhoenixZephyrus",
      "created_time": "February 04, 2023, 08:54:52 AM",
      "body": "I kind of agree, but also the fact that most people do not really want to change from the current global standard that is fiat makes it difficult, its kind of like preaching into the void. There's no way a large part of the population will accept bitcoin as a form of viable currency exchange in their lifetimes. But the tech enthusiast can be convinced otherwise. There are programs to make people more and more involved in understanding bitcoin, its use, why it can become the new money standard that can be used worldwide - without conversions and centralized oversight. Things like Summer of Bitcoin is definitely helping people in my country get more hands on with bitcoin (albeit its mostly just university students), but nonetheless, these initiatives come with courses that shed light on some of the aspects of bitcoin that make people avoid it - mostly because they don't know about it all that much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 04, 2023, 09:04:33 AM",
      "body": "Quote from: PhoenixZephyrus on February 04, 2023, 08:54:52 AMI kind of agree, but also the fact that most people do not really want to change from the current global standard that is fiat makes it difficult, its kind of like preaching into the void. There's no way a large part of the population will accept bitcoin as a form of viable currency exchange in their lifetimes. its not about trying to bang peoples heads against the wall to drop fiat and only use bitcoin.its about just telling them there is a different optionits like telling them instead of bank accounts that offer 0.001% interest gainsthere are credit unions that offer 2% gainsits not about converting carnivores into vegans. its about saying try some potato alongside their steakits not about asking a beer alcoholic to get sober and drink water. its about offering him a fine wine or a whiskey",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "February 04, 2023, 09:33:51 AM",
      "body": "I've introduced bitcoin to friends and few of my family members. The latter part is upto the person whether to invest or just leave it. Further if they ask support I used to help them, I don't volunteer. People are much interested into it, but at the same time they aren't ready to accept something that is virtual. In my locality some have used the term cryptocurrency and scammed people. So, if I try to spread people might indicate me a scammer. I need to be very careful handling things in my locality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "February 04, 2023, 09:54:06 AM",
      "body": "All i know is good thing take time and besides I don't expect bitcoin to dominate instantly without going through many phases in life.. why because the gradual process and dominance will build more confident than instant adoption, and instant adoption means a thing of forcefully wanting people to accept all concept of bitcoin without studying how it's. Remember it may not be globally accepted because I think today there are still some country who don't have internet facilities to access the digital world, it may be lack of electricity and modern gadgets in such country. How do you think they will start making use of bitcoin.Only 1st to 3nd class world that is active  promoters of bitcoin. I my self have been a good example working hard around my locality making sure I impact on some young youths to have some basic clue about bitcoin, and for those who are tasty to know more I do refer them over here to read more about bitcoin due to their zeal and interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "February 04, 2023, 09:56:21 AM",
      "body": "I think it is very important to explain the philosophy behind Bitcoin when explaining it to people but I felt that they were looking at me meaninglessly when I was really explaining it to a few people around me. They looked at me like I was a scammer. I think Bitcoin is still not well understood and i can say that the solution to this is not by thinking locally and acting globally. It is much better for people who are respected around the world to tell about Bitcoin than locally. Thus it will be easier for the masses to adopt Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "February 04, 2023, 10:50:35 AM",
      "body": "Always believed that, even if it sounds xenophobic. But local's always been \"myself\" first. You can only gain so much by preaching, if I look back on myself, I've always only really been convinced by seeing rather than hearing.Bitcoin's pretty much the same. I knew about it pretty early on, slashdot was a thing back then. Even covered it as a journalist down the line, but it was really only in 2016 when I read about it and started using it that I was convinced.Looking back at Bitcoiners I've met over the years, pretty much the same. They all did, and acted \"locally\". That contagion happens after, and naturally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "February 04, 2023, 12:18:14 PM",
      "body": "Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMToday too many people are in worries about Bitcoin adoption, they want to see the global adoption happens overnight, that is impossible, I had some chats yesterday within a mist of friends and they are talking about how they don't notice any fast global bitcoin adoption, I told them that it won't happen instantly.What else do they need to get aware of about bitcoin aside that governments in some countries are yet to adopt it as a legal tender, so far so good bitcoin has gained a world rank recognition with all the 14 years Achievements it has acquired within this little time and that's why everyone searching on the internet today want to make more discovery about bitcoin because they know it's a advantage for a financial opportunity for security and freedom, except for those who were not technology inclined on digital currency will assume bitcoin is not moving fast enough with adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "February 04, 2023, 12:48:36 PM",
      "body": "Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMToday too many people are in worries about Bitcoin adoption, they want to see the global adoption happens overnight, that is impossible, I had some chats yesterday within a mist of friends and they are talking about how they don't notice any fast global bitcoin adoption, I told them that it won't happen instantly. Bitcoin came into the world in 2009 and so far it's been doing so well. My last piece of advice to them is that Bitcoin adoption starts with us, let's forget about the global side, how many people have you lectured about Bitcoin this year locally, I asked. The same thing goes out to all of us on here, every part we take locally will have a big impact on Bitcoin adoption, never get tired of spreading the news, it's worthy. Just let your friend tell what they wanna say about bitcoin or its adoption. It won't be an instant adoption but if we'll based all of the years from the very start up to this moment, it's safe to say that bitcoin has gone that far already.And we can guarantee that adoption is continuosly happening. If they're not satisfied with what they're seeing then let them wait until they see that most countries has it. But the reality is that, it has already come further than before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "February 04, 2023, 12:54:41 PM",
      "body": "Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMToday too many people are in worries about Bitcoin adoption, they want to see the global adoption happens overnight, that is impossible, I had some chats yesterday within a mist of friends and they are talking about how they don't notice any fast global bitcoin adoption, I told them that it won't happen instantly. We are already on 2023 while Bitcoin was invented during 2009. It’s already more than a decade for Bitcoin existence and people is not thinking global adoption should happened overnight because Bitcoin adoption is really very slow. I will understand your comment if we are on 2010 or 2011 because people will obviously too impatient but right now Bitcoin already have the spotlight and the capability to speed up Bitcoin adoption. We just need to do our job to support Bitcoin and become more aggressive than ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "February 04, 2023, 01:16:12 PM",
      "body": "Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMToday too many people are in worries about Bitcoin adoption, they want to see the global adoption happens overnight, that is impossible, I had some chats yesterday within a mist of friends and they are talking about how they don't notice any fast global bitcoin adoption, I told them that it won't happen instantly. Bitcoin is 14 years old, that's enough time to show some results. How much adoption did other inventions get in similar timeframe? Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMMy last piece of advice to them is that Bitcoin adoption starts with us, let's forget about the global side, how many people have you lectured about Bitcoin this year locally, I asked. If Bitcoin needs in-person convincing, it's a sign that it's having problems with adoption. People didn't preach adoption of TikTok or Facebook or the Internet to their friends, those things grew on their own. But Bitcoiners are acting like Jehovah's witness, with similar success.Bitcoin is mostly getting popular because of bull markets that offer a promise of getting rich quick. Without them few people would care about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "February 04, 2023, 01:30:08 PM",
      "body": "Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMThe same thing goes out to all of us on here, every part we take locally will have a big impact on Bitcoin adoption, never get tired of spreading the news, it's worthy. Yes of course it's worth it, and not a problem, howeverSo far we have not spread about Bitcoin, in the sense that we have not provided in-depth insight for those who don't really believe in it, although at least this is not a problem and has an impact on Bitcoin Adoption, even though they know Bitcoin and have sufficient knowledge. about Bitcoin it really changes some important and very significant aspects about it, but some of them don't have a good direction, everyone is different of course.But this is not a big/small problem with Bitcoin, day after day so far we feel that the popularity of Bitcoin is increasing and getting better, as well as the adoption of Bitcoin even though it doesn't happen significantly globally. not only that the adoption of Bitcoin itself has been carried out by large companies even though there are some who still haven't done it maybe there are several reasons behind it, but this ongoing adoption has really helped make Bitcoin even better.Even though we don't spread Bitcoin news, we also don't hide it from the public, we ourselves are Bitcoin adherents and Bitcoin holders in the sense that we also invest in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "February 04, 2023, 01:30:19 PM",
      "body": "Quote from: Crypt0Gore on February 04, 2023, 07:07:06 AMToday too many people are in worries about Bitcoin adoption, they want to see the global adoption happens overnight, that is impossible, I had some chats yesterday within a mist of friends and they are talking about how they don't notice any fast global bitcoin adoption, I told them that it won't happen instantly. Bitcoin came into the world in 2009 and so far it's been doing so well. My last piece of advice to them is that Bitcoin adoption starts with us, let's forget about the global side, how many people have you lectured about Bitcoin this year locally, I asked. The same thing goes out to all of us on here, every part we take locally will have a big impact on Bitcoin adoption, never get tired of spreading the news, it's worthy. But it is true that I witnessed with my own eyes that many are concerned about the adoption of bitcoin, even though those who are for bitcoin are only bitcoin for them.We have to start with our environment, from family, relatives and friends, the next are people who greet us in the community, they must know about bitcoin and we become pioneers in society who introduce them to bitcoin and how bitcoin works and to see that it is possible it will spread in the country or area that we live in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "February 04, 2023, 02:55:40 PM",
      "body": "Global adoption will not happen instantly, and it still takes time to be accepted globally, especially from the government side. We as citizens can still use bitcoin as a preparation if one day bitcoin can be accepted in many countries or even in all countries so we don't have to bother buying bitcoin because we have prepared it from now on. What's important is that we have to prepare for that time and having bitcoin from now on will help us later. Forget those who don't want to join us in investing in bitcoin because they don't want to change their lives through bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}