{
  "id": "topic_5400064",
  "title": "karabiber",
  "author": "karabiber",
  "created_time": "May 24, 2022, 09:48:35 PM",
  "content": "Bireysel silahlanmanın çok kolay olduğu Amerika Birleşik Devletleri’nde yine bir katliam vakası gerçekleşti. Texas eyaletinde 18 yaşında bir çocuk önce büyükannesini öldürdü ardından ilkokulda öğretmen dahil on beş masum insanı katletti. Bireysel silahlanmanın kolaylığının sonuçlarından birisi bu. Marketten sakız alır gibi silah alınmasını doğru bulmuyorum. İşinde gücünde, ülkesi için çabalayan masum insanlar sırf silah şirketleri daha fazla kazansın diye canını veriyor. Bu çok korkunç bir olay. Bir takım şirketler için insan hayatı hiçe sayılıyor. Amerika’nın gerçek yüzü işte bu. Daha fazla para için insan yaşamının hiç bir değeri yoktur. Bakmayın siz youtube da anlatılan ABD videolarına. Yok şu kadar çalıştım şunu aldım, yok bunu yaptım bunu aldım meta fetişistliğine. İşte hayatınız bu kadar basit bu topraklarda. İstediğini al ama hayatın bir manyağın namlusunun ucunda. Bebenin biri marketten parasıyla silahını alır ve masum insanları katleder. Bunun içerisinde siz veya sizin tanıdıklarınız da olabilirdi. Ölen masum insanların ailelerinin psikolojisini düşünmek bile istemiyorum.Kaynak: https://abcnews.go.com/amp/US/texas-elementary-school-reports-active-shooter-campus/story?id=84940951",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400064",
  "comments": [
    {
      "author": "Lachrymose",
      "created_time": "May 24, 2022, 10:55:43 PM",
      "body": "ABD doları değerini ABD ordusuna, ABDliler de özgürlüğünü bireysel silahlanma hakkına borçlu. Bir kişi bunu yaptı diye 330 milyon insanın özgürlüğü elinden alınamaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "May 25, 2022, 04:21:45 AM",
      "body": "Tabii ki sayısal olarak Amerika Birleşik Devletleri ile kıyaslanamaz ama bizim ülkemizde de yüzde olarak hesabı yapılırsa Amerika’ya yakın oranlarda silahlanma sonucu çıkacaktır. Bireysel silahlanmanın bizim ülkemizde de çok kolay olduğunu düşünüyorum. Ruhsatsız olarak herkes silah alabiliyor. Gerçek silah alamayanlar da kurusıkı alıp onu dönüştürebiliyor. Bu çoğu ülkede olan bir sorun maalesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "May 25, 2022, 04:39:19 AM",
      "body": "Quote from: Lachrymose on May 24, 2022, 10:55:43 PMABD doları değerini ABD ordusuna, ABDliler de özgürlüğünü bireysel silahlanma hakkına borçlu. Bir kişi bunu yaptı diye 330 milyon insanın özgürlüğü elinden alınamaz.Burada farklı düşünüyoruz bence.ABD, özgürlüğünü bireysel silahlanmaya değil, finansal gücüne bağlı olarak yaşıyor.Silahlanma özgürlükleri bile var habere konu olacak şekilde.Bireysel silahlanan kişilerin bir anlık siniriyle böyle katliam yapabileceklerini tahmin etmek gerekir.Bence bireysel silahlanmanın zararları konusuna çok iyi oturan bir olay olmuş, keşke olmasaydı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "May 25, 2022, 06:10:39 AM",
      "body": "Ülkemizde de silah bulmak çok zor değil parası olana bu ülkede her şey çok kolay adaleti bile satın alabilirsiniz. Ülkemizde bireysel silahlanma kolay olmasa bile hemen her gün başta kadınlar olmak üzere bir sürü cinayet haberi okuyoruz. Bireysel silahlanmaya bende karşıyım herkese gelişi güzel silah verilmemeli elbette toplum olarak benzin gibi saniyesinde parlayabiliyoruz hiç yüzünden silahlar çekilip patlaya biliyor. Bireysel silahlanma kolay olursa ve bu silahları iyi muhafaza edilmez ise çocuklar çok rahat ulaşacaktır ve dolayısıyla çocuklar kendilerini bir oyunda gibi görüp silahı ateşleyebilirler, bir çok film ve oyunda bu tarz silahlar konusunda kötü örnek teşkil ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 25, 2022, 09:38:22 AM",
      "body": "18 yaşını doldurmus bir birey istediği gibi av tufegi alabilir.  Av tüfeği aldı diye herkesi öldürecek diye birşey mi var veyahut bir tecavüzcü düşünün o tecavüz etti diye bütün erkekler tecavüzcü mu olacak.Bırakın abi bireysel sillahlaanin değil yanlış eğitimin sonuçları bunlar..Bende araba var İstanbul'un göbeğinde karşıdan karşıya geçen insanları ışıklarda bicebilirim.ozamanda bireyse araclanma sonucu mu diyeceksiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "May 25, 2022, 10:23:09 AM",
      "body": "Quote from: mandown on May 25, 2022, 09:38:22 AM18 yaşını doldurmus bir birey istediği gibi av tufegi alabilir.  Av tüfeği aldı diye herkesi öldürecek diye birşey mi var veyahut bir tecavüzcü düşünün o tecavüz etti diye bütün erkekler tecavüzcü mu olacak.Bırakın abi bireysel sillahlaanin değil yanlış eğitimin sonuçları bunlar..Bende araba var İstanbul'un göbeğinde karşıdan karşıya geçen insanları ışıklarda bicebilirim.ozamanda bireyse araclanma sonucu mu diyeceksiniz.Bu örnek bu konuya uymamış. Silahın asıl amacı öldürmek, zarar vermekken taşıtların amacı bir yerden bir yere gitmektir. Biri asıl amacı doğrultusunda kullanıldığında biriyse kötüye kullanıldığında ortaya çıkan sonuç. Amerika'da Walmart'ta bile silah satılıyor silahlara ulaşmak bu kadar kolay. Tabi bunun sonuçları da felaket oluyor ve bu mass shooting olayları tüm ülkece kanıksanmış durumda. Sırf yanlış zamanda yanlış yerde bulunduğunuz için öldürülebilirsiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 26, 2022, 05:01:17 AM",
      "body": "Öldüren şey sadece silah değil, bunu anlatmaya çalışıyorum. Kıbrıs'ta cep telefonunu hattını sakız alır gibi alıyorsunuz ama kimse kimseyi taciz ettiğini görmedim. Hocam adam öldürmek istedikten sonra silaha gerek yok bunu anlatmaya çalışıyorum.Hatırlarsanız ordu ve bölgesini hatırşamadığım bir yerde sadece evine gidiyor diye öldürülen insanlar oldu. Bizde durum daha kötü okullara elini kolunu sallaya sallaya girebilirsin. Her türlü ssit vs ile istediğin katliamı yapabilirsin bırak okulda bir ürün dağıtsan bu napıyor düğün çıkmaz. Silahın amacı insan öldürmek gibi görülsede bana göre değil. Sonuçta korunmanız gereken durumlar olabilir. Öldürmek isteyen biri için kalem bile silah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "May 26, 2022, 10:57:32 AM",
      "body": "Twitch yayını yaparak markette katliam yapan biri vardı. Yalnızca siyahları öldürmüş. Bir manifesto da yayınlamış konu hakkında. Beyaz üstünlüğünü öne sürerek yapmış katliamı. Bireysel silahlanmayı bazen ihtiyaç gibi görüyorum. Ama yaşanan katliamlardan sonra bireysel silahlanmanın yanlış olduğunu görüyorum. Ve son kararım olumsuz oluyor. Psikoloji testlerinin neredeyse hiçbiri güvenilir değil çünkü. Size sorulan sorulara istediğiniz gibi cevaplar verebilirsiniz. Testi yanıltabilirsiniz. Suça eğilimi olan bireyler istediğini yapar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "May 26, 2022, 11:58:18 AMLast edit: May 26, 2022, 12:13:44 PM by Lachrymose",
      "body": "Quote from: Ondekinecakabilirim on May 26, 2022, 10:57:32 AMTwitch yayını yaparak markette katliam yapan biri vardı. Yalnızca siyahları öldürmüş. Bir manifesto da yayınlamış konu hakkında. Beyaz üstünlüğünü öne sürerek yapmış katliamı. Bireysel silahlanmayı bazen ihtiyaç gibi görüyorum. Ama yaşanan katliamlardan sonra bireysel silahlanmanın yanlış olduğunu görüyorum. Ve son kararım olumsuz oluyor. Psikoloji testlerinin neredeyse hiçbiri güvenilir değil çünkü. Size sorulan sorulara istediğiniz gibi cevaplar verebilirsiniz. Testi yanıltabilirsiniz. Suça eğilimi olan bireyler istediğini yapar.Beyaz üstünlüğünü öne süren bir saldırı değil o. Beyazlar diğer milletlerden daha fazla “milli” duygulara sahip olduğu için dönen dolabın farkına ilk onlar vardı. Bizde o akil olmadigi için ülke çöp kutusu oldu ve olmaya da devam edecek.Küresel kötülüğün fikir babası azınlık bir siyonist grup, finansal sistem ve enternasyonal şirketler aracılığıyla kendine tutsak edip tekeline aldığı dünya milletlerini göç, medya ve stklar aracılığıyla kültürel soykırıma uğrattığı için o milletlerin çocuklarından birinin aldığı bir aksiyon bu. Doğru ya da yanlış, vahşi ya da korkutucu fark etmez; zaten ideolojiler ustu, demokrasi ustu bir olay var burada.Onların oluşturduğu borca-dayalı ekonomik sistem bütün dünyayı tekeline almış, adamlar musluğun başına geçmiş seni beni hamster wheelde koşturup asla gerçekleşmeyecek rüyalara inandırıyorlar. Siz hayal görürken onlar toplumunuzun altına dinamit koyuyor.Bundan otuz sene sonra çocuklarin işini robotlar devraldığında, küresel sirketlerin oluşturduğu tiranlıkta işsizliğin getirdiği öfkeyle sosyal medyada bile \"aksi fikir\" ifade edemeyen çocuklar kafasına sıktığında anlarsınız nasıl bir distopyaya doğru koştuğumuzu.Yıllardır beyaz ustunlugu diye yutturmaya calistilar bu saldirilari. Mesele finans sisteminin kendisiyle alakalı. Manifestoda CTRL + F basip gold yaz. Olay ozunde finansal sisteme baskaldirildir. Kime oy verdiginin onemi yok, borca-dayali ekonomik sistemde her birey, her devlet köle. Bir demokrasi halisunasyonu almis basini gidiyor. Ekonomik sistem bozuk kardeşim. Dünya’nın tek gerçek para birimi özünde altın. Dolarini satan MB gorursun ama altinini satan MB goremezsin. Her MB altin stoklar. Kagit paralarin bir karsiligi yoktur. Bitcoin ise Satoshi’nin de dedigi gibi elektronik para sistemidir. Deneydir. Gelecekte gerçekten dijital gold olabilir, belki de öyledir. Bitcoin de özünde bu finansal sisteme bir bas kaldiridir. Silahsiz olanidir. Şiddete gerek kalmadan büyümüştur.Şimdi gelelim asil meseleye. ABDlilerin elinden silahini alamazsiniz. Vermezler. O ülkede gerekirse devletle halk catisir yine de kimse silahini vermez. Silahini vermek demek, kendini bir bilinmeze emanet etmek demek. ABD’deki silahlanma zaten kendini bilinmezden koruma amacı taşır, savunma amaçlıdır.Not: Mesajim bu baslikta yapilan saldiri ile ilgili değil, alintiladigim kisinin bahsettigi bir onceki saldiridaki manifesto ile ilgili. Manifestoyu okuduğum için detaylari aktariyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "May 26, 2022, 01:03:04 PM",
      "body": "Quote from: Lachrymose on May 26, 2022, 11:58:18 AMBeyaz üstünlüğünü öne süren bir saldırı değil o. Ben manifestoyu okumadım. Haberde saldırganın beyaz üstünlüğünü savunan biri olduğu söyleniyor.ABD medyasına göre 180 sayfa olduğu belirtilen ve saldırganın yazdığına inanılan manifestoda, \"siyasi elitlerin beyaz nüfusu azaltmak için göç ve diğer politikaları kullandığı belirtiliyor ve saldırganın mümkün olduğu kadar çok siyahiyi öldürme planı\" yer alıyor.Manifestoda saldırgan, kendisini \"faşist, beyazların üstünlüğünü savunan biri ve ırkçı\" olarak tanımlıyor.https://tr.euronews.com/2022/05/15/abd-de-rkc-sald-r-siyahlar-hedef-alan-sald-rgan-10-kisiyi-oldurdu-sald-r-y-canl-yay-nladSiyasi elitler beyaz nüfusu neden yok etsin. Hastalıklı bir düşünce. Saplantılı insanlara saldırgan düşünceler empoze edilerek toplumsal kaos oluşturuluyor. Kozmopolit yaşamı sevmeyebilirsiniz. Ama bu kavram bugün küresel elitler tarafından yaratılmadı. Binlerce yıl önce yaratılan bir kavram.Bireysel silahlanmaya karşı olmamı sağlıyor bu olaylar. Akıl sağlığı yerinde olmayan biri kolayca silaha erişememeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "May 26, 2022, 05:28:52 PM",
      "body": "Türkiye'de isteyenler resmi olmayan yollardan parası olsun her türlü silah bulabilir.  El altından silah satanlar mutlaka vardır. İş silah ise eğer tüfek olayı var. Avcılık ruhsatı olmaksızın tüfek alınabilir 18 yaş üstü. Denetimin olduğunu zannetmiyorum. ben çocukken evde ki tüfek ile çok ava gittim ama artık o devir geride kaldı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "May 26, 2022, 06:22:27 PM",
      "body": "Quote from: ajanwalker on May 26, 2022, 05:28:52 PMTürkiye'de isteyenler resmi olmayan yollardan parası olsun her türlü silah bulabilir.  El altından silah satanlar mutlaka vardır. İş silah ise eğer tüfek olayı var. Avcılık ruhsatı olmaksızın tüfek alınabilir 18 yaş üstü. Denetimin olduğunu zannetmiyorum. ben çocukken evde ki tüfek ile çok ava gittim ama artık o devir geride kaldı. Artık evdeki tüfekler ile ava gittiğinizde jandarmaya yakalanırsanız cezası çok büyük diye biliyorum emin olmamakla birlikte. Bu yüzden ruhsatsız tüfek işini bırakırsak iyi olur bence hocam. Tabi ki silah edinmek isteyen bir yolunu bulup mutlaka silah edinir ancak bu doğru bir şey değil. Silahın gerekli olup olmadığı konusunda emin değilim. Bana göre kimse de olmazsa sorun yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "May 26, 2022, 06:34:29 PMLast edit: May 27, 2022, 12:06:02 AM by Lachrymose",
      "body": "Quote from: Ondekinecakabilirim on May 26, 2022, 01:03:04 PMQuote from: Lachrymose on May 26, 2022, 11:58:18 AMBeyaz üstünlüğünü öne süren bir saldırı değil o. Ben manifestoyu okumadım. Haberde saldırganın beyaz üstünlüğünü savunan biri olduğu söyleniyor.ABD medyasına göre 180 sayfa olduğu belirtilen ve saldırganın yazdığına inanılan manifestoda, \"siyasi elitlerin beyaz nüfusu azaltmak için göç ve diğer politikaları kullandığı belirtiliyor ve saldırganın mümkün olduğu kadar çok siyahiyi öldürme planı\" yer alıyor.Manifestoda saldırgan, kendisini \"faşist, beyazların üstünlüğünü savunan biri ve ırkçı\" olarak tanımlıyor.https://tr.euronews.com/2022/05/15/abd-de-rkc-sald-r-siyahlar-hedef-alan-sald-rgan-10-kisiyi-oldurdu-sald-r-y-canl-yay-nladSiyasi elitler beyaz nüfusu neden yok etsin. Hastalıklı bir düşünce. Saplantılı insanlara saldırgan düşünceler empoze edilerek toplumsal kaos oluşturuluyor. Kozmopolit yaşamı sevmeyebilirsiniz. Ama bu kavram bugün küresel elitler tarafından yaratılmadı. Binlerce yıl önce yaratılan bir kavram.Bireysel silahlanmaya karşı olmamı sağlıyor bu olaylar. Akıl sağlığı yerinde olmayan biri kolayca silaha erişememeli.burası bitcointalk, uçuk kaçık fikirlerin yoksa forumu kullanmicaksin abi :d.13 sene önce satoshi’nin varolan finans sistemine atom bombası attığı forumda normal adam istemiyoruz :d. %1lik elit kesime inanmiyosaniz, usd’nin rezerv para birimi olmasindan rahatsız değilseniz bitcoin ile ne ilginiz olabilir. biz burada merkezsiz finansın peşindeyiz. o ölmüş, bu kalmış çok umurumda değil.uç fikirleri severim, en sevdiğim uç fikir bitcoin’in ta kendisi zaten. biz de bitcoin sevdasına düştük bu distopik düşüncelere, hortum ekonomisinin farkına vardık, devletler paranın nereye akmasını istiyosa paranın oraya aktigini gorduk.sonra öfkelendik çünkü ortada bir pasta oldugunu ve devletlerin para basıp senin pastanı senden izin almadan çaldığını fark ettik. sonra bir de zorba devlet vardi (abd) o da gelip senin devletine ağaç parçası verip bi tur da o çalıyodu.bence bu manifestolar özünde beyaz ustunlukcu degil, anti-semitik, benim gozumde bitcoin whitepaperden farklari yok. ve sunu belirtmek isterim, bu postu editledim cunku cani biri gibi gozukmek istemedim. cani biri degilim sadece bizden calinanlari geri istiyorum. bu ekonomik sistemin fazla merkezi, hatta tekel olduguna inaniyorum. bu durumdan rahatsizim; abd dolarinin ustunde çok kan oldugunu dusunuyorum, kağıt para küresel kötülüğün tanimidir benim için.ha dolarim var mi? var. ama long-termde dolarin suratina bile tukurmem ben. cocuguma dolar birakmam mesela. toprak birakirim, altin birakirim, bitcoin birakirim ama dolar birakmam. bi degeri yok cunku.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "May 26, 2022, 07:22:35 PM",
      "body": "Bu saldırının merkezinde de siyahilere karşı olan ırkçılık ve nefret yoktur diye umut ediyorum. Geçtiğimiz günlerde ABD'nin Buffalo eyaletinde bir süpermarkette manyağın birisi gördüğü tüm siyahileri taramıştı. Hatta yanlışlıkla beyaz olan birine silah çekince \"Sorry\" diyip geçmişti falan. Üzerinden daha çok bir zaman geçmeden böyle bir olay daha yaşandı. Böyle olayların haberlerini okudukça hem sinirleniyorum hem üzülüyorum. Bireysel silahlanmanın getirdiği serbestlik yüzünden canı isteyen gidip istediği yeri tarayabiliyor. Yahu küçücük çocuklardan ne istediniz!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "May 26, 2022, 09:37:25 PM",
      "body": "Güvenlik amacıyla bireylerin silahlanması yerine silahlanmayı gerektirmeyecek ölçüde toplum güvenliğini sağlamak daha iyi olur. Bireysel silahlanmada silah tüccarlarından başka kimse kazanmaz. Belki başkaları da kazanır ama en çok onlar kazanır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ekiller",
      "created_time": "May 28, 2022, 02:05:03 AMLast edit: May 28, 2022, 02:27:46 AM by ekiller",
      "body": "Bazı entelektüel takılan man kafa tipler, \"ayyy ben bireysel silahlanmaya karşıyım, noolur ortalıkta kimsede silah görmeyeyim\" tiriplerinde ortalıkta dolaşır. Bunlar sözde silaha, dolayısı ile de şiddete karşıdır. Ama bu salaklar bilmezler ki dünyada silah diye bir şey icat edilmiş ise o namlu bir gün mutlaka kendilerine veya onların sevdiklerine, ailelerine dönecektir.  Ve o an geldiğinde ellerinde bir silahları yok ise, gözüne fener tutulmuş tavşan gibi kalacak, elinde silahı olandan merhamet dilenen bir ite dönüşeceklerdir.Merhamet dilenen bir it olmaktansa eşit şartlarda savaşarak geberen yada geberten biri olmayı tercih ederim.Ve o an geldiğinde, (Ki bir gün gelecek) Bu entelektüel kuklalar, \"Keşke benimde silahım olsaydı\" diyecekler. Hmmm şimdi gelelim...... NEDEN ?  Çünkü silah, güç dengesini bozar. Çünkü silah varsa, mertlik yoktur. Çünkü silah, delikanlıyı deler geçer. Bir söz der ki; Bir tiyatro sahnesinde duvarda asılı bir silah varsa, oyun bitmeden o silah mutlaka patlar. Silah patladığında namlunun önünde mi arkasında mı olmak istersin o senin tercihin.  Ama bireysel silahlanmaya karşı olmak gibi salakça saçma bir şey duymadım.  Silahlanmaya karşı olmak savsatası ile silahlanmaya karşı olamazsın. Çünkü o silah mutlaka birilerinde olacak. Sen, sende olmamasını tercih edebilir ve rahatça, savaşmadan, hiçbir şansın olmadan, bedavaya  geberebilirsin. Bu senin tercihindir.Koyunun kurt karşısında hiçbir silahı yoktur. Biri avdır biri avcı .   Birinin kaderi pirzola olmaktır.   Sana pirzola olmama şansı sunuluyor ve sen bunu geri çeviriyorsan bu senin tercihindir.Silahlanmak, canın sıkıldığında yada 2 bira içtiğinde serserilik yapıp birilerinin kafasına sıkmak değildir. O insanları bozan silah değil kendi ezik, çaresiz dünyalarıdır. Uzun lafın kısası  silah yaşam ile ölüm arasında ki en belirleyici çizgidir. Ve dünyada silah diye bir şey varsa, bende de olmalıdır.  Çünkü ben kancanın ucunda ki solucan olmak istemem. Beni korusun diye de, başka silahlı güçlere güvenmek ve muhtaç kalmak istemem. Ben geberdikten sonra gelip, zabıt tutarak maaş alanlara hayatımı teslim edemem. Yeterince açık anlattım sanırım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "May 28, 2022, 05:37:42 PM",
      "body": "Amerika ile ilgili okuduğum bir makalede dünyada haritada ülkesini bulamayan tek ülke diye tanımlıyordu. Eğitimsiz ve cahil rednecklerin bireysel silahlanma özgürlüktür diyerek sürekli psikopat ve manyakların eline silah alıp masum insanları katletmesine sebep olmaktadır. Bireysel silahlanma getirdiği tek özgürlük bazı psikopat ve manyaklara yem olmaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "May 31, 2022, 09:46:14 AM",
      "body": "Quote from: Lachrymose on May 26, 2022, 06:34:29 PMbence bu manifestolar özünde beyaz ustunlukcu degil, anti-semitik, benim gozumde bitcoin whitepaperden farklari yok. ve sunu belirtmek isterim, bu postu editledim cunku cani biri gibi gozukmek istemedim. cani biri degilim sadece bizden calinanlari geri istiyorum. bu ekonomik sistemin fazla merkezi, hatta tekel olduguna inaniyorum. bu durumdan rahatsizim; abd dolarinin ustunde çok kan oldugunu dusunuyorum, kağıt para küresel kötülüğün tanimidir benim için.Manifestoda beyaz üstünlükçülük vurguları var haberde yazılana göre. Cani markette bir adamı beyaz olduğu için vurmadı. Videoda bu detay var. Saldırı bana göre beyaz üstünlükçülük belirtileri barındırıyor. Kağıt paranın sahibi beyaz adam. Markette masumları tarayan adam beyaz adam. Beyaz adam kağıt para sistemine karşı çıkmak için beyaz olmayan masumları mı vurdu.  Ben renk ayrımı yapmayı yanlış buluyorum. Ama beyaz üstünlükçülük renk ayrımı yapıyor.ABD demokrasisi ve beyaz üstünlükçü fikirlerin dışında fikirlerin olduğuna inanıyorum. Demokratım bu konuda. Evrensel değerlere değer veriyorum. Bireysel silahlanmaya da tam karşıt değilim. Ama çok kötü örnekler var. Saygılar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}