{
  "id": "topic_5434097",
  "title": "mobiledata",
  "author": "mobiledata",
  "created_time": "January 11, 2023, 10:45:20 AM",
  "content": "Hi, Everyone, I am a student. I don’t know about bitcoin.Always I hear about bitcoin. So,to know about this, I want your help guys.I saw my uncle he everytime stay busy on bitcoin.How can I know more about bitcoin? What is this?When & How it use? Why this is invented?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434097",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "January 11, 2023, 10:57:55 AM",
      "body": "How can I know more about bitcoin?You have started at the right place. Spend some time every day reading through the informative boards and you will get a taste of all kinds of knowledge. You should also read the bitcoin whitepaper which will help you answer your last question, \"why is this invented?\"What is thisBitcoin is a digital currency deployed on top of a blockchain ledger. It uses the Proof of Work consensus algorithm to provide a viable economic incentive model that helps to validate \"blocks\", which includes transaction data that has been broadcasted to the network. It is powered by peers or nodes, who connect to the network and validate that the information broadcasted to it is correct and valid. The blockchain ledger itself is immutable, meaning no one can tamper with its history, and the network is decentralized, meaning no central entity can control whether or not it is online or offline. To take bitcoin or any truly decentralized blockchain down, you need to turn every computer/node connected to it offline. To change the history of the transactions/data, you need to control more power than all of the network combined. These are both nearly impossible tasks, and have not been successfully done (at least in a very damaging way) to date.  When & How it use?You can start by downloading a bitcoin wallet. This will let you send and receive bitcoin. After that, you can use any of the array of options to buy some bitcoin and send it over to your wallet, where you can store it or spend it. Don't send bitcoin unless you know for certain where it is going! Malicious people, groups, companies and websites are always trying to find ways to take peoples bitcoins due to its irreversible nature. Once you send Bitcoin, there is no way of getting it back.Why this is invented?Great question. At its core, Bitcoin was a response to centralized banking systems which have displayed to us hundreds of thousands of times, are not good for the people. Most notably during the Global Financial Crisis in 2008, the same time Bitcoin was created, the centralized banking/fiat money system proved to be terrible for people, and only good for the wealthy. Bitcoin was invented to give financial sovereignty back to the end user. It was invented to bring back some freedoms that have been lost during the rise of the global financial system. Most importantly, it was created as a tool to try and protect the world's people and their future from tyranny. Who do we thank for this creation?Satoshi Nakamoto. An individual or group who is yet to truly be discovered, and probably never will.If you want to learn more about Bitcoin, I highly recommend that you start off by reading the Individuals section of bitcoin.org in full, followed by the rest of the website. Then, come back here and look for any more questions you have, or post them!I wish you all of the best on your Bitcoin journey, I hope it is fulfilling for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "January 11, 2023, 11:04:08 AM",
      "body": "Since you say you are a student, it shouldn't be a problem for you to learn things on your own. Especially nowadays, when almost all information can be obtained with a few clicks of the mouse. (Imagine having to read books to learn new things...  )Want to learn more about Bitcoin and to be a Bitcoin boss? Start by reading the legendary Bitcoin whitepaper written by none other than Satoshi Nakamoto himself. For more current affairs, check out websites like Bitcoin.org, Coindesk and Bitcoin Magazine, they're like the CNN of the crypto world. And lastly, to truly level up your knowledge join online forums and communities, like this one, rub shoulders with the experts and ask away, it's like attending a virtual cryptocurrency university!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 11, 2023, 11:05:56 AM",
      "body": "Quote from: Marvelman on January 11, 2023, 11:04:08 AMFor more current affairs, check out websites like Bitcoin.org, Coindesk and Bitcoin Magazine, they're like the CNN of the crypto world.+1 for Bitcoin Magazine, they are an amazing publisher.-1 for Coindesk. I have read a lot of shit articles there. You are right in saying that coindesk is like the CNN of the crypto world though, considering most of CNN is shit too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mobiledata",
      "created_time": "January 11, 2023, 11:09:36 AMLast edit: January 11, 2023, 11:30:28 AM by mobiledata",
      "body": "Thanks for information. I have already started to read about bitcoin whilte paper.I have now understand a little bit about bitcoin. I will try my best🥰🥰🥰.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 11, 2023, 11:26:05 AM",
      "body": "This should keep you busy for a while. Also reminder that you're free to use Google.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://cryptosec.info* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "January 11, 2023, 01:22:37 PM",
      "body": "Quote from: mobiledata on January 11, 2023, 10:45:20 AMHow can I know more about bitcoin? What is this?When & How it use? Why this is invented? You’re a student. You should know how to use a search engine on the web to find out and read more about those questions. That’s the least you could first do before you come on here and ask what you don’t still understand after reading. It’s better to read, research things and get an opinion for yourself and not allow someone feed you their own thoughts and opinions about things. That is what I’d expect from a student. Welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "January 11, 2023, 01:51:26 PM",
      "body": "Quote from: mobiledata on January 11, 2023, 10:45:20 AMHi, Everyone, I am a student. I don’t know about bitcoin.Always I hear about bitcoin. So,to know about this, I want your help guys.I saw my uncle he everytime stay busy on bitcoin.How can I know more about bitcoin? What is this?When & How it use? Why this is invented? Welcome to the Bitcointalk Forum, where you will find all answers to your questions about Bitcoin and cryptocurrency in general.You can learn more about Bitcoin here, as well as all the other recommendations made by other forum members here; I just want to add one for your ease of learning and understanding.learnmeabitcoin.com will assist you in gaining fundamental knowledge of Bitcoin, keys and addresses, and the various techniques governing blockchain technology and Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AML Soap",
      "created_time": "January 11, 2023, 02:58:04 PM",
      "body": "Quote from: mobiledata on January 11, 2023, 10:45:20 AMHi, Everyone, I am a student. I don’t know about bitcoin.Always I hear about bitcoin. So,to know about this, I want your help guys.I saw my uncle he everytime stay busy on bitcoin.How can I know more about bitcoin? What is this?When & How it use? Why this is invented? Have you looked up some of the really old threads here at the forum? Early 2011 and before, you will find amazing threads with \"really smart people\", and no theft or massive greed. Learning from some of those old threads can be a great experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "akuntester1",
      "created_time": "January 11, 2023, 08:23:52 PM",
      "body": "Quote from: mobiledata on January 11, 2023, 10:45:20 AMHi, Everyone, I am a student. I don’t know about bitcoin.Always I hear about bitcoin. So,to know about this, I want your help guys.I saw my uncle he everytime stay busy on bitcoin.How can I know more about bitcoin? What is this?When & How it use? Why this is invented? Hi OP,I am very happy to see students who are enthusiastic about Bitcoin.If you want to know more about Bitcoin you just have to take the time to read.Expand your insight from various sources whether it's from reading books about Cryptocurrency / Bitcoin,or from online articles on the internet that explain what Bitcoin is.Joining this forum is also a good step because here you will see various discussions about Bitcoin.I hope you can also ask your uncle to teach you directly because your uncle first entered the Bitcoin world.That is very profitable for you because your uncle is indirectly a source of knowledge for you too.Have a little time with your uncle and learn directly from people who are already in the world of Bitcoin.Your uncle will probably be more able to direct and teach you directly about Bitcoin knowledge and beginner risks to avoid.Excited to finish education soon and welcome to join this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "January 11, 2023, 08:39:32 PM",
      "body": "Quote from: mobiledata on January 11, 2023, 10:45:20 AMBest move you've made thus far is finding your way to the forum. For that I would say a big welcome to you and hope that your stay here be a pleasing one.You've got a lot of questions and it's important that, you take it a little bit slower I would suggest. It's good coming as a blank slate and that means, you are teachable and you seem eager to learn as well. Give yourself the time you need and don't shy away from anything crypto related. When you see something related with bitcoin, read them and make meaning off them. Search out the meaning of terms used and you just might get in line with your need to know.Why Bitcoin is invented?You can as well take your own reasons but, its mainly to ensure peer 2 peer services without any interference from the government. It helps t ensure quicker transactions across the globe and a more digital operation in finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}