{
  "id": "topic_5447359",
  "title": "coinremitter",
  "author": "coinremitter",
  "created_time": "April 03, 2023, 08:26:25 AM",
  "content": "There are lots of cryptocurrency payment gateways. Each of them have different processing fees and transaction fees. some of them charge 1% to 5% fees on each transaction. which is a huge amount but merchants have to pay this amount. But there are payment gateways who charge the lowest amount like, one payment gateway only charges 0.23% processing fees on transaction. I find it very attractive because merchants will get more from it and it will be more beneficial for them eventually.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447359",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "April 03, 2023, 08:36:47 AM",
      "body": "Quote from: coinremitter on April 03, 2023, 08:26:25 AMThere are lots of cryptocurrency payment gateways. Each of them have different processing fees and transaction fees. some of them charge 1% to 5% fees on each transaction. which is a huge amount but merchants have to pay this amount. But there are payment gateways who charge the lowest amount like, one payment gateway only charges 0.23% processing fees on transaction. I find it very attractive because merchants will get more from it and it will be more beneficial for them eventually.Of course it is. Nobody likes to pay fees. The smaller the fee is, the better is (unless you are the one that makes a living from earning them fees) When I am withdrawing my coins from an exchange, I always use the crypto with the cheapest withdrawal fee. Binance is making less money but do I give damn? No, because thanks to this decision, I am losing less money. For these reasons, doge and ltc are my favorites lately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 03, 2023, 08:38:51 AM",
      "body": "Quote from: coinremitter on April 03, 2023, 08:26:25 AMsome of them charge 1% to 5% fees on each transactionThis is bitcoin and cryptocurrencies, fees are not based on percentage. Like bitcoin, it is based on your transaction input, output, how congested the mempool is and the price of bitcoin.Quote from: mindrust on April 03, 2023, 08:36:47 AMWhen I am withdrawing my coins from an exchange, I always use the crypto with the cheapest withdrawal fee...For these reasons, doge and ltc are my favorites lately.Withdraw or pay? You withdraw to your wallet. But you pay people, which means not your wallet. You withdraw because of low fee. Not how you see a coin to be? Or you mean you pay? Litecoin and doge fees are cheap on Binance and many other exchanges, but they are not the cheapest. Although most coins with cheapest fee like you paid no fee have low or no utility.Marchants are using or use bitcoin using noncustodial wallet, not to use or using exchanges that charges exorbitantly. Exchanges are charging fee exorbitantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "April 03, 2023, 09:14:31 AM",
      "body": "@Op, Are you talking about your platform?The centralized service processing fee always talks about a percentage, it's just a custom fee that dynamically changes from time to time due to competitiveness. For established payment processor apps it may make sense to charge more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 03, 2023, 09:20:10 AM",
      "body": "Profit from transactions is one of the things that you should consider because if you have a lot of transactions, you will earn more. This is the case if you are the owner of the processor, but if you are the seller, you would want lower because you want more of the percentage of the goods you have sold. Aside from this, I think it is important to have the instantaneous transaction not just the fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "April 03, 2023, 09:32:38 AM",
      "body": "Quote from: coinremitter on April 03, 2023, 08:26:25 AMThere are lots of cryptocurrency payment gateways. Each of them have different processing fees and transaction fees. some of them charge 1% to 5% fees on each transaction. which is a huge amount but merchants have to pay this amount. But there are payment gateways who charge the lowest amount like, one payment gateway only charges 0.23% processing fees on transaction. I find it very attractive because merchants will get more from it and it will be more beneficial for them eventually.Depends on whether I am getting proper services for the fees I am paying or not. For example, assume X payment provider who is giving you services like a free PoS machine, mobile applications for easy slip generations, a tool to manage billers, and archives of every kind. If this is included then obviously I am ready to pay a decent amount of fees. I will just consider it as a charge for additional services that I am availing of from the payment processing company. If I am just paying fees and getting nothing in return then I am sorry I would just prefer wallet to wallet transfer. I would literally just ask my client to either scan the QR code of my address or simply paste them through the bin. It's just simple logic. This is decentralized space, why would I pay someone that much if I am not getting any services in return?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "April 03, 2023, 12:21:10 PM",
      "body": "If it's a centralized crypto payment solution, they charge their fees in percentage based on the monthly transaction volume (I took a look at Bitpay as an example). I assume traditional solutions charge merchants similarly? If you mean not using a centralized payment processor but instead having customers send funds directly to a Bitcoin address, then the merchant doesn't pay any fees, which is wonderful for the merchant. However, the fees fall upon customers, and as was mentioned in the thread, it's not in percentage. So the fee might seem minor for a big purchase but significant for a small purchase. And given that customers aren't used to paying fees when buying things, it can be very off-putting to them and thus not very good for business even if technically beneficial to merchants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "April 03, 2023, 12:40:28 PM",
      "body": "Quote from: coinremitter on April 03, 2023, 08:26:25 AMThere are lots of cryptocurrency payment gateways. Each of them have different processing fees and transaction fees. some of them charge 1% to 5% fees on each transaction. which is a huge amount but merchants have to pay this amount. But there are payment gateways who charge the lowest amount like, one payment gateway only charges 0.23% processing fees on transaction. I find it very attractive because merchants will get more from it and it will be more beneficial for them eventually.Lower processing fees will be always beneficial for the merchants for obvious reasons. Whenever merchants are allowed to keep the maximum amount from a transaction, it's great for them and certainly increases profitability. In my country, we have fiat payment gateways that allows merchants to receive payments for free. Crypto space is quite new so it's highly unlikely to happen anytime soon. But we need to understand why crypto can't become a preferred choice for payment, it requires both parties to pay a fees to make a transaction happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "April 03, 2023, 12:48:17 PM",
      "body": "Quote from: coinremitter on April 03, 2023, 08:26:25 AMThere are lots of cryptocurrency payment gateways. Each of them have different processing fees and transaction fees. some of them charge 1% to 5% fees on each transaction. which is a huge amount but merchants have to pay this amount. But there are payment gateways who charge the lowest amount like, one payment gateway only charges 0.23% processing fees on transaction. I find it very attractive because merchants will get more from it and it will be more beneficial for them eventually.I wouldn't mind if I don't have to pay any fee when making payments and I'm sure no one loves to pay fees.And I was first talking about the transaction fees associated with sending of Bitcoin (Bitcoin transactions) and the fees has been one of the major reasons I've not been Interested in having to send Bitcoin to someone else and I would rather prefer to withdraw to fiat and then send it to the receiver if it's in my country or I rather send usdt or BUSD with a zero fee.Since Bitcoin is still very new, it will take much more longer time to get payment gateways with free transactions fees, except government intervenes which I'm sure no one wants that aswell",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "April 03, 2023, 02:58:06 PM",
      "body": "Quote from: coinremitter on April 03, 2023, 08:26:25 AMThere are lots of cryptocurrency payment gateways. Each of them have different processing fees and transaction fees. some of them charge 1% to 5% fees on each transaction. which is a huge amount but merchants have to pay this amount. But there are payment gateways who charge the lowest amount like, one payment gateway only charges 0.23% processing fees on transaction. I find it very attractive because merchants will get more from it and it will be more beneficial for them eventually.The thing is very simple and logical, if you think you're ok with the ones with lesser fees on transactions then choose them, but on a real sense, we are likely to have it this way that if you weigh and compare the low trans charges gateways from the high ones, literally you will discover that those that have lesser charges tend to have more traffic than the ones with high fees, also it is better to always run a transaction with lower charges but frequent and consistent than running a high charges with no patronage for the service, which means, little profits can accumulate to something big if we choose to consider others than our own interests first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelechi",
      "created_time": "April 03, 2023, 03:15:47 PM",
      "body": "low fees and fast speed really attracts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "April 04, 2023, 02:41:45 AM",
      "body": "Quote from: coinremitter on April 03, 2023, 08:26:25 AMThere are lots of cryptocurrency payment gateways. Each of them have different processing fees and transaction fees.They are operating their payment gateways for business that actually have operational cost so they have to balance that cost with income, to maximize their profit.Those services can be the same or different at different payment gateways as well as different blockchains. They have to proceed on-chain transactions and each blockchain has different native currency for transaction fee. Ethereum blockchain has most expensive transaction fee because of high demand on that chain, its bad design and high price of Ethereum $ETH.However it won't stop people using Ethereum ERC-20 chain for transactions. Last but not least, they have options to choose, from blockchains to payment gateways and you are free to make their choices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 04, 2023, 04:42:15 AM",
      "body": "Since you asked that probably you are into brewing your business and trying to get an idea about possible fees. Yes low processing fee could benefited merchants since they after the salea right and having a smaller fees means more customer cause they look into it as well. But this is depend, maybe if you are a start up that needs considerable fee to have some decent earning then good. There are operational cost to look at as well and should be on the list to consider on how you could do a very stable system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "April 04, 2023, 04:55:04 AM",
      "body": "The goal is actually to get to a place where merchants (and others) don't have to use a third party like payment processors to handle their payments. In other words the answer to your question is to not have these third parties in first place to change any fees at all!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "April 04, 2023, 05:07:44 AM",
      "body": "Quote from: pooya87 on April 04, 2023, 04:55:04 AMThe goal is actually to get to a place where merchants (and others) don't have to use a third party like payment processors to handle their payments. In other words the answer to your question is to not have these third parties in first place to change any fees at all!Trust middle man is always bad because two trade partners will both lose if the middle man runs away or the service simply unavailable because of insolvency or bankruptcy.Trusting middle man payment processors in cryptocurrency like trusting banks will proceed our transfers with our fiat currency deposited in our accounts be safe forever. We can deposit money to our account today, plan for tomorrow trade and tomorrow we wake up with a bankruptcy news.Bitcoin is designed for peer-to-peer transfers without middle men to hold our coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "April 04, 2023, 06:28:27 AM",
      "body": "Quote from: pooya87 on April 04, 2023, 04:55:04 AMThe goal is actually to get to a place where merchants (and others) don't have to use a third party like payment processors to handle their payments. In other words the answer to your question is to not have these third parties in first place to change any fees at all!But this third parties could easily make the transactions smooth and more secured that why most of businesses where it includes money, they will use such apps to make the transactions uncomplicated. Of course they have fees since they couldn't operate without funds, they give services for you to have a convenient payments or any kind of transaction. It wouldn't be hassle for the merchant to have transaction 1 by 1 especially if you have customers that are more than 1000+ a day. Maybe if you have only few people that having kind of transactions everyday then third parties wouldn't be necessary for you to gain more profit with no fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 04, 2023, 07:00:02 AM",
      "body": "Quote from: kryptqnick on April 03, 2023, 12:21:10 PMIf you mean not using a centralized payment processor but instead having customers send funds directly to a Bitcoin address, then the merchant doesn't pay any fees, which is wonderful for the merchant. However, the fees fall upon customers, and as was mentioned in the thread, it's not in percentage.The merchant wills still have to pay extra.He will receive thousands of inputs that he must either consolidate or send to another address to pay its suppliers if he can do that in BTC or to cash out in $ if that's his only option so roughly he will still need to pay almost the same as the client in order to use that money.It's a small thing everyone forgets but if you're looking at hundreds of small-value transactions he might end up paying more than 1%, way more, on top of what the client pays so it will lose any advantage over other payments. Clearly LN is the answer here not on-chain tx.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rupok",
      "created_time": "April 04, 2023, 08:29:39 AM",
      "body": "I think lower processing fees can be more beneficial for merchants.  For example ERC-20 has the most expensive transaction fees on the Ethereum blockchain due to its high price, but the BEP-20 network has the lowest transaction fees on the blockchain.So when we transact from wallet to wallet the fee is very low, but when we transact from wallet to exchanger, the fee is high.The disparity in transaction fees can be noticed here.I think it has a lot of implications for merchants. Their operations are essentially managing their payment gateways for merchants.On balance, I think lower processing fees would benefit merchandisers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "April 04, 2023, 08:50:43 AM",
      "body": "Anything that spells out paying extra is never going to look attractive to anybody but if it happens  that this mode of payment is the most popular  among the merchants customers then the merchant will have no choice but factor this in his pricing of goods and service's as this is a profit making business and not some charity organisation of some sort.Quote from: Rupok on April 04, 2023, 08:29:39 AMI think lower processing fees can be more beneficial for merchants.  Do merchants make instant excahanges to stablecoinsor something for them to feel the pinch of processing fees...?Quote from: Rupok on April 04, 2023, 08:29:39 AMFor example ERC-20 has the most expensive transaction fees on the Ethereum blockchain due to its high price, but the BEP-20 network has the lowest transaction fees on the blockchain.So when we transact from wallet to wallet the fee is very low, but when we transact from wallet to exchanger, the fee is high.With the new way ethereum is processed thought fees have come to acceptable levels,  haven't  used eth ever since it got forked thought its cheaper to use now.Btw isnt it more expensive from exchange to wallet than wallet to exchange because exchanges exploit its customers. Quote from: Rupok on April 04, 2023, 08:29:39 AMThe disparity in transaction fees can be noticed here.I think it has a lot of implications for merchants. Their operations are essentially managing their payment gateways for merchants.On balance, I think lower processing fees would benefit merchandisersI guess best way to protect themselves is use blockchains with low transaction fees such as tron, binance, solona etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "April 04, 2023, 10:42:00 AM",
      "body": "We hate to pay fees and that's like sucking our money easily from these payment processors. There have been merchants that do avoid accepting these services and they avoid getting paid with credit cards, vouchers, and even bank transfers because they've got fees. While transaction fees now directly with Bitcoin aren't that much, they've got also another option to accept lightning network which is good for small transfers and it's the quickest that they can use. And every merchant should accept directly and that's gonna save them time and from higher fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}