{
  "id": "topic_5403590",
  "title": "merticinak",
  "author": "merticinak",
  "created_time": "June 22, 2022, 09:19:36 AM",
  "content": "Grayscale CEO’su: Short Bitcoin ETF’sinin Onaylanması ÖnemliGrayscale CEO’su Michael Sonnenshein, ABD’deki ilk Short Bitcoin borsa yatırım fonunun (ETF) piyasaya sürülmesi ile ilgili olarak değerlendirmede bulundu. Michael Sonnenshein, ABD’deki ilk Short Bitcoin borsa yatırım fonunun piyasaya sürülmesinin kripto para sektörü için olumlu bir işaret olabileceğini iddia etti.Grayscale CEO’su Short Bitcoin ETF’si Hakkında KonuştuGrayscale CEO’su Michael Sonnenshein bugün resmi Twitter hesabı üzerinden Short Bitcoin ETF’inin onaylanması hakkında konuştu. Michael Sonnenshein, ABD Menkul Kıymetler ve Borsa Komisyonu (SEC) tarafından yeni bir Bitcoin bağlantılı ürünün onaylanmasının, zorlu düzenleyicinin en büyük kripto para birimiyle giderek daha iyi hale geldiğine işaret ettiğine inanıyor. ProShares’in Ekim ayındaki Bitcoin vadeli ETF’i, 2021 boğa koşusunun ikinci aşamasını yeniden ateşleyen kripto için bir dönüm noktası olarak görülüyor. Yine de düzenleyici, spot tabanlı bir Bitcoin ETF’yi onaylamaya yönelik her girişimi şimdiye kadar reddetti. Grayscale şu anda SEC’i ikna etmek için mücadele ediyor. Bunun yanında hatırlatmak gerekirse ProShares Kısa Bitcoin Stratejisi (BITI), kısa süre önce New York Menkul Kıymetler Borsası’nda (NYSE) işlem görmeye başladı.Kaynak:BTCHaber",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403590",
  "comments": [
    {
      "author": "trendcoin",
      "created_time": "July 20, 2022, 04:32:32 AM",
      "body": "bitcoin üzerinde kazanç vaat eden yeni alanlar açıldıkça masaya yeni oyuncular da gelecektir. bence short bitcoin etf'si güvenli işlem imkanı arayan yatırımcılar için gayet iyi bir alternatif olarak değerlendirilmeli... öte yandan, doğrusunu söylemek gerekirse short etf'nin işleme açıldığı zamanlama bana biraz manidar gibi geldi. bitcoin ath'den buraya değerinin yaklaşık %70 küsürünü kaybetmişken terse işlem açmak çok akıllıca bir hamle olmayabilir. ben opsiyonu beğensem de zamanlaması nedeniyle short etf'yi şimdilik riskli bir tuzak gibi gördüm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "July 20, 2022, 12:29:36 PM",
      "body": "Bu tarz hamleler ne olursa olsun fiyata kötü yansıdığı düşünülse de uzun vadede finansal piyasalardaki Bitcoin görünürlüğünü arttırdığı için takdire şayan biçimde olumlu oluyor. Bitcoin in fiyatı düşme eğilimindeyken short yapmak isteyenler mutlaka oluyordu ve bunu doğrudan regüle edilmiş piyasalarda gerçekleştirmek istiyorlardı. Ha ben asla Bitcoin kadar spekülatif bir şeyi shortlamam bence büyük risktir ama bu tarz durumlarda Greyscale CEO su ile aynı fikri paylaştığımızı görmüş oldum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "July 28, 2022, 11:40:38 AM",
      "body": "Bitcoin'in yükselişini en çok engelleyen hede short. 20 bin dolardan 3 bin dolara düşen ayı da vadeli işlemlerin açılmasıyla başlamıştı. Spekülasyon aracı olarak görüyorum bu araçları. Gerçek yatırımcı short açmaz çünkü. Gerçek yatırımcının short ilgisi de olmaz. Teknoloji meraklıları da ilgilenmez. Yatırımcı ilgilenmez. Teknoloji meraklısı ilgilenmez. Geri bi tek manipülatörler kalıyor. Anca onların ilgisini çeker. Endişeli yaklaşıyorum ben bu haberlere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}