{
  "id": "topic_5450553",
  "title": "wolwoo",
  "author": "wolwoo",
  "created_time": "April 28, 2023, 08:50:39 PMLast edit: April 29, 2023, 02:18:49 PM by EFS",
  "content": "özellikle kriptodan bahsedecek olursak genellemelerden kaçmak gerekiyor, bazen forumu terk ediyorum ki buradaki görüşlerden uzaklaşayım ve kendi stratejimi geliştireyim çünkü insan ister istemez etkileniyor. kripto camiasında ne zaman ne olacağı hala belirsizo yüzden -fikir almak isteseniz bile son kararı kendiniz verin çünkü para sizinişte size birkaç örnek-\"ripple kripto bile değil merkeziiii, beş para etmez\" zamanında milyon milyon alanlar forumdan yıllar önce 2017 sonu emekli oldu hala daha majör coin-\"waves çok iyi-hayır berbat\" forumun en ateşli tartışmasıydı  ikisinin de haklı olduğu dönemler oldu 63 dolara kadar çıktı şimdi can çekişiyor-\"dogecoin şaka coini lan alınır mı?\" he alınmaz -\"shitcoinlerden uzak durun\" (duruma göre değişir)-\"kaldıraçtan uzak durun\" (duruma göre değişir)-\"CeHaZe milli coinimiz\" - 90 centi gördü-her şeyden uzak durun ytd",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450553",
  "comments": [
    {
      "author": "yenerbatmaz",
      "created_time": "April 28, 2023, 09:18:15 PM",
      "body": "Önemli bir konu olmuş, başlıktaki temaya katılıyorum.Ripple: Bir ara kısa süreliğine kurucu ortaklardan Chris Larsen dünyanın en zengin insanı haline gelmişti, sizce bu normal bir durum mu ? Doge: Gerçekten de şaka üzerine başladı, fakat insanlar geleneksel finans sistemindeki yolsuzlukların geldiği tamamen çürümüş ve ahlaksız noktaları görünce, sevimli sempatik ve en azından zararsız meme coinlere bir tepki olarak yöneldiler.Geçtiğimiz 10 yıl içerisinde kriptoya çeşitli eleştiriler getirenlerin 99%'u, dünya finans sisteminde dönen entrika ve ağır suçların bugünkü kadar deşifre olmuş haline vakıf olsaydı, bu yorumların çoğunu yapmazlardı diye düşünüyorum.Felsefi bir çıkarım daha yapmak istersek, dünyadaki ekonomik faaliyetler adil ve dengeli kurallar üzerinden işleseydi, alternatif bir para ve ödeme yöntemi olarak tasarlanan Bitcoin 10 sene içinde 50-60,000x yaparak bu kadar sansasyonel ve hızlı şekilde dünyanın en başarılı yatırım aracı haline de gelmemiş olurdu, yoluna gerçekten bir kripto para olarak devam ederdi...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "April 28, 2023, 10:20:39 PM",
      "body": "üstad demek istediğim; herkes aynı yoldan yürüyemez kimisi tradeten zengin olur kimisi hodldan, kimi btc'den zengin olur kimi shitlerden, kimi spotçudur kimi futuresçu...kimi \"bu neymiş lann\" der ilk aldığı coinden başarıya ulaşır kimi yıllarca debelenip durur, edindiği acı tecrübelerden voleyi vurur. Bu iş böyle!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "April 29, 2023, 12:44:01 AM",
      "body": "siz yine de kaldiractan ve shiba inu, alanı suikiyu tarzı coinlerden uzak durun. bunlar istatistiklerle kanitlanmis bir sekilde yatirimcilara hicbir sey kazandirmaz…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "April 29, 2023, 02:13:28 PM",
      "body": "Konuda geçen coinler bunlar: Waves, Ripple, Dogecoin, Chiliz, Shitcoin. Kısacası altcoinlerden uzak durun uyarısı da verilebilirmiş. Hepsini ayrı ayrı yazmak zorunda kalmazdınız.😅Bana da herkes Bitcoin ve Ethereum'dan başka coinlere uzun vadeli yatırım yapma diyor. Bir yandan onlara hak veriyorum ama bir yandan da çok korkak olduklarını düşünüyorum. Risk almadan para kazanmak hayatın her alanında imkansız. Kriptoparalarda da risk almadan para kazanmak imkansız. Paramızın tamamını bir coine yatırmadan sepet oluşturmak ve biraz garantici biraz riskli coinlere yatırım yapmak daha iyi olabilir sanırım. Anladığım kadarıyla riskli coinlere ne tamamen karşı çıkmak gerekiyor ne de onlara paramızın tamamıyla yatırım yapmamız gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "April 29, 2023, 02:48:57 PM",
      "body": "Quote from: Dzigie on April 29, 2023, 02:13:28 PMKonuda geçen coinler bunlar: Waves, Ripple, Dogecoin, Chiliz, Shitcoin. Kısacası altcoinlerden uzak durun uyarısı da verilebilirmiş. Hepsini ayrı ayrı yazmak zorunda kalmazdınız.😅Bana da herkes Bitcoin ve Ethereum'dan başka coinlere uzun vadeli yatırım yapma diyor. Bir yandan onlara hak veriyorum ama bir yandan da çok korkak olduklarını düşünüyorum. Risk almadan para kazanmak hayatın her alanında imkansız. Kriptoparalarda da risk almadan para kazanmak imkansız. Paramızın tamamını bir coine yatırmadan sepet oluşturmak ve biraz garantici biraz riskli coinlere yatırım yapmak daha iyi olabilir sanırım. Anladığım kadarıyla riskli coinlere ne tamamen karşı çıkmak gerekiyor ne de onlara paramızın tamamıyla yatırım yapmamız gerekiyor.altcoinlerden uzak durun demiyorum btc'den uzak durun da demiyorum, hiçbir şey demiyorum ben aslında yoğum konunun özeti \"olmaz olmaz\" demin bir başka konuda yazdım fan tokenlar mesela kimse beğenmez ama bazen çok güzel kar bırakıyor nerden ne kazanacağınız belli olmaz, birileri için felaket olan şey sizin için hayatınızın kazanç kapısı olabilir. bitcoin 10k'ya düşse buradaki hemen herkes batar ama shortçu tayfa abad olur. whats the point? genelleme yapmak iyi değildir, katı kurallar ile kendinize berlin duvarı çin seddi örmek yerine daha soft bir yaklaşım faydalı olabilir ama tabi hepisi de risk! benim amacım para kazanmak! ha shitcoinden kazanmışım ha btc'den doesnt matter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "April 29, 2023, 04:52:33 PM",
      "body": "Quote from: wolwoo on April 29, 2023, 02:48:57 PMQuote from: Dzigie on April 29, 2023, 02:13:28 PMKonuda geçen coinler bunlar: Waves, Ripple, Dogecoin, Chiliz, Shitcoin. Kısacası altcoinlerden uzak durun uyarısı da verilebilirmiş. Hepsini ayrı ayrı yazmak zorunda kalmazdınız.😅Bana da herkes Bitcoin ve Ethereum'dan başka coinlere uzun vadeli yatırım yapma diyor. Bir yandan onlara hak veriyorum ama bir yandan da çok korkak olduklarını düşünüyorum. Risk almadan para kazanmak hayatın her alanında imkansız. Kriptoparalarda da risk almadan para kazanmak imkansız. Paramızın tamamını bir coine yatırmadan sepet oluşturmak ve biraz garantici biraz riskli coinlere yatırım yapmak daha iyi olabilir sanırım. Anladığım kadarıyla riskli coinlere ne tamamen karşı çıkmak gerekiyor ne de onlara paramızın tamamıyla yatırım yapmamız gerekiyor.altcoinlerden uzak durun demiyorum btc'den uzak durun da demiyorum, hiçbir şey demiyorum ben aslında yoğum konunun özeti \"olmaz olmaz\" demin bir başka konuda yazdım fan tokenlar mesela kimse beğenmez ama bazen çok güzel kar bırakıyor nerden ne kazanacağınız belli olmaz, birileri için felaket olan şey sizin için hayatınızın kazanç kapısı olabilir. bitcoin 10k'ya düşse buradaki hemen herkes batar ama shortçu tayfa abad olur. whats the point? genelleme yapmak iyi değildir, katı kurallar ile kendinize berlin duvarı çin seddi örmek yerine daha soft bir yaklaşım faydalı olabilir ama tabi hepisi de risk! benim amacım para kazanmak! ha shitcoinden kazanmışım ha btc'den doesnt matterNerden ne kazanılacağı hiç belli olmaz tamamen zamanlama meselesi alım-satım yapıyorsanız. Eğer yatırımcısıysanız shitcoinlere yeterli mesafeyi koyarsınız istatiksel olarak ne kadar kazandıracağı az çok belli. Belki 100 tokenden 1 tanesi başarılı olur bunu yakalaması düşük bir olasılık. Waves zamanında iyi kazandırdı şimdi dediğiniz gibi sürünüyor. CHZ örneğinde belki de rakip bir proje olacak topluluk o projeye kayacak CHZ tekrar ath göremeyecek bir sürü senaryo var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}