{
  "id": "topic_5464648",
  "title": "Okwara",
  "author": "Okwara",
  "created_time": "August 26, 2023, 11:05:58 AM",
  "content": "As a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464648",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 26, 2023, 11:13:12 AM",
      "body": "You can get a domiciliary account and save in foreign currencies like dollar. Stable coins are pegged to fiat and they can lose their beg and value.Save in local currency? That depends which country that you are. If you are in US, Europe spending Euro, or if you are in UK, Kuwait, Australia, Canada or other countries with better inflation, use your local currency. If you are in counties like Turkey, Venezuela, African countries and part of Asia and South America, use domiciliary account.Hold only the amount of money that you can afford to lose on stable coins.In time like this when bitcoin price is low, you can hold bitcoin instead. Bitcoin is the best if you can get it right. Bitcoin is a deflationary currency if compared with fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kodec5",
      "created_time": "August 26, 2023, 11:15:22 AM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?Keeping your money in stable currency while waiting for the dip to invest in, is a very brilliant idea. Most times our local currency undergoes inflation which will tend to affect your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "August 26, 2023, 11:16:26 AM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?It's wiser to store your funds in USDT so you have the flexibility to trade whenever you want. If you place your money in a bank, you'll need to go through the process of transferring it to an exchange, which can be time-consuming. Additionally, keeping your funds in a bank for an extended period could be impacted by inflation, though this depends on your currency. Currently, USD is recognized as a robust currency.I'm not saying it's safe; it's just more convenient over safety. Putting money in the bank is safer than in an exchange, so you also need to minimize the risk by not putting everything you have. In short, make the right game plan, as trading is just like a game. Consider all the necessary risks before thinking of the reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "August 26, 2023, 11:16:38 AM",
      "body": "I think there are a lot of factors to consider here:- The country you're from- Whether your bank is crypto-friendly or not- The amount of money you're storingIf say you're storing a large amount, and the bank is not very crypto-friendly, do you really want to keep your money in the bank and then buy crypto all at once when it's \"the right time\" for you and risk having your transactions blocked, and possibly your account frozen?If your country's economy is not doing well, do you really want to keep it at the bank in your local currency?But this is not to say that stablecoins are safe. If anything, it's the opposite and we've seen that multiple times in the last few months with different projects: USDC, Terra's USD, DAI, de-pegging (even if it's for a small period of time).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "August 26, 2023, 11:21:51 AM",
      "body": "To be frank, non is the safest, you keep money in the bank, and those bastards will slowly steal from you, and your money gets shrunk over time and also inflation makes your money to become valueless over time. For stablecoin, they can depegged when you least expect it, even if you choose the biggest of them all USDT you will need to stay alert and signup for some crypto news alerts, so that you can escape quickly before things get worse. I use USDT and DAI as my stable coin and I prefer these to my bank account, but that's just me, both have their disadvantages, and you need to choose a side depending on what you are trying to escape from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 26, 2023, 11:37:25 AM",
      "body": "In respect to what other members have said regarding the country's local currency in question, here in my country, the naira is not stable at all. The price is floating, going down every day by day, and sometimes it acts as if it's beginning to gain back value, but it's not.For me, who doesn't have a domicillary account, I prefer to save any money that I'm not yet making use of on my stable coins, which I still believe are not that stable as they lose value sometimes, but I find it safer to use my local currency, as I can be rest assured that I'm a bit converted over the fast rising inflation. And when the local currency loses a bit of value, I can gain the same amount of value when exchanging the USDT.The choice of savings and where to save should be dependent on what you are saving for and when the funds are going to be used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "August 26, 2023, 12:01:30 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?I think this is the right time to invest, especially investing in bitcoin, considering that the price of bitcoin is in a difficult state to move like it is today. The exact time that I have in mind if I want to invest in crypto is not certain when it will happen. But when the market is red due to a decline, that's when it's the best time to buy.If your current version isn't the right time to invest and you think the right timeframe won't be far off, just store in a stablecoin like USDT. When you think the time has come, you can buy with the BTC/USDT pair.Because for a long time, I dare not guarantee that stablecoins will be safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "August 26, 2023, 12:40:47 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMDo you think it's better to save in stable coin like usdt or I should just keep the money in the bank?If you're thinking of investing your money, then have them in bitcoin, bitcoin is the best means to invest and still hodl your money for a profitable investment over time, if you have your money in stable coins, it will be fixed and will not increases because of being pegged with USD rate, but inflation will affect the rate of the worth with time while in bitcoin cannot be affected because your money will increase on a volatile cryptocurrency like bitcoin and it's value as well will increase together, don't ever make the mistake of holding in fiat, you will loose rather rate instead of earning over it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "August 26, 2023, 12:52:38 PM",
      "body": "There are more ways to save you money than the options you think you have. I assume that since you have come here you need our opinion form the crypto point of view. It doesn't matter which country you reside it, eventually, the value of your currency will diminish. As a crypto supporter the best way to save money is in bitcoin. But please you need to put in the effort and read. Do not just dump all of your money into bitcoin because we have said so. You need personal conviction which you can get by doing your own research. Nobody else will do this for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 26, 2023, 12:54:09 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?Stable coins are pegged to fiat USD which isn't good because when it is depegged,you funds will be useless. This is the only reason why I dislike stable coins. My country currency is very small compared to the USD and do depreciate over USD most times. This is the reason why I will save with a domiciliary account where I can convert my local fiat currency to USD and keep in my account, so that I can use it to wage the inflation in my country that is telling on my local currency. This way when ever I want to by bitcoin,I can use it to buy bitcoin when the price dips. However,it depends the country that you are like those people that are in Europe and England,no need for a domiciliary account just save in your bank",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 26, 2023, 01:29:13 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?Stablecoins most of them are centralized and we never know when it will bust but for years USDT has still there so as an assumption if you are storing money for few months then stable coins can be the best choice.If you are planning to keep more than a few months then stable coins are risky so you have to choose fiat there are fiats which is highly unstable so if you are from one of those countries then just buy the gold bonds with your money and when you see the right time to buy BTC then you can simply sell the gold bonds at the current market value and buy BTC with that money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "August 26, 2023, 01:40:46 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?Both the idea of keeping your fund in USDT or your bank are not safe because they both practiced centralized mechanism which give the team involve the power to confiscate your fund anytime they wanted.  I will advise you save in Bitcoin especially now that the market is in the downtrend season before the halving effect market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "August 26, 2023, 01:48:22 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more about how the market works before investing. But I'm concerned about how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coins or I should just keep the money in the bank?Since you will be dealing with crypto investment shortly I advise you to save your money in USDT or the Binance dollar but if your country's currency has a good value against the dollar you can save in your local currency.Remember not to save your money in centralized exchanges, and do not share your wallet seed phrase, and private key with anyone to avoid losing your asset",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "August 26, 2023, 02:06:56 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?Depends on your local currency, but both work the same. If your currency is strong and in high demand like Euro, Yuan, or Singapore Dollar keeping your local currency is not bad less risk compared to stablecoin, which might crash instantly like UST (TerraLuna). But if you have less strong currency keeping USDT to maintain your portfolio value in a short-term is better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "August 26, 2023, 02:32:30 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMDo you think it's better to save in stable coin like usdt or I should just keep the money in the bank?Stable coins are not safe and it's risky to store your capital in stable coins.PSA: Most Stablecoins Can Be Frozen, Even in Your Own WalletsFiat currency is safer in my opinion because they are inflationary but can not depeg quickly like stable coins. It's true that storing your fiat currency in bank account is risky too.However if choosing between stable coin and fiat currency, I choose fiat currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 26, 2023, 02:42:16 PM",
      "body": "In my opinion, both are almost in the same category of risk, and having known that presently you can't do without fiat currency and stablecoin due to moving your funds back and forth, I will consider having a percentage of my wealth first stored in Bitcoin, a little in fiat, and another in the stablecoin, in case of any devastating or contagion event in the future I won't lose almost all my entire wealth in the cost of storing my funds only in one currency (fiat/stablecoin) and this is just my perspective or how I view it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "August 26, 2023, 02:54:31 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMDo you think it's better to save in stable coin like usdt or I should just keep the money in the bank?My candid advice to you is very simple, Cryptos are getting cheap daily, I guess it's time you buy, and you may also want to diversify your portfolio. You can start DCAing from this moment, but I must warn you that at least 40% of your total investment budget should be involved by now if you wouldn't want to painfully miss out. It's just advice.But if by any chance your speculation and gut tell you to wait, I advise you to save the money in the bank, but must be domiciled in the USD if possible in your country. Don't forget that USDT is a centralised entity, by this, it will serve the same purpose as being in the bank.Except in the bank, you are not controlling it online yourself or putting it in the custody of a less trusted company online which indicates better safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "August 26, 2023, 03:03:12 PM",
      "body": "To be honest, stablecoins are not risk free, in the past few months we have seen many stablecoin depegged incidents and the biggest incident happened in Luna, Ust. So if you store your money in such a stablecoin then if something unexpected happens then your money will become useless. Then you must keep these risk factors in mind. On the other hand, you have to keep one thing in mind about keeping money in local currency in the bank, which country you are staying in, and in which currency you are depositing in the bank. Because if the rate of inflation in your country is very high then the value of your money will continue to decrease, at some point you will see that the value of your money will decrease a lot which will be beyond your expectations. So if you want to keep money in the bank, you should keep it in strong currency which is at least stronger than your local currency like USD, Euro. My opinion is that you can keep money in both ways but my advice is to split your money to Stablecoin USDT or keep local currency or USD, Euro in the bank to reduce the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "August 26, 2023, 03:11:21 PM",
      "body": "Quote from: Okwara on August 26, 2023, 11:05:58 AMAs a novice in crypto, I want to take enough time to learn more on how the market works before investing. But I'm really concerned on how to keep my money safe as I await the right time to invest.Do you think it's better to save in stable coin like usdt or I should just keep the money in the bank?If you're from a country with a devalued currency to the USD it will be better you save in stable coin like the usdt. In my opinion you shouldn't save it in a domiciliary bank account as other members has opined, domiciliary account opening the process is usually tiring with kyc requirements from the banks. A better advantage is to use a decentralized exchange that's kyc free without a questionable reputation and good security system in saving your to stable coin. You may curious why Dex? It's for privacy protection for those who which to keep their personal data away from the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}