{
  "id": "topic_5409406",
  "title": "Mate2237",
  "author": "Mate2237",
  "created_time": "August 10, 2022, 07:26:41 PM",
  "content": "as it is said, there are 21 millions bicoin in circulation in the whole world to use. And I dont know if another ones can be produced to add to the already existing ones. But as for the moment there 21m. So if the state governments planned against bitcoin and buy all the 21 millions to among themselves, what do you think will happened to the poor bitcoiners? or the government apparatus joined with the business tycoons to stored all the Bitcoins in their custody so that the name of bitcoin will die off since no ordinary man has enough to disturb the market. Although few people might have it but it will not even up to 2 or 3 BTC. Therefore, at that stage what will you do?https://bitcointalk.org/index.php?topic=5337252.0https://bitcointalk.org/index.php?topic=5206704.0https://bitcointalk.org/index.php?topic=23624.0https://bitcointalk.org/index.php?topic=5128657.0All the above links are talking about the limited bitcoin. As for me, government cannot store btc in their treasury to suffer bitcoiners because the money most be use to do something either for developmental project or security issue etc",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409406",
  "comments": [
    {
      "author": "Doan9269",
      "created_time": "August 10, 2022, 07:39:18 PM",
      "body": "Quote from: Mate2237 on August 10, 2022, 07:26:41 PMas it is said, there are 21 millions bicoin in circulation in the whole world to use. And I dont know if another ones can be produced to add to the already existing onesI doubt this, after the said numbers have been mined, miners will now deoend on transaction fees to earn their incentives, mining all the blocks stipulated doesn't mean that's the end of it all, rather the show continues, and it does not affect the volatile nature of bitcoin nor will it got pegged or cease from circulation, but then the price will be more unpredictable and the value will rise higher the more.Quote from: Mate2237 on August 10, 2022, 07:26:41 PMSo if the state governments planned against bitcoin and buy all the 21 millions to among themselvesThis cannot happen, do you know the worth amount of the said 21m in USD? that's very huge and they cannot afford to vested on a volatile coin one sidedly when other areas of the economy needed attention with finding as well, they wouldn't want to risk that, besides governments are anti bitcoin except for the ones that adopted it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "August 10, 2022, 08:32:47 PM",
      "body": "Quote from: Mate2237 on August 10, 2022, 07:26:41 PMas it is said, there are 21 millions bicoin in circulation in the whole world to use. And I dont know if another ones can be produced to add to the already existing ones. But as for the moment there 21m.There are 19,118,068 bitcoins in circulation. 21 million is the total supply when all bitcoin have been successfully mined, the time this would take is estimated to be till 2140.Quote from: Mate2237 on August 10, 2022, 07:26:41 PMSo if the state governments planned against bitcoin and buy all the 21 millions to among themselves, what do you think will happened to the poor bitcoiners?There would be no poor bitcoiners. They would have all sold to the state government.The possibility of this happening is low. State governments is not a Global entity, and buying out all bitcoins for the name of bitcoin to die off seems pointless. They would also need majority to be willing to sell, including Satoshi.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 10, 2022, 08:53:46 PM",
      "body": "Quote from: Doan9269 on August 10, 2022, 07:39:18 PMThis cannot happen, do you know the worth amount of the said 21m in USD? that's very huge and they cannot afford to vested on a volatile coin one sidedly when other areas of the economy needed attention with finding as well, they wouldn't want to risk that, besides governments are anti bitcoin except for the ones that adopted it. Exactly $453,666,662,279 as we speak, that's $453 billion, and if compare with for example US's military annual budget of 800 billion or the $5 trillion spent on the code stimulus in quits being such a huge amount. Of course, this is excluding the increased value as those coins get bought up but a government could easily get slow this down of this by claiming to ban bitcoin completely or starting seizing some large exchanges and their wallets at the same time but still.But, coming back to OP's main question, why would a government do this? What is the economic reason to grab all the coins?Grab them and burn them, they will act just like Satoshi coins, and even if 100 coins will not be owned by the government their value will be sky high and we will be dealing with microsatoshi if not nanosatoshi.Quote so that the name of bitcoin will die off since no ordinary man has enough to disturb the marketI fail to understand how this is a bad thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "August 10, 2022, 09:01:44 PM",
      "body": "A couple questions to your theory OP. I hold a part of that 21 million. How would the goverment buy my coins? There's many bitcoiners around the world who wouldn't sell if they saw aggressive buying from a party, in this case a government. It's the same kind of situation as if you owned a piece of land worth $100k and all of a sudden somebody came and offered $300k to buy it. You'd think they know something. Maybe there's oil or some other natural resource? Maybe there's a plan for a shopping center to be built and they want to flip the land for even more than they're offering you?  What about people who have millions and don't need fiat now? If someone came and gave them 50k USD for a bitcoin they wouldn't sell and if the same party came a month later offering 100k they also wouldn't sell. Holding money that's safe from inflation and surveillance maybe more important to them, since they already have 10 million in real estate and another 10 in stocks. There's no single entity like a government or a company that would be able to buy bitcoin at this point. All they'd do is buy what's available on exchanges and drive up price to insane levels like a million USD because if you'd reduce coins on exchanges by 80 or 90% you'd introduce insane volatility. You'd have bitcoin swing to 100k and back to 50k daily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "August 10, 2022, 11:38:25 PM",
      "body": "If any entity tried to corner the Bitcoin market, it would just increase the price of coins and prevent them from buying the rest of supply. Even if we imagine that someone managed to buy all coins, Bitcoiners could just agree to print more BTC or start a new blockchain with the same code. This is one of the most expensive and unrealistic attacks on Bitcoin that can be imagined. It's better to just spin millions of fake nodes and disrupt the communication between nodes, launch an information campaign against Bitcoin, cut it off from traditional finance and so on. But why would a government do it? Bitcoin is not a threat to fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 10, 2022, 11:40:31 PM",
      "body": "Quote from: coolcoinz on August 10, 2022, 09:01:44 PM...There's no single entity like a government or a company that would be able to buy bitcoin at this point. All they'd do is buy what's available on exchanges and drive up price to insane levels like a million USD because if you'd reduce coins on exchanges by 80 or 90% you'd introduce insane volatility. You'd have bitcoin swing to 100k and back to 50k daily. I don't think there would be swings, I think it would be a continued climb. If the government(s) were not telling people they were doing it, just buying and holding it then as the price REALLY started to go up due to the lower amount of coins being circulated people would REALLY have FOMO and the price would just keep going up.Right till the very hard crash at the end.But I can't see any government bothering to do it, or being able to keep it a secret as they spent that much money doing it.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frengki_cisco",
      "created_time": "August 11, 2022, 04:07:03 AM",
      "body": "The government doesn't have enough funds to hold all 21 million pieces of Bitcoin, no country can afford to do that and not all government parliaments approve such a proposal, if there is one.Every country has an incoming and outgoing budget every month and year, you have to consider that, every government has its own rules in determining the budget.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "August 11, 2022, 04:32:43 AM",
      "body": "Quote from: Frengki_cisco on August 11, 2022, 04:07:03 AMThe government doesn't have enough funds to hold all 21 million pieces of Bitcoin, no country can afford to do that and not all government parliaments approve such a proposal, if there is one.Every country has an incoming and outgoing budget every month and year, you have to consider that, every government has its own rules in determining the budget.Man can you at least read the first page of replies and see how quickly you'll find sweeping statements like this to be wrong.Even if all coins were already in circulation and in a single wallet, the total value isn't the figure you think it is.Might want to look up your country's budget and see what they're spending on, say, if I'm guessing right where you're from, religion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "August 11, 2022, 04:55:37 AM",
      "body": "Quote from: Mate2237 on August 10, 2022, 07:26:41 PMSo if the state governments planned against bitcoin and buy all the 21 millions to among themselves, what do you think will happened to the poor bitcoiners?(....)This is impossible if this will happen sure the price will skyrocket and it will become different. Another question is if the demand will start to become extremely high, do you think some Bitcoin holders will sell? I don't think so. It's possible for me I can't imagine how it will go.It's also a tough decision for the governments or other entities to put too many funds to try to buy all supplies, for me, it is not how it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 11, 2022, 04:59:54 AM",
      "body": "Quote from: Mate2237 on August 10, 2022, 07:26:41 PMthere are 21 millions bicoin in circulation in the whole world to use.More accurately, please!There are only ~ 21 millions of bitcoin in total supply. Not all of them will be used by people on Earth. Many of them received from mining from block rewards and lost forever (by losing private keys in early years of Bitcoin network).QuoteAnd I dont know if another ones can be produced to add to the already existing ones. But as for the moment there 21m.It can be done by a consensus in protocol but it won't happen. I strongly believe that it won't happen because the current total supply creates value for Bitcoin. The Bitcoin community don't have reasons to vote and increase total supply of Bitcoin.How is the 21 Million Bitcoin Cap Defined and Enforced?There are many Bitcoin forks but they are not real Bitcoin. There is a unique Bitcoin, the original one with ~ 21 millions in total.How Many Bitcoin Forks Are There? You will be surprised!!!QuoteSo if the state governments planned against bitcoin and buy all the 21 millions to among themselvesTo buy, they must buy it from sellers. Do you think governments can be sure that they actually buy all bitcoin from non-governmental holders?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 11, 2022, 07:04:37 AM",
      "body": "Quote from: Mate2237 on August 10, 2022, 07:26:41 PMas it is said, there are 21 millions bicoin in circulation in the whole world to use.The correct statement is \"there cannot be more than 21 million bitcoins in cicrulation\". Otherwise right now there is 19,118,390 bitcoin in circulation according to block explorers and some of it is lost.QuoteAnd I dont know if another ones can be produced to add to the already existing ones.It can but it won't because it requires a major change in the protocol which nobody would agree to.QuoteSo if the state governments planned against bitcoin and buy all the 21 millions to among themselves,When one entity starts buying something and removing that from the market it creates supply shortage. That will lead to increased price. In simple terms if a government started buying up bitcoins they would run out of fiat and paper to print more fiat way before they reach 21 million coins. 1 satoshi could be worth $1 million!Quotewhat do you think will happened to the poor bitcoiners?You should ask who would even sell their bitcoins to the government in first place. I have some bitcoins, do you think I'm gonna sell it all to the government?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "August 11, 2022, 05:05:29 PM",
      "body": "Quote from: Mate2237 on August 10, 2022, 07:26:41 PMas it is said, there are 21 millions bicoin in circulation in the whole world to use. And I dont know if another ones can be produced to add to the already existing ones. But as for the moment there 21m. So if the state governments planned against bitcoin and buy all the 21 millions to among themselves,It's not possible for the government to buy all the 21 Million Bitcoin.1) The governments already have enough on their plate and the world economy is in mess. I believe the best thing a sensible government will focus on is how to fix their backyard issue not the accumulation of all 21 Million BTC.2) We have the early and long-term holders of BTC who are not planning to sell any portion of their bag until the total 21 Million coins are mine.Quote from: Mate2237 on August 10, 2022, 07:26:41 PMAlthough few people might have it but it will not even up to 2 or 3 BTC. Therefore, at that stage what will you do?It is good you understand this, which show that it is impossible for the governments to have all the 21 Million BTC and the number of at least 1BTC holder was said to have increased lately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "August 11, 2022, 05:12:40 PM",
      "body": "Quote from: Mate2237 on August 10, 2022, 07:26:41 PMas it is said, there are 21 millions bicoin in circulation in the whole world to use. And I dont know if another ones can be produced to add to the already existing ones. But as for the moment there 21m. So if the state governments planned against bitcoin and buy all the 21 millions to among themselves, what do you think will happened to the poor bitcoiners? or the government apparatus joined with the business tycoons to stored all the Bitcoins in their custody so that the name of bitcoin will die off since no ordinary man has enough to disturb the market. Although few people might have it but it will not even up to 2 or 3 BTC. Therefore, at that stage what will you do?https://bitcointalk.org/index.php?topic=5337252.0https://bitcointalk.org/index.php?topic=5206704.0https://bitcointalk.org/index.php?topic=23624.0https://bitcointalk.org/index.php?topic=5128657.0All the above links are talking about the limited bitcoin. As for me, government cannot store btc in their treasury to suffer bitcoiners because the money most be use to do something either for developmental project or security issue etcBut in reality it is not possible, they cannot buy all the bitcoins because if they need to buy all the bitcoin then they need infinite amount of cash so infinite is unachievable so acquiring 21 million bitcoin is also not possible even by all the governments combined together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 11, 2022, 05:46:54 PM",
      "body": "It's impossible in reality. Also if a particular government buys all 21 million supply from the market, then the price of the bitcoin will turn back to zero because there will be no seller in the market. So the market will be straight away crashed to zero. One basic parameter of bitcoin is its decentralization, once it's gone, the foundation of bitcoin will be destroyed. So no government would try to do such a highly costly adventure which will eventually turn back to zero. Bitcoin's price is based on demand. So if there's no seller in the market, buyers will eventually move out of the market and will look for an alternative. So probably a new coin will rise to fame if bitcoin is purchased by government and kept under safe custody. Overall, it is an imaginary situation which will never ever happen. At least not in our lifetime!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "August 11, 2022, 06:02:53 PM",
      "body": "At such situation there won't be any difference between the digital form of fiat and bitcoin. Just the difference, bitcoin have got limited supply of 21 million whereas the digital fiat will be printed according to the need. Even if some country have plans of acquiring the entire 21 million, it won't happen for various reasons. The major one being the wallet with lost private keys which goes unrecoverable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "August 11, 2022, 10:41:01 PM",
      "body": "Well, Bitcoin won't be fully mined for the next 100+ years so thats not a problem we have to care about all that much. And even if the government decides to tackle Bitcoin buy buying it all up, thats fine. The \"free\" Bitcoin which is not in the governments hands will be worth a lot more. So if the government wants to help us, thats a great plan.And what are the governments going to do about the altcoins? We seem to have quite a lot of those. Has the government thought of a plan for them yet? I think nobody has the power to control or restrict Bitcoin in any way except at the end-node. Like a business which accepts payment in Bitcoin, for example. You can ban that business from accepting Bitcoin. Because that business is centralised and they know who owns it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 11, 2022, 10:51:41 PM",
      "body": "That’s not gonna happen mate. Take note that some BTCs have been lost forever like that guy who threw his hard drive in a garbage dump cointaining the Bitcoins that he have bought several years ago. They might seize or confiscating BTCs and choose to keep them, but not all because of the lost BTCs by other users who doesn’t remember their keys to the kingdom anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "August 11, 2022, 10:56:51 PM",
      "body": "I don't think there's even a plan for that, it already escalated worldwide and I don't think all government in the world would ever keep it on them. If they can take it, it will surely by force, the thing is they should have to buy it instead of using it in force, I wonder if they wouldn't see a protest if this happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "August 11, 2022, 11:58:26 PM",
      "body": "Quote from: rhomelmabini on August 11, 2022, 10:56:51 PMI don't think there's even a plan for that, it already escalated worldwide and I don't think all government in the world would ever keep it on them. If they can take it, it will surely by force, the thing is they should have to buy it instead of using it in force, I wonder if they wouldn't see a protest if this happen.Just keep calm it won't happen I'm sure about that since they can't just buy those Bitcoin in USD as if they owned the money just to buy a very volatile crypto currency. It's like giving what the people want by investing the crypto and again who would be the person in-charge of controlling the key of the wallet? Is it the President itself? The technical team? I highly doubt someone would risk to spend all of their capital budget just to stop us from using Bitcoin and besides they can't own all of it because it takes hundred years before whole Bitcoin will be mined plus considering the missing or shall we say the Bitcoin wallet that's just got lost already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}