{
  "id": "topic_5474867",
  "title": "larry_vw_1955",
  "author": "larry_vw_1955",
  "created_time": "November 21, 2023, 08:29:24 AM",
  "content": "https://www.coindesk.com/business/2023/11/20/tether-freezes-225m-linked-to-human-trafficking-syndicate-amid-doj-investigation/amp/Stablecoin issuer Tether has frozen $225 million worth of its own stablecoin following an investigation by the U.S. Department of Justice (DOJ) into an international human trafficking syndicate in Southeast Asia.No proof needed apparently just some suspicions guilty without any trial your money is FROZEN!On-chain data shows that Tether froze the $225 million across 37 wallets, with the majority of those tokens previously being transferred to OKX, a crypto exchange that also took part in the investigation  Strange how the USA forced tether to click that \"freeze\" button I bet they would love to have a freeze button on BTC so they could put an even larger dent in \"human traficking\". No trial no jury",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474867",
  "comments": [
    {
      "author": "nelson4lov",
      "created_time": "November 21, 2023, 01:30:14 PM",
      "body": "In Tether's smart contract, there is blacklisting mapping which the Tether's team uses to freeze addresses from making transfers so this isn't a surprise to me considering the fact Tether is highly centralized. And yes, If the government have a sure-fire way to nuke Bitcoin, they would do it because Bitcoin is sucking up almost all of the liquidity so much that commercial banks are basically not getting interest from users anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vickysagar",
      "created_time": "November 21, 2023, 01:40:19 PM",
      "body": "Quote from: larry_vw_1955 on November 21, 2023, 08:29:24 AMhttps://www.coindesk.com/business/2023/11/20/tether-freezes-225m-linked-to-human-trafficking-syndicate-amid-doj-investigation/amp/Stablecoin issuer Tether has frozen $225 million worth of its own stablecoin following an investigation by the U.S. Department of Justice (DOJ) into an international human trafficking syndicate in Southeast Asia.No proof needed apparently just some suspicions guilty without any trial your money is FROZEN!On-chain data shows that Tether froze the $225 million across 37 wallets, with the majority of those tokens previously being transferred to OKX, a crypto exchange that also took part in the investigation  Strange how the USA forced tether to click that \"freeze\" button I bet they would love to have a freeze button on BTC so they could put an even larger dent in \"human traficking\". No trial no jury  You sound like you're surprised. All stablecoins are centralized and can be frozen if governments ask. Most likely they wouldn't be able to operate otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "November 21, 2023, 02:12:07 PM",
      "body": "Quote from: larry_vw_1955 on November 21, 2023, 08:29:24 AM[...]No trial no jury  No need for trial to freeze assets - the suspicion of illegal activity is enough for that just like what they do with bank accounts.Too bad for the affected wallets since they need to go to though the long legal process to unfreeze. I doubt they'll do it so those USDT are as good as donated to the Government. Tether will just issue new 225M and give them to the U.S. Department of Justice.Quote from: Vickysagar on November 21, 2023, 01:40:19 PM[...]You sound like you're surprised. All stablecoins are centralized and can be frozen if governments ask. Most likely they wouldn't be able to operate otherwise.I doubt OP is surprised at all. He just wants to reemphasize the negative of USDT.DAI seems to be decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 21, 2023, 02:26:07 PM",
      "body": "Quote from: larry_vw_1955 on November 21, 2023, 08:29:24 AMhttps://www.coindesk.com/business/2023/11/20/tether-freezes-225m-linked-to-human-trafficking-syndicate-amid-doj-investigation/amp/Stablecoin issuer Tether has frozen $225 million worth of its own stablecoin following an investigation by the U.S. Department of Justice (DOJ) into an international human trafficking syndicate in Southeast Asia.No proof needed apparently just some suspicions guilty without any trial your money is FROZEN!On-chain data shows that Tether froze the $225 million across 37 wallets, with the majority of those tokens previously being transferred to OKX, a crypto exchange that also took part in the investigation  Strange how the USA forced tether to click that \"freeze\" button I bet they would love to have a freeze button on BTC so they could put an even larger dent in \"human traficking\". No trial no jury  If you're dealing with memecoins or tokens, then know all the possible risk involved because you will be held responsible for the loss to your coin, all these issues of censorship and exchange regulations are getting off hands because the next thing you will hear is the seizure of a particular amount from some targeted users, maybe we should begin to know this that the more we are under the control of a centralized exchange we are not safe including our finances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 21, 2023, 03:21:23 PM",
      "body": "Tether is a highly controversial project and it is not new for them to freeze. They have done such kind of freezing in the past and they will do it in the future. I avoid using it as it is the most centralized altcoin and sometimes I think it is backed by the US government. I may sound like a conspiracy theorist but the past of Tether has proved it somehow. It still holds the third position in market cap and it is still one of the favorite stable coins for trading by the traders. There is not much difference between Tether and USD, they both are similar in every way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 21, 2023, 04:11:51 PM",
      "body": "Quote from: Vickysagar on November 21, 2023, 01:40:19 PMYou sound like you're surprised. All stablecoins are centralized and can be frozen if governments ask. Most likely they wouldn't be able to operate otherwise.Not all stable coins are centralized, there are also some decentralized stable coins which pegged to the value of other assets. DAI is one of the known decentralized stable coin which pegged to the value of ethereum.What are Decentralized Stablecoins? A Look At DAI, GHO, crvUSD, FRAX, and More",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 21, 2023, 05:12:58 PM",
      "body": "All stable coins are centralised. So it's not only USDT. Rather any other stable coin issuers can take such steps to freeze your money for whatever reason. While I am not gloryfying the illegal act, stable coins are good for trading purposes only. It just becomes easier to calculate the profit and loss from a trade. Otherwise these are the most useless kind of cryptocurrency exists in the market. Never ever keep your money in stable coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 21, 2023, 05:26:32 PM",
      "body": "This what has been discussed in another thread that Tether (USDT) being a stable coin and a centralized cryptocurrency,it is not a save avenue to invest because your coins can be frozen at anytime and it is not like decentralized cryptocurrencies that you personally control your coins. But in Tether you are not the controller of your coins but the founder. I don't think they will create a frozen button in bitcoin. That can't happen because bitcoin was not created to control by third party but the individual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "November 21, 2023, 08:37:42 PMLast edit: November 21, 2023, 08:54:35 PM by TimeTeller",
      "body": "Quote from: avikz on November 21, 2023, 05:12:58 PMAll stable coins are centralised. So it's not only USDT. Rather any other stable coin issuers can take such steps to freeze your money for whatever reason. While I am not gloryfying the illegal act, stable coins are good for trading purposes only. It just becomes easier to calculate the profit and loss from a trade. Otherwise these are the most useless kind of cryptocurrency exists in the market. Never ever keep your money in stable coins. This is why stablecoins are not so secure when it comes to storing your funds. As they can freeze any account for whatever reason they think is necessary, you are no exception to such possibility.Though as you said, we are not tolerating such illegal act, but it clearly shows that they got a hold of your funds if they want to.These bad actors will soon find other alternatives to deal their funds discreetly, out of prying eyes of authorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 21, 2023, 08:54:25 PM",
      "body": "nothing is said in this article but just freezing the amount and i thought it must be in my country since it mentioned Southeast Asia. Tether, USDC, or any other centralized stablecoin can be frozen by government request. no court filing, no investigation but from chainalysis and solved the case by freezing. it's seems very common in USDT though. maybe we really need to start using another stablecoin that can't be frozen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "November 22, 2023, 01:48:11 AM",
      "body": "Quote from: electronicash on November 21, 2023, 08:54:25 PMnothing is said in this article but just freezing the amount and i thought it must be in my country since it mentioned Southeast Asia. yeah it did mention Southeast Asia it also mentioned the pig butchering scam:The $225 million was related to the \"pig butchering\" scam.lets be honest, the us dept of justice doesn't care about lonely men who get tricked by some sexy lady to invest in a crypto scam. guaranteed these lonely men won't get a penny of that $225 million. poor guys. they won't even be able to find a girlfriend because the us government froze all that money but won't give any of it back to them. Quote from: YogeeToo bad for the affected wallets since they need to go to though the long legal process to unfreeze. I doubt they'll do it so those USDT are as good as donated to the Government. Tether will just issue new 225M and give them to the U.S. Department of Justice.yeah i figured somehow this thing was all about the money to them. the us doj doesn't really care about protecting and making victims whole they don't give a darn about that! but still they throw out the phrase \"human trafficking\" so they can get an unlimited power to just sieze anything they want to. the us government is sick indeed. but of course they ignore the real human trafficking going on...because there's no money in that for them to sieze.https://cammack.house.gov/media/in-the-news/human-trafficking-crisis-border-coming-your-hometownOver the last year and a half under the Biden administration, human traffickers at the border have been busier than ever since the president practically hung a “Welcome” sign on our country’s front door",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "November 22, 2023, 02:10:20 AM",
      "body": "For all we know Tether might not have been forced really. Tether could have been very willing to submit and comply with the orders of the government. It's for their own sake and for their continued smooth operation. Tether doesn't fight for privacy or freedom. It's just a company that wants to make money by taking part in crypto's growth. Tether doesn't resist these orders even without hard and strong evidence. They are happy following orders from whoever has the power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "November 22, 2023, 03:26:55 AM",
      "body": "Quote from: Fundamentals Of on November 22, 2023, 02:10:20 AMTether doesn't resist these orders even without hard and strong evidence. They are happy following orders from whoever has the power. well i'm not using tether then. i don't want to be using some stablecoin where the management is more than happy to freeze anyone's address without any proof. but i guess to each their own. i guess maybe buying and selling it short term might be one thing but not holding it in a non-custodial wallet no thanks!i bet those bad men who had their 37 wallets frozen aren't too happy now. i bet they wish they used bitcoin instead. but you have to think that if human trafficking was such a big problem, they would have a freeze feature in bitcoin. the government would have gotten that put in. but i guess tether is a lower hanging fruit so they just for the stablecoins instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 22, 2023, 05:52:43 AM",
      "body": "Quote from: Fundamentals Of on November 22, 2023, 02:10:20 AMFor all we know Tether might not have been forced really. Tether could have been very willing to submit and comply with the orders of the government. It's for their own sake and for their continued smooth operation. Tether doesn't fight for privacy or freedom. It's just a company that wants to make money by taking part in crypto's growth. Tether doesn't resist these orders even without hard and strong evidence. They are happy following orders from whoever has the power. They are at the top of the food chain and refusing will bring them a lot of trouble, especially for an amount that for them is small, while those are users they would prefer to be out of their platform anyways since they are bringing too much negative attention to tether.So if someone has to hold some tether or centralized altcoin they better make sure to only do this for the shortest time possible, or one day they may see themselves becoming victims of such movements made against them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Argoo",
      "created_time": "November 22, 2023, 06:35:53 AMLast edit: November 22, 2023, 02:32:26 PM by Argoo",
      "body": "Quote from: Argoo on November 22, 2023, 06:35:04 AMStablecoin issuer Tether has frozen $225 million worth of its own stablecoin following an investigation by the U.S. Department of Justice (DOJ) into an international human trafficking syndicate in Southeast Asia.No proof needed apparently just some suspicions guilty without any trial your money is FROZEN!The fact that funds are seized only on suspicion of their owners being involved in any crimes, that is, even before trial, is a common and completely justified practice in most states. If seizure could be imposed only after the trial, then law enforcement agencies would not be able to seize any criminal funds, since criminals would have plenty of time, while the trial lasts, to withdraw and dispose of the disputed money.This incident is not surprising. After all, Tether must obey the government at the place of its registration or location. This practice should eventually spread completely to cryptocurrency exchanges or exchangers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 22, 2023, 02:00:07 PM",
      "body": "Quote from: TimeTeller on November 21, 2023, 08:37:42 PMQuote from: avikz on November 21, 2023, 05:12:58 PMAll stable coins are centralised. So it's not only USDT. Rather any other stable coin issuers can take such steps to freeze your money for whatever reason. While I am not gloryfying the illegal act, stable coins are good for trading purposes only. It just becomes easier to calculate the profit and loss from a trade. Otherwise these are the most useless kind of cryptocurrency exists in the market. Never ever keep your money in stable coins. This is why stablecoins are not so secure when it comes to storing your funds. As they can freeze any account for whatever reason they think is necessary, you are no exception to such possibility.Though as you said, we are not tolerating such illegal act, but it clearly shows that they got a hold of your funds if they want to.These bad actors will soon find other alternatives to deal their funds discreetly, out of prying eyes of authorities.Stable coins act like a bank. But in this entire incident I am happy that some criminals were caught. We need to keep the crypto market clear of criminals. So whatever Tether has done is great. But as a regular crypt to user I would not be comfortable in keeping my crypto assets in stablecoin. I would only use it for my trading activity and that's it. No criminal act but no authority to lock my fund is acceptable for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "November 23, 2023, 02:57:00 AM",
      "body": "Quote from: Argoo on November 22, 2023, 06:35:53 AMThis incident is not surprising. After all, Tether must obey the government at the place of its registration or location. yeah if they were located/based in the USA but I don't think that's the case",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}