{
  "id": "topic_5481230",
  "title": "cygan",
  "author": "cygan",
  "created_time": "January 11, 2024, 05:00:22 PMLast edit: June 04, 2024, 05:48:21 PM by cygan",
  "content": "before and even after the BTCitcoin etf was approved, many new BTCitcoin commercials have appeared on american television and the social media channelsin this thread i would like to introduce you to all of them. this thread should also serve as a kind of collection point for further new BTCitcoin commercialsof course you can also name your favorites here or publish commercials that were not posted by me here in the opi would then want to keep the list up to date - so here go! Ark Investhttps://twitter.com/ARKInvest/status/1745214938925195525Bitcoinhttps://twitter.com/RobinSeyr/status/1742256137624252491Bitwisehttps://twitter.com/BitwiseInvest/status/1736798744861966798Coinbasehttps://twitter.com/coinbase/status/1757069626486432100Grayscalehttps://twitter.com/Grayscale/status/1745486230304043337Hashdexhttps://twitter.com/hashdex/status/1743287176337482184Hashdexhttps://twitter.com/hashdex/status/1780941113043337406Krakenhttps://twitter.com/krakenfx/status/1779872384226316781MonochromeNEWhttps://x.com/MonochromeAsset/status/1797638322392903901VanEckhttps://twitter.com/vaneck_us/status/1740734416949776605VanEckhttps://twitter.com/vaneck_us/status/1745451747466715456VanEckhttps://twitter.com/vaneck_us/status/1745121068803584132VanEckhttps://twitter.com/vaneck_us/status/1765023710329622825VanEckhttps://twitter.com/vaneck_us/status/1764719726528201032VanEckhttps://twitter.com/vaneck_us/status/1764781143491059936",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5481230",
  "comments": [
    {
      "author": "mk4",
      "created_time": "January 11, 2024, 05:20:30 PM",
      "body": "Does BlackRock and Fidelity do commercials? I'm not from the US. It's actually their (potential) commercials that I'm interested with because both of these have strong-ass brands that could far easier convince the masses to get into Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "January 11, 2024, 05:24:21 PM",
      "body": "it is not surprising that as soon as the bitcoin etf was approved by the sec, these investment firms would flock to issue their own bitcoin etf products in order to seek profits from their customers. but interestingly from the average bitcoin etf advertisement, most of them prioritize security and claim that it is lower risk to invest in bitcoin etf on their platform compared to buying bitcoin directly. this is a big scam, because it is much safer to buy real bitcoin compared to this bitcoin etf considering that it is centralized and prone to manipulation.also buying and managing bitcoin in a blockchain wallet is much better than having to entrust your money to be exchanged for a bitcoin etf which is actually just ordinary shares that are not backed by anything, and which you can only use for investment. where you can use real bitcoin for investments and regular transactions, and the management is completely in your hands, not in the hands of these firms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "January 11, 2024, 05:30:44 PM",
      "body": "hadn't seen the rest of those ads except that bitwise. but among them, Tim Robbin's the coolest.  i never heard nor understood that Italian song anyway but this one sounds a lot more meaningful. copyright could be an issue but this is just sort of an ad not meant for TV. still very creative since it makes people listen to what is announced. no blockrock and grayscale yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "January 11, 2024, 05:59:30 PM",
      "body": "Quote from: mk4 on January 11, 2024, 05:20:30 PMDoes BlackRock and Fidelity do commercials? I'm not from the US. It's actually their (potential) commercials that I'm interested with because both of these have strong-ass brands that could far easier convince the masses to get into Bitcoin.unfortunately could not find any commercials from this two institutions yet...Quote from: electronicash on January 11, 2024, 05:30:44 PM✂️no blockrock and grayscale yet.new Grayscale BTCitcoin commercial added in the op",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 11, 2024, 08:02:17 PM",
      "body": "So, there are several Bitcoin commercials and advertisements which have appeared on internet? that is something I would have not expected to see this fast, to be honest. I had seen in the past advertisements for exchanges, but this seems to be different than that.It kind of reminds me when people crowdfunded some ads for Bitcoin years ago and encouraged anyone to do their own research and also to use non-custodial wallets. Now it is about getting people to speculate in the market using centralized tools, either way, I am afraid some people will over invest and may get tricked by whales in the mid term. As for me, I have not seen any Bitcoin commercial popping up on my social media accounts or anything like it, so I believe it is indeed a campaign which will get targeted to potential North American investors. Let us see how goes...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 11, 2024, 08:24:04 PM",
      "body": "Seems like we are about entering into a new phase for Bitcoin when it gradually becomes more common in households and regular discussions.I am speculating it becomes more accepted generally by a larger percentage of the population and more of the hesitancy around it reduces it.Privacy would also reduce with it, but that's a topic for another discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 11, 2024, 08:36:44 PM",
      "body": "Quote from: mk4 on January 11, 2024, 05:20:30 PMDoes BlackRock and Fidelity do commercials? I'm not from the US. It's actually their (potential) commercials that I'm interested with because both of these have strong-ass brands that could far easier convince the masses to get into Bitcoin.Although not popular but I think BlackRock has done some commercials in the past, I am not sure about fidelity. This two companies are amongst the biggest in the world and has great influence in the world, the hold billions in asset and shares and amongst the biggest reasons why the Bitcoin ETF would cause a spike in the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "January 11, 2024, 08:51:35 PM",
      "body": "Quote from: Upgrade00 on January 11, 2024, 08:24:04 PMSeems like we are about entering into a new phase for Bitcoin when it gradually becomes more common in households and regular discussions. Very soon Bitcoin will be the talk of the day in all corners and media and the adoption will be very high in the future. In this year countries will adopt Bitcoin in their countries to be use as a legal tender currency. Bitcoin will be the world currency for internet. And once Bitcoin is accepted in many countries, dollar will fall and the nations that have accepted Bitcoin, their economy will also improve and inflation will reduce in these countries. And once families adopt Bitcoin then everything will be good and okay. Because at that stage now the p2p is actually completed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "January 11, 2024, 09:02:44 PM",
      "body": "Quote from: moneystery on January 11, 2024, 05:24:21 PMit is not surprising that as soon as the bitcoin etf was approved by the sec, these investment firms would flock to issue their own bitcoin etf products in order to seek profits from their customers. but interestingly from the average bitcoin etf advertisement, most of them prioritize security and claim that it is lower risk to invest in bitcoin etf on their platform compared to buying bitcoin directly. this is a big scam, because it is much safer to buy real bitcoin compared to this bitcoin etf considering that it is centralized and prone to manipulation.It is expected that they will market their companies capability to secure the peoples investment and their money.  They surely exaggerate their claims about securities, how it is much easier to investment in Bitcoins and the possible profit of using their service.Quote from: moneystery on January 11, 2024, 05:24:21 PMalso buying and managing bitcoin in a blockchain wallet is much better than having to entrust your money to be exchanged for a bitcoin etf which is actually just ordinary shares that are not backed by anything, and which you can only use for investment. where you can use real bitcoin for investments and regular transactions, and the management is completely in your hands, not in the hands of these firms.For us who knows the basic about cryptocurrency, we know that it is better to keep Bitcoins in a non-custodial wallet but it is different for other people.  Many still wanted to avoid personal responsibility of keeping their coins so they rather use third party services to keep their Bitcoin for them and have people responsible if their investment gets hacked or stolen.  They do not mind about the manipulation and they are relying on the binding agreement about these services responsibility if something went wrong about their investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "January 11, 2024, 09:16:40 PM",
      "body": "Those commercials are good for Bitcoin I guess because if more audience view such commercials then they may get some interest in Bitcoin and finally we many have thousands of more investors who start investing in Bitcoin. I hope that soon Black Rock may release their commercial as that would really help to gain new investors who would wholeheartedly invest in Bitcoin after learning about it via those commercials.Out of all those commercials I believe the Bitwise's and and Greyscale's commercials are quite inspiring. But, the Black Rock's commercial will be at another level. I hope they will also release their commercial soon. No doubt in current available commercials the winner is Bitwise. I'm sure those commercials will help Bitcoin to get more exposure and wide audience may like to learn about Bitcoin after watching those commercials. Bitcoin is going to be the trend of the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 11, 2024, 09:25:47 PM",
      "body": "It’s going to take a while but the advertisement race by big corps, pushing these bitcoin etfs is going to make the price go parabolic. This is the biggest, most bullish thing to happen for bitcoin in years. Don’t expect the impact immediately but after months, maybe a couple of years we are going to the moon. These big institutions are going to force bitcoin ads down our throats. Every American is going to see this ad push. It is going to be a new era for bitcoin soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "January 11, 2024, 09:49:46 PM",
      "body": "Television is one of the biggest forms of spreading awareness, or like that advertisement, so that many people will see it and have an idea about bitcoin. If this keeps on going and many more channels do commercials like this, then we can expect that more investors will be added to bitcoin, but the downside of this is that many, of course, will also be added to those who will contradict bitcoin. You know, those who want to prove that they are right and afraid of something that is too complex for them and afraid to change.If bitcoin keeps on getting approval, then maybe it will be mainstream even more. If bitcoin is more powerful and manufacturable circulation happens in the market, then more movement will occur and more opportunity will be found. But we better watch out because the more bitcoin is known, there will also be those who have malicious intent that will take advantage of those new to bitcoin or crypto currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "January 11, 2024, 11:04:46 PM",
      "body": "I also wouldn't be too surprised if a certain national television station did a weekly program at a fixed time slot with a program about bitcoin, yep we will soon see the \"Bitcoin, Hello new day\", \" Fun lunch with Bitcoin \" , \" Late night talks with Bitcoin \" .Indeed, this is the history of bitcoin, we have had a challenging journey and until now its recognition. I gradually forgot how badly they treated Bitcoin in the past, now things are different, like before owning bitcoin was less sympathetic, now they look to it to gain favor  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "January 12, 2024, 04:01:16 AM",
      "body": "How I wish that I was able to watch them as well and only cygan was able to bring it up here, not even the media but I guess that's how it goes in terms of commercials whether they're through social media channels or national television as they don't get that much attention. Anyway, thanks for bringing them up and sharing all of it here. So prior to the approval, they really were able to bring up some commercials to give some people an idea on what Bitcoin and what they're trying to do with the Bitcoin spot etf applications. Well, these have been worth it I guess for their effort as they've been approved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 12, 2024, 04:39:00 AM",
      "body": "I think Bitwise is the first one that I saw. And when it was posted, it gave a hint that we might actually be getting this etf since they put In all the money and effort to find this commercial so it’ll most likely go live. Besides twitter I didn’t see it anywhere. Maybe if I watched cnbc or Bloomberg I would see them frequently but pretty sure I won’t see these commercials on my Netflix or prime shows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "January 12, 2024, 04:40:57 AM",
      "body": "Good stuff and great idea Cygan! These commercials are great and will definitely help with the adoption, 4.6 Billion influx on the first day! Thats freaking wild man. I liked all the commercials for the most part, I really liked the one that hashdex did tho I liked all the attention that guy drew I couldn't tell if they used a clip of an old movie for it though, I guess this is going to be the new norm, which is pretty epic!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "January 12, 2024, 04:45:42 AM",
      "body": "Bitcoin Spot ETF applications were approved in a batch and we had 11 Bitcoin Spot ETFs now.Because it's a batch approval, there are a competitive race among those ETFs. Race includes many areas like Service fee and Advertisement campaigns like those videos you shared shown that those companies behind approved ETFs are trying to put as much creative and impressive ideas for their service advertisement videos.Watching their videos, they like have different focus on different user groups exclusively old, middle and young aged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "January 12, 2024, 05:08:28 AM",
      "body": "I would love to see commercials like this on television here in my country in the coming days or months, because unfortunately, I didn't see one before or even today. I wish local institutions or even big time crypto traders and enthusiasts here in my country will initiate the the same move to create television commercials for Bitcoin. It will help people get educated and get the benefits and potential of Bitcoin and of course also it has impacts on adoption. I can only see gambling platforms being advertised by local artists that is far more worthless in comparison with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vickysagar",
      "created_time": "January 12, 2024, 07:09:22 AM",
      "body": "I haven't seen 'em all, just about a half of it, thanks. But I'm glad I started buying BTC without commercials and stuff like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}