{
  "id": "topic_5465621",
  "title": "Manu891",
  "author": "Manu891",
  "created_time": "September 04, 2023, 01:44:18 PM",
  "content": "Buongiorno a tutti Sono nuovo e adesso dopo un po di ricerche sono arrivato a voi vorrei provare a minare per adesso sto provando kryptexNicehash non riesco a farlo partire in nessun modo mi sempre errore di connessioneVoi che tipo di software usatePiano piano se riesco a far funzionare tutto vorrei crearmi un minirig per minare in giro si trovanoGrazie a tutti a chi mi aiuterà",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465621",
  "comments": [
    {
      "author": "fillippone",
      "created_time": "September 05, 2023, 05:33:30 AM",
      "body": "Ciao, innanzitutto benvenuto.Personalmente non so molto di mining, ma posso darti un paio di consigli:Innanzitutto prova a leggere le discussioni in questa sezione: l’argomento è già stato dibattuto in passato e sono sicuro che almeno parte delle osservazioni sono state già fatte.Inoltre se mastichi l’inglese, me lo auguro, nella sezione internazionale ci sono molti utenti con grande esperienza pronti a dare una mano.Spesso non serve aprire un nuovo thread, ma puoi anche leggere quello che è chiesto da alti utenti, farti un’idea e poi applicarla al tuo caso. Ad esempio guarda questa discussione (è la prima che ho trovato, credo sia un caso simile al tuo, anche se con meno energia):https://bitcointalk.org/index.php?topic=5452510.msg62234009#msg62234009E soprattutto, benvenuto, facci sapere come vanno le tue ricerche e magari scoprirai altre discussioni interessanti!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "September 05, 2023, 06:24:59 AM",
      "body": "Come accennato nel tuo topic iniziale, in generale per minare dovresti acquistare un hardware dedicato.Ok hai energia gratuita, ma serve adesso l'hardware! Che ha un costo, e ovviamente dei limiti sia come potenza che come quantità di crypto che riesce a produrre. Per valutare quale coin conviene minare controlla questo sito/tool online gratuito https://whattomine.com/ Inserendo il costo dell'energia, il tipo di miner, e altri parametri, puoi trovare istruzioni su cosa ti conviene minare (specifico per il tuo setting).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}