{
  "id": "topic_5450327",
  "title": "Princess_Devi",
  "author": "Princess_Devi",
  "created_time": "April 27, 2023, 03:24:51 AM",
  "content": "Hi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450327",
  "comments": [
    {
      "author": "kaseygriffin",
      "created_time": "April 27, 2023, 03:39:46 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youI have no advice on what you should buy in this market but I will talk about you being like a gambler wanting to try your luck in a different environment with longer wait times for results. Take your time to research this market and do not experience money with such faith and desire for luck, instead of just waiting for someone to give you the opportunity, if you If you don't intend to profit from the market properly, I think you should spend that money on lottery tickets that are much more valuable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Princess_Devi",
      "created_time": "April 27, 2023, 03:48:51 AM",
      "body": "Quote from: kaseygriffin on April 27, 2023, 03:39:46 AMQuote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youI have no advice on what you should buy in this market but I will talk about you being like a gambler wanting to try your luck in a different environment with longer wait times for results. Take your time to research this market and do not experience money with such faith and desire for luck, instead of just waiting for someone to give you the opportunity, if you If you don't intend to profit from the market properly, I think you should spend that money on lottery tickets that are much more valuable.No just don't need lot of profits. I just want to spend this money for good altcoins. These are all money from previous IPL matches bets I placed. Just only wasted 80$ but today have nearly 600$ money. I don't upset if this 600$ will be 6$ in long term. Just want to put this in alts and forget about it. since in this forum lot of guys have experience in crypto I thought to share it here. Thanks for the advice btw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natalim",
      "created_time": "April 27, 2023, 04:25:10 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youARB is one of the best options among them but as I always said, you should not hold altcoins for a longer time, especially new projects than just buying ETH and BNB. If you have this coin in your wallet, you also have to monitor its progress and keep updated because it happens several times that some projects show impressive growth during their early days but it turns to low and shitcoins after. I'm not saying ARB will be like them but who knows exactly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "April 27, 2023, 04:27:37 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youHm I generally don't see altcoins as long term investments so I'm not really sure how to go about what you want. If we ignore that though and just say what I want, I'd recommend Solana and Matic. You're already investing in ETH so that doesn't really matter anymore. Do note that I'm only looking at these coins for maybe 1-2 years max, unlike yours of 6 years.Good luck though!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Princess_Devi",
      "created_time": "April 27, 2023, 04:41:54 AM",
      "body": "Quote from: Natalim on April 27, 2023, 04:25:10 AMQuote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youARB is one of the best options among them but as I always said, you should not hold altcoins for a longer time, especially new projects than just buying ETH and BNB. If you have this coin in your wallet, you also have to monitor its progress and keep updated because it happens several times that some projects show impressive growth during their early days but it turns to low and shitcoins after. I'm not saying ARB will be like them but who knows exactly. They have nice Ecosystem btw. I hope it will sky rocket in future. But lets see",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "April 27, 2023, 04:49:15 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AM(...)Don't say buy BTC cuz already have nice amount since 2010. It's a contradiction when you say this, you don't believe in the opportunity bitcoin 2026 creates for you but you do believe that altcoins will give you an opportunity. Simply looking at the past and seeing it have gone up in price so many times, have you ever asked yourself if it weren't for that price increase would you really have known this market, and would you have Do you think this market really exists if it doesn't exist?My advice for a newbie is that still investing early BTC will give an advantage sooner, right now I can be confident that holding more BTC gives me more advantage until 2026, and then I can totally refer to new altcoins that haven't appeared yet. And really, I also don't like to invest with altcoins in the long term except for ETH, but I see you mentioned SUI, if you can, buy it and hold it until the time you set it because It's not out yet so I think it's long enough to bring you surprises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "April 27, 2023, 04:59:33 AM",
      "body": "You can try to invest in these tokens, but before that it is better to do research and the most important thing is to invest with money that you can afford to lose, because investing in new tokens like that is more risky compared to tokens that are already popular.But just as a suggestion, it's much better to invest in tokens like BNB and ETH. You can increase your investment in the token and you should not be tempted to get quick profits in crypto investment, because many have fallen in this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Freddie Boyer",
      "created_time": "April 27, 2023, 05:05:23 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:48:51 AMQuote from: kaseygriffin on April 27, 2023, 03:39:46 AMQuote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youI have no advice on what you should buy in this market but I will talk about you being like a gambler wanting to try your luck in a different environment with longer wait times for results. Take your time to research this market and do not experience money with such faith and desire for luck, instead of just waiting for someone to give you the opportunity, if you If you don't intend to profit from the market properly, I think you should spend that money on lottery tickets that are much more valuable.No just don't need lot of profits. I just want to spend this money for good altcoins. These are all money from previous IPL matches bets I placed. Just only wasted 80$ but today have nearly 600$ money. I don't upset if this 600$ will be 6$ in long term. Just want to put this in alts and forget about it. since in this forum lot of guys have experience in crypto I thought to share it here. Thanks for the advice btw. It's great to hear that you have some money to invest in altcoins, but it's important to approach it with caution. Cryptocurrencies are highly volatile markets, so there are always risks involved. It's good if you don't just focus on profit, but more on good altcoin investments, for example, if you buy Matic and enter now, I'm sure in December you can harvest it, maybe 2x the value of your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "podluznyj",
      "created_time": "April 27, 2023, 05:42:53 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youyes, now to invest in some new altcoins, you need to be careful because there is no stability in these new projects, but of course we are used to investing in bitcoin or eth since these cryptocurrencies are stable today, so people are investing in these crypto-money and waiting for growth to earn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rupok",
      "created_time": "April 27, 2023, 06:15:32 AM",
      "body": "Are you relying on Ultracoin instead of Bitcoin?  Since you are a newbie you should invest in Bitcoin. Because early BTC investment for newbies will give good profit.Investing in new ultracoins is very risky.  600$ is very good money to invest.  Although the ultracoins you mentioned are very good coins especially BNB and ETH, it is better to research and analyze before doing so.Among the ultracoins, BNB and ETH are very good investments.  Because these coins are risk free.I don't rely too much on the new ultra coins. There is fear of losing money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevindjunaidi",
      "created_time": "April 27, 2023, 08:31:52 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youSpace ID is very good for the long term, but you have to be prepared for the risk, because investing in new coin is definitely a bigger risk than old coin, it's just that if the new coin is successful, then you will get a bigger profit than you invest in old coin and I believe that Space ID has a great chance to be successful in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "April 27, 2023, 09:12:05 AM",
      "body": "Quote from: Rupok on April 27, 2023, 06:15:32 AMAre you relying on Ultracoin instead of Bitcoin?  Since you are a newbie you should invest in Bitcoin. Because early BTC investment for newbies will give good profit.Investing in new ultracoins is very risky.  600$ is very good money to invest.  Although the ultracoins you mentioned are very good coins especially BNB and ETH, it is better to research and analyze before doing so.Among the ultracoins, BNB and ETH are very good investments.  Because these coins are risk free.I don't rely too much on the new ultra coins. There is fear of losing money.I guess you miss something that OP said and I believe he is not new in the crypto market as he already has enough amount of Bitcoins invested already. And aside from having BNB and ETH on his hands, he now has the plan to invest more in altcoins to take advantage of the situation while the market is preparing for the halving and the upcoming bull season. And he might be mentioning Ultracoin but not I think we would love to choose it as it was one of his options. He asking what is best and I would suggest taking a look at ARB or other projects. Of course, must stay away from meme coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Princess_Devi",
      "created_time": "April 27, 2023, 09:15:43 AM",
      "body": "Quote from: Kelvinid on April 27, 2023, 09:12:05 AMQuote from: Rupok on April 27, 2023, 06:15:32 AMAre you relying on Ultracoin instead of Bitcoin?  Since you are a newbie you should invest in Bitcoin. Because early BTC investment for newbies will give good profit.Investing in new ultracoins is very risky.  600$ is very good money to invest.  Although the ultracoins you mentioned are very good coins especially BNB and ETH, it is better to research and analyze before doing so.Among the ultracoins, BNB and ETH are very good investments.  Because these coins are risk free.I don't rely too much on the new ultra coins. There is fear of losing money.I guess you miss something that OP said and I believe he is not new in the crypto market as he already has enough amount of Bitcoins invested already. And aside from having BNB and ETH on his hands, he now has the plan to invest more in altcoins to take advantage of the situation while the market is preparing for the halving and the upcoming bull season. And he might be mentioning Ultracoin but not I think we would love to choose it as it was one of his options. He asking what is best and I would suggest taking a look at ARB or other projects. Of course, must stay away from meme coins. Thank you for the explanation. Thats what I really want. And also it's not he it's she",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "April 27, 2023, 09:45:54 AM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youSince 2010? I'm sure if it's true then you're looking at investing in your BTC with thousands of percent increase, and why force investing in altcoins with just that much money, do you think investing in altcoins for $600 in 2026 will be thousands or even tens of thousands of dollars? maybe you can, but finding the right one that can make your dreams come true is not easy because altcoins are always filled with coins that cannot even be predicted whether they will still exist in the coming years, especially if you have invested in BNB and ETH I think focusing on that coin is a better choice than looking for other altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kapalmabur",
      "created_time": "April 27, 2023, 10:41:06 AM",
      "body": "Quote from: kevindjunaidi on April 27, 2023, 08:31:52 AMQuote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youSpace ID is very good for the long term, but you have to be prepared for the risk, because investing in new coin is definitely a bigger risk than old coin, it's just that if the new coin is successful, then you will get a bigger profit than you invest in old coin and I believe that Space ID has a great chance to be successful in the future. If indeed for the long term I think we have to be really careful in choosing coins for investment,it might be much safer to choose proven coins like Bitcoin and Ethereum,but again the decision is in the hands of each.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "umbara ardian",
      "created_time": "April 27, 2023, 11:02:26 AM",
      "body": "I cannot provide specific investment advice, and it's important to note that investing in altcoins is inherently risky and may result in significant losses. That being said, if you're looking for altcoins to invest in and hold for the long term, it's important to do your own research and due diligence before investing. You should consider factors such as the team behind the project, the technology and use case, the community and adoption, and any potential risks or challenges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "April 27, 2023, 11:31:22 AM",
      "body": "Not a fan of giving financial or investment advice about the altcoins that you wanted to buy. It should be on your own instincts and not relying on others’ decisions for you. As of the moment, I have nothing to recommend you regarding the altcoins because most of them are being heavily influenced by Bitcoin no matter where it goes. For instance you want to buy ARB, it should be your own decision and not by the decision of others despite their so-called “years of experience” in analyzing charts, market situations, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "April 27, 2023, 12:59:51 PM",
      "body": "Quote from: Princess_Devi on April 27, 2023, 03:24:51 AMHi just new to here. I want to know what are the good altcoins that can be invest and forget until 2026. I'm currently thinking to spend around 600$ for altcoins. Right now I'm holding BNB & ETH only as altcoins. Don't say buy BTC cuz already have nice amount since 2010. Is it good to invest in HOOk, SUI , ARB or ID altcoins? Since they are new just thought to give a try. Thank youThis is not advice but I am going to tell you how I would do it if I were you:Don't invest in any altcoin below the top 30 on coinmarketcap by volume. Personally, I would not even go below the top 20. Furthermore, you should consider investing dividing your money into parts and investing only one part into each altcoin. 60 USD each altcoin gives you a nice spread of 10 different altcoins. Basically, do not feel tempted to put everything into one basket. Thats just smart risk management and I do not think I have to tell you that.  Don't fall for the newest coins. They fail 99% of the time. Be sure to pick a coin which has been around for a longer time. At least 3 years, I would say. And it should show a steady rise during that time. Avoid pump and dumps and bad performers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "April 27, 2023, 01:54:38 PM",
      "body": "I can't suggest the best for you.  All projects that you will invest there are risks.  You just choose what kind of risk you can accept.  I agree with some of the projects you have invested in but if it were me I would choose projects like ADA, Doge, XRP, CRO and CFX.  It is also for long term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}