{
  "id": "topic_5415294",
  "title": "Ucy",
  "author": "Ucy",
  "created_time": "September 29, 2022, 05:10:57 AM",
  "content": "To you Russia, you were given great power to trample upon the enemy (satan) and rule over it but you were more interested in negotiating with it and giving it a \"breathing\" space to regrow/challenge you. You do not negotiate or give it space because it a terrible spirit. To understand how terrible it is, imagine a hoarde of \"zombies\" that you keep shooting and they keep rushing at you even when you have destroyed many of them. The more you destroy them the faster they approach you to conquer you. Why would you negotiate with such a thing or give it a breathing space? You should completely contain and rule over it otherwise it will keep giving you problems to wear you down and conquer you. They know you have the great power to contain them, but you don't seem to want to fully use it. Don't be fooled when they make you feel like they are greater than you and you are nothing. That is part of the zombies war tactics.If you don't fully use your power, satan will continue to give you problems and this won't prevent the CREATOR from achieving HIS purpose in the region and the World. By the way, whenever you refuse to serve your role it will be done from here.. like how Ukraine was prevented from negotiating with you. I noticed you think it was Babylon and the West that made her to change her mind. Talking of Babylon, always remember she currently has a false king which I also noticed you occasionally called the king while the real king is called the former. Well, you are helping to power up the false king and making him strong and becoming a problem to you. You have alot of powers, don't try to use it wrongly. Others have little effect when they see him as the king but your effect is stronger, so be careful what you say or wish for. Don't be surprised when they craftly try to use you to power him up... I have noticed several countries using you in this manner(esp for their economic/military benefits) , whether intentional or not. When the CREATOR refuse them something, they try to get it through the back door.Anyway, the CREATOR's Will will always be done whether we obey or not. It's a pity for those who refuse to obey, nevertheless.I hope you by now know what is the cause of the Nord Stream issues and why the CREATOR has allowed it. Conquer the enemy, please the CREATOR and thing will be well for you.Related post:My advice to Russia. Don't allow loophole & stumbling block https://bitcointalk.org/index.php?topic=5392501.msg59715129#msg59715129",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415294",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "September 29, 2022, 03:46:23 PMLast edit: September 29, 2022, 07:58:28 PM by BADecker",
      "body": "^^^ This is similar to the United States. We have ignorantly allowed the banking system to take us over, and set Biden and itself in place over us.Back in the cold war times, many Russian Christians called to us to help them out. As Christians we didn't hear them crying out to us. Why not? The banking system that set the Bolshevik Revolution had already tricked us, the US people, into believing in money rather than principle.Of course, God protected both His people in the US and His people in Russia. But it is time for us all to stand up for God, and to see what is really going on. We have the right. God is our strength, if we don't continue to act against Him.EDIT: To back up what Ucy says in the OP, check out Revelation 18 to see what happens after Babylon is destroyed. If you think about what you read, you will see that Babylon is the money system, because it does exactly what money does::Quote from: https://biblehub.com/niv/revelation/18.htm9“When the kings of the earth who committed adultery with her and shared her luxury see the smoke of her burning, they will weep and mourn over her. 10Terrified at her torment, they will stand far off and cry:“ ‘Woe! Woe to you, great city,you mighty city of Babylon!In one hour your doom has come!’11“The merchants of the earth will weep and mourn over her because no one buys their cargoes anymore— 12cargoes of gold, silver, precious stones and pearls; fine linen, purple, silk and scarlet cloth; every sort of citron wood, and articles of every kind made of ivory, costly wood, bronze, iron and marble; 13cargoes of cinnamon and spice, of incense, myrrh and frankincense, of wine and olive oil, of fine flour and wheat; cattle and sheep; horses and carriages; and human beings sold as slaves.14“They will say, ‘The fruit you longed for is gone from you. All your luxury and splendor have vanished, never to be recovered.’ 15The merchants who sold these things and gained their wealth from her will stand far off, terrified at her torment. They will weep and mourn 16and cry out:“ ‘Woe! Woe to you, great city,dressed in fine linen, purple and scarlet,and glittering with gold, precious stones and pearls!17In one hour such great wealth has been brought to ruin!’“Every sea captain, and all who travel by ship, the sailors, and all who earn their living from the sea, will stand far off. 18When they see the smoke of her burning, they will exclaim, ‘Was there ever a city like this great city?’ 19They will throw dust on their heads, and with weeping and mourning cry out:“ ‘Woe! Woe to you, great city,where all who had ships on the seabecame rich through her wealth!In one hour she has been brought to ruin!’20“Rejoice over her, you heavens!Rejoice, you people of God!Rejoice, apostles and prophets!For God has judged herwith the judgment she imposed on you.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 29, 2022, 08:14:30 PM",
      "body": "Crises will remain as long as a few centralized countries control production and distribution. As long as these countries exploit their role as a tool of pressure.If it is permissible to blame Russia for the events of crises, then we should not deny the role of the countries that support it and that help it in causing the crisis without this causing harm to its local economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "September 29, 2022, 08:21:48 PM",
      "body": "The question is, Was Germany in secret talks with Russia to get them to turn on the gas again? The destruction of the Nord Stream pipelines kinda makes the issue a moot point... except if they can repair them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 06, 2022, 02:41:06 PM",
      "body": "Germany has a second chance at Russian gas. God doesn't want His many faithful people in Germany and Europe to be destroyed... not even by freezing to death. He wants to save His faithful people all over the world... even in America and Europe.Special Report: One of the Nord Stream 2 Pipelines was UndamagedQuote from: https://2ndsmartestguyintheworld.substack.com/p/special-report-one-of-the-nord-streamAccording to Bloomberg News, the incompetent US military failed to blow up one of the lines of the Nord Stream 2 pipeline.  Germany now has an opportunity to escape the energy deprivation the government has placed on Germany by ceasing to comply with US Russian sanctions and signing off on the opening of the Nord Stream 2 pipeline.The only question is whether the German officials are paid enough by Washington to sacrifice the German economy for their own self-enrichment.Of course, the US might return to the scene of its crime and finish off the line it missed, but this might finally provoke some retaliatory action from the Goody Two Shoes in the Kremlin....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}