{
  "id": "topic_5447497",
  "title": "blue Snow",
  "author": "blue Snow",
  "created_time": "April 04, 2023, 05:42:16 AM",
  "content": "Kemaren Ane dapat telepon dari seseorang yang sangat meyakinkan dan mengatasnamakan bank mandiri, dia berkata kalau dia adalah costumer service kartu kredit bank mandiri yang menawarkan upgrade limit dan gratis iuran tahunan untuk seumur hidup. Yang bikin ane sangat percaya adalah, CS ini tahu semua informasi nama lengkap, alamat, dan tanggal lahir ane. Jadi sebagai pemegang kartu kredit mandiri ane nurut saja permintaan dia, sehingga ane kasih nomor kartu CC mandiri ane, sekaligus 7 nomor di belakang kartu (CVV).Setelah ane kasih informasi nomor semua ke dia, di seberang telepon pun minta ane menunggu beberapa saat untuk validasi data. Dan setelah beberapa saat, dia telepon lagi dan menjelaskan kalau data ane telah di validasi, dan meminta ane menunggu SMS, yang kata dia untuk validasi data, user diharuskan menyebut nomor validasi yang didapat dari sms tersebut.Di seberang telepon masih menunggu ketika ane dapat sms tersebut, dan (fake) benar, sms tersebut datang di HP ane bertuliskan Bank Mandiri, akan tetapi (mungkin karena ane ini anggota forum bitcointalk yang suka membaca sebelum memposting), ane kok ragu setelah baca semua sms dari bank mandiri tersebut, kok ada tulisan trx bukalapak IDR 8.768..... dan ada KODE OTP. XXXXXXX.di seberang telepon CS tersebut terus meminta ane menyebutkan kode validasi tersebut, sedangkan ane masih termangu kaku dan terus melihat/memahami dan berpikir tentang apa yang terjadi, Ane lalu terkesiap kalau sudah hampir kena scam sepersekian detik, 8 juta. buru-buru telepon ane tutup dan menghubungi call center 14000 bank mandiri dan minta CC ane diblokir. beruntungnya saldo CC ane tidak terpakai sama sekali, dan pihak bank mandiri asli langsung memblokir CC bank mandiri ane. Pihak bank mandiri menjelaskan kalau nomor yang menelepom 021-2324324 dan SMS (bernama BANK MANDIRI) itu bukan dari bank mandiri.Atas kejadian di atas ane mau warning buat teman-teman sekalian di sini, Kalian pasti udah tahu kalau ane ini sudah sangat secure karena sempat beberapa kali mengungkap scam-scam yang ada di sini, tapi anehnya kok sekelas ane ini aja hampir kena yang beginian, apa lagi newbie atau user yang baru gabung pikir ane. Jadi kesimpulan ane, hati-hati, jangan mudah percaya, sekarang ini zaman sudah semakin gila, scammer bahkan tahu sudah nama asli, nik, tgl lahir dan alamat saudara, bahkan mungkin ibu kandung. sehingga akan dapat dengan mudah mengambil duit ente yang tersimpan di bank.WASPADALAH, WASPADALAH...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447497",
  "comments": [
    {
      "author": "armanda90",
      "created_time": "April 04, 2023, 07:27:22 AM",
      "body": "Masih beruntung agan belum memberikan kode validasi yang dikirim ke sms no hp, saya rasa jika sepersekian detik dikasih tau tentunya semua saldo akan hilang. Sepertinya ini modus dari dulu sih gan, entah kenapa bisa terkecoh dengan model penipuan seperti ini yang saya rasa sudah sangat familiar saat ini. Dulu kalau tidak salah pernah terjadi dan viral dengan Bank BRI, banyak nasabah yang terkecoh untuk bisa mendapatkan pemotongan pengiriman ke antar bank, jadi setiap transaksi ke bank lain tidak kena potongan dan mereka mencoba validasi lewat sms no hp juga. Saya rasa ini sangat membantu juga bagi yang lain terutama dengan nomor baru yang menghubungi kita.Untuk saat ini saya belum menggunakan kartu kredit mandiri meskipun sudah beberapa kali ditawarkan, karena domisili di desa dan pebayaran masih banyak manual alias uang tunai saya pikir tidak terlalu membutuhkan dengan kartu kredit mandiri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fathafraink",
      "created_time": "April 04, 2023, 12:04:13 PM",
      "body": "Berguna sekali topik ini untuk meningkatkan kewaspadaan bagi teman-teman di forum ini, tapi aku tidak melihat adanya kaitan dengan Bitcoin secara umum di sini. Apakah postingan seperti ini sudah diperbolehkan untuk tampil? atau aku yang ketinggalan informasi karena udah beberapa waktu vakum sementara karena urusan di dunia nyata?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "April 04, 2023, 04:14:44 PM",
      "body": "Data-data identitas itu mudah diperoleh melalui KYC di platform lain gan, misalnya pinjol atau situs juday. Terkait dengan thread tentang KYC dulu itu.Nah terkait CS telepon itu kalau sudah minta data kek nomor kartu dan cvv itu berarti sudah harus diwaspadai karena ngapain minta? Kan mereka sudah tahu dari sistem.Terus apapun modus scam, usahakan jangan terburu-buru mengambil keputusan. Kalau ada telepon kabar baik maupun kabar buruk, santai aja, karena rule #1 para scammer adalah memanfaatkan berkurangnya rasionalitas karena dikejar waktu atau guncangan psikologis. Ini banyak yang menyebut \"ilmu gendam\" padahal hanya trik psikologis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abhiseshakana",
      "created_time": "April 04, 2023, 06:11:04 PM",
      "body": "Miris juga kalo melihat data-data KYC valid yang jatuh ke tangan oknum yang tidak bertanggung jawab. Padahal pada dasarnya mayoritas KYC dari platform-platform yang memiliki legalitas jelas, biasanya sudah memberikan statement jika data KYC yang kita berikan akan dijaga kerahasiannya, namun menilik dari banyaknya kasus data KYC yang jebol saya kira ancaman eksploitasi memang akan selalu menyertai disaat kita melakukan KYC (terutama jika kita melakukan KYC pada platform-platform yang tidak memiliki legalitas jelas).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "April 04, 2023, 07:51:01 PM",
      "body": "Nama lengkap, alamat, tanggal lahir, dan informasi finansial(nomor kartu dan CVV) merupakan data pribadi yang harus dilindungi. Kalau ada pihak tidak berkewenangan mempunyai data tersebut, besar kemungkinan agan sudah mengalami kebocoran data, entah itu dari suatu layanan atau mungkin karena phising. Sayangnya berdasar kejadian ini, data pribadi agan sudah tersebar pada orang yang tidak bertanggung jawab. Mungkin sebagai langkah pencegahan, bagi member lainnya, perlu untuk memikirkan dua kali ketika akan melakukan KYC ataupun menggunankan data pribadinya untuk suatu hal tertentu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "April 04, 2023, 09:14:53 PM",
      "body": "KTP orang kita Indonesia sangat mudah di dapatkan saat ini, selain KYC, Phising, Social Engineering dan menyerahkan KTP terhadap calon yang bertarung di pemilu (Independen) juga cukup berbahaya sebenarnya, banyak orang kita tidak sadar menyerahkan indentitasnya pada saat pemilu, sehingga indentitas kita tersebar kemana-mana. Media sosial juga menjadi tempat yang paling mudah di retas dengan cara mengklik link yang di kirim oleh pelaku kejahatan. Misalnya membuat judul Aril Noah mesum dengan a, b dan c (ini contoh ya mas) Bagi sebagian orang yang awam ini merupakan sesuatu yang tidak biasa, membaca judul saja sudah membuat mereka penasaran dan akan menekan masuk ke link tersebut, sehingga pelaku akan memiliki akses terhadap apa yang mereka cari. Kehati-hatian sangat diperlukan dan semoga kita yang sudah sedikit paham akan terhindar dari masalah seperti ini, harusnya mas kerjain balik mereka",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "April 05, 2023, 07:17:11 AM",
      "body": "Quote from: armanda90 on April 04, 2023, 07:27:22 AMSepertinya ini modus dari dulu sih gan, entah kenapa bisa terkecoh dengan model penipuan seperti ini yang saya rasa sudah sangat familiar saat ini.Sebenarnya ane tidak akan terkecoh jika di seberang telepon tidak tahun ane, tapi masalahnya dia tahu detil ane kayak teller bank gitu.Quote from: fathafraink on April 04, 2023, 12:04:13 PMBerguna sekali topik ini untuk meningkatkan kewaspadaan bagi teman-teman di forum ini, tapi aku tidak melihat adanya kaitan dengan Bitcoin secara umum di sini. Apakah postingan seperti ini sudah diperbolehkan untuk tampil? atau aku yang ketinggalan informasi karena udah beberapa waktu vakum sementara karena urusan di dunia nyata?sebenarnya ane juga mikir gitu, tapi ini juga berkaitan dengan maraknya scam-scam email yang ngasih btc gratis yang ujung-ujungnya ngambil milik ente. Artinya, di thread ane ini ada kaitannya dengan kewaspadaan, apa lagi sekarang ini sudah masuk fase bullrun gitu.Quote from: mu_enrico on April 04, 2023, 04:14:44 PMNah terkait CS telepon itu kalau sudah minta data kek nomor kartu dan cvv itu berarti sudah harus diwaspadai karena ngapain minta? Kan mereka sudah tahu dari sistem.Katanya buat validasi, dan ane juga cuma nyambungin data doang, dia menyebut 2 angka di depan untuk ane sambung, dan sepertinya dia juga tahu nomor CC ane, mungkin tahu pas ane gesek di kasir supermarket, dll.Quote from: abhiseshakana on April 04, 2023, 06:11:04 PMMiris juga kalo melihat data-data KYC valid yang jatuh ke tangan oknum yang tidak bertanggung jawab. Entah dari mana mereka dapat KYC dan tahu kalau ane itu megang kartu kredit, apa mungkin dari pihak bank mandiri itu sendiri?, bahkan scammer ini tahu limit dan sisa balance ane.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "April 05, 2023, 02:41:44 PM",
      "body": "untung saja mas nya sadar bahwa itu hanyalah penipuan, kok gak di maki maki dulu baru di tutup telepon nya, hehehe. saya baru tahu trik yang mereka gunakan (membeli barang dari ecommerce pake CC kita) tapi kayaknya penipu tersebut punya orang dalam yang tahu semua informasi data privasi CC mas. https://www.cermati.com/artikel/waspadai-6-modus-penipuan-minta-data-transaksi-dan-info-pembayaran-kartu-kreditQuote from: MarjorieZimmermanGinger on April 04, 2023, 09:14:53 PMKTP orang kita Indonesia sangat mudah di dapatkan saat ini, selain KYC, Phising, Social Engineering dan menyerahkan KTP terhadap calon yang bertarung di pemilu (Independen) juga cukup berbahaya sebenarnya, banyak orang kita tidak sadar menyerahkan indentitasnya pada saat pemilu, sehingga indentitas kita tersebar kemana-mana. Media sosial juga menjadi tempat yang paling mudah di retas dengan cara mengklik link yang di kirim oleh pelaku kejahatan. Misalnya membuat judul Aril Noah mesum dengan a, b dan c (ini contoh ya mas) Bagi sebagian orang yang awam ini merupakan sesuatu yang tidak biasa, membaca judul saja sudah membuat mereka penasaran dan akan menekan masuk ke link tersebut, sehingga pelaku akan memiliki akses terhadap apa yang mereka cari. Kehati-hatian sangat diperlukan dan semoga kita yang sudah sedikit paham akan terhindar dari masalah seperti ini, harusnya mas kerjain balik mereka  bulan lalu, tetangga saya minta foto KTP saya dengan alasan untuk pemilu (DPR) dan di bayar 50 ribu, langsung saya tolak, enak aja beli data diri orang seharga 50 ribu, mending gitu terpilih langsung ada manfaat nya ama saya, ini gak, gitu terpilih langsung kabur merasa diri paling hebat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ndutndut",
      "created_time": "April 05, 2023, 05:45:58 PM",
      "body": "Syukur pada akhirnya anda sadar setelah mendapatkan kode OTP. Sebenarnya kasus seperti ini sudah sudah ada sejak lama cuma sekarang sudah di modifikasi saja, sekarang banyak penipu sudah mulai menyadari sebagai CS sebauh Bank dengan Iming2 upgred limited lah ada juga juga tarik tunai tanpa bunga. Mengenai data seperti nya di Indonesia memang mudah bocor, jangan kan di bank data negara saja bisa bocor. Sudah seharusnya Indonesia perlu mengatasi hal semacam ini jangan di anggap remeh karena sudah banyak korban dari penipuan baik itu di bank maupun yang lainnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dian82",
      "created_time": "April 06, 2023, 07:32:48 AM",
      "body": "Hampir saja ya om blue snow paporitku di forum ini kena tipu, namun seperti yg om bilang sudah terbiasa membaca,mengamati dan menelaah isi dari pesan itu jadi masih aman dan terhindar dari modus yang sangat meresahkan itu..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "April 07, 2023, 01:05:07 AM",
      "body": "Quote from: Renampun on April 05, 2023, 02:41:44 PMtapi kayaknya penipu tersebut punya orang dalam yang tahu semua informasi data privasi CC mas. Sebenarnya penipu itu tidak tahu data CC ane setelah ane tidak menyebutkan secara langsung ke dia. Trik yang dia pakai itu adalah data KTP ane yang tahu semua detil sampai tanggal lahir dan Alamat, sehingga mambuat ane percaya kalau penipu itu merupakan karyawan bank.Quote from: Renampun on April 05, 2023, 02:41:44 PMbulan lalu, tetangga saya minta foto KTP saya dengan alasan untuk pemilu (DPR) dan di bayar 50 ribu, langsung saya tolak, enak aja beli data diri orang seharga 50 ribu, mending gitu terpilih langsung ada manfaat nya ama saya, ini gak, gitu terpilih langsung kabur merasa diri paling hebat.Harap hati-hati juga misal mau fotocopy KTP di kedai-kedai poto copian, biasanya para caleg akan nongkrong juga di sana untuk minta data secara diam-diam, jadi ketika kita mau poto copy 5 lembar dibikin 6 lembar oleh karyawan nakal, satunya diselipin buat nanti data sicaleg nyalon pilkada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "April 07, 2023, 03:55:04 PM",
      "body": "Quote from: blue Snow on April 07, 2023, 01:05:07 AMQuote from: Renampun on April 05, 2023, 02:41:44 PMtapi kayaknya penipu tersebut punya orang dalam yang tahu semua informasi data privasi CC mas. Sebenarnya penipu itu tidak tahu data CC ane setelah ane tidak menyebutkan secara langsung ke dia. Trik yang dia pakai itu adalah data KTP ane yang tahu semua detil sampai tanggal lahir dan Alamat, sehingga mambuat ane percaya kalau penipu itu merupakan karyawan bank.Quote from: Renampun on April 05, 2023, 02:41:44 PMbulan lalu, tetangga saya minta foto KTP saya dengan alasan untuk pemilu (DPR) dan di bayar 50 ribu, langsung saya tolak, enak aja beli data diri orang seharga 50 ribu, mending gitu terpilih langsung ada manfaat nya ama saya, ini gak, gitu terpilih langsung kabur merasa diri paling hebat.Harap hati-hati juga misal mau fotocopy KTP di kedai-kedai poto copian, biasanya para caleg akan nongkrong juga di sana untuk minta data secara diam-diam, jadi ketika kita mau poto copy 5 lembar dibikin 6 lembar oleh karyawan nakal, satunya diselipin buat nanti data sicaleg nyalon pilkada.Saya sering sekali mejumpai hal semacam itu di setiap minggu melalui SMS atau Whastapp, bahkan mungkin terjadi hampir setiap hari ada yang memberikan SMS seperti itu yang rata-ratanya mengatasnamakan perusahaan seperti bank, perusahaan multi media, dan perusahaan lainnya yang menawarkan hadiah yang pada dasarnya saya tidak pernah berkaitan dengan mereka.Untung anda tidak tertipu om blue Snow, karena banyak kejadian di sekitar saya yang terkena penipuan seperti itu.Untuk trik semacam itu saya pikir lebih mungkin terjadi, kebetulan saya juga pernah melakukan sensus dan bekerja di fotocopyan yang ternyata mendapatkan data orang itu lebih mudah, dan mereka yang curang dalam pekerjaan itu pasti memanfaatkan untuk menjual data orang, dan lagi terkadang saya juga melakukan foto copy tidak hanya KTP tetapi banyak data-data yang lainnya seperti akta, ijazah daftar riwayat hidup dll, yang mungkin data seperti itu yang di jual sehingga mereka mengetahui sesuai dengan data anda om.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "April 08, 2023, 03:51:49 AM",
      "body": "Kesalahan yang sering dilakukan oleh para korban scammer adalah mereka sering kali tergiur dengan hadiah yang ditawarkan oleh scammer dan cepat-cepat mengambil keputusan tanpa bertanya dahulu kepada orang lain. Apalagi kita tahu bahwa identitas kita sekarang ini sudah tidak aman, dan maaf saja di negara kita terkhususnya, sudah sering kasus kebocoran data dan jadi tidak heran bahwa para scammer sekarang ini tahu data identitas kita. Maka dari itu menjaga kerahasiaan CVV dan tidak perlu memberikan kode OTP secara sembarangan bahkan kepada CS dari CC kita adalah hal yang sangat penting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "April 08, 2023, 07:57:46 AM",
      "body": "Quote from: dian82 on April 06, 2023, 07:32:48 AMHampir saja ya om blue snow paporitku di forum ini kena tipu, namun seperti yg om bilang sudah terbiasa membaca,mengamati dan menelaah isi dari pesan itu jadi masih aman dan terhindar dari modus yang sangat meresahkan itu.. wah, mas blue snow ada fans nya Quote from: blue Snow on April 07, 2023, 01:05:07 AMQuote from: Renampun on April 05, 2023, 02:41:44 PMtapi kayaknya penipu tersebut punya orang dalam yang tahu semua informasi data privasi CC mas. Sebenarnya penipu itu tidak tahu data CC ane setelah ane tidak menyebutkan secara langsung ke dia. Trik yang dia pakai itu adalah data KTP ane yang tahu semua detil sampai tanggal lahir dan Alamat, sehingga mambuat ane percaya kalau penipu itu merupakan karyawan bank.Quote from: Renampun on April 05, 2023, 02:41:44 PMbulan lalu, tetangga saya minta foto KTP saya dengan alasan untuk pemilu (DPR) dan di bayar 50 ribu, langsung saya tolak, enak aja beli data diri orang seharga 50 ribu, mending gitu terpilih langsung ada manfaat nya ama saya, ini gak, gitu terpilih langsung kabur merasa diri paling hebat.Harap hati-hati juga misal mau fotocopy KTP di kedai-kedai poto copian, biasanya para caleg akan nongkrong juga di sana untuk minta data secara diam-diam, jadi ketika kita mau poto copy 5 lembar dibikin 6 lembar oleh karyawan nakal, satunya diselipin buat nanti data sicaleg nyalon pilkada.makasih mas info nya, saya baru tahu kalo caleg banyak yang kerja sama ama fotokopi untuk mendapatkan data KTP warga, pantes aja di sekitar rumah saya kan ada kampus tuh, dan seorang oknum caleg mendanai sebuah usaha fotokopi (kayak investasi gitu) apa mungkin tujuannya adalah seperti ini, banyak ya cara mereka untuk mendapatkan suara. data pribadi kita memang tidak akan pernah aman, apalagi saat menjalani aktifitas sehari hari, kita biasa saja tanpa sengaja memberitahukan hal privasi, perlu sikap hati2 selalu, agar tidak jatuh dalam perangkap tipu daya yang mereka lakukan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 08, 2023, 12:42:44 PM",
      "body": "Tapi si penipu ini kok tau ya masnya punya CC dapat ingpo dari mana dia , mungkin kalau data pribadi dari ktp waktu FC ktp tapi kalau CC dari mana dan satu lagi kapan hari ane juga hampir kena tipu dia ngomong kalau saudara ane abis kecelakaan dan suruh bayar biaya admin Rumsh sakit + bayar polisi. panik ane telpon saudara ane ternyata gak ada apa apa. alhasil sekarang ane pasang GetContact biar tau siapa yang telpon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "April 09, 2023, 12:03:00 AM",
      "body": "Quote from: dansus021 on April 08, 2023, 12:42:44 PMTapi si penipu ini kok tau ya masnya punya CC dapat ingpo dari mana dia , mungkin kalau data pribadi dari ktp waktu FC ktp tapi kalau CC dari mana Ya bisa jadi dari orang dalam, saya lihat OP dapat sms dengan nama BANK MANDIRI. Kalau saya perhatikan dari banyak berita di televisi, kalau banyak kedapatan pegawai bank yang menggelapkan dana nasabah, korupsi dan kejahatan lainnya, bisa jadi ada di antara mereka yang membocorkan data nasabah ke orang yang tidak bertanggung jawab. Mendekati lebaran begini biasanya banyak keperluan yang membutuhkan dana besar mas, untuk itu segala cara dipakai oknum. Oleh karena itu kita tidak wajib percaya kepada orang lain baik itu pegawai bank sendiri sebelum memverifikasinya. “Don't Trust, Verify”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "April 09, 2023, 10:29:54 PM",
      "body": "Quote from: Renampun on April 05, 2023, 02:41:44 PMbulan lalu, tetangga saya minta foto KTP saya dengan alasan untuk pemilu (DPR) dan di bayar 50 ribu, langsung saya tolak, enak aja beli data diri orang seharga 50 ribu, mending gitu terpilih langsung ada manfaat nya ama saya, ini gak, gitu terpilih langsung kabur merasa diri paling hebat.Yang menjadi masalahnya bukan ada atau tidaknya manfaat dari DPR tersebut, tetapi lebih kepada data identitas kita yang kebawa kemana-mana dan sangat di sayangkan ketika ada orang yang memanfaatkan ini pada kegiatan yang tidak kita ketahui, jika Mas pernah dengar pinjaman pinjol yang membuat identitas palsu untuk mengambil pinjaman, kira-kira bagaimana jika itu terjadi pada kita ya?Quote from: blue Snow on April 07, 2023, 01:05:07 AMSebenarnya penipu itu tidak tahu data CC ane setelah ane tidak menyebutkan secara langsung ke dia. Trik yang dia pakai itu adalah data KTP ane yang tahu semua detil sampai tanggal lahir dan Alamat, sehingga mambuat ane percaya kalau penipu itu merupakan karyawan bank.Beruntung mereka ngerjain Mas yang sudah paham masalah beginian ya sehingga mereka tidak berhasil, bagaimana jika itu dilakukan kepada orang awam yang tidak mengetahui pola penipuan, pasti akan kejebak dengan skema yang mereka jalankan.Seperti yang saya katakan Mas, jika pola manual mereka mendapatkan indentitas (KTP) kita melalui jalur DPR yang mengumpulkan banyak KTP, banyak orang yang terjebak di sini dan tau-taunya mereka telah terdaftar di bantuan yang tidak pernah mereka ajukan, tetapi jika pelaku lebih pandai dan menguasai teknologi informatika ada banyak cara lain yang dapat mereka lakukan, misalnya seperti mencoba membobol situs tempat KTP tersebut di keluarkan atau tempat induk yang menyimpan semua identitas orang Indonesia. Seperti kasus yang pernah terjadi di tahun 2022 NIK 105 Juta Penduduk yang Datanya Bocor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "April 11, 2023, 04:16:46 AM",
      "body": "Quote from: MarjorieZimmermanGinger on April 09, 2023, 10:29:54 PMQuote from: blue Snow on April 07, 2023, 01:05:07 AMSebenarnya penipu itu tidak tahu data CC ane setelah ane tidak menyebutkan secara langsung ke dia. Trik yang dia pakai itu adalah data KTP ane yang tahu semua detil sampai tanggal lahir dan Alamat, sehingga mambuat ane percaya kalau penipu itu merupakan karyawan bank.Beruntung mereka ngerjain Mas yang sudah paham masalah beginian ya sehingga mereka tidak berhasil, bagaimana jika itu dilakukan kepada orang awam yang tidak mengetahui pola penipuan, pasti akan kejebak dengan skema yang mereka jalankan.Sebenarnya itu hanya sepersekian detik saja ane hampir kena mas, kalau ente lihat poto ane prove di atas, ane yakin sekali sekaliber security cyber sekalipun akan kena kalau bacanya sekilas. Ane jujur, ketika ane baca itu sekali, ane langsung mau nyebut kode OTP yang di layar, tapi kayak ada terlintas gitu ane harus baca 2x, dan ternyata benar, ane baca 1x lagi ada tulisan trx buka lapak. Ane itu masih penasaran sampai sekarang, bagaimana bisa sms BANK MANDIRI itu dibuat scammer, entah mereka pakai kode apa, soalnya kan kalau nomor baru, biasanya hanya nomor, bukan tulisan BANK MANDIRI gitu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "April 11, 2023, 07:29:20 AM",
      "body": "Quote from: blue Snow on April 11, 2023, 04:16:46 AMAne itu masih penasaran sampai sekarang, bagaimana bisa sms BANK MANDIRI itu dibuat scammer, entah mereka pakai kode apa, soalnya kan kalau nomor baru, biasanya hanya nomor, bukan tulisan BANK MANDIRI gitu.Dulu saya pernah mendapat notifikasi dari orang yang saya kenal (lupa apakah berupa sms atau panggilan telepon) yang memunculkan PopUp Nama tertentu yang tidak seperti biasanya.Mungkin yang dimaksud diatas adalah sejenis SMS Masking; Salah satu provider telepon seluler di Indonesia setahu saya menyediakan jasa seperti ini seperti contoh https://myads.telkomsel.com/. Sebenarnya itu dimaksudkan untuk media iklan yang lebih personal ke pelanggan atau siapapun user yang bahkan ketika mereka tidak memiliki nomor kontak kita pun tetap bisa mengetahui pengirimnya melalui Nama khusus yang disetting menggantikan nomor telepon tersebut.Namun yang namanya scammer mereka akan memanfaatkan cara apapun termasuk membuat model SMS masking seperti itu untuk mengelabui target, minimal untuk membuatnya percaya terlebih dulu kalau itu seolah SMS resmi terlepas apakah berikutnya si target membaca lagi atau tidak tulisan peringatan yang tercantum di SMS OTP.Btw, di sms itu tertera pesan jangan berikan kode ke siapapun dan informasi TRX di Bukalapak, logikanya kalau memang itu bukan dari BANK MANDIRI dan malah dari si Scammer, mengapa juga mereka susah-susah menelepon agan untuk menanyakan kode OTP yang tercantum disana?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}