{
  "id": "topic_5417562",
  "title": "House7house",
  "author": "House7house",
  "created_time": "October 18, 2022, 04:00:15 PM",
  "content": "Btc Will be USD and USD Will be btcThe new btc is USD the usdt and usdc so BIG bull run Will be For usdt.Btc Will belike dollar and dollar Will be Like bitcoin.But usdt IS a LOT more better then btc transactions IS faster specially people turn in tron USD trc20 right now best coin over the world fast transactions and a LOT liquity.All other cutrencies Will fall If you hold usdt you Are safe it Will Grow Like btc did.The target of usdt is 60k $",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417562",
  "comments": [
    {
      "author": "Asiska02",
      "created_time": "October 18, 2022, 05:10:42 PM",
      "body": "I am trying to comprehend what you’re trying to say but I don’t still understand it. Maybe you should get a tool online (quillbot, duplichecker) that will make your English more comprehensive, so that others can understand the message you’re trying to pass accordingly. Quote from: House7house on October 18, 2022, 04:00:15 PM.All other cutrencies Will fall If you hold usdt you Are safe it Will Grow Like btc did.The target of usdt is 60k $ I don’t understand what you’re implying here. USDT is a stable coin while others still see it is an alternate cryptocurrency, but what do you mean by USDT will rise like the way BTC did? Maybe you should do more research on a particular subject matter before posting about it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 18, 2022, 05:26:29 PM",
      "body": "So at the end of all the long story, your conclusion is just in passing information to hold usdt even bitcoin will fall right? That's a very wrong anf bad idea here, this discussion is centered on stablecoins, not bitcoin discussion, in your post you even maklde it clear how stable coin could also withstand a fall when bitcoin and others are falling, I don't know where you got your ideas from but it's not recommendable and I don't even think you yourself understand what you're saying, this thread could best fit in altcoins discussion board i think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "October 18, 2022, 05:50:03 PM",
      "body": "Your comments sound like a rhythmic poem, I guess you are a poet.   Quote from: House7house on October 18, 2022, 04:00:15 PMBtc Will be USD and USD Will be btcHow can USD be Bitcoin? They are both different currencies that can never be the same. USD is centralized and issued by a central Bank while Bitcoin is decentralized and is not issued by any bank. Hence, I don't know where you got your inspiration or facts from.  QuoteThe new btc is USD the usdt and usdc so BIG bull run Will be For usdt.Btc Will belike dollar and dollar Will be Like bitcoin.I think you are just hallucinating. USDT is backed by the dollar and it is affected by the fall and rise of dollars. Maybe you are insinuating that Bitcoin would soon be adopted and used by the majority of the world's population like the dollar. This might be true because the opportunities that Bitcoin offers is attracting more users.  QuoteBut usdt IS a LOT more better then btc transactions IS faster specially people turn in tron USD trc20 right now best coin over the world fast transactions and a LOT liquity.All other cutrencies Will fall If you hold usdt you Are safe it Will Grow Like btc did.The target of usdt is 60k $ Although you are entitled to your own opinion you must ensure that your comments are true and backed with facts. You should not just come up with unproven and inaccurate information and think that people would believe them. How would you predict that USDT (1.02 USD.) would soon rise to 60,000 dollars? Only Bitcoin has such capabilities and it has always proved it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "October 18, 2022, 05:59:25 PM",
      "body": "Quote from: House7house on October 18, 2022, 04:00:15 PMThe target of usdt is 60k $ What are you talking about? USDt is supposed to be paired 1:1 to USD, so how can it be worth 60k USD if it was worth 1 in 2021 when USD was cheaper than it is now and after a few pumps by the FED USDt is still worth 1 USD, or at least its price is 1 USD. I don't know how much it's really worth, but since it's not 100% backed I'd say that USDt is really worth about 0.9 USD. Also, a centralized coin will never be equal to a decentralized coin. They are not and never will be the same thing. QuoteAll other cutrencies Will fall If you hold usdt you Are safe it Will Grow Like btc did.Another dumb claim. All countries will never abandon their currencies to use USD because that would mean accepting the superiority of the US FED. Why should Russia or China ever accept the superiority of the FED? This is nonsense",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "October 18, 2022, 06:04:05 PM",
      "body": "Confusing post. I guess op is trying to state that BTC is the new USD while USDT will become the new BTC later on. If this is accurate, you are delusional op since BTC will never overtake USD and USDT will never overtake BTC.Why? Because BTC was never created to completely replace and overtake popular FIAT like USD. Instead, it was designed to serve as an alternate payment currency.Also, BTC will always be the king of cryptocurrencies and USDT or any other cryptocurrency will never overtake it in the short-term and the long-term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "October 18, 2022, 06:04:34 PM",
      "body": "My head hurts now.Put the bong down dude",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "October 18, 2022, 06:24:15 PM",
      "body": "Lol,, how can a stable coin be priced at $60k that's really weird..I'll try to understand even if it's a little confusing for me.So USD will never exceed the price of any coin because this is a stable coin that is compared to other fiat money so for me if you compare it with Bitcoin it is clear that this is in a different direction especially when you say USD will grow the same as Bitcoin.USD will remain $1BTC will go up $60k - $100k or even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lewan",
      "created_time": "October 18, 2022, 06:57:06 PM",
      "body": "First of all, it's logically wrong. USDT will be 60 thousand dollars, which means that every dollar in the hands of people will increase 60 times. This is impossible. I guess I didn't quite understand what you mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "October 18, 2022, 08:03:21 PM",
      "body": "I don't think it is necessary to ask where you get your information but I can clearly see you are trying to be a troll here. You have mentioned three different stablecoin in your post trying to make a senseless point. Why don't you tell us how btc will now become USD, USDC or USDT? I will suggest you take time to read through the forum slowly, it will help you understand better what btc is and why it will never be usd, usdc or usdt as you fantasise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 18, 2022, 09:15:03 PM",
      "body": "Seems you came from another planet lol. Do you know even what are you writing? Learn what does mean stable coin first before writing the topic. I believe even you don't understand what you have written. BTC won't be stable due to decentralize behavior and a stable count won't call if it's not stable. Then it will consider generic altcoin. Can you be more specific about how do you think BTC will be stable and stable coins would be volatile? Do you have any source of your thoughts or just madness?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 18, 2022, 09:25:59 PM",
      "body": "Quote from: House7house on October 18, 2022, 04:00:15 PMBtc Will be USD and USD Will be btcThe new btc is USD the usdt and usdc so BIG bull run Will be For usdt.Btc Will belike dollar and dollar Will be Like bitcoin.But usdt IS a LOT more better then btc transactions IS faster specially people turn in tron USD trc20 right now best coin over the world fast transactions and a LOT liquity.All other cutrencies Will fall If you hold usdt you Are safe it Will Grow Like btc did.The target of usdt is 60k $ You prefer to hold a highly inflationary currency like the Ustd which is highly centralized and controlled by the bank, vs Bitcoin which is anti-inflationary and also doubles as an asset. There is no thought that during a bear market stable coins like those users may have a preferable choice to hold but it will still amount to a total waste of time in the long run because when the bull happens is only your bitcoin that will peak with the market and your USD will become weak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}