{
  "id": "topic_5415627",
  "title": "fennic",
  "author": "fennic",
  "created_time": "October 01, 2022, 06:20:23 PM",
  "content": "Hi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415627",
  "comments": [
    {
      "author": "Anonylz",
      "created_time": "October 01, 2022, 06:36:12 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?Hope you don't get a heart attack because of btc because while you are gone the market will keep moving ahead. If you want to have peace of mind in this market, learn to have a long-term goal, this way all these minor drops won't bother you too much, but if you keep looking at the market every second then you are definitely close to getting a heart attack.If you can't handle the pressure don't be in this space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 01, 2022, 06:38:38 PM",
      "body": "Get professional help if price fluctuations in things like stocks and crypto are life-threatening to you and give you panic attacks. Seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "October 01, 2022, 06:45:23 PM",
      "body": "Heart attack? I really don't think this is the right market for you since it's an extremely volatile market where swings happen quite often honestly speaking. Recent BTC swings have actually been pretty small.You should always invest only what you are willing to lose. If you don't maintain this mindset, you will suffer a lot whenever things don't go your way in this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 01, 2022, 06:47:01 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?Seems like you aren't a believer in Bitcoin and are just trying to get some easy money.  The free market has a way of making sure you lose everything trying to trade to profits with that mindset.  If you sold all your Bitcoin, then you stopped believing in it and shouldn't care what happens to the price.  If you think a tiny move that cost you a couple of dollars is enough to give you a heart attack, wait until the price goes up x20 and think about how you missed the boat because you were trying to trade to earn a few extra dollars.  You either believe in Bitcoin or you don't.  If you believe, invest and use or hold onto it.  If you don't believe, who cares?  Trading is for suckers though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ihugbogo",
      "created_time": "October 01, 2022, 06:54:23 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?200$ worth of bitcoin? what will people who are holding 10k$ above do, will they commit succeed?. before you get your self involve into crypto currency, you should always have in mind that there are times for dump and pump, non of this season last forever. Having this in mind will give you less heart attack. that's why we are always advice to invest what we can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 01, 2022, 07:00:37 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMWhat should I do about this?Here are some suggestions:Learn more about bitcoin.Don't try to time the market. There is an unknown number of factors that affect the price, and if you don't have data you shouldn't rely on astrology.Don't buy bitcoin if you're about to sell it within the next few months.See a doctor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "October 01, 2022, 07:10:44 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?no pumps, bitcoin is currently down 1% and there is no convincing price increase, the price is still above $19k and will probably touch $20k then drop back down, that's how it has been since yesterday, so you don't need to panic and worry, but if you don't want to have a heart attack you can buy bitcoins then save your bitcoins on a trusted exchange then come back 2 years later to see the results, delete all exchange apps, crypto wallets and others so you don't see any of your crypto assets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "October 01, 2022, 07:31:41 PM",
      "body": "You'll need to refrain from investing if you cannot bear the risk of failure. I don't know where you're from, but $200 is a small amount. I've been screwed off with way higher amounts, either by selling too early or by buying too high. As someone who has previously suffered (and still occasionally suffers) with anxiety and stress, I'd advise you to keep off trading if you don't have the stomach for it. Anxiety was the main reason I gave up trading and stuck to holding Bitcoin. I don't even care how much Bitcoin is worth; my main goal is to accumulate as much as possible.It wouldn't hurt if you were to seek help from a psychologist, as NotATether suggested. Money shouldn't revolve around our lives; it shouldn't stress us to the point of having a possible heart attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "October 01, 2022, 07:42:43 PM",
      "body": "Hodl (do NOT gamble/trade), see a doctor, get some (chill) pills! ps: 95% of traders lose money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoanPirtez",
      "created_time": "October 01, 2022, 07:43:31 PM",
      "body": "You'd better hodl a few BTC buying some every mounth, then start study and practice trading in a demo mode until you close at least half of your trades in profit.Also you'd better work on emotional aspects to prevent anxiety and depression during your trading adventures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "October 01, 2022, 07:44:15 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?Simple and very simple, just give yourself time toearn and study bitcoin price speculation very well, this is one of the advise you could get that can be of help to you when you learn, the mistake you did is that you never sit to develop yourself and the hardest ways of learning is when you've already made a mistake from it, the forum has alot of learning aids that could fasten your growth process if you key in for it, personally create time to search through the forum to discover many related areas that had been talked about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 01, 2022, 08:30:55 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?Before you commit to invest that kind of money into Bitcoin, treat it as \"dead money\" like having a mindset that you're likely gonna likely lose. Coz' if you expect too much to profit, you will likely get disappointed and going to get your emotions running high. But if you indeed gonna profit, that's already great. Whether if it's small or big, profit is profit and you win.Make sure that you only invest and trade what you can afford to lose on Bitcoin and not going all-in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "October 01, 2022, 08:49:34 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?Lolz, we all experience this same scenario, I personally have experience this so so many times, so it is not entirely something new.Advice I can give to you is stop looking for short term profit, looking for short term profit is the reason why you even notice that bitcoin goes down after you have bought, investing for long term will make you see the decline in price as an opportunity to buy more at a lower rate thereby bringing your average dollar cost down.So better learn to stop panic-buying and panic-selling and invest for the long term, hold and take your eyes away from the price actions, anytime you decide to look at the price, it should be you checking whether its time to buy more or keep holding what you already bought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "October 01, 2022, 08:53:24 PM",
      "body": "There is no reason to get heart attack out of the bitcoin market fluctuation. Almost everyone who are into the market should understand before getting into bitcoin usage as investment and for other needs. Many people will experience this, when they plan to sell the price drops and while dropping the price increases.$200 won't have much variation out of the fluctuation. If you find your body experiencing some difficulty out of the market fluctuation with bitcoin, try to stay away from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rendravolt",
      "created_time": "October 01, 2022, 09:07:27 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?Keep calm man, don't have weird thoughts. There are many experiences that you can take from this incident, including the price of bitcoin which tends to be volatile. But as much as possible you don't panic and your mental health must be maintained to avoid various diseases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 01, 2022, 09:20:25 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?So ask yourself, health or bitcoin? obviously if you chooses your health then stay away from bitcoin investment because it's not for you or at least you may have the wrong impression that it might not be volatile and unstable and the price is going parabolic.It's easy choice mate, you don't have to complicate it in your end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "October 01, 2022, 09:34:33 PM",
      "body": "Quote from: Anonylz on October 01, 2022, 06:36:12 PMQuote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this?Hope you don't get a heart attack because of btc because while you are gone the market will keep moving ahead. If you want to have peace of mind in this market, learn to have a long-term goal, this way all these minor drops won't bother you too much, but if you keep looking at the market every second then you are definitely close to getting a heart attack.If you can't handle the pressure don't be in this space. Do not keep on monitoring the price of bitcoin, because if you do, you will really get a heart attack due to its high volatility and price fluctuations from time to time. Just stay calm and relax, because even if bitcoin price drops drastically, it will always manage to recover and will be able to reach another peak again. Otherwise, if you can’t control yourself, better stay away from crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "October 01, 2022, 09:58:44 PM",
      "body": "$200 is peanuts, unless you live in Venezuela perhaps...?I mean, come on, Michael Saylor has billions in stake on BTC and he's cool like ice. Why can't you be the same with only 200 bucks? Seriously, it sounds ridiculous as fuck!Get over it. Learn to have patience and discipline. It's not gambling (unless you want it to be).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "October 01, 2022, 09:59:15 PM",
      "body": "Quote from: fennic on October 01, 2022, 06:20:23 PMHi guys I think I might have heart Attack cause when I buy Bitcoin it goes to lows and when I sell Bitcoin it goes higher and today I sold my all Bitcoin earnings that were 200 dollars and than. BITCOIN starting pumping very hard and that was very very annoying to me. What should I do about this? Bitcoin is for long term investment so you have to be very patient whenever you see price decline, as it’s not going to stay happening all the time. If I were you, since bitcoin price changes affects you so much, then never  do price check most often so you will have peace of mind. And do not think of short term selling for small profits, always prefer long term hodling and only sell it when bitcoin hits its new all time high. That way, you will never be paranoid and prone to heart attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}