{
  "id": "topic_5461101",
  "title": "Changee",
  "author": "Changee",
  "created_time": "July 26, 2023, 11:25:06 AM",
  "content": "Changee​Changee - is a modern exchange service which, thanks to our new rate matching system, will find you the best exchange rate for your exchange. Our system is easy to use and completely transparent.What we offer:- Best Rates. We will find the best rate for you based on the rates of the most reputable exchanges.- Fast exchanges. Exchanges on our platform take an average of 10 minutes.- Large selection of cryptocurrency pairs. Every month we add new coins so you can find what you need.- Security. You can be sure that the funds coming from us are absolutely clean, as they come from reliable liquidity providers.- Unlimited Exchanges. With us you can exchange your cryptocurrency in any volume.- Support 24/7- Minimal commissions. Our commissions are only 0.25%.Supported exchange destinations:BTC/ETH, BTC/USDT, ETH/USDT, USDT/SOL, BTC/XMR, ETH/XRP and more than 200 more cryptocurrency pairs, which are constantly being supplemented.Changee Affiliate Program.With us you can not only profitably exchange your crypto-assets, but also earn by inviting new users. From each exchange of your invited user you will receive 50% of our commission.Cashback system.The more you exchange, the higher the level of your cashback. You can read more about the levels of cashback on our website in the \"Cashback\" section.Our goal is to show users from all over the world how to exchange cryptocurrency anonymously, safely and profitably in a couple of clicks. We want to create around our service a dedicated community of those who value their time and money. Here we are just for this purpose. Therefore, we will be glad to receive any feedback or feedback about our service.To contact us:support@changee.comchangee.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461101",
  "comments": [
    {
      "author": "examplens",
      "created_time": "July 26, 2023, 11:57:56 AM",
      "body": "I looked at your feedback on Trustpilot, I must admit that they look very suspicious to me. It looks more like a paid campaign to create a positive reputation.Someone who pays to get fake feedback cannot be considered reliable.You have only been on BestChange monitoring for a month, there is still no feedback.Can you explain the nature of the partnership between you and Coinbase, Binance, Okex... what you stated on the site. Do these companies know about the partnership with Changee.com?p.s. You need to move this topic to the Exchanges section, certainly, it belongs there. In the bottom left corner is the \"move\" option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "July 26, 2023, 11:59:46 AM",
      "body": "Quote from: Changee on July 26, 2023, 11:25:06 AM- Security. You can be sure that the funds coming from us are absolutely clean, as they come from reliable liquidity providers.- Unlimited Exchanges. With us you can exchange your cryptocurrency in any volume.These two lines are slightly contradictory, the fact that the coins are clean and from reliable providers means that you need to enforce identity verification, otherwise your service is like money laundering as you give clean coins (I am against this concept) to anonymous people.if we assume that you do not require KYC aka unlimited exchanges, then why am I required to approve it before making any transaction?https://changee.com/docs/kycBitcoin Taproot address (P2TR) is not supported.It is true that you have 4.8 on trustpilot, but they are all positive and only during the last 5 months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "July 26, 2023, 12:48:02 PM",
      "body": "I am unsure if I will use a service that asks for KYC because there are already centralized exchanges that are more reliable than yours. Since both ask for a KYC, I don't see any point in using this service since I am already KYCed on another platform. That's just my opinion. The website looks good enough, and I am surprised to see your Trustpilot reviews. Usually, popular platforms have many negative reviews, but you seem different here. It would be good for the business if you can keep it up. Anyways, this topic should moved to Exchanges board",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "July 26, 2023, 01:19:30 PM",
      "body": "Inconsistent offers.Quote from: Changee on July 26, 2023, 11:25:06 AMOur goal is to show users from all over the world how to exchange cryptocurrency anonymously,Meanwhile[1],Quote...The user will be prompted for an AML/KYC check. ...We inform you that Changee reserves the right to appoint a third-party service provider to conduct the AML/KYC procedure....Changee may share information from the AML/KYC procedure with law enforcement authorities if legally requested.Wonder how users can go anonymously with these conditions? Or you define differently how anonymity should be.1. https://changee.com/docs/kyc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "July 27, 2023, 07:32:05 PM",
      "body": "Quote from: Learn Bitcoin on July 26, 2023, 12:48:02 PMSince both ask for a KYC, I don't see any point in using this service since I am already KYCed on another platform. That's just my opinion. The website looks good enough, and I am surprised to see your Trustpilot reviews. Usually, popular platforms have many negative reviews, but you seem different here. It would be good for the business if you can keep it up. Based on this page, they do not require \"know your customer\" for all transactions but they have an automated risk assessment system to detect suspicious activity during transactions that makes them do this and they did not explain how this system works and it may be an argument to close your account at any time.QuoteChangee has an automated risk assessment system to detect suspicious activity during transactions. A transaction will be suspended, if the system flagged it as suspicious. The user will be prompted for an AML/KYC check. For security reasons, we cannot disclose specific risk assessment criteria for our system, but it has proven very effective in combating money laundering and fraud.They did not set a limit for the transaction, and therefore you can make a transaction of $ 5 and you are not required to verify your identity, and suddenly your money is suspended under the pretext that it is suspicious.If your coins is from a mixing or gambling service, it will most likely be frozen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Changee",
      "created_time": "August 23, 2023, 01:13:44 PM",
      "body": "Hello! Great news for you - CAPO is already available for exchange in our exchanger!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}