{
  "id": "topic_5398275",
  "title": "ajaxtempest",
  "author": "ajaxtempest",
  "created_time": "May 12, 2022, 08:55:34 AM",
  "content": "So yesterday i was replying to a user asking for helphttps://bitcointalk.org/index.php?topic=5398197.msg60104461#msg60104461I first quickly replied to the questions and then edited my reply afterwords. What shocked me is that the forum software does not tell if a user has edited the reply!eg of edited replyhttps://www.godlikeproductions.com/forum1/message5111991/pg1#93765729not related to the topichttps://www.godlikeproductions.com/forum1/message5130899/pg1Can the admins add this feature?Apologies for linking a conspiracy forum. I am a user there since 15 years and it was from that website i heard about bitcoin back in 2011.ps: i have edited it 3 times!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398275",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "May 12, 2022, 09:05:41 AMLast edit: May 12, 2022, 10:04:04 AM by OmegaStarScream",
      "body": "It will only show if you edited the post after 10 minutes from first posting that reply. Here's an example (hover over the date): https://bitcointalk.org/index.php?topic=5398197.msg60104329#msg60104329",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "May 12, 2022, 09:08:04 AM",
      "body": "However there's an archive version created by @TryNinja so anyone can see the edited and unedited version, this is your post https://ninjastic.space/post/60109353",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "May 12, 2022, 09:09:53 AM",
      "body": "Quote from: ajaxtempest on May 12, 2022, 08:55:34 AMWhat shocked me is that the forum software does not tell if a user has edited the reply!I would not expect too much implementation get done on this forum software, since we will eventually migrate to new forum software someday. (And afaik that's basically done and being polished.)But if you are so much interested in the changes of a topic, you can use 3rd party, like https://ninjastic.space/post/60109353 , which can catch better some of the edits/versions (I don't know if all of them, I didn't care so much).Even more, if you install the BPIP extension then you'll have at hand link to the post archive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 12, 2022, 09:12:20 AM",
      "body": "You'll need to rely on a third-party app to do this or do it yourself, but again, you'll need to make a copy/check every few seconds or minutes.Even the edit that happens after 10 minutes only informs you who made the edit and not the original post, so it is important to know if someone/user edited something in the thread for future purposes.Personally, I think this is good because the forum is for discussions and we make some mistakes, 10 minutes or 3-5 minutes to review the post and edit it will be good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajaxtempest",
      "created_time": "May 12, 2022, 09:12:40 AM",
      "body": "Quote from: OmegaStarScream on May 12, 2022, 09:05:41 AMIt will only show if you edited the post after 10 minutes from first posting that reply. Here's an example (hover over the date): https://bitcointalk.org/index.php?topic=5398197.msg60104329#msg60104329Ok i understand. I think it is done to save server space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "May 12, 2022, 12:15:58 PM",
      "body": "Any post or reply if edited will show up as last edited. I personally do not think a detailed information about editing will benefit anyone in the forum. Also I do not understand the need to post those links as they are basically asking for registration. You could have captured those edit display as images, uploaded on Imgur and posted here the direct links.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "May 12, 2022, 07:55:51 PM",
      "body": "Quote from: OmegaStarScream on May 12, 2022, 09:05:41 AMIt will only show if you edited the post after 10 minutes from first posting that reply. Here's an example (hover over the date): https://bitcointalk.org/index.php?topic=5398197.msg60104329#msg60104329Thank god for that as well.  I'm guilty of posting from my phone quite a bit (what else are you going to do on the toilet) and autocorrect is definitely a thing.  There have been more than a few times where I've said something like \"don't\" and it's changed to \"do\" leading my post to be the exact opposite of the intent.  Luckily, because of this grace period I can usually go back and correct the mistake.  Sure, I could proofread before hitting the send button, but that's no fun.  Using the transcription feature to talk your posts usually leads to hilarious posts as well, but if it's somewhat understandable I'll usually just let it go.  Newfangled technology for us old folks tends to lead to degradation of content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajaxtempest",
      "created_time": "May 13, 2022, 05:34:59 AM",
      "body": "Quote from: pakhitheboss on May 12, 2022, 12:15:58 PMAny post or reply if edited will show up as last edited. I personally do not think a detailed information about editing will benefit anyone in the forum. Also I do not understand the need to post those links as they are basically asking for registration. You could have captured those edit display as images, uploaded on Imgur and posted here the direct links. no reg is reqd. only two check ticks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 13, 2022, 07:10:32 AM",
      "body": "Quote from: ajaxtempest on May 12, 2022, 09:12:40 AMI think it is done to save server space.It's because ninja-edits are assumed to by fixing typos. It's not important enough to store.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 13, 2022, 09:22:00 PM",
      "body": "Quote from: Apocollapse on May 12, 2022, 09:08:04 AMHowever there's an archive version created by @TryNinja so anyone can see the edited and unedited version, this is your post https://ninjastic.space/post/60109353I just want to add, that if anyone wants to easily access the link Apocollapse has shared they could download the BPIP extension of bitcointalk. when you download the bpip extension a \"view archive\" will appear next to the report moderator which will bring you to the edited and unedited version of the post if you click. the extension also gives you features that are not available in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "May 17, 2022, 08:39:06 PM",
      "body": "I have experienced this on several occasions where I edit my post immediately after posting and it doesn't show \"edited\" at the top, I Initially thought just the same thing as the op, but I cared less about it since it doesn't really matter to me..I also saw that some other times, I edit a post I've made maybe a while ago and I get the \"edited\" tag at the top, so one day decided to find out why, and just like @OmegaStarScream said, I discovered that the \"edited\" tag only appear when you edit the post 10 minutes up after it was initially published/posted.I guess this forum made it this way to atleast, give users some time to still make some unnoticeable changes or corrections their posts incase of mistakes or  prematurely/mistakenly clicking the \"post\" button while still typing/creating the post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 17, 2022, 09:04:42 PM",
      "body": "Quote from: Fivestar4everMVP on May 17, 2022, 08:39:06 PMI guess this forum made it this way to atleast, give users some time to still make some unnoticeable changes or corrections their posts incase of mistakes or  prematurely/mistakenly clicking the \"post\" button while still typing/creating the post. That's probably the reason, cause edits within the \"grace period\" of 10 minutes (formerly 5) are not logged by the forum software. There are third party services available on the forum that sweeps posts regularly and can get more recent edits, but that was the original idea behind the time frame for edits to be shown.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "May 17, 2022, 10:54:43 PM",
      "body": "Quote from: Fivestar4everMVP on May 17, 2022, 08:39:06 PMI guess this forum made it this way to atleast, give users some time to still make some unnoticeable changes or corrections their posts incase of mistakes or  prematurely/mistakenly clicking the \"post\" button while still typing/creating the post. Most of the time edits within the first few minutes of the post is spelling mistakes or phrasing of the post being corrected. I know this from experience, and I expect everyone here on the forum has made mistakes. I mean sometimes it as simple as using \"has\" instead of \"as\", which I'm only remembering now I noticed I did the other day, I think I forgot to edit that one though . Anyway, hardly any malicious editing is done during this period, and therefore as suggested above, isn't worth keeping in the database. However, keeping edits which have been edited after that grace period are worth keeping somewhat. For example, from a forum perspective, a user could be looking to gain popularity of a thread, get lots of replies, and therefore appear higher on the list when people sort by views/posts or simply have a thread which a lot of users refer too. Then, they could go back, and edit that and remove a malicious link or even add one. That's just one of the examples, not a particularly strong one, but there has been instances where checking a edited post has been worth the effort, and has helped with efforts of moderation. I'm just failing to come up with a really good example right now, since I'm not one of the ones which has access to that data, so I'm using educated guesses rather than speaking from experience. Although, it also serves another purpose, on suggesting how up to date the thread is. For example, if you're following a guide on how to import a private key, you probably want to know that it's semi up to date.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 17, 2022, 11:56:19 PM",
      "body": "I noticed that a post that is one of the tracked topics or you are mentioned in Bitcointalk notifier by TryNinja is that you will get notified with the first post and when I check the post it is already edited without the \"Last edited\". I noticed this during Pmalek's Word Game where cygan posted a reply (word game answer) which only contain answer 1 and answer 2 but when I open the thread and found out that cygan edited the post and now has 4 answers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 19, 2022, 01:09:00 AM",
      "body": "I remember many months ago, one member raised a case or few cases that bounty hunters used a creative approach with editing.It goes like thisThey make some posts like reserved onesPerhaps, it is because deadline for post counting in that week is coming.Later, coming back to edit all reserved postsAmazing when I read that topic on how bounty hunters adapted and cheated managers.  I will try to search and find that topic.Posting reserve? (Baofeng detected it, 2 years ago)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}