{
  "id": "topic_5512401",
  "title": "freedomgo",
  "author": "freedomgo",
  "created_time": "October 08, 2024, 01:48:12 AM",
  "content": "A recent update came out, and it’s great news for the Bitcoin community. Usually, when an exchange faces issues, we assume our funds are gone for good. But just recently, it turns out that some of the exchange's funds were recovered and are being used to pay back users.In earlier reports, it was estimated that around $8-10 billion in customer funds were either misused or lost. So, the recovery of $16 billion is more than enough to cover those losses and pay back affected users. This is definitely a positive development for the FTX case.Here's the news. Quote from: https://decrypt.co/284982/ftx-return-16-billlion-bankruptcy-approvalCustomers of collapsed crypto exchange FTX will soon get their money back after a judge gave the green light on Monday to the firm's bankruptcy plan, following nearly two years of recovering funds and reaching various settlements.Judge John Dorsey in the U.S. Bankruptcy Court for the District of Delaware approved the plan to pay back former clients of the exchange using $16 billion recovered since the company collapsed, Reuters reported on Monday.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5512401",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "October 08, 2024, 02:49:10 AM",
      "body": "Quote from: freedomgo on October 08, 2024, 01:48:12 AMA recent update came out, and it’s great news for the Bitcoin community. Usually, when an exchange faces issues, we assume our funds are gone for good. But just recently, it turns out that some of the exchange's funds were recovered and are being used to pay back usersThe complain is FTX's users/ victims will not receive their cryptocurrencies back, but they will receive fiat currency (or stable coin?) according to their portfolios' values at time of FTX collapse or bankruptcy. This means they will get money equivalently to portfolio values in a worst time of bear market two years ago, and it is big loss if comparing prices of cryptocurrencies in a bear market (nearly bottom range) and now in a bull market.It is still good news for FTX victims as receiving more money is better than less.The news about FTX case is a good chance to share this topic to warn people about risk of storing money on centralized exchanges.Reminder: do not keep your money in online accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "October 08, 2024, 02:57:23 AM",
      "body": "Quote from: BlackBoss_ on October 08, 2024, 02:49:10 AMQuote from: freedomgo on October 08, 2024, 01:48:12 AMA recent update came out, and it’s great news for the Bitcoin community. Usually, when an exchange faces issues, we assume our funds are gone for good. But just recently, it turns out that some of the exchange's funds were recovered and are being used to pay back usersThe complain is FTX's users/ victims will not receive their cryptocurrencies back, but they will receive fiat currency (or stable coin?) according to their portfolios' values at time of FTX collapse or bankruptcy. This means they will get money equivalently to portfolio values in a worst time of bear market two years ago, and it is big loss if comparing prices of cryptocurrencies in a bear market (nearly bottom range) and now in a bull market.It is still good news for FTX victims as receiving more money is better than less.The news about FTX case is a good chance to share this topic to warn people about risk of storing money on centralized exchanges.Reminder: do not keep your money in online accountsThat's the sad news but that's how the government are gonna process things as  those coins were already used. To give an idea on the average price in 2022.QuoteThe average closing price for Bitcoin (BTC) in November 2022 was $17,600.81. It was down 16.2% for the month. The latest price is $62,639.90.https://www.statmuse.com/money/ask/bitcoin-price-day-by-day-november-2022So that's pretty low compared to the current price.... And as to the usd value refund., they'll get +18% of the value of their coins that time...QuoteThe plan approved Monday will pay the vast majority of customers at least 118% of the U.S. dollar value in their accounts as of November 2022.Some might complain about the price difference, but this is definitely better than not recovering their money at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "October 08, 2024, 04:39:19 AM",
      "body": "Yes, good news, I heard this news on some channels since yesterday and it is definitely good news for everyone that this case that has been going on for years and is considered one of the worst crypto incidents is over.Although many affected users are not satisfied with the distribution method decided by the court as they will receive fiat instead of their crypto assets, the worst thing for them is that the price will be calculated at the time of the incident as the price of Bitcoin was very low.Of course, this is not fair to many of them, but it is better than nothing, especially since if the compensation is calculated at the value of Bitcoin today at $63K, I expect that the amount of $16 billion will not be enough to compensate everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "October 08, 2024, 08:31:10 AM",
      "body": "Quote from: yhiaali3 on October 08, 2024, 04:39:19 AMAlthough many affected users are not satisfied with the distribution method decided by the court as they will receive fiat instead of their crypto assets, the worst thing for them is that the price will be calculated at the time of the incident as the price of Bitcoin was very low.Of course, this is not fair to many of them, but it is better than nothing, especially since if the compensation is calculated at the value of Bitcoin today at $63K, I expect that the amount of $16 billion will not be enough to compensate everyone.This exchange FTX filed for bankruptcy, and it’s standard for companies declaring bankruptcy to have their assets valued in fiat, likely for accounting purposes, we can read that if we doa little research. And wait... have we forgotten that Bitcoin and other cryptocurrencies are not considered legal tender in the US. The $16 billion recovered by the team is a mix of different assets, including cryptocurrency (both Bitcoin and altcoins), cash, equity, investments, and real estate or physical assets-- all of which have their own valuations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "October 08, 2024, 08:57:34 AM",
      "body": "Quote from: yhiaali3 on October 08, 2024, 04:39:19 AMYes, good news, I heard this news on some channels since yesterday and it is definitely good news for everyone that this case that has been going on for years and is considered one of the worst crypto incidents is over.Although many affected users are not satisfied with the distribution method decided by the court as they will receive fiat instead of their crypto assets, the worst thing for them is that the price will be calculated at the time of the incident as the price of Bitcoin was very low.Of course, this is not fair to many of them, but it is better than nothing, especially since if the compensation is calculated at the value of Bitcoin today at $63K, I expect that the amount of $16 billion will not be enough to compensate everyone.I totally agree.It's great that people will get at least something out of this whole charade that was FTX rug, however, many will be disappointed, and many - just mad in general.As it was said, in 2022, the BTC was around $17k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 08, 2024, 09:06:01 AM",
      "body": "It is good that the people will get something back after losing everything.The bigger lesson here is that one should not use the exchange wallets to store coins. But people outside the forum who constitute majority of the users on exchanges dont pay heed to this.A certain scam modus starts operating when these refunds start, someone random cold call/PM with a offer to send them the money while \"they\" will personally arrange for a refund. Dont trust such people, follow whatever will be official.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "October 08, 2024, 09:06:57 AM",
      "body": "I cant wait when the situation with FTX moves from words into actions. Almost every week we hear different news how something new was found, decision was taken, new guilty people found and trial would start and etc. But as far as I know, nobody received anything back yet. For these all this looks like another noise. Just words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "October 08, 2024, 09:17:22 AM",
      "body": "Quote from: yhiaali3 on October 08, 2024, 04:39:19 AMOf course, this is not fair to many of them, ...I think it's a fair valuation, similar to how Mt. Gox's bankruptcy was handled. If Bitcoin had reached $100k in 2022 and they used the current valuation $62k as the basis, would they still call it unfair?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 08, 2024, 10:26:25 AMLast edit: October 08, 2024, 10:38:07 AM by Fiatless",
      "body": "Quote from: bakasabo on October 08, 2024, 09:06:57 AMI cant wait when the situation with FTX moves from words into actions. Almost every week we hear different news how something new was found, decision was taken, new guilty people found and trial would start and etc. But as far as I know, nobody received anything back yet. For these all this looks like another noise. Just words. At least with the approval of the Delaware bankruptcy judge, the process of disbursing the funds will start. John Ray and his team will soon begin the process of paying investors. Quote from: yhiaali3 on October 08, 2024, 04:39:19 AMAlthough many affected users are not satisfied with the distribution method decided by the court as they will receive fiat instead of their crypto assets, the worst thing for them is that the price will be calculated at the time of the incident as the price of Bitcoin was very low.Of course, this is not fair to many of them, but it is better than nothing, especially since if the compensation is calculated at the value of Bitcoin today at $63K, I expect that the amount of $16 billion will not be enough to compensate everyone.Reports show that 98% of customers will get 119% of what they lost. It is possible that if they pay everyone using digital assets the money might not be enough to pay everyone. It is good news for everyone to at least get back the dollar equivalent. People should be pleased that they are getting it because most people have lost funds in bankrupt centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "October 08, 2024, 10:31:58 AM",
      "body": "Quote from: Ziskinberg on October 08, 2024, 09:17:22 AMQuote from: yhiaali3 on October 08, 2024, 04:39:19 AMOf course, this is not fair to many of them, ...I think it's a fair valuation, similar to how Mt. Gox's bankruptcy was handled. If Bitcoin had reached $100k in 2022 and they used the current valuation $62k as the basis, would they still call it unfair?I think probably yes, however, it's how it will be handled and it won't be changed because of that \"unfairness\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 08, 2024, 10:48:17 AM",
      "body": "Well, half is better than none and although they can't get back their cryptocurrencies, at least they can get funds that can enable them purchase more cryptos if they so please. At least they've learned their lesson on how not to keep their coins on centralized exchanges. If care's not taken, some of the affected users may not be bothered that they don't get their cryptocurrencies back but are being settled in fiat as long as they've been settled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 08, 2024, 02:01:50 PM",
      "body": "Quote from: freedomgo on October 08, 2024, 01:48:12 AMIn earlier reports, it was estimated that around $8-10 billion in customer funds were either misused or lost. So, the recovery of $16 billion is more than enough to cover those losses and pay back affected users. This is definitely a positive development for the FTX case.This is a medicine after death for me because no matter the positive development, although it is a welcomed development, and also because it will be exciting for people who lost money to receive it back, It still will not magically take away the distrust that some people have developed for exchanges and, by extension, cryptocurrency, or make some people who swore to themselves never to be involved with anything cryptocurrency after the bitter experience with FTX want to change their minds. The shame that FTX brought to the cryptocurrency space will always be pointed out or used as an example by critics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "October 08, 2024, 02:20:40 PM",
      "body": "Quote from: BlackBoss_ on October 08, 2024, 02:49:10 AMQuote from: freedomgo on October 08, 2024, 01:48:12 AMA recent update came out, and it’s great news for the Bitcoin community. Usually, when an exchange faces issues, we assume our funds are gone for good. But just recently, it turns out that some of the exchange's funds were recovered and are being used to pay back usersThe complain is FTX's users/ victims will not receive their cryptocurrencies back, but they will receive fiat currency (or stable coin?) according to their portfolios' values at time of FTX collapse or bankruptcy. This means they will get money equivalently to portfolio values in a worst time of bear market two years ago, and it is big loss if comparing prices of cryptocurrencies in a bear market (nearly bottom range) and now in a bull market.It is still good news for FTX victims as receiving more money is better than less.The news about FTX case is a good chance to share this topic to warn people about risk of storing money on centralized exchanges.Reminder: do not keep your money in online accountsAlso good news for the crypto market as that means that they will not be able to sell their coins and lower the price but instead, perhaps buy coins with their refunded fiat and drive the price up higher. Paying back in fiat might be a slap in the face to the hodlers who were hoping to make a profit after all this time but it is better than nothing, I guess.Good thing I do not trust exchanges and only hold my coins on my own wallets instead of some third party custodial wallets (like on crypto exchanges).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "October 08, 2024, 02:57:44 PM",
      "body": "Quote from: BlackBoss_ on October 08, 2024, 02:49:10 AMQuote from: freedomgo on October 08, 2024, 01:48:12 AMA recent update came out, and it’s great news for the Bitcoin community. Usually, when an exchange faces issues, we assume our funds are gone for good. But just recently, it turns out that some of the exchange's funds were recovered and are being used to pay back usersThe complain is FTX's users/ victims will not receive their cryptocurrencies back, but they will receive fiat currency (or stable coin?) according to their portfolios' values at time of FTX collapse or bankruptcy. This means they will get money equivalently to portfolio values in a worst time of bear market two years ago, and it is big loss if comparing prices of cryptocurrencies in a bear market (nearly bottom range) and now in a bull market.It is still good news for FTX victims as receiving more money is better than less.The news about FTX case is a good chance to share this topic to warn people about risk of storing money on centralized exchanges.Reminder: do not keep your money in online accountsI believe most of these affected users will be glad to have their money back, regardless of the worth, this is way more better than them not receiving anything at all. This news is not only positive for the affected users but also for the crypto community, this is sending warning message to those other centralized exchanges out there that could go bankruptcy that they can be traced and have money paid back to clients.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 08, 2024, 03:23:14 PMLast edit: October 08, 2024, 03:49:29 PM by Rikafip",
      "body": "Quote from: Majestic-milf on October 08, 2024, 10:48:17 AM Well, half is better than none and although they can't get back their cryptocurrencies, at least they can get funds that can enable them purchase more cryptos if they so please. Considering the difference between bitcoin price in November 2022 and now (~17k in November vs ~62k now), the loss is much bigger than 50% (~72%) and that's only if they get the money ASAP. People probably won't get their money back in months, and maybe even a year and by then bitcoin might be much higher than it is now.So yeah, its good that they will still get something back, but I think that many will be pissed off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "October 08, 2024, 03:53:34 PM",
      "body": "This is a great news and the fact that whole amount will be paid in dollars and not crypto makes it more bullish news as people will have money to buy their favorite assets and I hope, it's not FTX anymore (joking).  $16 Billion dollars if all invested in BTC at the current price is 258,064 Bitcoins. Enough to carry on the momentum of this bull run despite having so many bearish news (related to war) recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jewan420",
      "created_time": "October 08, 2024, 03:56:16 PM",
      "body": "It is normal, many will not be satisfied at all, but will express resentment. By the time they get the money back, they will lose about 70%. Because in 2022 a person's 1 Bitcoin was worth $17k, which is $62k today. But he will get back the $17k. That means no profit will come from his money in 2 years.Many affected users will be happy, who had invested money in various Shitcoins whose current value is much lower than at that time. They will surely feel themselves benefited. Many affected investors will be disappointed, but I think getting something is better than nothing. Maybe there was a big lesson hidden in our losses that made you gain many times the money you lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "October 08, 2024, 04:22:24 PM",
      "body": "Quote from: freedomgo on October 08, 2024, 01:48:12 AM~SnipThe collapse of FTX was quite a dark tragedy in the crypto world, perhaps at that time many people experienced huge losses as a result of this incident. Some people even felt they had given up on getting into the world of crypto after experiencing losses due to this incident. However, with the news that user funds used by FTX or those who experienced losses at that time will be returned, of course this news will be very encouraging. Because how could it not be, after all the users who experienced losses at that time thought their funds would not be returned, and now they will be returned, of course they will be very happy. So hopefully this can really happen and isn't just a lie. Because if FTX really returns money from its users, this will have a very positive impact on the crypto world. Because many people will think that crypto exchanges are truly responsible for all the mistakes or fraud they commit. Apart from that, it is reported that FTX will only compensate users who have assets of less than $50K. I don't know if this news is true or not, but according to all of you, is this fair enough or not? In my personal opinion, this is still better than not compensating for losses at all. But if for example this is true, hopefully FTX will make a few changes to this. Because after all, every FTX user who suffers a loss,  will definitely want their money back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antonil",
      "created_time": "October 08, 2024, 04:51:56 PM",
      "body": "It's great to see the possibility of getting user funds back after the FTX collapse, especially for those who thought they had lost everything. This development could really help restore some faith in the crypto space. However, the $50K limit on compensation raises some concerns. While this is better than nothing, many users who have experienced significant damage will still feel shortchanged. It would be ideal for FTX to consider a more equitable approach to compensation reflecting the extent of damages to users. Transparency is key in this process, and hopefully, they will coordinate to ensure fairness for all affected users. Overall, this is a positive step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}