{
  "id": "topic_5469251",
  "title": "HelliumZ",
  "author": "HelliumZ",
  "created_time": "October 05, 2023, 01:20:28 AMLast edit: October 05, 2023, 02:15:13 AM by HelliumZ",
  "content": "Incidents like account trading, changing hands and hacking are constantly happening in our Bitcoin forum. Similarly, with a doubt, I recommend this TakeItEasy account below to the knowledgeable and experienced users of the forum to justify it.This user is quite old and has spent most of his time on the forum under the project, but his post quality and the speed of the post section are quite questionable now. So I strongly recommend to research his account for now.Account link: https://bitcointalk.org/index.php?action=profile;u=375097Ninja space: https://bpip.org/Profile?p=TakeItEasyFast post: https://bitcointalk.org/index.php?action=profile;u=375097;sa=showPosts;start=1300Last post: https://bitcointalk.org/index.php?topic=5404516.msg62889416#msg62889416Ref: https://bpip.org/Profile?p=TakeItEasyThe user posted all his posts in \"Announcements (Altcoins)/ANN section which you can understand if you visit this ID but after the account change all his post section has changed. Also the original user's post quality and language is different but the new owner's post quality is different.Post number 1305 to 49 same quality and most of the posts one line and projects ANNOUNCED ANN related But Now posts number 50 to Till today different quality and most of the posts are based on economy/ gambling discussion and bitcoin discussion based. Please experts members verify it and judge it ...Original user post quality:Quote from: TakeItEasy on November 21, 2018, 12:30:50 AMFor the \"What is Pirate\" script by FishyGuts:-Pirate coin is a privacy focused cryptocurrency that is fully decentralized, meaning there is no third party in charge of your funds at any time.  Private transactions are confirmed in a trustless manner on the blockchain.  This means you do not need a third party to verify that your transactions are valid, the pirate code takes care of that.-Pirate coin uses a highly advanced and respected privacy protocol to hide the data of your transactions.  This is accomplished through the use of an advanced technology called zk-snarks, which we have adopted and required on 100% of the send transactions.  This is considered by many prominent developers to be one of the strongest methods of hiding your financial data on the blockchain.   ZK-snarks works so effectively because it doesn't require the data from your transaction to be viewable on the public ledgers.-All Pirate chain transactions are private by default.  This alleviates the problem that many cryptocurrencies with optional privacy introduce into their protocol.  These optional private transactions used by the majority of other privacy coins provide anchors for data to be analyzed and  thereby weakening the overall privacy protection for users.  This complete privacy protocol also provides users with additional assurance that no authorities in the future can come along and claim that users funds are \"tainted\" or ill gotten due to previous transactions-Pirate crypto allows for quick and secure transfer of value across the world for both the customer and the vendor.  The fees are very inexpensive, there is no chance for fraudulent chargebacks, no erroneous fund verification periods, and transactions are confirmed and secured within minutes.  These features alone can save merchants and vendors across the globe save billions of dollars by cutting out facilitation fees- Financial privacy is crucial for so many people for so many reasons.  Privacy is needed by vendors, distributors, merchants, purchasers, suppliers, service providers and customers.   Pirate plans to support community efforts for a legitimate marketplace to parlay your pirate coin for goods and services.  Customers deserve privacy and speed in their transactions, period.   Businesses can assure their clients and themselves that both parties to the transaction will receive the privacy and speed they expect.-Pirate is a zcash fork launched on Komodo.  We use ZEC parameters and we are the only other crypto aside from XMR with forced private sends.  This creates a privacy protocol that rivals XMR.To understand, In short, ZEC privacy gets stronger with each z tx and with the largest possible shielded pool of funds.  Since ARRR only has private sends possible, this makes the shielded pool on Pirate equal to 99.99% of all funds in existence.In addition to utilizing ZEC to the best of it's abilities, Pirate also has dPoW, delayed proof of work from Komodo.   This makes pirate reistant to damage from 51% attacks.Every 10 minutes a hashrecord of the Pirate blockchain is recorded on the Bitcoin blockchain via Komodo's dPoW.   If you are unfamiliar with dPoW you should definitely look into it more.In short, we are one of the most private and definitely one of the most secure privacy coins in existence based on these parameters.(edited)- Many of the value propositions for Pirate have been focused around privacy.  Pirate is Fundamentals complete.  The product is ready for use and ready to provide privacy.When the blockchain explorer only records a timestamp and a bunch of zeros... there is not much better way to hide that data.Now that we have privacy and security on lock down, our next main goals are to get sapling integrated.This is going to open a lot of doors, from mobile and point of sale exposure, as well as being able to ease the onboarding process to pirate so that it is almost invisible to the customer.Again, more on that as we are privy to share.  Some of that is under wraps for a reason and Sapling is going to be a game changer after pirate itself has already changed the game.- What are PIRATE CHAIN's key features?A: We have two key features and we do them very well.Privacy and Security- Pirate chain uses ZEC parameters with forced private send.  This makes the shielded pool on Pirate equal to 99.99% of all funds in existence.The ZEC devs themselves have stated that forced private sends are likely the best solution for utilizing zcash privacy features. (fig. 1 and fig. 2)- In addition to utilizing ZEC to the best of it's abilities, Pirate also has dPoW, delayed proof of work from Komodo.   This makes pirate reistant to damage from 51% attacks.Every 10 minutes a hashrecord of the Pirate blockchain is recorded on the Bitcoin blockchain via Komodo's dPoW.   If you are unfamiliar with dPoW you should definitely look into it more.If all that above can be distilled into a 90 seconds script, that would make me a happy Pirate.  :octopus:Now... for the Privacy video...  Here is my interview answers to be distilled into a script. - Financial privacy is crucial for so many people for so many reasons.  Privacy is needed by vendors, distributors, merchants, purchasers, suppliers, service providers and customers.   Pirate plans to support community efforts for a legitimate marketplace to parlay your pirate coin for goods and services.  Customers deserve privacy and speed in their transactions, period.   Businesses can assure their clients and themselves that both parties to the transaction will receive the privacy and speed they expect.Business is cutthroat and it's critical for some businesses to protect their relationships to retain their edge on their respective markets.  The ability to incorporate a cryptocurrency with the ease of use, speed, flexibility and financial privacy that Pirate offers will secure this critical advantage that powers many businesses in todays market.   Pirate offers an enormously beneficial means of transacting and exchanging value. The traditional and very cumbersome methods that exist within legacy banking systems are not only detrimental to businesses, but can be costly to businesses in many ways.  Your transactions can be at the scrutiny and whim of being reversed by a third party with no rights, reasons or understandings to your business.  Todays FIAT currencies are already making a mass exodus towards digital systems.   Any soverign cryptos created in the future will surely not be wholly private and still be likely subject to manipulation as it already is... as opposed to a decentralized blockchain protocol run by math.The code exists today such that we no longer need to have these middlemen and facilitators managing our transactions. We're here to help  to preserve peoples privacy along the way.- The world NEEDS privacy.Privacy is pivotal for human interaction, for art, for discussion, for finances and for safety.Martin Luther King Jr. would not have been able to be the force he was for the civil rights movement if he did not have privacy.Business would not thrive and innovation would be stifiled without privacy.Our love lives and families would not be the way they are without privacy.The list goes on and on for the reasons we need privacy, and none of them need to be nefarious.For some people, privacy is serious business.  We like to look at it like practicing medicine.-Privacy - ZEC privacy works best when used the most.  Each transaction reshuffles the funds and the entire 99.99% shielded pool of funds is not discernable from the rest.  Only you know your wallet balance and transaction details, unless you wish to share them, which you can.Zooko wants to ban unshielded transactions (fig 3) but I don't see that going over too well on KYC exchanges and with their existing crowd that may feel it's too \"nefarious\" to be private.Well, I didn't show the barista my bank statement today when I bought coffee, why should crypto be any different?Zcash devs know that that a fully shielded fund pool is the strongest possible use for Zcash privacy tech, link provided by Daira Hopwood via Twitter Even Fluffy Pony acknowledges that the protocol is stronger with tradeoffs, albeit in this post, he was talking about zcash with optional privacy and hadn't likely heard of Pirate yet -We have taken one of the most cryptographically seecure privacy protocols, zksnarks, and required it to be used on ALL send transactions on the blockchain.  SKsnarks works by obfuscating all users funds in one large shielded pool of funds, makign it impossible to discerne your funds from another users funds (to date).  As mentioned above, our biggest tech competitor, Monero, mentions there are stronger protocols.  The zcash devs themselves acknowledge this stating that the strongest use for zksnarks is a requirement to use the tech on all send transations.  Zooko has mentioned that they would like to ban unshielded transations but that's a tall order for them to require at this point in the project.In addition to having what is considered one of the strongest privacy protocols in crypto, we have also added dPoW from Komodo giving us resistance to damage from 51% attacks as well as double spend protection meaning exchanges and users can be assured that any issues with double spends on the chain can be handled swiftly and effectively without causing permanent damage to the chain.-let me give you some examples of how we already have privacy in our financial transactions today that we dont have in crypto.  Somehow we write off this lack of privacy as \"Amazing worldchanging tech\" while giving up the entire history of our financial decisions.You didn't go into the coffee shop today and show the cashier your bank statement before you gave them money for your coffee.   You just gave them the money.  There was zero knowledge on how you got the money, there is zero knowledge on how much you have, there is zero knowledge of your merchants finances, and yet somehow, the sun keep shining and the weather is sweet.  Crypto financial transactions deserve the exact same discretion.  It is critical to many people for many reasons.  Safety, security, peace of mind and most important of all, financial privacy.  The implications of financial privacy and the breach thereof, would be an entire article/interview on it's own.-Financial privacy is critical.  For the most part, we do have some form of it today. Buyers don't know how much store owners have, store owners don't know what their buyers have.   Just like it works now with banks and credit cards.There is this strange narrative in the cryptosphere, mostly championed by media as well as sub standard privacy protocols, such as opt in or TOR based privacy coins, that Privacy coins are for nefarious people committing nefarious acts.This is insane and very harmful to humans as the crytpo world becomes more adopted.You didn't go into Starbucks and show the clerk your bank statement after you bought your coffee did you?You don't walk up to a street vendor and say \"Hi there, I have 472 thousand dollars, can I give you 17 of them for that bottle of rum?\"Why should crypto and peoples financial privacy be any different?  There is no reason open public scrutiny is necessary all the time. This creates other problems in society and economics.  Favortism for people who are well off, increased scrutiny to those who arent.  Companies using your data against you.Imagine an insurance company declining you for fair coverage because of your spending habits?Imagine an employer overlooking you for a job because they don't like how you spend your hard earned money?I can come up with a hundred wholesome and certainly necessary reasons for privacy in crytpo before there is one nefarious one.This narrative needs to stop.  Thin veil privacy coins need to stop.  Privacy is serious business.  It is like practicing medicine or building skyscrapers.  If you do it wrong, people get hurt.Moreover, the original user joined a signature campaign in 2018 with the ChainZilla platform address, while the ChainZilla website is currently active and I recommend this account owner to Signup/See us address with UIDAddress with ChainZilla Account ID.Quote from: TakeItEasy on September 05, 2018, 08:24:37 PMUsername/UID: TakeItEasy/375097Bitcointalk Rank:    Sr. MemberCurrent number of posts:    588ChainZilla Address to send the payment: RD5WiEQYo5DGa3PoViYPnYJnpt7j6vyxLMChainZilla UID: 375097ChainZilla Address: RD5WiEQYo5DGa3PoViYPnYJnpt7j6vyxLMActive website: https://chainzilla.io/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469251",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "October 05, 2023, 03:55:28 AMLast edit: October 05, 2023, 04:13:35 AM by Jawhead999",
      "body": "Quote from: TakeItEasy on November 21, 2018, 12:30:50 AMFor the \"What is Pirate\" script by FishyGuts:You're using this post as the example of his quality, when this is just a copy pasta from other articles. Read the first sentence, he already mention if this explanation come from FishyGuts, not him. I already report his post.https://medium.com/piratechain/an-interview-with-the-pirate-chain-development-team-d227562eb76ahttps://medium.com/piratechain/pirate-independent-secure-anonymous-2dbea74e9885The account has been a shitposter since 2014 until now, the difference is only the post length. There's nothing to judge about the quality post, only the section he post. Now if you think someone is changed hands/bought/hacked because the change of section where the user's post, what's difference with you?All of your posts from July 06, 2023 to August 23, 2023 were in WO thread, then after next 2 weeks most of your post are in Bengali board. Let's not forget how it's possible a brand new account know about WO thread",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 05, 2023, 08:35:25 AM",
      "body": "Quote from: Jawhead999 on October 05, 2023, 03:55:28 AMNow if you think someone is changed hands/bought/hacked because the change of section where the user's post, what's difference with you?All of your posts from July 06, 2023 to August 23, 2023 were in WO thread, then after next 2 weeks most of your post are in Bengali board. Let's not forget how it's possible a brand new account know about WO thread The OP is most likely an alt account who knows where to get merit, first the WO, local Bengali, and now this Reputation thread. Not to say he is breaking any rules but with this data he has already put himself in the eyes of the DTs. He wouldn't be the first to show up here and get scalded by red tags. As for the TakeItEasy account changing hands, if it becomes clear can get him some red tags, because although not all DTs agree, there are always others who end up painting their profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "October 05, 2023, 12:25:40 PM",
      "body": "There is now an all too familiar connection with accounts that have a dubious history or conduct, yet they find themselves participating in campaigns operated by a particular campaign manager. The WO thread, mentions of pizzas, flooding the Save Your Merits thread along with posting in a particular local board form part of the connection. Newbies or lower rank members posting in Reputation of all places drawing attention to themselves is also on the increase.You do question motives when what appears to be one alt-account starts posting/complaining about what appears to be another alt-account (or sold/traded) when it brings attention to their own account.Quote from: Poker Player on October 05, 2023, 08:35:25 AMThe OP is most likely an alt account who knows where to get merit, first the WO, local Bengali, and now this Reputation thread. Not to say he is breaking any rules but with this data he has already put himself in the eyes of the DTs. He wouldn't be the first to show up here and get scalded by red tags. As for the TakeItEasy account changing hands, if it becomes clear can get him some red tags, because although not all DTs agree, there are always others who end up painting their profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "October 07, 2023, 08:28:12 PM",
      "body": "I think what JollyGood and Poker Player say is the truth about op, sometimes it's very shocking seeing an account I mean a low rank reporting account or being too familiar with the whole system or even stumbled some board and threads that are too difficult for newbies to discover. I almost spent a year or more in my local board without knowing anything or discover some of the board, is just of lately I began to post here but if op keeps reporting account or starts unveiling things he thinks that is more better then he's also standing at a larger chance to get his account discovered or fished out because only Alt could act like this but however, I can't give any final judgement towards this account. Besides you need to be very mindful accusing any account as to whatever you do or say has a very bad negative influence to the account which my lead to either getting tagged or typically destroying the account for common mistake you have just did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z_MBFM",
      "created_time": "October 08, 2023, 04:19:49 PM",
      "body": "There is no clear evidence yet for that account to call it a sold or hacked account. The account was previously used only for announcements but has recently started posting on other boards which is no problem. Because anyone can post on any board there is no specific board assigned to anyone. I have compared the current posts with his previous posts.  But I didn't find the writing type mismatch. You have only opened an account on this forum for 3 months but by the style of your posts you seem to be a very old user of this forum.  Poker Player Logical Speaks You have multiple accounts. But using more than one account is not a crime but as you are an old member you are not expected to give such shit type report. If you come up with a solid proof to prove it then DT members will be interested in taking some action and you might get some merit too...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 10, 2023, 12:39:07 PM",
      "body": "Quote from: Z_MBFM on October 08, 2023, 04:19:49 PMThere is no clear evidence yet for that account to call it a sold or hacked account.Ah but there is, and a lot of it, too:- 7-month gap in posting- stark contrast in writing style pre- and post-gap- password reset via email on Jul 29, 2023- account was previously used to post updates on various projects, has now taken to shitposting about cricket, entering contests and completing menial tasks for BTC.There is zero doubt in my mind this is a purchased account. I'm sure it is owned by someone currently in one or more other campaigns. They likely used some of their campaign earnings to purchase the account. Someday I'm going to put it together who has purchased which accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 10, 2023, 02:18:31 PM",
      "body": "I've been looking at the TakeItEasy case closely and I see something curious:Quote from: nutildah on October 10, 2023, 12:39:07 PM- 7-month gap in posting- stark contrast in writing style pre- and post-gap As you say, there is a 7 month gap and he writes again on September 23. On September 28 he applies for his current signature campaigns where there is a requirement of a minimum of 25 merits in the last 120 days, and he only has 2:Quote from: TakeItEasy on September 28, 2023, 05:21:42 AMMerit earned in the last 120 days: 2I wouldn't like to reopen wounds with my now reconciled friend here but I don't quite understand the acceptance for this, and besides campaign managers are supposed to look at the post histories, right? You can clearly see the gap and the change in posting style. I am of the opinion that someone who buys an account deserves red tags but I will not be in a hurry to leave one to his profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 10, 2023, 09:12:53 PM",
      "body": "Quote from: Poker Player on October 10, 2023, 02:18:31 PMI am of the opinion that someone who buys an account deserves red tags but I will not be in a hurry to leave one to his profile. And you shouldn't be in a hurry, unless it's proven beyond reasonable doubt that the user behind the account has really changed. A post gap and slight change in boards frequented is not solid proof of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 11, 2023, 01:33:38 PM",
      "body": "Quote from: Upgrade00 on October 10, 2023, 09:12:53 PMAnd you shouldn't be in a hurry, unless it's proven beyond reasonable doubt that the user behind the account has really changed. A post gap and slight change in boards frequented is not solid proof of that.I don't know why you sum it up in two points when there is more to it than that and you can see the information right in the post above mine:Quote from: nutildah on October 10, 2023, 12:39:07 PM- 7-month gap in posting- stark contrast in writing style pre- and post-gap- password reset via email on Jul 29, 2023- account was previously used to post updates on various projects, has now taken to shitposting about cricket, entering contests and completing menial tasks for BTC.Besides I don't agree with the \"beyond reasonable doubt\" as if this was a murder case. So. If there's a lot of evidence but there's 1% doubt you're not going to red tag him?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 11, 2023, 01:45:07 PM",
      "body": "Quote from: Poker Player on October 11, 2023, 01:33:38 PMBesides I don't agree with the \"beyond reasonable doubt\" as if this was a murder case. So. If there's a lot of evidence but there's 1% doubt you're not going to red tag him?Even if its 100% a purchased account, I don't issue red tags for that -- at least not as the sole reason for issuing a tag. I don't mind so much if others do, but its just not something I personally do. If its a bought account used for nefarious purposes, like scamming or promoting a scam project, then I would red tag the account, and probably mention that its a bought account in the feedback.I'd sooner attempt to link them to other accounts and then bust them for campaign cheating, if that's what's going on.If red tags are being given - for whatever reason - I think the provision of conclusive (or at least strong) evidence is necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AI detected",
      "created_time": "October 11, 2023, 02:13:32 PM",
      "body": "Give him 500 negative, why bought account, broken rules of Bitcointalk. If I Dt, no one would safe. be brave , come on guy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "October 11, 2023, 02:43:25 PM",
      "body": "Quote from: nutildah on October 11, 2023, 01:45:07 PMQuote from: Poker Player on October 11, 2023, 01:33:38 PMBesides I don't agree with the \"beyond reasonable doubt\" as if this was a murder case. So. If there's a lot of evidence but there's 1% doubt you're not going to red tag him?Even if its 100% a purchased account, I don't issue red tags for that -- at least not as the sole reason for issuing a tag. I don't mind so much if others do, but its just not something I personally do. If its a bought account used for nefarious purposes, like scamming or promoting a scam project, then I would red tag the account, and probably mention that its a bought account in the feedback.I'd sooner attempt to link them to other accounts and then bust them for campaign cheating, if that's what's going on.If red tags are being given - for whatever reason - I think the provision of conclusive (or at least strong) evidence is necessary.It seems like you have a wiser outlook for now. I thought you would red tag it. OK, looks good and hopefully the account isn't used for fraudulent activities. However, in my opinion, the account was only used to participate in the signature campaignQuote from: AI detected on October 11, 2023, 02:13:32 PMGive him 500 negative, why bought account, broken rules of Bitcointalk. If I Dt, no one would safe. be brave , come on guyYou can give him a tag if you want, Or use your main account to tag him",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 12, 2023, 03:18:25 PM",
      "body": "Quote from: Upgrade00 on October 10, 2023, 09:12:53 PMQuote from: Poker Player on October 10, 2023, 02:18:31 PMI am of the opinion that someone who buys an account deserves red tags but I will not be in a hurry to leave one to his profile. And you shouldn't be in a hurry, unless it's proven beyond reasonable doubt that the user behind the account has really changed. A post gap and slight change in boards frequented is not solid proof of that.Let's count the Russian-speaking users who have gained after a pause an interest in cricket!So, I start first:1) TakeitEasyYour turn   Anyhow, nobody cares anymore, I've seen hundreds of those, stupid numbskulls who posted for years only on the German board then they were saying soccer is not popular in their country, obviously merit farming with fake stories forgetting a year ago their successful business was accepting Bitcoin, even posts in the Wall of shame topic that got merit from a moderator, so I wonder what's the point other than at some future date if he really makes a mistake to red tag a dozen account at a time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 12, 2023, 03:29:49 PM",
      "body": "Quote from: PytagoraZ on October 11, 2023, 02:43:25 PMIt seems like you have a wiser outlook for now. I thought you would red tag it. Here's your main problem: You speak too much while knowing nothing. Learn WTF you are talking about, then speak. Sure, you can collect shitposting payments, but you will not collect respect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 12, 2023, 08:00:07 PM",
      "body": "Quote from: stompix on October 12, 2023, 03:18:25 PMLet's count the Russian-speaking users who have gained after a pause an interest in cricket!So, I start first:1) TakeitEasyYour turn   Could have been a period of personal discovery during the pause and they discovered they had an interest in previously odd sports  But what I was trying to say was that we should not be quick to give out tags until there is irrefutable evidence to suggest that the account has really changed hands, I wasn't focusing on just his case but all forum cases in general related to account changing hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}