{
  "id": "topic_5456361",
  "title": "peterpiper23",
  "author": "peterpiper23",
  "created_time": "June 14, 2023, 07:34:07 PM",
  "content": "With my Ledger I can open my Electrum wallet and see that I have some BTC in my wallet.However, I am unable to send this BTC to a different address because I have the following problem:Once I enter the BTC address into my Electrum Wallet (I've tried several different addresses and the same issue happens), the following message pops up on my Ledger:  \"This derivation path is unusual....Confirm public key.....Path 44'/5757'/0' followed by a Public Key that I do not recognize (I can either Approve, or the next screen says \"Reject if you're not sure\".  I've Approved (just to see if it will work), and then my Ledger makes me go through 2 steps:Step 1: Ledger says \"Register Wallet\" which I have to either Approve or Reject.  Step 2:  After I \"Approve\", my Ledger then shows the same Public Key as before which I have to either Approve or Reject.If I \"Approve\" Step 2, my Ledger brings me back again to Step 1 and says \"Register Wallet\" and it forces me to go through Steps 1 and 2 repeatedly.All the while, my Electrum Wallet says \"Signing Transaction\" (but it never actually does).Can anyone help me fix this issue?Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456361",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "June 14, 2023, 11:14:20 PM",
      "body": "So your problem is it keeps repeating when sending BTC with Electrum and it keeps bringing you back to step one.Have you checked if your ledger device is up to date if not update the device first and try again and also make sure that you are using the latest Electrum wallet.I tried to search and I heard that this warning \"derivation path is unusual\" is an old derivation path vulnerability issue on Ledger some of them suggest to update the device and some of them suggest that you need to enable or disable the change address on the Electrum wallet to fix this issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peterpiper23",
      "created_time": "June 15, 2023, 01:33:00 AM",
      "body": "I am using the latest Electrum wallet version, however, I have not yet updated my Ledger because of the recent \"backdoor scandal\"...but regardless, I just used a completely different Ledger (also not updated) and a different Electrum wallet and I was able to send my BTC with no problems.My last resort is to update the Ledger, but first I would like to try to enable or disable the change address on the Electrum wallet to fix this issue, as you suggested.How exactly do I do this?  I'm not sure what the \"change address\" is.  Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 15, 2023, 06:36:51 AM",
      "body": "Quote from: peterpiper23 on June 15, 2023, 01:33:00 AMHow exactly do I do this?  I'm not sure what the \"change address\" is.  The option is in the setting icon (upper-right) in the \"New Transaction\" window (window shows after clicking \"Pay...\").It's ticked by default.It's a set of addresses that have different derivation path than your receiving addresses,Electrum reserves those for receiving the \"change\" of your transaction: excess amount from the input(s) and the recipient(s).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peterpiper23",
      "created_time": "June 15, 2023, 03:29:26 PM",
      "body": "Thanks for the suggestions.Unfortunately, nothing has worked.  I enabled/disabled the Change Address several times and I even ended up updating the Ledger to the latest version but I'm still getting the same error.Any other ideas/suggestions?Is there any other way to send my BTC from this address other than using Electrum Wallet with my Ledger (even though that is how I originally set it up)?Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 15, 2023, 04:09:28 PM",
      "body": "Import your Ledger wallet seed into Electrum, choose BIP39.Move your bitcoin to another new Electrum wallet (hot or cold wallet or multisig wallet, it depends on you). You should move your bitcoin to a new wallet if you feel unsafe with Ledger and their latest firmware upgrade for their Ledger Recovery Service.Import Ledger Seed into ElectrumCreating a cold storage wallet in ElectrumCreating a multisig wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 15, 2023, 04:14:38 PM",
      "body": "I also did a little research into your problem and from what I found, the Ledger seems to claim that the problem is not with them, but that the problem is in third-party wallets like Electrum. Personally, I'm not technically advanced to understand why this is happening to you in the Ledger HW+Electrum combination, but I can say that I had a problem with these new versions of Electrum on Android also when it came to signing transactions.What you could theoretically do is enter the seed generated with Ledger into Electrum (as wallet recovery) and then try to make a transaction to a new address. Then however you have to assume that this seed is no longer safe, so before that procedure you should move all other coins (if you have them) to the safety of the new wallet. It could theoretically be a new wallet on Ledger that you'll make by adding a passphrase and a secondary PIN.Quote from: https://support.ledger.com/hc/en-us/articles/360015739499-Sign-or-derivation-path-is-unusual?support=trueHowever, users of third-party wallets such as Electrum might also see this warning message even if the public key or signature request comes from a legitimate wallet. This is due to the fact that these wallets use an incorrect derivation path, which can also be valid for Bitcoin. Unfortunately, there is no way for the app on your Ledger device to tell whether this path is legitimate. We encourage developers to derive and sign on the correct derivation path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "June 15, 2023, 05:17:40 PM",
      "body": "Quote from: peterpiper23 on June 14, 2023, 07:34:07 PMCan anyone help me fix this issue?ThanksLooks like you wanna send  your Bitcoin reward received    from planbetter for staking your coins.Instruction they published says that you need to set in Electrum the custom derivation path of m/44'/5757'/0' to access relevant addresses, but if you do it via Ledger it seems  that the latter  refuses to manage pertaining private keys.If it is so, the solution to the problem might be the following:A) If you have the stash other than that of reward from planbetter and relevant to Ledger's SEED  generate new SEED, further on NSEED,  preliminary doing backup of your old SEED, further on OSEED.B) Send that stash from OSEED-addresses to  NSEED-addresses.C) Follow instruction on this page,  but  do not connect your ledger. Instead on 5th step enter your OSEED (that is why there was a  preliminary need to move your fund  as it described in A!). Don't forget to tick BIP39 .D) Proceed to next steps of that instruction.Hope that planbetter  is not a scam and Electrum itself will allow to withdraw your reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abdussamad",
      "created_time": "June 15, 2023, 08:28:49 PM",
      "body": "don't enter your seed on any website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 15, 2023, 10:08:21 PM",
      "body": "Quote from: peterpiper23 on June 14, 2023, 07:34:07 PMWith my Ledger I can open my Electrum wallet and see that I have some BTC in my wallet.However, I am unable to send this BTC to a different address because I have the following problem:Once I enter the BTC address into my Electrum Wallet (I've tried several different addresses and the same issue happens), the following message pops up on my Ledger:  \"This derivation path is unusual....Confirm public key.....Path 44'/5757'/0' followed by a Public Key that I do not recognize (I can either Approve, or the next screen says \"Reject if you're not sure\".  You should not enter your bitcoin address in electrum This is not the proper way to connect ledger to electrumhttps://support.ledger.com/hc/en-us/articles/115005161925-Set-up-and-use-ElectrumQuoteConnect and unlock your Ledger device.Open the Bitcoin app.Launch Electrum from your applications folder. The install wizard opens.Leave the default wallet name and click Next.Select Standard wallet and click Next.At the keystore screen, select Use a hardware device and click Next.Select your Ledger device and click next.Choose the right derivation path for your account and click Next:    Legacy for an account that has addresses starting with a 1    p2sh-segwit for an account that has addresses starting with a 3     Native segwit for an account with addresses starting with a bc1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 16, 2023, 09:28:30 AM",
      "body": "Rather than importing your seed phrase directly in to Electrum as suggested above which presents a security risk, try downloading Sparrow wallet. Sparrow will also allow you to set a custom derivation path as Ledger does, and other users have had success in bypassing similar \"unusual path\" errors with Electrum by using Sparrow instead.There is a guide to link your Ledger to Sparrow available via the Ledger website here: https://support.ledger.com/hc/en-us/articles/10615436599837-Connect-your-Ledger-to-Bitcoin-BTC-network-with-Sparrow",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 16, 2023, 01:31:22 PM",
      "body": "Quote from: peterpiper23 on June 14, 2023, 07:34:07 PMCan anyone help me fix this issue?You didn't say anything about exact model of ledger hardware wallet you are using.If you have ledger S and ledger S plus you should be safe updating firmware, new recover feature was only affecting ledger nano X.Quote from: peterpiper23 on June 15, 2023, 03:29:26 PMIs there any other way to send my BTC from this address other than using Electrum Wallet with my Ledger (even though that is how I originally set it up)?There are few other open source wallets that can work with ledger device, that is Sparrow wallet, Lily Wallet and I think Specter wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tcash",
      "created_time": "July 02, 2023, 04:22:56 PM",
      "body": "Why not use Ledger Live to send your BTC to the receiving address that you want to send to?Quote from: peterpiper23 on June 15, 2023, 03:29:26 PMThanks for the suggestions.Unfortunately, nothing has worked.  I enabled/disabled the Change Address several times and I even ended up updating the Ledger to the latest version but I'm still getting the same error.Any other ideas/suggestions?Is there any other way to send my BTC from this address other than using Electrum Wallet with my Ledger (even though that is how I originally set it up)?Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 02, 2023, 05:38:03 PM",
      "body": "Quote from: tcash on July 02, 2023, 04:22:56 PMWhy not use Ledger Live to send your BTC to the receiving address that you want to send to?By using Ledger Live, you connect exclusively to Ledger's servers, meaning you have zero privacy from Ledger. And given that Ledger have shown in the past they don't really take user privacy seriously, that should concern you.Additionally, now if you boot up Ledger Live it will prompt (or maybe even force?) you to install new firmware which implements their Ledger Recover protocol. This is a massive security risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "July 02, 2023, 07:04:51 PM",
      "body": "Quote from: o_e_l_e_o on July 02, 2023, 05:38:03 PMAdditionally, now if you boot up Ledger Live it will prompt (or maybe even force?) you to install new firmware which implements their Ledger Recover protocol. This is a massive security risk.A prompt does appear, but from what I could gather they aren't (as of now) enforcing their users to install the new firmware. Logically users will eventually feel the need to update since Ledger will block certain coins from appearing (and features) if they don't update their firmware, so as it stands now it is a game of cat and mouse. The most logical solution would be to abandon Ledger all together, but that doesn't seem to be the sentiment no longer. I guess some people will never learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 03, 2023, 10:37:06 AM",
      "body": "Quote from: RickDeckard on July 02, 2023, 07:04:51 PM~snip~The most logical solution would be to abandon Ledger all together, but that doesn't seem to be the sentiment no longer. I guess some people will never learn.This is the only logical solution, and let's say that there are good alternatives for those who only own Bitcoin when it comes to hardware wallet, but this is not the case with all those who want a secure multi-cryptocurrency hardware wallet. Ledger knows that this is their biggest advantage and of course they do everything to keep as many users as possible and to attract new ones.I'll just add that I didn't even hope that people would learn a lesson, because in order for someone to understand the risk they face if they use Ledger, they would need to understand some basic safety concepts promoted by various HW manufacturers. Just the thought of the company having the idea to offer a service that violates the entire concept of security provided by HW should be enough for everyone to stop using that device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "July 03, 2023, 09:59:56 PM",
      "body": "Quote from: Lucius on July 03, 2023, 10:37:06 AM~~I'll just add that I didn't even hope that people would learn a lesson, because in order for someone to understand the risk they face if they use Ledger, they would need to understand some basic safety concepts promoted by various HW manufacturers. Just the thought of the company having the idea to offer a service that violates the entire concept of security provided by HW should be enough for everyone to stop using that device.I've found myself asking the same questions not much after the Ledger Recover fiasco. I even asked my friends what they thought about the concept even before voicing my opinion about it. Truth is, they have no idea how Bitcoin works and they simply don't care. They just want to know that they bought a recognizable hardware wallet device from a company that is too big to fail (one argument), that had presence in Davos (another argument) and that their are making this to reduce the risk of having the funds locked in case something bad happens (third argument). I honestly tried to explain my point of view of the problem with the feature but somehow they just don't care.Sometimes I think that I'm the problem - perhaps I delve too much into technical details and my message doesn't get understood correctly - but I don't think that's it (at least in most cases). At the end of the day the only logical solutions that I find is that, once again, people just don't care. They want to \"have bitcoin\" (and other coins), and don't want to bother with anything else. I did my part at least, I can't feel bad if something happens to their coins at least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 04, 2023, 12:47:04 PM",
      "body": "Quote from: RickDeckard on July 03, 2023, 09:59:56 PM~snip~At the end of the day the only logical solutions that I find is that, once again, people just don't care. They want to \"have bitcoin\" (and other coins), and don't want to bother with anything else. I did my part at least, I can't feel bad if something happens to their coins at least.I think the whole truth actually fits in these two sentences you wrote, and I've noticed that over the years when I've listened to what and how people talk about Bitcoin. That is why I have written many times that for most people Bitcoin as an idea is unacceptable because they do not want to move a millimeter from the simplicity offered by each bank - and that is a plastic card + PIN + zero responsibility for everything that happens to the bank or their account.Unfortunately, human society has largely turned into a faceless lazy mass that increasingly allows others to think for them, and use their own brains less and less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "July 04, 2023, 08:40:15 PM",
      "body": "Quote from: Lucius on July 04, 2023, 12:47:04 PMUnfortunately, human society has largely turned into a faceless lazy mass that increasingly allows others to think for them, and use their own brains less and less. You just made me remember this speech[1] - minute 18:32 - by Alan Shore (James Spader) in Boston Legal (Season 2, Episode 27). It's about how chimpanzees, when given the option to choose between their favorite juice and to look at a picture of the dominant chimpanzee, they chose the later. It's almost like we are in today's age - it seems that we are hardwired into praising and wanting to know what people, that we see as more popular than ourselves, are doing. And if they tell us to follow a certain direction (like some influences on YT do regarding crypto), most people actually follow them without questioning and stopping for a second to ask \"Why\".PS: Sorry for the slight Off Topic.[1]https://dai.ly/x6oo22e",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peterpiper23",
      "created_time": "July 13, 2023, 02:03:07 AM",
      "body": "Quote from: o_e_l_e_o on June 16, 2023, 09:28:30 AMRather than importing your seed phrase directly in to Electrum as suggested above which presents a security risk, try downloading Sparrow wallet. Sparrow will also allow you to set a custom derivation path as Ledger does, and other users have had success in bypassing similar \"unusual path\" errors with Electrum by using Sparrow instead.There is a guide to link your Ledger to Sparrow available via the Ledger website here: https://support.ledger.com/hc/en-us/articles/10615436599837-Connect-your-Ledger-to-Bitcoin-BTC-network-with-SparrowHi there...apologies but I'm still trying to figure this out and would like to follow your advice.  Can you please be more specific with regards to the exact steps that I should take to try this out?After I download Sparrow wallet, should I open up a New Wallet or Import a Wallet?I tried creating a New Wallet and I selected the option \"Show Derivation\" and entered in the 44'/5757'/0' derivation path that was previously shown to be causing an error on my Electrum wallet.  However, once this wallet was created and connected to my Ledger, it is clearly a new wallet with no history and obviously no BTC that I could send.I'm not sure if I need to Import my wallet from Electrum - and if so, how I would even do so, since I don't have the keystore - it's just an app.Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}