{
  "id": "topic_5401420",
  "title": "emmaglory5",
  "author": "emmaglory5",
  "created_time": "June 05, 2022, 05:05:28 AM",
  "content": "Luna Classic New Luna Classic Airdrop Just Launched! ❖ See if you verify for Luna 2.0 Airdrop➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖The market has been brutal lately...So to make it better for everyone we decided to drop a big one this time!To check if you are eligible for our latest Airdrop go onto our website - https://classicluna.io/All traders/holders are eligible to claim: Website: https://classicluna.io/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401420",
  "comments": [
    {
      "author": "nakamura12",
      "created_time": "June 05, 2022, 06:14:21 AM",
      "body": "So you are one of the team members if Luna?. What's with the eligibility to qualify for Luna airdrop?. I think it's much better if it's do this do that to receive Luna Airdrop. My guess is that the amount receive will be small as I noticed these days token airdrop or coin airdrop is not much and yes, some let you earn small amount like $5. Not gonna join since I don't think I am qualified to join and I checked the site and I didn't find any to verify if you are qualified or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "June 05, 2022, 06:34:14 AM",
      "body": "Quote from: nakamura12 on June 05, 2022, 06:14:21 AMSo you are one of the team members if Luna?. What's with the eligibility to qualify for Luna airdrop?. I think it's much better if it's do this do that to receive Luna Airdrop. My guess is that the amount receive will be small as I noticed these days token airdrop or coin airdrop is not much and yes, some let you earn small amount like $5. Not gonna join since I don't think I am qualified to join and I checked the site and I didn't find any to verify if you are qualified or not.OP is red trusted and he have red flag you can check his trust setting. It is completely scam. $LUNA Airdrop no longer available now. Luna team already distributed all Airdrop token.  Old Luna name is (Luna Classic) then why they will bought domain name of classicluna.io  lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 05, 2022, 06:57:26 AM",
      "body": "Quote from: smartaction on June 05, 2022, 06:34:14 AMOP is red trusted and he have red flag you can check his trust setting. It is completely scam. $LUNA Airdrop no longer available now. Luna team already distributed all Airdrop token.  Old Luna name is (Luna Classic) then why they will bought domain name of classicluna.io  lol Thanks, I didn't notice that the op is red trusted. Even though if this is the real Classic Luna, I still won't join the airdrop or try to check if I am qualified or not. Of course I know the name of the old Luna which is Terra Luna Classic (LUNC). That's why there's no one bother to reply in this thread is because it is a scam  and I did check the site and it looks like the original luna site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smyslov",
      "created_time": "June 05, 2022, 09:47:11 AM",
      "body": "The red tag is very much visible on my end OP also has a flag raised he like posting scam projects, imitation projects like this New Luna can be considered a scam, we have a lot of scam projects already and many of these are imitations of projects that gone viral like Dogecoin, Elon Musk and now this New Luna Classic, even if its an airdrop they will entice you to buy their shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leea-1334",
      "created_time": "June 05, 2022, 01:13:25 PM",
      "body": "You guys do know the only way you get the airdrop is to have the original Luna/Terra right? So if you hold it,,, you will get it, no need to launch or do any new ones.This is how a scam perpetuates itself,,, feel sorry if you got scammed by Classic original Terra but I will not feel sorry if you go back in to get fooled all over again!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MKTV 90",
      "created_time": "June 08, 2022, 12:40:22 PM",
      "body": "#PROOF OF REGISTRATIONForum Username: MKTV 90Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3469632Telegram Username: @Alim509Participated Campaigns: Twitter, Instagram BSC wallet address: 0x59718461B231eFC3e1488B2f5819387Faa689A9B",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}