{
  "id": "topic_5408864",
  "title": "AB de Royse777",
  "author": "AB de Royse777",
  "created_time": "August 05, 2022, 07:02:37 PM",
  "content": "JollyGood    2022-08-04    Reference    Feedback updated: This user has serious anger management issues and avoids answering questions about their full involvement in the Royse777/Bitlucy scam.Has refused to return funds to all victims citing fake KYC requirements and was campaign manager and self declared \"Co-Partner and Marketing Director\" in the Royse777/Bitlucy scam  JollyGood    2022-06-23    Reference    Read previous feedback or click link for details about the Bitlucy scam. Unacceptable conduct from a campaign manager. In this situation negligent management cannot be excused by mitigating circumstances or previous forum post history.I will review/revise my feedback and support of flag if compelling evidence or statements come to light. While he had one older one, now he added another one. What is he trying to prove? I would rather ask the questions to the users who is trusting JollyGood. JollyGood's judgement is Trusted by:1. Vod (Trust:  +26 / =2 / -2) (1929 Merit earned) (Trust list) (BPIP)2. DiamondCardz (Trust:  +7 / =0 / -0) (98 Merit earned) (Trust list) (BPIP)3. peloso (Trust:  +1 / =3 / -5) (186 Merit earned) (Trust list) (BPIP)4. Coinfan (Trust:  +1 / =0 / -0) (109 Merit earned) (Trust list) (BPIP)5. Lauda (Trust:  +33 / =17 / -5) (1924 Merit earned) (Trust list) (BPIP)6. digit (Trust: neutral) (9 Merit earned) (Trust list) (BPIP)7. Timelord2067 (Trust:  +13 / =10 / -0) (DT1 (-8) 918 Merit earned) (Trust list) (BPIP)8. jeremypwr (Trust:  +19 / =2 / -0) (1991 Merit earned) (Trust list) (BPIP)9. allyouracid (Trust:  +1 / =0 / -0) (270 Merit earned) (Trust list) (BPIP)10. stompix (Trust:  +1 / =0 / -0) (DT1! (4) 3436 Merit earned) (Trust list) (BPIP)11. Avirunes (Trust:  +12 / =0 / -0) (DT1! ( 419 Merit earned) (Trust list) (BPIP)12. dopey (Trust:  +1 / =0 / -0) (14 Merit earned) (Trust list) (BPIP)13. SiNeReiNZzz (Trust:  +4 / =2 / -0) (792 Merit earned) (Trust list) (BPIP)14. NeuroticFish (Trust:  +1 / =0 / -0) (DT1! (6) 3729 Merit earned) (Trust list) (BPIP)15. DaveF (Trust:  +31 / =1 / -0) (3393 Merit earned) (Trust list) (BPIP)16. owlcatz (Trust:  +48 / =0 / -1) (629 Merit earned) (Trust list) (BPIP)17. examplens (Trust:  +4 / =4 / -0) (DT1! (11) 824 Merit earned) (Trust list) (BPIP)18. nutildah (Trust:  +14 / =0 / -0) (DT1! (9) 4344 Merit earned) (Trust list) (BPIP)19. thandie (Trust: neutral) (359 Merit earned) (Trust list) (BPIP)20. LFC_Bitcoin (Trust:  +13 / =0 / -0) (5957 Merit earned) (Trust list) (BPIP)21. s0nix (Trust: neutral) (11 Merit earned) (Trust list) (BPIP)22. TwitchySeal (Trust:  +6 / =1 / -0) (1182 Merit earned) (Trust list) (BPIP)23. vlom (Trust:  +1 / =0 / -0) (113 Merit earned) (Trust list) (BPIP)24. JaredKaragen (Trust: neutral) (165 Merit earned) (Trust list) (BPIP)25. Slow death (Trust:  +3 / =2 / -0) (532 Merit earned) (Trust list) (BPIP)26. IconFirm (Trust:  +1 / =1 / -1) (74 Merit earned) (Trust list) (BPIP)27. johnsmithx (Trust:  +0 / =2 / -1) (7 Merit earned) (Trust list) (BPIP)28. blurryeyed (Trust:  +1 / =5 / -2) (20 Merit earned) (Trust list) (BPIP)29. kurian (Trust: neutral) (2 Merit earned) (Trust list) (BPIP)30. CryptopreneurBrainboss (Trust:  +13 / =1 / -0) (2898 Merit earned) (Trust list) (BPIP)31. mosprognoz (Trust:  +4 / =1 / -1) (177 Merit earned) (Trust list) (BPIP)32. KTChampions (Trust:  +7 / =0 / -0) (DT1! (0) 1318 Merit earned) (Trust list) (BPIP)33. icopress (Trust:  +14 / =0 / -0) (DT1! ( 3109 Merit earned) (Trust list) (BPIP)34. Removed naim027 Banned! (Trust: neutral) (517 Merit earned) (Trust list) (BPIP)34. invincible49 (Trust:  +1 / =0 / -0) (243 Merit earned) (Trust list) (BPIP)35. logfiles (Trust:  +5 / =0 / -0) (DT1! (9) 1205 Merit earned) (Trust list) (BPIP)36. tvplus006 (Trust:  +15 / =0 / -0) (1517 Merit earned) (Trust list) (BPIP)37. witcher_sense (Trust:  +15 / =0 / -0) (DT1! (14) 3086 Merit earned) (Trust list) (BPIP)38. darcon_pr (Trust: neutral) (0 Merit earned) (Trust list) (BPIP)39. The Cryptovator (Trust:  +19 / =1 / -0) (DT1! (20) 2008 Merit earned) (Trust list) (BPIP)40. lovesmayfamilis (Trust:  +26 / =0 / -0) (DT1! (11) 3025 Merit earned) (Trust list) (BPIP)41. cryptobenn (Trust:  +0 / =0 / -1) (1 Merit earned) (Trust list) (BPIP)42. TalkStar (Trust:  +11 / =0 / -0) (733 Merit earned) (Trust list) (BPIP)43. Trade Runner (Trust:  +0 / =1 / -1) (63 Merit earned) (Trust list) (BPIP)44. bitbottrader (Trust: neutral) (8 Merit earned) (Trust list) (BPIP)45. zasad@ (Trust:  +3 / =2 / -0) (DT1! (3) 3276 Merit earned) (Trust list) (BPIP)46. Rikafip (Trust:  +12 / =1 / -0) (3663 Merit earned) (Trust list) (BPIP)47. protrader786 (Trust:  +0 / =0 / -1) (61 Merit earned) (Trust list) (BPIP)48. FatFork (Trust:  +6 / =0 / -0) (DT1! (2) 1297 Merit earned) (Trust list) (BPIP)49. decodx (Trust:  +1 / =0 / -0) (480 Merit earned) (Trust list) (BPIP)50. CryptoYar (Trust: neutral) (532 Merit earned) (Trust list) (BPIP)51. villain_Mr.Burns (Trust:  +0 / =2 / -2) (25 Merit earned) (Trust list) (BPIP)Are you trusting him because he is busting scam?If so, do you see he is using your trust against me because he thinks I need to share the same information that I have shared with the people I trust.I have full right to choose who should I show my data. No one can force me for it. But JollyGood is forcing me for it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408864",
  "comments": [
    {
      "author": "yahoo62278",
      "created_time": "August 05, 2022, 08:44:20 PM",
      "body": "Nowhere in his feedback do I read Royse777 needs to share with me the information you shared with others. You have 1 red tag(2 from the same user, but still basically 1). With what happened you are lucky to only have his feedback against you. If it was just a regular user or newbie they would have been painted by 50 users, but most of the community gave you a pass. If you don't like Jollygoods feedback then ~ and ignore him and move on or answer his inquiry and solve the problem. Quit being a drama queen!!! Yea i'm coming off a bit harsh but it is as simple as what I just said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 05, 2022, 09:16:45 PM",
      "body": "Quote from: yahoo62278 on August 05, 2022, 08:44:20 PMYou have 1 red tag(2 from the same user, but still basically 1). With what happened you are lucky to only have his feedback against you.Actually, OP has negative feedback from 2 DT-members. I guess you don't see efialtis' feedback because of your Trust list, but he's on DT nonetheless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "August 05, 2022, 09:25:06 PM",
      "body": "Quote from: LoyceV on August 05, 2022, 09:16:45 PMQuote from: yahoo62278 on August 05, 2022, 08:44:20 PMYou have 1 red tag(2 from the same user, but still basically 1). With what happened you are lucky to only have his feedback against you.Actually, OP has negative feedback from 2 DT-members. I guess you don't see efialtis' feedback because of your Trust list, but he's on DT nonetheless.Yea likely right, but still the number is small compared to what it could have been. Still 6 or so neutral tags on the profile as well. If the issue is that you (Royse) feel the red tags are hurting you financially, then you should message these users and ask what it is they need to remove them. If the request isn't too huge, then try to appease them and be done. Obviously do not give in to monetary demands( report them if that becomes the case) and don't hand out your address, but if it's something reasonable then swallow the pride and get it done. Aside from that, businesses are or should look at your feedback negative, positive, or neutral when they contact you about possible work. Explain the situation and let them decide whether they wanna hire you. (I am just guessing this is what your issue might be, I'm not trying to assume or speak for you).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "August 05, 2022, 10:42:28 PM",
      "body": "It's so refreshing that the era of pitchforks and flaming torches whenever someone's hurtful feelings have been hurt by negative trust feedback has waned and become instead something of a yawn-fest instead of a cluster_Fk!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "August 06, 2022, 12:59:04 AM",
      "body": "Quote from: yahoo62278 on August 05, 2022, 09:25:06 PMAside from that, businesses are or should look at your feedback negative, positive, or neutral when they contact you about possible work. Hopefully that's the case with whoever hires bounty/campaign managers--and admittedly I have a very customized trust list, but I'm seeing that the majority of OP's trusted feedback is positive, and it really doesn't look like anything out of the ordinary.  It's always been the case that even some of the most trusted members of the forum have had red daubs of paint on their trust pages by DT members for one reason or another.This isn't the first thread questioning JollyGood's feedback-leaving judgement, and I doubt it'll be the last.  IMO he's putting in a good amount of effort trying to bust scammers and assorted shitbags, but he's made way too many questionable calls for me to have done anything other than exclude him from my trust list.OP, whether JollyGood is ever booted from DT or not, I wouldn't lose sleep over this.  It's not even that unusual for people to leave red trust multiple times, even if the recipient hasn't committed any new real or perceived offenses.  Vod used to do it all the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adele111",
      "created_time": "August 06, 2022, 01:13:22 AM",
      "body": "Heres a idea instead of making this thread to complain about your reputation what about making a thread asking for your victims to post so you can pay them back ? ? ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 06, 2022, 02:04:07 AM",
      "body": "Move on Royse  If I am right, one user can leave 3 feedbacks to another user. It's the limit.In addition, if 3 feedbacks are for a same issue, it does not make sense but it is not a serious issue. I still think it is better to leave only one feedback for one issue. If you leave a feedback on one user, later you change your mind, you can simply delete the past feedback and create a new one. Duplicate feedback is unnecessary but at least it does not break any forum rule.Move on and keep your mind fresh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "August 06, 2022, 02:39:56 AM",
      "body": "Quote from: tranthidung on August 06, 2022, 02:04:07 AMIf I am right, one user can leave 3 feedbacks to another user. It's the limit.Just to fix it, you can leave 5 feedback to the same user. No matter if they are negative, positive, neutral. I just have checked.Quote from: Adele111 on August 06, 2022, 01:13:22 AMHeres a idea instead of making this thread to complain about your reputation what about making a thread asking for your victims to post so you can pay them back ? ? ? Why will Royse777 pay them back? Deposit was scammed by Lucy, not by Royse777. Also, he tried to get some such information at the beginning. It’s very difficult to verify someone's claim of deposit now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 06, 2022, 04:53:02 AM",
      "body": "Royse777's previous move worked out well for her, as yahoo62278 ended up changing his negative feedback to neutral. Now I doubt it will work for her with JollyGood.And about asking for explanations to the 50 who trust JollyGood, lol, maybe after this thread someone will change or come to give explanations, but if they trust him knowing that despite making a good contribution to the forum, he sometimes gives red trust as candies, I do not think most of them will change anything. In mi case I looked at his trust list and trust feedbacks, and decided to neither include nor exclude him. And this thread is not going to make me change that decision either.Waiting to see what BitcoinGirl.Club has to say as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 06, 2022, 07:37:47 AM",
      "body": "Quote from: Royse777 on August 05, 2022, 07:02:37 PMI would rather ask the questions to the users who is trusting JollyGood. In the same way I told JollyGood that he's exaggerating and advised to cool down, now I will do the same to you: please cool down, you're exaggerating and this will do more harm to you than good.And I will not answer your question because:1. I don't have to.2. As I said, you're exaggerating.3. If I'd answer, it would be an answer neither you, nor JollyGood would like.All I can tell that my trust list will probably change (suffer a big clean up), an operation that seems to be badly needed now since I've became part of DT. But it won't happen overnight and it certainly won't happen under pressure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 06, 2022, 07:50:13 AM",
      "body": "Quote from: NeuroticFish on August 06, 2022, 07:37:47 AM... you're exaggerating and this will do more harm to you than good.If I were Royse777 I would act in a more humble way, because as yahoo62278 says, if that had happened to someone else, that person would have many red tags nowadays, not changed to neutral.Feeling entitled to have others give her explanations about who they include in their trust lists, when she has been involved in a scam that has made a lot of people lose money, doesn't look good and it makes me think that JollyGood is right when he says she has anger management issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "August 06, 2022, 08:41:28 AM",
      "body": "I usually prefer keeping off such disagreements, especially from members who registered earlier than me but since I have been mentioned here, let me make a small remarkQuote from: Royse777 on August 05, 2022, 07:02:37 PMAre you trusting him because he is busting scam?Yes, he's done quite a lot in the past exposing a ring of scammers, that's why I added him to my trust list. In the event that things change drastically, I can revise my trust list accordingly. QuoteIf so, do you see he is using your trust against me because he thinks I need to share the same information that I have shared with the people I trust.Royse777, I reckon most members understood and believed your story and are hoping things get better for you, including me. Those who left you negative feedback did it out of their judgement. Everyone can never think a like. So this shouldn't a war of who did vs who didn't, who trusts vs who doesn't.Quote from: Royse777 on August 05, 2022, 07:02:37 PMI have full right to choose who should I show my data. No one can force me for it. But JollyGood is forcing me for it.True, you have a right and no one should force you to do anything.However, I believe both of you guys should cool off. It makes no sense having fights over something that can be resolved calmly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 06, 2022, 07:55:18 PM",
      "body": "Here we go again  Lot's of those members you listed trusted JollyBad from the time when he did some real scam busting work and exposing scammers, before the time he became campaign gambler You can't expect all of them to review all the cases connected with him, and to reply or explain anything to you.Royse just stop with this shitshow once and for all, leave him to write whatever he wants, or else you are just fueling his engine with creation of new topics.If JollyBad has nothing better to do in his life than to write multiple feedback on your profile, that tells more about him than about you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "August 06, 2022, 10:48:28 PMLast edit: August 07, 2022, 04:32:18 PM by JollyGood",
      "body": "Quote from: yahoo62278 on August 05, 2022, 08:44:20 PMNowhere in his feedback do I read Royse777 needs to share with me the information you shared with others. You have 1 red tag(2 from the same user, but still basically 1). With what happened you are lucky to only have his feedback against you. If it was just a regular user or newbie they would have been painted by 50 users, but most of the community gave you a pass. If you don't like Jollygoods feedback then ~ and ignore him and move on or answer his inquiry and solve the problem. Quit being a drama queen!!! Yea i'm coming off a bit harsh but it is as simple as what I just said. The fact she opened this thread for such a pointless exercise shows a problematic mindset on her part and drama queen is quite apt. I feel Royse777 did not deserve a pass and the fact she was tagged red by many members only to have those red changed to neutral has given her more desire to try and remove the remaining negative trusts.Quote from: Timelord2067 on August 05, 2022, 10:42:28 PMIt's so refreshing that the era of pitchforks and flaming torches whenever someone's hurtful feelings have been hurt by negative trust feedback has waned and become instead something of a yawn-fest instead of a cluster_Fk!Royse777 definitely has anger management issues which should have been addressed some time ago.What does not help her is the small group of 2-3 members that are trolling and being duplicitous as they are following the Goebbels doctrine of propaganda \"If you tell a lie big enough and keep repeating it, people will eventually come to believe it\".They have started dropping a few sentences here and there about me and kept up their pretence in the hope of it being regurgitated enough that other members would mistakenly believe it. Thankfully they are on my ignore list and I can skip past their nonsensical drama until or unless I opt to read them when they are quoted by others in a post.Quote from: Adele111 on August 06, 2022, 01:13:22 AMHeres a idea instead of making this thread to complain about your reputation what about making a thread asking for your victims to post so you can pay them back ? ? ? You have a valid point but be careful because the backlash from the 2-3 trolls will probably start against you for saying something which is 100% true.The last I read Royse777 was refusing to pay a victim because (I am not joking) she wanted to carry out KYC! It basically means those that Royse777 voluntarily offered to make whole again will not receive their funds.Have you heard anything so absurd that a partner of a scam casino voluntarily stated they would make victims whole again but then decided to not make a victim whole because first they wanted KYC for a company/website/business that does not exist and second the victim was angry and upset at being scammed he made threats to kill the Bitlucy CEO.Here is the nonsense Royse777 posted in another thread created with the specific intention of trying to have her negative trust changed: https://bitcointalk.org/index.php?topic=5403679.msg60590237#msg60590237Quote from: Poker Player on August 06, 2022, 04:53:02 AMRoyse777's previous move worked out well for her, as yahoo62278 ended up changing his negative feedback to neutral. Now I doubt it will work for her with JollyGood.You are correct. I will not change my negative trust.Correct also, the previous move by Royse777 which lead to the yahoo62278 negative trust being altered to neutral was because of a culmination of issues and events. That infamous now locked thread has all the drama contained within it and that along with several posts elsewhere helped her have another negative trust removed..Quote from: Poker Player on August 06, 2022, 04:53:02 AMAnd about asking for explanations to the 50 who trust JollyGood, lol, maybe after this thread someone will change or come to give explanations, but if they trust him knowing that despite making a good contribution to the forum, he sometimes gives red trust as candies, I do not think most of them will change anything. In mi case I looked at his trust list and trust feedbacks, and decided to neither include nor exclude him. And this thread is not going to make me change that decision either.It really is scrapping the barrel when someone can fall that low that they would create more drama just because one member (me) has updated a feedback  Quote from: Poker Player on August 06, 2022, 04:53:02 AMWaiting to see what BitcoinGirl.Club has to say as well.I am not bothered, it is just another attention seeker that I have on my ignore list.Quote from: NeuroticFish on August 06, 2022, 07:37:47 AMQuote from: Royse777 on August 05, 2022, 07:02:37 PMI would rather ask the questions to the users who is trusting JollyGood. In the same way I told JollyGood that he's exaggerating and advised to cool down, now I will do the same to you: please cool down, you're exaggerating and this will do more harm to you than good.And I will not answer your question because:1. I don't have to.2. As I said, you're exaggerating.3. If I'd answer, it would be an answer neither you, nor JollyGood would like.All I can tell that my trust list will probably change (suffer a big clean up), an operation that seems to be badly needed now since I've became part of DT. But it won't happen overnight and it certainly won't happen under pressure. Royse777 locked that thread before I could reply. There certainly was no exaggeration on my part. The fact this thread was created on a whim on the basis of an updated trust speaks volumes. I tried to keep out of this drama for as long as I could and am only making my first and last post here.Quote from: Poker Player on August 06, 2022, 07:50:13 AMQuote from: NeuroticFish on August 06, 2022, 07:37:47 AM... you're exaggerating and this will do more harm to you than good.If I were Royse777 I would act in a more humble way, because as yahoo62278 says, if that had happened to someone else, that person would have many red tags nowadays, not changed to neutral. I agree. Instead of being humble that she did not receive double figure red tags, Royse777 (whilst being urged on by some of those on my ignore list and those with ulterior motives) somehow believes nobody has their own right to their own opinion about leaving tags when it comes to the Bitlucy scam.Furthermore, what this drama has shown is if you leave no tag or neutral tag then it is fine but if you leave a red tag then trolls start created threads and use other threads to post lies in order to attack members that feel obliged to leave red tags because a scam took place.I did not read a single post where Royse777 actually apologised wholeheartedly for the part she played in the Bitlucy scam. It seems like saying the word sorry was and is too much for her overinflated ego. If those 2-3 members (that I thankfully have ignored) stopped applying the Goebbels doctrine of propaganda to support Royse777 then she would have come back down to earth a long time ago.Quote from: Poker Player on August 06, 2022, 07:50:13 AMFeeling entitled to have others give her explanations about who they include in their trust lists, when she has been involved in a scam that has made a lot of people lose money, doesn't look good and it makes me think that JollyGood is right when he says she has anger management issues. She definitely does have anger problems, she regularly throws tantrums when she does not get her way. Unfortunately for Royse777 she is easily susceptible and as long as she has several members egging her on for their own motives to attack me or anybody else, she will continue to make outrageous demands.Quote from: logfiles on August 06, 2022, 08:41:28 AMQuote from: Royse777 on August 05, 2022, 07:02:37 PMAre you trusting him because he is busting scam?Yes, he's done quite a lot in the past exposing a ring of scammers, that's why I added him to my trust list. In the event that things change drastically, I can revise my trust list accordingly. logfiles you have been doing your part for the community by contributing in the scam accusations board and your efforts are appreciated by many of us  I am out of this drama thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 07, 2022, 01:42:17 AM",
      "body": "Quote from: JollyGood on August 06, 2022, 10:48:28 PMQuote from: Poker Player on August 06, 2022, 04:53:02 AMWaiting to see what BitcoinGirl.Club has to say as well.I am not bothered, it is just another attention seeker that I have on my ignore list.You are a trust spammer. Your game is to keep others hostage of your red tag and demand attention. Your history is once upon a time you were a scam buster which was able to build a good reputation for you. Once achieved you found 1xBit is the easiest target for you to continue. Because of your previous active scam busting history, you took it as guaranteed that you earned some sort of authority from some users. They easily added you in their trust list. These users are still in the hope that you are still a good spam buster. But you changed and became a ghost hunter and trust abuser. You are constantly using unjustifiable theories to justify feedback that you left for others. Your justifications, (1) A member was asked to build a system, the team had ICO, ICO failed or scammed. Your theory is the guy who was asked to build the system is the scammer. (2) You gave a 2nd job because 1st one was successful, in the 2nd job your thing did not go to your way so now you refuse to pay for the time for the 2nd job but pathetically you are asking to refund you for the 1st job. As usual your red tag is the hostage. (3) a member did not share some data to you because they did not feel safe with you. Except one or two members, everyone else accepted the situation. Even from the discussion in public (from several other topics by other victims) it was clear that the member was not the same scammer who you though was the same person. It's even clear that he was as much victim as others, in fact he was the most hurted from the entire project. His reputation has been used, his cash has been used, his privacy has been breached. But still you are harassing him with double red tag (in response for How many red tags is the scammer Royse777 going to get?) and continuing your disrespectful conversation towards him with a troll like PaperWallet.You are using your reputation that you earned from previous work. You now think yourself a powerful authority to ignore conversation with people who challenge your feedback leaving practice. Currently, if anyone here is making the situations uncomfortable for the DT than it's no other than you.You are harmful because you behavior changes for little financial motivation. This leads me to believe that your previous work were to build a reputation for you so that you can earn a living from the forum. The reason of changing your usual character towards duelbits was simple. You did not want to lose your paycheck in case duelbits really was caught on the case. Scam busting was just an easiest route for you, thankfully for you it worked, if it did not then you would find another route. You are using your current reputation to process nonsense against the people you do not like to answer and protecting your employers.Quote from: BitcoinGirl.Club on July 27, 2022, 04:06:07 PMI was following jollyGood and found that it's annoying how he conduct any scam accusations against individuals or company. He always comes from a suspicious perspective enjoys to create unnecessary imaginary arguments against the individual possibly he does not like or against a company which he possibly use to increase his reputation. The way the OP of that topic created the scam accusation with evidences (obviously until his last post it was not clear who was at the wrong side) it was hard to take a side even though duelbits was able to gain huge reputation in the forum over the years. But JollyGood seemed took the job of advocating for Duelbits not only in that thread but also in other thread too which obviously does not go alone with the JollyGood image.PS:Feedback reference",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Factskid1",
      "created_time": "August 07, 2022, 05:49:12 AM",
      "body": "It's quite clear who has anger management issues.https://bitcointalk.org/index.php?topic=5260202.0You leave feedbacks based on what you \"feel\" about the user rather than being rational and thinking about whether a user is actually a scammer.https://i.imgur.com/ppaXNmc.pngLeaving 5 negative feedbacks to the same user on the same day, while you could have created a thread or detailed negative review in a single go if you were in the right mindset. I am not defending the user but just goes to show who needs anger management and ego check.I wanted to post from my main account but JollyGang will leave 20 red feedback.A personal note to JollyGang - Things might get ugly real soon pal, be careful  (concerned Jolly fan, not a threat)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 07, 2022, 06:04:49 AMLast edit: August 07, 2022, 06:16:11 AM by mindrust",
      "body": "Red tags are not even an important issue now. Flags are where the shit is at. Many DT1 trusted members got 1-2 red tags nowadays just because they stole someone’s sweetroll. You just don’t steal other people’s sweetroll. It is a crime against Skyrim and its people.Trying establish a business in this forum is risky af too. Lots of stuff can go very wrong very quickly. People messed up a simple mediator/escrow business before.If you are going to something like this, do it on a smurf account but then most people won’t trust you because nobody in the right mind would trust a newbie with no history.Conclusion: Doing business here is not worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "August 07, 2022, 07:17:46 AM",
      "body": "Quote from: mindrust on August 07, 2022, 06:04:49 AMRed tags are not even an important issue now. Flags are where the shit is at. Many DT1 trusted members got 1-2 red tags nowadays just because they stole someone’s sweetroll. You just don’t steal other people’s sweetroll. It is a crime against Skyrim and its people.Trying establish a business in this forum is risky af too. Lots of stuff can go very wrong very quickly. People messed up a simple mediator/escrow business before.If you are going to something like this, do it on a smurf account but then most people won’t trust you because nobody in the right mind would trust a newbie with no history.Conclusion: Doing business here is not worth it.I guess you nailed it, nobody would trust a newbie account. In turn, highly ranked accounts should know what they are putting on the line by using their status to conduct a certain business. Regarding Royse: she clearly used her reputation to lure people into what she said was supposed to become the biggest casino in the world!!! She refrained from warning people to further deposit crypto while she was aware that withdrawals aren't working anymore.I must honestly say that I haven't ever heard that from other bounty managers who most of us deem highly trustworthy on this forum. They do their bounty management, but so far I haven't seen any of them holding shares in a casino, occupying a very high position likeRoyse777 herself claimed (Marketing Director) and then not warn people to make further deposits while shit already hit the fan. Also keep in mind that some of the newbies who signed up were bashed for claiming that withdrawals stopped working. Why were they bashed and by whom? More trusted community members jumped in and said it'll all be good, it is Royse777 after all! I am too lazy to cite all the sources again here now, but those who think JollyGood distributes red tags to Royse out of fun should clearly put in the effort first and read all those threads. And if some people think JollyGood is exaggerating or abusing the trust he gained over time, I'd rather have JollyGood give one red tag too many (because cases are very likely at least shady when he becomes active) instead of one red tag too less. Benefit of the doubt can hardly apply here because there have been victims and a role taken on by Royse777 that clearly went far beyond what we are used to by all the highly trusted bounty managers on this forum. Nobody would have said a word if Royse777 was just the bounty manager and the website suddenly disappeared. Sadly, we are used to that and that is why some standard practices have been established (like funds in escrow for a certain period at least). Trust from past actions can't automatically be the magic pill if something goes wrong. There are countless examples in real life where individuals or institutions have more or less been trustworthy their whole life, then took it one step too far (even unintentionally at times), and because of that blew up their whole life or existence. That is why you \"just\" got some red tag and as others here already mentioned, you shouldn't overrate that as well. Put yourself in the shoes of those who made deposits without warnings when warnings had already been due. Doesn't feel good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "August 07, 2022, 08:52:18 PM",
      "body": "Quote from: mv1986 on August 07, 2022, 07:17:46 AMRegarding Royse: she clearly used her reputation to lure people into what she said was supposed to become the biggest casino in the world!!! She refrained from warning people to further deposit crypto while she was aware that withdrawals aren't working anymore.That conduct by Royse777 was nothing short of gross negligence.Quote from: mv1986 on August 07, 2022, 07:17:46 AMI must honestly say that I haven't ever heard that from other bounty managers who most of us deem highly trustworthy on this forum. They do their bounty management, but so far I haven't seen any of them holding shares in a casino, occupying a very high position likeRoyse777 herself claimed (Marketing Director) and then not warn people to make further deposits while shit already hit the fan. Also keep in mind that some of the newbies who signed up were bashed for claiming that withdrawals stopped working. Why were they bashed and by whom? More trusted community members jumped in and said it'll all be good, it is Royse777 after all!Watching posts from concerned members being bashed (as you put it) by those effectively saying \"hey, it is Royse777 so do not worry about it she would never scam anybody and would never attach her name to a scam\" - was indicative of what happens when people try to use their reputation in the forum as leverage to gain part ownership of a business. Greed got the better of Royse777.Quote from: mv1986 on August 07, 2022, 07:17:46 AMTrust from past actions can't automatically be the magic pill if something goes wrong. There are countless examples in real life where individuals or institutions have more or less been trustworthy their whole life, then took it one step too far (even unintentionally at times), and because of that blew up their whole life or existence. That is why you \"just\" got some red tag and as others here already mentioned, you shouldn't overrate that as well. Put yourself in the shoes of those who made deposits without warnings when warnings had already been due. Doesn't feel good. That is the principle that should have been applied here but getting several neutral tags for gross negligence for her part in this type of scam is something that should not have happened. Members showed too much leniency and compassion for someone that simply did not even warn depositors that they were unlikely to ever see funds (either deposits or winnings) ever again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}