{
  "id": "topic_5451221",
  "title": "Bureau",
  "author": "Bureau",
  "created_time": "May 04, 2023, 12:06:19 PM",
  "content": "After Bitcoin LN there has not been any major upgrades that can improve a user's experience. I am aware of Taproot upgrade & Schnorr signature. I am also aware that it is far much easier to use wallets that supports Bitcoin LN now than they used be earlier. All these back end upgrades will not make any sense to some one who has zero knowledge about the technical aspects. . What Bitcoin LN offered was a solution and has helped in the adoption of Bitcoin to a large extent. Is there anything in the pipeline that will give a major boost to the adoption or not. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451221",
  "comments": [
    {
      "author": "God Of Thunder",
      "created_time": "May 04, 2023, 04:27:13 PM",
      "body": "I am not aware of any ongoing development as well. I don't see any Good Proposal from community members / Bitcoin users where developers can take a look and think about it. Many people believe LN is not real Bitcoin because it's not on-chain. I still want to see if we can do faster transactions on the chain. I know the SegWit upgrade made it faster and cheaper than before. Still, Sometimes mempool gets congested because of too many new transactions. Recent Ordinals things affected the chain as well. Here is a thread you might find interesting to read https://bitcointalk.org/index.php?topic=5450906.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "May 05, 2023, 07:34:35 AM",
      "body": "Quote from: Learn Bitcoin on May 04, 2023, 04:27:13 PMI am not aware of any ongoing development as well. I don't see any Good Proposal from community members / Bitcoin users where developers can take a look and think about it. Many people believe LN is not real Bitcoin because it's not on-chain. I still want to see if we can do faster transactions on the chain. I know the SegWit upgrade made it faster and cheaper than before. Still, Sometimes mempool gets congested because of too many new transactions. Recent Ordinals things affected the chain as well. Here is a thread you might find interesting to read https://bitcointalk.org/index.php?topic=5450906.0In terms of scalability, I value the segwit technology more than the LN network.  As you have said, many people and including me believe LN network is not bitcoin.I do not have much trust on anything that happens off the chain.Although, LN has helped in completing fast and cheap transactions but I don't see it as an exclusive bitcoin thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 05, 2023, 03:18:47 PM",
      "body": "Quote from: Bureau on May 04, 2023, 12:06:19 PMAfter Bitcoin LN there has not been any major upgrades that can improve a user's experience. Let's first give it a consideration on the need that arises which led to the development of bitcoin lightning network which is scalability issues associated to bulk transactions difficulty and cost, today we are having a recent challenge ongoing the entire bitcoin network which is on the transaction fee, it is now high than ever before since the introduction of bitcoin ordinals to the network, many are currently complaining on high transaction fees and we are believing for new innovation to settle this challenges just as bitcoin lightning network came to make the simple solution for scalability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "May 05, 2023, 06:07:14 PM",
      "body": "Quote from: rby on May 05, 2023, 07:34:35 AMI do not have much trust on anything that happens off the chain.Although, LN has helped in completing fast and cheap transactions but I don't see it as an exclusive bitcoin thing.Well, I respect your opinion. But, I am sorry, I disagree with you. To convert your Bitcoin into Lightning Bitcoin, You have to send your Bitcoin to the Lightning network. Do you believe lightning developers store those original Bitcoin somewhere, and the Lightning Bitcoin can crash somehow if they move those actual Bitcoin? Do you even think they can access those Bitcoin? I don't know the mechanism behind the lightning network, but it's a widely adopted side chain of Bitcoin. A lot of tech guys understand the mechanism, and they adopt it. I heard many of us disagree that LN is not the original Bitcoin. I am not here to debate. I want to know more about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 05, 2023, 09:43:32 PM",
      "body": "Not really sure what will be the next big development on Bitcoin, but in any case, you may want to follow bitcoin-dev -- Bitcoin Protocol Discussion or try to subscribe to their mailing list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "May 06, 2023, 07:59:51 AM",
      "body": "Quote from: Learn Bitcoin on May 05, 2023, 06:07:14 PMQuote from: rby on May 05, 2023, 07:34:35 AMI do not have much trust on anything that happens off the chain.Although, LN has helped in completing fast and cheap transactions but I don't see it as an exclusive bitcoin thing.Well, I respect your opinion. But, I am sorry, I disagree with you.  I heard many of us disagree that LN is not the original Bitcoin. I am not here to debate. I want to know more about it. Of course, LN is not a coin, let alone to be the original bitcoin. Everything done in the LN channel is not questionable by me, where I have my doubts is in anything that is done outside the bitcoin blockchain.I personally will like all my transactions, whether for car purchase or for coffee be recorded on the blockchain, then I should be ready to pay all the fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "May 06, 2023, 08:06:16 AM",
      "body": "The next big development can be already seen undergoing development on Bitcoin's GitHub.BIPs or Bitcoin Improvement Proposal is a way to suggest your change or idea for Bitcoin and if it's accepted, you get to see it in the next Core update.Github URL: https://github.com/bitcoin/bipsAll these BIPs are suggested by the community and work is being done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "May 06, 2023, 10:22:28 AM",
      "body": "Quote from: ETFbitcoin on May 06, 2023, 09:15:34 AMIt's obvious you have fundamental misunderstanding about LN. On technical level, those Bitcoin aren't actually moved to different network, but only moved to 2-of-2 multi signature address with specific spend condition[1]. For starter, i would recommend to read great analogy which written by @o_e_l_e_o at https://bitcointalk.org/index.php?topic=5446207.msg62181353#msg62181353.[1] https://bitcoin.stackexchange.com/a/98814Oh damn. I never tried Lightning Network. I misunderstood because I did not read detailed information about the Lightning network. But I heard I could convert my Normal Bitcoin to Lightning Bitcoin. To do that, I have to send my Bitcoins to an address. Now I know I have to send my Bitcoin to 2-of-2 multi-signature addresses. I have a question, Who controls that wallet? How is Lightning Bitcoin added to your wallet? Is it done manually or automatically once you send your coins to the address? I hear of Blue Wallet and that Electrum also supports Lightning Network. Maybe I should try them, at least for the experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "May 07, 2023, 11:56:25 AM",
      "body": "Smart contract as part of Taproot protocol.Taproot: What it is and how it will benefit BitcoinWhat Taproot Could Mean for Bitcoin InvestorsWith impacts from Ordinals, BRC-20 tokens, I think Bitcoin developers will have to find solutions to increase capacity of Bitcoin network, blocks to handle transactions. They must prioritize it as Bitcoin will have more use cases in future and they can not censor Bitcoin transactions even they are from ordinals or BRC20.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pity Token",
      "created_time": "May 10, 2023, 07:00:29 PM",
      "body": "For upgrades you should looks at what Litecoin is doing, normally it happens there first like a beta test - then it gets added to bitcoin. Latest there is Mimblewimble, but i doubt it will hit bitcoin. Some exchanges dislike the privacy aspect but we should see how it goes for LTC first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "May 10, 2023, 11:33:16 PM",
      "body": "Quote from: rby on May 05, 2023, 07:34:35 AMQuote from: Learn Bitcoin on May 04, 2023, 04:27:13 PMI am not aware of any ongoing development as well. I don't see any Good Proposal from community members / Bitcoin users where developers can take a look and think about it. Many people believe LN is not real Bitcoin because it's not on-chain. I still want to see if we can do faster transactions on the chain. I know the SegWit upgrade made it faster and cheaper than before. Still, Sometimes mempool gets congested because of too many new transactions. Recent Ordinals things affected the chain as well. Here is a thread you might find interesting to read https://bitcointalk.org/index.php?topic=5450906.0In terms of scalability, I value the segwit technology more than the LN network.  As you have said, many people and including me believe LN network is not bitcoin.I do not have much trust on anything that happens off the chain.Although, LN has helped in completing fast and cheap transactions but I don't see it as an exclusive bitcoin thing.Same here, I value segwit than LN but it looks like the current scalability of Bitcoin can't still handle massive transactions.  I hope the Bitcoin developer will enhance the scalability capability of Bitcoin so that it can accommodate more transactions and minimize network congestion in the future.The current attack simply shows the lack of capability of the network to handle \"spiked\" transaction.  I hope this event will make the developer to consider and think that the current scalability of Bitcoin needs more improvement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 11, 2023, 02:16:54 AM",
      "body": "Quote from: BitDane on May 10, 2023, 11:33:16 PMSame here, I value segwit than LN but it looks like the current scalability of Bitcoin can't still handle massive transactions.  I hope the Bitcoin developer will enhance the scalability capability of Bitcoin so that it can accommodate more transactions and minimize network congestion in the future.The current attack simply shows the lack of capability of the network to handle \"spiked\" transaction.  I hope this event will make the developer to consider and think that the current scalability of Bitcoin needs more improvement.Scalability is more related to on-chain transactions with Bitcoin network, layer 1. Lightning Network is not and it is not on Bitcoin network.The flow of Bitcoin development is from Segwit and Lightning Network in 2017 to Taproot upgrade in 2021. Now with Taproot we have another type of address and transactions but also have smart contract on Bitcoin blockchain.Years ago, in the hype of DeFi 2.0 in 2020 and 2021, having smart contract on Bitcoin network sounds something very interesting and attractive but in 2023, during latest months, with Taproot smart contract holes that are exploited by Ordinals, BRC20 tokens and BSV developer team attack on it, lot of things must be upgraded for Taproot and its smart contract.If anything should be prioritized for developments, I support on-chain things, Taproot is my favorite than Lightning Network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "May 11, 2023, 05:29:59 AM",
      "body": "Imagine how wonderful it would have been it the so called Bitcoin LN is running on the Bitcoin chain itself, I keep telling people that Bitcoin LN isn't the same with Bitcoin, I would have preferred if Ordinals is running on Bitcoin LN instead, they should have left Bitcoin the way it is, we love it like that, we never wanted Ordinals running on Bitcoin chain, we have Segwit too which is better than Bitcoin LN, it is well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 11, 2023, 04:22:33 PM",
      "body": "Quote from: Outhue on May 11, 2023, 05:29:59 AMImagine how wonderful it would have been it the so called Bitcoin LN is running on the Bitcoin chain itself, I keep telling people that Bitcoin LN isn't the same with Bitcoin, I would have preferred if Ordinals is running on Bitcoin LN instead, they should have left Bitcoin the way it is, we love it like that, we never wanted Ordinals running on Bitcoin chain, we have Segwit too which is better than Bitcoin LN, it is well. We believe more work to comes out base on the developers research and conclusion on ordinals if it works to be a secured attempts on bitcoin network and at the same time cause the entire transaction fee to be lowered to less than $1 as it has been before, we believe there can be a lasting solution and probably there's enough contemplation already going on about this matter, wether to eliminate Ordinals or provide a remedy that will not place a hook on the neck of bitcoin community and users,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}