{
  "id": "topic_5467724",
  "title": "Ruttoshi",
  "author": "Ruttoshi",
  "created_time": "September 22, 2023, 03:33:49 PMLast edit: September 22, 2023, 04:25:04 PM by Ruttoshi",
  "content": "This is just a reminder to everyone in the forum from newbie to legendary, that we should be very careful and not be in a rush when we want to make bitcoin transaction, we should be patient enough to go through the bitcoin address that we are sending the money to, and to make sure that it is the right amount of bitcoin that we are sending, over and over again. The transaction fee should also be re-checked, so as to avoid any expensive mistake that can lead to the loss of your coins.If you mistakenly send your bitcoin to a wrong address, it means that you have lost you bitcoin, because there is no way that you can get it back, if the bitcoin was sent a a noncustodial wallet. If it was sent to an exchange, you only have very slim chance of getting it back.An example is recently we heard how Paxos over paid $500,000 transaction fee to move $2000BTC due to bug.https://cointelegraph.com/news/paxos-confirms-responsible-for-500k-mistaken-bitcoin-transaction.Which F2pool has accepted that it was there pool, but I don't think that F2pool will refund back all the funds, because such transactions rely on the goodwill of the miner to refund or not.Let us try not to be in a rush to make transactions as we might end up regretting for a long period of time instead of using few minutes to glance through the transaction again. Paxos was lucky that the money was refunded because it was the mining fee which can be traced to the minimg pool, but when it is the wrong address, it becomes more complicated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467724",
  "comments": [
    {
      "author": "Gladitorcomeback",
      "created_time": "September 22, 2023, 03:49:10 PM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMThis is just a reminder to everyone in the forum from newbie to legendary, that we should be very careful and not be in a rush when we want to make bitcoin transaction, we should be patient enough to go through the bitcoin address that we are sending the money to, and to make sure that it is the right amount of bitcoin that we are sending, over and over again. The transaction fee should also be re-checked, so as to avoid any expensive mistake that can lead to the loss of your coins. you pointed out well OP and this is much necessary checking before processing transaction. As i remembered the first btc i sent was same case and I sent 20$ worth btc to wrong address and as there is no refund option I lost these btc forever. Our 2 minutes laziness could gives us big lost. Actually These hasty mistakes are happened when we become overconfidence and we do all work with fast fingers without checking thinking that everything is normal. Many users sent tokens to contract address and lost forever and unfortunately I also sent two times to the contract address and after contacting team members I come to know that these tokens are gone forever and no way to recover.As you mentioned, we should double check 3 things to prevent costly mistake. 1: Recipent address2: Amount3: Fee",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 22, 2023, 03:56:49 PM",
      "body": "People still continue to create topic about this same occurrence:Ouch, today someone made a transaction with over $500k fee.Bitcoin User Just Paid Half a Million Dollars for a Single TransactionA single Bitcoin transaction paid a fee of $500kEven without this occurrence, another mistake can be from clipboard malware in which the address you copy would be changed by clipboard malware and paste hackers address instead. It is good to recheck and recheck the amount you want to send and the address that you are sending to, making sure that they are correct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 22, 2023, 04:03:00 PM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMRecently we heard how paxos over paid $500,000 transaction fee to move $2000BTC due to bug.Well, it wasn't a bug in the network, but in whatever bot or automated system that Paxos used to make that transaction. If you use a good software to create your transactions, there is usually a warning if you are about to pay an excessive amount in fees.Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMWhich F2pool has accepted that it was there pool, but I don't think that F2pool will refund back all the funds, F2pool refunded the money back to Paxos a long time ago, and the case is closed already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "September 22, 2023, 04:06:40 PM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMRecently we heard how paxos over paid $500,000 transaction fee to move $2000BTC due to bug.https://cointelegraph.com/news/paxos-confirms-responsible-for-500k-mistaken-bitcoin-transaction.Which F2pool has accepted that it was there pool, but I don't think that F2pool will refund back all the funds, because such transactions rely on the goodwill of the miner to refund or not.Let us try not to be in a rush to make transactions as we might end up regretting for a long period of time instead of using few minutes to glance through the transaction again.they actually returned all the funds to the owner, here's an article talking about the miners returning the funds, there is also a screenshot there showing the transaction.I am a little paranoid and double-checking and sometimes triple-checking the information on the transactions I make has become a hobby of mine, if you ask me, double-checking your transactions should be the bare minimum for everyone to do. the person who made the mistake of putting $500K as a fee is very lucky that the miners decided to return the funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 22, 2023, 04:24:26 PM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMRecently we heard how paxos over paid $500,000 transaction fee to move $2000BTC due to bug.https://cointelegraph.com/news/paxos-confirms-responsible-for-500k-mistaken-bitcoin-transaction.Which F2pool has accepted that it was there pool, but I don't think that F2pool will refund back all the funds, because such transactions rely on the goodwill of the miner to refund or not.Even though the transaction you referenced is controversial with many saying it was deliberate just to create headlines, I think the entire thing is positive for the Bitcoin community as it shows solidarity and unity among Bitcoiners. Nevertheless, we can never dispel the importance of being extremely careful when carrying out transactions because it is not everyone that can be as generous and considerate as F2pool to refund such huge amount of money. Some will just take it as \"miracle money\" and a prayer answered    .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "September 22, 2023, 04:30:59 PMLast edit: September 24, 2023, 09:10:37 PM by Saisher",
      "body": "You should make it a habit the most important thing is to set up a habit y of taking your time before making a transaction, I made it a point to spend at least 3 to 5 minutes just looking at the address you're sending I look at the first three characters then the middle then the last three characters.When it comes to making a transaction an ounce of prevention is better than a pound of cure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "September 22, 2023, 05:29:44 PM",
      "body": "Going through one’s address and checking it one after the other and not just the beginning and the ending of the address is very important as it will help at least reduce the risk of sending to a wrong address, especially when the device being used is corrupted by  clipboard virus  as being discussed on this my thread, things are really happening online and we never can be too careful and we don’t know when we are safe again and when we have been infected by some of those viruses.But the incident of the person who sent a payment with a higher transaction fee I don’t think it was something from his end, but I believe it was a mistake from the wallet developer side, as I don’t think anyone can make such mistake by imputing such large amount for fee and smaller one for transaction volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "September 22, 2023, 05:40:26 PM",
      "body": "It's important to understand how bitcoin address work. It is designed in such a way that even if you make an omission in the address the possibility is very low that the transaction will go through. It won't be accepted by miners because it'll be wrong. Quote from: Ever-young on September 22, 2023, 05:29:44 PMGoing through one’s address and checking it one after the other and not just the beginning and the ending of the address is very important as it will help at least reduce the risk of sending to a wrong address, especially when the device being used is corrupted by  clipboard virus  as being discussed on this my thread, things are really happening online and we never can be too careful and we don’t know when we are safe again and when we have been infected by some of those viruses.Except in a such a situation like clipboard attack. That's the relevance of crosschecking the address. As the attack is increasing with multiple methods by the attacker, they've gotten to the stage of manipulating qr codes as well. Aside that, it's almost impossible for a mistake in an address, make a bitcoin transaction go through successfully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "September 22, 2023, 05:48:40 PM",
      "body": "If you want to send bitcoin, you should remain calm and double-check the information, such as the wallet address, network, transaction fee, and other parameters, to prevent sending bitcoin to the wrong recipient. Once you send bitcoin, there is no way to get your money back. We should also exercise caution when using our keyboards because of unidentified virus threats. To ensure that you are sending to the correct address, carefully review the wallet address, paying attention to more than just the prefix and suffix.Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMIf you mistakenly send your bitcoin to a wrong address, it means that you have lost you bitcoin, because there is no way that you can get it back, if the bitcoin was sent a a noncustodial wallet. If it was sent to an exchange, you only have very slim chance of getting it back.The power of knowledge. All I know is that if you sent your bitcoin to the incorrect address, it will be lost; yet, you said that there is a slim chance of recovering it if it was sent to an exchange. Please elaborate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "September 23, 2023, 07:39:15 AM",
      "body": "Quote from: Charles-Tim on September 22, 2023, 03:56:49 PMEven without this occurrence, another mistake can be from clipboard malware in which the address you copy would be changed by clipboard malware and paste hackers address instead. It is good to recheck and recheck the amount you want to send and the address that you are sending to, making sure that they are correct.This clipboard malware is a serious issue, we must exercise extreme caution when attempting to send bitcoin to others. A buddy of mine previously had malware where the copied address was different from the pasted address, causing him to repeatedly transfer bitcoins to the incorrect address. He discovered this after the recipients complained that they had not received the bitcoins. Transferring cryptocurrency differs from sending fiat because the recipient's name is not supplied and when sent to the wrong address, there is nowhere to file a complaint or get your money back, so it is important to double check the recipient address before sending your bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 23, 2023, 08:05:22 AM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMThis is just a reminder to everyone in the forum from newbie to legendary, that we should be very careful and not be in a rush when we want to make bitcoin transaction, we should be patient enough to go through the bitcoin address that we are sending the money to, and to make sure that it is the right amount of bitcoin that we are sending, over and over again.This aspect is more important because we can't afford to make a mistake on copy and paste error in such way, every misplaced receiving address or make an ommission in it, any wrong step leads to the loss of the coin completely and bitcoin transactions are irreversible.Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMThe transaction fee should also be re-checked, so as to avoid any expensive mistake that can lead to the loss of your coins.This aspect is not as risky like the aforementioned one, any mistakeade in this category cannot lead to the loss of your coin, you can only have a little more higher transaction fee which is still not that bad because most cases, we have them less than one dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 23, 2023, 08:24:49 AM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMAn example is recently we heard how Paxos over paid $500,000 transaction fee to move $2000BTC due to bug.https://cointelegraph.com/news/paxos-confirms-responsible-for-500k-mistaken-bitcoin-transaction.in your topic you was talking about sending money to the wrong address and  this did not happen in the case of Paxos, but rather the error was in the transaction fees, which is something that will not happen in most good wallets because they will give you a warning that you are paying more fees than required, so the example here is misplaced.Double check the entire address/es, or at least the first and last 8 char, in addition to choosing the appropriate fees according to ----> https://mempool.space/, while making sure to use a good, open-access and well-reviewed wallet, will protect you from most (if not all) ways of scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 23, 2023, 09:24:31 AM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMLet us try not to be in a rush to make transactions as we might end up regretting for a long period of time instead of using few minutes to glance through the transaction again. Paxos was lucky that the money was refunded because it was the mining fee which can be traced to the minimg pool, but when it is the wrong address, it becomes more complicated.Yes you are right. Transactions details must not be rush, as potential wrong doings might push to errors. Luckily they didnt made a wrong address cause thats a big mistake if ever and the receiver doesnt return it then its a big thank you. I wonder if a mistake like that could csuse the receiver a crime or something to be jail off if he fails to return the funds?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 23, 2023, 10:01:16 AM",
      "body": "Quote from: hugeblack on September 23, 2023, 08:24:49 AMQuote from: Ruttoshi on September 22, 2023, 03:33:49 PMAn example is recently we heard how Paxos over paid $500,000 transaction fee to move $2000BTC due to bug.https://cointelegraph.com/news/paxos-confirms-responsible-for-500k-mistaken-bitcoin-transaction.-snip-Double check the entire address/es, or at least the first and last 8 char, in addition to choosing the appropriate fees according to ----> https://mempool.space/, while making sure to use a good, open-access and well-reviewed wallet, will protect you from most (if not all) ways of scam.Better check the characters in the middle of the address, as the first and last characters are the most easy to tamper and the ones we are most used to check. For relatively large amounts, it's worth the little effort to check every single character, just in case (a few seconds can save you hours/days/years of regret).I think this is the kind of OP we should read more often in this section. Although it is basic information, well-known for most of us, the insight is important for beginners and the post is short, easy to read, and goes straight to the point before giving an example. Thank you and congratulations Ruttoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "September 23, 2023, 10:25:55 AM",
      "body": "Quote from: Charles-Tim on September 22, 2023, 03:56:49 PMPeople still continue to create topic about this same occurrence:Ouch, today someone made a transaction with over $500k fee.Bitcoin User Just Paid Half a Million Dollars for a Single TransactionA single Bitcoin transaction paid a fee of $500kEven without this occurrence, another mistake can be from clipboard malware in which the address you copy would be changed by clipboard malware and paste hackers address instead. It is good to recheck and recheck the amount you want to send and the address that you are sending to, making sure that they are correct.Recently, I was a victim of this malware. I don't know how I got infected. Normal copy paste function was running smoothly but whenever I used a crypto address my copied address would change to another address. I tried to fix it. Fix registry, reset clipboard but no fix. Later I had to install windows again. Luckily I didn't loss any assets. I tried to find that address and found it was tagged as a phishing address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 23, 2023, 11:16:56 AM",
      "body": "While you've made a good point about being careful with the transactions that we do. The chance that someone sents to the wrong address is pretty low and that's through copy paste malware wherein the infected device, desktop or laptop has a default bitcoin address which is owned by the hacker if ever you're trying to send funds to yourself or to anybody. And for the mistake that has happened with Paxos, they've said that it's an error but you're right that we should be careful and check many times before we make a transaction whether we're going to send bitcoins or any crypto to ourselves or to someone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "September 23, 2023, 11:52:14 AM",
      "body": "Quote from: hugeblack on September 23, 2023, 08:24:49 AMyour topic you was talking about sending money to the wrong address and  this did not happen in the case of Paxos, but rather the error was in the transaction fees, which is something that will not happen in most good wallets because they will give you a warning that you are paying more fees than required, so the example here is misplaced.Yes, you are right sir. I just used as reference to show that mistakes can happen along the line, when making our transactions that can lead loss of funds, since this story is the latest transaction that was done unwilling. Three days ago, I mistakenly sent $30 dollar worth of bitcoin to a wrong address due to rush and not rechecking the address again. This was why I created this thread base on my experience, so that forum members wouldn't make the same mistake I did.https://cointelegraph.com/news/one_user_accidentally_sends_520_000_in_btc_to_wrong_wallet this happened nine years ago and it still happens to bitcoiners, but we wouldn't know if the sender don't scream out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "September 23, 2023, 11:57:33 AM",
      "body": "Quote from: tabas on September 23, 2023, 11:16:56 AMWhile you've made a good point about being careful with the transactions that we do. The chance that someone sents to the wrong address is pretty low and that's through copy paste malware wherein the infected device, desktop or laptop has a default bitcoin address which is owned by the hacker if ever you're trying to send funds to yourself or to anybody. And for the mistake that has happened with Paxos, they've said that it's an error but you're right that we should be careful and check many times before we make a transaction whether we're going to send bitcoins or any crypto to ourselves or to someone else.The possibility of the wrong address when sending is small. but it could happen to anyone. I've experienced it. I was planning to send Bitcoin to an exchange, but I copied the wrong address and luckily it was my friend's address. so I don't lose anything other than the fee. That's because previously I made a transaction with a friend by copying his address. and after that, I want to send Bitcoin to the exchange account address. I did it on my smartphone, I wanted to copy the address but maybe it didn't work. and when I paste the address, it is my friend's address that I sent Bitcoin to.It is possible that this error could occur to someone who makes transactions quite often. maybe now it will be safer to scan barcodes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 23, 2023, 12:08:45 PM",
      "body": "Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMThis is just a reminder to everyone in the forum from newbie to legendary, that we should be very careful and not be in a rush when we want to make ~Which F2pool has accepted that it was there pool, but I don't think that F2pool will refund back all the funds, because such transactions rely on the goodwill of the miner to refund or not.Now let's replace bitcoin transaction with bitcointalk topic and it all makes a lot more sense. F2pool has already sent the funds a whole week ago, so, how does it feel, just out of curiosity to tell people to double-check what they do when you're not doing this at all yourself ?  Quote from: Ruttoshi on September 23, 2023, 11:52:14 AMThree days ago, I mistakenly sent $30 dollar worth of bitcoin to a wrong address due to rush and not rechecking the address again.Do you have the tx id?  Juts asking!Quote from: Ruttoshi on September 22, 2023, 03:33:49 PMbecause there is no way that you can get it back, if the bitcoin was sent a a noncustodial wallet. It doesn't matter what the wallet is, all that matters is if you can contact the person in charge of that wallet, I doubt you will send coins by mistake to a previously used address and not know who that guy is and in case of malware you can kiss those coins goodby from the start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}