{
  "id": "topic_5456388",
  "title": "mikemolleux3",
  "author": "mikemolleux3",
  "created_time": "June 15, 2023, 05:35:54 AM",
  "content": "Hey guys,If you're looking for a way to experiment a bit with some BTC options trading (calls/puts, WSB style), we have made a free, anonymous options simulator.It's available here: https://testnet.trade (you will get an anonymous account with a starting balance of 5,000 USD).Or you can search \"Everstrike\" on Google.The simulator only supports everlasting options at this point (no vanilla options support), but its really cool for testing things out.You can do strategies like Long Straddle and Short Iron Condor for BTC.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456388",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 17, 2023, 10:28:14 PM",
      "body": "In other words, it's a testnet trading tool for everstrike.io platform? Does it use real time data? I have been disappointed by some testnet trading platforms in the past.I have never done options before, it could be a good place to learn the basics. I believe most members here too are not so much into trading options.I think your thread is best suited for Service Announcements board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikemolleux3",
      "created_time": "July 09, 2023, 10:23:45 AM",
      "body": "Quote from: Bitcoin_Arena on June 17, 2023, 10:28:14 PMIn other words, it's a testnet trading tool for everstrike.io platform? Does it use real time data? I have been disappointed by some testnet trading platforms in the past.I have never done options before, it could be a good place to learn the basics. I believe most members here too are not so much into trading options.I think your thread is best suited for Service Announcements board.Hi,It uses real time data. Spreads and fees are also realistic.If a mod can move this thread to Service Announcements, I would be grateful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "July 09, 2023, 11:57:04 AM",
      "body": "Quote from: mikemolleux3 on July 09, 2023, 10:23:45 AMIf a mod can move this thread to Service Announcements, I would be grateful.You should be able to do that yourself as well. On the bottom left corner, you have a \"Move topic\" button.Now about your service, is it possible to use the generated API keys for the testnet? I can't see any mention of that on the documentation: https://docs.everstrike.io/#/auth/limit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikemolleux3",
      "created_time": "July 09, 2023, 01:17:19 PM",
      "body": "QuoteNow about your service, is it possible to use the generated API keys for the testnet? I can't see any mention of that on the documentation: https://docs.everstrike.io/#/auth/limitYes. The testnet docs are here: https://docs.testnet.everstrike.ioTestnet API keys can be generated here: https://testnet.everstrike.io/app/apikey (you will need to be logged in)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}