{
  "id": "topic_5420932",
  "title": "DaNNy001",
  "author": "DaNNy001",
  "created_time": "November 14, 2022, 09:02:43 AMLast edit: November 14, 2022, 03:24:00 PM by DaNNy001",
  "content": "As the world is  evolving today so many people are left behind in this technological age and they  seem to be the target of so many fraudsters who have taken the pleasure to exploit these weaknesses from these people. We should make learning and teaching an everyday  thing in our neighborhood and enlighten people who are far backwards about these recent developments The creation of the world first decentralized system is really a revolution that have put the people of the world to an advantage over the cause of having to store your money with a third party included in this process.  Now we can easily store our money in bitcoin saved in wallets e.g the cold wallets   Without someone claiming to be a staff or account manager from the bank telling you,  you have an issue with your bank account or you need to provide certain details for verification of your account In so doing tempering with your money .  Now bitcoin has made convenient for you to be the only one who has watch over your currency   Currently now so many people are experiencing what we know as financial from government controlled fiat currency. I would say bitcoin has come to liberate this world today from such problem and it's just a matter of time before this happens   Despite the rapid movement and verse knowledge of bitcoin been spread around the world so many people in our communities are still left behind on this ground breaking  technological breakthrough..   So I want to use this medium and enlighten everyone in the forum to take the spread of bitcoin as a  community service and help in our own  various way in other to make everyone beneficial to this wonderful initiative..    I myself have started my own community service and have decided to donate some of my computers and planning to start up a  Free seminar class here in my locality to help enlighten more people about this ground breaking Discovery..although I won't say am an expert on cryptocurrency but since I found this forum my knowledge of bitcoin and crypto have increased by a have great margin.. And am looking forward to continue learning so I can pass it on to people that deserves this knowledge.. So I urged everyone to take the spread of bitcoin in our communities as a service to yourself and the community",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420932",
  "comments": [
    {
      "author": "lovesmayfamilis",
      "created_time": "November 14, 2022, 09:47:55 AM",
      "body": "OP, since you say you're still a newbie yourself, the best thing to do for your friends and acquaintances is to invite them to this forum. The fact that many newcomers to the forum, after a month, begin to tell everyone how they teach their neighbors can sometimes be a ticking time bomb. After reading your posts, there is an understanding that you yourself are still in search of the right solutions, so give people the way to the forum so that they can read and communicate with the community on their own and probably gain experience from their mistakes and decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "November 14, 2022, 12:01:36 PM",
      "body": "Quote from: lovesmayfamilis on November 14, 2022, 09:47:55 AMOP, since you say you're still a newbie yourself, the best thing to do for your friends and acquaintances is to invite them to this forum. The fact that many newcomers to the forum, after a month, begin to tell everyone how they teach their neighbors can sometimes be a ticking time bomb. After reading your posts, there is an understanding that you yourself are still in search of the right solutions, so give people the way to the forum so that they can read and communicate with the community on their own and probably gain experience from their mistakes and decisions.One of the major problem we newbies have is the quest to just start making money off everything and platform we come across which isn't right and when that doesn't happen we start tagging them scams because most times we are lazy to work and just want everything free and dine for us.OP I understand that your initiative is positive but before we teach, I think we should learn first and be sure of what we've learnt so as not to pass the wrong knowledge to those we want to teach.I'm still trying to personally sort my way round the forum and some days, I just go through the works of our senior colleagues who are doing well over here, most times just to encourage myself that someday I will be there since they didn't just fly down to those height they've achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 14, 2022, 12:43:06 PM",
      "body": "Quote from: Obari on November 14, 2022, 12:01:36 PMOne of the major problem we newbies have is the quest to just start making money off everything and platform we come across which isn't right and when that doesn't happen we start tagging them scams because most times we are lazy to work and just want everything free and dine for us.OP I understand that your initiative is positive but before we teach, I think we should learn first and be sure of what we've learnt so as not to pass the wrong knowledge to those we want to teach.I'm still trying to personally sort my way round the forum and some days, I just go through the works of our senior colleagues who are doing well over here, most times just to encourage myself that someday I will be there since they didn't just fly down to those height they've achieved.One of the major problem also with members on the forum is the lack of the ability to comprehend what is actually written on an article before jumping and making obnoxious remarksI understand where you are driving at but I  recall stating what I wrote it's still under a planning phase where as I noted the reason for stating so.. Because am still acquiring more knowledge and hoping not started already. so you see I said I should  share my actual plans and in so doing create an awareness to others  who are well inclined  to actually put effort in doing something similar like this as a service to their community and environment around",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 14, 2022, 12:51:28 PM",
      "body": "Quote from: DaNNy001 on November 14, 2022, 09:02:43 AMThe creation of the world first decentralized system is really a revolution that have put the people of the world to an advantage over the cause of having to store your money with a third party included in this process.  Now we can easily store our money in bitcoin saved in wallets either in acold wallethot wallet Do you know what hot wallet is? it's came from exchanges or any other centralized party aka third party, it doesn't make sense to tell Bitcoin didn't need third party but you're still suggest to use third party service (hot wallet).So the conclusion is you want to ask anyone to accept Bitcoin payment as the alternative on their business? I wouldn't dare to accept Bitcoin as payment in my business since it will ruin my privacy and criminals will think if I'm a billionaire, then they will do $5 wrench attack. It's just a nightmare for me, also majority of people are not want to use Bitcoin as a currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "November 14, 2022, 01:00:47 PM",
      "body": "Quote from: DaNNy001 on November 14, 2022, 12:43:06 PMQuote from: Obari on November 14, 2022, 12:01:36 PMOne of the major problem we newbies have is the quest to just start making money off everything and platform we come across which isn't right and when that doesn't happen we start tagging them scams because most times we are lazy to work and just want everything free and dine for us.OP I understand that your initiative is positive but before we teach, I think we should learn first and be sure of what we've learnt so as not to pass the wrong knowledge to those we want to teach.I'm still trying to personally sort my way round the forum and some days, I just go through the works of our senior colleagues who are doing well over here, most times just to encourage myself that someday I will be there since they didn't just fly down to those height they've achieved.One of the major problem also with members on the forum is the lack of the ability to comprehend what is actually written on an article before jumping and making obnoxious remarksI understand where you are driving at but I  recall stating what I wrote it's still under a planning phase where as I noted the reason for stating so.. Because am still acquiring more knowledge and hoping not started already. so you see I said I should  share my actual plans and in so doing create an awareness to others  who are well inclined  to actually put effort in doing something similar like this as a service to their community and environment around I really don't know if you picked offence in my post mate but the truth be told since we're all here to learn, unlearn and also relearn.One thing evident in the forum is the fact that learning never ends and most times, your expectations don't come out as planned.Bitcoin is a journey and we're on in this together, I personally bought the idea of your community service but from your post, you have alot to do as it is a community service and things don't usually turn out as expected.You also stated Hot wallet which implies a third party involvement and most times people shy away from hot wallets for some privacy reasons.I still advice as @ lovesmayfamilis suggested that you introduce them to the forum, not just introducing the but also monitoring the and encouraging them as the journey over here isn't easy as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 14, 2022, 01:29:00 PM",
      "body": "Quote from: DaNNy001 on November 14, 2022, 09:02:43 AMNow we can easily store our money in bitcoin saved in wallets either in acold wallethot wallet I would have chose not to talk here but since the post is directed on beginners and help section then there's a good need with a very important benefit to enlighten our newbies in understanding the difference between cold and hot wallet storage and in case of any recommendation here it is better to completely remain safe with cold storage and avoid any form of centralized wallet that comes in with hot wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 14, 2022, 03:22:40 PM",
      "body": "Quote from: 348Judah on November 14, 2022, 01:29:00 PMI would have chose not to talk here but since the post is directed on beginners and help section then there's a good need with a very important benefit to enlighten our newbies in understanding the difference between cold and hot wallet storage and in case of any recommendation here it is better to completely remain safe with cold storage and avoid any form of centralized wallet that comes in with hot wallet. NOTED the difference is quite clear and understandable now the hot wallet involves you,  your bitcoin and the third party which is involved with the wallet software e.gThe coinbase Trust wallet While cold wallets are accessible even when you are offline and are more secureI can see why the original is quiet complicated like I said we can't stop learning and happy when correct cuz we can only learn very well from our mistake",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}