{
  "id": "topic_5466423",
  "title": "rachael9385",
  "author": "rachael9385",
  "created_time": "September 11, 2023, 01:37:33 PM",
  "content": "Good members of bitcointalk.org, I have come up with a good question. Since I have been checking the forum I have not seen any thread similar to this one I am about to drop here now.The question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).Almost everybody in the world today is planning for themselves and some people are beginning to do other things for themselves. And we all know that after learning, then we start teaching what we have learned to newcomers and then newcomers will now become teachers tomorrow and start teaching the newcomers of their time. Otherwise, then we quit. By then, we are older and do not have the time to check up on the forum..However, I have come across some bitcointalkers on the forum who have been here for over 10 to 12 years. If I am not mistaking, and for me, as a good bitcointalker, I am planning to be on the forum for ten years also, if time will permit.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466423",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "September 11, 2023, 01:47:07 PM",
      "body": "Quote from: rachael9385 on September 11, 2023, 01:37:33 PMThe question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).Why the question, if I may ask?We have people in their early 80s active on this forum, and most people might be above that and some below that same age; it does not really matter the age that someone might reach, and quitting the forum is not something that has to do with age; it's an individual decision. If you have nothing to offer the forum and you believe there is nothing that you could also learn from the forum, you can say good-bye to the forum at any time without using your age to justify your existence. The only place age could be used to justify someone's existence on the forum is if you get old enough that you can no longer use the internet, where the doctors might advise you to avoid direct contact with screen light, which could also be avoided, and you can still make use of dark mode on the forum. Personal: I have never given this a second thought, as I see it as something that is not that relevant to think about since the forum is not a civil service job where someone needs to think about retirement dates and all of that. So if I am to talk about my own existence, I don't know if I can entirely exist on the forum, but I can only limit the time I spend here on the forum, and that will entirely depend on what I have engaged myself in that could be eating most of my time and all of that, and the only time I could be spending here is on my leisure time, which I can just use here as I could use any of the social media out there. Age and work schedule differences are the only things I think can entirely make someone exist here; although others have their own personal opinions, this is just a little piece of mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "September 11, 2023, 02:09:30 PM",
      "body": "Quote from: rachael9385 on September 11, 2023, 01:37:33 PMGood members of bitcointalk.org, I have come up with a good question. Since I have been checking the forum I have not seen any thread similar to this one I am about to drop here now.The question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).Almost everybody in the world today is planning for themselves and some people are beginning to do other things for themselves. And we all know that after learning, then we start teaching what we have learned to newcomers and then newcomers will now become teachers tomorrow and start teaching the newcomers of their time. Otherwise, then we quit. By then, we are older and do not have the time to check up on the forum..However, I have come across some bitcointalkers on the forum who have been here for over 10 to 12 years. If I am not mistaking, and for me, as a good bitcointalker, I am planning to be on the forum for ten years also, if time will permit. That is the function of knowledge, the more it is given, the more it spreads, in contrast to wealth, the more it is given, the more it runs out. What's the connection? However, I don't have a very definite plan for when to stop. As long as you are given time to think healthy, give a few sips of water to those who are thirsty for knowledge, and also don't forget to keep learning and keep learning because knowledge will never end so I think there is no time limit to stop spreading goodness even if it's just a sip of water. In this forum, in my opinion, there is no teacher or student status because everyone can learn to search on their own, do research, read, and make certain references and that means they are not lazy.I've been here since 2016 and still think I'm stupid and still need to learn, I don't want to be the person who thinks a sip of water feels like it's the ocean. I remain the thirstiest person among those who are thirsty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 11, 2023, 02:16:46 PM",
      "body": "I have no plan to quit from this forum, obviously right now I'm very active, but even though I'm not really active to make a post, I will miss what I've done and check what people are discuss related to Bitcoin especially in WO thread.Quote from: rachael9385 on September 11, 2023, 01:37:33 PMI am planning to be on the forum for ten years also, if time will permit. See you later in 2034, if your account is still active after next ten years, it's safe to assume the person who control your account isn't the real owner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 11, 2023, 02:23:26 PM",
      "body": "Quote from: rachael9385 on September 11, 2023, 01:37:33 PMThe question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).Bitcointalk is a forum so I don’t know exactly when I will quit as long as I’m still interested to use the forum. Afaik, we have a very old user(@Jetcash) here that still contributing in the forum through his experience wisdom. If you are referring to signature campaign as bitcointalking then I guess I will quit if my current job fully occupies me. I still have weekends for gambling though so I guess I still have long time here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 11, 2023, 02:28:06 PM",
      "body": "Quote from: rachael9385 on September 11, 2023, 01:37:33 PMGood members of bitcointalk.org, I have come up with a good question. Since I have been checking the forum I have not seen any thread similar to this one I am about to drop here now.The question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).Almost everybody in the world today is planning for themselves and some people are beginning to do other things for themselves. And we all know that after learning, then we start teaching what we have learned to newcomers and then newcomers will now become teachers tomorrow and start teaching the newcomers of their time. Otherwise, then we quit. By then, we are older and do not have the time to check up on the forum..However, I have come across some bitcointalkers on the forum who have been here for over 10 to 12 years. If I am not mistaking, and for me, as a good bitcointalker, I am planning to be on the forum for ten years also, if time will permit. Can you tell me what your question has to do with Economics?I don't see why anyone would set a time in advance for when they will be on the forum, as if there is some kind of contract or rule that forces us to do so. I also don't see why my or anyone else's presence on the forum would prevent someone new from becoming a member of this same forum.You obviously see this forum as some kind of task or maybe even a job, but those who have been there for a long time are still there for some other reason - maybe you will find out one day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 11, 2023, 02:41:54 PM",
      "body": "Will be quitting when either I am not in existence again or when I can reach out to a device or when I can’t get access to internet again. Aside from this personal views the other ways to quit will be when they shut this place down or probably when bitcoin which is sole reason we are is no longer existing, which I doubt will happen. Quote from: rachael9385 on September 11, 2023, 01:37:33 PMThe question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).This isn’t a reason to me that people quit, maybe they are actually tired of here an left but leaving for newbies to join is out of question because there is no limit to the number people that will be here to warrant some leaving before others can join. Also if legendary or old members leave to allow newbies to join who is gonna teach or educate the newbies?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "September 11, 2023, 03:42:47 PM",
      "body": "The part where you said some people might leave for new comers to join is not making sense, like this forum is full and it needs people to stop using it so that newcomers can join, that's how it sound in my hear. There are many people that have been using the forum for a long time and they just stop using it, there is no expiring rate on your Bitcointalk account, if you want to leave you are free, you don't need anyone's permission. Everyone has their reasons why they decide to quit, some might no even be alive anymore, This forum is just like every other forum, it's for crypto discussions and I don't think there is any reason why anyone will want to quit, there are few older people on here too, like 50+ to 60+ range, I guess they have been here for a long time, it doesn't even have to be along time, this forum gives no limit on ages, it's open to everyone. Also this topic doesn't belong to economics section, because there is nothing economic about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 11, 2023, 03:49:23 PM",
      "body": "I'm kind of confused when you say that you are going to quit when there's no quitting if this is your life. What I mean by life is that it's always going to be part of you and it will never go away. It's always going to be a part of you whether or not you earn from it or not. I do believe that for me, that's what would happen. I wouldn't quit. I'm always going to be part of this no matter what the situation is. As long as I can. I'm not that old here compared to the veteran members but I can definitely say that this would definitely be a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "September 11, 2023, 03:49:40 PM",
      "body": "Quote from: rachael9385 on September 11, 2023, 01:37:33 PMGood members of bitcointalk.org, I have come up with a good question. Since I have been checking the forum I have not seen any thread similar to this one I am about to drop here now.The question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).Almost everybody in the world today is planning for themselves and some people are beginning to do other things for themselves. And we all know that after learning, then we start teaching what we have learned to newcomers and then newcomers will now become teachers tomorrow and start teaching the newcomers of their time. Otherwise, then we quit. By then, we are older and do not have the time to check up on the forum..However, I have come across some bitcointalkers on the forum who have been here for over 10 to 12 years. If I am not mistaking, and for me, as a good bitcointalker, I am planning to be on the forum for ten years also, if time will permit. People want access to information at any age. Nobody can promise themselves that in 10 years they will not want this situation. I'm sure many times in the next 10 years opinions may change. I can follow the agenda here, I'm happy to be in the place where Bitcoin is talked about the most because I love Bitcoin.There are people who have been active in the forum for many years. I think the forum contributes a lot to their knowledge. I didn't think about not being here when we have the chance to talk to people about different topics in a place like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 11, 2023, 03:55:07 PM",
      "body": "I think your question is not really a direct one because this is a forum where information and knowledge are shared and I don't know who wants to at least stop getting knowledge and information about what is happening on bitcoin and cryptocurrency globally, apart from crypto related discussions, some other facets of life are also discussed here so this forum is rich in information. Like can you ask when someone will quit from X, Facebook, LinkedIn, telegram, WhatsApp, Snapchat, YouTube, Reddit, Medium etc.You could direct your question properly to ask when someone would quit signature campaign or earning from the forum. I think that is simple and direct .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 11, 2023, 03:59:42 PM",
      "body": "Quote from: rachael9385 on September 11, 2023, 01:37:33 PMThe question is: at what age are you planning to quit Bitcointalking? (Some people might quit for newcomers to join).There is no way that people will be writing this forum just to make some space for newcomers. Because there is no shortage of space here. Administrators of this forum are making sure by providing storage. I mean, of course, this website is being hosted but the point is either way one would not leave this forum just because of newcomers. That's not a good reason. Quote from: rachael9385 on September 11, 2023, 01:37:33 PMAlmost everybody in the world today is planning for themselves and some people are beginning to do other things for themselves. And we all know that after learning, then we start teaching what we have learned to newcomers and then newcomers will now become teachers tomorrow and start teaching the newcomers of their time. Otherwise, then we quit. By then, we are older and do not have the time to check up on the forum..You are right, everybody does have plans but believe me, there are very rare chances of completing for those plans. I make plans daily and I am unable to fulfill them daily. The point is, that we should live our life as it is going, and joining and leaving of this forum is not solely based on plans. It is based on the business and time if one has then he/she will spend it here Also it depends on interest too which I think almost 90% of the forum members had in BTT.Quote from: rachael9385 on September 11, 2023, 01:37:33 PMHowever, I have come across some bitcointalkers on the forum who have been here for over 10 to 12 years. If I am not mistaking, and for me, as a good bitcointalker, I am planning to be on the forum for ten years also, if time will permit. I would love to be here until I have interest and time for this forum. And I have seen older people of around 80+ years here on BTT and also there must be younger ones too (as don't know anyone personally so do not know if any teenager is here on BTT and never read anyone's post claiming he/she is a teenager in BTT). Well, here is the post in which Jet Cash tried to call all octogenarians (people of age more then 80) Another birthday - how about an octogenarian club here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "September 11, 2023, 04:10:33 PM",
      "body": "Quote from: Solosanz on September 11, 2023, 02:16:46 PMSee you later in 2034, if your account is still active after next ten years, it's safe to assume the person who control your account isn't the real owner.Anyway this forum is not a new place to me anymore, because I have been here ever since I was a newbie until now, so those words don't annoy me at all.How can you say that I am not the real owner of the account?Anyways I think it is high time I luck this thread so that embarrassment will stop for good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}