{
  "id": "topic_5445309",
  "title": "GERRyanD",
  "author": "GERRyanD",
  "created_time": "March 17, 2023, 06:24:29 PM",
  "content": "I am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445309",
  "comments": [
    {
      "author": "gunhell16",
      "created_time": "March 23, 2023, 11:51:00 PM",
      "body": "Quote from: GERRyanD on March 17, 2023, 06:24:29 PMI am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.Why are you looking for an ico? because you will enter them in your ico portal? all I know is https://icodrops.com/, https://cryptototem.com/ico-list/ , and https://www.icohotlist.comI'm not sure if what I gave you is correct and if I answered your question too, good luck to you in whatever you plan to do, and I hope it will also help here in the crypto space community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "March 24, 2023, 04:20:39 PM",
      "body": "Quote from: GERRyanD on March 17, 2023, 06:24:29 PMI am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.first, you should introduce your portal. What exactly do you offer for free and what do you expect compensation for?A little more information about the portal, such as cuts and possible impact would definitely help. Do you know that there are also negative backlinks and they lose their influence on further marketing, in which case you can only cause additional complications for someone who presents himself on your page?making an ICO portal is not special wisdom, but making it essential is a somewhat more serious category.also, the ICO belongs more to the altcoin section and the promotion here in the bitcoin project development board is not the most ideal solution.Quote from: gunhell16 on March 23, 2023, 11:51:00 PMbecause you will enter them in your ico portal? all I know is ~cut~why do you think that if these three that you listed already exist, no one is allowed to think about a similar model?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "March 26, 2023, 03:34:53 PM",
      "body": "Quote from: GERRyanD on March 17, 2023, 06:24:29 PMI am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.Why should people enter your ICO portal? is it because it has a fairly high visitor? or because it's free? or because of what? You have to be able to convince people to enter your ICO with the various features that you offer. How could people be interested in entering your ICO portal if you don't provide the platform's features to users? you don't even include a link to the website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "March 26, 2023, 11:02:11 PM",
      "body": "Quote from: gunhell16 on March 23, 2023, 11:51:00 PMQuote from: GERRyanD on March 17, 2023, 06:24:29 PMI am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.Why are you looking for an ico? because you will enter them in your ico portal? all I know is https://icodrops.com/, https://cryptototem.com/ico-list/ , and https://www.icohotlist.comI'm not sure if what I gave you is correct and if I answered your question too, good luck to you in whatever you plan to do, and I hope it will also help here in the crypto space community.I think he has a new launch ICO portal so he wants to populate it by offering a free-of-charge listing you already provided him a link to ICO so he just needs to invite these ICOs, another place to discover ICO projects are the altcoins announcement, ICO may soon become a thing of the past because investors have lost a lot of money from the past ICO projects, it's not attractive any more than it was six years ago, I stopped investing in ICO projects because it's not worth anymore, I prefer to invest it on projects that have proven their worth in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "March 28, 2023, 02:31:36 PM",
      "body": "Quote from: GERRyanD on March 17, 2023, 06:24:29 PMI am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.First of all, I don't think any project will contact you for the ICO listing unless you have a portal with a lot of traffic. Since you have not mentioned the name of the portal, I assume that it would be a new ICO listing site.I would advise you to see other ICO portals like icodrops.com and list those projects ICO on your site. Also, you may research new projects and try to list them before anyone else. I am sure if your site provides first hand information about ICOs, it will soon gain popularity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "catbay",
      "created_time": "March 30, 2023, 09:40:30 PM",
      "body": "Please contact us, we are Nexa, a content creation platform. Our project is currently in the startup phase, and we are wondering if there is an opportunity for collaboration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 04, 2023, 11:25:09 PM",
      "body": "Quote from: GERRyanD on March 17, 2023, 06:24:29 PMI am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.Bad idea for me you should add the word good ICO projects, if you know the current state of ICO you'll know that 8 out of 10 ICO are scams or worthless, you should set up parameters and requirements to get into your ICO portal, you will end up collaborating with scammers and your platform being used and abused by scammers.Don't make yourself a platform for scammers, make your portal the best place to find good ICO projects not just a place for ICO projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "April 05, 2023, 12:55:17 AM",
      "body": "Quote from: gunhell16 on March 23, 2023, 11:51:00 PMQuote from: GERRyanD on March 17, 2023, 06:24:29 PMI am looking for new ICO projects to enter them in my ICO portal.A booking of the advertising space mentioned in the other Treath is not necessary. There is no connection. The entry is free of charge. The advertising optional.Why are you looking for an ico? because you will enter them in your ico portal? all I know is https://icodrops.com/, https://cryptototem.com/ico-list/ , and https://www.icohotlist.comI'm not sure if what I gave you is correct and if I answered your question too, good luck to you in whatever you plan to do, and I hope it will also help here in the crypto space community.I think he means he wants to create a platform which is different from a ico rating site and therefore is looking for first volunteers? If I understood correctly?OP should really work on defining his project, otherwise such lazy definitions are not going to interest any serious ico projects into working together with him in whatever venture he is currently trying to start.What exactly is a ico portal? Is it for rating icos or perhaps a kind of launchpad? Perhaps a mix of both? I think if OP was really serious about his \"ICO portal\" he would have strained himself a bit harder in marketing it on this topic to other project founders. All in all this topic seems to have served its purpose and I see no point in it, really.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "April 06, 2023, 02:23:21 PM",
      "body": "Quote from: goldkingcoiner on April 05, 2023, 12:55:17 AMI think he means he wants to create a platform which is different from a ico rating site and therefore is looking for first volunteers? If I understood correctly?OP should really work on defining his project, otherwise such lazy definitions are not going to interest any serious ico projects into working together with him in whatever venture he is currently trying to start.What exactly is a ico portal? Is it for rating icos or perhaps a kind of launchpad? Perhaps a mix of both? I think if OP was really serious about his \"ICO portal\" he would have strained himself a bit harder in marketing it on this topic to other project founders. All in all this topic seems to have served its purpose and I see no point in it, really.He has created a website where he would list upcoming or ongoing ICOs of new projects, and what he created this thread for was to collect some initial projects and list them on his website so that his website doesn't look empty. He says he does it for free but that is obviously just an option for the start and he would probably charge for projects to stay on top, etc.And ICO websites are supposed to evaluate the projects that they list to find out if they are legit and aren't going to scam the users out of their money as those who visit the ICOs and make investments from their website will blame them for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}