{
  "id": "topic_5403190",
  "title": "gbianchi",
  "author": "gbianchi",
  "created_time": "June 19, 2022, 08:59:00 AM",
  "content": "AKA: Riflessioni in una domenica d'estate sulla lunga storia tra me e Bitcoin Quando 9 anni fa mi sono iscritto a questo forum, il 95% delle discussioni riguardavano concetti, meccanismi e filosofia che stavano dietro alla grande novita' che era Bitcoin.A quei tempi c'erano fondamentalmente 2 altcoin: XRP (che era considerata una roba che non meritava neppure il titolo di altcoin in quanto centralizzata)e LTC (che era considerata una furbesco e innocquo tentativo di copia di BTC).Poi c'erano gli exchange da prendere sempre e assolutamente con le pinze, in quanto facevano tornare dalla finestraquanto si voleva buttar fuori dalla porta: doversi fidare di qualcuno che non si conosce e che fondamentalmente si fara' i suoi interessie non certo i tuoi.sono passati 9 anni ed il terzo crypto-winter che affronto, e ne sono successe di cose:Le alt-coin (tra vere blockchain e token) sono quasi 20.000 a dar retta a coinmarketcapSono nate le alt-coin programmabili, anche se i programmi si chiamano smart-contract son pur sempre  un set di istruzioni per fare qualcosa.E' nata la defi, basata sulla possibilita' di programmare certe blockchain.Sono nate le stable-coin, alcune centralizzate ed altre algoritmiche.Sono nati gli NFTGli exchange sono migliaia.E la lista potrebbe protrarsi tantissimo, ma mi fermo qui, e' sufficente per esporre il concetto che voglio descrivere.E' evidente che in tutto questo fervore, le novita' sono tantissime: poche veramente intelligenti, alcune inutili, molte stupide e dannose e tantissime vere e proprie truffe.Ma se volessi fare una sintesi della vera differenza che ho notato in tutti questi anni, eccola:mi trovo sempre piu' spesso a discutere di dovermi fidare di questo o di quell'altro, e sempre di meno a parlare del concetto rivoluzionario di Bitcoin che era proprio poter per la prima voltadistribuire la fiducia e non doversi piu' fidare di nessuno.E cosi' mi ritrovo a discutere di quanto bitcoin e' pou' o meno correlato agli asset tradizionali della finanza e alle decisoni di politica monetariaO mi ritrovo a discutere di quanto sia impossibile che un certo exchange possa lasciare i clienti in braghe di tela o metterli alle stretteO mi ritrovo a discutere di quanto sia difficile che una certa stablecoin perda il PEGOgnuno di questi argomenti, di per se', ha effettivamente un suo interesse, una sua indubbia importanza,e sarebbe perlomeno ingenuo pensare che un fenomeno come Bitcoin possa crescere senza intrecciarsi inevitabilmentecol resto della finanza e ancor piu' a fondo con la vita delle persone.MAVorrei ricordare prima di tutto a ME, e anche a chi ha voglia di seguire il ragionamento,che bitcoin era nato proprio per non doversi piu' fidare di nessun tipodi organizzazione centralizzata, formata da una persona o gruppi di persone, e quindi non doversi piu' trovarsi assogettati a certi tipi di dinamiche, e fondamentalmente ricatti.invece mi trovo a dire che spero che le tether e le altre stable non perdano il PEG, perche' altrimenti sarebbe un casino,E spero anche che Binance, Bitfinex e compagni siano davvero abbastanza onesti e ben organizzati da non aver problemi... (non basta onesti, devono anche avere abbastanza controlli interni per far si che un dipendente/gruppo di dipendenti truffatare non li manometta dall'interno)E spero che la finanza tradizionale o qualche stato non si organizzi per portare sotto traccia una attacco mirato  proprio a questi exchange e/o a queste stable che sono i \"balurdi\" del mondo crypto (Gli usa ad esempio potrebbero tranquillamenteorganizzare una roba del genere per cercare di disinnescare altri casi alla El salvador)E spero che nessuno della pletora di nuovi protocolli che nascono (vedi TERRA-LUNA) non siano inventati a scopi truffaldini,e se anche sono inventati in buona fede, devo sperare che non ci siano bug/errori/sviste che impediscano il corretto funzionamento.E spero anche che i vari investitori che hanno investito miliardi di $ in fondi di crypto, avessero abbastanza soldi per farlo,e non li abbiano presi in prestito a condizioni che in mercato veramente bear non possono onorare.E spero che i vari CEFI/DEFI stiano offrendo interessi che veramente potevano pagare, e non fossero invece sistemi per fregare preziosi Bitcoin alla gente.E cosi' di speranza in speranza, mi rendo conto che mi ritrovo legato ancor piu' legato ai destini di entita' ingote e centralizzate rispetto ai tempi della finanza \"tradizionale\"E mi rendo anche conto che in questa catena di speranze e' impossibile che vada tutto per il verso giusto.E sopratutto mi chiedo: perche' ho questa catena di speranze, che con la natura di bitcoin fondamentalmente non c'entra nulla,visto che l'unica certezza che ho e' che qualsiasi cosa succeda NESSUNO PUO' PORTARMI VIA I MIEI BITCOIN ?La risposta onesta e' che ho tutte queste speranze perche' non mi aggrada che prezzo di bitcoin (ossia il rapporto BTC/USD) crolli.E qui sta finalmente la vera spietata conclusione di tutto questo ragionamento:Ma che si fottano tutti: La FED, La BCE, l'FMI, Il NASDAQ, le alt-coin che non possono funzionare by-design, quelle che si spaccano per errori,le stable-coin che servono solo a speculare, i gattini e le scimmie digitali, I fondi che fanno il passo piu' lungo della gamba, Cefi e Defi che promettono interessi insostenibili e spietatamente anche tutta la gente che crede in queste cazzate.Se per ripulirsi da questa circo il prezzo di Bitcoin deve scivolare a 1000$, o a 100$ o a 10$ mi sta bene, non ho nessuna intenzione di farmi ricattareda queste dinamiche, le stesse dinamiche del mondo fiat che sta andando rapidamente al collasso. Eventualmente sara' un'occasioneper aumentare le mie preziose riserve di BTC.Che si fottano tutti: io ho una certezza assoluta: Ho i miei bitcoin e nessuno me li puo' portare via,se io non sono cosi' stupido da farmeli portare via, e tutto il resto puo' tranquillamente andare al diavolo.E cosi' posso rifocalizzarmi su speranze piu' consone:Spero che tutte le strutture inutili, malfunzionanti o truffaldine del mondo crypto vengano spazzate via o almeno fortemente ridotte.Spero che alla fine di questo doloroso processo, sempre piu' gente conosca o ri-conosca bitcoin come unica spiaggia sicura.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403190",
  "comments": [
    {
      "author": "Plutosky",
      "created_time": "June 19, 2022, 09:34:15 AM",
      "body": "Che dire, hai detto tutto tu.Aggiungo solo che 9 anni fa è vero che non esistevano le altcoin, DEfi, gli exchange, le stablecoin e tutto il resto del carrozzone che circonda Bitcoin.Ma 9 anni fa non esistevano nemmeno Segwit, gli address P2WPKH, Lightning Network e Taproot.Mandare bitcoin da me a te (senza intermediari) era meno veloce, meno privato, meno sicuro.Gli utenti bitcoin (quelli veri e duraturi, non parlo degli speculatori occasionali) erano forse l'1% di quelli attuali.L'uso monetario era una briciola di quello di adesso, non esistevano migliaia di ATM nel mondo.Installare e configurare un nodo era molto più difficile e i nodi erano meno come numero e più concentrati in pochi Paesi.L'hashrate nemmeno a parlarne. Il mining era molto più centralizzato.Il carrozzone della speculazione è del tutto inevitabile: come abbiamo detto tante volte non è possibile monetizzare un asset a quantità finita tra tutta la popolazione mondiale senza che questo processo non crei dei brutali squilibri periodici tra domanda e offerta, sfruttati dagli speculatori.Direi che per me è giusto e positivo che sia così: è il prezzo da pagare alla libertà di bitcoin, al fatto che non ci siano delle autorità centralizzate a mettere paletti stabilendo quando possa essere comprato/venduto, a che  prezzo, da chi, secondo quali norme. Come le shitcoin sono il prezzo da pagare alla natura open source del codice di bitcoin.Quello che il resto del mondo chiama far west io lo chiamo solo libero mercato,  dove ognuno deve trovare da solo gli strumenti per sopravvivere, crescere e prosperare. Come hanno fatto tutti i bitcoiner che hanno scoperto, a volte sulla propria pelle, l'importanza dei wallet personali, di non fidarsi delle shitcoin, di proteggere ai limiti della paranoia le proprie chiavi private.Godiamoci questo lungo periodo di monetizzazione della più straordinaria forma di moneta mai creata ritenendoci fortunati di assistere alla sua nascita e crescita.Comunque andrà a finire credo che avremo materiale un giorno da raccontare ai nipoti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 19, 2022, 01:53:44 PM",
      "body": "Quote from: gbianchi on June 19, 2022, 08:59:00 AMSe per ripulirsi da questa circo il prezzo di Bitcoin deve scivolare a 1000$, o a 100$ o a 10$ mi sta bene, non ho nessuna intenzione di farmi ricattareda queste dinamiche, le stesse dinamiche del mondo fiat che sta andando rapidamente al collasso. Eventualmente sara' un'occasioneper aumentare le mie preziose riserve di BTC.Guardiamoci in faccia: se Bitcoin dovesse tornare a 1,000 USD sarebbe probabilmente un \"fallimento\" della tecnologia: permettetemi il termine, probabilmente sarebbe un passo indietro enorme in termini di adozione, in termini di evoluzione industriale, adozione. Potrebbe anche forse risorgere, probabilmente in forma diversa e sicuramente in tempi molto lunghi, tali da non poterne garantire la \"immutabilità\" che proprio dall'interesse , anche economico, che attorno ad esso si è creato. Non credo che lo sbarazzarsi di queste cose debba passare per una variazione traumatica di prezzo: un sacco di animali si sono estinti, mentre il coccodrillo resisteva, immutabile. Bitcoin è così (allontaniamoci un attimo dalla metafora dell'honey badger): un tentativo di produrre qualcosa che deve funzionare tra 10,000 anni. Come il coccodrillo, del resto se ne frega, nel bene e nel male.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gbianchi",
      "created_time": "June 19, 2022, 02:42:39 PMLast edit: June 20, 2022, 10:51:28 AM by gbianchi",
      "body": "Quote from: fillippone on June 19, 2022, 01:53:44 PMNon credo che lo sbarazzarsi di queste cose debba passare per una variazione traumatica di prezzo: un sacco di animali si sono estinti, mentre il coccodrillo resisteva, immutabile. Bitcoin è così (allontaniamoci un attimo dalla metafora dell'honey badger): un tentativo di produrre qualcosa che deve funzionare tra 10,000 anni. Come il coccodrillo, del resto se ne frega, nel bene e nel male.Trovo la metafora alquanto azzeccata, in quanto concorda benisimo con i dati che riesco ad estrapolare dalla blockchain di bitccoin: visto da dentro (indirizzi, UTXO, transazioni)  bitcoin e' un mare relativamente tranquillo, non si direbbe che tutto attorno stia succedendo l'armageddon.E se si riuscira' a dare una bella pulita senza dovera arrivare a numeri estremi, tanto meglio.Ma come ho scritto la riflessione mi e' servita a rifocalizzarmi correttamente: Il vero valore di bitcoin e il grande regalo che mi (ci) ha portato e' che non debbo fidarmi di nessuno. Tutto il resto attorno in confronto non vale nulla, e puo' tranquillamente andare a farsi fottere.Se il prezzo di BTC, ossia il rapporto tra BTC ed USD, ossia il rapporto tra una cosa di valore una una roba che non vale quasi nulla, si abbassa troppo.... non vuol dire che BTC vale di meno, vuol semplicemente dire dire che il concetto espresso da quel rapporto non rappresenta nulla di significativo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "June 19, 2022, 03:10:44 PM",
      "body": "Quote from: fillippone on June 19, 2022, 01:53:44 PMGuardiamoci in faccia: se Bitcoin dovesse tornare a 1,000 USD sarebbe probabilmente un \"fallimento\" della tecnologia: permettetemi il termine, probabilmente sarebbe un passo indietro enorme in termini di adozione, in termini di evoluzione industriale, adozione. Potrebbe anche forse risorgere, probabilmente in forma diversa e sicuramente in tempi molto lunghi, tali da non poterne garantire la \"immutabilità\" che proprio dall'interesse , anche economico, che attorno ad esso si è creato. Potrebbe tornare anche a 100$ o 50$, il punto non è quanto, il punto è come e perchè .Dare un valore a 1 btc è operazione complicatissima proprio perchè, per l'interazione della speculazione  sul processo di adozione, il prezzo mente in continuazione. A volte esagera in un senso, a volte nell'altro.Oggi il mercato attribuisce ad 1 btc la stessa quotazione che gli attribuiva a dicembre 2017.Domandatevi: la rete, la tecnologia, la diffusione, l'uso e la maturità di Bitcoin (B maiuscola) sono le stesse di dicembre 2017?Allora uno dei due prezzi dice una bugia. Forse mentono entrambi. E quindi il faro che ci guida devono sempre essere i fondamentali: utenti, indirizzi, transazioni, uso monetario, uso in \"hodl\", nodi, hashrate...Ricordando sempre che la speculazione non può uccidere una tecnologia. E' letteralmente impossibile. Può temporaneamente esaltarla o temporaneamente affossarla ma ucciderla mai. Se una tecnologia muore è solo perchè non serve o perchè esiste una tecnologia migliore.Bitcoin è inutile? Esiste una tecnologia migliore?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin-shark",
      "created_time": "June 19, 2022, 06:12:47 PM",
      "body": "dipende dalla prospettiva con cui si guarda per me un bitcoin varrà sempre un bitcoin non ha senso dargli un valore in fiat,la speculazione finanziaria deve essere solo un aspetto marginale del ecosistema crypto come non hanno senso i vani tentativi di regolamentare e tassare,bisogna tornare ai principi primari,alle ragioni per le quali e stato creato cioe indipendenza dai governi e dal sistema bancario e pieno controllo dei propri valori/averi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "June 19, 2022, 08:08:09 PM",
      "body": "E' bello ogni tanto leggere post di questo tipo, ti fanno fare un passo indietro e riflettere su come tu hai vissuto l'evolversi di Btc.Io sono in questo campo da troppo poco tempo per fare il confronto con il 2009 però da quando ho saputo di Btc mi sono innamorato del protocollo e per me quella è stata la scoperta principale, l'estasi  Ora qui la discussione porta a chiedersi se ci si debba dispiacere di questa forte diminuzione di prezzo.Io spero che questa discesa porti a fare pulizia di tante shit/alt (come infatti sta iniziando ad accadere) ma allo stesso tempo sono dispiaciuto per questa forte diminuzione di prezzo. Non per i pochi sat che ho (davvero irrilevanti) ma perché il prezzo inevitabilmente rappresenta il valore (più o meno ben espresso) dell'universo Bitcoin.Non mi preoccupa il fatto che possano sparire dex che promettono rendimenti stellari, mi preoccupa però che possano sparire gli Atm, le carte, magari anche qualche cex. Sono questi che PER ME danno valore all'ecosistema, non chi paga per lo staking.Se il crollo di valore di Btc portasse a far sparire degli atm perché non più redditizi, ecco la cosa mi dispiacerebbe. Non uso certo gli atm regolarmente (anzi!) però mi piace il fatto che ci siano perché sono il più facile anello di collegamento tra Btc e fiat. Penso anche a chi non voglia o non possa aprire un account con un cex e abbia in un atm l'unica possibilità per acquistare Btc.Allo stesso modo è utile che ci siano le carte, che con una forte diminuzione di valore potrebbero anch'esse trovarsi in difficoltà.E così via.Quindi non mi preoccupa il calo di valore per quanto da me posseduto, mi preoccupa perché potrebbe allontanare alcuni attori da questo mercato.Sono peraltro convinto che sia un calo temporaneo, ciclico, come abbiamo già visto molte altre volte. Per questo non mi piace parlare di cripto winter: sappiamo che funziona così e quindi è inutile allarmarsi. Come già fatto altre volte: stiamo alla finestra e guardiamo gli eventi accadere, torneranno di sicuro momenti più rosei.Bello comunque  @gbianchi leggere post di questo tipo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "June 20, 2022, 12:29:16 AM",
      "body": "Quote from: Plutosky on June 19, 2022, 03:10:44 PMSe una tecnologia muore è solo perchè non serve o perchè esiste una tecnologia migliore.Bitcoin è inutile? Esiste una tecnologia migliore?Sono parzialmente d'accordo. Dico parzialmente perché come per qualsiasi cosa, non importa quanto possa essere utile, se non ci sono gli utilizzatori (o sono comunque pochissimi) alla lunga è difficile che riesca a mantenersi. Per questo per quanto siano belli i discorsi del \"1 BTC è sempre uguale a 1 BTC\", se dovesse tornare a $50 per qualcuno di voi vedo che non è un problema, per tutto il movimento invece direi di sì perché possiamo scordarci l'adozione di massa per i prossimi 30 anni a quel punto.E poi, tornando ancora una volta al discorso del valore, io non so voi quando abbiate preso i bitcoin, se li avete presi nel 2010 buon per voi, io no, quindi se dovesse tornare a $50 sapete quanto potrebbe importarmi il concetto di privacy, di essere la propria banca, etc etc se una cosa che ho comprato ad esempio a $2k ora ne vale $50? A quel punto pure uno con 100 BTC, che al giorno d'oggi sarebbe una piccola balena, avrebbe $5k in tasca. Cosa ci fai?A volte vedo troppi discorsi da mondo delle favole, se per voi un BTC a $50 andrebbe bene sono contento per voi, ma a quel punto dubito avrà lunga vita, la maggior parte della comunità probabilmente mollerebbe perché dopo essere arrivati a $70k e ripartire da $50 non avrebbe senso.Ovviamente questo è solamente il mio pensiero, e probabilmente sbaglio alla grande, ma cerco solamente di essere realista.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 20, 2022, 05:45:43 AM",
      "body": "Quote from: Ale88 on June 20, 2022, 12:29:16 AMA volte vedo troppi discorsi da mondo delle favole, se per voi un BTC a $50 andrebbe bene sono contento per voi, ma a quel punto dubito avrà lunga vita, la maggior parte della comunità probabilmente mollerebbe perché dopo essere arrivati a $70k e ripartire da $50 non avrebbe senso.Credo ci sia un prezzo sotto il quale l’esperimento bitcoin potrebbe rivelarsi fallito, e credo che 50 USD sia ben sotto questo prezzo. Intendo che se qualcosa deve rinascere da un bitcoin sotto 50 USD potrebbe essere qualcosa di diverso. Non chiedetemi come, non chiedetemi cosa. Ma non potrebbe essere identico. Proprio per il discorso di zoom out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m.lov",
      "created_time": "June 20, 2022, 10:17:28 AM",
      "body": "Quote from: fillippone on June 20, 2022, 05:45:43 AMCredo ci sia un prezzo sotto il quale l’esperimento bitcoin potrebbe rivelarsi fallito, e credo che 50 USD sia ben sotto questo prezzo. Intendo che se qualcosa deve rinascere da un bitcoin sotto 50 USD potrebbe essere qualcosa di diverso. Non chiedetemi come, non chiedetemi cosa. Ma non potrebbe essere identico. Proprio per il discorso di zoom out.Secondo me indicare un controvalore in $ al di sotto del quale il progetto BTC venga considerato fallito, equivale a credere che il progetto BTC non ha valore. Cosa sono 50$, 1000$, 50.000$ in un sistema dove i $ possono essere stampati a piacimento? 50.000$ equivalgono a 50$, basta che se ne stampi la giusta quantità. BTC non può essere valutato in $, può solamente essere valutato in energia \"condensata\" nell'hash power. Il valore di BTC è rappresentato dall'immutabilità del suo protocollo, dal codice e dalla matematica che c'è alle sue spalle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 20, 2022, 10:27:00 AM",
      "body": "Quote from: m.lov on June 20, 2022, 10:17:28 AMQuote from: fillippone on June 20, 2022, 05:45:43 AMCredo ci sia un prezzo sotto il quale l’esperimento bitcoin potrebbe rivelarsi fallito, e credo che 50 USD sia ben sotto questo prezzo. Intendo che se qualcosa deve rinascere da un bitcoin sotto 50 USD potrebbe essere qualcosa di diverso. Non chiedetemi come, non chiedetemi cosa. Ma non potrebbe essere identico. Proprio per il discorso di zoom out.Secondo me indicare un controvalore in $ al di sotto del quale il progetto BTC venga considerato fallito, equivale a credere che il progetto BTC non ha valore. Cosa sono 50$, 1000$, 50.000$ in un sistema dove i $ possono essere stampati a piacimento? 50.000$ equivalgono a 50$, basta che se ne stampi la giusta quantità. BTC non può essere valutato in $, può solamente essere valutato in energia \"condensata\" nell'hash power. Il valore di BTC è rappresentato dall'immutabilità del suo protocollo, dal codice e dalla matematica che c'è alle sue spalle. Accolgo la critica all’ancorare il “valore” di bitcoin ad una grandezza nominale, magari in debasement rispetto al potere di acquisto reale. Anche se vedo più questo rischio analizzando apprezzamenti di bitcoin (svalutazioni del dollaro) che viceversa.Riguardo al prezzo di “fallimento” di bitcoin, purtroppo rimango della mia idea.  Tra l’altro se andasse davvero a 10$ (o se vuoi, l’equivalente in termini di potere di acquisto reale di 10 dollari) immagino l’hash rate potrebbe non essere in grado di garantire l’immutabilità della blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gbianchi",
      "created_time": "June 20, 2022, 10:57:36 AM",
      "body": "Quote from: fillippone on June 20, 2022, 10:27:00 AMAccolgo la critica all’ancorare il “valore” di bitcoin ad una grandezza nominale, magari in debasement rispetto al potere di acquisto reale. Anche se vedo più questo rischio analizzando apprezzamenti di bitcoin (svalutazioni del dollaro) che viceversa.Riguardo al prezzo di “fallimento” di bitcoin, purtroppo rimango della mia idea.  Tra l’altro se andasse davvero a 10$ (o se vuoi, l’equivalente in termini di potere di acquisto reale di 10 dollari) immagino l’hash rate potrebbe non essere in grado di garantire l’immutabilità della blockchain.Quote from: gbianchi on June 19, 2022, 02:42:39 PMSe il prezzo di BTC, ossia il rapporto tra BTC ed USD, ossia il rapporto tra una cosa di valore una una roba che non vale quasi nulla, si abbassa troppo.... non vuol dire che BTC vale di meno, vuol semplicemente dire dire che il concetto espresso da quel rapporto non rappresenta nulla di significativo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "June 20, 2022, 11:22:20 AM",
      "body": "e' lo stesso motivo per cui a me non mi interessa niente del prezzoquei pochi satoshi che possiedo (frutto delle firme) le tengo per dimostrare che credo nel progetto, e nn mi interessano se vanno a 1$, non perdo nientese bitcoin va a 1 milione, non guadagno niente.. il nulla sideralela cosa che mi interessa e' la possibilita che da bitcoin di poter fare da sespiego meglio, perche altrimenti non si comprende la mia filosofiafacciamo una premessa, io vengo dall'ambiente opensource, lo zoccolo duro che ha fatto battaglie, che ha fatto causa a microsoft in sede civile per l'obblico di avere il proprio OS (pagato) sulle macchinesono stati anni di divulgazione,lotta, sacrifici, sangue ma anche di belle bellissime soddisfazionioggi posso dire OPEN SOURCE e nessuno pensa che io sia un figlio dei fiori ma capisce che sono un ingengere informatico serioposso dire LINUX senza che Steve Ballmer dice che sia un cancroposso usare un OS compilato in casa mia dai sorgenti, senza che nessuno ci ficchi niente dentro di malevoloposso, se voglio per voi, magari non vi interessa, vi scoccia, non siete capaci.. qualsiasi motivo PLAUSIBILE E NON, potete non usarloma io.. se voglio POSSOe' questo concetto di liberta che mi interessaposso installarmi cosa voglio un OS che voglio e un browser che voglioqueste liberta che avete (ma magari non fruite)  provengono dai miei e dagli altrui sacrifici, a farsi un culo cosi con i LUG, a preparare i linux day, e fare formazione e divulgazioneci sta da fare sacrifici anche per bitcoin!? ci sono abituatoquale e' il mio scopo? diventare ricco? noil mio scopo e'vuoi gestirti i tuoi soldi da te, ADESSO PUOInon vuoi,puoi,tiscoccia, non sei capace *altra scusa plausibile e non* usa quello che vuoi, nessuno ti giudicama io, se voglio POSSO e questo mi interessa",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Neo_Coin",
      "created_time": "June 20, 2022, 12:35:23 PM",
      "body": "Quote from: babo on June 20, 2022, 11:22:20 AMe' lo stesso motivo per cui a me non mi interessa niente del prezzoquei pochi satoshi che possiedo (frutto delle firme) le tengo per dimostrare che credo nel progetto, e nn mi interessano se vanno a 1$, non perdo nientese bitcoin va a 1 milione, non guadagno niente.. il nulla sideralela cosa che mi interessa e' la possibilita che da bitcoin di poter fare da sespiego meglio, perche altrimenti non si comprende la mia filosofiafacciamo una premessa, io vengo dall'ambiente opensource, lo zoccolo duro che ha fatto battaglie, che ha fatto causa a microsoft in sede civile per l'obblico di avere il proprio OS (pagato) sulle macchinesono stati anni di divulgazione,lotta, sacrifici, sangue ma anche di belle bellissime soddisfazionioggi posso dire OPEN SOURCE e nessuno pensa che io sia un figlio dei fiori ma capisce che sono un ingengere informatico serioposso dire LINUX senza che Steve Ballmer dice che sia un cancroposso usare un OS compilato in casa mia dai sorgenti, senza che nessuno ci ficchi niente dentro di malevoloposso, se voglio per voi, magari non vi interessa, vi scoccia, non siete capaci.. qualsiasi motivo PLAUSIBILE E NON, potete non usarloma io.. se voglio POSSOe' questo concetto di liberta che mi interessaposso installarmi cosa voglio un OS che voglio e un browser che voglioqueste liberta che avete (ma magari non fruite)  provengono dai miei e dagli altrui sacrifici, a farsi un culo cosi con i LUG, a preparare i linux day, e fare formazione e divulgazioneci sta da fare sacrifici anche per bitcoin!? ci sono abituatoquale e' il mio scopo? diventare ricco? noil mio scopo e'vuoi gestirti i tuoi soldi da te, ADESSO PUOInon vuoi,puoi,tiscoccia, non sei capace *altra scusa plausibile e non* usa quello che vuoi, nessuno ti giudicama io, se voglio POSSO e questo mi interessaVuoi essere la banca di te stesso. Essere veramente padrone dei tuoi soldi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "June 20, 2022, 04:53:24 PM",
      "body": "Quote from: Ale88 on June 20, 2022, 12:29:16 AMQuote from: Plutosky on June 19, 2022, 03:10:44 PMSe una tecnologia muore è solo perchè non serve o perchè esiste una tecnologia migliore.Bitcoin è inutile? Esiste una tecnologia migliore?Sono parzialmente d'accordo. Dico parzialmente perché come per qualsiasi cosa, non importa quanto possa essere utile, se non ci sono gli utilizzatori (o sono comunque pochissimi) alla lunga è difficile che riesca a mantenersi. Per questo per quanto siano belli i discorsi del \"1 BTC è sempre uguale a 1 BTC\", se dovesse tornare a $50 per qualcuno di voi vedo che non è un problema, per tutto il movimento invece direi di sì perché possiamo scordarci l'adozione di massa per i prossimi 30 anni a quel punto.E poi, tornando ancora una volta al discorso del valore, io non so voi quando abbiate preso i bitcoin, se li avete presi nel 2010 buon per voi, io no, quindi se dovesse tornare a $50 sapete quanto potrebbe importarmi il concetto di privacy, di essere la propria banca, etc etc se una cosa che ho comprato ad esempio a $2k ora ne vale $50? A quel punto pure uno con 100 BTC, che al giorno d'oggi sarebbe una piccola balena, avrebbe $5k in tasca. Cosa ci fai?A volte vedo troppi discorsi da mondo delle favole, se per voi un BTC a $50 andrebbe bene sono contento per voi, ma a quel punto dubito avrà lunga vita, la maggior parte della comunità probabilmente mollerebbe perché dopo essere arrivati a $70k e ripartire da $50 non avrebbe senso.Ovviamente questo è solamente il mio pensiero, e probabilmente sbaglio alla grande, ma cerco solamente di essere realista.Se una cosa è utile è implicito che ci siano gli utilizzatori. Nessuna favola, credo di fare un ragionamento molto pragmatico. Prima parlavo del \"come\": esistono due prezzi di bitcoin, non uno.Il primo è quello reale, quello che dipende, come tutte le cose, da domanda e offerta. Se io ho bisogno di bitcoin perchè mi serve, visto che i bitcoin non sono infiniti e non sono gratis, dovrò pagare qualcuno per procurarmeli. Con l'offerta bloccata, più persone hanno bisogno di bitcoin, più il prezzo sale. Semplice semplice.Il problema è che questo prezzo NON ha un mercato ufficiale e NESSUNO lo conosce. E' un prezzo che ha molto a che vedere con il concetto di valore.Il secondo prezzo è quello speculativo, che tutti conoscono perchè basta collegarsi ad un exchange. Questo prezzo NON dipende da domanda e offerta, se non in minima parte.  Dipende molto di più da liquidazioni, margin call, Terra, Luna e Celsius obbligate a vendere, manipolazione, truffe, vendite allo scoperto, panico dei mercati, hype...etc...etcMentre il primo prezzo, nelle condizioni attuali di diffusione, uso e domanda di bitcoin,  è impossibile che vada a 50$, sul secondo non ne sarei così sicuro.Non mi sento di escluderlo.Il bello è che questi due prezzi possono differire, anche di tanto, ma non a lungo. Diciamo che in media, ogni quattro anni almeno, si riallineano.Questo è il motivo per cui, all'interno di una volatilità enorme, il prezzo di bitcoin nel lungo periodo (cicli quadriennali) è sempre cresciuto.Se bitcoin fosse regolato dal secondo prezzo e basta, sarebbe andato da 0 a 68.000 e poi tornato a 0. Come molte shitcoin.In presenza di fondamentali solidi non mi preoccupa il numerino che vedo quando vado su un exchange. A Marzo 2020 siamo scesi del 60% in meno di una settimana e tornati al punto di partenza in un mese e mezzo. Segno che 4k NON era un prezzo reale. Come, a parti invertite, 68k a novembre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "June 24, 2022, 08:01:46 AM",
      "body": "non esistono due prezzi di bitcoin, almeno secondo me... ma e' il classico valore/prezzoposso portare l'esempio del gronchi rosa, che calza sempre a pennelloil prezzo del gronchi rosa e' circa 3-4 mila euro... tantoil valore e' 5 centesimi (il prezzo della carta)come mai questa differenza? per un collezionista e' un pezzo raro ed e' disposto a pagare anche 4k per una cosa che ne vale 5 centesimiio sono disposto a pagare 4k? no, perche a me non interessa la filatelia.. in passato ero mezzo filatelico ma non avrei mai speso tutti sti soldi per un pezzettino di carta, una collezione e' qualcosa che ti fa star bene con te stesso, se hai soldi da buttarci e ti va ok altrimenti si fa una collezione basic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 30, 2022, 10:27:40 PM",
      "body": "Quote from: babo on June 24, 2022, 08:01:46 AMnon esistono due prezzi di bitcoin, almeno secondo me... ma e' il classico valore/prezzoposso portare l'esempio del gronchi rosa, che calza sempre a pennelloil prezzo del gronchi rosa e' circa 3-4 mila euro... tantoil valore e' 5 centesimi (il prezzo della carta)come mai questa differenza? per un collezionista e' un pezzo raro ed e' disposto a pagare anche 4k per una cosa che ne vale 5 centesimiio sono disposto a pagare 4k? no, perche a me non interessa la filatelia.. in passato ero mezzo filatelico ma non avrei mai speso tutti sti soldi per un pezzettino di carta, una collezione e' qualcosa che ti fa star bene con te stesso, se hai soldi da buttarci e ti va ok altrimenti si fa una collezione basicUna persona diceva: QuoteNon tutto ha valore, ma tutto ha un prezzo.Sono molto d'accordo con questa frase, e la differenza prezzo/valore mi è molto chiara, tutavia ho molto rispetto per i prezzi.Il prezzo è la determinazione che il mercato dà del valore di qualcosa. Se il prezzo è molto diverso al valore che attibuisco a qualcosa, mi chiedo se sia io a sbagliare a valorizare quella cosa. Soprattuto se il mercato è liquido, ovvero se il prezzo è formato veramente dalle forzi concorrenti di domanda ed offerta, e non solo una delle due forze (Esempio tipoco: prezzo di una casa, dove è solo l'offerta a fare il prezzo, non la domanda, per lo meno in Italia).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gbianchi",
      "created_time": "June 30, 2022, 11:12:36 PMLast edit: June 30, 2022, 11:28:21 PM by gbianchi",
      "body": "Quote from: fillippone on June 30, 2022, 10:27:40 PMIl prezzo è la determinazione che il mercato dà del valore di qualcosa. Proprio in questa frase sta \"l'errore\" o meglio la sottovalutazione dell'analisi economica.E' vero, il mercato forma il prezzo... e lo forma con l'incrocio della domanda e dell'offertatutto cio' e' piu' o meno vero.e qui c'e' un'enorme MAcos'e' il mercato?Il mercato non e' nient'altro che un insieme di persone.Non e' fatto ne' dai sassi, ne' dalle formiche, ne' dagli angeli,  ne' dagli alieni, ma dalle persone.E le persone si muovono in base a tante pulsioni: paure, avidita', desideri, speranze.Quel che l'analisi economica non ci dice e' come si forma la domanda e l'offerta...Avete mai riflettuto come una bene puo' essere richiesto?Il pane e' richesto perche' e' un prodotto d base della nostra alimentazione, e anche l'acqua.Ma andiamo un po' piu' in su... la famosa Coca Cola tanto cara ad alcuni... non e' indispensabile, ma ha un gusto ruffiano, ed inoltre viene pubblicizzata da anni. Quasi sicuramente fa male, ma ugualmente miliardi di persone la bevono, i \"mercato\" (le persone) la bevono.Saliamo un po' Le sigarette danno certamente il cancro. Ma per decenni sono state pubblicizzate in ogni modo a maniera comeprodotto per darsi  \"un tono\" e cosi' esistono ancora miliardi di fumatori, anche tra persone di una notevole intelligenza.Sanno che corrono un rischio altissimo di beccarsi un cancro ai polmoni, ma le fumano... formano il \"Mercato\" delle sigarette!E saliamo ancora.Un quadro di arte moderna. Un ristretto gruppo di persone dice che e' arte, e quindi vale milioni o centinaia di milioni.Non seve a niente, non ha nessuna utilita', a volte e' anche veramente orribile,  ma il solo fatto che la lobby dell'arte lo riconosca come opera d'arte gli crea una domanda.E si puo' salire all'infinito.Tutto cio' per dire che esistono vari dipi di \"domanda\": da un domanda di beni indispensabili che servono per la sopravvivenza,su su fino a una domanda sempre piu' artificiale, creata da tutte altre pulsioni e meccanismi... che puo' essere persino dannosa,ma che sempre si basa su meccanismi psicologici: \"i critici dicono che quella cosa e' un'opera d'arte, tutti lo considerano tale, e io che sono miliardariome la compro e dimostro la mia esistenza e potenza\"\"So che la coca cola potrebbe farmi male, ma come e' buona... e che bella quella figa che pubblicizzava ieri sera!\"\"SOno certo che le sigarette danno cancro... ma le fumo lo stesso, fin da ragazzino faceva fico fumarle... e ormai ci sono abituato!\"i computer apple tecnicamente fanno cagare, ma sono fighi, le auto elettriche dal punto di vista della fisica sono una cazzata, mati fanno passare per uno che si interessa di ambiante e anche alquanto figo, bevi la coca cola che ti fa bene....E' importantissimo capire che \"IL MERCATO\" non esiste come entita' astratta, ma e' fatto di persone,e pertanto facilmente manipolabile, come sono facilmente manipolabili le persone.Il mercato sono le persone, con i loro bisogni in gran parte indotti.E di conseguenza le leggi della domanda e dell'offerta sono si vere, ma bisognerebbe analizzare da cosa sono generate domanda ed offerta.Lo vediamo benen nelle crypto: bitcoin e' sempre bitcoin,e io mi diletto a fare dei grafici di analisi on-chainche fanno vedere in modo eclatante che le dinamiche interne di bitcoin sono alquanto stabili e consolidate.Eppure il prezzo ha degli svarioni da 70/80%. Come si spiega?SI spiega semplicemente col fatto che questo \"DOGMA\" che e' il mercato e' molto meno dogma di quel che sembra...ancora una volta, il mercato e' fatto da persone, e le persone si muovono spesso a caso, influenzate dal sentito dire, dal me l'ha detto un amico,sopratutto in materie complesse come le crypto  che pochissimi sono davvero in grado di comprendere.Smettiamo di dare questo grande valore alla parola mercato, e di considerarlo il dogma e regista occulto di tutto.Non e' il mercato (le persone) a controllare tutto, anzi le persone non controllano un bel cazzo di niente.E' chi e' in grado di influenzare le persone che ha il potere di crare domanda e/o offerta, a volte anche dal nulla, a volte anche per prodotti letteralmente mortali, e decidere come si muove \"il mercato\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arulbero",
      "created_time": "July 01, 2022, 11:03:13 AM",
      "body": "Quote from: gbianchi on June 19, 2022, 08:59:00 AM...E mi rendo anche conto che in questa catena di speranze e' impossibile che vada tutto per il verso giusto.E sopratutto mi chiedo: perche' ho questa catena di speranze, che con la natura di bitcoin fondamentalmente non c'entra nulla,visto che l'unica certezza che ho e' che qualsiasi cosa succeda NESSUNO PUO' PORTARMI VIA I MIEI BITCOIN ?La risposta onesta e' che ho tutte queste speranze perche' non mi aggrada che prezzo di bitcoin (ossia il rapporto BTC/USD) crolli.E qui sta finalmente la vera spietata conclusione di tutto questo ragionamento:....Se per ripulirsi da questa circo il prezzo di Bitcoin deve scivolare a 1000$, o a 100$ o a 10$ mi sta bene, non ho nessuna intenzione di farmi ricattareda queste dinamiche, le stesse dinamiche del mondo fiat che sta andando rapidamente al collasso. Eventualmente sara' un'occasioneper aumentare le mie preziose riserve di BTC.Che si fottano tutti: io ho una certezza assoluta: Ho i miei bitcoin e nessuno me li puo' portare via,se io non sono cosi' stupido da farmeli portare via, e tutto il resto puo' tranquillamente andare al diavolo.Il prezzo di bitcoin (o se vogliamo il suo potere d'acquisto) è un elemento tutt'altro che secondario. Chi ha un certo potere d'acquisto compra bitcoin confidando perlomeno di congelare questo potere d'acquisto: se ciò non avviene (come tra l'altro già succede per le monete fiat con l'inflazione) si rimane solo \"liberi\" di detenere btc e di scambiarli con qualcosa di pochissimo valore;se ad esempio il prezzo da pagare per questa libertà fosse perdere il 99% del proprio potere d'acquisto, il gioco a mio avviso non varrebbe la candela.Di fatto è vero che con bitcoin non ci si deve fidare di qualcuno in particolare, ma non è vero che non ci si deve fidare di nessuno: ci si deve fidare della maggioranza degli utilizzatori: che valore daranno essi a 1 bitcoin tra 1 mese o 1 anno? Che beni saranno disposti a scambiare per 1 bitcoin? C'è una grande ambiguità nel concetto di \"trustless\": chi è contrario a bitcoin si fida più delle banche centrali e degli stati piuttosto che del 'libero mercato' che fa il prezzo, chi invece sostiene bitcoin fa esattamente il contrario; ma appunto si fida della collettività, della comunità di utilizzatori nel suo complesso, non è vero che non si fida di nessuno. Il processo di costruzione di fiducia in una moneta decentralizzata non è per nulla scontato e non si può ridurre al codice o alla matematica che sta alla base del protocollo. Bitcoin non deve funzionare solo sulla carta, ma deve convincere nei fatti le persone. Esso funzionerà appieno se e solo se guadagnerà la fiducia delle persone.Il che implica che le oscillazioni di prezzo non possono essere qualsiasi; potranno essere probabilmente maggiori nel breve tempo rispetto a certe monete fiat, ma sempre con dei limiti.Come una persona deve avere ogni tanto dei dubbi ma se vuole andare avanti deve consolidare un po' di fiducia in se stesso, così la comunità di utilizzatori di bitcoin non può esprimere cambiamenti di opinioni riflesse in variazioni di prezzo che riportino le quotazioni indietro al 2012.Io pertanto non concordo con espressioni del tipo \"1 btc è sempre 1 btc\", oppure \"nessuno può rubare i miei btc\", perchè la realtà dice che se non ci sarà una evoluzione di un certo tipo con vari livelli di consolidamento di fiducia (e di prezzo)  queste frasi risulteranno vere solo formalmente (tipo l'operazione è perfettamente riuscita ma il paziente è morto) ma non nella sostanza.Riassumendo è una vana speranza attaccarsi alla solidità dell'impianto teorico di bitcoin sperando che la componente umana sia stata eliminata dall'equazione con un po' di teoria dei giochi: nessuno può preservare del potere d'acquisto nel tempo a prescindere dalla comunità di utilizzatori attorno a lui e a prescindere dallo sviluppo della rete.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "July 01, 2022, 11:41:17 AM",
      "body": "Quote from: arulbero on July 01, 2022, 11:03:13 AMRiassumendo è una vana speranza attaccarsi alla solidità dell'impianto teorico di bitcoin sperando che la componente umana sia stata eliminata dall'equazione con un po' di teoria dei giochi: nessuno può preservare del potere d'acquisto nel tempo a prescindere dalla comunità di utilizzatori attorno a lui e a prescindere dallo sviluppo della rete.Questo è verissimo, ma è proprio la componente umana quella che mi fa avere fiducia in una crescita nel suo complesso.Quanti erano gli utilizzatori stabili e reali (non gli speculatori) 4-5-6-7 anni fa e quanti sono oggi?Quanto era maturo l' \"ecosistema\" bitcoin anni fa e quanto oggi.Non bisogna certo guardare eventi quali Terra o Celsius nei quali bitcoin è più vittima che carnefice.Sarebbe come accusare il dollaro di quello che ha fatto Madoff.E in ogni caso la volatilità è in calo, come dimostra che, almeno finora, non abbiamo raggiunto le percentuali di crolli precedenti e nemmeno quelle di aumenti precedenti (il 2021 è stato un anno straordinario  ma percentualmente il boom è stato inferiore ai bull market precedenti).Se limitiamo il discorso al tradoff volatilità-libertà non credo che bitcoin abbia molti punti di forza e non ne avrà per tanto dato che, secondo me, sarà ancora estremamente volatile per molti anni.Il punto resta sempre quello di capire di che volatilità parliamo. Per estremizzare con una battuta: anche il bolivar è volatile ma è un pò diversa dalla volatilità di bitcoin  Al di là della direzione, sono diverse le cause che determinano le oscillazioni. E' evidente, ad es, che se Terra viene liquidata per centinaia di migliaia di b. e il prezzo crolla, questo non ha nulla a che vedere con domanda e offerta e quindi con il prezzo di lungo periodo. E' un evento estemporaneo, occasionale, limitato indipendentemente dal calo che provoca. Destinato a ricomporsi. Esattamente come, in senso opposto, un acquisto di Tesla fatto una volta, non si sa bene perchè, scordandosi poi anche che b. esiste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}