{
  "id": "topic_5458782",
  "title": "Skot",
  "author": "Skot",
  "created_time": "July 06, 2023, 12:19:15 AM",
  "content": "I am very excited to announce the first release of ESP-Miner! https://github.com/skot/ESP-Miner/releases/tag/v1.0 This is fully open source bitcoin mining firmware for the ESP32 on the (also open source) Bitaxe ASIC bitcoin miner. https://github.com/skot/bitaxe",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458782",
  "comments": [
    {
      "author": "unicornmangle",
      "created_time": "July 10, 2023, 12:13:35 AM",
      "body": "Nicejob skot im surprised nobody has posted on this. projects like this are what would make blockchain a lot more fun im not sure why someone hasnt made something like this prior. i have been following along with your progress i dont plan to build but i admire the work involved. it is truly amazing the work of giants in tech field you certainly are one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skot",
      "created_time": "July 10, 2023, 06:08:58 PM",
      "body": "Quote from: unicornmangle on July 10, 2023, 12:13:35 AMNice job skot im surprised nobody has posted on this. projects like this are what would make blockchain a lot more fun im not sure why someone hasnt made something like this prior. i have been following along with your progress i dont plan to build but i admire the work involved. it is truly amazing the work of giants in tech field you certainly are one of them.Thanks unicornmangle! Tell your friends; we're always excited to have more users and contributors. Let's keep Bitcoin mining open source!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "August 23, 2023, 12:34:28 AM",
      "body": "Wow Skot, i am impressed by the wonderful work done, it show that you are a true believer and a contributor to Bitcoin network thank for the info and the effort you put in.I think I would personally do some advertising on this open source miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skot",
      "created_time": "August 23, 2023, 03:45:19 PM",
      "body": "Quote from: Makus on August 23, 2023, 12:34:28 AMWow Skot, i am impressed by the wonderful work done, it show that you are a true believer and a contributor to Bitcoin network thank for the info and the effort you put in.I think I would personally do some advertising on this open source miner.Thanks Makus! That’s awesome to hear. I’m only a minority contributor to esp-miner, there are several talented folks working on this..In related news, we have just merged initial BM1366 (S19XP) support into master! Web configuration dashboard is in the works too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 10, 2023, 09:59:15 PM",
      "body": "Thank you for your work, and thanks to the other contributors in the amazing BTC community that made this:We can now take a look at the 4139 Nerdminers and 18 Bitaxes connected to this solo pool: https://web.public-pool.io/I have a feeling that open-source miners are going to end up being a big deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "September 11, 2023, 07:42:42 AM",
      "body": "Quote from: Drawesome on September 10, 2023, 09:59:15 PMThank you for your work, and thanks to the other contributors in the amazing BTC community that made this:https://www.talkimg.com/images/2023/09/10/mW0AI.jpegWe can now take a look at the 4139 Nerdminers and 18 Bitaxes connected to this solo pool: https://web.public-pool.io/I have a feeling that open-source miners are going to end up being a big deal.Not sure why you are trying to promote tiny garbage CPU/GPU miners that will never find a block.4139 miners wasting electricity seems like a really bad idea ...Seems you're the type to try fool people into buying stuff that will never give a return and waste electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skot",
      "created_time": "September 11, 2023, 01:48:50 PM",
      "body": "Quote from: kano on September 11, 2023, 07:42:42 AMNot sure why you are trying to promote tiny garbage CPU/GPU miners that will never find a block.4139 miners wasting electricity seems like a really bad idea ...Seems you're the type to try fool people into buying stuff that will never give a return and waste electricity.I'll bet 4097 of those miners (99%) are fully aware of their odds of finding a block. Yet they do it anyways. Don't forget; there is a lot more people can contribute to Bitcoin and mining than massive hashrate.https://xkcd.com/519/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "September 11, 2023, 11:27:12 PM",
      "body": "Quote from: Skot on September 11, 2023, 01:48:50 PMQuote from: kano on September 11, 2023, 07:42:42 AMNot sure why you are trying to promote tiny garbage CPU/GPU miners that will never find a block.4139 miners wasting electricity seems like a really bad idea ...Seems you're the type to try fool people into buying stuff that will never give a return and waste electricity.I'll bet 4097 of those miners (99%) are fully aware of their odds of finding a block. Yet they do it anyways. Don't forget; there is a lot more people can contribute to Bitcoin and mining than massive hashrate.https://xkcd.com/519/OK I'll give the more accurate and less liked answer then ...Those 4139 will never get a reward.It's as simple as that.Firstly the BTC reason:==============PPS:If the pool was paying PPS then the 209MH/s divided by 4139 miners = 50kH/s eachAt the current difficulty, 100% PPS will pay 0.002321815301 BTC a day per 1 PH/s1 PH/s = 10^15 H/s50kH/s = 50 x 10^3 H/sso 50KH/s = 0.002321815301 x 50 x 10^3 / 10^15 BTC a day = 1.16 x 10^-5 sats a dayNow doing a way over estimate assuming that diff will never change (which is wrong) that means at PPS it would take 86139 days to earn 1 satoshiOf course it will take way longer than this, earning even less, but anyway, ZERO return.PPLNS:Lets pretend they will find a block on the pool and share the 6.25 reward and not do a runner with it ...Each of those guys is doing 50kH/s on a pool that is currently showing around 110TH/sLets say it never gets larger than 110TH/s, which would make this calculation worse = reward less satoshis per block for the 50kH/s minersSo of the reward they'd get (6.25 * 10 ^ 8 ) x (50 * 10 ^ 50) / (110 * 10 ^ 12) satsSo what's this number?  0.284 sats per block you find.So with that 110TH/s pool you wanna hope you'll find 4 blocks before they'd even get 1 sat reward ... ... ... ...And if the pool gets above 110TH/s then they will get even less reward per block ...Solo:50kH/s wont find a block - so not relevantReality=======Now the actual reality of what's going on here is one of:1) They've been misled to think that they will get a reward, which clearly they wont.or2) They're CPUs being used without the owners consent (this is way more likely)There's a number of ways to do this:a) Web site that uses the person's desktop to mine without their permissionb) An app that also simply mines while the person is using the app and the person doesn't knowc) virus that runs a miner on their computerI wonder which of 1, 2a, 2b, or 2c it is Or more likely, what the % of each of the 4 options they are Bitaxe promoting this sort of thing is certainly a reason why I'd never want to have anything to do with bitaxe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skot",
      "created_time": "September 12, 2023, 03:32:37 AM",
      "body": "Quote from: kano on September 11, 2023, 11:27:12 PMOK I'll give the more accurate and less liked answer then ...Those 4139 will never get a reward.It's as simple as that.Firstly the BTC reason:==============PPS:If the pool was paying PPS then the 209MH/s divided by 4139 miners = 50kH/s eachAt the current difficulty, 100% PPS will pay 0.002321815301 BTC a day per 1 PH/s1 PH/s = 10^15 H/s50kH/s = 50 x 10^3 H/sso 50KH/s = 0.002321815301 x 50 x 10^3 / 10^15 BTC a day = 1.16 x 10^-5 sats a dayNow doing a way over estimate assuming that diff will never change (which is wrong) that means at PPS it would take 86139 days to earn 1 satoshiOf course it will take way longer than this, earning even less, but anyway, ZERO return.PPLNS:Lets pretend they will find a block on the pool and share the 6.25 reward and not do a runner with it ...Each of those guys is doing 50kH/s on a pool that is currently showing around 110TH/sLets say it never gets larger than 110TH/s, which would make this calculation worse = reward less satoshis per block for the 50kH/s minersSo of the reward they'd get (6.25 * 10 ^ 8 ) x (50 * 10 ^ 50) / (110 * 10 ^ 12) satsSo what's this number?  0.284 sats per block you find.So with that 110TH/s pool you wanna hope you'll find 4 blocks before they'd even get 1 sat reward ... ... ... ...And if the pool gets above 110TH/s then they will get even less reward per block ...Solo:50kH/s wont find a block - so not relevantYes, that sounds about right for the Nerdminer. QuoteReality=======Now the actual reality of what's going on here is one of:1) They've been misled to think that they will get a reward, which clearly they wont.or2) They're CPUs being used without the owners consent (this is way more likely)There's a number of ways to do this:a) Web site that uses the person's desktop to mine without their permissionb) An app that also simply mines while the person is using the app and the person doesn't knowc) virus that runs a miner on their computerI wonder which of 1, 2a, 2b, or 2c it is Or more likely, what the % of each of the 4 options they are Bitaxe promoting this sort of thing is certainly a reason why I'd never want to have anything to do with bitaxe.I'm not sure which project you're talking about. Nerdminer and bitaxe are open source, so if you're concerned they are doing something fishy, check out the source code? (they also have nothing to do with the web or your desktop CPU)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 12, 2023, 04:33:10 AM",
      "body": "Quote from: kano on September 11, 2023, 11:27:12 PMBitaxe promoting this sort of thing is certainly a reason why I'd never want to have anything to do with bitaxe.hmm, the person who posted the pool status is a different person, Skot is Bitaxe, Drawesome is web.public-pool.io/, so ya, I think you got things mixed up.Also, as far as I know, NerdMiner is an opensource project that you can DIY on a cheap Microcontroller, It is not even Windows based so it can't act as \"CPU\" virus miner, but ya that's all I know, of course, I don't disagree that using something like ESP32 to mine BTC is just a waste of money, I hope anyone doing that is aware of that fact that they will most certainly not get any rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 12, 2023, 10:08:12 AMLast edit: September 12, 2023, 11:06:32 AM by Drawesome",
      "body": "Quote from: kano on September 11, 2023, 07:42:42 AMQuote from: Drawesome on September 10, 2023, 09:59:15 PMThank you for your work, and thanks to the other contributors in the amazing BTC community that made this:https://www.talkimg.com/images/2023/09/10/mW0AI.jpegWe can now take a look at the 4139 Nerdminers and 18 Bitaxes connected to this solo pool: https://web.public-pool.io/I have a feeling that open-source miners are going to end up being a big deal.Not sure why you are trying to promote tiny garbage CPU/GPU miners that will never find a block.4139 miners wasting electricity seems like a really bad idea ...Seems you're the type to try fool people into buying stuff that will never give a return and waste electricity.Wow, so much misinformation in just one post. Just to make it clear:1. I am not promoting CPU/GPU mining, but open hardware mining like nerdminer or bitaxe. I think it is more than obvious.2. I have nothing to do with the public-pool website, nor with nerdminers or bitaxes contributors (I have only flashed some Nerdminers and now I am excited to do the same with bitaxe). When I say \"we,\" I mean it because I am part of the community that is joining this phenomenon and I hope it grows a lot.3. Public-pool is, as its name indicates, a public pool and anyone who wants to can join using CPU or GPU, I don't think the pursue of the pool is to promote that kind of mining (completely absurd) but to give the opportunity to have a low share for tracking these open sourced devices. At no time have I read anyone talking about profitability, but education.Quote from: mikeywith on September 12, 2023, 04:33:10 AMQuote from: kano on September 11, 2023, 11:27:12 PMBitaxe promoting this sort of thing is certainly a reason why I'd never want to have anything to do with bitaxe.hmm, the person who posted the pool status is a different person, Skot is Bitaxe, Drawesome is web.public-pool.io/, so ya, I think you got things mixed up.Also, as far as I know, NerdMiner is an opensource project that you can DIY on a cheap Microcontroller, It is not even Windows based so it can't act as \"CPU\" virus miner, but ya that's all I know, of course, I don't disagree that using something like ESP32 to mine BTC is just a waste of money, I hope anyone doing that is aware of that fact that they will most certainly not get any rewards.I've got nothing to do with web.public-pool.io/, here is a thread:https://bitcointalk.org/index.php?topic=5463714.0It's an open sourced project and it's pretty clear that it's not promoting CPU/GPU mining, but Nerdminers and Bitaxes kind of projects",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "September 12, 2023, 11:11:33 AM",
      "body": "Nerdminer and Bitaxe, firstly, are two completely different things.Oddly enough, yes I do know this, considering the fact that I know more about miners and mining than anyone in this thread.Anyone trying to associate the two is only making Bitaxe look bad.Nerdminer is a waste of time, a waste of money, and the fact that they 'supposedly' have conned 4139 people into buying them is option 1) of my 4 options.But I'd doubt there are 4139 people that stupid, so I gave 3 other options.Yes you can say it's not 'CPU' mining if you want, but it is just using a microcontroller to mine, so essentially the same thing, but worse coz it's slower.Skot, in his post https://bitcointalk.org/index.php?topic=5458782.msg62829002#msg62829002 that I quoted and replied to,tries to make the Nerdminers look good.Thus my post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 12, 2023, 11:50:53 AM",
      "body": "Quote from: kano on September 12, 2023, 11:11:33 AM I know more about miners and mining than anyone in this thread.LOL, exactly the type of off-topic response when you know you said something wrong and get corrected by others.QuoteYes you can say it's not 'CPU' mining if you want, but it is just using a microcontroller to mine, so essentially the same thingNot it is not the same,  you said that this could be a virus running on people's computers without thier knowledge, I correct that part and said no, it is an opensource project which runs on an MCU which isn't made or sold by Nerminer team, so you got about a dozen wrong things in your post, it is clear you did not even google what nerdminer is before posting.QuoteSkot, in his post https://bitcointalk.org/index.php?topic=5458782.msg62829002#msg62829002 that I quoted and replied to,tries to make the Nerdminers look good.He was not trying to make them look good, he stated that people are probably aware of their low chances yet keep doing it anyway, where is the part where he tried to promote them or them look good? It is not there, you can't point it out, you are just making shit up to attack people for no good reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverDesert",
      "created_time": "September 12, 2023, 12:13:27 PMLast edit: September 12, 2023, 01:03:43 PM by SilverDesert",
      "body": "There is definitely some confusion going around here. I think it could be because of this article... https://cointelegraph.com/news/cheap-micro-bitcoin-miners-fight-btc-mining-concentration-inventors-argueThere is the Nerdminer, Bitaxe, and the Opensource website. All these projects are opensource. Let’s try to clear things out.What @kano is referring to, is the nerdminer which is BitMaker's project and hashes around 55.99 KH/s.  The nerdminer uses the ESP32 microcontroller chip which has WIFI and Bluetooth and has the ability to control the miner instead of a computer or a RPi and connect directly to the internet through WIFI. However, in the nerdminer instead of using the ESP32 to control the miner, it actually mines with the chip similar to a cpu.  I totally agree with Kano and his detailed mathematical analysis of the nerdminer. No one will ever find a block with a hashrate of 55.99 KH/s. Kano does not support CPU and GPU mining for obvious mathematical and financial reasons. Now Bitaxe on the other hand is a totally different project. Bitaxe is Skot and team's project and it uses the same ESP32 chip like the nerdminer but it controls the ASIC chip instead of mining with it like the nerdminer. The bitaxe is same as Gekkoscience's Compac F but opensource and uses a single BM1397 ASIC chip and hashes around 300-350 GH/s. To make things more confusing, there is the new bitaxeUltra which uses the S19XP ASIC chip which is the BM1366 and hashes about 527.2 GH/s. To make things further confusing, there is an upcoming bitaxeHexUltra which is in the works and is similar to the Gekkoscience R909 but opensource and have 6 BM1366 ASIC chips instead R909's 6 BM1397 ASIC chips. So, we are talking about ~ 3.1632 TH/s per miner.As for the website, Public Pool, it is an open source btc pool for mining and it states “Pleb mining (under 50TH/s miners) mine with NO FEESMiners with > 50TH/s will incur a 1.5% fee, a portion of which will go back into open source Bitcoin mining”. The pool accepts all miners to mine on it, like the Nerdminer, bitaxe, bitaxeUltra, etc.Take home message is that the Nerdminer and Bitaxe, are completely different opensource projects. They should not be clubbed together and cause confusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 12, 2023, 01:12:21 PM",
      "body": "Quote from: kano on September 12, 2023, 11:11:33 AMNerdminer and Bitaxe, firstly, are two completely different things.Anyone trying to associate the two is only making Bitaxe look bad.Nerdminer is a waste of time, a waste of money, and the fact that they 'supposedly' have conned 4139 people into buying them is option 1) of my 4 options.But I'd doubt there are 4139 people that stupid, so I gave 3 other options.I agree that it doesn't make sense to scale something like nerdminer as a miner. There are some domains registered with the name \"nerdminer\" in it that has nothing to do with the dev where they sell nerdminers (in case that is what led you to post that). I see it as anecdotal (I don't see much future in the business of reselling a lilygo that you can flash yourself easily). The nerdminer community is quite clear that the intention of the nerdminers is to experiment and educate.What you probably don't understand is that this community that has connected those 5000 nerdminers is the same one that is already creating a demand for bitaxes. A nerdminer is not an ASIC that is good for nothing more than mining, so they will be able to recycle their ESP-32 for other projects. Nerdminer does not harm bitaxe, on the contrary, it reinforces it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skot",
      "created_time": "September 12, 2023, 02:13:38 PM",
      "body": "The bitaxe is an open source ASIC miner I started. It is what it is today because of the contributions from an awesome group of hackers who all started with \"waste of time and money\" mining projects. Say hi on the OSMU discord if you want to get involved.Public-pool, where that screenshot is from, is a project from a main bitaxe developer. It's also fully open source. check it out if you suspect foul play.I fully support (and promote) the Nerdminer, a separate project that is a microcontroller/CPU based miner. Nerdminer has the lowest barrier to entry to get started with miner development. Nobody is under the illusion you are going to earn any sats on a pool or have any real chance at a block solo mining with a Nerdminer -- we're not idiots, you know. The concepts are very applicable to the biggest miners out there. Come on over to the bitaxe when you're ready, and find out how deep this rabbit hole goes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 12, 2023, 11:41:48 PM",
      "body": "Quote from: SilverDesert on September 12, 2023, 12:13:27 PM I totally agree with Kano and his detailed mathematical analysis of the nerdminer. Any online calculator will tell you the same thing, it isn't rocket science, anyone with a few brain cells knows what are the chances of hitting a block with such hashrate, in fact, even with those GH range miners your chances are slim to nothing, even using the BM1366 chip we are talking about 1 in 760,000,000 chances per block, in other words, 15,000 years, that's indeed a lot less than the 130,000,000,000 years needed by 50KH miner, but arguably even the 0.5GH is a waste of time and money.Nerdminer is a concept that is good, the ability to control ASICs such as BM1397 is in the pipeline, you could argue that nobody no should be mining with 50KH miner which I have said myself dozen times, but you can't dismiss the whole project and accuse it of being a virus or accuse the devs behind of being cons who \"sell\" products that don't work, it's open source people do whatever the hell they want with it, if I manage to flash Cgminer to my 10$ calculator and use that to mine BTC -- it doesn't make Cgminer stupid.QuoteTake home message is that the Nerdminer and Bitaxe, are completely different opensource projects. They should not be clubbed together and cause confusion. Why not? both are open-source mining projects, slightly different concepts, and largely different hashrates \"at the moment\" but that doesn't mean they shouldn't be clubbed together.See I don't even advocate using industrial-grade miners at home, I think mining \"treated as a business\" needs to be done at an industrial level, a separate building/farm with dedicated industrial ASICs miners, anything short of that is either gambling, learning or a hobby, yes that makes no profit, you probably lose more than what you will ever earn, but doesn't make people who use it stupid, it also doesn't make people who make those projects scammers.I can bring forward a dozen people who know their chances of hitting a block are next to nothing yet they do it for fun, How many people can you bring forward to claim that they are certain of hitting the block with 50kh/s? It's naive to assume that everyone else is stupid, It's fine if you want to give advice here and there, but it's rude to assume that everyone else is ignorant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverDesert",
      "created_time": "September 13, 2023, 10:22:38 AM",
      "body": "@mikeywithThank you for your reply. All I wanted was to clear some confusion people had about the Nerdminer and the Bitaxe. But ended up being confused with someone else Thank you for your further mathematical analysis on the Nerdminer. Now having said that, somehow I have been accused of things I did not say...Quotebut you can't dismiss the whole project and accuse it of being a virus or accuse the devs behind of being cons who \"sell\" products that don't work, it's open source people do whatever the hell they want with it, if I manage to flash Cgminer to my 10$ calculator and use that to mine BTC -- it doesn't make Cgminer stupid. Please show me where I accused the project as being a virus or the devs being cons? All I said was thatQuote No one will ever find a block with a hashrate of 55.99 KH/s.  I agree with the idea that an ESP32 microcontroller can control a miner without requiring a computer, RPi or an FPGA is very innovative and great. On top of it having WIFI so you do not require ethernet is great.  I personally have a LILYGO T-Display-S3 ESP32-S3 on my desk with NerdminerV2 1.6.2 firmware on it. I use it to see the time and the price of BTC. Also as a 'bonus' it mines BTC at 55.66 KH/s. Will it ever find a block? No. Do I ever expect it to find a block? No.Now the idea of the ESP32 microcontroller has gone into Bitaxe which changes everything. But they are different projects. If they merge in the future then that would be even better. Incorporating the LILYGO T-Display-S3 in Bitaxe and loosing the ESP32-S3-WROOM would be nice.QuoteIt's naive to assume that everyone else is stupid, It's fine if you want to give advice here and there, but it's rude to assume that everyone else is ignorant.Again, please show me where I assumed everyone is stupid and ignorant? I also have 2 Bitaxes on my desk. I support the project and the devs for their great job in making it opensource and being so supportive. I sincerely wish them all the best.@mikeywith, I really do appreciate all the years you have spent helping and supporting people on this forum in two different languages! I sincerely wish you all the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 13, 2023, 02:15:18 PM",
      "body": "Quote from: SilverDesert on September 13, 2023, 10:22:38 AMSorry, i did not explain myself correctly, all the \"yous\" in my previos post do not reffer to you (SilverDesert) the online persona which i am replying to, it is a general statement for those who accuse Nerdminder of being a virus or think the team is scam.You can change the \"you\" to \"we\" and re-read the post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}