{
  "id": "topic_5405513",
  "title": "tread93",
  "author": "tread93",
  "created_time": "July 07, 2022, 02:03:12 PM",
  "content": "Everyone,More of a motivational post FYI. This is a call to action for all those who have been sitting by wasting time, including myself. There is a whole world out there to conquer! Bitcoin runs 24/7! There is no time to be wasted, no stone to leave unturned! When you do something do it with your whole being so that you are fulfilled with satisfaction and can see the success that is just beyond that next hurdle! I see too many people slipping and becoming mediocre, I myself feel that I have become less of a go getter and more of a cruiser. My drive before covid was cranked to 100% but it seems like this period of time has fostered a kind of comfort that can only come from working from home and not doing our best but slacking off. I will speak for myself, as I am not sure of all of your habits but I know that I can always be better! I have started going back into my office to make the changes necessary to improve my standings. Whatever you're looking to do put 1000% I have recently felt convicted of just living my life in a cruise control pattern. Its easy to do that as a Bitcoin HODLER, just sitting, waiting, and watching what happens while we're holding on for dear life. On the other side of this coin the type of resilience we have built up in response to FUD over the past few bear markets having been through all the ups and downs that Bitcoin brings, it also brings a perspective that nothing can really phase us. Am I right? I'm not sure if anyone else feels that way but I have got to say that if you can stomach all this bitcoin stuff, you can pretty much endure anything that comes your way. You want change? Make it happen for yourself because no one is going to do it for you, nobody will really truly help you to become your best version of yourself, that is on YOU. Its periods like this that great men are made. When the economy is shit, and politics are haywire, and when there is uncertainty fear and war. Men and Women who have GRIT, who can get down and dirty and put in the tough work and feel the sweat drip from their brow. These individuals are destined for greatness because you can't stop someone who never gives up!Today I was given a quote by a billionaire:  “Enthusiasm is one of the most powerful engines of success. When you do a thing, do it with all your might. Put your whole soul into it. Stamp it with your own personality. Be active, be energetic, be enthusiastic and faithful, and you will accomplish your object. Nothing great was ever achieved without enthusiasm.”Ralph Waldo Emerson\"This part where he talks about doing something with all of your might is biblical: Colossians 3:23. If you do something do it with your whole heart. I love this. It is so true and one of the key secrets to success IMO. That is all, I hope you all strive for greatness today and every day! Be enthusiastic and put your personality and add your own flare and pep to your step. GO AND GET YOUR COIN! This is what I plan to do!Sincerely,TREAD",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405513",
  "comments": [
    {
      "author": "Accardo",
      "created_time": "July 07, 2022, 03:21:16 PM",
      "body": "It's a nice idea to make decisions when others are confused about what to do or think about at the moment. Your thread will be feasible for building a business and scaling it to make more profits. In the case of cryptocurrency, sometimes, a calculated move is required, not like diving completely into the market. They are nice phrases on the thread that made me think that I'm no longer reading about cryptocurrency. I tried as much as I could to link them back to cryptocurrency it tallied at a point and I disagreed when you said we have to put all our mind into cryptocurrency. An interpretation of when you said we should do things with all our minds. I think in cryptocurrency when all your mind gets involved you may remain on the trading signals and prices all day long like a watchman. Unless a business is built under the cryptocurrency blockchain then I'll involve all my mind in it. They are other things under a man's control to take up a man's mind completely like humanity, women, kids, and survival methods than focusing completely on a single coin or currency which is not under your control. It's a nice thread OP. I'd said; it's a great one if it wasn't a cryptocurrency forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "July 07, 2022, 03:43:35 PM",
      "body": "These days, it can be so easy to be discouraged and just give up our hopes and dreams most especially in the crypto industry. Guys, the best thing to do is to maybe take some rest but never quit. We can't actually blame people why they feel it is time to abandon this industry and just concentrate somewhere and frankly this is what I am feeling right now. However, this is the best time to take a close look at where we are and our existing plans...should we continue on moving on or should we just surrender?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 07, 2022, 05:33:01 PM",
      "body": "Great inspirational or motivational message. Indecision is one of the greatest impediment to investment, hence Bitcoiners must ensure they are not mediocre but key players. But it is important to note that investing in Bitcoin needs a lot of planning. One must consider his income as well as his expenditure before investing. Most people in developing countries might not be able to buy or HODL their bitcoins because there income is not even enough to cover the cost of their basic needs. Although nobody currently know show low Bitcoin would fall, but I think it is a good time to invest in it because there are predictions that the price would definitely go higher than what it was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "proTECH77",
      "created_time": "July 07, 2022, 06:41:11 PM",
      "body": "Yes, this season is a good season for preparation against bright future because the price of coins is still low for people to buy and hold until the price go higher before they can sell. I don't think people will miss this opportunity because even the poor are struggle to make sure they are part of this moving train in the community. But don't invest all your capital in this bear market because nobody know when the price will go higher in the market, so spend wisely for you not to regret when the price continue falling till next year 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "July 07, 2022, 06:48:22 PM",
      "body": "No one should be flogged into buying any coin, to me it’s really not professional to do so, and many time when it backfires the person that bought the coin always blame crypto-currency and the person that advised him to go and get a coin in the first place, well there are ways you can go about post like this, first is always put a disclaimer this way everyone would no no responsibility for the future out come is on you and always advise the less experienced ones to always do their research especially at this time of the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "July 07, 2022, 07:10:47 PM",
      "body": "Don't worry if they are not motivated now that price is damn cheap they will be motivated when the price start to surge high and the latter is always the case with many investors. Watch and see Meanwhile those smart and long term goal investors need no motivational speech to do the needful. \"Be daring when others are fearful\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 07, 2022, 07:11:46 PM",
      "body": "Quote from: BIT-BENDER on July 07, 2022, 06:48:22 PMNo one should be flogged into buying any coin, to me it’s really not professional to do so, and many time when it backfires the person that bought the coin always blame crypto-currency and the person that advised him to go and get a coin in the first placeThis is a legitimate concern when talking with people about Bitcoin.  I have people I told to buy Bitcoin at $2 coming to me now and telling me they finally bought at $50,000 and wish they hadn't because it's a scam.  It's just the way human nature works unfortunately.  People want to buy the hype at the top and then they sell when they don't immediately make a ton of money, then they look for someone to blame for their losses.  This blame others attitude is something I've faced quite a bit as an early Bitcoin accepting vendor.  I still have people mad at me to this day because I sold them silver a decade ago for Bitcoin.  At the time I was praised for accepting BTC, but now I'm blamed as the reason these people didn't make a fortune...  Personal accountability is rare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 07, 2022, 09:07:54 PM",
      "body": "Quote from: tread93 on July 07, 2022, 02:03:12 PMMore of a motivational post FYI. This is a call to action for all those who have been sitting by wasting time, including myself. There is a whole world out there to conquer! Bitcoin runs 24/7! There is no time to be wasted, no stone to leave unturned! When you do something do it with your whole being so that you are fulfilled with satisfaction and can see the success that is just beyond that next hurdle! Each person's reality is different from each other, so we can't really compare ourselves, but it's an undeniable fact bitcoin is an opportunity for anyone to start earning and profiting, doesn't matter how much they have to invest and how skilled they are. Even a poor man without any pennies on his pocket can adopt bitcoin by doing micro online tasks to be rewarded with BTC and start holding his first satoshis, which will rise a lot in value futurely.Indeed, there is no time to be wasted, and every satoshis count. It's during the bearish seasons the preparation is made, so you can harvest the fruits on the next bullish season. And it must be kept in mind the tallest buildings start with a single brick, which have to be solid and placed with constance and persistence, one by one, by the builder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "July 12, 2022, 05:53:12 PM",
      "body": "Quote from: uneng on July 07, 2022, 09:07:54 PMQuote from: tread93 on July 07, 2022, 02:03:12 PMMore of a motivational post FYI. This is a call to action for all those who have been sitting by wasting time, including myself. There is a whole world out there to conquer! Bitcoin runs 24/7! There is no time to be wasted, no stone to leave unturned! When you do something do it with your whole being so that you are fulfilled with satisfaction and can see the success that is just beyond that next hurdle! Each person's reality is different from each other, so we can't really compare ourselves, but it's an undeniable fact bitcoin is an opportunity for anyone to start earning and profiting, doesn't matter how much they have to invest and how skilled they are. Even a poor man without any pennies on his pocket can adopt bitcoin by doing micro online tasks to be rewarded with BTC and start holding his first satoshis, which will rise a lot in value futurely.Indeed, there is no time to be wasted, and every satoshis count. It's during the bearish seasons the preparation is made, so you can harvest the fruits on the next bullish season. And it must be kept in mind the tallest buildings start with a single brick, which have to be solid and placed with constance and persistence, one by one, by the builder.Indeed, great comment here, love it. You really got the message that I was trying to bring about though this rant lol. Work hard so you can make more money and spend it on Bitcoin hahahha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}