{
  "id": "topic_5456680",
  "title": "borsaicin",
  "author": "borsaicin",
  "created_time": "June 17, 2023, 04:33:40 PMLast edit: March 04, 2024, 10:17:02 AM by borsaicin",
  "content": "Silinsin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456680",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "June 18, 2023, 06:59:53 PM",
      "body": "Bitmex'in şu an forumda resmi bir temsilcisi yok o yüzden buradaki herhangi bir kişinin size yardımcı olabileceğini zannetmiyorum. Forumda bitmex'ten parasını kurtaramamış insanlara ait bir kaç başlık var belki onlar bir yol bulduysa onlarla konuşarak kullandıkları yöntemi öğrenebilirsiniz.2020 yılında bitmexten 600BTC kurtarmayı deneyen kullanıcının başlığı:Bitmex Warning: Withdrawals suspended. Banned from Chat. 600 Bitcoins stuck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borsaicin",
      "created_time": "June 19, 2023, 04:05:41 PM",
      "body": "Teşekkür ederim hocam iletişime geçeceğim. Quote from: Bthd on June 18, 2023, 06:59:53 PMBitmex'in şu an forumda resmi bir temsilcisi yok o yüzden buradaki herhangi bir kişinin size yardımcı olabileceğini zannetmiyorum. Forumda bitmex'ten parasını kurtaramamış insanlara ait bir kaç başlık var belki onlar bir yol bulduysa onlarla konuşarak kullandıkları yöntemi öğrenebilirsiniz.2020 yılında bitmexten 600BTC kurtarmayı deneyen kullanıcının başlığı:Bitmex Warning: Withdrawals suspended. Banned from Chat. 600 Bitcoins stuck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emresuakar",
      "created_time": "June 22, 2023, 08:04:18 AM",
      "body": "Seni dolandırıcılıkla mı suçluyorlar? Kimseyi dolandırdın mı? Teşebbüs ettin mi? TR forumda Bitmex'in temsilcisi yok, global foruma yazarsan daha iyi olur. Benimde 0.7 BTC blokeli 20000 TL'ye maliyetlendiğim için üstüne pek düşmemiştim. Geçen sene ATH'de biraz araştırma yaptımda bunun tek yolu orada kapitalin olduğunu noterde kanıtlayacaksın, Adalet bakanlığı aracılığıyla noter kağıdını Başkonsolosluk aracılığıyla Seyşeller'e göndereceksin. Dolandırıcılıktan dolayı kara listeye alınmışsan kanıtları da varsa mahkemelik olursunuz elle tutulur bir dolandırıcılık yoksa hemen alırsın paranı, teşebbüs ettiysende pek sorun çıkmaz beklediğinle kalırsın.Geçen boğa sezonunda Hollanda'da yaşayan bir fenomen abimiz aracılığıyla Bitmex Türkiyede bir ofis açacaktı, düşüşlerden sonra askıya alındı. Ofis açılsa işlemler daha kolay olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borsaicin",
      "created_time": "June 22, 2023, 06:28:50 PM",
      "body": "Nasıl olur hocam. Ayrıca dolandırıcılık yok ortada. Mesaj olarak telefon numaranız yada Telegram id bırakırsanız sevinirim. Quote from: emresuakar on June 22, 2023, 08:04:18 AMSeni dolandırıcılıkla mı suçluyorlar? Kimseyi dolandırdın mı? Teşebbüs ettin mi? TR forumda Bitmex'in temsilcisi yok, global foruma yazarsan daha iyi olur. Benimde 0.7 BTC blokeli 20000 TL'ye maliyetlendiğim için üstüne pek düşmemiştim. Geçen sene ATH'de biraz araştırma yaptımda bunun tek yolu orada kapitalin olduğunu noterde kanıtlayacaksın, Adalet bakanlığı aracılığıyla noter kağıdını Başkonsolosluk aracılığıyla Seyşeller'e göndereceksin. Dolandırıcılıktan dolayı kara listeye alınmışsan kanıtları da varsa mahkemelik olursunuz elle tutulur bir dolandırıcılık yoksa hemen alırsın paranı, teşebbüs ettiysende pek sorun çıkmaz beklediğinle kalırsın.Geçen boğa sezonunda Hollanda'da yaşayan bir fenomen abimiz aracılığıyla Bitmex Türkiyede bir ofis açacaktı, düşüşlerden sonra askıya alındı. Ofis açılsa işlemler daha kolay olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "June 25, 2023, 11:34:35 AM",
      "body": "Kredi kartı ile Bitcoin alıp short pozlar açtığınızı okurken içim ürperdi. Bir an paranın tamamını kaybettik diyeceksiniz sandım. Kredi ile para çekip short pozlar açmak çok doğru bir iş değil. Paranın tamamını kaybedebilirdiniz. Üstelik 0.9 BTC satın alıp yalnızca 1.XX yapmışsınız. 1.99 bile olsa maksimum kazanç 2X'ten biraz fazla olmuş. Bu riske değer miydi anlamadım. Kazandığınız para aldığınız riske göre çok düşük. Neyse ki Bitcoin uzun vadenin sonunda daha da değerlenmeye devam edecek. Paranız birkaç sene daha onlarda kalsa bile sonunda daha çok değerlenmiş olacak. Olayın böyle bir avantajlı yanı var.Tecrübeli üyeler daha iyi cevap verir ama olayı X kişinin karıştığı scamlar aydınlatabilirmiş gibi bir hisse kapıldım. X kişisi bu scam girişimlerinde aktif rol üstlenmiş miydi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borsaicin",
      "created_time": "June 25, 2023, 01:48:29 PMLast edit: March 04, 2024, 10:17:51 AM by borsaicin",
      "body": "Evet teşebbüs etti. Fakat başarısız girişimler. Quote from: Dzigie on June 25, 2023, 11:34:35 AMKredi kartı ile Bitcoin alıp short pozlar açtığınızı okurken içim ürperdi. Bir an paranın tamamını kaybettik diyeceksiniz sandım. Kredi ile para çekip short pozlar açmak çok doğru bir iş değil. Paranın tamamını kaybedebilirdiniz. Üstelik 0.9 BTC satın alıp yalnızca 1.XX yapmışsınız. 1.99 bile olsa maksimum kazanç 2X'ten biraz fazla olmuş. Bu riske değer miydi anlamadım. Kazandığınız para aldığınız riske göre çok düşük. Neyse ki Bitcoin uzun vadenin sonunda daha da değerlenmeye devam edecek. Paranız birkaç sene daha onlarda kalsa bile sonunda daha çok değerlenmiş olacak. Olayın böyle bir avantajlı yanı var.Tecrübeli üyeler daha iyi cevap verir ama olayı X kişinin karıştığı scamlar aydınlatabilirmiş gibi bir hisse kapıldım. X kişisi bu scam girişimlerinde aktif rol üstlenmiş miydi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}