{
  "id": "topic_5411235",
  "title": "Mate2237",
  "author": "Mate2237",
  "created_time": "August 25, 2022, 08:39:54 PM",
  "content": "Samsung The Smartphone GiantSamsung gave the announcement in this week that they are launching bitcoin exchange platform in South Korea, that is a good news of the firm, because they quickly discovered that bitcoin is used more than any other...I believe other major and minor businesses will also follow suit to make things easy for bitcoiners in the whole world. Now this will make bitcoiners to buy their (Samsung) devices (products) easily. The project is kick starting next year as it is said by the company management.https://www.instagram.com/p/ChsJvIJB0OA/?utm_source=ig_web_copy_link",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411235",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "August 25, 2022, 08:52:33 PM",
      "body": "Investing in cryptocurrencies is different from starting an exchange platform.Quote from: Mate2237 on August 25, 2022, 08:39:54 PMSamsung gave the announcement in this week that they are launching bitcoin exchange platform in South Korea,A crypto exchange platform, it is not peculiar to bitcoin.Samsung is a South Korean company, but I've not found any suggestion that the planned exchange would be limited to South Korea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "August 25, 2022, 08:59:41 PM",
      "body": "I don't believe anything from those Instagram or Twitter Influencers/Shit posters. Did you hear anything from Samsung itself? From where do they get the news? Do you really believe a tech giant company will launch a Crypto exchange platform? Even if they do, Those will be centralized exchanges which I don't care about. Bitcoin users are supposed to be anonymous. Those exchanges force you to do the KYC, and you are not anonymous anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "August 25, 2022, 09:05:33 PM",
      "body": "Quote from: Mate2237 on August 25, 2022, 08:39:54 PMNow this will make bitcoiners to buy their (Samsung) devices (products) easily.I just made a search to see what exactly Samsung is going to do.If the news is real, as you mentioned in your topic, they will launch a cryptocurrency exchange. But I couldn't find any news about allowing people to buy their products with bitcoin. So they don't seem to have any plan to accept bitcoin as a payment method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "August 25, 2022, 09:12:19 PM",
      "body": "Quote from: hosseinimr93 on August 25, 2022, 09:05:33 PMQuote from: Mate2237 on August 25, 2022, 08:39:54 PMNow this will make bitcoiners to buy their (Samsung) devices (products) easily.I just made a search to see what exactly Samsung is going to do.If the news is real, as you mentioned in your topic, they will launch a cryptocurrency exchange. But I couldn't find any news about allowing people to buy their products with bitcoin. So they don't seem to have any plan to accept bitcoin as a payment method. Lets put up some more links.https://beincrypto.com/samsung-aims-to-launch-crypto-exchange-in-2023/https://decrypt.co/108211/samsung-slates-crypto-exchange-launch-south-korea-2023-reportSeems like they are tending to touch up other industry and now tending to create a new exchange?This is a win-win situation where they could possibly get users out of their popularity and also able to make out some ads or exposure with their products as well.Very clever imho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 25, 2022, 09:17:19 PM",
      "body": "Quote from: Mate2237 on August 25, 2022, 08:39:54 PMSamsung The Smartphone GiantThey build from chips and smartphone panels or HDDs to ships.So presenting them as \"smartphone giant\" is a huge understatement.And in this light, expanding their business into adding a crypto exchange to their portfolio, is not that special for them. A good news for bitcoiners though, obviously.Still, as said, an announcement from them would be nice. Rumors from this or that can easily turn out to be false/incorrect (although that link from newspim the decrypt article contains is somewhat reassuring)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 25, 2022, 09:42:48 PM",
      "body": "Samsung does seem to be jumping into crypto with both feet. While they are producing mining chips and working on an exchange, it’s something to note they’re also heavily investing in web3 and the metaverse. It’s possible they want you to be buying crypto from your tv on their exchange and using their tv to browse around in the metaverse. I’m a fan of Samsung and look forward to seeing what they come up with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "August 25, 2022, 09:47:13 PM",
      "body": "I disagree with Upgrade00 on thisQuote from: Upgrade00 on August 25, 2022, 08:52:33 PMInvesting in cryptocurrencies is different from starting an exchange platform. That's not even gonna add any material value though; atleast it will grant BTC some popularity and also a little trickle in blockchain transactions and bitcoin circulation, why? How? These group of companies make multi-million sales everyday all over thier branches and sub-branches across the world so if they're bringing up an idea like this, don't you think thier customers could prolly adopt the system of buying with btc? Which could serve as another means to make shopping easily accessible to everyone.+ How 'bout if the company decides to utilize bitcoin as a store of value over time? This is a fabulous start to me and I think they may have future plans but that, of course is unknown to anyone just yet.Sandra❣️",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "August 25, 2022, 10:52:00 PM",
      "body": "Samsung is one among the company to make its entry earlier into cryptocurrency. This happened through the addition of in-built cryptocurrency wallets that support bitcoin, ethereum and few other specific altcoins. Later they got into the production of mining chips. When it comes to business, it is good to move according to the trend and experience the change.In the long run surely Samsung will evolve as a big competitor for Binance. Because, samsung is already an established firm and this lets it easy reachable among every levels of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "August 25, 2022, 10:57:03 PM",
      "body": "Quote from: hosseinimr93 on August 25, 2022, 09:05:33 PMQuote from: Mate2237 on August 25, 2022, 08:39:54 PMNow this will make bitcoiners to buy their (Samsung) devices (products) easily.I just made a search to see what exactly Samsung is going to do.If the news is real, as you mentioned in your topic, they will launch a cryptocurrency exchange. But I couldn't find any news about allowing people to buy their products with bitcoin. So they don't seem to have any plan to accept bitcoin as a payment method. Since they make electronics I'd expect an app for their phones and smart TVs to be added that allows you to trade cryptocurrencies with Samsung devices straight out of the box. This is a smart move in my opinion. In future they should expand to various online services, virtual reality games and partner with stores and restaurants, so that a person can move to another country, buy a new phone there and immediately have access to all local services without having to install or google anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "August 26, 2022, 06:45:26 AM",
      "body": "I don't know if this is just lost in translation:QuoteSamsung Securities is conducting a study on how to enter the blockchain-based security token business. At the end of last year, they tried to find a manpower to take charge of the development and operation of the security token trading platform, and the development of blockchain smart contracts, but were unable to find employment.https://www.newspim.com/news/view/20220822000384I translated it using Google, it just says \"study\", so we really don't know what does it mean or if they are really putting up their own crypto exchange as we all know that crypto regulations in South Korean is very strict so maybe they are just in the preliminary stage and if they find that it is complicated that they initially thought then who knows, they might give it all and just focus on what they know best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "August 26, 2022, 06:56:51 AM",
      "body": "Not taking the information at face value until we have more reliable sources, it seems to me that if Samsung were to enter the crypto market it would be good news. They are not going to focus on bitcoin, they are not bitcoin maximalists, but as Samsung is such a big company and is part of so many people's daily lives, it would help a lot to popularise cryptocurrencies among the general public.Seeing an advert for cryptocurrencies, a Samsung exchange or the following, would be awesome:Quote from: darkangel11 on August 25, 2022, 10:57:03 PMSince they make electronics I'd expect an app for their phones and smart TVs to be added that allows you to trade cryptocurrencies with Samsung devices straight out of the box.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 26, 2022, 07:05:01 AM",
      "body": "They are not investing on Bitcoin and your title is misleading. They are just opening exchange business but that doesn’t mean they will purchase Bitcoin for investment purposes. Samsung show interest in cryptocurrency market before by planning to implement crypto wallet on all of there smartphone which I don’t know it materialize but this exchange is huge gamble for them because they investing on crypto market in general to gain profit. This will not gonna give huge impact on Bitcoin but I’m sure it will help to provide liquidity on crypto since samsung is trusted company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spiker777",
      "created_time": "August 26, 2022, 07:30:25 AM",
      "body": "Quote from: AnotherAlt on August 25, 2022, 08:59:41 PMI don't believe anything from those Instagram or Twitter Influencers/Shit posters. Did you hear anything from Samsung itself? From where do they get the news? Do you really believe a tech giant company will launch a Crypto exchange platform? Even if they do, Those will be centralized exchanges which I don't care about. Bitcoin users are supposed to be anonymous. Those exchanges force you to do the KYC, and you are not anonymous anymore. It is true that I also haven't heard anything from Samsung officially announcing the launch of a cryptocurrenty exchange. and if these influencers are spreading false news. then samsung will soon response to them and clarify that. now for the exchange being centralized i think it is pretty much common. all the CEX currently available are already centralized and require KYC. or have limits for non kyc users. so this is not something only samsung doing. even crypto companies itself doing centralized exchanges. we need to think for the positive aspects of this. if samsung launch their crypto exchange. it'll help crypto to reach out to the mass userbase of samsung.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "August 26, 2022, 08:24:10 AM",
      "body": "Quote from: Mate2237 on August 25, 2022, 08:39:54 PMSamsung gave the announcement in this week that they are launching bitcoin exchange platform in South Korea, that is a good news of the firm, because they quickly discovered that bitcoin is used more than any other...I believe other major and minor businesses will also follow suit to make things easy for bitcoiners in the whole world. Now this will make bitcoiners to buy their (Samsung) devices (products) easily. The project is kick starting next year as it is said by the company management.This is both news and not news. Because Samsung has already been in crypto. Have you seen the Samsung Blockchain Wallet app? An in-built cryptocurrency wallet that comes when you buy a Samsung Galaxy S22. Samsung is not new to the cryptocurrency ecosystem1. Samsung Partners with Cardano-Powered Veritree to Combat Climate Change12. Samsung Partners With Theta Labs to Integrate NFT Ecosystem With Upcoming Galaxy Flagship2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "August 26, 2022, 08:30:17 AM",
      "body": "Samsung for some time has shown much interest to blockchain and digital currency, they already launch the Samsung blockchain wallet for users of their mobile phone devices. The tech giant have always shown interest in this space so much that they partner up with Enjin coin project back in 2019 (i think) to support the rapidly growing gaming ecosystem.  As a tech company it is important to embrace new innovation and advancement for better improvement, so launching a crypto exchange is good for their blockchain involvement and business as well. More users and greater awareness for their devices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 26, 2022, 02:21:43 PM",
      "body": "Some of Samsung models have built-in blockchain wallet in their smartphones, so they probably have plans to connect that to their new centralized exchange.They already have secure element chip inside devices that can act similar like hardware wallet, but it's closed source so we don't know anything about bugs in their system.It would be much better if Samsung supported Bitcoin, but I have a feeling they are going to create their own Samsung token soon and use it in this exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 26, 2022, 08:51:47 PM",
      "body": "Quote from: dkbit98 on August 26, 2022, 02:21:43 PMSome of Samsung models have built-in blockchain wallet in their smartphones, so they probably have plans to connect that to their new centralized exchange.They already have secure element chip inside devices that can act similar like hardware wallet, but it's closed sourceI would not be overly happy about those things in Samsung phones, nor advertise them.As you said, it's closed source, and we don't know what surprises they bring.I find these more a marketing stunt than actually useful features, Samsung trying hard to stay on top of the game. It's, for some years now, no longer an Apple vs Samsung game, there are other makers (especially Chinese) with huge sales eroding the giants' positions.Also, as I said, Samsung is investing in a lot of directions. Having their own exchange.. is just another business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "August 26, 2022, 10:43:17 PM",
      "body": "What I believe is Samsung has been long in the game. They've been investors of crypto projects even before and to give an example, one is Axie Infinity.Before the hype for the game, I think they're already investor of it and have been passionate and supportive to the crypto projects that they think is going to be a hit. I think the title must be changed, they're going to make an exchange and although there's a connection on it. But, that's more specified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "August 28, 2022, 06:45:44 AM",
      "body": "Unlike north Korea where the government won't allow people to have freedom in South Korea, we see many positive moves and many companies will be able to invest in this country for the new technologies Samsung can be one famous example of a company that they trying to get involved in new technologies, opening a new cryptocurrency exchange can be good for the people of South Korea to have access to cryptocurrency exchanges also this can be good for the governments because they can get tax and income from this exchange and for Samsung, opening this exchange can be good advertising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}