{
  "id": "topic_5446105",
  "title": "adamvp",
  "author": "adamvp",
  "created_time": "March 23, 2023, 09:51:44 PM",
  "content": "Nie daje mi spokoju taka myśl -   a co jeśli, jednak wszyscy daliśmy się nabrać i krypto tylko udaje remedium na bolączki \"tradycyjnego\" systemu finansowego?Moje watpliwości dotyczą głownie takich obszarów jak:1. blockchain jako dobre ale nie najlepsze i nie wszędzie konieczne rozwiązanie - może w większości przypadków wystarczą faktycznie bazy danych? Może ryzyko oszustwa/manipulacji które  (o ile jest tak faktycznie w 100% miał bitcoin wyelimnować) jest na tyle małe, że wystarczy tradycyjne podejście, tj straszenie karami i wyrywkowe karanie winnych przewinien, może nie potrzeba oszustw eliminować systemowo, ponieważ jest to zbyt kosztochłonne?2. Od kilku lat nie widać znaczącego postępu adopcji płatności bezpośrednio w krypto, a raczej wygląda na to, że się sytuacja pogorszy ponieważ regulatorzy rzucają kłody pod nogi, a taka adopcja to chyba jedyny możliwy sposób na ustabilizowanie kursu i zapewnienie stałej wartości waluty3. w razie kryzysu jednak wygrane bedzie zloto i inne tego typu materiały, więc rownież i tutaj btc nie spelni pokladanych w nim nadziei4. deflacyjny charakter btc - nie taki dobroczynny jak nam sie wydaje? w sumie najgorsze wojny faktycznie byly o zasoby, mimo tego ze dalej daleko od ogolnoswiatowego pokoju udalo sie w wiekszosci ludzkosci takie wojny o zasoby ograniczyc i sa teorie ze to m.in dzieki rezygnacji z parytetu dolara do zlota, czy przywrocenie systemu monetarnego z ograniczona podaza nie skierowaloby nas z powrotem na te tory? co prawda plus jest taki, ze btc nie istnieje fizycznie, ale juz  koparki i elektrownie do ich zasilania tak. No to w sumie taka najmiej niepokojaca kwestia, tutaj bardziej istotne jest to, jak by sie skonczyla w dzisiejszych czasach stala deflacja - bo teraz to glownie inflacja mobilizuje ludzi do dzialania, a co by to bylo gdyby czlowiek im mniej byl aktywny tym by wiecej zarabial?5. zainteresowanie przez wielkie instytucje finansowe to nie dostrzeganie wielkiego potencjalu kryptowalut, ale po prostu wlozenie kilku promili ich kapitalu w cos co moze przyniesc sredniookresowy zysk, tak jak inwestycje w startupy z wielu innych branz.Takie moje luzne przemyslenia ktore mnie nie daja spokoju, moze ktos bedzie chetny sie na luzie odniesc. zapraszam",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446105",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 24, 2023, 06:36:33 AMLast edit: March 24, 2023, 07:25:27 AM by Tytanowy Janusz",
      "body": "Quote from: adamvp on March 23, 2023, 09:51:44 PM1. blockchain jako dobre ale nie najlepsze i nie wszędzie konieczne rozwiązanie - może w większości przypadków wystarczą faktycznie bazy danych? Może ryzyko oszustwa/manipulacji które  (o ile jest tak faktycznie w 100% miał bitcoin wyelimnować) jest na tyle małe, że wystarczy tradycyjne podejście, tj straszenie karami i wyrywkowe karanie winnych przewinien, może nie potrzeba oszustw eliminować systemowo, ponieważ jest to zbyt kosztochłonne?2. Od kilku lat nie widać znaczącego postępu adopcji płatności bezpośrednio w krypto, a raczej wygląda na to, że się sytuacja pogorszy ponieważ regulatorzy rzucają kłody pod nogi, a taka adopcja to chyba jedyny możliwy sposób na ustabilizowanie kursu i zapewnienie stałej wartości waluty3. w razie kryzysu jednak wygrane bedzie zloto i inne tego typu materiały, więc rownież i tutaj btc nie spelni pokladanych w nim nadziei4. deflacyjny charakter btc - nie taki dobroczynny jak nam sie wydaje? w sumie najgorsze wojny faktycznie byly o zasoby, mimo tego ze dalej daleko od ogolnoswiatowego pokoju udalo sie w wiekszosci ludzkosci takie wojny o zasoby ograniczyc i sa teorie ze to m.in dzieki rezygnacji z parytetu dolara do zlota, czy przywrocenie systemu monetarnego z ograniczona podaza nie skierowaloby nas z powrotem na te tory? co prawda plus jest taki, ze btc nie istnieje fizycznie, ale juz  koparki i elektrownie do ich zasilania tak. No to w sumie taka najmiej niepokojaca kwestia, tutaj bardziej istotne jest to, jak by sie skonczyla w dzisiejszych czasach stala deflacja - bo teraz to glownie inflacja mobilizuje ludzi do dzialania, a co by to bylo gdyby czlowiek im mniej byl aktywny tym by wiecej zarabial?5. zainteresowanie przez wielkie instytucje finansowe to nie dostrzeganie wielkiego potencjalu kryptowalut, ale po prostu wlozenie kilku promili ich kapitalu w cos co moze przyniesc sredniookresowy zysk, tak jak inwestycje w startupy z wielu innych branz.Takie moje luzne przemyslenia ktore mnie nie daja spokoju, moze ktos bedzie chetny sie na luzie odniesc. zapraszamChętnie podsykutuję. Pozwól, że wezmę na ostrzał kilka punków na początku i jak je przedyskutujemy to przejdę do kolejnych:ad1. Masz rację. Zdecentralizowany blockchain to drogi i wolny system pełen wad. Dlatego moim zdaniem 99% coinów upadnie. Nie potrzebny jest osobny blockchain do fitness apki liczącej kroki. Nie potrzebny jest też moim zdaniem osobny blockchain do itemków z gierek. Tu wystarczy moim zdaniem zaufanie i ściganie winnych tak jak napisałeś. Inna jednak sytuacja występuje w przypadku bitcoina. On nie zajmuje się takimi głupotami. Usuwa zaufanie tam, gdzie faktycznie zaufanie to za mało. Spadek siły nabywczej dolara o 97% w ostatnie 100 lat, kryzys finansowy 2008 zalepiony rozwadnianiem oszczędności, upadające obecnie banki, dodruk w nieskończoność to tylko kilka przykładów. Do tego system finansowy trzymany na szpilkach przez FED, który ciągle nakleja kolejną łatę wymyślając kolejne \"narzędzie\" mimo, że chwile wcześniej twierdzi, że ma wszystkie \"narzędzia\" by poradzić sobie z problemem.ad2. Bitcoin jest walutą 2 krajów. To dużo moim zdaniem a akceptacja w każdym sklepie na całym świecie to nie kwestia lat a dekad jeśli w ogóle. Nie jest to natomiast niezbędne do stabilizowanie się ceny bitcoina, o czym wspomnę w kolejnym punkcie.https://chaindebrief.com/cryptocurrency-adoption-curve-is-the-fastest-in-human-history/Dane co do bitcoina wahają się w zależności od źródła ale z tego co widzę to jest w top3/top4 adopcji wymienionych wyżej technologi.ad3. Co daje stabliność ceny złota, jeśli złoto nie ma adopcji opisanej w pkt. 2? Przecież nie da się iść ze złotą monetą do sklepu i kupić szynki. A jednak amplitudy są niewielkie. Moim zdaniem jest to wielkość rynku i obecność dużych graczy, całych państw i co najmniej 50 lat znajdywania uczciwej wyceny po porzuceniu standardu złota przez Nixona w 1971. Możliwe, że za 40 lat bitoin wejdzie w konsolidację w przedziale 1-2 mln $ na kolejne 30 lat. Moim zdaniem jest tu potrzebny czas i obecność dużych graczy a nie możliwość użycia w żabce. Poza tym moim zdaniem bitcoin jest lepszym złotem niż złoto:  1- bitcoin jest podzielny do centów  2- bitcoin ma już teraz lepsze stock/flow od złota  3- stock/flow bitcoina nie zależy od ceny w przeciwieństwie do złota, którego podaż zapewne się podwoi jak tylko podwoi się cena (złoża nieopłacalne do wydobycia staną się opłacalne)  4- stock/flow bitcoina będzie tylko spadać  5- bitcoina jest łatwiej przechowywać  6- bitcoina jest łatwiej kupić/sprzedać  7- bitcoin jest niepodrabialny i nie potrzeba czujników/mierników by dokonać transakcji  8- bitcoina łatwiej jest przesłać za granicę, zapłacić za coś na drugim końcu świata. Złoto za czasów standardu złota było transportowane między państwami drogą morską z obstawą floty wojska. W przypadku       standardu bitcoina wystarczyłby 1$.mogę tak dalej Obecnie jak bitcoin spada, to ludzie boją się, że spadnie do zera. Jak rośnie to widzą ogormne perspektywy. Zatem żadna cena nie jest za niska by sprzedać i żadna za wysoka by kupić. Stąd też takie skoki cen. Za 30 lat jak bitcoin będzie walutą rezerwową 50 karajów, to nikt nie bedzie się bał, że spadnie do zera i nikt nie będzie liczył na kolenje 10x (to mocno optymistyczny wariant z tymi 50 państwami, wiem  ). Cena się ustabilizuje. Do tego czasu zmienność powinna sukcesywnie spadać co widać na wypłaszczającym się wykresie logarytmicznym ostatnich 14 lat handlu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "March 24, 2023, 02:27:05 PM",
      "body": "niestety,  nie moge przyjac tego argumentu z 2 krajami, bo niestety nie sa to w pelni zdrowe organizmy panstwowe, a  wprowadzenie btc tam okazalo sie raczej sposobem na wyprowadzenie pieniedzy z kasy panstwa przez rzadzacych, wiec to wrecz wydaje sie miec negatywne znaczenie dla przyszlosci btc, to juz lepiej zrobila dla rozwoju BTC sytuacja podczas kryzysu w Wenezueli..ad2. Fajny wykres, dzieki, natomiast nawet jesli rzeczywiscie dane sa prawdziwe to dalej nie daje to gwarancji, ze idziemy w dobra strone. I tutaj przechodzimy do punktu 3. przy czym fakt sytuacja sie bardzo komplikuje, bo masz racje ze podaz zlota nie jest stala (wahania sa oczywiscie duzo mniejsze, ale jednak) i potrzebowalibysmy innego miernika wartosci, a tak na szybko nie przychodzi mi nic idealnego do glowy.Glownym zagadnieniem tutaj natomiast jest jaki (deflacyjny czy inflacyjny) charakter gospodarki bylby optymalny do stabilnego rozwoju spoleczenstwa i to rowniez nie jest pytanie na krotki post, natomiast nie likwiduje to watpliwosci czy pojscie w strone gospodarki deflacyjnej jest na pewno lepsze niz aktualny model. No i jak dla mnie liczenie ze Big Money wejdzie na grubo w krypto to jest zbyt optymistyczne podejscie, osobiscie widze wieksza szanse na oddolna adopcje, i sam probuje sie do tego przyczynic informujac znajomych na temat krypto, ale w tym momencie,zanim pojde \"full scale\" w tych dzialaniach  potrzebowalbym  rozwiac w/w watpliwosci..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 25, 2023, 09:16:54 AM",
      "body": "Quote from: adamvp on March 24, 2023, 02:27:05 PMniestety,  nie moge przyjac tego argumentu z 2 krajami, bo niestety nie sa to w pelni zdrowe organizmy panstwowe, a  wprowadzenie btc tam okazalo sie raczej sposobem na wyprowadzenie pieniedzy z kasy panstwa przez rzadzacych, wiec to wrecz wydaje sie miec negatywne znaczenie dla przyszlosci btcDobry argument. Od czegoś jednak trzeba zacząć. Ktoś przetarł szlaki dla kolejnych a 10 mln ludzi zostało zapoznanych z nową technologią. Z tego co pamiętam to Salvador płacił za pobranie portfeli krypto o wdrażanie technologi. Quote from: adamvp on March 24, 2023, 02:27:05 PMGlownym zagadnieniem tutaj natomiast jest jaki (deflacyjny czy inflacyjny) charakter gospodarki bylby optymalny do stabilnego rozwoju spoleczenstwa i to rowniez nie jest pytanie na krotki post, natomiast nie likwiduje to watpliwosci czy pojscie w strone gospodarki deflacyjnej jest na pewno lepsze niz aktualny model.Do tego polecam nowy wątek bo pewnie będzie ogrom argumentów. Ja jestem osobiście znacznie bliżej szkoły Austriackiej choć rozumiem też argumenty Keynesistów. Będzie o czym pogadać.Quote from: adamvp on March 24, 2023, 02:27:05 PMNo i jak dla mnie liczenie ze Big Money wejdzie na grubo w krypto to jest zbyt optymistyczne podejscie, osobiscie widze wieksza szanse na oddolna adopcje, i sam probuje sie do tego przyczynic informujac znajomych na temat krypto, ale w tym momencie,zanim pojde \"full scale\" w tych dzialaniach  potrzebowalbym  rozwiac w/w watpliwosci..Oddolna adopcja wymaga tego by ludziom dupy się zapaliły. Wcześniej nie otworzą oczu. Pozwolili sobie zabrać złoto i zdewaluować oszczędności o 97% w 100 lat. Ważne by był chleb i igrzyska. A kiedy się dupa zapali? Pewnie jak pojawi się hiperinflacja lub upadek banków. Tak było w Wenezueli, Turcji. Robiono wszystko by wyzbyć się lokalnej waluty. Zamieniano nawet na złoto z Word of Warcraft, tworzono oddolne środki wymiany jak kwity zbożowe w republice weimarskiej po WW1. Teraz jest Bitcoin i nie trzeba aż tak kombinować. A elity i gruby kapitał wie więcej i wie wcześniej więc pewnie oni pierwsi zaczną wchodzić w btc.Bez tego adopcja będzie powolna. Choć i tak pewnie top4 z wymienionych wyżej technologi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "March 25, 2023, 08:28:03 PM",
      "body": "pytanie czy posiadanie oszczednosci jest celem dobrym samym w sobie, czy moze jednak wazniejsza jest ich uzetecznosc, za ktora \"cena\" jest dewaluacja tych oszczednosci (jesli z tego jest finansowany np rozwoj edukacji, ktory prowadzi do rozwoju poziomu technologicznego i dalej poziomu zycia, to moze cena nie jest az tak absurdalnie urojona jak to wskazuja liczby bezwgledne? )W sumie to z checia bym poczytal wypowiedzi innych forowiczow  w tym temacie",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 26, 2023, 06:27:23 AMLast edit: March 26, 2023, 09:30:33 AM by Tytanowy Janusz",
      "body": "Quote from: adamvp on March 25, 2023, 08:28:03 PMpytanie czy posiadanie oszczednosci jest celem dobrym samym w sobie, czy moze jednak wazniejsza jest ich uzetecznosc, za ktora \"cena\" jest dewaluacja tych oszczednosci (jesli z tego jest finansowany np rozwoj edukacji, ktory prowadzi do rozwoju poziomu technologicznego i dalej poziomu zyciaTylko \"zysk z inflacji\" nie jest wydawany na edukację, nowe technologie, inwestycje, innowacje. Wydawany jest na obietnice polityczne, przepychanki polityczne, rosnąca budżetówkę, wojny walutowe i bańki spekulacyjne powodujące misalokacje zasobów (np. bańka na nieruchomościach i całe osiedla duchy gdzie nikt nie mieszka)A prawo do posiadania jest jednym z fundamentalnych praw człowieka obok prawa do życia. Bez tego nie ma wolności. Wmawia nam się że tak musi być. Nie... Obecny system to tylko eksperyment ostatnich 50 lat.Temat jest złożony bo np. istotnym argumentem przeciw mogą być trudności z zachowaniem konkurencyjności gospodarki opartej o walutę deflacyjną w stosunku do inflacyjnych sąsiadów. W kraju deflacyjnym koszty produkcji rosną chyba, że pracodawcy regularnie obniżaliby wynagrodzenia a to ciężko sobie wyobrazić. Więc nie jest tak, że potrzebujemy inflacji by stymulować gospodarkę bo bez inflacji nie będziemy wydawać. To błędne myślenie. Jeśli potrzebujemy inflacji to po to by inne kraje nie kradły nam wzrostu gospodarczego poprzez regularne zaniżanie kosztów produkcji poprzez niszczenie swojej waluty. Tu mogą pomagać cła ale nie rozwiązują problemu całkowicie.Więcej w tym temacie w \"Wojny walutowe. Nadejście kolejnego globalnego kryzysu.\" James Rickards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "March 27, 2023, 10:11:47 PM",
      "body": "hmm nie mam teraz zbyt wiele czasu, więc zdążę napisać tylko, że wydaje mi się, że za bardzo patrzysz na sprawę przez swój pryzmat, a społeczeństwo niestety (albo i na szczęście zależy jak spojrzeć składa się z różnych jednostek, w tym takich którzy są szczęsliwi, że się państwo nimi \"opiekuje\")",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 28, 2023, 10:51:41 AM",
      "body": "Quote from: adamvp on March 27, 2023, 10:11:47 PMhmm nie mam teraz zbyt wiele czasu, więc zdążę napisać tylko, że wydaje mi się, że za bardzo patrzysz na sprawę przez swój pryzmat, a społeczeństwo niestety (albo i na szczęście zależy jak spojrzeć składa się z różnych jednostek, w tym takich którzy są szczęsliwi, że się państwo nimi \"opiekuje\")Tylko że państwo może opiekować się uczciwie poprzez rozdysponowanie środków publicznych zebranych  prostym i zrozumiały system podatkowy. A widać że robią wszystko by było odwrotnie. Nie da się prowadzić firmy bez księgowej i doradcy podatkowego a oszczędności z konta, już opodatkowane, magicznie parują. Cichuteńko kraść (inflacja) ale za to głośno rozdawać stało się recepta na wygraną wyborów. Nie mów mi że jest w tym coś dobrego poza rywalizacja o konkurencyjność gospodarki z sąsiadami.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "March 30, 2023, 09:14:34 PM",
      "body": "no tak, gdyby rozliczenia podatkowe byly na jakims smartkontrakcie, czesc wyplaty idzie na adresy panstwa (np na rozne fundusze celowe wszystko jasne wiadomo co i jak,,,), reszta dla pracownikaW sumie musze jeszcze taka refleksje dodac, albo raczej rozkmine, czy wszystko co dobre dla jednostki jest dobre dla spoleczenstwa?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 31, 2023, 07:35:34 AM",
      "body": "Quote from: adamvp on March 30, 2023, 09:14:34 PMW sumie musze jeszcze taka refleksje dodac, albo raczej rozkmine, czy wszystko co dobre dla jednostki jest dobre dla spoleczenstwa?Zdecydowanie dobrze jest zadziałać na szkodę jednostki (np wsadzając przestepcę do więzienia) by społeczeństwo pozbyło się zagrożenia. Ale czy społeczeństwo zyskuje na potajemnym okradaniu jednostek? Czy społeczeństwo zyskuje na przepychankach politycznych? Czy społeczeństwo zyskuje na bańkach spekulacyjnych? Czy etyczna jest manipulacja niewyszktałconym tłumem, który nie rozumie, że pieniądze które dostają biorą się z ich kieszeni? Czy demokracja jeszcze istnieje po powstaniu psychologi głebi i wszechobecnej manipulacji? Czy rozwój społeczeństwa można stawiać ponad podstawowe prawa jednostki (prawo do posiadania/prawo do życia)? Czy istnieją jakiekolwiek modele które gwarantują, że po odebraniu wolności jednostki mamy zapewnione lepsze społeczeństwo w długiej perspektywie, czy idziemy na ślepo zaczynając od odbierania wolności jednostkom? Czy w ogóle taki model da się opracować w obecności nieprzewidywalnych zjawisk, które jak się okazuje kierują naszym losem (Czarny łabędź. Jak nieprzewidywalne zdarzenia rządzą naszym życiem Taleb Nassim Nicholas)? Czy zrównanie wszystkich do jednego poziomu nie odbierze ludziom marzeń, celów, ideałów a to zatrzyma rozwój?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "April 03, 2023, 12:14:35 PM",
      "body": "Za dużo aksjomatów w Twojej wypowiedzi, przynajmniej polowe pytan daloby sie rozlozyc na czynniki pierwsze i okazaloby sie, ze nie sa tak jednoznaczne, ale wezmy np ta wlasnosc: w jednym z ujec przyjmuje sie, ze swiete prawo wlasnosci umozliwia wlascicielowi nieskrepowane nia rozporzadzanie, tylko co, jesli w wyniku tego  dzialania powstaje szkoda dla innych ludzi czy otoczenia? Czy wtedy mozna ograniczyc prawo wlasnosci? Natomiast zakladajac sie, ze zgadzamy sie co do zasady, ze prawo wlasnosci w takiej lub innej formie jest warte zachowania, to czy mamy pewnosc, ze wlasnie bitcoin jest wlasciwym srodkiem do utrzymania takiego prawa? Czy jestes 100% pewny, ze to nie jest jakas podpucha, a w koncu okaze sie ze btc kontroluja ludzie jeszcze gorsi niz obecna banksterka?Zmiany w algortymie jakkolwiek trudne do przeprowadzenia nie sa niemozliwenie jest tez wykluczone, ze zostanie wprowadzona cenzura transakcji - nody moga wszakze transakcje filtrowac, a takie kryteria filtrowania to sobie mozna rozne wyobrazicnie do konca tez wiemy kto posiada wiekszosc monet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 04, 2023, 07:32:16 AMLast edit: April 04, 2023, 08:42:16 AM by Tytanowy Janusz",
      "body": "Quote from: adamvp on April 03, 2023, 12:14:35 PMZa dużo aksjomatów w Twojej wypowiedzi, przynajmniej polowe pytan daloby sie rozlozyc na czynniki pierwsze i okazaloby sie, ze nie sa tak jednoznaczne, Celowo w mojej wypowiedzi zawarłem pytania, a nie zdania twierdzące, bo właśnie odpowiedzi na sporą część tych pytań nie są jednoznaczne i często zależą od poglądów. Jednak w tej dyskusji warte, według mnie, były postawienia.Quote from: adamvp on April 03, 2023, 12:14:35 PMCzy jestes 100% pewny, ze to nie jest jakas podpucha, a w koncu okaze sie ze btc kontroluja ludzie jeszcze gorsi niz obecna banksterka?Zmiany w algortymie jakkolwiek trudne do przeprowadzenia nie sa niemozliwenie jest tez wykluczone, ze zostanie wprowadzona cenzura transakcji - nody moga wszakze transakcje filtrowac, a takie kryteria filtrowania to sobie mozna rozne wyobrazicnie do konca tez wiemy kto posiada wiekszosc monet1- i stale są wprowadzane, ale większość sieci musi je zaakceptować. Większość to grubo zainwestowani w ASIC minery górnicy, którzy w przypadku upadku sieci będą mogli swoją inwestycję wywalić na złom. To nie jest GPU (POW ETH), że można próbować sprzedać graczom. Bez bitcoina hardware do kopania bitcoina ma wartość 0.2- Cygan jest solo minerem. Przy okazji w swoim wątku wrzuca czasem jak pojedyńczym minerom udaje się czasem wykopać blok przy użyciu sprzętu za kilka tysięcy. Zdarza się. Nie mówiąc już o setkach małych pooli, albo setkach średniej wielkości minerów. tak długo jak długo oni są, tak długo nie będzie cenzury na bitcoinie. Wystarczy poczekać, aż blok wykopie uczciwy miner i zapłacić odpowiednio, by nie być za daleko w kolejce.3- a co to zmienia? to nie jest POS.Quote from: adamvp on April 03, 2023, 12:14:35 PMw jednym z ujec przyjmuje sie, ze swiete prawo wlasnosci umozliwia wlascicielowi nieskrepowane nia rozporzadzanie, tylko co, jesli w wyniku tego  dzialania powstaje szkoda dla innych ludzi czy otoczenia? Czy wtedy mozna ograniczyc prawo wlasnosci? Właściciel płaci odszkodania za straty innych ludzi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}