{
  "id": "topic_5408078",
  "title": "ScamViruS",
  "author": "ScamViruS",
  "created_time": "July 29, 2022, 06:19:08 PM",
  "content": "I got a message on telegram about this website. I kept talking to him to know the details, and followed the steps he told me. I created an account on this website using my other extra phone, and tried to send the screenshot as he said, but he already deleted his telegram account! Lol! Now the question here is why he deleted the telegram? Or already got the victim? This website is unknown and what I found after visiting it seems fake website to me. This website can be very risky for new gamblers. So if you get any such message, then don't deposit any fund on this website. Because if you deposit, you will never get that money back.Website: Code:https://10.w88hash.vip/#/register?code=88967405QuoteDomain Name: w88hash.vipRegistry Domain ID: DD8F6DBE95E2544168820018AD7743D3B-GDREGRegistrar WHOIS Server:Registrar URL: www.wildwestdomains.comUpdated Date: 2022-06-06T10:13:58ZCreation Date: 2022-05-18T07:36:21ZRegistry Expiry Date: 2024-05-18T07:36:21ZRegistrar: Wild West Domains, Inc.Registrar IANA ID: 440Registrar Abuse Contact Email: email@wildwestdomains.comRegistrar Abuse Contact Phone: +1.4806242505",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408078",
  "comments": [
    {
      "author": "dothebeats",
      "created_time": "July 29, 2022, 06:38:15 PM",
      "body": "The URL itself already looks suspicious. I mean, look at that TLD. These kinds of TLD are mostly used for scam sites or phishing sites, and its name does not imply what it means in the English side of things. I'm not saying that all .vip URLs are scams, but most of these sites are. If you really want to gamble your money and to have a good time, I suggest that you deposit it on places that are already established in the crypto community or those that have their announcement here on bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zackgeno96",
      "created_time": "July 29, 2022, 08:03:48 PM",
      "body": "The URL looks suspicious, but apart from that, I also think it's a very curious suspicious name. If you do decide to start a casino, take the time to think of a good name first. However, that does not mean that this site is by definition a scam, it could also be that there is a legal operator behind it, but you should always be careful with these types of sites. I do not think that people are willing to test these cheap sites, while there are very reputable sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 29, 2022, 08:19:25 PM",
      "body": "Quote from: ScamViruS on July 29, 2022, 06:19:08 PMI got a message on telegram about this website. I kept talking to him to know the details, and followed the steps he told me. I created an account on this website using my other extra phone, and tried to send the screenshot as he said, but he already deleted his telegram account! Lol! Now the question here is why he deleted the telegram? Or already got the victim?I hope you did not use same account login credentials you use for other websites to register in that fraudulent site. That could have been his target, thus he deleted his Telegram thinking he had already got what he wanted (Your login details)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 29, 2022, 08:20:17 PM",
      "body": "The URL is indeed suspicious when you look at it and when that person tells you about the site then deleted the account right away. My thoughts is that he thinks he got you and he possibly thought you fall for it. According to the site's details you provided that the site is created not too long ago and what I think about it is it doesn't have good reputation yet which I can say not to be trusted yet if it is a legit but since this is not a legit then I could say that they won't achieve having a good reputation. No account required but you have to create/register an account (what a joke).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "July 29, 2022, 08:29:53 PM",
      "body": "Earlier these kind of scam approach was much seen with Exchanges, wallets and related services. Some new wallets and exchanges were created and the user data were gathered. This data is further used to take the respective users accounts into control. So, it is a must to be secure while getting into new links. OP have done a good job finding the intention of the person and have created awareness among us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "July 29, 2022, 08:33:35 PM",
      "body": "aside from the URL, the website itself is highly suspicious. who in their right mind would design a gambling site like that? The way he just deleted his account after telling you to register would make anyone suspicious about his motive. at this point, if anyone still falls for this scam I'd say they deserve it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 29, 2022, 08:54:13 PM",
      "body": "honestly who would use a site with that domain name: 10.w88hash.vip? I realized right away that this is a temporary site for scams, clicking on the link makes the person even more shocked seeing the site itself, I myself keep thinking that it was some gif image so I clicked and realized it was the site and the option to create an account comes out . i hope no one falls for this scam, if the person loves their money then the person will do research and choose a safe and reputable siteQuote from: acroman08 on July 29, 2022, 08:33:35 PMaside from the URL, the website itself is highly suspicious. who in their right mind would design a gambling site like that?looks like someone who is learning to program and has never seen a gambling site, but decided to create his site to rob people",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 29, 2022, 09:17:00 PM",
      "body": "So many scammer on telegram where they send an obvious scam site, not if you are using another phone where important details are not there, most probably you’re still safe but if you use your main phone and provide some details upon registration, that could be an alarm for you. Deleting a telegram account is the usual scenario for a scammer, this is really suspicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "July 29, 2022, 09:18:16 PM",
      "body": "Quote from: ScamViruS on July 29, 2022, 06:19:08 PMI got a message on telegram about this website. I kept talking to him to know the details, and followed the steps he told me. I created an account on this website using my other extra phone, and tried to send the screenshot as he said, but he already deleted his telegram account! Lol! <snip>I'm not familiar on how to get a URL with numbers starting with it then period after, then the name of the site. Guessing, maybe he got it from a free domain service. I'm unsure.In my case, if ever I encounter something like this which is suspicious, I tend not to create accounts which comes with usernames, emails, and/or passwords that I used with other sites which are important to me. OR I won't bother creating any account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 29, 2022, 09:35:08 PM",
      "body": "I can't even imagine why anyone would spend time and resources to build something like this. The site is ugly and definitely looks like a money grabbing site.Well, hopefully, no one is stupid enough to deposit money there. Quote from: Eureka_07 on July 29, 2022, 09:18:16 PMI'm not familiar on how to get a URL with numbers starting with it then period after, then the name of the site. Guessing, maybe he got it from a free domain service. I'm unsure.No. Those are subdomains, and anyone who owns a domain name can create as many as they like. Quote from: https://en.wikipedia.org/wiki/SubdomainIn the Domain Name System (DNS) hierarchy, a subdomain is a domain that is a part of another (main) domain.[1] For example, if a domain offered an online store as part of their website example.com, it might use the subdomain shop.example.com .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 29, 2022, 09:57:54 PM",
      "body": "Quote from: acroman08 on July 29, 2022, 08:33:35 PMaside from the URL, the website itself is highly suspicious. who in their right mind would design a gambling site like that? The way he just deleted his account after telling you to register would make anyone suspicious about his motive. at this point, if anyone still falls for this scam I'd say they deserve it.Not everyone knew about this scheme, this is why many falls as a victim even if they didn’t spend any money, we can’t tell what they really need until something happen to us. To OP, if you provided some important information then this could be a big trouble for you in the future, but as long as you use different details and connections, you can assume that you are still safe, just monitor your wallet or any important details, this might be their real target once you click the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "July 29, 2022, 10:06:51 PM",
      "body": "The way how that people introduce the site plus how suspicious the link is for sure it will give bad tase to the person who could see it. Also maybe he try to do phising attack and target those user who he think involve in gambling activities that's why he block you after you finish what he ask you yo do. Hopefully he didn't get any victim from the suspicious site he spread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "July 29, 2022, 10:42:12 PM",
      "body": "Quote from: ScamViruS on July 29, 2022, 06:19:08 PMNow the question here is why he deleted the telegram? Or already got the victim?~snip~^ Make sure that your extra phone that has been used did not infect by any malware infection probably that is possible or probably since there is a registration code I think it is because of the affiliate that he will probably get on that new casino. That is really strange why he deleted all conversations on Telegram which is means it really suspicious. That is why I did not trust strange people on Telegram, especially those who will pm first asking your name or personal details. We have plenty of gambling casinos here and that is enough for us to choose and gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "July 29, 2022, 10:51:55 PM",
      "body": "This method has been popular for a long time, but the funny thing is that these scammers think of making victims easily especially when they bump into smart people , and it is good to remind new users of these suspicious activities so that they do not fall into it. The trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "July 29, 2022, 11:42:10 PM",
      "body": "Quote from: Ulven on July 29, 2022, 10:51:55 PMThis method has been popular for a long time, but the funny thing is that these scammers think of making victims easily especially when they bump into smart people , and it is good to remind new users of these suspicious activities so that they do not fall into it. The trap.Nowadays telegram is much used as a platform to make a contact with users and trap them. At times people used to communicate as if they're the support team of the respective platform. So, in all means we need to be more cautious while handling anything related to money and cryptocurrencies. If lost it can't be recovered, so act wise before moving forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "July 29, 2022, 11:43:04 PM",
      "body": "Quote from: Zackgeno96 on July 29, 2022, 08:03:48 PMThe URL looks suspicious, but apart from that, I also think it's a very curious suspicious name. If you do decide to start a casino, take the time to think of a good name first. However, that does not mean that this site is by definition a scam, it could also be that there is a legal operator behind it, but you should always be careful with these types of sites. I do not think that people are willing to test these cheap sites, while there are very reputable sites.Apart from the URL, the website itself is clunky. The UI is lacking and it is super obvious that it was created hastily in order to likely scam people via depositing in this website. Not to mention, its domain name and address is currently existing around 72 days old. If someone wants to try a new gambling website, check the reviews or feedback if there are any. Avoid any sketchy gambling websites such as this one in order to prevent losing your money in the process.Code:72 days oldCreated on 2022-05-18Expires on 2024-05-18Updated on 2022-06-06",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "July 30, 2022, 02:03:10 AM",
      "body": "Quote from: ScamViruS on July 29, 2022, 06:19:08 PMI got a message on telegram about this website. I kept talking to him to know the details, and followed the steps he told me. I created an account on this website using my other extra phone, and tried to send the screenshot as he said, but he already deleted his telegram account! Lol! Now the question here is why he deleted the telegram? Or already got the victim? This website is unknown and what I found after visiting it seems fake website to me.I never accept any invitation on telegram to sig up to any site much more on casino based that I am not familiar with, casinos should not be promoted on telegram it should be openly promoted on related gambling platforms because there's money at stake here and reputation is what defines a casino QuoteThis website can be very risky for new gamblers. So if you get any such message, then don't deposit any fund on this website. Because if you deposit, you will never get that money back.Website: Code:https://10.w88hash.vip/#/register?code=88967405Not only for new gamblers but for old gamblers too we should not entertain this kind of unpopular casino these are what you called fly-by-night casino operations, now you see now you don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 30, 2022, 02:15:31 AM",
      "body": "Quote from: dothebeats on July 29, 2022, 06:38:15 PMThe URL itself already looks suspicious. I mean, look at that TLD. These kinds of TLD are mostly used for scam sites or phishing sites <...>Quote from: Desmong on July 29, 2022, 07:21:26 PMThere are so many gambling sites on this forum and jumping on this kind of suspicious site <...>Quote from: Zackgeno96 on July 29, 2022, 08:03:48 PMThe URL looks suspicious <...>Quote from: nakamura12 on July 29, 2022, 08:20:17 PMThe URL is indeed suspicious when you look at it and when that person tells you about the site then deleted the account right away. My thoughts is that he thinks he got you and he possibly thought you fall for itQuote from: acroman08 on July 29, 2022, 08:33:35 PMaside from the URL, the website itself is highly suspicious. who in their right mind would design a gambling site like that? Quote from: Slow death on July 29, 2022, 08:54:13 PMhonestly who would use a site with that domain name: 10.w88hash.vip? I realized right away that this is a temporary site for scams <...>Quote from: Johnyz on July 29, 2022, 09:17:00 PMSo many scammer on telegram where they send an obvious scam site<...>Quote from: FatFork on July 29, 2022, 09:35:08 PMI can't even imagine why anyone would spend time and resources to build something like this. The site is ugly and definitely looks like a money grabbing site.Well, hopefully, no one is stupid enough to deposit money there. Quote from: ultrloa on July 29, 2022, 10:06:51 PMThe way how that people introduce the site plus how suspicious the link is for sure it will give bad tase to the person who could see it. If a site arouses the slightest suspicion in me, I don't deposit a single satoshi. And I am referring to sites that are less suspicious than this one, which is not only suspicious, but also made in quite unprofessional way.I hope people will clearly see that it is suspicious and stay away from it. The thing is that there are always the clueless or naive who end up falling for it but I don't think there will be many in this case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "July 30, 2022, 03:12:18 AM",
      "body": "Thanks for this sharing mate because there are still new to this forum or some players that love exploring from one site to another site that sometimes leads them to this kind of site.I also wanted to keep this to my blocked list so I will never got a chance even checking this site.it is an obvious scam attempt  as why needed to delete the telegram when they are not having something to hide for?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}