{
  "id": "topic_5462876",
  "title": "mvdheuvel1983",
  "author": "mvdheuvel1983",
  "created_time": "August 11, 2023, 06:52:55 AM",
  "content": "Michael Saylor stated that people buy Bitcoin at the price they deserve. Just a few days ago, Adam Back made a bet on Twitter that Bitcoin would reach $100,000 by March 31st, 2024. Here's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Since the price will be so high, the average person might not be able to afford a substantial amount of it. As a result, they might seek alternatives, potentially hindering global adoption. Could the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462876",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "August 11, 2023, 07:00:00 AM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMCould the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?The question is: if the price is going up and getting high, it's because there are many people wanting to buy it and few wanting to sell it. If it gets extremely high, and if people lose interest in buying it, that could cause the value to start going down. Starting to have more people selling than buying, and that motivates a drop in value. If this happens, the value drops to a level where there is a balance between the number of sellers and the number of buyers.This actually happens today, bitcoin was worth 60k, but as demand has dropped today it is worth 30k. If the price stabilizes at these levels (+100k), it means that there is a constant balance between sellers and buyers.In short, this is actually not a problem. We just have to be aware that the value of bitcoin is not stable and can change quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "August 11, 2023, 07:06:12 AM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMCould the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?No I think it will even push for adoption because many people will think like yeah it continues to grow in value and if they do not invest now they would certainly missed out. Look the adoption rate of bitcoin from 2020 halving period till now you would see that the number of new investors have increased compare to before then and the over 10x price increase then didn’t stop them from investing. A clearer example again is the gold which no matter how expensive it is now people still want to buy it if they get the opportunity. Bitcoin is even easier to invest in no matter the price since it can be bought In fractions (satoshis) and not necessarily a whole one. If it would have been just a whole bitcoin that is buyable then I would have said it will limit adoption but with its fraction been available as low as 5$ then it wouldn’t cause any problem if the price increases, rather it will even create more demand and adoption due to FOMO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 11, 2023, 07:22:00 AM",
      "body": "Do not look at the price as one bitcoin, but rather 100,000,000 satoshi, and therefore if the price of bitcoin rose to 120 thousand dollars, then the satoshi would be equal to 0.0012 dollars, and anyone in the world could still buy bitcoin at such levels.If we assume that the obstacle will be when the price of 1 Bitcoin is equal to 1 Satoshi, then this means that Bitcoin needs to rise sharply, which will not happen in the next 100 years, and most of all of us will not see this thing.The biggest obstacle is not to sell bitcoin or to drop its price sharply, as everyone now uses bitcoin more as an investment than as a currency for payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "August 11, 2023, 07:54:11 AM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMMichael Saylor stated that people buy Bitcoin at the price they deserve. Just a few days ago, Adam Back made a bet on Twitter that Bitcoin would reach $100,000 by March 31st, 2024. Here's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Since the price will be so high, the average person might not be able to afford a substantial amount of it. As a result, they might seek alternatives, potentially hindering global adoption. Could the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?Really depends on how you look at it, it bitcoin is to be treated as money then it doesn't matter what the price will be. But if you see it as a asset then obviously, they will be looking at $100k or higher every other bitcoin cycle and as you have said, many are speculating that we are going to hit it in the next bull run.And we can't do anything about it as supply is really dwindling every bitcoin halving. So there will only be a few person around the world that can earn or hold bitcoin and maybe used it as whatever they wanted it to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "August 11, 2023, 08:05:11 AM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMHere's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Since the price will be so high, the average person might not be able to afford a substantial amount of it. As a result, they might seek alternatives, potentially hindering global adoption. Could the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?The basic logic is correct that the higher the price of Bitcoin will make it difficult for people to be able to buy Bitcoin, but based on the mindset of experienced investors in their investment activities, they can judge when the price rises to touch the new ATH of up to $100k, this could be the cause of people being more logical in thinking about Bitcoin where people are increasingly aware that Bitcoin is a good investment coin to invest in.When the mindset is like that, this can accelerate global adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "August 11, 2023, 08:09:42 AM",
      "body": "If bitcoin reaches more than 500k usd, then definitely there will be debate and contest among people to acquire 0.001 Bitcoins. The global adaptation won’t stop though the price reached very high. People will still treat this as a valuable asset and will hold it to make profits. Yes the quantity of Bitcoins that are being traded now daily will be reduced due to the high price. Currently 500k usd price is very long way. Let’s see what price target Bitcoins reach in the next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 11, 2023, 08:18:03 AM",
      "body": "Quote from: Nrcewker on August 11, 2023, 08:09:42 AMIf bitcoin reaches more than 500k usd, then definitely there will be debate and contest among people to acquire 0.001 Bitcoins. The global adaptation won’t stop though the price reached very high. People will still treat this as a valuable asset and will hold it to make profits. Yes the quantity of Bitcoins that are being traded now daily will be reduced due to the high price. Currently 500k usd price is very long way. Let’s see what price target Bitcoins reach in the next bull run.Then 0.001 BTC worths $500 and it will be dream of many people that how they can revert time to go back to 2023 to work and use about $30 to accumulate just 0.001 BTC.It is like we are jealous with people knew about Bitcoin circa 2013 or 2016 and with people who could work and receive very good amount of BTC from signature campaigns after a week or a month. We are already in Bitcointalk forum, have chances to join good signature campaigns and the important tasks for us is holding our BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "August 11, 2023, 08:23:32 AM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMMichael Saylor stated that people buy Bitcoin at the price they deserve. Just a few days ago, Adam Back made a bet on Twitter that Bitcoin would reach $100,000 by March 31st, 2024. Here's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Since the price will be so high, the average person might not be able to afford a substantial amount of it. As a result, they might seek alternatives, potentially hindering global adoption. Could the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?I think if we talk about adoption, bitcoin is being used as what it is design, payment method or scheme. So it that happens, then the price will not be a factor here? if people are willing to used it as just $10 dollars worth and not look at the price in exchanges, then it's good in my opinion. So I guess your argument is flawed is the beginning. It can still be adopted globally if it will be just used like what Satoshi wanted in the beginning.The thing is that it become a commodity, store of value and an asset that's why we have to look at the price and if we are willing to spend it or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ayers",
      "created_time": "August 11, 2023, 08:24:02 AM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMCould the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?The value of any asset depends on supply and demand, when demand outstrips supply pushes the price up and that's one of the many reasons why people always want bitcoin to be global adoption. But if you think that bitcoin's high value will hinder global adoption, it means that the price of bitcoin will never go up because the demand is not there. So your thinking is incorrect and completely opposite of what people are expecting. 1 bitcoin= 100.000.000 satoshi. No one is forcing us to buy a full 1 bitcoin, we can buy as many satoshis as we want, even if bitcoin hits $1 million.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "August 11, 2023, 08:30:33 AM",
      "body": "You know why Bitcoin has so many decimal values? To make it adopted globally even after it goes to 1 million USD per Bitcoin. You can buy any x amount of satoshis.1 satoshi = 0.00000001 Bitcoin. So when Bitcoin reaches $10,000,000 1 satoshi will be equal to $1. And still will be able to buy by the normal person and spend it like a normal person.In fact, it will become much more easier to use as the movement of big amount will stop and smaller transactions will be done on new technology or lightning network and we all will know that 1 satoshi is what we need to pay for $1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "August 11, 2023, 01:22:50 PM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMMichael Saylor stated that people buy Bitcoin at the price they deserve. Just a few days ago, Adam Back made a bet on Twitter that Bitcoin would reach $100,000 by March 31st, 2024. Here's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Either they bet or not, bitcoin will get to $100,000 and beyond next year, we know this because of halving which bullrun will follow immediately, making bitcoin market price prediction is what someone like me and the other people could just have predicted, that is bot what increases bitcoin value when people bet over it, not even when the prediction is coming from prominent people, bitcoin market is determined by the demand and supply while the value increases over the period of marking halving and nothing more.Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMSince the price will be so high, the average person might not be able to afford a substantial amount of it.An average person who have upto $10 or more can be able to have bitcoin in his wallet, even if the worth of bitcoin turns a million dollars, anyone can have access to exchaging and holding it in their own capacity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 11, 2023, 01:45:21 PMLast edit: August 11, 2023, 02:08:56 PM by vv181",
      "body": "What the hell did you mean? It is basic Bitcoin knowledge that it can be bought in a fraction amount. And it is a known regular misconception about Bitcoin.Your account is made in 2013, assuming it is true, I can't believe you still fall, in fact, worrying, about that kind of wrongful information. Unbelievable. People buy gold, but they ain't buy a ton of it, they buy a fraction, and it also applies to another commodity. What make you think it can't be applied to Bitcoin!? But let's say your concern is simply that people can have a substantial amount of bitcoin. I do not know how much you pictured when you said substantial, but it is just how the market works. There will be a buyer and seller. People did not essentially has to own a significant amount of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "August 11, 2023, 01:52:06 PM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMMichael Saylor stated that people buy Bitcoin at the price they deserve. Just a few days ago, Adam Back made a bet on Twitter that Bitcoin would reach $100,000 by March 31st, 2024. Here's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Since the price will be so high, the average person might not be able to afford a substantial amount of it. As a result, they might seek alternatives, potentially hindering global adoption. Could the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?Could missing the bandwagon deter people from using Bitcoin? Perhaps. They might demur crypto feeling as they missed a profitable opportunity. But that is not actually as pertinent to global adoption as you might think. Regression and instability in price is more harmful to adoption than having a high price per coin.If anyone believes that holding onto their inflationary fiat would be a wiser investment choice than adopting a rising asset, it's rather on them. Most people don't think this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "August 11, 2023, 02:02:00 PM",
      "body": "This is why one bitcoin is divisible upto eight decimal places and we are talking about satoshis  which will be carried by \"common\" people. Indeed the cost of 1BTC at this current price is wet dream to most people in my country coming from the middle class. For them a fractional amount is enough to run their yearly stuff.Now coming to the fact why celebs are saying such big numbers, this is because they are bullish on its price and they want it to rise so they get a chance to sell and book some profit.Take that with a load of salt though, final decision of how your interpret these messages are yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "August 11, 2023, 02:32:22 PM",
      "body": "I believe these predictions are what will create adoption. People do not want to miss out. So when they see these predictions, it would motivate them to buy Bitcoin now so they can make more profit later on. I mean who wouldn't want to hold Bitcoin if he believes that Bitcoin will be worth 100k plus in one year? The negative part of Bitcoin getting to 100k+ is that people who do not have an understanding of what Bitcoin is will further feel it's only for the wealthy. I'm saying this because a lot of people do not understand the divisible nature of Bitcoin. They don't know that you can buy Bitcoin worth $50. So I feel when they see that Bitcoin is at $100k+ it might further discourage them from affiliating with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "August 11, 2023, 03:38:28 PM",
      "body": "I say that the relationship between the price of Bitcoin and its adoption is not direct or linear… Well, while a higher price can generate interest and attention in it, the global adoption of BTC is influenced by a number of factors, such as its usefulness  security, regulation, ease of use and public awareness. It is true that as the price of Bitcoin increases, it may become less affordable for the average person... But, Bitcoin is divisible up to eight decimal places, which means that even if a person cannot buy a whole Bitcoin, they can buy small fractions, known as satoshis, allowing greater inclusion and access to investment in Bitcoin. I feel that the future of Bitcoin and its worldwide adoption depends on a complex interplay between financial, technological, regulatory and psychological factors... Although price is an important aspect, it is not the only factor that determines long-term success and adoption of Bitcoin as I said above. .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "August 11, 2023, 04:30:18 PM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMMichael Saylor stated that people buy Bitcoin at the price they deserve. Just a few days ago, Adam Back made a bet on Twitter that Bitcoin would reach $100,000 by March 31st, 2024. Here's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Since the price will be so high, the average person might not be able to afford a substantial amount of it. As a result, they might seek alternatives, potentially hindering global adoption. Could the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?They do not necessarily need to buy 1 bitcoin to become holders of bitcoin, they can always buy in small quantities as they can handle financially and gather it. When bitcoin gets to that price, I believe that it may no longer be attractive for investments, people may consider other alt coins for that purpose or hold on to their fiat. At that stage, it may not have an effect on global adoption, because bitcoins will then be adopted for the other reasons and other benefits that it can provide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "August 11, 2023, 06:40:59 PM",
      "body": "Quote from: mvdheuvel1983 on August 11, 2023, 06:52:55 AMMichael Saylor stated that people buy Bitcoin at the price they deserve. Just a few days ago, Adam Back made a bet on Twitter that Bitcoin would reach $100,000 by March 31st, 2024. Here's a concern I have, do you think the predicted increases in Bitcoin's price to $100,000, $200,000, $500,000, etc. will limit its global adoption? Since the price will be so high, the average person might not be able to afford a substantial amount of it. As a result, they might seek alternatives, potentially hindering global adoption. Could the excessively high price lead people to feel like they missed out, causing them to hold onto seemingly worthless fiat currency?The average person does not need to have a large amount of bitcoin to own one. That is why we also have satoshis. If the price has risen so dramatically in such a way with such great value, there should be even more motivation for them to keep at least a portion of it, no matter how little they can afford. If one buys while the price is rising, and the market continues to rise, the person's bitcoin value will have increased over time. It is never too late to acquire one, and the future price of bitcoin is expected to boost its adoption and rather than decreasing its use and acceptance rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "August 11, 2023, 08:26:14 PM",
      "body": "No matter the price of Bitcoin, I think people are still going to buying because it can be fractuioned into small units which is one of the thing that makes it easily affordable no matter the amount you want to buy. Tye price is gradually increasing and we hope that it will reach the price that we have predicted it to reach. If Bitcoin eventually reach like $100k, I think that is when people will start seeing good reason to buy Bitcoin especially people that had been discriminating the system that it will crash. The same happen when Bitcoin was below $1, many agitated that the price will never reach a $1 and now we can see that the price keeps growing like the trees in the forest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}