{
  "id": "topic_5415016",
  "title": "Zilon",
  "author": "Zilon",
  "created_time": "September 26, 2022, 08:43:11 PM",
  "content": "I am asking based on the country where i come from. It's sad to say no one cares about doing it right anymore, everyone is carried away by what the stand to gain, their immediate benefit not minding the impact in the near future.In a country where everyone is been monetised and selfishly driven will good governance be enough to fight corruption. I ask this because it has gone beyond the sphere of the political stakeholder as it dwells even in the cabal of almost every citizen. making good governance will require stepping on toes.By 2023 there will be a transition of power and if the choice of the people eventually emerges as the winner, following the current state of an entire country i ask will good leadership be enough to fight corruption in a country where everyone is corrupt?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415016",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "September 27, 2022, 04:29:45 PM",
      "body": "If i will reply you base on the the topic to this thread the answer is \"yes\" if the head is good then the whole body will also function as expected, why should a country be surrounded by wicked and corrupt leaders? There should be a change in power if truly they want a change, it's high time the masses begin to voice out against the misfortunes happening in political era with those in government, they are the people's employer who showed interest to serve them and therefore they have the right to fight for their rights if taken, a closed mouth is a closed destiny, this is something common to every country in the world and that's why you see some regions mounting on agitation against bad governance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "September 27, 2022, 05:59:39 PM",
      "body": "Sadly, good leadership alone isn’t nearly enough to hinder and/ fight corruption. In order to effectively fight corruption, there must also be accountability and over sight in government spending that should be available to public view upon request. A government not accountable to its citizens would get away with almost everything. There should also be a vibrant opposition to check mate and keep the government in power on its toes. The press is also instrumental in holding the government accountable and should be independent from government interference. That way, the press would be free to investigate and expose any fraudulent and/ illegal acts by the government. With these factors in place, there might just be a shot at fighting corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "September 27, 2022, 06:49:35 PM",
      "body": "^^^ Well, if you don't think you are having enough success, just lead by turning your back on everybody. At least you will feel good that way... even if it is corrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "September 28, 2022, 02:05:53 PM",
      "body": "Quote from: Zilon on September 26, 2022, 08:43:11 PM i ask will good leadership be enough to fight corruption in a country where everyone is corrupt?Good leadership is the most important force in the quest to fight and defeat corruption. Good leadership has the capacity to breed good followership. Although it would be difficult for a good leader to fix a corruption-soaked country if he sets a good example it would gradually spill over to the entire nation. If the head is not spoilt, then the body would remain sound. If the president, governor, legislatures, and judges are not corrupt, other officials would be scared to uphold or engage in corrupt practices.Quote from: Iroh on September 27, 2022, 05:59:39 PMSadly, good leadership alone isn’t nearly enough to hinder and/ fight corruption. In order to effectively fight corruption, there must also be accountability and over sight in government spending that should be available to public view upon request. A government not accountable to its citizens would get away with almost everything. It is good leadership that would set up these structures of accountability and anti-corruption mechanism. Without a government with the willpower to fight corruption and put in place checks and balance systems to curb corruption, these important measures wouldn't be put in place.  QuoteThere should also be a vibrant opposition to check mate and keep the government in power on its toes. The press is also instrumental in holding the government accountable and should be independent from government interference. That way, the press would be free to investigate and expose any fraudulent and/ illegal acts by the government. With these factors in place, there might just be a shot at fighting corruption. Good leadership also entails upholding freedom of speech and expression. A good leader wouldn't suppress opposition with intimidation and threats but would listen to their constructive criticism and make the necessary amendments. A good leader would not see opposition as enemies but as an important information bank and a reliable check and balance system. Therefore, good leadership is the stepping stone to winning the fight against corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 28, 2022, 04:49:32 PM",
      "body": "Quote from: Zilon on September 26, 2022, 08:43:11 PMI am asking based on the country where i come from. It's sad to say no one cares about doing it right anymore, everyone is carried away by what the stand to gain, their immediate benefit not minding the impact in the near future.In a country where everyone is been monetised and selfishly driven will good governance be enough to fight corruption. I ask this because it has gone beyond the sphere of the political stakeholder as it dwells even in the cabal of almost every citizen. making good governance will require stepping on toes.By 2023 there will be a transition of power and if the choice of the people eventually emerges as the winner, following the current state of an entire country i ask will good leadership be enough to fight corruption in a country where everyone is corrupt?It is one of the primary step to fight against the corruption but its not going to be an easy especially when the existing system is corrupted and government officials are supporting it and make benefits out of it there is going to be opposition against the one who wants to clean the system back into the non corrupted stage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "September 28, 2022, 06:01:37 PM",
      "body": "Good leadership is the needed agent to fight corruption any where in the world. Corruption is a dead trap of development, no county can enjoy change and development without tackling the root of corruption of that country. Hence we need a good leader to fight corruption, good leader can only emerge through free and fair election. Some leaders fail in their fight against corruption because the process that brought them into power was corrupt processes. You don't expect such leader to fight corruption, all we need is a sincere leader who care about the people and who is willing to tackle 9corruption by all means. Until we have good leaders in particular lace don't expect any change in the system, that corruption has eaten off.  A good leader we eliminate corruption in any part of the world",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "September 28, 2022, 06:07:54 PM",
      "body": "Quote from: Zilon on September 26, 2022, 08:43:11 PMI am asking based on the country where i come from. It's sad to say no one cares about doing it right anymore, everyone is carried away by what the stand to gain, their immediate benefit not minding the impact in the near future.In a country where everyone is been monetised and selfishly driven will good governance be enough to fight corruption. I ask this because it has gone beyond the sphere of the political stakeholder as it dwells even in the cabal of almost every citizen. making good governance will require stepping on toes.By 2023 there will be a transition of power and if the choice of the people eventually emerges as the winner, following the current state of an entire country i ask will good leadership be enough to fight corruption in a country where everyone is corrupt?My question is, do you believe that those who are fighting corruption will not be corrupt when they get this position because, in many corrupt countries, corruption has become a culture that is hard to get rid of.-> there are only 2 ways to stop corruption, the first is the death penalty and the second is social punishment;- The death penalty for corruptors has been implemented by the governments of Vietnam, China, and Iran, regarding the impact of course it is quite effective because they managed to do it hard.- while social punishment, it seems that other countries are trying to implement it but it is not very effective because this social punishment does not affect the people closest to the corrupt, such as their wives and children.It is not easy for a government official to be free from corruption because the pressures of life and the temptation of abundant wealth often make people forget that the corruption they are doing is wrong. all we can do is keep praying that the next elected leaders are not corrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "September 28, 2022, 06:11:18 PMLast edit: October 01, 2022, 09:07:22 PM by Lordhermes",
      "body": "Quote from: Zilon on September 26, 2022, 08:43:11 PMI am asking based on the country where i come from. It's sad to say no one cares about doing it right anymore, everyone is carried away by what the stand to gain, their immediate benefit not minding the impact in the near future.In a country where everyone is been monetised and selfishly driven will good governance be enough to fight corruption. I ask this because it has gone beyond the sphere of the political stakeholder as it dwells even in the cabal of almost every citizen. making good governance will require stepping on toes.By 2023 there will be a transition of power and if the choice of the people eventually emerges as the winner, following the current state of an entire country i ask will good leadership be enough to fight corruption in a country where everyone is corrupt?I believe your county must exert every effort to hold free and fair elections in order to install good leaders. Additionally, the electorate must be made aware of the importance of supporting candidates free from allegations of corruption. I have a strong conviction that your nation will elect an excellent leader in 2023 who will make the fight against corruption his top priority.If your county misses it, corruption cases will plague your county for a long time starting in 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "September 28, 2022, 06:30:55 PM",
      "body": "To fight it, you need to know what corruption is. Corruption is so inbred these days, that there are loads of people who say to themselves, \"If I see it, it's mine; I simply don't have it in my possession, yet.\" Many others would call this some kind of corrupted thinking.How much corruption is compromise in government?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "September 28, 2022, 07:14:02 PMLast edit: September 30, 2022, 01:31:01 PM by Lordhermes",
      "body": "Quote from: BADecker on September 28, 2022, 06:30:55 PMTo fight it, you need to know what corruption is. Corruption is so inbred these days, that there are loads of people who say to themselves, \"If I see it, it's mine; I simply don't have it in my possession, yet.\" Many others would call this some kind of corrupted thinking.How much corruption is compromised in government? like the usual say, when corruption favour an individual you call it a favor.  When it's against you you cry of bad government, people compromise corruption only when they benefit them. And that's what is killing the third-world countries, they wear corruption to work, market and church. Hence, corruption is compromised when the leaders see every opportunity given to them to serve as a means of embezzled the common wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "September 28, 2022, 07:17:59 PM",
      "body": "Quote from: Zilon on September 26, 2022, 08:43:11 PMBy 2023 there will be a transition of power and if the choice of the people eventually emerges as the winner, following the current state of an entire country i ask will good leadership be enough to fight corruption in a country where everyone is corrupt?Good leadership is not enough to fight corruption in every setting and to fight corruption the people themself need to have the seal of putting an end to corruption and work towards it because most of these so-called leader are not ruling the country. They are all into cults and whatever their godfather says is the final. If any country wants to fight corruption they need to give the people a government that works for them not them working for the government by implementing a constitution that will make it happen and also prosecute all the corrupted leaders fairly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "September 28, 2022, 09:31:27 PM",
      "body": "In the old days, like the times of monarchies, it was common for wealthy and powerful people to be advisors to the king. It was the same before in the roman senate and it was like that later, mostly up to the early 20th century. Why is being rich and powerful important? Because such people already have all they need and can dedicate their time to the state. Communism tried put it all backwards giving important positions to lower classes and you can observe a similar situation in Africa and South America where poor people get their votes through revolutionary slogans. When you allow people who had nothing all their lives to rule you can be sure they'll try to use their position to finally feel what it's like to have some money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "September 29, 2022, 03:39:35 PM",
      "body": "yes,, good leadership of course will reduce corruption .. but it will not eliminate corruption in the country .. even in a country that adheres to communist ideology like China which hates corruption, corrupt practices can still be found, but it is not as massive as it is in African countries.. to eradicate corruption can't just be with the good leader, but it must also start from people's awareness to fight corruption, but of course it is very difficult to achieve",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "September 29, 2022, 08:27:20 PM",
      "body": "I want to answer you based on the context of what you wrote and what is happening in the country in question. According to your post, good governance is not enough to fight corruption. It takes a man who will be undemocratic to some extent to fight corruption. In a democratically corrupt country, if a good leader arrests a corrupt person, the law doesn't permit him to sentence the person, he must pass the arrested through the magistrate which is assumed to be corrupt also. The magistrate will accept bribe and discharge the person inside the same society. The good leader will catch another person and the circle repeats like that, so it takes more than goodness to fight corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 29, 2022, 09:29:33 PM",
      "body": "Good leadership is suitable for rehabilitating the collective mind of individuals in society. This is suitable for establishing a good society on the ruins of a society destroyed by corruption.Good leadership contributes to the establishment of a coherent system through deterrent legislation and laws. At the same time, the society elevates through the establishment of values that reject corruption and the corrupt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 02, 2022, 06:07:38 PM",
      "body": "Is good leadership enough to fight corruption?Good leadership usually IS the corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 02, 2022, 06:24:17 PM",
      "body": "I want to say yes but it will be little dreamer  In my country there is a idiom \"fish stinks from the head\". If the leader fight for his citizens he will get progress. But was it enough for the all corruption?  Absolutely isn't! For instance, many public institutions in my country are corrupted and need to be cleaned up and completely overhauled in order to progress. People expect great success in a short time. However,  years of corruption will not be resolved in a short time. Yes, you can be successful in a long time, but it seems impossible in a short time. And in my country no one can be patient therefore i will say no",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 03, 2022, 11:33:13 AM",
      "body": "Good leadership can annihilate corruption at once but most of us don't really know what good leadership is. so, we ended up voting for the wrong person whom we thought a good leader, and most of the time we don't have such candidates, and often we fall into someone if not the worse corrupt leader than the previous one, we voted a person the same as him. A good leader has a system to tackle this corruption and completely defeat it through studying and taking action until no corruption will remain in his administration. A good leader will be followed by all of his workers until the person who has the easiest job in the community will follow him and obey him and a bad leader is the opposite of all of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahmad2nd",
      "created_time": "October 03, 2022, 01:01:50 PM",
      "body": "This reminds me of chinese president Xi Jinping.He said in his campaign, for the anti-corruption movement. this movement seems to run smoothly without any pros and cons, the main reason is that the center of power and political power is only in one point.In one year of his tenure, he has convicted many people involved in corruption including senior officials and several military officers.this shows Xi jinping's determination and strength despite the controversy to suppress the opposition. however, what is certain is that he is able to bring his country to be more developed and very developed.Speaking of corruption, in general corruption occurs when there is an opportunity, abuse of power is one of the causes of corruption. however, a good leader will take responsibility and fight corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}