{
  "id": "topic_5448142",
  "title": "elevates",
  "author": "elevates",
  "created_time": "April 09, 2023, 12:45:30 PM",
  "content": "Since RBI has been against Bitcoin and crypto in particular from 2018 till today, I wanted to know how much they spent in general for minting INR every year. All this blah blah by the existing RBI governor against crypto will go into the gutter if you read the amount. For the financial year 2022, the amount in INR is 4984.8 Cr. Whereas the amount for printing money in 2021 was INR 4012.09 Cr. The amount might sound too much for a country that is considered a third world country globally. I found this information from a 2022 article.One of the biggest reasons for approximately spending INR 5000 Cr by RBI is to stop fake currency. Do you know CBDC can be counterfeited? If not then please this topic - Did you know the significant difference between Bitcoin and CBDC Can RBI stop fake CBDC circulation? Will they spend such kind of amount to safeguard it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448142",
  "comments": [
    {
      "author": "teosanru",
      "created_time": "April 09, 2023, 12:51:18 PM",
      "body": "Quote from: elevates on April 09, 2023, 12:45:30 PMSince RBI has been against Bitcoin and crypto in particular from 2018 till today, I wanted to know how much they spent in general for minting INR every year. All this blah blah by the existing RBI governor against crypto will go into the gutter if you read the amount. For the financial year 2022, the amount in INR is 4984.8 Cr. Whereas the amount for printing money in 2021 was INR 4012.09 Cr. The amount might sound too much for a country that is considered a third world country globally. I found this information from a 2022 article.One of the biggest reasons for approximately spending INR 5000 Cr by RBI is to stop fake currency. Do you know CBDC can be counterfeited? If not then please this topic - Did you know the significant difference between Bitcoin and CBDC Can RBI stop fake CBDC circulation? Will they spend such kind of amount to safeguard it?This is quite interesting, i am reading this number for the very first time. Obviously printing money is expensive this must only be the direct cost, i think the cost of transportation of money from various banks to branches etc. Would eventually sum up to be very high even much higher than this number as well. Also I am really reading for the first time that even CBDC can be forfeited so first RBI will spend so much on implementation of the system and then an amount equally high on security maintenance of the system as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "April 10, 2023, 07:30:23 AM",
      "body": "Another central bank behaving like the others. They spend millions every year just to safe guard the printing process. Still a lot of counterfeit currency comes under circulation. Counterfeiting is a big industry. Just for example China became the second big economy just by creating cheap duplicate of most expensive products in the market. I am not sure whether CBDC can be counterfeited but who know it can be too as in the end it is a digital version of fiat currency",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "April 10, 2023, 04:53:25 PM",
      "body": "Quote from: elevates on April 09, 2023, 12:45:30 PMSince RBI has been against Bitcoin and crypto in particular from 2018 till today, I wanted to know how much they spent in general for minting INR every year. All this blah blah by the existing RBI governor against crypto will go into the gutter if you read the amount. For the financial year 2022, the amount in INR is 4984.8 Cr. Whereas the amount for printing money in 2021 was INR 4012.09 Cr. The amount might sound too much for a country that is considered a third world country globally. I found this information from a 2022 article.One of the biggest reasons for approximately spending INR 5000 Cr by RBI is to stop fake currency. Do you know CBDC can be counterfeited? If not then please this topic - Did you know the significant difference between Bitcoin and CBDC Can RBI stop fake CBDC circulation? Will they spend such kind of amount to safeguard it?Wow, that's quite interesting. Almost 4000 crore INR every year to print money and then they call bitcoin not friendly to nature.The amount of paper required to print such kind of money, I wonder how many trees are being cut for that.From one point of view, it's good that the government is taking action against counterfeit notes but we must know whatever we try we will fail.Counterfeit notes will be available in the market at some point of time. This reminds of the recent web series Farzi which shows how people create counterfeit notes and use them in the market.Bitcoin solves this problem of counterfeiting but our government decides to prohibit it's use.At least now they have understood they can't completely ban it and has started to embrace blockchain technology by creating a CBDC of their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "April 11, 2023, 11:55:32 AM",
      "body": "Quote from: pawanjain on April 10, 2023, 04:53:25 PMThis reminds of the recent web series Farzi which shows how people create counterfeit notes and use them in the market.Bitcoin solves this problem of counterfeiting but our government decides to prohibit it's use.At least now they have understood they can't completely ban it and has started to embrace blockchain technology by creating a CBDC of their own.When you have a starcast like Vijay Sethupathy, Shahid Kapoor & Kay Kay Menon with an epic storyline then it is bound to be a hit. The maker of Farzi and Family man are same. In Farzi there is a narration by him about counterfeiting business. I am not sure whether it is true or not but after prostitution the second biggest and oldest business is counterfeiting. The problem with Bitcoin is that it cannot be controlled by a single entity and this is why the government does not like it. The banks and financial institutions do know the benefits but cannot copy it's ecosystem as it will be the end of their existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}