{
  "id": "topic_5400940",
  "title": "Marvell1",
  "author": "Marvell1",
  "created_time": "June 01, 2022, 04:23:23 AM",
  "content": "I have a friend who invests in cryptocurrency like me, he is an investor hold Luna and he has also lost quite a bit because of Luna. But what's more sad is his 2 best friends. Those two are also hold a lot of Luna's and Luna's crash causes them to lose all their possessions and become insane. As he said, one person has gone through the crisis and one has not. Those two guys who invested in Luna were all from my friend's advice. He said it was he who indirectly harmed them, money can be earned, but his friend are gone.This is a sad story that I have heard. Through this story I want everyone to know 1 golden rule in investing is: never give financial advice to anyone. By the time you give them financial advice, you may feel like you're one step ahead of them, but if that advice is wrong, you could be the one hurting them.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400940",
  "comments": [
    {
      "author": "cabron",
      "created_time": "June 01, 2022, 05:14:32 AM",
      "body": "Just tell him them there is LUNC 3.0 and this time when its reaching to its ATH, you advice them to sell.   I have experience the same because it felt like I am a pro when I profited a lot during the bull market so I advised them to hold but when I told them to sell already.  He also object because he remembered me saying to HODL. Now it seem like my fault. It took me days to convinced him to sell and when he finally sold the coins, he still blamed me for telling him late. The golden  rule is to sell when the price hits ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "June 01, 2022, 05:17:49 AM",
      "body": "I think we can give financial advice to anyone.But we must also emphasize that investing also contains risks and explain that investing only uses the money we can afford so that if something happens to our investment, it will not make us suffer a lot of losses.If we can do that, I think they will understand and will not be so greedy in their pursuit of profit that they will not try to spend more money if no information can benefit them.But if you decide not to give them financial advice, that's also okay because we leave it entirely up to them and hope they can do their research before deciding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 01, 2022, 05:21:47 AM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AMhe is an investor hold Luna and he has also lost quite a bit because of Luna.\"Quite a bit\"? The shitcoin did a -100%, he's lost every cent he put.Quote from: Marvell1 on June 01, 2022, 04:23:23 AMThrough this story I want everyone to know 1 golden rule in investing is: never give financial advice to anyoneJust because your friend told them to buy a worthless, centralized, opaque, game theory failing shitcoin, it didn't mean they should; and even if they were convinced, your friend shouldn't give advice, not because he might hurt someone, but he may have no idea what the hell he's bought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 01, 2022, 05:52:20 AM",
      "body": "Well, there are actually two golden rules.Golden rule number 1: don't lose money.Golden rule number 2: don't forget rule 1.https://www.investopedia.com/financial-edge/0210/rules-that-warren-buffett-lives-by.aspxRegarding the Luna case that you mention, I would add another: don't invest in junk. That way, it will be easy for you to comply with rule 1 and rule 2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "June 01, 2022, 05:57:50 AM",
      "body": "Yea, I also learnt that the hard way. In the beginning I was very eager to \"teach\" other people on how to make money with Crypto currencies. I helped a friend of mine to buy bitcoins, but he did not tell me that he used \"debt\" to fund this. So, the Bitcoin price dropped with more than 70% and it took almost 3 years to recover. He had to pay off the interest on the debt and he had to sell early... because he could not afford to pay the interest anymore. A few days after he sold his coins, the price started a quick recovery and he lost the opportunity to make 650% profit on those coins. So rule number 2 ==> Never use Debt to fund your Crypto investments!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "June 01, 2022, 06:13:28 AM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AMnever give financial advice to anyone.You can actually give but not to the point that you forcing it to someone else's throat. If there's any advice you can give, it's to let them know what you're actually doing, what resources you're reading, and what to avoid. Of course, you can only speak when requested; otherwise, you would be spending your time discussing topics to them that are irrelevant.Plus, as a general rule of thumb, what works for you could not work for others, right? This is especially true in the financial world, where everyone has a different risk appetite, financial situation, and depth of understanding.Or perhaps, you can rudely say to get the hell out of my face and that your investment isn't my business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "June 01, 2022, 07:14:55 AM",
      "body": "Quote from: cabron on June 01, 2022, 05:14:32 AMThe golden rule is to sell when the price hits ATH.Golden rules differs based on individual interpretation, another person can come and say his golden rule is buying when everyone is panicking and has record of that been profitable to him. In my personal opinion, i don't believe there's ever an ATH especially as this is cryptocurrency and the price of a coins differs in various exchange and the tracking sites usually give an average price so it's basically impossible ti get the ATH. Whatever your golden rule is, the most important is to avoid losing money and not investing more than you can endure Incase the investment doesn't go your way. The case of Luna should teach us all something, as for company with physical representative like CEO and the rest, always take note of this individuals behaviour as it was discovered that the Founder of Luna had a stubborn behaviour and doesn't take criticism or constructive advice so well. He was warned about thw exact attack that cause the collapse of Luna 1.0. Even after the scenario has played out, he was advised on how to go about the recovery of the project but he insisted on forking (creating more shitcoin), just pathetic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "June 01, 2022, 07:40:44 AM",
      "body": "Regarding the rule of investment I would say the most important rule is to do not go all-in for any asset no matter how profitable is this and have money management meant planning for yourself to stick to it, so you will not have huge problems even if a price collapse happens in the market. Also, I'm not sure how your friend is thinking about Luna but as far as I can see everything regarding this project launching Luna 2,3,4,... doesn't change anything it's just like some guy is changing his clothes and don't make this project a good and safe option for investing comparing to many other assets like bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DU18",
      "created_time": "June 01, 2022, 07:46:07 AM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AMI have a friend who invests in cryptocurrency like me, he is an investor hold Luna and he has also lost quite a bit because of Luna. But what's more sad is his 2 best friends. Those two are also hold a lot of Luna's and Luna's crash causes them to lose all their possessions and become insane. As he said, one person has gone through the crisis and one has not. Those two guys who invested in Luna were all from my friend's advice. He said it was he who indirectly harmed them, money can be earned, but his friend are gone.This is a sad story that I have heard. Through this story I want everyone to know 1 golden rule in investing is: never give financial advice to anyone. By the time you give them financial advice, you may feel like you're one step ahead of them, but if that advice is wrong, you could be the one hurting them.I personally also experienced losses from Luna, but luckily I only invested a little cold money that I had so far so I didn't think about it too much, Luna incident should be a lesson for us to think twice before investing 100% of the money we have, actually I don't I want to comment on Luna at all because it's obviously quite painful for some people, many people who hold Luna at a high price actually get an airdrop that doesn't match what was promised, besides that when Luna migrated to Luna V2, the Luna token which was replaced with Lunc, lunc had a low  price much lower than when we buy luna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "June 01, 2022, 08:57:25 AM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AMI have a friend who invests in cryptocurrency like me, he is an investor hold Luna and he has also lost quite a bit because of Luna. But what's more sad is his 2 best friends. Those two are also hold a lot of Luna's and Luna's crash causes them to lose all their possessions and become insane. As he said, one person has gone through the crisis and one has not. Those two guys who invested in Luna were all from my friend's advice. He said it was he who indirectly harmed them, money can be earned, but his friend are gone.This is a sad story that I have heard. Through this story I want everyone to know 1 golden rule in investing is: never give financial advice to anyone. By the time you give them financial advice, you may feel like you're one step ahead of them, but if that advice is wrong, you could be the one hurting them.This scenario is very common, there is a reason it is recommended that you keep your family and friends matters apart from your money matters, because if there is some disagreement or issue when it comes to the money not only you will be affected financially but your personal relationships will also suffer, so while some light financial advice is acceptable, like promoting to save money for a future investment, it should never be anything too specific or that hides a risk that is too high, otherwise something like what you mention can happen and you will lose a friendship or your relationship with a family member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "June 01, 2022, 09:34:24 AM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AM~snip~Lost a lot of money because of Luna? He could've put more money to Luna than Btc? Or he/they put all their eggs in one basket? That's actually one of the things to remember when investing, especially to a highly volatile asset. Also, never listen to just financial advice, you should do your own due diligence and never blame someone who just told you that you can make profit from this and that, coz their intentions as your friend is not to make you go bankrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "June 01, 2022, 09:53:31 AM",
      "body": "Quote from: South Park on June 01, 2022, 08:57:25 AMThis scenario is very common, there is a reason it is recommended that you keep your family and friends matters apart from your money matters, because if there is some disagreement or issue when it comes to the money not only you will be affected financially but your personal relationships will also suffer, so while some light financial advice is acceptable, like promoting to save money for a future investment, it should never be anything too specific or that hides a risk that is too high, otherwise something like what you mention can happen and you will lose a friendship or your relationship with a family member.This is why I avoid giving advice to my friends and relatives about investments especially cryptocurrencies. If your advice fails, they will just blame you and you will feel a bit guilty even though you did nothing wrong. On the other side, I also keep them from knowing my financial decision of where I invest my money. You'll just hear some hurtful words from them that will decrease your confidence about your decision. But when you became successful with those investments, they praise you like they are behind you taking those risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 01, 2022, 10:01:02 AM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AMThrough this story I want everyone to know 1 golden rule in investing is: never give financial advice to anyone.There's nothing wrong of giving financial advice to anyone, but the wrong is the person who only rely about the financial advice from a stranger. Do you really think someone told you to invest in x coin is really legit? why should they suggest you to invest on specific coin? they must have a behind reason from that. As much as I dislike Warren Buffet, but he's right in this moment, only invest on what you know and you've learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "June 01, 2022, 10:01:56 AM",
      "body": "There should always be a disclaimer about what you are advising on, especially if you are not a financial advisor. It's an actual job, especially those insurance sellers that give out different policies depending on your capability or something. It's unfortunate what happened to your friend and your friends of friends because knowing what happened to Luna and Luna 2.0, it just makes sense that anything can happen, and a lot of people can be vulnerable if it wasn't good advice or something. Imagine being able to invest early on, it's perfect, but the total supply of the coins and the stashed money backed in Luna is not enough to let the stakes cash out. It just didn't become stable as the Do Kwon wanted.I hope they can recover from this and everyone who has experienced losing everything. I hope they can come back and have a comeback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "June 01, 2022, 10:52:39 AM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AMThose two guys who invested in Luna were all from my friend's advice. He said it was he who indirectly harmed them, money can be earned, but his friend are gone.Losing his friends because of the advise he gave them is not the end of the world. His friends will come back. He gave an honest advise like someone who wants to see his friends grow financially. I don't blame him and he shouldn't blame himself.Nothing bad to give an honest advise but to add disclaimer is appropriate and that will get the investor to be cautious of what they are doing. To advise people and friends to invest is wise but to inform them of the risk involved is wiser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "June 01, 2022, 11:09:42 AM",
      "body": "QuoteThis is a sad story that I have heard. Through this story I want everyone to know 1 golden rule in investing is: never give financial advice to anyone. By the time you give them financial advice, you may feel like you're one step ahead of them, but if that advice is wrong, you could be the one hurting them.If this really is the number 1 financial advise, then I can say that I've followed this advise without any doubt during my entire life.I've have never given any financial advise to anyone in my social circle: family, friends, relatives. There's more than that. I've never taken any financial advise from friends and family. I think that it can be considered socially inappropriate and cringe to give financial advise to family/friends.Anyway, the entire \"I told my friends to buy Luna and now they are broke\" thing has turned into a meme at this point. I can't feel sorry for the Luna investors. They were buying a shitcoin. What else where they expecting? This is like joining a ponzi scheme and expecting to make big profits. Only the creators of ponzi schemes make big money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "June 01, 2022, 12:27:20 PM",
      "body": "I'm not going to talk about investing to close people who seem eager to make a profit. In my circle, most of them are people who are influenced by \"successful\" social media celebrities and come to us to learn. They tend to ignore the risks, hear only the \"profit\" side, and think they will quickly get rich if they risk more and more money.Generally, such people prefer to invest in something that has high price volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 01, 2022, 12:52:42 PM",
      "body": "Quote from: Marvell1 on June 01, 2022, 04:23:23 AMThis is a sad story that I have heard. Through this story I want everyone to know 1 golden rule in investing is: never give financial advice to anyone. By the time you give them financial advice, you may feel like you're one step ahead of them, but if that advice is wrong, you could be the one hurting them.From personal experience, I can agree that it is not wise to give financial advice to anyone, especially when it comes to investing in cryptocurrencies. It's not just a question of telling someone to \"invest in coin A or B\", it is already a question of how someone will store what they bought, and the reality is that most still store digital assets in ways that are very risky. If you are already advising someone to invest in Bitcoin (or some altcoin), then explain to them the risks that come with using a mobile or desktop hot wallet, or storing on crypto exchanges. I was in a situation where I felt responsible for someone losing money because of my advice, so even though I wasn’t directly to blame for someone behaving irresponsibly, I paid damages out of my own pocket and learned an important life lesson.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "June 01, 2022, 01:08:21 PM",
      "body": "Yeah, been there and done that. It's frustrating when you see people that you've talked to about your enthusiasm towards bitcoin and the market but then, you'll know that they didn't do well and lost money. It feels that you've passed them a burden but still, you can clear your mind by thinking that they have a free will and they were the ones that have chosen that path and they didn't became careful because they've belittled the market as it seems too easy to become rich in here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}