{
  "id": "topic_5403131",
  "title": "seoincorporation",
  "author": "seoincorporation",
  "created_time": "June 18, 2022, 05:54:02 PM",
  "content": "In the past weeks, i have been working on different betting bots, I even created a bet simulator and posted the bots on the same page:https://justdice.lucky.lat/But I would like to discuss the logic behind them. I know we can't always win if we always bet with the same method, a bad streak will get us in the long run, but the goal is to run the bot with multiple accounts and have a bigger number of winning bots than the losing ones. And to be clear, I'm not abusing the casino, they allow the users to run multiple bots.Some of the betting methods I have in mind are the next ones:1.- Divide the balance/1000, then place 1000 bets and try to get 5 x250, if I don't get the 5 then double up the bet and try again.2.- Divide the balance/1000, look for an x100, and each time I lose the bet increase the betting amount x1.02, if I hit a winning multiplier then repeat the process.So, if someone has a betting logic for the long run with low risk, please share it with us and I will code the bot.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403131",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "June 19, 2022, 05:16:07 AM",
      "body": "Quote from: seoincorporation on June 18, 2022, 05:54:02 PM2.- Divide the balance/1000, look for an x100, and each time I lose the bet increase the betting amount x1.02, if I hit a winning multiplier then repeat the process.This is probably the way to go but you should only increase with the x1.02 multiplers for the winning bets, so that you don't amplify losing streaks on the other bots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 21, 2022, 11:25:05 AM",
      "body": "Quote from: seoincorporation on June 18, 2022, 05:54:02 PMthe goal is to run the bot with multiple accounts and have a bigger number of winning bots than the losing ones.That won't work. Casino games are EV- for the user, which means on average you will lose. That's because of the house edge.QuoteSo, if someone has a betting logic for the long run with low risk, please share it with us and I will code the bot.The best logic to reduce losses is to reduce wagering. Your average loss is your total wagered amount multiplied by the house edge.Years ago, back when rollin.io still existed, there was a user (Landen) running a bot for months. He won big before he busted.I made a spreadsheet of what I called the Landen strategy. If your bankroll is big enough, the chance to win one round is incredible high. But if you repeat it a million times, you will at some point lose. In the end, it's just Martingale.I've seen an interesting way of reaching a 50% odds bet by making many smaller bets at higher risk and the same winning result, but I can't find it back. The math made sense, the total chance of winning was the same, but because you wager less in total, you lose less to the house edge. Or the other way around: you risk the same amount in total, but win slighty more if you win.I'm pretty sure I've merited the post, but that list is too long to find it back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 21, 2022, 02:08:19 PM",
      "body": "Quote from: LoyceV on June 21, 2022, 11:25:05 AM...That won't work. Casino games are EV- for the user, which means on average you will lose. That's because of the house edge.I know the house edge will get us in the long run, is like playing coin flips with $10, each time the casino win they get $10 and each time we win we get 9.99... if we do 1,000,000 flips we will be down in the long run.Quote from: LoyceV on June 21, 2022, 11:25:05 AM...The best logic to reduce losses is to reduce wagering. Your average loss is your total wagered amount multiplied by the house edge.And this is why I think is better to bet on big multipliers against the low ones.Yesterday I was thinking about the 95% chance to win, The question is, how many losses you can get consecutive. And after making some tests in the simulator I found is really complex to get 4 or 5 consecutive losses, now I'm working on a bot to start betting with balance/10000 and x25 the amount after each loss. When it gets done I will post it on the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 21, 2022, 04:08:07 PM",
      "body": "Quote from: seoincorporation on June 21, 2022, 02:08:19 PMQuote from: LoyceV on June 21, 2022, 11:25:05 AMThe best logic to reduce losses is to reduce wagering. Your average loss is your total wagered amount multiplied by the house edge.And this is why I think is better to bet on big multipliers against the low ones.Correct. That's what makes the Landen strategy so good.QuoteYesterday I was thinking about the 95% chance to win, The question is, how many losses you can get consecutive.There's no upper limit. That's what often seems to surprise people, and if you play often enough, you'll get more losses than you can afford.At 95% win chance, the house edge is huge compared to the amount you win!QuoteAnd after making some tests in the simulator I found is really complex to get 4 or 5 consecutive lossesBut your profits are small compared to what you're risking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "June 22, 2022, 07:17:17 AM",
      "body": "My logic says... if you run multiple bots and you get bots on the one side that wins and bots on the other side that lose, it actually cancel each other out.. right? You might find that some might win today... but tomorrow those same bots will lose. So you have to look at the bet result history of each individual bot over a long period, to see if your strategy has profited or not. My guess is that it will show that the \"house edge\" has cancelled all short-term profits and it only encouraged you to keep on gambling, so that the house edge could absorb those profits.  My strategy has always been..... try to hit the large Jackpot and then stop gambling. (Also make sure that the profit from that win, exceed the amount of money that I spend to get it... or it would have just been time and money wasted) Most of all .... have fun doing it.... then you write off those losses as entertainment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 22, 2022, 01:48:49 PM",
      "body": "Quote from: Kakmakr on June 22, 2022, 07:17:17 AMMy strategy has always been..... try to hit the large Jackpot and then stop gambling. (Also make sure that the profit from that win, exceed the amount of money that I spend to get it... or it would have just been time and money wasted) I like this strategy, but with the wrong luck, it could take us into a deep hole... Let's say we try to get an x2000, and it takes us 10,000 bets. That would be a terrible streak and could make us lose more than what we can afford.But if we take 10 bots and make them chase the x2000 in 2000 bets, in theory, most of them will hit it. The luck comes when the bot gets the multiplier on the first 100 bets, because if all of them get it after 1500 bets then the profit will not be that big.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 24, 2022, 06:08:31 AM",
      "body": "Quote from: seoincorporation on June 18, 2022, 05:54:02 PMI know we can't always win if we always bet with the same method, a bad streak will get us in the long run, but the goal is to run the bot with multiple accounts and have a bigger number of winning bots than the losing ones. And to be clear, I'm not abusing the casino, they allow the users to run multiple bots.The Casinos will allow it, since there more you bet the more likely it is for you to loose money on the house edge. The most successful way would maybe be to bet one time in your live with a very bi amount. Either you are lucky and you win big or you are not lucky and you loose. But if you bet over time you will always loose money, because the odds are simply against you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 24, 2022, 04:09:48 PM",
      "body": "Quote from: hZti on June 24, 2022, 06:08:31 AMThe Casinos will allow it, since there more you bet the more likely it is for you to loose money on the house edge. The most successful way would maybe be to bet one time in your live with a very bi amount. Either you are lucky and you win big or you are not lucky and you loose. But if you bet over time you will always loose money, because the odds are simply against you.About your method, I agree that 1 Yolo bet with a winning result is what we need, that's a valid method.But I do not agree with the idea that we will always lose in the long run, people keep saying this is true and that's not the reality. Let me show you my results after more than 58,000 bets:As you need the luck to hit a nice multiplier with one bet, you can have luck in the long run too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 25, 2022, 08:23:57 AM",
      "body": "Quote from: seoincorporation on June 24, 2022, 04:09:48 PMBut I do not agree with the idea that we will always lose in the long run, people keep saying this is true and that's not the reality. Let me show you my results after more than 58,000 bets:The thing is that you change your betting strategies during those 58k games if I understand that correctly, or you are really just lucky. It is very easy mathematics that you will not be able to profit in the long run. You play against the casino and the casino has to ability to set the rules. So for the casino there is absolute no reason not to adjust the games if they see that you earn money on them. Maybe if it is wrongly done on the casinos side you can win, but why would they run a business if they loose. Also if you look at many casinos in the real world you will see that they keep earning money and not loose money. But all best luck to you and maybe you can trick some casinos out of some money, before they realize they have to change their algorithm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 25, 2022, 02:20:23 PM",
      "body": "Quote from: hZti on June 25, 2022, 08:23:57 AMThe thing is that you change your betting strategies during those 58k games if I understand that correctly, or you are really just lucky. It is very easy mathematics that you will not be able to profit in the long run. You play against the casino and the casino has to ability to set the rules. So for the casino there is absolute no reason not to adjust the games if they see that you earn money on them. Maybe if it is wrongly done on the casinos side you can win, but why would they run a business if they loose. Also if you look at many casinos in the real world you will see that they keep earning money and not loose money. But all best luck to you and maybe you can trick some casinos out of some money, before they realize they have to change their algorithm.If a casino is provably fair they can just change the algorithm to make the users lose.What people have to understand is the house edge is applied for the casino with all its users, and not for each singular user. This means the casino will get the 1% from all the wager in the long run. Some users will win and others will lose, but not all of them will lose. And the ones who lose are the ones who pay the money for the users who win.The fact that the casinos have a house edge doesn't mean you will always lose, it means the casino will win in the long run, but some users will win too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 26, 2022, 03:15:43 PM",
      "body": "Quote from: Michael Levchenko on July 26, 2022, 01:30:30 PMI was parsing bookmakers that provide historical odds and match results, based on the results I built a model that determined the total number of goals scored in a match with a fairly high accuracy. The model does not promote any logic, its work is mainly related to statistics, and considering that I collected data from all the top championships for almost five years, I managed to come up with a pretty good result of 68% of winnings. But the pattern is always unstable when the season is just starting and the teams are not yet in optimal shape.Actually, my advice is that you can do it this way and improve the functionality, for example, predict matches in which both teams will score. Good luck!Thanks for sharing your experience Michael, but if you bet to the teams/players that wins most of the times, that mean the multipliers you get are low, so, that 68% of winnings doesn't mean that you double up the balance at the end of the day.But maybe this method mixed with parlays could print nice money. At the end of the day this is what i call smart betting, and is nice to see people betting this way, so, thanks again for sharing this experience with us.I have been working in a new logic for my dice betting bots. I chase 3 multipliers in the same bot, first is the x13 to feed the bot for the lung run, then is a x1000 to chase the money, and sometimes it bets chasing a x10,000 and that's what i call my hand made jackpot. I'm in nice profit with that bot, but that's because i martingale it, it doesn't always win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "July 27, 2022, 03:55:21 PM",
      "body": "Quote from: seoincorporation on July 26, 2022, 03:15:43 PMBut maybe this method mixed with parlays could print nice money. People need to understand that betting is not about who is the smartest or who knows about special events. Since there is a house edge it is always only meant for entertainment since you can never win and you can not even have a return of interest in the long run. You can only loose but you will be entertained. It is like going  to the cinema. You would also not let a bot go to the cinema for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 28, 2022, 04:52:42 PM",
      "body": "Quote from: hZti on July 27, 2022, 03:55:21 PMPeople need to understand that betting is not about who is the smartest or who knows about special events. Since there is a house edge it is always only meant for entertainment since you can never win and you can not even have a return of interest in the long run. You can only loose but you will be entertained. It is like going  to the cinema. You would also not let a bot go to the cinema for you.Each one has it's own perspective about gambling, if you think you will always lose i respect that, but i think that if we bet on a smart way, then we have better chance to win.My bot called Da Vinci have given nice profit in two different accounts in the same casino (They allow multi accounts)Luck is an important fact, but as we can't always win, we can't always lose",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JanEmil",
      "created_time": "July 30, 2022, 08:33:23 PMLast edit: July 31, 2022, 03:49:44 AM by JanEmil",
      "body": "If you know you want to play alot and maybe use bots you get closer to winning system if you make 1 user and then ref your bot from that user. Some sites then pay you up to 50% back wagering to first account. And the bot account probably get alot bonus / event bonus and gifts. Some sites close to 30%.The above and solution 2 in OP is winning for me. And 650 refs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 31, 2022, 11:10:26 PM",
      "body": "Quote from: JanEmil on July 30, 2022, 08:33:23 PMIf you know you want to play alot and maybe use bots you get closer to winning system if you make 1 user and then ref your bot from that user. Some sites then pay you up to 50% back wagering to first account. And the bot account probably get alot bonus / event bonus and gifts. Some sites close to 30%.The above and solution 2 in OP is winning for me. And 650 refs.That's why i was thinking about making some bots for freebitcoin. maybe with the same logic behind this ones. But it would be nice if you can recommend some other nice sites with affiliate system. Maybe i i should think about some big sites like Stake or Roobet, but I'm not sure about their bot politics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}