{
  "id": "topic_5475617",
  "title": "gusto2458",
  "author": "gusto2458",
  "created_time": "November 26, 2023, 11:11:14 PM",
  "content": "Hopefully someone can give me some ideas on how to best execute this. If you have a wallet with say >20 UTXOs that were previously mixed using Whirlpool (resulting in equal amounts), how can you best move then to another wallet. In this example, one wallet is single sig, whereas the target is mutlisig.Sending them one by one is troublesome for two reasons. a) fees for >20 transactionsb) timing the transactions so it's not obvious that they all moved at onceIf they're all consolidated, you've just undone all the mixing previously.I saw some privacy discussion here https://bitcointalk.org/index.php?topic=5469997.0 so maybe @satscraper has some ideas?Cheers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475617",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "November 26, 2023, 11:53:34 PM",
      "body": "Quote from: gusto2458 on November 26, 2023, 11:11:14 PMSending them one by one is troublesome for two reasons. a) fees for >20 transactionsb) timing the transactions so it's not obvious that they all moved at onceWell if you can't move one by one then its someting difficult if you still want to preserver the privacy.I may sugest to using some coinjoin transactions or some manually STONEWALL. I may sugested to use Samourai Wallet for that Operation, but it is up to you. In any case there is no way to do that without lose some privacy, you may try to group them in  groups of 3-4 Utxos:The problem is that you will end with some repetitive TXID. That is a problem if you don't get new UTXOS to mix those",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gusto2458",
      "created_time": "November 27, 2023, 12:13:13 AM",
      "body": "Thanks for the ideas. I guess the best way to preserve the mixing benefits done earlier is to send them 1-by-1 at different time intervals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 27, 2023, 12:54:18 PM",
      "body": "The correct way to do this is via the \"mix to external xpub\" feature in either Samourai or Sparrow.Here's a guide on how to do this with Sparrow: https://sparrowwallet.com/docs/mixing-whirlpool.html#mixing-to-cold-storage. Simply use the xpub of your cold storage wallet to create a watch only version in Sparrow, and then in your Whirlpool wallet select the \"Mix to...\" button and tell it to mix directly to that cold storage wallet. It will add at least 3 more mixes to each output first, and then mix those outputs directly in to your cold storage wallet at a random time after that. You will therefore not pay any fees (since the fees for each coinjoin are paid by the new entrants), and there will be no consolidation or privacy loss. To an outside observer, the transactions moving these coins from Whirlpool to the cold wallet will be indistinguishable from any other Whirlpool coinjoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruw",
      "created_time": "November 27, 2023, 02:32:53 PM",
      "body": "Quote from: gusto2458 on November 26, 2023, 11:11:14 PMHopefully someone can give me some ideas on how to best execute this. If you have a wallet with say >20 UTXOs that were previously mixed using Whirlpool (resulting in equal amounts), how can you best move then to another wallet. In this example, one wallet is single sig, whereas the target is mutlisig.Sending them one by one is troublesome for two reasons. a) fees for >20 transactionsb) timing the transactions so it's not obvious that they all moved at onceIf they're all consolidated, you've just undone all the mixing previously.I saw some privacy discussion here https://bitcointalk.org/index.php?topic=5469997.0 so maybe @satscraper has some ideas?CheersYou can use a WabiSabi coinjoin to spend your coins to your new wallet without revealing common input ownership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 27, 2023, 03:17:33 PM",
      "body": "I agree with o_e_l_e_o.The way I did it when I wanted to change was:1. I sent some UTXOs separately in various times (1 utxo today, 1 two weeks later, 1 one minute later etc).2. The rest of them I used o_e_l_e_o's process, it worked smoothly.The only thing I don't like with this option (2) is that most of the coins will move from wallet A to B in in close moments of time.If this doesn't bother you, then follow his advice. It is the best you can get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 27, 2023, 03:25:17 PM",
      "body": "Quote from: apogio on November 27, 2023, 03:17:33 PMThe only thing I don't like with this option (2) is that most of the coins will move from wallet A to B in in close moments of time.It's easy enough to space out the process using Sparrow. You can simply enroll one UTXO now and wait for it to land in the new wallet, and then wait as long as you want before starting the process on the next UTXO. You don't have to enroll all your UTXOs in the process at the same time.You can also freeze individual UTXOs in Sparrow which will pause their enrollment in free remixes for as long as you leave them frozen. Simply unfreeze them again and they will start to be remixed once again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruw",
      "created_time": "November 27, 2023, 04:00:00 PM",
      "body": "Quote from: apogio on November 27, 2023, 03:57:30 PMQuote from: o_e_l_e_o on November 27, 2023, 03:25:17 PMIt's easy enough to space out the process using Sparrow. You can simply enroll one UTXO now and wait for it to land in the new wallet, and then wait as long as you want before starting the process on the next UTXO. You don't have to enroll all your UTXOs in the process at the same time.You can also freeze individual UTXOs in Sparrow which will pause their enrollment in free remixes for as long as you leave them frozen. Simply unfreeze them again and they will start to be remixed once again.I am seeing two potential issues though...1. When I did the process above, my wallet was hot. So, I had no issue. But, as I have said here: https://bitcointalk.org/index.php?topic=5470024.msg63151565#msg63151565 if the wallet is airgapped, I think you can't generate the accounts. You need to turn your wallet into a hot wallet as long as this process goes.2. Perhaps OP doesn't want to have equal size UTXOs in the end. If so, then I don't know how he can avoid it with Sparrow & Whirlpool. Let's say OP owns 20 UTXOs of variable sizes from 0.001 BTC to 0.1 BTC. OP will need to choose a coinjoin pool. Whatever size of pool he chooses (0.001 BTC, 0.01 BTC or 0.1 BTC) the final UTXOs will be of this specific size. There is a workaround, if OP chooses to use some UTXOs in one pool (say 0.1 BTC), then repeat the process for another pool etc. This will lead to UTXOs with sizes 0.001 BTC, 0.01 BTC or 0.1 BTC. So, if OP wants to maintain the same amounts for each UTXO (obviously minus the transaction fees), I am not sure he can.He can avoid this size restriction with a WabiSabi coinjoin, you can create outputs with arbitrary values.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 27, 2023, 04:03:40 PM",
      "body": "Quote from: gusto2458 on November 26, 2023, 11:11:14 PMhow can you best move then to another wallet.Another thing is why you want to move to another wallet?If there is not need to touch that balance, then is better to wait for low fees.. The only reason to move all to another wallet is if the current seed or hdkey was compromised somehow... (In this case privacy doesn't matter)After all other member recommendations, i strongly recommend don't move it unless it was compromised",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 27, 2023, 04:06:13 PM",
      "body": "Quote from: Kruw on November 27, 2023, 04:00:00 PMHe can avoid this size restriction with a WabiSabi coinjoin, you can create outputs with arbitrary values.Ok, thanks for pointing this out, however I don't use Wasabi or anything related to it. I am not going to criticise it here, we have done that a lot in other topics. I don't ignore your suggestion, I am just focusing on the tools I know how they work and I know I can help. So, you can create a helpful post for OP where you can give all the advice you want, using whatever tools you wish and I will do the same in a separate post for the tools that I know. I think it's better this way.Quote from: albert0bsd on November 27, 2023, 04:03:40 PMAnother thing is why you want to move to another wallet?If there is not need to touch that balance, then is better to wait for low fees.. The only reason to move all to another wallet is if the current seed or hdkey was compromised somehow... (In this case privacy doesn't matter)After all other member recommendations, i strongly recommend don't move it unless it was compromisedPerhaps it is not compromised but OP wants to ameliorate his set-up, moving to a multisig for example. OP can use both wallets, of course, but I don't think it is a bad process. Of course, if it is not compromised, I also suggest OP to wait for better fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 27, 2023, 05:03:26 PM",
      "body": "Quote from: apogio on November 27, 2023, 03:57:30 PMI am seeing two potential issues though...I'm not sure I follow you. From what OP has said, his outputs are already in Whirlpool:Quote from: gusto2458 on November 26, 2023, 11:11:14 PMIf you have a wallet with say >20 UTXOs that were previously mixed using Whirlpool (resulting in equal amounts), how can you best move then to another wallet.Given that, and given he wants to move them from Whirlpool to another wallet, then the \"mix to external xpub\" option is the best option.Quote from: albert0bsd on November 27, 2023, 04:03:40 PMAnother thing is why you want to move to another wallet?To move your Whirlpooled outputs directly to cold storage. Once I have a UTXO which has had 20+ free remixes and I don't intend to spend anytime soon, I gain very little by letting it sit on a hot wallet an accumulate even more free remixes. Using this method I can move this UTXO to a cold storage wallet, increase its security, and also redirect any free remixes to other UTXOs of the same size in that Whirlpool wallet instead.Quote from: albert0bsd on November 27, 2023, 04:03:40 PMIf there is not need to touch that balance, then is better to wait for low fees.The fees do not matter given my suggestion above. Whirlpool remixes are free. Mixing to an external xpub is also free, since it is the new entrants to each round which pay the fee. Mixing to an external wallet is exactly the same as just accumulating more free remixes from this point of view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 27, 2023, 05:05:10 PM",
      "body": "Quote from: o_e_l_e_o on November 27, 2023, 05:03:26 PMQuote from: apogio on November 27, 2023, 03:57:30 PMI am seeing two potential issues though...I'm not sure I follow you. From what OP has said, his outputs are already in Whirlpool:Quote from: gusto2458 on November 26, 2023, 11:11:14 PMIf you have a wallet with say >20 UTXOs that were previously mixed using Whirlpool (resulting in equal amounts), how can you best move then to another wallet.Given that, and given he wants to move them from Whirlpool to another wallet, then the \"mix to external xpub\" option is the best option.You are absolutely right. I deleted my post, to avoid confusion. In that case, there is no better option than the one you mentioned above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gusto2458",
      "created_time": "November 28, 2023, 12:27:17 AM",
      "body": "Thanks for all the useful feedback. I should have been more specific with my original post. The scenario is, funds were mixed using whirlpool and then sent back to offline wallet (\"mix to external xpub\"). The idea is to move those individual utxos to a multisig wallet. Started out this way:Singlesig (offline-wallet) --> whirlpool (hot-wallet) --> Singlesig (offline-wallet)Question is what's the best strategy to now go to the desired end state:Singlesig (offline-wallet) --> Multisig (offline-wallet)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 28, 2023, 05:01:53 AM",
      "body": "I also have this utxo problem but probably yours is different from mine. Mine is trying to send BTC from trust wallet to another bitcoin wallet but  finding it difficult to send. it's showing\"unable to transfer due to dust utxo error\" and I have up to $20 in it. I contracted a friend he advised me to use electron wallet to inport my pass phrase and transfer to another wallet, by reducing the sat/vbyte. I did but I used blue wallet for the transaction but yet haven't reacieved the amount I sent. What is the possible cause Please?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 28, 2023, 06:49:09 AMLast edit: November 28, 2023, 07:00:11 AM by apogio",
      "body": "Quote from: Samlucky O on November 28, 2023, 05:01:53 AMI also have this utxo problem but probably yours is different from mine. Mine is trying to send BTC from trust wallet to another bitcoin wallet but  finding it difficult to send. it's showing\"unable to transfer due to dust utxo error\" and I have up to $20 in it. I contracted a friend he advised me to use electron wallet to inport my pass phrase and transfer to another wallet, by reducing the sat/vbyte. I did but I used blue wallet for the transaction but yet haven't reacieved the amount I sent. What is the possible cause Please?This normally means that some utxos you want to spend are too small and they don't cover the fees. How many utxos  constitute the 20 dollars you mention? Are there any very small UTXOs? I don't know if you can do coin control and see the UTXOs in Trust Wallet. With a good wallet, you should and as youfriend said , use electrum. You will be able to send the \"big\" UTXO fully or reduce the fee as you said.For a better explanation refer to this topic https://bitcointalk.org/index.php?topic=5452328.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 28, 2023, 09:47:50 AM",
      "body": "Quote from: gusto2458 on November 28, 2023, 12:27:17 AMQuestion is what's the best strategy to now go to the desired end state:Singlesig (offline-wallet) --> Multisig (offline-wallet)In that case, you don't really have any option other than sending the UTXOs from one wallet to the other and paying the transaction fee each time.Why do you want to move the coins to a multi-sig wallet? Is your offline wallet no longer secure? Is leaving the coins where they are not an option?If you do still want to send them across, then you can either wait until fees are lower or just bite the bullet and pay the fees. You will have to spread the transactions out over a period of time so they are not obviously linked together. You could potentially consolidate two or three of the UTXOs together each time to save on fees if you are happy with the privacy implications of doing so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 28, 2023, 05:45:50 PM",
      "body": "Quote from: o_e_l_e_o on November 28, 2023, 09:47:50 AMQuote from: gusto2458 on November 28, 2023, 12:27:17 AMQuestion is what's the best strategy to now go to the desired end state:Singlesig (offline-wallet) --> Multisig (offline-wallet)In that case, you don't really have any option other than sending the UTXOs from one wallet to the other and paying the transaction fee each time.Why do you want to move the coins to a multi-sig wallet? Is your offline wallet no longer secure? Is leaving the coins where they are not an option?If you do still want to send them across, then you can either wait until fees are lower or just bite the bullet and pay the fees. You will have to spread the transactions out over a period of time so they are not obviously linked together. You could potentially consolidate two or three of the UTXOs together each time to save on fees if you are happy with the privacy implications of doing so.albert0bsd had the same question. I believe OP wants to ameliorate his setup and I don't believe it is a bad idea. But since two members of this forum found this curious, I can't help but ask, why? I mean don't you think it is a good idea to move the coins to a better setup? Of course provided that the multisig vault will be properly set up. Fully airgapped, different devices, proper backups etc.Yes! a properly set up singlesig wallet, where the seed phrase is produced from a permanently airgapped device, where the backups are stored offline in separate locations, where you add a strong passphrase that provides >128 bits of entropy is safe. But, a multisig vault can have some advantages compared to the singlesig wallet:1. In terms of safety, I reckon that both wallets are impossible to get compromised with brute-force. 2. In terms of theft, then the multisig vault is safer because the attacker will find one backup and they have no clue that you have set a multisig vault with another wallet. They will probably think of bruteforcing the passphrase though.3. In terms of physical disaster, multisig and singlesig are equal if you have backed up the signers properly.4. In terms of usage, signing a transaction with a multisig is much easier, because you can create a PSBT with the 1st cosigner and then sign with the rest of them, bringing the PSBT to the rest of the signers. However, with singlesig you need to get the passphrase where the device is, unless you remember it, but this is highly unlikely with a proper random passphrase.5. In terms of fees, provided that we talk about the same amount of inputs and outputs, singlesig is cheaper.Having said all that, I want to make clear that multisig creates a false sense of security. Multisig is in general safer, indeed, but you must know what you do and avoid obvious mistakes. Multisig is not a panacea. Supposing that OP knows all the dangers and follows all the necessary measures, then, according to the list above, I think moving to a multisig is not a bad idea. But if the only motivation is security, OP must know that a proper singlesig wallet with a strong random passphrase is safe enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 28, 2023, 06:18:41 PM",
      "body": "Quote from: apogio on November 28, 2023, 05:45:50 PMBut, a multisig vault can have some advantages compared to the singlesig walletI agree with most that you write, I just want to add some video of Andreas about multi-signature:MultiSig is NOT the best option for most people to store their bitcoin [June 2023]Also Multisignature transactions need more space and it waste more fees each time that you want to create a new transaction.As experiment it is OK and its up to each person to use it or not, but i think that a single 12 word seed and 24 words bip39 seed have enough security always that you don't leak or mesh up your seed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 28, 2023, 06:25:54 PM",
      "body": "Quote from: albert0bsd on November 28, 2023, 06:18:41 PMQuote from: apogio on November 28, 2023, 05:45:50 PMBut, a multisig vault can have some advantages compared to the singlesig walletI agree with most that you write, I just want to add some video of Andreas about multi-signature:MultiSig is NOT the best option for most people to store their bitcoin [June 2023]Also Multisignature transactions need more space and it waste more fees each time that you want to create a new transaction.As experiment it is OK and its up to each person to use it or not, but i think that a single 12 word seed and 24 words bip39 seed have enough security always that you don't leak or mesh up your seedYeah I have seen this video and I have also seen another one where Andreas says that multisig is an overkill for everyday people. In my opinion it all comes down to usability. I would go for a multisig wallet, for its ease of use, even if it is more difficult to setup and also easier to mess it up. I think I know my limits well enough to choose it. But, as you said, people go for multisig solutions only because of them being more secure, but, nothing is secure enough if you make stupid mistakes, right?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 28, 2023, 06:30:17 PM",
      "body": "Quote from: apogio on November 28, 2023, 06:25:54 PM but, nothing is secure enough if you make stupid mistakes, right?!LOL I absolutely agree with this..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}