{
  "id": "topic_5452147",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "May 09, 2023, 07:15:30 PM",
  "content": "Ordinals Inscriptions is the cause of increase in mempool congestion. After Ordinals NFT, there is now ways to create fungible tokens called BRC-20 which led to the more in the rise of mempool congestion. BRC-20 marketcap has surpass $1 billion. Some people call it another scam. But during the days when Ethereum blockchain started ERC20 and ERC721 (NFTs), some people were saying that it is the beginning of scam. Yes many people were scammed and many people lost money, but there are many of these altcoins tokens that are surving now.The mempool is far from getting less congested. Bitcoin transaction fee is too much and becoming unbearable. What do you think can solve what is happening? How can the mempool become not congested again. More miners needed or what?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452147",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "May 09, 2023, 08:01:55 PM",
      "body": "Quote from: Oshosondy on May 09, 2023, 07:15:30 PM~What do you think can solve what is happening? How can the mempool become not congested again. More miners needed or what? Simply increasing the number of miners on the network can not help to reduce mempool congestion, as this does not necessarily increase the network's bandwidth. The block size is limited, meaning there is a maximum number of transactions that can fit in a block. Therefore, miners cannot directly change the block size limit to accommodate more transactions.From my understanding, the only way miners can help is by not prioritizing transactions solely based on the transaction fees, but I doubt that will ever happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 09, 2023, 08:05:11 PM",
      "body": "Quote from: Stalker22 on May 09, 2023, 08:01:55 PMFrom my understanding, the only way miners can help is by not prioritizing transactions solely based on the transaction fees, but I doubt that will ever happen.This can not solve anything, it will only make the mempool to become something else. Considering higher fee is better and it will make mining to be more profitable. If the fee is set to just 1 sat/vbyte for all transactions, the mempool will still be congested as it is now and no transaction will have higher chance to be confirmed, so why not accepting higher fee instead so that higher fee ones would first be confirmed which is how it is and it is better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 09, 2023, 08:52:34 PM",
      "body": "Quote from: Oshosondy on May 09, 2023, 08:05:11 PMQuote from: Stalker22 on May 09, 2023, 08:01:55 PMFrom my understanding, the only way miners can help is by not prioritizing transactions solely based on the transaction fees, but I doubt that will ever happen.This can not solve anything, it will only make the mempool to become something else. ~Miners (mining pools) can choose which transactions they want to include in the block. This is why I said that they can help solve the congestion if they for example put a higher priority on actual bitcoin transactions versus ordinal inscriptions and BRC-20 tokens. On the other hand, your idea to increase the number of miners would not solve anything because it has no concrete impact on the current state of the network. As I said before, miners cannot increase the block size or speed up the validation process on their own. The block size limit is determined by the consensus rules of the network and can only be changed through a hard fork.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 09, 2023, 09:04:58 PM",
      "body": "With high transaction fee that you sending 50$ will also cost 30$ for the fee makes BTC less attractive to use. It making BTC unsecure as well because definitely this will be exploited who knows the government may be behind all this. If they are an attact from random groups, obviously they will not stop until something has to be done by the BTC dev.What could happen is the less and less people will used BTC for remittance, there are altcoins cheaper and faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "May 09, 2023, 09:43:55 PM",
      "body": "Quote from: She shining on May 09, 2023, 08:10:03 PMHypothetically if everyone select or set a lower fee than the market it can help reduce the transaction fee.I.e for examples a transaction fee was recommended as $56 and everyone making chooses to place $33 it can help reduce the fee. Since miners won't have any choice than to confirm the transaction at a lower price since the masses chose a lower price. Hope I was able to get my thought's across. Kinda found it hard expressing it in wordsBTC transaction fee is not calculated in $, but in sats/vByte, and there cannot be a \"recommended\" or fixed fee because transaction size varies, so even if you and i make a transaction paying 30 sats/vByte as our TX fee rate, if my transaction has more data, i still pay more fees than you do. People make BTC transactions for different reasons, some want it confirmed fast and others do not mind to wait, it is not possible for everyone to use the fee rate for low priority, miners will not confirm those transactions, and will choose those who pay better fees.Quote from: bittraffic on May 09, 2023, 09:04:58 PMIt making BTC unsecure as well because definitely this will be exploited who knows the government may be behind all this.High transaction fees do not make BTC network unsecure, it makes it more secure because miners are gaining from the high fees, so more incentive to mine, and the higher the hashrate, the more secure the BTC network is. The government isn't behind this, we must not create a sensational theory for every issue BTC faces, some people found a way to spam the blockchain with inscriptions to try and make money, and that is how we got here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "May 10, 2023, 07:44:45 PM",
      "body": "Quote from: Oshosondy on May 09, 2023, 07:15:30 PMOrdinals Inscriptions is the cause of increase in mempool congestion. After Ordinals NFT, there is now ways to create fungible tokens called BRC-20 which led to the more in the rise of mempool congestion. BRC-20 marketcap has surpass $1 billion. Some people call it another scam. But during the days when Ethereum blockchain started ERC20 and ERC721 (NFTs), some people were saying that it is the beginning of scam. Yes many people were scammed and many people lost money, but there are many of these altcoins tokens that are surving now.The mempool is far from getting less congested. Bitcoin transaction fee is too much and becoming unbearable. What do you think can solve what is happening? How can the mempool become not congested again. More miners needed or what? Ban ordinals and BRC20 and any other NFT/non-financial data on blockchain. Some of my customers already contacted me saying they can't pay me because of the ridiculous fees. They have to pay in fees more than the invoice sum on some occasions. Everything depends solely on core devs now. Just let me remind you that inaction (not only action) also can be an offense. If you see some crime or attack going on and refuse to prevent it you can be called a criminal as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 10, 2023, 09:33:16 PM",
      "body": "Quote from: Oshosondy on May 09, 2023, 07:15:30 PMOrdinals Inscriptions is the cause of increase in mempool congestion. After Ordinals NFT, there is now ways to create fungible tokens called BRC-20 which led to the more in the rise of mempool congestion. BRC-20 marketcap has surpass $1 billion. Some people call it another scam. But during the days when Ethereum blockchain started ERC20 and ERC721 (NFTs), some people were saying that it is the beginning of scam. Yes many people were scammed and many people lost money, but there are many of these altcoins tokens that are surving now.The mempool is far from getting less congested. Bitcoin transaction fee is too much and becoming unbearable. What do you think can solve what is happening? How can the mempool become not congested again. More miners needed or what? I believe consensus rules are being exploited now.At some point the network will be forked with new consensus rules which will not allow those ordinals to do that , which are only spamming the bitocin network.Everything will be back to normal. There is not need to panic, imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tromp",
      "created_time": "May 10, 2023, 09:47:31 PM",
      "body": "Quote from: serveria.com on May 10, 2023, 07:44:45 PMBan ordinals and BRC20 and any other NFT/non-financial data on blockchain.This is as silly a thing to say as people imploring the government to \"ban bitcoin\" because they don't like it.Bitcoin is is designed to be ban-proof. You can harass the onramps and off-ramps but you can't stop bitcoinitself in its tracks.Similarly, ordinals are pretty ban-proof. By the time you get a significant fraction of nodes to try filter them out from the mempool, they have already adopted a different encoding scheme bypassing the filter. The more you filter, the more ordinals encoding will become indistinguishable from financial transactions, and the more collateral damage you cause. In the worst case, they will just use fake output addresses for embedding data.That may be a little less efficient but at these fee levels they're willing to pay it obviously doesn't matter much.Not only is there no plausible approach to banning them from the mempool, but doing so wouldn't even suffice. Miners are very keen on processing these transactions which raise overall fee levels. So they'll make it easy to have these transactions routed directly to them.So please stop with the knee-jerk proposals without thinking things through...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "May 10, 2023, 10:24:31 PMLast edit: May 10, 2023, 11:22:56 PM by TryNinja",
      "body": "Quote from: bitmover on May 10, 2023, 09:33:16 PMI believe consensus rules are being exploited now.At some point the network will be forked with new consensus rules which will not allow those ordinals to do that , which are only spamming the bitocin network.Everything will be back to normal. There is not need to panic, imo.Hi, bitmover. Since you suggested that I should debate this over here...Could you explain how the consensus rules are being exploited and which changes to the consensus rules will or should not allow the ordinals to work?And since the Bitcoin network is free and open, one could argue that there is no spamming. If people are willing to pay to have a shitcoin inserted into the global network of nodes that we call Bitcoin, shouldn't they? If you think otherwise, please let me know why.I'll wait, read and answer your inquiries/points, thanks!edit: nevermind, read his last post on the Portuguese board and it's full of ad hominem. He doesn't want a debate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 11, 2023, 12:30:07 AM",
      "body": "I don't much about the team behind the Bitcoin Ordinals protocol but I wonder what they are trying to prove and why they choose to create a protocol that enables the minting of NFT on the Bitcoin blockchain because no one has done it before without doing the right analysis if it will lead to the congestion of the BTC network.I would like the idea if it doesn't lead to negative effects on the BTC blockchain since the idea was not to create something innovative but something that will impact the price and transaction of BTC.Quote from: bittraffic on May 09, 2023, 09:04:58 PM who knows the government may be behind all this.I supported your opinion because no dev that wants the progress of BTC will choose to create a project that makes BTC users seek alternatives for transactions due to fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tromp",
      "created_time": "May 11, 2023, 06:16:34 AMLast edit: May 11, 2023, 06:28:50 AM by tromp",
      "body": "Quote from: suzanne5223 on May 11, 2023, 12:30:07 AMwithout doing the right analysis if it will lead to the congestion of the BTC network.Remember that congestion is the end-goal for Bitcoin in a future with insignificant block subsidy, which is only a few decades away.An uncongested blockchain will never raise enough fees to provide decent security and be subject to cheap 51% attacks. So a fee market must develop where people fight for the right to have their transaction processed swiftly.So before long, congestion must be celebrated rather than criticized. It's crucial for Bitcoin's long term future.Or any PoW coin with a capped supply. Which is why I think Bitcoin Cash is doomed long term. It would take an insane amount of low fee (a fraction of a cent) transactions to pay for their security when their subsify effectively runs out. Their current tx volume of ~10k/day provides under $100 in fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "May 11, 2023, 01:50:27 PM",
      "body": "Have you seen ERC20 and it’s historical progress. It was highly congested, and there was literally no limit to the number of coins that were getting added every time on the blockchain. The gas fees was so high it used to take days for the single confirmation even if you had paid the desired gas fees. This was the major reason behind ETH got upgraded and they literally switched from PoW to PoS. I am not sure if same is possible with the bitcoin or not but bitcoin should not be changed. The scam projects like Ordinals and NFT should be taken down. But again since we are in the decentralised world we can not touch it as long as every investor ignore the ordinals. Sad to see blockchain getting burdened with such projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "May 11, 2023, 07:27:31 PM",
      "body": "Today I spent some hours to truly understand what is ordinal NFT and how it spams bitcoin blockchain. If anyone wants to understand it, here it is: https://docs.ordinals.com/introduction.htmlIf I want to inscribe an ordinal NFT, I can visit gamma.io. I tried that, uploaded an 50kb image and it costs me around $143 with 60 sat/vB and $250 if I sent it with 107 sat/vByte that is a high priority fee according to mempool.spaceSo, people were paying almost ten times more these days in these NFTs but there is a thing that I don't understand. Why does someone pay money to create an NFT and why does someone really buy an NFT? If you want an image, just take a screen and that's all. I don't really understand why someone pays millions of dollars to get a status of official holder of ape that's draw in pixels? I just don't get it, is there something magic behind NFT? What's the purpose to buy them, to just pay hundreds of dollars to create meaningless thing? And then someone buys this meaningless thing. I don't really get it, I couldn't really imagine that bitcoin blockchain would get flooded by a group of people who pay tons of money to create the dumbest thing and they have people around them who pay tons of money to buy the dumbest thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 12, 2023, 04:32:05 AM",
      "body": "Quote from: Oshosondy on May 09, 2023, 07:15:30 PMAfter Ordinals NFT, there is now ways to create fungible tokens called BRC-20To be clear you can NOT create any kind of tokens on Bitcoin blockchain. The protocol simply doesn't support that. Any other alternative centralized network can decides to interpret any of the bitcoin transactions in any way they like.QuoteSome people call it another scam.It is a scam but that's not even the thing people are arguing about.All the problems that the Ordinals Attack is creating is because they are abusing Bitcoin and are exploiting the protocol.As I've said many times in the past, even if people were using Ordinals to store cure for cancer on bitcoin blockchain, Ordinals still would be considered a malicious attack.Quote from: bittraffic on May 09, 2023, 09:04:58 PM~~ there are altcoins cheaper and faster. I disagree with this part for a couple of reasons:1- Altcoins are only cheaper because nobody uses them and their price is very low. As a matter of fact if usage of majority of them increased by a small percentage (a tenth of bitcoin usage increase) their fees would rise a lot more than bitcoin's.2. They are not faster. Most of them produce more blocks per 10 minutes on average but that doesn't make them \"fast\" simply because they don't provide the same level of security. In simple terms 1 bitcoin confirmation is usually equal to tens of confirmation on an altcoin chain and in some cases tens of thousands and in a couple of case no matter how many confirmations you get on that altcoin chain it will never be secure (due to being centralized or having mutable blockchains).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Who is John Galt?",
      "created_time": "May 12, 2023, 07:53:16 AM",
      "body": "Quote from: Stalker22 on May 09, 2023, 08:01:55 PMFrom my understanding, the only way miners can help is by not prioritizing transactions solely based on the transaction fees, but I doubt that will ever happen.In another topic, it was proposed to introduce a quota for old payments so that they are included in the block, regardless of the size of the commission. But what if we introduce a quota not for old payments, but for Ordinals? Aren't they typical transactions? We can, perhaps, allocate a quota for them, let's say, in the same 25%, over which they can only be the last in line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 12, 2023, 10:24:39 AM",
      "body": "Quote from: tromp on May 11, 2023, 06:16:34 AMQuote from: suzanne5223 on May 11, 2023, 12:30:07 AMwithout doing the right analysis if it will lead to the congestion of the BTC network.Remember that congestion is the end-goal for Bitcoin in a future with insignificant block subsidy, which is only a few decades away.An uncongested blockchain will never raise enough fees to provide decent security and be subject to cheap 51% attacks. So a fee market must develop where people fight for the right to have their transaction processed swiftly.I'm not sure \"congestion/congested\" is the most appropriate wording. Congestion, in a very simplistic way means that something is not working as it should. Something working now, but not working in the moment after. And then working again and later not working again.In traffic, congestion is not good. Flow without congestion is good. I think the same can be applied here. Mempool full but not congested. A little bit before congestion!Of course that empty mempool is not good either, but it's the mid term we need to seek and this Ordinals and BRC-20 and ORC-20 are congesting the mempool which in my opinion is not good.Quote from: pooya87 on May 12, 2023, 04:32:05 AMIt is a scam but that's not even the thing people are arguing about.All the problems that the Ordinals Attack is creating is because they are abusing Bitcoin and are exploiting the protocol.As I've said many times in the past, even if people were using Ordinals to store cure for cancer on bitcoin blockchain, Ordinals still would be considered a malicious attack.Seems that this opinion is not shared among all devs, right? Like, who considers this an attack and/or an exploit and who doesn't.Also, who sees a fix as a censorship move and who doesn't. In my view, this is an exploit and as with any other software, exploits needs to be fixed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 12, 2023, 11:00:24 AM",
      "body": "I don't know, but the bet that block congestion will continues is a losing bet. The only thing that developed the NFT technology is the cheapness of the fees. No one will pay $140 to upload a photo, and he does not guarantee that he will sell it ---> projects will not continue like this for a long time.The bad side of the story is that we will not go back to those low fees soon, as we will not see, for example, fees less than 10 sat/vb, and therefore the use of bitcoin for daily payments will be the problem.There are solutions to this problem, such as the Lightning Network, but solutions such as Hardfork, due to the increase in fees, is similar to increasing block size, which has proven to be a failed solution.In short, let the economy talk and you'll see fees stabilizing soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "May 12, 2023, 03:06:55 PM",
      "body": "Quote from: hugeblack on May 12, 2023, 11:00:24 AMI don't know, but the bet that block congestion will continues is a losing bet. The only thing that developed the NFT technology is the cheapness of the fees. No one will pay $140 to upload a photo, and he does not guarantee that he will sell it ---> projects will not continue like this for a long time.The bad side of the story is that we will not go back to those low fees soon, as we will not see, for example, fees less than 10 sat/vb, and therefore the use of bitcoin for daily payments will be the problem.There are solutions to this problem, such as the Lightning Network, but solutions such as Hardfork, due to the increase in fees, is similar to increasing block size, which has proven to be a failed solution.In short, let the economy talk and you'll see fees stabilizing soon.The number of those spam transactions gradually decreasing in just a week hopefully it won't be a big issue to concern that is Bitcoin ordinals, the one who hyped the brc20 is on the losing side now. As you said LN is the only option for now to transaction Bitcoin cheaper or else have to wait until it correct after this chaos ends.Increasing the block size limit can be solution too cause in future if there are actually more incoming btc transactions because of more people started to use Bitcoin and by that time if we have same mempool congestion then it act as a barrier for further growth of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 12, 2023, 04:00:39 PM",
      "body": "Quote from: tromp on May 11, 2023, 06:16:34 AMQuote from: suzanne5223 on May 11, 2023, 12:30:07 AMwithout doing the right analysis if it will lead to the congestion of the BTC network.Remember that congestion is the end-goal for Bitcoin in a future with insignificant block subsidy, which is only a few decades away.An uncongested blockchain will never raise enough fees to provide decent security and be subject to cheap 51% attacks. So a fee market must develop where people fight for the right to have their transaction processed swiftly.So before long, congestion must be celebrated rather than criticized. It's crucial for Bitcoin's long term future.Or any PoW coin with a capped supply. Which is why I think Bitcoin Cash is doomed long term. It would take an insane amount of low fee (a fraction of a cent) transactions to pay for their security when their subsify effectively runs out. Their current tx volume of ~10k/day provides under $100 in fees.You have a point about the congested network providing some sort of decent security in terms of 51% attack but excess of everything will lead to something unhealthy. Having said that, I was talking about the situation where it's affecting the price of the Bitcoin market cause people are switching to alternative means of making payments. I also hate the fact that I make payments for my internet network which is 0.001BTC and I have to pay 0.0013BTC for a fast transaction fee and you're telling me to celebrate that? Of course, I am celebrating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}