{
  "id": "topic_5467616",
  "title": "cygan",
  "author": "cygan",
  "created_time": "September 21, 2023, 04:24:50 PM",
  "content": "i came across a website today called UTXO.live with its pythop program UTXOracle.pythrough this website it is possible to get the price of bitcoin without exchanges or third parties.every user who runs this gets the same price independently. its open source, 100% on-chain data, no external libraries, no cookies and works offline.to run this tool you have to make sure that on your node:python3 and bitcoin-cli is installedthat \"server = 1\" is in bitcoin.confif the two points are given the whole must then be executed as 'python3 UTXOracle.py'i personally haven't tried it yet, but i'll definitely do it in a free minute...Quote# This python program estimates the daily USD price of bitcoin using only# your bitcoin Core full node. It will work even while you are disconnected # from the internet because it only reads blocks from your machine. It does not# save files, write cookies, or access any wallet information. It only reads # blocks, analyzes output patterns, and estimates a daily average a USD # price of bitcoin. The call to your node is the standard \"bitcoin-cli\". The# date and price ranges expected to work for this version are from 2020-7-26 # and from $10,000 to $100,000https://utxo.live/oracle/UTXOracle.pyhttps://utxo.live/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467616",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "September 21, 2023, 04:28:59 PM",
      "body": "As it mentions, it is not perfect and it can only be used to fine prices starting at mid-2020. In other words, it is useless for other date ranges because it was calibrated to the 2020 cycle.To be honest, I was not expecting it to be perfect anyway, as only exchanges truly gave the current and historical bitcoin prices on demand, as a trading platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruw",
      "created_time": "September 22, 2023, 05:10:49 PM",
      "body": "It's a cool project, but it doesn't have the precision necessary to be relied on for actual contracts, especially if one were to reverse engineer it to spoof a particular price.  Regardless, I'm surprised USD dominates that much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}