{
  "id": "topic_5414201",
  "title": "Gorilla22",
  "author": "Gorilla22",
  "created_time": "September 20, 2022, 06:36:17 AM",
  "content": "Hi, I am considering myself a newbie even if I own some BTC for a long time, from earlier than 2015 .I own btc, but I didn\"t do anything with them a long, long time. The wallet that I currently have is the one which needs to download terabites of data before it makes BTC available to use. I don't remember its name, but it is one of thouse oldest wallets.I need curretly 3 things to do:1. To move to another wallet.2. To enable myself to claim forks to get them. Preferably later and without to hurry up.3. Start using BTC, spending, selling them etc. But as I was not following the changes in the  BTC  world for many years, currently I don't know how to handle all this. I shall be grateful if you guys  explain for me things like you would explain for a little kid, with as simple words as possible.I asked questions at Stackexchange, and good people answered, but answers were so advanced for me that I didn't understand anything :-) I understood nothing at all :-) My questions are: 1. Can one use BTC now but claim forks later for all previous years?Or is it so that when one spends BTC, it authomatically makes it impossible to claim forks?Please answer simply, like for a kid, for example: \"yes, you can claim forks for previous years later even if you spend all of your BTC now\", or \"First you need to claim forks, because spent BTC authomatically means lost possibility to claim forks\".  Answers that I would understand should be on the level like this :-) Not a higher level :-)Or even like this:\"Get forks first, then use BTC.\"or\"You can use BTC now and get forks later, there is no hurry\". I would be glad if there were possibily to use BTC now and get forks later, because it is very complicated for me to learn how one claims forks, so I need time, and best for me were  to move this thing to do about forks to the future.If such possibility exists, should I do anything special in order not to lose this possibility when I move my BTC to a new wallet? 2. Moving to a new wallet. Which wallet is safe, convenient and simple to use for a non-advanced user like me?Is it so that to move my BTC to a new wallet, I need 2 things:First download a new wallet.Then \"copy\" a \"key\" from the old wallet and \"paste\" it to the new wallet?It is the way the transfer of BTC between 2 wallets works?I heard the word \"export key\". Does it mean just \"copy\" and \"paste\" the key? Thank you very much guys and sorry for my being so unfamiliar with things that are probably basic. Or may be  just give me an instruction (like you would do for a kid or like for a grandfather :-)) about how and in which order to complete 3 tasks: 1. To move to another wallet. Which one?How?2. To enable myself to claim forks to get them. Preferably later and without to hurry up.3. Start using BTC, spending, selling them etc.I shall be grateful for your answers and explanations.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414201",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "September 20, 2022, 06:48:30 AM",
      "body": "answer 1. I would defenately tell you to ALWAYS spend your BTC first BEFORE claiming any forks. Only claim forks after your btc wallet is completely empty (any leftover funds moved to a new, clean, fresh wallet). If not, there might be issues like replay attacks or malware in forked clients and you could potentially lose your btc. It's much better to lose your forked coins than losing your btc.BTW, you know you can only claim funds on future forks, right? If you buy btc now, you won't be able to claim bch or bsv or....answer 2. Depends on how much you hold and what you plan to do with it. If you're only experimenting and need a wallet for a limited amount of funds and a lot of learning, i'd probably go for electrum. If you plan to invest a lot and not move it around all that often, but you still want convenience, i'd go for a hardware wallet... A ledger or something... If you want even more security, you could go for an airgapped wallet, or a properly generated paper wallet, but those kinds of setups need to be done *right*, it's harder to set them up, and if you mess up you could end up with a less secure environment than if you'd use a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 20, 2022, 06:50:05 AM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 06:36:17 AMThe wallet that I currently have is the one which needs to download terabites of data before it makes BTC available to use. I don't remember its name, but it is one of thouse oldest wallets.Not possible. Even bitcoin which is the full client won't require more than 400 gigabyte. Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM1. Can one use BTC now but claim forks later for all previous years?As long as you have the coins before (not after) the fork. Read this to understand more about it:LoyceV's Bitcoin Fork claiming guide (and service)Quote from: Gorilla22 on September 20, 2022, 06:36:17 AMOr is it so that when one spends BTC, it authomatically makes it impossible to claim forks?You do not necessarily have to spend your bitcoin before having control over the fork coins, it's yours, you can do whatever you want with any of them.  Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM2. Moving to a new wallet. Which wallet is safe, convenient and simple to use for a non-advanced user like me?Why not try buy hardware wallet: Open source hardware walletOr go for electrum code storage: https://www.google.com/search?q=Electrum%20cold%20storageQuote from: Gorilla22 on September 20, 2022, 06:36:17 AMThen \"copy\" a \"key\" from the old wallet and \"paste\" it to the new wallet?It is the way the transfer of BTC between 2 wallets works?I heard the word \"export key\". Does it mean just \"copy\" and \"paste\" the key?Key importation would work. But if you used online wallet before and the amount is huge and you want to use cold storage for it, best to just transfer the bitcoin instead of importing the private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 20, 2022, 08:10:58 AM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM1. Can one use BTC now but claim forks later for all previous years?Yes. It is actually preferred that you move the BTC to the new address first, then claim any forks from the old addresses.Quote2. Moving to a new wallet. Which wallet is safe, convenient and simple to use for a non-advanced user like me?There is a topic at the top of this board: [General] Bitcoin Wallets - Which, what, why? I suggest you take a look at it. There is also a list of recommended wallets at: https://bitcoin.org/en/choose-your-wallet I suppose each of these wallets are safe if downloaded from an official source. (I suggest you learn how to verify GPG signatures.) In terms of convenience and simplicity, that is a matter of personal taste. I personally prefer the Electrum wallet or one of the open source hardware wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 20, 2022, 11:39:33 AM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM1. Can one use BTC now but claim forks later for all previous years?\"Get forks first, then use BTC.\"Claiming forks means you are exposing your wallet private key and this contains risk. You should know you use your private key to claim forks, not your Bitcoin. You must have Bitcoin at the fork time, if you don't have it, you have a balance is 0, so claiming does not give you anything.Because of private key leak, you must move your Bitcoin to another wallet (not another address in a same wallet) and after that, you can start claiming forks.Quote2. Moving to a new wallet. Which wallet is safe, convenient and simple to use for a non-advanced user like me?First download a new wallet.Choose non custodial wallets to download. Then verify what you download. Next, install it, create your wallet. Back it up. Test your backup. Try to recover your wallet from a backup. If all are fine, you can use that wallet to store your Bitcoin.Don't store your backup in email, cloud. Write it down, store it offline.QuoteThen \"copy\" a \"key\" from the old wallet and \"paste\" it to the new wallet?It means you import a private key.You can use sweep. Like this Can I sweep private keys from other Bitcoin clients?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 20, 2022, 12:46:19 PM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM1. Can one use BTC now but claim forks later for all previous years?Or is it so that when one spends BTC, it authomatically makes it impossible to claim forks? Yes, you can claim the forked coins any time you want as long as you have the private key for your address. It doesn't matter if you have spend your Bitcoins or not. But for security reasons, it's highly advised to move your btc to a new wallet before claiming the forked coins (entering your private key into different wallet apps) Quote 2. Moving to a new wallet. Which wallet is safe, convenient and simple to use for a non-advanced user like me?Is it so that to move my BTC to a new wallet, I need 2 things:First download a new wallet.Then \"copy\" a \"key\" from the old wallet and \"paste\" it to the new wallet?It is the way the transfer of BTC between 2 wallets works?Buy a hardware wallet. If you can't afford to by one, make sure to use only non custodial open source wallets which have a good reputation. Electrum is one of those wallet but it only supports bitcoin.Instead of exporting your keys and I porting them into a new wallet, I recommend creating a new one and moving your funds to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 20, 2022, 03:08:43 PM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM\"Get forks first, then use BTC.\"NO! This can't be emphasized enough: People have lost their Bitcoins when their Forkwallet contained malware. Don't even think about Forkcoins before your Bitcoins are safe in a new wallet.Quote from: Charles-Tim on September 20, 2022, 06:50:05 AMEven bitcoin which is the full client won't require more than 400 gigabyte.Actually, it's 455 GB by now.Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM2. Moving to a new wallet. Which wallet is safe, convenient and simple to use for a non-advanced user like me?\"It depends\": If you have 0.01 Bitcoin, I would recommend to download Electrum (watch out for fake sites!) and move it there. If you have a much larger amount, there are different possibilities to keep it safe, but considering your questions, a hardware wallet (Trezor or Ledger) is probably the safest and easiest. It depends on how much you're willing to risk and learn.Don't forget to backup your wallet.dat before doing anything else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 20, 2022, 04:20:28 PM",
      "body": "Quote from: khaled0111 on September 20, 2022, 12:46:19 PMBuy a hardware wallet. If you can't afford to by one, make sure to use only non custodial open source wallets which have a good reputation.Since the OP said he has a few bitcoin in his wallet and hasn't touched them since 2015, then I believe he can afford a hardware wallet even more than one. But a non custodial open source wallet is also a good choice for him if the OP doesn't have a lot of bitcoin in that wallet and Electrum is one of my recommendations as well.I guess the OP just needs to do what the current user is suggesting, each of these suggestions should be very simple and easy to understand. So I hope he will update this thread later when he is done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 20, 2022, 06:14:20 PM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM1. Can one use BTC now but claim forks later for all previous years?Or is it so that when one spends BTC, it authomatically makes it impossible to claim forks?I wouldn't worry or think about bitcoin forks at all.For any fork you need to have bitcoin on your own address on the date when snapshot is done and fork happens. I doubt any new Bitcoin forks will show up in near future, unless some crazy bad moves happen with moving from proof of work to proof of stake, but chances for that are minimal.One more option to have hard fork is if Bitcoin adds privacy by default, but this is also unlikely to happen at this moment.Quote from: Gorilla22 on September 20, 2022, 06:36:17 AM2. Moving to a new wallet. Which wallet is safe, convenient and simple to use for a non-advanced user like me?Use only open source wallet that is tested by many users, for example Electrum is a good choice, and it should work fine with all possible forks in future.You can transfer BTC between two wallets by simple send of transaction, but exporting and importing private key is not really moving of coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 20, 2022, 08:57:44 PM",
      "body": "Thank you very much guys!You are great!Now things are much more clear! 1. I understood that forks \"belong\" to an  address. So safe way to get forks  is: moving BTC to another adress, thus leaving old address with ZERO btc balance on it. And only after that one should claim forks FROM THE OLD ADDRESS.Otherwise btc can be stolen.Have I understood right? 2. Then another question appears.How a wallet corresponds with an address?New wallet = new adress? New wallet + imported private key = new adress?Or New wallet + imported private key = old address?Does an address \"belong\" to the wallet or does it \"belong\" to private key? 3. Why is it better just sending btc to new wallet rather than importing private key?As I didn\"t touch my btc for several years, I expect it would take me several months to download all data to the old wallet to make it ready to use.That's why I prefer importing private key to new wallet rather than sending coins.What do you think? Guys, again, thank you so much for your help!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 20, 2022, 11:45:13 PM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 08:57:44 PMHave I understood right? Yes! Don't move forks before your btc because your btc is more valuable and the forked coins will still be there after you've moved the btc. Quote from: Gorilla22 on September 20, 2022, 08:57:44 PM2. Then another question appears.How a wallet corresponds with an address?Private keys are inside wallets. It's a bit like having a wallet with cash in it, the wallet's a nice place to keep things tidy but it's not a necessity for spending - it makes it easier to spend though too, having everything in one place. You're not at risk of dropping a 20 into a grid while you're walking, or you're at less risk at least. Quote from: Gorilla22 on September 20, 2022, 08:57:44 PM3. Why is it better just sending btc to new wallet rather than importing private key?You're wanting to claim your forks so you must move your btc before you do that anyway for security reasons.Secondly, sweeping keys is the safes way to go about importing them because you're going to end up losing your coins quite so easily. New wallets let you sweep keys into a private key that's represented by a seed or a nmemonic which greatly increases the chance of you having a backup. A seed is a long number, sometimes expressed as a nmemonic, but it's much harder to lose than private keys used to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 21, 2022, 07:15:28 AM",
      "body": "Quote from: Gorilla22 on September 20, 2022, 08:57:44 PMNew wallet + imported private key = old address?Correct. Unless your wallet turns it into a Segwit address (each private key can generate a few different addresses). If the address starts with a 1, it's your old (Legacy) address.QuoteAs I didn\"t touch my btc for several years, I expect it would take me several months to download all data to the old wallet to make it ready to use.That depends on your computer: if you have a modern computer and fast internet, it should only take a day (but you may want to upgrade Bitcoin Core, after making a backup of your wallet.dat).And of course, make sure your computer doesn't have malware. If you're holding a high value, you can add precautions such as keeping your wallet offline and signing transactions there. It's a bit more complicated, so it depends on what you're comfortable iwth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 21, 2022, 08:49:20 AM",
      "body": "Many thanks guys!You are wonderful people!Now things are even more clear and I have got a plan.Could you please look at it and approve or disapprove or correct it! The plan. Step 1.Set up a new wallet. It will be New-wallet-1.Now I have 2 wallets: the old one and the new one. Step 2.Move the btc from the old wallet to the new wallet using importing private key.Now I have a NEW WALLET  with the OLD ADDRESS.The old wallet became useless. Step 3.Set up an additional New-wallet-2.Send btc to it as a simple transaction.Now I have 3 wallets:1) New-wallet-2 with a NEW ADDRESS and btc on it. This wallet is good to use btc.2) New-wallet-1 with the old address and zero btc balance on it.This wallet is good to claim forks.3) Old wallet which is totally useless. Step 4.Delete old wallet.Use New-wallet-1 to claim forks.Use New-wallet-2 for btc. Is it a good plan? About sending btc from old wallet rather than importing private key. My computer with btc on it is very old.It is more than 7 years old :-)And it has only 500 GB hard disk.And from my past experience it takes extremely long time to download all that data.That's why I want to avoid the option with simply sending btc to the new wallet as a transaction.Sorry guys I still don't understand clearly why importing private key is a bad option.Can btc be lost while using this option?Can btc be stolen while using this option?Is there any good and secure way to move to a new wallet using private key? Thank you guys!Wishing you a great and profitable day! :-)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 21, 2022, 09:30:20 AM",
      "body": "Quote from: Gorilla22 on September 21, 2022, 08:49:20 AMStep 1.Set up a new wallet. It will be New-wallet-1.Now I have 2 wallets: the old one and the new one. Step 2.Move the btc from the old wallet to the new wallet using importing private key.Now I have a NEW WALLET  with the OLD ADDRESS.Add Step 1.5: create a backup of the new wallet. Make this a habit.QuoteThe old wallet became useless.No, the old wallet still has full access to your coins! Also note that you may have more than one address in there.QuoteStep 3.Set up an additional New-wallet-2.Again: create a backup before funding it.QuoteSend btc to it as a simple transaction.Correct. Don't overpay on transaction fees.QuoteNow I have 3 wallets:1) New-wallet-2 with a NEW ADDRESS and btc on it. This wallet is good to use btc.2) New-wallet-1 with the old address and zero btc balance on it.This wallet is good to claim forks.3) Old wallet which is totally useless.Old wallet has the same value as New-wallet-1.QuoteStep 4.Delete old wallet.This guy knows a thing or 2 about Bitcoin:Quote from: satoshi on October 03, 2010, 08:54:07 PMSigh... why delete a wallet instead of moving it aside and keeping the old copy just in case?  You should never delete a wallet.Quote from: Gorilla22 on September 21, 2022, 08:49:20 AMUse New-wallet-1 to claim forks.Inaccurate. You'll need the private keys from that wallet to claim Forks in different wallets. See my guide and don't do it before you understand what the lack of replay protection means.QuoteUse New-wallet-2 for btc.Is it a good plan?It depends  Could malware steal an amount that makes you cry? If so, you'll need to change your setup. If not, you're good to go.QuoteMy computer with btc on it is very old.Mine too QuoteAnd it has only 500 GB hard disk.Prune the blockchain.QuoteAnd from my past experience it takes extremely long time to download all that data.Without enough RAM, and without SSD, it is indeed very slow. A newer Bitcoin Core version may improve this a bit, but it's still very hard on your hardware.QuoteSorry guys I still don't understand clearly why importing private key is a bad option.It's a great option, as long as you know what you're doing. It's also good to know clipboard malware exists.QuoteCan btc be lost while using this option?If you mess up: yes.QuoteCan btc be stolen while using this option?If you mess up and/or have malware: yes.QuoteIs there any good and secure way to move to a new wallet using private key?Yes. Keep it offline. See this post and adjust it to your needs (that post starts with a paper wallet instead of Bitcoin Core).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 21, 2022, 10:13:54 AM",
      "body": "Thank you LoyceV !\"It depends. Could malware steal an amount that makes you cry? If so, you'll need to change your setup. If not, you're good to go.\"Have I understood correct that the only bad thing about my plan is risk of malware?And otherwise it is good?Can you please tell me, what should be changed in this setup to avoid that risk of malware stealing my coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 21, 2022, 10:20:42 AM",
      "body": "LoyceV, You wrote \"Prune the blockchain.\"What do you mean? Is there a possibility not to download the whole blockchain?Or are you kidding? (LOL).Btw, I am still learning how to use this forum.Sorry if I do something wrong.I shall learn!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 21, 2022, 10:21:20 AM",
      "body": "Quote from: Gorilla22 on September 21, 2022, 10:13:54 AMHave I understood correct that the only bad thing about my plan is risk of malware?And spyware, and entering the wrong address, and sending 99% as fee, and many more things that have happened to people in the past.QuoteAnd otherwise it is good?Can you please tell me, what should be changed in this setup to avoid that risk of malware stealing my coins?I prefer to sign any substantial amount offline, that way no malware can steal anything.Quote from: Gorilla22 on September 21, 2022, 10:20:42 AMYou wrote \"Prune the blockchain.\"It's an option, either in Settings or on the command line when you start Bitcoin Core. You'll still need to download 450 GB, but it won't fill your disk.Please edit your post instead of posting twice in a row, that's not allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 21, 2022, 10:45:56 AM",
      "body": "LoyceV,Thank you again! You are a great teacher for newbies, really!I am learning from you a lot and updating my knowledge quickly!Yes!Question about importing private key.You wrote that there were a risk to loose btc using this option because of:1. Because of malware/spyware. OK, I understand this.2. Because of myself.  If I mess up something.Could you please tell, How can btc be lost if I mess up something when:- To import private key one must do a basic 10 seconds operation: Copy private key in old wallet and paste it to new wallet.- As long as old wallet is not deleted, and old private key is not deleted, nothing can be lost  even if I do importing private key completely wrong.This is how I understand the situation now!If it is not correct, please tell me what I understood wrong.So that I know where to be especially careful!Many, many thanks for your help and your patience with such a \"student\" like me :-)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 21, 2022, 11:00:10 AM",
      "body": "Quote from: Gorilla22 on September 21, 2022, 10:45:56 AMYou wrote that there were a risk to loose btc using this option because of:1. Because of malware/spyware. OK, I understand this.2. Because of myself.  If I mess up something.Could you please tell, How can btc be lost if I mess up something when:- To import private key one must do a basic 10 seconds operation: Copy private key in old wallet and paste it to new wallet.- As long as old wallet is not deleted, and old private key is not deleted, nothing can be lost  even if I do importing private key completely wrong.There are endless possibilities that can happen: you could paste your private key into an email, post it online, someone could see it on your screen, enter it into a compromised wallet (again: many fake Electrum wallets out there), etc.Just assume someone's out to get your money, and assume your computer isn't safe. Some paranoia helps Here's another real-life scenario that happened to a clueless and innocent Newbie:Quote from: LoyceV on February 20, 2019, 06:49:26 PMScenarioSomeone has a problem with a wallet, comes to Bitcointalk, creates an account, asks a question, and gets a solution. Great! A happy new user for the forum, and another happy Bitcoin user, which adds to Bitcoin's popularity.Reality (2 days ago)Someone has a problem with a wallet, comes to Bitcointalk, creates an account, asks a question, gets \"help\" by PM from someone who asks him to enter some code into Electrum, enter his password (and I quote: \"(NEVER share this password with anybody)\"), and gets scammed out of $30,000.Another clueless naive new user bites the dust, the forum loses a new user, and Bitcoin loses a potential user forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 21, 2022, 11:12:06 AM",
      "body": "LoyceV,OK!Now I understand (in general) the whole thing about my plan!Now it's time to choose a new wallet......Thank you very much!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}