{
  "id": "topic_5405789",
  "title": "Wavalli",
  "author": "Wavalli",
  "created_time": "July 10, 2022, 01:01:09 PM",
  "content": "I think most on here are aware that many of the scams and failed projects we see are perpetrated by the anti-crypto crowd.  The incredible and persistent effort we see put into DDOS attacks makes that pretty obvious once you connect the dots. I am of the opinion that in fact the vast majority of such projects are derail attempts, but I wanted to see what others thought.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405789",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "July 11, 2022, 05:37:05 PM",
      "body": "I think it's also to make it hard for people to find the right project, and to make them become negative towards Cryptocurrencies.Reminds me of myself, when I give a society pure gold(for example) , the enemy fills that society with fake fanciful & worthless gold making mine to look fake and worthless too... Next the society stop valuing your gold/contributions thinking they're all worthless like others.One of the ways out of this is to find a way to convince people that yours is the original by allowing them to test the quality however they want",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 11, 2022, 06:39:22 PM",
      "body": "Scams != Failed Projects != DDOS, it's a different thing.I believe scams and failed projects are just riding the hype, while scams have malicious intent, failed projects are because incompetency.DDOS is because of unfair competition between many chains. All of these are not sabotage.I think we can see more sabotage efforts from central banks / governments with its harmful policy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "July 12, 2022, 08:43:25 AM",
      "body": "Quote from: mu_enrico on July 11, 2022, 06:39:22 PMScams != Failed Projects != DDOS, it's a different thing.I believe scams and failed projects are just riding the hype, while scams have malicious intent, failed projects are because incompetency.DDOS is because of unfair competition between many chains. All of these are not sabotage.I think we can see more sabotage efforts from central banks / governments with its harmful policy.It's better to reduce the chances of projects failing by putting in place measures to eliminate or reduce that possibility. In regards to scams, they will have zero chance of scaling through with my home brewed measures.Sometimes I think they are are allowed to fail for cultural reasons: probably in the name of free speech and the belief that people learn from their failures. Those who wish to learn from failing first could do that via experimentation without taking too much risk. The scams should be outrightly rejected.Doing this with little to no assistance from outside forces will reduce the chances of government takeover. Scam problem is one of govt most convincing takeover excuse",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}