{
  "id": "topic_5445073",
  "title": "Lillominato89",
  "author": "Lillominato89",
  "created_time": "March 15, 2023, 11:36:23 PM",
  "content": "A quanto pare è stato chiuso la nota piattaforma chipmixer con accuse pesanti, riciclaggio di bitcoin provenienti da truffe e furtihttps://cointelegraph.com/news/us-justice-department-announces-charges-in-connection-with-chipmixer-takedownChipmixer era noto qui sul forum per essere una delle campagne firme più longeve e remunerativa",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445073",
  "comments": [
    {
      "author": "Ale88",
      "created_time": "March 16, 2023, 01:47:24 AM",
      "body": "Quote from: Lillominato89 on March 15, 2023, 11:36:23 PMriciclaggio di bitcoin provenienti da truffe e furti",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "March 16, 2023, 06:53:38 AM",
      "body": "Si sapeva che non sarebbe potuto durare in eterno, ed abbiamo (ho) apprezzato i loro servizi (firma e sito) fino a quando ho potuto. La cosa curiosa è che si persegue un servizio legale, solo perchè alcuni degli utenti lo usavano per motivazioni illegali. Come se sequestrassero la rete TIM perchè tutti i criminali usano la rete TIM. Semmai è una prova che la rete TIM funziona bene....non che la rete TIM favorisce il crimine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "March 16, 2023, 07:27:50 AM",
      "body": "Quote from: fillippone on March 16, 2023, 06:53:38 AMSi sapeva che non sarebbe potuto durare in eterno, ed abbiamo (ho) apprezzato i loro servizi (firma e sito) fino a quando ho potuto. La cosa curiosa è che si persegue un servizio legale, solo perchè alcuni degli utenti lo usavano per motivazioni illegali. Come se sequestrassero la rete TIM perchè tutti i criminali usano la rete TIM. Semmai è una prova che la rete TIM funziona bene....non che la rete TIM favorisce il crimine. Non potevi fare paragone migliore, purtroppo garantiva un servizio che remava contro le volontà del KYC e del AML e quindi faceva storcere il naso a chi voleva controllare tutto di tutti. Chissà se qualcuno di importante avrà mai usato chipmixer per ripulire i suoi Bitcoin, ma noi questo non lo sapremo mai",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "March 16, 2023, 07:29:30 AM",
      "body": "azzoquesto conferma la mia tesi, che in ottica di CDBC stanno facendo una guerra contro tutti e tuttodi sicuro possono spuntarla contro le \"aziende\" o \"lobby\" come tether eth e via dicendoma bitcoin e' come linuxchi citi in giudizio? a chi mandi gli avvocati?scusate ma ci staSUCA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hymperion",
      "created_time": "March 16, 2023, 07:37:22 AM",
      "body": "Chissà da quanto tempo ci stavano alle calcagne... Ennesima dimostrazione che vogliono il controllo su tutti e su tutto e far capire che tutto deve passare da loro.Mi dispiace per chipmixer, peccato.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "giammangiato",
      "created_time": "March 16, 2023, 08:02:02 AM",
      "body": "anche a me dispiace molto. Dai, come si dice in sicilia, si chiude una porta e si apre un portone!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "March 16, 2023, 08:22:13 AM",
      "body": "Quote from: hymperion on March 16, 2023, 07:37:22 AMChissà da quanto tempo ci stavano alle calcagne... Ennesima dimostrazione che vogliono il controllo su tutti e su tutto e far capire che tutto deve passare da loro.Mi dispiace per chipmixer, peccato.Pare che li controllavano dal 2019, o almeno ho inteso così dal articolo. Purtroppo le cose che funzionano troppo bene danno fastidio a qualcuno!Quote from: babo on March 16, 2023, 07:29:30 AMazzoquesto conferma la mia tesi, che in ottica di CDBC stanno facendo una guerra contro tutti e tuttodi sicuro possono spuntarla contro le \"aziende\" o \"lobby\" come tether eth e via dicendoma bitcoin e' come linuxchi citi in giudizio? a chi mandi gli avvocati?scusate ma ci staSUCAConcordo sulla esclamazione finale! Ci sta alla grande 😅",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "March 16, 2023, 09:37:11 AM",
      "body": "bro' io ho fatto anni di lottasono andato dal giudice di pace a citare microsoft per l'obolo su un SO che io non volevoho fatto tantissimolinux e' qua, vivo e vegato e fa girare il mondo ITno linux, no aws, no facebook.. no google .. no nientequindi non mi devono cacare il cazzo, loro che fanno i giochini con le azioni finanziarie e i loro trade a leva di merda che non capiscono una minchia di efficienzaqua, nel mondo dell'efficienza comanda l'opensource e comanda l'efficienza, non i fiocchetti rosa o le frasi ad effetto di merda",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "March 16, 2023, 10:20:21 AM",
      "body": "Quote from: fillippone on March 16, 2023, 06:53:38 AMSi sapeva che non sarebbe potuto durare in eterno, ed abbiamo (ho) apprezzato i loro servizi (firma e sito) fino a quando ho potuto. La cosa curiosa è che si persegue un servizio legale, solo perchè alcuni degli utenti lo usavano per motivazioni illegali. Come se sequestrassero la rete TIM perchè tutti i criminali usano la rete TIM. Semmai è una prova che la rete TIM funziona bene....non che la rete TIM favorisce il crimine. Allora, vado controcorrente (che inizi il flame!!!):Sono favorevolissimo all'utilizzo di chipmixer e altri servizi che hanno degli usi legittimi.Quello che secondo me è capitato, mia impressione senza conferme:Gli utilizzi illeciti ultimamente erano una pesante maggioranza rispetto agli usi leciti. A quel punto l'autorità ha pensato che si trattasse di un covo di bisce e ha tirato giù tutto, tagliando le gambe anche a chi ne faceva uso lecito (basti vedere le 7-8 polizie presenti sulla pagina di blocco)Dico questo perché in passato abbiamo visto situazioni di truffe utilizzando exchange, ecc... Dove l'operatività dello stesso non era impattata, al max. si apriva un fascicolo e l'exchange forniva gli elementi di cui era in possesso.Qui partiamo da un servizio senza KYC, dove saranno transitati molti soldi da riciclare e la frittata è fatta. Magari c'è stato un pregresso di subpoena o \"piccole\" richieste di informazioni finché i problemi non erano troppi, di cui non siamo al corrente.I prossimi che secondo me potrebbero essere target di operazioni del genere sono i siti di gambling, specialmente se consentono il prelievo senza giocate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "March 16, 2023, 11:08:53 AM",
      "body": "Quote from: babo on March 16, 2023, 09:37:11 AMbro' io ho fatto anni di lottasono andato dal giudice di pace a citare microsoft per l'obolo su un SO che io non volevoho fatto tantissimolinux e' qua, vivo e vegato e fa girare il mondo ITno linux, no aws, no facebook.. no google .. no nientequindi non mi devono cacare il cazzo, loro che fanno i giochini con le azioni finanziarie e i loro trade a leva di merda che non capiscono una minchia di efficienzaqua, nel mondo dell'efficienza comanda l'opensource e comanda l'efficienza, non i fiocchetti rosa o le frasi ad effetto di merdaBro è anche vero che tu ci lavori nel settore informatico, quello che hai detto e fatto per me è motivo di stima nei tuoi confronti. Winzoz è il male nato da una scopiazzatura, in America manco se lo filano Windows se non in percentuali minori rispetto ai Mac. Linux è per veri intenditori, per i libertari. Ma devo dare atto che senza Windows il 90 percento della popolazione mondiale che usa un PC lo fa grazie a winzoz che era di semplice utilizzo, non sarebbe stata in grado di saper utilizzare un PC senza dover studiare come funzionasse, di contro si è creata un utenza pigra che vuole la pappa pronta sempre",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "March 16, 2023, 11:34:13 AM",
      "body": "Dato che siamo in tema, privacy,  ripropongo un vecchio post:Un trattato su Bitcoin e la PrivacySottoscrivo tutto quanto scritto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "March 17, 2023, 07:43:13 AM",
      "body": "@alexrossi = nessun sito di gambling ti permette di prelevare senza fare una giocata (è un argomento trito e ritrito nella sezione gambling discussion). Ok puoi prelevare dopo che giochi una quota a 1.01 ma non puoi prelevare dopo un semplice versamento.Una cosa simile era possibile con alcuni faucet (i vecchi moonbitcoin/moonlitecoin/moondogecoin) ma sono belli defunti, e chissà se anche loro hanno sub-odorato una problematica simile anni fa....sulla vicenda di questo topic...https://www.justice.gov/opa/press-release/file/1574581/download qui trovate i dettagli sulla vicenda direttamente sul sito della FBI. last but not least aspetto con ansia di leggere i commenti di un \"utente\" che sosteneva con estrema malesucazione/assenza di qualsivoglia prova oggettiva, la tesi che \"tutti i mixer sono honeypot della NSA/FBI\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "March 17, 2023, 07:52:25 AM",
      "body": "Quote from: bitbollo on March 17, 2023, 07:43:13 AM@alexrossi = nessun sito di gambling ti permette di prelevare senza fare una giocata (è un argomento trito e ritrito nella sezione gambling discussion). Ok puoi prelevare dopo che giochi una quota a 1.01 ma non puoi prelevare dopo un semplice versamento.Una cosa simile era possibile con alcuni faucet (i vecchi moonbitcoin/moonlitecoin/moondogecoin) ma sono belli defunti, e chissà se anche loro hanno sub-odorato una problematica simile anni fa....+Su primedice tempo fa si poteva, se non ricordo male. Tempo fa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "March 17, 2023, 07:56:37 AM",
      "body": "Quote from: alexrossi on March 17, 2023, 07:52:25 AMQuote from: bitbollo on March 17, 2023, 07:43:13 AM@alexrossi = nessun sito di gambling ti permette di prelevare senza fare una giocata (è un argomento trito e ritrito nella sezione gambling discussion). Ok puoi prelevare dopo che giochi una quota a 1.01 ma non puoi prelevare dopo un semplice versamento.Una cosa simile era possibile con alcuni faucet (i vecchi moonbitcoin/moonlitecoin/moondogecoin) ma sono belli defunti, e chissà se anche loro hanno sub-odorato una problematica simile anni fa....+Su primedice tempo fa si poteva, se non ricordo male. Tempo fa. a memoria, da quando sono iscritto su primedice o stake non è mai stato possibile  proprio perchè verrebbe usato come sito per fare mixing e ... ovviamente è un qualcosa da cui preferiscono tenersi alla larga (ormai anche loro chiedono KYC con diversi livelli in base al quantitativo giocato...)qualche mese fa c'era la storia (allucinante) di un utente che era autoescluso da stake e per sbaglio aveva mandato una grossa somma sul wallet. Non può prelevarlo perchè deve fare almeno una giocata / non può fare una giocata perchè autoescluso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "March 17, 2023, 08:34:11 AM",
      "body": "bitbollo ho visto ora il PDF dell'FBI... pazzesca la ricerca che è stata fatta.Premesso che dalla quantità di info raccolte mi sembra un indagine che supera tranquillamente il milione di dollari, oltre a ciò mi pare incredibile che il tizio dietro a chipmixer, tale Nguyen, fosse così scheletrico e scavatoPer aver lavato 3 miliardi di dollari, cosa gli aspetta come sentenza? Deve essere estradato negli US?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "March 17, 2023, 11:29:13 PM",
      "body": "Quote from: alexrossi on March 17, 2023, 08:34:11 AMbitbollo ho visto ora il PDF dell'FBI... pazzesca la ricerca che è stata fatta.Premesso che dalla quantità di info raccolte mi sembra un indagine che supera tranquillamente il milione di dollari, oltre a ciò mi pare incredibile che il tizio dietro a chipmixer, tale Nguyen, fosse così scheletrico e scavatoPer aver lavato 3 miliardi di dollari, cosa gli aspetta come sentenza? Deve essere estradato negli US?Lo hanno pure tracciato con Google. Non male. Questo però vi dà un'idea di quante traccia, digitali o meno, si lascino in giro. Comprese le foto Apple, tra l'altro...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 18, 2023, 07:48:50 AMLast edit: March 18, 2023, 08:09:15 AM by mendace",
      "body": "Scusate se faccio la voce fuori dal coro ma qualche mese fa probabilmente sarei stato a favore di chipmixer o altri servizi simili ma oggi ho una visone ancora più chiara e privacy oriented e non userei mai questi mixer quando ci sono soluzioni molto più sicure come joinmarket. Fra l'altro non c'è nemmeno la possibilità di visionare il codice a differenza di JM appunto che è open source e chiunque potrebbe farlo. Inoltre questi mixer o sono servizi messi su dai servizi governativi in modo da aver il controllo totale oppure finiscono nella peggior delle ipotesi per scammare il pesce grosso. Non servono a niente questi strumenti basta usare la testa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "March 18, 2023, 08:07:28 AM",
      "body": "Quote from: mendace on March 18, 2023, 07:48:50 AMScusate se faccio la voce fuori dal coro ma qualche mese probabilmente sarei stato a favore di chipmixer o altri servizi simili ma oggi ho una visone ancora più chiara e privacy oriented e non userei mai questi mixer quando ci sono soluzioni molto più sicure come joinmarket. Fra l'altro non c'è nemmeno la possibilità di visionare il codice a differenza di JM appunto che è open source e chiunque potrebbe farlo. Inoltre questi mixer o sono servizi messi su dai servizi governativi in modo da aver il controllo totale oppure finiscono nella peggior delle ipotesi per scammare il pesce grosso. Non servono a niente questi strumenti basta usare la testa.Sicuramente JM è un livello di protezione superiore, ma il problema era l’interfaccia.  Sicuramente chipmixer era più facile da usare e soprattutto aveva un volume molto maggiore. Su  JM non saresti mai riuscito a far passare le somme che sono passate su CM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 18, 2023, 08:14:05 AM",
      "body": "Quote from: fillippone on March 18, 2023, 08:07:28 AMSicuramente JM è un livello di protezione superiore, ma il problema era l’interfaccia.  Sicuramente chipmixer era più facile da usare e soprattutto aveva un volume molto maggiore. Su  JM non saresti mai riuscito a far passare le somme che sono passate su CMPer l'interfaccia puoi usare JAM che rende il tutto molto friendly e con un nodo umbrel, embassy, ecc.. È tutto self-hosted. Il discorso delle somme ingenti sarebbe da capire come funzionava effettivamente dato che il codice non era visionabile e infatti sono stati beccati, mettendo a rischio sicuramente chi ne faceva uso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}