{
  "id": "topic_5409558",
  "title": "Free Market Capitalist",
  "author": "Free Market Capitalist",
  "created_time": "August 12, 2022, 05:39:00 AM",
  "content": "I was going through this thread: Information of Crypto Casinos License and KYC requirementsIn that list there are some casinos that do not have a license and usually coincide with those that do not have KYC requirements or rarely ask for it. I believe that this list will become smaller over time and that in a few years there will be far fewer casinos operating without a license and without KYC requirements, but that is another matter.The question I have is, how do they legalize the money they earn from the casino? Those that have a license from a tax haven have no problem, but without a license? How do they do it? Some of them handle a lot of money. For example, looking on the web, I see that freebitco.in has a revenue of $5M per year. I don't know how accurate this is, but I am not surprised by such a figure.What I wonder is how they can then manage all the money they make. Do they have a company even if they don't have a gambling license? If they don't have a company, how do they do it? I'm sure with the money they make they will have lawyers and tax advisors to guide them on how to do it, but it makes me curious.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409558",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "August 12, 2022, 02:03:38 PM",
      "body": "Quote from: Poker Player on August 12, 2022, 05:39:00 AMThe question I have is, how do they legalize the money they earn from the casino? I only have limited knowledge, but AFAIK, there's no general answer to this question because rules aren't the same in each jurisdiction.Quote from: Poker Player on August 12, 2022, 05:39:00 AMFor example, looking on the web, I see that freebitco.in has a revenue of $5M per year. I don't know how accurate this is, but I am not surprised by such a figure.What I wonder is how they can then manage all the money they make. Do they have a company even if they don't have a gambling license? Not sure how accurate is the other thread you mentioned earlier, but they're claiming to have \"an operating license for online casino games [not sure if it's different from what you were asking]\" and as long as there's a \"proper\" system in place, there shouldn't be any issues with managing such things.- Btw, I had no luck in finding anything in regards to their company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 13, 2022, 04:12:29 AM",
      "body": "Quote from: SFR10 on August 12, 2022, 02:03:38 PMNot sure how accurate is the other thread you mentioned earlier, but they're claiming to have \"an operating license for online casino games [not sure if it's different from what you were asking]\" and as long as there's a \"proper\" system in place, there shouldn't be any issues with managing such things.- Btw, I had no luck in finding anything in regards to their company.Yes, I imagine that to handle large amounts of money, some kind of business or some kind of license they have to have, so it's all much easier, otherwise to be able to spend the benefits of the casino you're going to have a hard time, especially if you want to spend medium amounts upwards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 13, 2022, 05:25:48 AM",
      "body": "I do not know how gambling works, but let's talk in general about your achievement of profits higher than your normal income (for individuals or companies), it is easy for you to enter this money by manipulating stock prices or claiming that you have made profits from cryptocurrencies.Most of these funds are transferred to assets in other countries, and with the fluctuation of the prices of these assets, they are returned to the original country as profits.This is if we ignore the issue of money laundering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 13, 2022, 08:34:05 PM",
      "body": "If the company operates legally, but the official website should contain information about the company with registration data, contacts and a license.If this data is hidden, then there are problems with the law.And it is not difficult to legalize money for a certain percentage in many countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 14, 2022, 02:15:33 PM",
      "body": "Freebitcoin is basically a faucet that tries really hard to make you gamble away all of it, but that is not where most of the revenue comes from.They convince people to put more money in their cash and Lambo loterries, so just treat it like your average lottery company (and please just buy the Lambo with your own cash, it's much easier for you, thanks).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 17, 2022, 01:37:36 PM",
      "body": "I think that the gambling companies on this list do not have licenses, but if I'm wrong, then let me know about ithttps://bitcointalk.org/index.php?topic=615953.msg60742572#msg60742572The gaming business in the cryptocurrency area will remain in the dark zone for a long time. Until the regulators get fed up and repeat the history of the Tornado.cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 18, 2022, 04:34:23 AM",
      "body": "Quote from: zasad@ on August 17, 2022, 01:37:36 PMI think that the gambling companies on this list do not have licenses, but if I'm wrong, then let me know about ithttps://bitcointalk.org/index.php?topic=615953.msg60742572#msg60742572It seems to me that you are getting confused, this is the list of companies that run signature campaigns in the forum, and among them there are gambling houses and others that are not gambling like CM or BC. Among the gambling sites, there are some that are not licensed, and some others that are, such as Playbetr or Betcoin.Quote from: zasad@ on August 17, 2022, 01:37:36 PMThe gaming business in the cryptocurrency area will remain in the dark zone for a long time. Until the regulators get fed up and repeat the history of the Tornado.cash.I don't think it will last long in the current situation. The trend will be towards more government control and more KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 19, 2022, 09:59:37 PM",
      "body": "Okay, I just want to remove the gambling from this discussion and just talk about every company which is running all around the world. Most of the companies either its small or regulated by their respective regulatory body but still we can see cases against even the biggest companies has been sued by the government for tax evasion and importantly they are filing the case against them now for something which happened a decade ago so I don't believe having the license is not really enough to say that a company is paying all their taxes perfectly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 20, 2022, 06:25:00 AM",
      "body": "Quote from: jrrsparkles on August 19, 2022, 09:59:37 PMOkay, I just want to remove the gambling from this discussion and just talk about every company which is running all around the world. Most of the companies either its small or regulated by their respective regulatory body but still we can see cases against even the biggest companies has been sued by the government for tax evasion and importantly they are filing the case against them now for something which happened a decade ago so I don't believe having the license is not really enough to say that a company is paying all their taxes perfectly.The difference in this case is that you are talking about companies with licenses that evade a portion of their taxes.Here we are talking about the possibility that these businesses, at least some of them, that are not licensed, get all their revenue without declaring it and how they can do so in order to spend it later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 20, 2022, 04:53:50 PM",
      "body": "Quote from: Poker Player on August 20, 2022, 06:25:00 AMQuote from: jrrsparkles on August 19, 2022, 09:59:37 PMOkay, I just want to remove the gambling from this discussion and just talk about every company which is running all around the world. Most of the companies either its small or regulated by their respective regulatory body but still we can see cases against even the biggest companies has been sued by the government for tax evasion and importantly they are filing the case against them now for something which happened a decade ago so I don't believe having the license is not really enough to say that a company is paying all their taxes perfectly.The difference in this case is that you are talking about companies with licenses that evade a portion of their taxes.Here we are talking about the possibility that these businesses, at least some of them, that are not licensed, get all their revenue without declaring it and how they can do so in order to spend it later.Since this is internet based business on this sector where many government still has to update their old laws which created before 50 years or even older used as an advantage to bypass the regulation even if there is law suit against them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 20, 2022, 05:05:07 PM",
      "body": "1) Location: If they operate out of a location that does not care then they can do it for a very long time. I can register a business and host web servers just about anyplace. So, if you do it in a location that is lax with rules. You are fine.2) Small enough not to matter: If on the surface and even when digging a bit it appears you have very little revenue then a lot of governments will not go after you. It seems silly but there does have to be some justification in the enforcement world to do things. The DaveF casino that has almost no traffic is going to get a lot less scrutiny then some larger places. 3) Good old fashioned kickbacks / bribes.  There is nothing going on in this data center we are totally legit, we are so honest we even leave envelopes of cash sitting around just like this one......There are more, so no matter how many we all come up with there will probably be some that we missed.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 20, 2022, 07:21:54 PM",
      "body": "Quote from: Poker Player on August 18, 2022, 04:34:23 AMQuote from: zasad@ on August 17, 2022, 01:37:36 PMI think that the gambling companies on this list do not have licenses, but if I'm wrong, then let me know about ithttps://bitcointalk.org/index.php?topic=615953.msg60742572#msg60742572It seems to me that you are getting confused, this is the list of companies that run signature campaigns in the forum, and among them there are gambling houses and others that are not gambling like CM or BC. Among the gambling sites, there are some that are not licensed, and some others that are, such as Playbetr or Betcoin.Quote from: zasad@ on August 17, 2022, 01:37:36 PMThe gaming business in the cryptocurrency area will remain in the dark zone for a long time. Until the regulators get fed up and repeat the history of the Tornado.cash.I don't think it will last long in the current situation. The trend will be towards more government control and more KYC.I meant only gambling companies from this listhttps://www.playbetr.com/\"Playbetr.com is licensed by Dutch Antilles Management N.V. through Global Limited Holding EOOD, License GLH-OCCHKTW0706262018. Casino games offered on Playbetr.com are provided and regulated by Gaming Services Provider, N.V., who are operating under the license 365/JAZ issued to CURACAO eGAMING by the Government of Curacao. Company registration number 10692 and corporate address 9 Abraham de Veerstraat.\"https://opencorporates.com/companies/cw/10692http://www2.curacao-chamber.cw/excerpt.asp\"Authorized capital   Antillean Guilder 100.000,00Issued capital   Antillean Guilder 20.000,00   - 10000$Paid up capital   Antillean Guilder 20.000,00    -10000$Title description   President Managing DirectorName   Alberto Clodoaldo D'Abreu De PauloDate of birth   September 7, 1938\"Very interesting company",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 09, 2022, 03:20:27 AM",
      "body": "Upon learning of this thread yesterday:⚽🎰 Casino Critique⭐ FREE Chip for BCT Members ❤️‍🔥I thought of commenting here.In short it is a business model based on crypto casino reviews, which you want to launch looking for some funding in the forum.It will have 68 people working, of which 66 will be paid $1.5k per month and the two CEOs or whatever they are called will be paid at least $15k per month. It is a project without KYC, paid in Bitcoin, so I imagine that especially those who will get pais $15k a month (if everything goes well) will have some way to legalize the money they earn.I imagine that in certain countries there must be some easy way to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 12, 2022, 06:36:26 PM",
      "body": "Quote from: Poker Player on August 12, 2022, 05:39:00 AMI believe that this list will become smaller over time and that in a few years there will be far fewer casinos operating without a license and without KYC requirements, but that is another matter.The question I have is, how do they legalize the money they earn from the casino? Those that have a license from a tax haven have no problem, but without a license? How do they do it? Some of them handle a lot of money. I wonder what is the curiosity on it, like how does it mean to legalize the money when gamblers have chosen to play with casinos not operating on licence or have not been playing with those with kyc?. I don't think this is the business of the casinos but that the players patronize them and make them stay alive. Is more like asking why some gambling site on scam allegation or that are known to have scammed players are still existing and having customers , because some people still patronize them. Some gamblers don't like playing under a kyc condition in the first place so they will look towards those not  kyc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}