{
  "id": "topic_5499761",
  "title": "roxane40",
  "author": "roxane40",
  "created_time": "June 13, 2024, 07:57:49 AM",
  "content": "Given the difficulty level, and low sophistication of the code, would it have been possible to mine Bitcoin with a cellphone in 2009? Is it possible to fork the blockchain, and make a new version of bitcoin and the bitcoin software that can be mined on a cellphone again? Or at least a low grade CPU?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5499761",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "June 13, 2024, 08:06:35 AM",
      "body": "Quote from: roxane40 on June 13, 2024, 07:57:49 AMGiven the difficulty level, and low sophistication of the code, would it have been possible to mine Bitcoin with a cellphone in 2009? Is it possible to fork the blockchain, and make a new version of bitcoin and the bitcoin software that can be mined on a cellphone again? Or at least a low grade CPU?Yup, in 2009 you could have developed a mining software that could be run on about any recent device (albeit, at that time, smartphones were still really new, but you might have had a couple android phones that could have mined over wifi). Offcourse, you would also had to have developed all other infrastructure... Port bitcoin core for android, patch it so you could use a seperate mining software,... https://en.bitcoin.it/wiki/2009The difficulty rose from 1 to 1.18 in december 2009... At those difficulty levels, most recent cpu's would be able to solve a block from time to time. On a cellphone, you probably would not solve  dozens of blocks per day, but i'm pretty sure you'd be able to solve a couple each day. Offcourse, cpu's in smartphones in 2009 might not have been powerfull enough to really solve a lot of blocks, but i'm pretty sure they'd hit a block from time to time.And yes, you could easily create a new altcoin that uses a new POW algorithm for which at this moment in time, no asic's exist. Hundreds of people have tried though, and most of those altcoins are long gone...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "June 13, 2024, 08:06:58 AM",
      "body": "Quote from: roxane40 on June 13, 2024, 07:57:49 AMGiven the difficulty level, and low sophistication of the code, would it have been possible to mine Bitcoin with a cellphone in 2009? Is it possible to fork the blockchain, and make a new version of bitcoin and the bitcoin software that can be mined on a cellphone again? Or at least a low grade CPU?Nope, at least not in my country as far as I know. Aside the other factors, we can pick out how slow our cellular networks was back then in 2009. And it wasn't like there were a lot of alternatives. Mining required that the miner had very fast internet to be able to link up with the bitcoin network and share its mining data. Therefore, both the type of phones which are not as sophisticated as they are now, and cellular network made it impossible to mine bitcoin then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "June 13, 2024, 08:18:23 AM",
      "body": "Quote from: roxane40 on June 13, 2024, 07:57:49 AMGiven the difficulty level, and low sophistication of the code, would it have been possible to mine Bitcoin with a cellphone in 2009?bitcoin was not as complicated as it is now than before. What was needed to complete a transaction was very little but obviously with how popular bitcoin has gotten now, it has become more complex and difficult to mine and you need very sophisticated specific software and hardware to mine bitcoin.But don't forget that the difficulty level of mining bitcoin back then matched the capability of devices. Cellphones back then were not even as half as good as the ones we have now so I don't think it was possible.Quote Is it possible to fork the blockchain, and make a new version of bitcoin and the bitcoin software that can be mined on a cellphone again? Or at least a low grade CPU?Theoretically maybe yes but realistically speaking, it would be too much work not only in the technical aspect but just about the community as a whole",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 13, 2024, 08:31:16 AM",
      "body": "That's an interesting question, albeit purely hypothetical, unless someone gas actually done that. I remember watching video of how mining can be done on paper (very slowly, but the point is that it's not impossible if), so I think that it was technically possible to develop a relevant app for that, even for a phone that wasn't a smartphone. But in terms of practicality, taking into account the difficulty rate of that time, I simply don't know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "June 13, 2024, 09:02:37 AMLast edit: June 13, 2024, 09:21:58 AM by Felicity_Tide",
      "body": "Quote from: Davidvictorson on June 13, 2024, 08:06:58 AMQuote from: roxane40 on June 13, 2024, 07:57:49 AMGiven the difficulty level, and low sophistication of the code, would it have been possible to mine Bitcoin with a cellphone in 2009? Is it possible to fork the blockchain, and make a new version of bitcoin and the bitcoin software that can be mined on a cellphone again? Or at least a low grade CPU?Nope, at least not in my country as far as I know. Aside the other factors, we can pick out how slow our cellular networks was back then in 2009. And it wasn't like there were a lot of alternatives. Mining required that the miner had very fast internet to be able to link up with the bitcoin network and share its mining data. Therefore, both the type of phones which are not as sophisticated as they are now, and cellular network made it impossible to mine bitcoin then.But we also have to consider the fact that the Bitcoin network wasn't massive then compare to now. The difficulty level wasn't too complex, meaning linking up with the Bitcoin network then didn't require much power and and internet connection, which I think the modern day device can compete well.Quote from: mocacinno on June 13, 2024, 08:06:35 AMYup, in 2009 you could have developed a mining software that could be run on about any recent device (albeit, at that time, smartphones were still really new, but you might have had a couple android phones that could have mined over wifi). Offcourse, you would also had to have developed all other infrastructure... Port bitcoin core for android, patch it so you could use a seperate mining software,... The modern day device are quite advanced and have made so many upgrades. with the upgrade in internet connections, RAM, ROM, battery life, clock speed and others. So practically, it would have been possible for smart phones to compete. But there must be prons and cons attached.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "June 13, 2024, 09:04:01 AM",
      "body": "Quote from: mocacinno on June 13, 2024, 08:06:35 AMAnd yes, you could easily create a new altcoin that uses a new POW algorithm for which at this moment in time, no asic's exist. Hundreds of people have tried though, and most of those altcoins are long gone...Monero with RandomX managed to do that, although occasional hard fork seems to be needed to prevent ASIC.Quote from: kotajikikox on June 13, 2024, 08:18:23 AMQuote Is it possible to fork the blockchain, and make a new version of bitcoin and the bitcoin software that can be mined on a cellphone again? Or at least a low grade CPU?Theoretically maybe yes but realistically speaking, it would be too much work not only in the technical aspect but just about the community as a wholeIn addition, it won't make mining on cellphone practical since the cellphone will be overheated quickly. Meanwhile, we'll see repeat of ETH mining boom where in this scenario, we'll see one computer or server contains multiple CPU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 13, 2024, 09:16:16 AMLast edit: June 13, 2024, 05:37:41 PM by MeGold666",
      "body": "2009 = ARM Cortex-A8 at around 600 MHz to 1 GHz clock, so let's take 800 MHz for our purpose.With a well optimized implementation of SHA-256 we are looking at 53,000 Hashes per second.Block reward in that year was 50 coins per block and difficulty remained at 1 from 2009 to 2010.The maximum possible number of coins to mine per month: 144 blocks per day * 50 reward = 7200 coins per day * 30 days = 216000 coinsHere is a calculator you can put numbers in:https://99bitcoins.com/bitcoin-mining/calculator/According to it you would find 1 block on average per day (50 coins).You could buy old phone for close to nothing and fork Bitcoin to see the actual numbers if you manage to find mining software for it.Worst case scenario you could run web mining on that phone and check that, there are plenty JS implementations on GitHub.Or just run it on the main Bitcoin chain and just see the performance.If you want to mine with regular CPU (x86/ARM), RandomX algorithm based projects are for you.There are no ASIC's for it and probably won't be because to make one you would have to build almost a full blown CPU which kills the profits of any ASIC manufacturer as they are unable to compete with Intel / AMD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 13, 2024, 09:19:13 AM",
      "body": "Quote from: mocacinno on June 13, 2024, 08:06:35 AMYup, in 2009 you could have developed a mining software thatThats the most important word here! Since it was already very new and complicated to set up your whole bitcoin wallet and mining software back then it would have been a very though task to build a minig software for a smarthphone back then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "June 13, 2024, 11:28:12 AM",
      "body": "Quote from: hZti on June 13, 2024, 09:19:13 AMQuote from: mocacinno on June 13, 2024, 08:06:35 AMYup, in 2009 you could have developed a mining software thatThats the most important word here! Since it was already very new and complicated to set up your whole bitcoin wallet and mining software back then it would have been a very though task to build a minig software for a smarthphone back then.That's correct... And next to this, even in 2009, a desktop (or server) cpu would have greatly outperformed a mobile cpu... So, even back then, it would have been better to mine with your pc's cpu than it would have been to mine with your brand new, first gen, very expensive smartphone.If you had to go back in time to 2009, it might have been a better idear to have bought a decent desktop pc with one (or more) good GPU's and \"invent\" GPU mining... The technology was there, you would have needed to patch bitcoin core to allow the rpc calls needed to mine outside of the bitcoin core process and you would have had to write software to mine with your GPU...If you would have tought of this in 2009, you could have been a billionaire right now sigh... hindsight...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 13, 2024, 11:34:44 AM",
      "body": "Quote from: roxane40 on June 13, 2024, 07:57:49 AMGiven the difficulty level, and low sophistication of the code, would it have been possible to mine Bitcoin with a cellphone in 2009?I don't have stats for 2009 but this old Bitcoin mining calculator tool has a Wayback machine archive in 2010A first Bitcoin mining calculator toolhttps://web.archive.org/web/20100923185820/https://www.alloscomp.com/bitcoin/calculator.phpYou have to check phone models in 2010 can provide how many hashrate and put it into the tool.https://alloscomp.com/bitcoin/calculatorSome reports on Bitcoin mining and mining equipment efficiency.Electricity consumption of Bitcoin: a market-based and technical analysisBitcoin electricity consumption: an improved assessment . See pre-ASIC period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 13, 2024, 11:44:51 AM",
      "body": "Quote from: mocacinno on June 13, 2024, 11:28:12 AMIf you had to go back in time to 2009, it might have been a better idear to have bought a decent desktop pc with one (or more) good GPU's and \"invent\" GPU mining... The technology was there, you would have needed to patch bitcoin core to allow the rpc calls needed to mine outside of the bitcoin core process and you would have had to write software to mine with your GPU...If you would have tought of this in 2009, you could have been a billionaire right now You would be a billionaire either way if you made a small CPU farm before GPU mining began and kept stacking without selling.But even back then it was more profitable to just buy coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "June 13, 2024, 11:56:33 AM",
      "body": "the first time bitcoin was used to make a purchase was in may 2010 (if i'm not mistaking). So, i don't know if bitcoin was freely purchaseable in 2009... I have no idear if it was easyer to mine or to purchase back in those days.The thing is, it's a theoretical discussion... If you would have started GPU mining in 2009, you would have pushed the diff way up and you could have potentially changed the whole bitcoin history...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 13, 2024, 11:59:13 AM",
      "body": "Quote from: mocacinno on June 13, 2024, 11:56:33 AMthe first time bitcoin was used to make a purchase was in may 2010 (if i'm not mistaking). So, i don't know if bitcoin was freely purchaseable in 2009... I have no idear if it was easyer to mine or to purchase back in those days.People were trading on old forum, peer to peer (as it was designed) without centralized exchanges.Usually by facilitating PayPal (yeah I know, F cancer).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "June 13, 2024, 12:03:23 PM",
      "body": "Quote from: roxane40 on June 13, 2024, 07:57:49 AMGiven the difficulty level, and low sophistication of the code, would it have been possible to mine Bitcoin with a cellphone in 2009? Is it possible to fork the blockchain, and make a new version of bitcoin and the bitcoin software that can be mined on a cellphone again? Or at least a low grade CPU?In 2009 mining with cellphone and CPU was very possible, the first bitcoin block known as the genesis block was mined on a computer at that time. But as bitcoin network grew mining with phone and CPU became difficult because of increase in bitcoin network and energy, their is a need for more computational power for mining to take place easily. The reason why the mining system is not like what it was in 2009 is to secure the network of bitcoin with more computers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 13, 2024, 12:20:00 PM",
      "body": "Quote from: Rockstarguy on June 13, 2024, 12:03:23 PMIn 2009 mining with cellphone and CPU was very possible, the first bitcoin block known as the genesis block was mined on a computer at that time.Genesis block was hardcoded into the software, due to it's nature it couldn't be otherwise.BTW, why do you guys have this gambling junk advertisement ? do you get paid to advertise this useless shit ? or is it your business ?It seems some people talk just to advertise it without adding anything to the conversation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 13, 2024, 02:14:40 PM",
      "body": "It the way of development in technology were advanced as at then back in 2009, then there could have been more efficient developments concerning the area of using cell phones to mine, just as it had been discovered last year or two that bitcoin transaction could be achieved with the use of the internet through the mobile phone and this started in South Africa, we can also have more developed technology back then, but bitcoin was at the early stage and the other discoveries were not achieved on it usage and applications to this extent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}