{
  "id": "topic_5467385",
  "title": "Drawesome",
  "author": "Drawesome",
  "created_time": "September 19, 2023, 10:06:35 PM",
  "content": "Básicamente en la encuesta el 56% somos de España. Y más sorpendente: Argentina (dominadores a nivel mundial en todo este mundo ,quizás anden por el norte y no bajen a rellenar encuestas). Echo de menos más representación de LATAM. En los grupos de TG y otro tipo de foros sí que hay mayoría. Una hipótesis es que tengan más costumbre de usar el teléfono y este sitio no es muy amigable en ese formato. En cualquier caso, voy a intentar invitar en general a toda la gente que anda por ahí en grupos de shits a respirar este ambiente más neutral y donde se originó tanto de lo que hay ahora. Una vuelta al origen y a ese espíritu de Satoshi creo que nos vendría muy bien a todxs.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467385",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "September 20, 2023, 06:57:56 AM",
      "body": "Entiendo que te basas en los datos reflejados en esta encuesta. La encuesta arrancó en el 2011, luego lleva \"viva\" 12 años. Este hecho permite acumular más cantidad de datos (reales o no en lo declarado), pero por otro lado no necesariamente refleja bien la distribución actual por países de los usuarios activos.Dicho eso, nos hemos preguntado en varias ocasiones, como en ésta, por qué es tan baja la actividad en nuestro foro local, lo cual es un preámbulo de su distribución por países. Las respuestas no se decantan claramente por un único motivo, y quizás la cadena de elementos a ponderar sería el contraste entre el potencial de la lengua, el potencial de usuarios o interesados en las criptomonedas de los países con esta misma lengua en común, y las llegadas al foro en términos de seo y de cuentas creadas.Desconocemos los datos relativos al SEO (doy por hecho que no hay SEM), que nos muestre datos de la llegada al site de Bitcointalk desde las distintas ubicaciones geográficas (vpn mediante). Mi sensación es que es bajísimo desde los países que citas, pero el foro nunca ha publicado datos al respecto (y no me fio nada de las plataformas externas que intentar inferir este tipo de información). De ser así, el punto de partida es que no llega la gente al foro, bien por posicionamiento, bien por desconocimiento, bien por desinterés. Uno puede tener la cultura de los canales de las redes sociales en ciertas regiones, pero si Bitcointalk estuviese en los resultados iniciales de las búsquedas, mínimo tendríamos visitas que luego decidirían si iteran en quedarse o no. Mi sensación es que no llegan aquí, pero es una mera hipótesis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 20, 2023, 09:58:56 AM",
      "body": "Quote from: DdmrDdmr on September 20, 2023, 06:57:56 AMDicho eso, nos hemos preguntado en varias ocasiones, como en ésta, por qué es tan baja la actividad en nuestro foro local, lo cual es un preámbulo de su distribución por países. Las respuestas no se decantan claramente por un único motivo, y quizás la cadena de elementos a ponderar sería el contraste entre el potencial de la lengua, el potencial de usuarios o interesados en las criptomonedas de los países con esta misma lengua en común, y las llegadas al foro en términos de seo y de cuentas creadas.Desconocemos los datos relativos al SEO (doy por hecho que no hay SEM), que nos muestre datos de la llegada al site de Bitcointalk desde las distintas ubicaciones geográficas (vpn mediante). Mi sensación es que es bajísimo desde los países que citas, pero el foro nunca ha publicado datos al respecto (y no me fio nada de las plataformas externas que intentar inferir este tipo de información). De ser así, el punto de partida es que no llega la gente al foro, bien por posicionamiento, bien por desconocimiento, bien por desinterés. Uno puede tener la cultura de los canales de las redes sociales en ciertas regiones, pero si Bitcointalk estuviese en los resultados iniciales de las búsquedas, mínimo tendríamos visitas que luego decidirían si iteran en quedarse o no. Mi sensación es que no llegan aquí, pero es una mera hipótesis.El tema de otros foros populares con apartado de \"cripto\" podría ser un motivo de peso. También que al ser en inglés principalmente se penaliza en el SEO para idioma español. Pero la competencia de Telegram, etc. es lo que más daño hace. La gente se queda en lo superficial y nadie le va a decir: hay un foro desde 2009 que es el más importante. Lo peor son las sectas de x plataforma que les hacen ver que están en el sitio adeacuado...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 20, 2023, 07:25:08 PM",
      "body": "Creo que este foro tal y como funciona pareciera estar cada vez más cerca de mantenerse tal cual como está, que mejorar en cualquier punto sistemático, porque no solo se trata de tráfico, también el aspecto social,  técnico, es algo que sigue en decadencia y/o manteniendo la supervivencia del foro, pero no mejora.Porque si bien es cierto en los tableros locales se vive esa \"sensación\" de \"podrían ser más...\", bien es decir, que algunos más que otros, para cada tablero es diferente, pero existe, no lo es todo en lo necesario para mejorar. El tráfico o llegada de más usuarios.Y con el debido respeto de los que están, creo que cada vez una importante gamma de usuarios interesantes han ido abandonando el foro. Y la equivalencia en relevó de usuarios se ve reflejada en una bajada de los temas que se discuten, y no se trata de ciencia de cohetes o de ser un experto en el tecnicismo, pero si de tener un \"speech\" orgánico a la discusión que se presente.Tiene que ser un foro muy raro en ese sentido, yo veo diariamente los llamados \"templates\" de respuestas en Bitcoin discusión,  y ni hablar de otros tableros, por lo que seguramente el usuario que llega o nos deja ahí de consulta aleatoria, pero no de interés a sentarse a leer mil respuestas que dicen lo mismo y no es que eso no ocurra en otros foros, pero indudablemente que el sistema de firmas lo hace más recurrente.Los parámetros de cualificaciones cambiaron, la gente se conforma con un \"like\" como determinante del talento o que es lo mejor, y aquí sucumben los méritos, que, por ejemplo en tu caso para optar a una campaña requiere de un par de meses o años incluso, si es tu libre elección optar por una monetización de tus ideas y opiniones.Pero, eso, que podría ser un enganche de usuarios se convierte en una \"carrera\" para algunos y ahora cada vez se está dando la idea de que alguien que tiene muchos méritos tiene más derechos de ganar más por su opinión que la del promedio de usuarios.Es decir, se está haciendo ser \"elitista\" un usuario en el foro, que desde el punto de vista de contenido y calidad está bien darle su grado \"jerárquico\" a esos usuarios pero que alguien nuevo con unos días posteando y empiece a sacar cuentas de cuánto demora solo llegar a Full member, termina simplemente en \"... ya vengo\".Y hay tela aquí, pues para muchos bitcoiners del foro las firmas no deben existir... El punto es que no todo es tráfico, sino porqué los 10 tipos nuevos que llegan no se quedan, bueno algunas cositas de las que dije ayudan, no todo es el SMF y SEO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 21, 2023, 04:21:53 AM",
      "body": "En una muestra tan pequeña la distribución puede variar mucho. Que yo sepa nacidos en España que seamos activos regularmente somos tres o cuatro a día de hoy. Otra cosa es que vivamos en España o que gente que haya nacido en otros paises latinoamericanos viva en España a día de hoy y sea activa en el foro con regularidad. En la última actualización del hilo sobre secciones locales solo hubieron 10 cuentas que escribieron 11 posts o más, y dos de las cuentas eran mías, o sea que fueron solo 9 personas en agosto. Con esa muestra, la proporción de nacionalidades de origen no significa nada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 21, 2023, 04:55:31 AMLast edit: September 21, 2023, 05:38:03 AM by albert0bsd",
      "body": "Buenas, yo personalmente prefiero publicar en Ingles ya que creo que asi tengo un poco mas de visibilidad, asi mismo me gusta leer mas la seccion en ingles ya que por lo general tiene temas mas variados y temas tecnicos con mayor participacion de usuarios veteranos (Por ejemplo no me imagino a Loyce publicando en esañol ).He visto que @DdmrDdmr intenta replicar mucho de lo que se publica en ingles en el foro local y eso esta muy bien.Acabo de contestar una de las encuentas y esta fue mi respuesta rotunda: No hay suficiente discusión técnica en nuestro foro localComenzare a publicar mas temas en el foro local, voy a traer algunos de los temas que tengo publicados en ingles aqui.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 21, 2023, 06:53:21 AM",
      "body": "Lógicamente, en todo este asunto se entremezclan muchos factores como los citados en este hilo y los apuntados mediante enlaces, pero hay dos aspectos que tradicionalmente se manejan en los negocios (por hacer un símil): la captación y la retención.El aspecto primero, el de la captación, es el que me resulta más extraño, o cuanto menos más misterioso dada la dimensión del potencial y el resultado efectivo de nuevas cuentas que vemos por aquí. Y así seguirá siendo para mí, un misterio, mientras no tengamos algún tipo de dato interno que nos pueda llegar a indicar por dónde van los tiros en términos de volúmenes de usuarios distintos que llegan a nuestro foro local. Aquí, los drivers fundamentales, a falta de sem, son el seo, los backlinks, y las referencias/boca-oreja.El segundo aspecto, el de la retención, viene condicionado por multitud de factores, donde deberían encontrar punto común los intereses propios y los ofrecidos por el foro (cultura del foro, tipo de contenido, volumen, dinamismo, restricciones/reglas, etc.).Sigo pensando que el talón de Aquiles principal está en la captación, muy por encima de la retención. Ya dentro del apartado de la retención, un aspecto al que le doy vueltas de vez en cuando es el de la cultura del foro. Digamos que las personas con perfil de redes sociales de mensajes rápidos y breves tiene poco encaje en el foro en su generalidad, y suele tender a ser repudiado con calificativos de desdeño. La cultura del foro es un tanto más prosaica, y este choque cultural sí puede ser (también) relevante en la retención. Claro que otros argumentarían que bien, que no se unan estos perfiles …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 21, 2023, 05:06:41 PM",
      "body": "Quote from: albert0bsd on September 21, 2023, 04:55:31 AMBuenas, yo personalmente prefiero publicar en Ingles ya que creo que asi tengo un poco mas de visibilidad, asi mismo me gusta leer mas la seccion en ingles ya que por lo general tiene temas mas variados y temas tecnicos con mayor participacion de usuarios veteranos (Por ejemplo no me imagino a Loyce publicando en esañol ).He visto que @DdmrDdmr intenta replicar mucho de lo que se publica en ingles en el foro local y eso esta muy bien.Acabo de contestar una de las encuentas y esta fue mi respuesta rotunda: No hay suficiente discusión técnica en nuestro foro localComenzare a publicar mas temas en el foro local, voy a traer algunos de los temas que tengo publicados en ingles aqui.Mira eso de visibilidad, seamos sinceros se traduce en \"pago por post\", yo estuve escribiendo el 99% de mi contenido cuando empecé en Español, porque me gusta hacerlo, pero si revisas ahora estoy casi en un 50% y como dato curioso, no empecé a escribir en Gambling, no me interesaba, y no porque...  es curioso recordarlo y decirlo no tuviera experiencia, de hecho la primera gran campaña que participe \"seria\" o de buenos pagos, fue la segunda, el Gerente escribió, \"te voy a dar la oportunidad que escribas en Gambling\". Empecé a escribir en ese tablero porque tenia los conocimientos, pero para hacerlo en el foro, ni idea, no llegue aquí para escribir sobre apuestas, y de hecho tenia años sin hacerlo, escribí en foros como \"Two Plus Two\" o la desaparecida Intellipoker, quizás a finales de la primera década de este siglo. De hecho no escribía en ningún foro cuando aterrice aquí y así sigue siendo, a veces leo otros usuarios, que dicen esto de otro foro, etc. y digo como hacen con su tiempo.Entonces en ese sentido, el 99% de los usuarios en este foro se mueven por intereses relacionados a su campaña y ojo, de ese 99% quizás, lleguen aquí 90% por el ruido de las campañas de firmas.Y en esa idea en lo que significa hacer un post, orgánico, por ejemplo para \" No hay suficiente discusión técnica en nuestro foro local\", llegan los usuarios que saben que el tema es escaso y que a los terratenientes de los Méritos, les gusta ver ese tema.De igual forma, ese asunto de generar \"post\" en cualquier board, nuestro tablero Local Español, LE, ha sido precursor de muy buenos poster en el norte, que, luego de concederse la Visa, emigran y luego son residentes, entiéndase lo de Visa como méritos ganados \"aquí\" (LE), siempre he pensado que literal, este tablero es el que otorga las Visas, es contradictorio, pues eso que llamas visibilidad, debería ser la Visa de muchos para quedarse en el norte, pero gracias a que los tableros locales se han convertido en gestores de méritos de quienes se pasan por ellos, es que muchos alcanzan la residencia permanente en los boards anglosajones que denotamos por estos lares como Norte.Luego, la \"discusión técnica\", debe generarse, si, pero por terceros que lleguen con sus dudas, hay cientos de miles, quizás millones de usuarios en esta región que usan bitcoin... y nadie tiene \"problemas\", dudas, inquietudes, proyectos, etc. Porque si vamos a discutir tecnicismos de bitcoin, que te digo que ahí si sale la paja del tema en cuestión que esta en el OP, ojo me refiero al Gif, que nos quedamos solos.Vamos, que ocurre en el norte, en algunos de los tableros especializado en la discusión técnica, si!, llegan los nuevos usuarios, pero que siempre son los mismo y por cierto, solo hace falta que llegue algún nuevo usuario con luces, que se establezca y lo llenan de méritos.Si las \"estrellas\" de este foro, sucumben ante el aburrimiento, o no les pagan, el barco sigue su rumbo, pero que se acaban las firmas y seguramente oficialmente tendremos solo discusión técnica + el Gif, el ya famoso \"paja\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 21, 2023, 05:27:26 PM",
      "body": "Quote from: famososMuertos on September 21, 2023, 05:06:41 PMMira eso de visibilidad, seamos sinceros se traduce en \"pago por post\"Actualmente si, eso es correcto, pero Antes de mis primeros 280 posts, no estuve en ninguna campaña de firmas o avatar y todos mis mensajes estaban publicados en los boards en ingles. Como programador queria darle mas alcance a mi proyecto, es lo que queria dar a entender.He comenzado a publicar mis proyectos en el foro local, espero que les guste lo que publico.Saludos!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 22, 2023, 05:52:25 AM",
      "body": "Por lo que recuerdo, y volviendo a revisar mi histórico en diagonal, también arranque como mucho más énfasis en las secciones inglesas del foro, aunque tenía un determinado volumen de posts mensuales en nuestro foro local desde las primeras semanas. No recuerdo la motivación para estar más por el norte, aunque como suelo buscar información en inglés en términos generales, es probable que el hábito derivase en una mayor interacción con los norteños de Bitcointalk.Un aspecto que comenta famososMuertos que es muy relevante es el de las campañas. En general, las campañas son un gran reclamo del foro para la participación, siendo un hecho no rebatible. Esto vemos que tiene no obstante una incidencia escasa en el crecimiento de nuestra sección local, y si bien podría parecer que las campañas no suelen contabilizar (que no prohibir) los posts en los foros locales, tampoco es que veamos nadie nuevo preguntando al respecto. Esto apoya un tanto más mis argumentos relativos a que la gente no llega a nuestro foro local como puerta de entrada.A buen seguro que hay un buen puñado de personas que, teniendo dominio de los idiomas de alguno de los foros locales, no participan en los mismos por los motivos que fuere, y sí en las secciones globales. También recuerdo algún caso que me sorprendió al verle postear aquí de manera esporádica, siendo su uso del idioma nativo, sin verle más por estos lares.Por otro lado, también es cierto que hay una carencia de temas técnicos debatidos, pero a la par, que Bitcointalk es, hoy por hoy, y probablemente esto va de la mano de las campañas, menos técnico y más social.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 22, 2023, 12:53:26 PM",
      "body": "Muy interesante varias cosas que planteais.Si te vas a discutir temas técnicos, está claro que en el norte están los mayores expertos, pero también se están planteando cosas interesantes por aquí ultimamente.También decíamos que hay otros foros en español generalistas y con mucho volumen en contenido crypto, pero son de muy mala calidad. Yo sigo pensando que la evolución que tiene que tomar todo esto es sistémica, hecha por las comunidades. Y para eso, no se me ocurre un lugar más neutro que este foro. Sin neutralidad no hay consenso y hace falta un consenso muy grande y unos principios muy básicos y generales de partida (donde tengan cabida muchos perfiles distintos).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zenaku",
      "created_time": "September 28, 2023, 04:48:43 AM",
      "body": "En los paises que mencionas no importa el btc, El btc solo se usa para estafar, muy pocos estudian e investigan, me imagino que viven en la ignorancia porque el dinero en Latinoamérica se busca laburando en trabajos de fuerza y no de inteligencia.Sin desmeritar a nadie ni a nada, el bitcoin es muy satanizado y es una comedia para la mayoria en dichos paises, muchos prefuieren lo antiguo, ser una hormiga trabajadora",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 28, 2023, 09:38:59 AM",
      "body": "Quote from: zenaku on September 28, 2023, 04:48:43 AMEn los paises que mencionas no importa el btc, El btc solo se usa para estafar, muy pocos estudian e investigan, me imagino que viven en la ignorancia porque el dinero en Latinoamérica se busca laburando en trabajos de fuerza y no de inteligencia.Sin desmeritar a nadie ni a nada, el bitcoin es muy satanizado y es una comedia para la mayoria en dichos paises, muchos prefuieren lo antiguo, ser una hormiga trabajadoraEn México y Colombia no sé, pero en Venezuela sí me consta que mucha gente está usando la app de Binance, por lo que en trabajos online si están recibiendo BTC (y otras alt/shits). No es lo ideal usar Binance, pero por algo se empieza. Alguien me contó que en Venezuela incluso en comercios tienen implantado pago con Binance (la App de Binance Pay), no sé que tan generalizado sea. A ver si alguien de allí nos cuenta. Saludos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 28, 2023, 12:32:52 PM",
      "body": "Quote from: Drawesome on September 28, 2023, 09:38:59 AMpero en Venezuela sí me consta que mucha gente está usando la app de BinanceEn mi ciudad no he visto ninguna logo de bitcoin en los negocios.Los ciudadano de paises que hoy en dia tienen una alta inflacion o volatidiad en su moneda buscan siempre formas alternas de preservar el valor de sus bienes, muestra de ellos es que el dolar empieza a preferir sobre la moneda local (No digo que el dolar sea mejor, sin embargo como es fisico lo pueden tradear mas facilmente), mucha gente no entiende sobre bitcoin y su naturaleza, incluso muchos adultos de mas de 50 años no saben o no quieren  manejar una cuenta de banco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zenaku",
      "created_time": "September 28, 2023, 05:31:52 PM",
      "body": "Quote from: Drawesome on September 28, 2023, 09:38:59 AMQuote from: zenaku on September 28, 2023, 04:48:43 AMEn los paises que mencionas no importa el btc, El btc solo se usa para estafar, muy pocos estudian e investigan, me imagino que viven en la ignorancia porque el dinero en Latinoamérica se busca laburando en trabajos de fuerza y no de inteligencia.Sin desmeritar a nadie ni a nada, el bitcoin es muy satanizado y es una comedia para la mayoria en dichos paises, muchos prefuieren lo antiguo, ser una hormiga trabajadoraEn México y Colombia no sé, pero en Venezuela sí me consta que mucha gente está usando la app de Binance, por lo que en trabajos online si están recibiendo BTC (y otras alt/shits). No es lo ideal usar Binance, pero por algo se empieza. Alguien me contó que en Venezuela incluso en comercios tienen implantado pago con Binance (la App de Binance Pay), no sé que tan generalizado sea. A ver si alguien de allí nos cuenta. SaludosVenezuela usa cualquier cosa que genere dinero, Vea el fenomeno de los juegos nft, cryptomines (me acuerdo) porque fue el que jugue, prestaba servicios a muchos venezolanos, tambien youtube estaba inundado de venezolanos y argentinos. Solo quiero decir que se usan las shitcoins mas por necesidad que por otra cosa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "September 29, 2023, 07:46:14 AM",
      "body": "Quote from: zenaku on September 28, 2023, 05:31:52 PMQuote from: Drawesome on September 28, 2023, 09:38:59 AMQuote from: zenaku on September 28, 2023, 04:48:43 AMEn los paises que mencionas no importa el btc, El btc solo se usa para estafar, muy pocos estudian e investigan, me imagino que viven en la ignorancia porque el dinero en Latinoamérica se busca laburando en trabajos de fuerza y no de inteligencia.Sin desmeritar a nadie ni a nada, el bitcoin es muy satanizado y es una comedia para la mayoria en dichos paises, muchos prefuieren lo antiguo, ser una hormiga trabajadoraEn México y Colombia no sé, pero en Venezuela sí me consta que mucha gente está usando la app de Binance, por lo que en trabajos online si están recibiendo BTC (y otras alt/shits). No es lo ideal usar Binance, pero por algo se empieza. Alguien me contó que en Venezuela incluso en comercios tienen implantado pago con Binance (la App de Binance Pay), no sé que tan generalizado sea. A ver si alguien de allí nos cuenta. SaludosVenezuela usa cualquier cosa que genere dinero, Vea el fenomeno de los juegos nft, cryptomines (me acuerdo) porque fue el que jugue, prestaba servicios a muchos venezolanos, tambien youtube estaba inundado de venezolanos y argentinos. Solo quiero decir que se usan las shitcoins mas por necesidad que por otra cosa.Esto me trae a la memoria un articulo que leí hace tiempo acerca de como los humanos pasaron de ser cazadores a agricultores, uno de esos grandes misterios que talvez no se resuelvan jamás, en el artículo los antropólogos argumentaban que era probable que la agricultura se desarrollase a partir de comunidades de cazadores muy exitosas con demasiado tiempo libre, y que por accidente se hubiesen dado cuenta de que al desechar las semillas de las frutas y verduras que consumían en el mismo lugar, entonces en ese lugar crecían más de esas plantas, eventualmente hicieron la conexión y así surgió la agricultura.Sin embargo, me parece una explicación que ignora la naturaleza humana, como sabemos la necesidad es la madre de la invención, así que me parece mas probable que la agricultura haya surgido de grupos de cazadores con problemas para encontrar alimento y dispuestos a hacer de todo con tal de conseguirlo.Y esto tiene que ver con tu post, cuando una persona esta entre la espada y la pared y no tiene ninguna otra opción que encontrar alguna solución o pasar hambre, entonces recurrirá a cualquiera cosa que tenga a la mano que pudiese generarle algún beneficio, incluso si esto significa usar algún NFT o shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 29, 2023, 09:21:17 AM",
      "body": "Quote from: Silberman on September 29, 2023, 07:46:14 AMEsto me trae a la memoria un articulo que leí hace tiempo acerca de como los humanos pasaron de ser cazadores a agricultores, uno de esos grandes misterios que talvez no se resuelvan jamás, en el artículo los antropólogos argumentaban que era probable que la agricultura se desarrollase a partir de comunidades de cazadores muy exitosas con demasiado tiempo libre, y que por accidente se hubiesen dado cuenta de que al desechar las semillas de las frutas y verduras que consumían en el mismo lugar, entonces en ese lugar crecían más de esas plantas, eventualmente hicieron la conexión y así surgió la agricultura.Sin embargo, me parece una explicación que ignora la naturaleza humana, como sabemos la necesidad es la madre de la invención, así que me parece mas probable que la agricultura haya surgido de grupos de cazadores con problemas para encontrar alimento y dispuestos a hacer de todo con tal de conseguirlo.Y esto tiene que ver con tu post, cuando una persona esta entre la espada y la pared y no tiene ninguna otra opción que encontrar alguna solución o pasar hambre, entonces recurrirá a cualquiera cosa que tenga a la mano que pudiese generarle algún beneficio, incluso si esto significa usar algún NFT o shitcoin.Me encanta tu reflexión. También hay quien dice que éramos mucho más felices cuando éramos cazadores-recolectores. Ahí entra la dualidad individuo-comunidad. Para la comunidad, la opción de ser agricultor-ganadero es mejor, así que al final el sistema crea mecanismos para que prevalezca el colectivo sobre el individuo (por presión social) y no se regrese a la caza. Eso no es malo; al contrario, ha posibilitado todo el conocimiento y la tecnología que tenemos ahora. Sin embargo, es un mecanismo peligroso que hay que tener en cuenta (lo de la presión social que al final se traduce en una autopresión, algo así como el superyó que decía Freud).Y precisamente esa necesidad de la que hablamos hace que muchos abusen y esclavicen a estas personas que no tienen tiempo de analizar incentivos, posibilidades o alternativas (básicamente de estudiar). Ya abrí un hilo muy denso sobre la decepción que me causa la falta de alineación de todas las personas débiles frente a los especuladores:https://bitcointalk.org/index.php?topic=5467358.0No es fácil y has dado en el clavo: lo que no implique un ingreso inmediato se desecha, aunque sea a costa de sacrificar una mejora a medio plazo por la esclavitud y promesas falsas. Gracias por tu comentario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 29, 2023, 11:03:35 AMLast edit: September 30, 2023, 08:01:07 AM by DdmrDdmr",
      "body": "No sé si la gente especifica aún el término “foro” en sus búsquedas, pero un interesante ejercicio es el de poner patrones de búsqueda en Google, y ver cuándo aparece bitcoin. Esto va a depender del país y la persona (el algoritmo de Google no da los mismos resultados a todos, sino que los genera en base a su perfil), pero por hacer el experimento ahora, en mi caso, estoy viendo:Cadena: \"foro bitcoin\"Resultados:1. Investing2. Forobits3. Rankia4. Forocoin5. Rankia6. Forocoches7. Material Bitcoin ()8. Artículo de Criptonoticias9. MoneyController10. Artículo de Beincrypto11. Bitcointalk (índice general, no la sección en español)Si miro el término \"Bitcoin\" a secas, puedo cansarme de paginar sin ver el foro por ninguna parte. Diría que la gran mayoría de la gente no especifica el término \"foro\", luego por búsquedas genéricas parece complicado toparse con el foro…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 29, 2023, 05:02:44 PM",
      "body": "Quote from: DdmrDdmr on September 29, 2023, 11:03:35 AMNo sé si la gente especifica aún el término “foro” en sus búsquedas, pero un interesante ejercicio es el de poner patrones de búsqueda en Google, y ver cuándo aparece bitcoin. Esto va a depender del país y la persona (el algoritmo de Google no da los mismos resultados a todos, sino que los genera en base a su perfil), pero por hacer el experimento ahora, en mi caso, estoy viendo:Cadena: \"foro bitcoin\"Resultados:1. Investing2. Forobits3. Rankia4. Forocoin5. Rankia6. Forocoches7. Material Bitcoin (8. Artículo de Criptonoticias9. MoneyController10. Artículo de Beincrypto11. Bitcointalk (índice general, no la sección en español)Si miro el término \"Bitcoin\" a secas, puedo cansarme de paginar sin ver el foro por ninguna parte. Diría que la gran mayoría de la gente no especifica el término \"foro\", luego por búsquedas genéricas parece complicado toparse con el foro…A mi décimo y en inglés también. Tenemos un problema con Google.Sin cookkies me sale:Primer lugar: inglés, italiano, alemán y francés (bitcoin forum), ruso( Форум Bitcoin ), japonés( ビットコインフォーラム), koreano (비트코인 포럼). hindi (बिटकॉइन फोरम)Segundo lugar: chino(比特币论坛 ) por detrás de investing . com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 30, 2023, 08:02:47 AM",
      "body": "Quote from: Drawesome on September 29, 2023, 05:02:44 PM<…>Sí, efectivamente hay unas cuantas variables que influyen en el algoritmo, entre las cuales figura la información que tenga en las cookies, el país o zona geográfica, si estás accediendo a la consulta con alguna cuenta de Google logineada (o eso creo: me da que si entro con Google Drive abierto “sabe más” de mí), etc. Lo de los idiomas que indicas es un tanto raro; diría que por IP (sea vpn o no) intentaría ubicar la persona para retornar resultados más adecuados a su idioma.No sé cuántos más por aquí habrán llegado a Bitcointalk meramente a través de una búsqueda en Google. Mi caso fue así, aunque diría que probablemente usé un patrón de búsqueda en inglés en su momento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}