{
  "id": "topic_5409654",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "August 12, 2022, 07:01:12 PM",
  "content": "I am a little bit curious about how my attitude should be if I ever get to attend one of these crypto meetups, I understand that people get to interact with themselves in the course of the meetups and have little quick discussions about crypto generally and then maybe further about the coin one is currently investing in. If you act a novice, people may get to be freer with you and tell you things easily, but acting knowledgeable, they may keep some tips and tricks from you. I may just be exaggerating people and their characters at these meet ups, but I will like to know the best way to attend these meetups? in the disguise of a total novice? or just normal?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409654",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "August 13, 2022, 05:51:07 AM",
      "body": "Just be yourself.I don't see the benefit in pretending to be someone you are not. It just feels awkward when people realize what's going on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 18, 2022, 10:12:28 PM",
      "body": "Quote from: Queentoshi on August 12, 2022, 07:01:12 PMI am a little bit curious about how my attitude should be if I ever get to attend one of these crypto meetups, I understand that people get to interact with themselves in the course of the meetups and have little quick discussions about crypto generally and then maybe further about the coin one is currently investing in. If you act a novice, people may get to be freer with you and tell you things easily, but acting knowledgeable, they may keep some tips and tricks from you. I may just be exaggerating people and their characters at these meet ups, but I will like to know the best way to attend these meetups? in the disguise of a total novice? or just normal?I remember that the first time I have attended a blockchain conference, I was a bit nervous. But since I see that it's just about sitting there listening to various keynote speakers and networking with other attendees, so that's just it exchanging information, ideas, etc.Then I went overseas 7 times in 2019. It's on a new level because it's also my first time getting exposed to international events. At first, I wasn't confident to approach or network with the internationals, but I just simply got out of the comfort zone and do it anyway since I don't want to waste my time there for nothing and the rest is history and now getting used to it. As what @NotATether said, just be you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "October 01, 2022, 09:08:42 AM",
      "body": "Haven't popped in here for a while. Never attended a conference -- not physical anyway, plenty of digital ones because of work and it's a completely different thing to be online -- but had a fair share of meetups.Always awkward for me initially but I find that Bitcoiners are some of the warmest, friendliest, least assuming people. Maybe I'm lucky too, but yeah, be yourself. It's okay not to talk about Bitcoin all the time, although the easiest ice-breaker is always I guess how your Bitcoin story started. But I always met for a specific purpose: exchange a Bitcoin-related item, trade/buy, some Bitcoin-related thing (like this Bitcoin post chain I did a couple of years back), even a poker event, but never really just a meetup for the sake of meeting up.Nothing special, really, but cool people, in my fortunate experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "November 02, 2022, 07:44:25 PM",
      "body": "Attending a meetup depends on what kind of discussion which might came up, but naturally you don't need to show yourself you knowns everything rather than keeping calm and learn from others don't even form to be a novice but be open to speak or asking questions about their topic of discussion then you could learn more from them over there than just being acting up of what you don't know. I have attended several crypto meet up in my state and i have learnt a lot from people which i think they are higher than me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}