{
  "id": "topic_5476563",
  "title": "minerjones",
  "author": "minerjones",
  "created_time": "December 04, 2023, 11:55:10 PM",
  "content": "Looks like Denarium? is selling of remaining products possiblyhttps://denarium.sumupstore.com/https://denarium.coinmotion.com/While the prices seem real and the site is in Finnish, as they were a Finnish company... something doesn't seem right.Can anyone verify that this is actually Denarium selling out remaining stock?While the prices seem \"decent\"/on-par, doesn't look ok, and the only shipping option is Finland",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476563",
  "comments": [
    {
      "author": "Steeley",
      "created_time": "December 05, 2023, 12:42:42 AM",
      "body": "I just finished up work and poked around on the internet some. There is no mention of this final sale anywhere that I can find. I searched in Finnish using a VPN as well. Nothing. This great news if true, but it is suspicious that there is no mention of this event on the website or internet that has any announcement or explanation. In 2020 they announced all final sales and auctioned them on Bitcointalk. Seems like they would do something similar. Their website has pretty clear descriptive announcements for all this in 2020. No recent posts. In the small chance this is NOT a big scam, I think we could do a group buy and drop ship with a courier service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montreal1",
      "created_time": "December 05, 2023, 12:57:09 AM",
      "body": "Coinmotion hasn’t tweeted about it. They tweeted about the closing sale in March 2020.It would be awesome if they had remaining stock to sell, or if they were internally working on denarium again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tldr-hodl",
      "created_time": "December 05, 2023, 06:02:27 AMLast edit: December 05, 2023, 07:20:55 AM by tldr-hodl",
      "body": "Easy - get over shipping to payment. The only option is a credit card, no PayPal, no cash on delivery (which would make sense since it's Finland only), no regional options, not even crypto Definitely a scam, seems like a DNS hijacking...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hox",
      "created_time": "December 05, 2023, 07:52:48 AM",
      "body": "I contacted coinmoition and they confirmed that it is legit. I have asked about international shipping and a possible bulk order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "December 05, 2023, 12:06:38 PM",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JanEmil",
      "created_time": "December 05, 2023, 12:47:26 PM",
      "body": "They only had 7 bull coins. So could be sold out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Steeley",
      "created_time": "December 05, 2023, 09:35:40 PM",
      "body": "That was a missed opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rsincognito",
      "created_time": "December 06, 2023, 12:47:04 AM",
      "body": "im still set on this website being a scam. imo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}