{
  "id": "topic_5418669",
  "title": "TechTard",
  "author": "TechTard",
  "created_time": "October 28, 2022, 06:53:33 PM",
  "content": "Hi there,I'm a professional poker player that plays on a bunch of online platforms that solely pay out in crypto currency, either Bitcoin or Tether.I currently use Exodus as my wallet and Kraken as my exchange platform to convert the crypto I receive to Euro's (€) in order to then withdraw my winnings to my bank account. Kraken charges a 1.5% fee on the convertion from crypto to Euro's (€), however, which is starting to add up.I was wondering what exchange platform charges the lowest fees for conversions from Bitcoin to Euro.I was also wondering what exchange platform charges the lowest fees for conversions from Tether to Euro.I've done a bunch of Googling, but I can only find the rates for trading, which I have no interest in doing.If someone can let me know what the place to be is for me, I'd hugely appreciate it.Best of luck in your crypto endeavors,TechTard",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418669",
  "comments": [
    {
      "author": "Ultegra134",
      "created_time": "October 28, 2022, 06:59:51 PM",
      "body": "Well, Kraken isn't that bad in terms of fees, but it certainly doesn't have the lowest ones. You'd be better off using Binance, which I think currently offers the lowest fees compared to other exchanges. The conversion to euros or a stablecoin is still considered trading, thus, you're subject to trading fees. Kraken is decent, but Binance is way more affordable in terms of fees, and it's also the main reason I switched to them. Fees were adding up when trading and were reducing my profit. Binance offers as little as a 0.10% trading fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 28, 2022, 07:38:19 PM",
      "body": "Quote from: TechTard on October 28, 2022, 06:53:33 PMI was wondering what exchange platform charges the lowest fees for conversions from Bitcoin to Euro.I was also wondering what exchange platform charges the lowest fees for conversions from Tether to Euro.You are not paying high fees in centralized exchanges if you are maker for exchanging coins to fiat currencies and vice versa, but I don't think there is real Euro currency in all exchanges.Problem is that you have to pass KYC verification for all this exchanges, and I prefer doing P2P trading and using Bisq decentralized exchange, maybe it's not lowest fees, but risk is much lower and you don't have to verify anywhere.It's also important to check how much fees centralized exchange charges for withdrawing Euro and Bitcoin, but you can also check out BestChange.com to find best rates for BTC/EUR and USDT/EUR.One more useful thing is checking withdrawal fees on exchanges:https://withdrawalfees.com/https://www.cryptofeesaver.com/exchanges/fees/coins/euroHere is one example of exchanging 1 Bitcoin to Euro:https://www.cryptofeesaver.com/exchanges/search/btc-to-eurPSI don't know how accurate this information is, and I am not affiliated with any of this websites posted above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 28, 2022, 07:40:37 PM",
      "body": "How much are you wanting to convert? If it's more than a few thousand euros or could be you might want to try to find someone who can handle the conversion for you or use another service (coinbase prime gets mentioned a lot I think for charging a monthly subscription instead of trading fees).The not wanting to trade thing seems quite confusing as generally placing market orders on exchanges will work out a lot cheaper than using their regular gui services (or at least did when I last bought).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "October 28, 2022, 09:47:00 PM",
      "body": "If you want to achieve low fees when trying to convert fiat to crypto and vice versaYou are going to personally participate in trading. Place limit orders for spot trading on advanced options or use p2p platforms where you can place and order or buy and sell using the best offers available. most centralized exchanges now offer custodial p2p service, just pick up your favourite like https://p2p.binance.com/en/trade/all-payments/USDT?fiat=EUR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 28, 2022, 10:26:12 PM",
      "body": "Quote from: TechTard on October 28, 2022, 06:53:33 PMI'm a professional poker player that plays on a bunch of online platforms that solely pay out in crypto currency, either Bitcoin or Tether.I currently use Exodus as my wallet and Kraken as my exchange platform to convert the crypto I receive to Euro's (€) in order to then withdraw my winnings to my bank account. Kraken charges a 1.5% fee on the convertion from crypto to Euro's (€), however, which is starting to add up.Bitstamp,  which i use, has 0% trading fees in all pairs below 1k usd/euro per month.https://www.bitstamp.net/fee-schedule/Then about 0.2-0.4% fee according to your volumeIt has also a withdrawal fee of 3 euro per SEPA transfer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "October 28, 2022, 11:23:47 PM",
      "body": "@dkbit98The problem for traders (those for whom trading is a job) is they have little choice but to use a centralized trading platform. They have to keep perfect records for accounting (like companies since they're considered businesses), and of course, be able to prove it in case of an audit.That's also how a gov. knows how to tax them.If you give them a record of Bisq, the taxes department will give you serious problems and a hefty fine.@bitmoverFirst time I see a 0% fee for low volumes, they waste a lot of money@JeromeTashHe can't really use a p2p platform since he needs to verify the ID of others, otherwise, it could be considered an illegal money transmitting service and could as well be accused of money laundering.Unless the others parties are ok to follow a KYC verification...@TechTardThe 1.5% fee you're talking about on Kraken is when you buy a stablecoin with crypto. Otherwise, the fee is about ~0.15%Welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "October 28, 2022, 11:48:33 PM",
      "body": "According to my experience with trading platforms, the best way for you to convert crypto into your local currency is to use the Binance platform as follows :- After you withdraw your winnings from the gambling platform, send them to your account on Binance. Deposit processes are free, and account verification does not take long, as all you have to send is a copy of your passport or driver's license, and they will verify your identity through your phone's camera.- After that, you convert Crypto to Bitcoin. This step also does not cost a fee because all Bitcoin trading has been free for about two months.- Then you send the bitcoin to your Binance Peer-to-Peer account, and you will find many users paying in euros, and you can choose the appropriate payment method for you.Almost the whole process is free and does not cost any fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 28, 2022, 11:59:24 PM",
      "body": "Quote from: LeGaulois on October 28, 2022, 11:23:47 PMFirst time I see a 0% fee for low volumes, they waste a lot of moneyMeh... at $1000 limit, they are only wasting $3 per month and per user. It's probably worth it as a way of adquiring new users, specially the retail.Quote from: coupable on October 28, 2022, 11:48:33 PM- Then you send the bitcoin to your Binance Peer-to-Peer account, and you will find many users paying in euros, and you can choose the appropriate payment method for you.Almost the whole process is free and does not cost any fees.Keep in mind that most people who are doing P2P need to profit somehow, so they usually have a big spread. It's not really zero fee or free. For example, for buying:BTC/EUR -> 20,688BTC/EUR P2P -> 20,900https://www.binance.com/en/trade/BTC_EUR?theme=dark&type=spothttps://p2p.binance.com/en/trade/sell/BTC?fiat=EUR&payment=ALL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 29, 2022, 01:41:42 AM",
      "body": "I'm surprised why no one mention it's worst to use centralized exchange when you're linking a source that considered as high illicit source? gambling source are considered as money laundering which all centralized exchanges are fighting for.Read this thread to know if those centralized exchanges are doesn't want to accept gambling funds and your funds might be get freezed What Do Centralized Exchanges Consider as Taint?, even though you're send your coins from another wallet to another, it doesn't change anything since they can track the origin of your funds.The best thing is using mixing service e.g. Chipmixer and use decentralized exchange e.g. Bisq, run it via Tor browser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 29, 2022, 02:36:47 AM",
      "body": "If you are a professional poker player I think it is indifferent or does not matter in this case specifically when we talk about fees.On the other hand, if the 1.5% is affecting you, that is actually the problem.(?) I dont know!  If what you are doing works for you at 1.5%, why change it?  If the fees are a fk, but a 1.5% for a professional player fits in the expenses if that puts the money into your fiat account. By the way a payout of 1.5% is lower but by quite a bit compared to traditional Fiat casinos.Finally: Look for the best way to secure your money and privacy, do not look for low fees look for the best exchange that protects your money well. Maybe you already have it...We have a Gambling board, hopefully you can leave us some of your experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 29, 2022, 11:38:13 AM",
      "body": "I've been hearing about Binance and other exchanges blocking funds from gambling business, don't know how reliable that is but I guess you can also look for P2P option. Maybe just liquidate your coins quarterly or something like that to save some fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 29, 2022, 11:45:15 AM",
      "body": "As I know, the FTX exchange has no withdrawal fee for certain amounts in BTC. KYC is also not mandatory for them, it's a good basis to transfer coins to your wallet. they should definitely be taken into accountyou should definitely pay attention to whether a particular exchange allows deposits from gambling sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 29, 2022, 12:47:18 PM",
      "body": "Quote from: examplens on October 29, 2022, 11:45:15 AMAs I know, the FTX exchange has no withdrawal fee for certain amounts in BTC. KYC is also not mandatory for them, it's a good basis to transfer coins to your wallet. they should definitely be taken into account I think FTX and no KYC is a thing of the past now. That was true in the past, and it was a great way to attract new customers. Especially when other centralized exchanges started annoying their users with their KYC demands. But if you check out the two sources I will link to below, you will notice that KYC is required to be allowed to deposit and trade on FTX. Unverified accounts can just browse the site and check out its features. Those who want to use FTX should know there are 2 tiers of KYC. For level 1, there is no need to submit address verification, copies of identity documents, or prove where the money originates from, for example.https://help.ftx.com/hc/en-us/articles/360027668372-Signing-up-on-FTXhttps://help.ftx.com/hc/en-us/articles/360027668192I wanted to suggest face-to-face meetings, but I am not sure how useful that would be since OP said he is a professional poker player. Countries in which crypto is popular, surely have crypto forums, social media groups, Telegram groups, etc. where you can find real people you can meet and perform crypto-to-fiat deals with. No online traces, no filling the pockets of centralized exchanges. There are of course other risks associated with that, such as getting robbed, counterfeit money, etc. It's still an interesting way to trade if you are aware of the risks and aren't afraid to expose yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "October 29, 2022, 02:48:32 PM",
      "body": "Quote from: TechTard on October 28, 2022, 06:53:33 PMHi there,I'm a professional poker player that plays on a bunch of online platforms that solely pay out in crypto currency, either Bitcoin or Tether.I currently use Exodus as my wallet and Kraken as my exchange platform to convert the crypto I receive to Euro's (€) in order to then withdraw my winnings to my bank account. Kraken charges a 1.5% fee on the convertion from crypto to Euro's (€), however, which is starting to add up.I was wondering what exchange platform charges the lowest fees for conversions from Bitcoin to Euro.I was also wondering what exchange platform charges the lowest fees for conversions from Tether to Euro.I've done a bunch of Googling, but I can only find the rates for trading, which I have no interest in doing.If someone can let me know what the place to be is for me, I'd hugely appreciate it.Best of luck in your crypto endeavors,TechTardFor conversion of Fiat 1.5% doesn't seems to be a high fee as far as I know, ir you can use the p2p platform which also has 1% fee and the trade value depends on current competition among the other traders so who makes aggressive prices will be at the top.I just want to remind you something some exchanges doesn't allow rewards from gambling exchanges to deposit and the classic example is coinbase if someone withdraw funds from gambling sites to their coinbase account then the account will be terminated with no more appeals. So if you are trying other exchanges then make sure it has no such kind of restrictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordsilvabtc",
      "created_time": "October 29, 2022, 05:55:53 PM",
      "body": "Binance P2P option will be the safest in my own opinion, as you're aware countless number of times Binance have actually blocked Gamblers accounts , and all ways to get back funds has proved to be unsuccessful, I'm a victim of this circumstances, that's why I'm giving you my honest opinion in relation to this content",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 29, 2022, 07:51:13 PM",
      "body": "Quote from: LeGaulois on October 28, 2022, 11:23:47 PMThe problem for traders (those for whom trading is a job) is they have little choice but to use a centralized trading platform. They have to keep perfect records for accounting (like companies since they're considered businesses), and of course, be able to prove it in case of an audit.That's also how a gov. knows how to tax them.Well yeah, but this guy is pro poker player that plays with Bitcoin, so he is certainly not a trader, he just wants to exchange coins for fiat in best possible way.I know some traders who are doing 100% of their trades P2P and in person, they never use centralized exchanges, and they function perfectly, plus they have more money because they pay less extortion fees.I don't think that poker players that play with BTC are reporting everything they do to government official, same like when you play in normal casino in Vegas.Quote from: LeGaulois on October 28, 2022, 11:23:47 PMIf you give them a record of Bisq, the taxes department will give you serious problems and a hefty fine.Yes they will give you problems IF they found about what you did ''last summer''.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 30, 2022, 12:37:12 AM",
      "body": "Since you want to convert and then withdraw to your personal bank account,  I will advise you to use any centralized exchange like Binance and Mexc which have p2p support. with the help of the p2p now you can get a direct bank transfer from a buyer costing you a zero fee that's for Binance, but that will require you to pass your KYC verification before you will be allowed to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 30, 2022, 09:34:29 AM",
      "body": "Strangely, nobody is talking about Dex, Isn't Dex suppose to be the most cheapest way of buying crypto coins? I use DODO Ex and Metavault trade because they scan for the cheapest transaction, I know there are other good alternatives out there but I like prefer these two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "October 30, 2022, 01:20:10 PM",
      "body": "Quote from: Lordsilvabtc on October 29, 2022, 05:55:53 PMBinance P2P option will be the safest in my own opinion, as you're aware countless number of times Binance have actually blocked Gamblers accounts , and all ways to get back funds has proved to be unsuccessful, I'm a victim of this circumstances, that's why I'm giving you my honest opinion in relation to this contentIt sucks at the fees though. Anyone is free to set the prices they want to buy/ sell and now only those merchants get to list their ads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}