{
  "id": "topic_5479028",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "December 23, 2023, 01:16:38 PM",
  "content": "Sorry if this sounds like I am late, I am just knowing that Bitcoin is available on Binance chain, how many of you know this? A crypto newbie that I introduced to Bitcoin came to me some hours ago saying he found a way to escape the Bitcoin high transaction fee. I thought he was talking about the Ligthening Network because that was the only solution I told him is available, he choose to use Binanace chain and after looking into it I am surprised that the Volume is very high and top exchanges supports BTC on Binance chain as well.I am not saying it's good or bad because I don't know but I am shocked that I never knew this existed before, now I keep wondering about how many things I don't even know is happening in crypto, are you guys familiar with this? Anyone using BNB chain to store Bitcoin to avoid high transaction fee?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5479028",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 23, 2023, 01:19:35 PM",
      "body": "It is an altcoin that is pegged to bitcoin price. The risk is that if something happen to the altcoin, it can be depegged. The real bitcoin are the ones on the bitcoin blockchain and lightning network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "December 23, 2023, 01:23:40 PM",
      "body": "The common thing I Know of is the use of the BNB smart chain network by exchanging your bitcoin to it, but using the BNB network to store for your bitcoin is something i have also not tried before, but one thing assured me of using BNB smart chain network, it's the cheapest of all if am not mistaken, so many people will prefer the use of BSC network instead of other networks just to have a lower transaction fee rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 23, 2023, 01:24:25 PM",
      "body": "Its nature is just an altcoin and not bitcoin, on any chain to encourage users to use it at low cost is just a way to deceive them. And it's not the original Bitcoin, I don't really care about having to pay a transaction fee if i use bitcoin, or if it's simpler, people like and don't like to spend fees, so why keep looking for ibitcoin?  , my personal opinion is that we accept bitcoin, not that bitcoin accepts us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "December 23, 2023, 01:24:36 PM",
      "body": "I remember suggesting this to a user that came to the forum seeking for how they could get their coin out of an exchange but don’t want to use bitcoin cause of the fee hike… but the issue now is that when you choose this as an option you’ll no longer be dealing with bitcoin, you’ll now have an altcoin in your possession and just like the post above mine stated there’s a possibility of it being depegged and if that should happen there’s no telling if the price will return back to normal or just keep falling. If you’re ready to accept the risks involved then it would be a great way to avoid the transaction fee hike.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "December 23, 2023, 01:33:14 PM",
      "body": "That's not a real Bitcoin, it's a token that pegged with Bitcoin price, owning that will make you able to get hacked just like this case Binance Smart Chain Token Bridge Hack and your token could be freeze by them since BSC is centralized.Is this good to avoid high transaction fee? not really because there are better coins that open source and not centralized e.g. Doge and Litecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeilLostBitCoin",
      "created_time": "December 23, 2023, 01:44:09 PM",
      "body": "I know this option and holding Bitcoin in other chains is possible, but I wouldn't recommend it. The Bitcoin held in other chains is not the real Bitcoin. It's just pegged to Bitcoin. I'm uncomfortable keeping my Bitcoin in other chains because there is a risk of it being depegged if there are any issues with the main coin of that chain. Most people withdraw their Bitcoin from exchanges like Binance because they don't trust them. Holding your Bitcoin in other chains to save on withdrawal fees is not a wise decision. I would rather pay a high withdrawal fee than risk holding my Bitcoin in other chains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PetieT",
      "created_time": "December 23, 2023, 01:47:34 PMLast edit: December 25, 2023, 03:29:54 PM by PetieT",
      "body": "Why not change the platform? There are other options where the commission is much lower. I often use the site where the constant Upcoming Airdrops . So far it has not let me down and the commissions there are not large. Although to be honest, I am buying up a small portfolio and therefore the commissions, so I can't say what commission is after 1000$",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "December 23, 2023, 01:53:09 PM",
      "body": "Quote from: KiaKia on December 23, 2023, 01:16:38 PMI am not saying it's good or bad because I don't know but I am shocked that I never knew this existed before, now I keep wondering about how many things I don't even know is happening in crypto, are you guys familiar with this? Anyone using BNB chain to store Bitcoin to avoid high transaction fee? There’s Wrapped Bitcoin in almost all blockchain not only to Binance Smart Chain. Binance only list the BSC pegged token to support their own chain but you can see a lot of wrapped Bitcoin everywhere since blockchain bridge makes the interoperability of tokens possible to every chain.As explained above, the chance of depegging is the biggest risk you can get on this kind of token especially if you are a long term holder.You can use as an example BUSD that is now already being delisted and cease to exist early next year since Binance have problem to their issuer. This can happened to any token that value relies on pegging value stored on smart contracts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "December 23, 2023, 01:57:57 PM",
      "body": "Quote from: KiaKia on December 23, 2023, 01:16:38 PMI thought he was talking about the Ligthening Network because that was the only solution I told him is available, he choose to use Binanace chain and after looking into it I am surprised that the Volume is very high and top exchanges supports BTC on Binance chain as well.What you are referring to is WBTC (Wrapped Bitcoin) which is an altcoin and not Bitcoin. It is available on not just Binance Smart chain but also Ethereum and Tron blockchain. It is on the Binance Smart Chain a BEP20 token, on the Ethereum blockchain and ERC20 token, and Tron, it is a TRC20 token. You will get high volume as the fee is very low and Binance does promote its blockchain on its exchange. This is justified as both the exchange and blockchain are owned by Binance and being centralized it will first promote itself than the real Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 23, 2023, 03:03:36 PM",
      "body": "You do not get a Bitcoin, but a WBTC token. It is true that its value is currently 1 Bitcoin, but there is nothing that guarantees that value, and it may be less than 1 Bitcoin, so instead of paying $20 to $50 in fees, you may lose everything you own.WBTC is useful for small payments around $500 and is not a long-term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "December 23, 2023, 03:05:57 PM",
      "body": "Quote from: 348Judah on December 23, 2023, 01:23:40 PMThe common thing I Know of is the use of the BNB smart chain network by exchanging your bitcoin to it, but using the BNB network to store for your bitcoin is something i have also not tried before, but one thing assured me of using BNB smart chain network, it's the cheapest of all if am not mistaken, so many people will prefer the use of BSC network instead of other networks just to have a lower transaction fee rate. Bitcoins from any network other than the Bitcoin network are not original Bitcoins, they carry a lot of risk, so if you intend to hold Bitcoins, you should not choose other chains. Because they can be scams, they have no guarantees like original bitcoins, and they have no potential like original bitcoins. So you should never risk holding just to avoid some transcation fee. You should always use original bitcoins and hold them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "December 23, 2023, 03:30:03 PM",
      "body": "As expected, my reply to him is that anything can happen to binance chain, hacks is more possible on alts and it's near impossible on Bitcoin network, but the desperation of avoiding high transaction fee is why people like him are looking for cheap way.I still strongly stand with my own solution to this problem using Lightening Network rather than other, I don't expect anyone to use the binance chain BTC that's why I bring this question to the forum, I am strongly against it myself, but since he is into this I am trying to figure out if there are other people like him on this forum. If anyone is, just know that BTC on binance chain is not decentralized, this is a centralized network and anything can happen, you are at your own risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 23, 2023, 03:36:21 PMLast edit: December 23, 2023, 04:33:16 PM by BlackHatCoiner",
      "body": "Quote from: KiaKia on December 23, 2023, 01:16:38 PMSorry if this sounds like I am late, I am just knowing that Bitcoin is available on Binance chain\"Bitcoins\" in Binance chain hold the same water as \"IOU bitcoins\" in a bank's spreadsheet. There is peg as long as the bank doesn't go bankrupt. Which reminds me of why we have Bitcoin in the first place.Quote from: KiaKia on December 23, 2023, 01:16:38 PMA crypto newbie that I introduced to Bitcoin came to me some hours ago saying he found a way to escape the Bitcoin high transaction fee. Look. If he's into cryptocurrencies just to make profit using Binance, then buying and selling real bitcoin and being required to pay high fees etc., is reasonably an inferior solution comparably to just buying and selling IOUs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 23, 2023, 03:51:35 PM",
      "body": "Quote from: KiaKia on December 23, 2023, 03:30:03 PMAs expected, my reply to him is that anything can happen to binance chain, hacks is more possible on alts and it's near impossible on Bitcoin network, but the desperation of avoiding high transaction fee is why people like him are looking for cheap way.Let's take the hack risk aside. We are talking about some tokens that are under a different blockchain, which is not bitcoin, but pegged coins, be it bitcoin or fiat surfers of the same faith. We can't confirm if there is actually any real bitcoin backing those shitcoins anywhere as there is no transparent report that they give about their reserves with respect to their pegged coins. Another risk you are to think about aside from the hack is this: what if something happens to Binance as a whole? Do you think it's a native token or any coin that is being minted by them? Everything will crash, even if it recovers. It will take a lot of time. And again, when you swap over to the altcoin that they claim to be bitcoin, you are also not in control of the coin that you are holding as they are centralised and can be frozen in your wallet anytime, even if you move them out of the centralised exchange. So when thinking about the possible ways to go about low fees, we should also consider the privacy and security measures that come with them. So we should always give those who seek alternatives what it will cost them for whatever option they choose to go with; zero fees are not the only thing to worry about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rampagoe004",
      "created_time": "December 23, 2023, 04:02:28 PM",
      "body": "Quote from: Jawhead999 on December 23, 2023, 01:33:14 PMIs this good to avoid high transaction fee? not really because there are better coins that open source and not centralized e.g. Doge and Litecoin.That is very correct! I usually see the option of using binance smart chain when making transactions from the exchange. I noticed it too but I was thinking is this really BTC? Because they provide addresses similar to smart contracts of the Ethereum network. So how is it possible for BTC to be transferred using a completely different network? But because of your post I am curious to try it and whether we can really avoid the high costs as you said?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 23, 2023, 04:04:40 PM",
      "body": "Quote from: KiaKia on December 23, 2023, 03:30:03 PMbut the desperation of avoiding high transaction fee is why people like him are looking for cheap way.Each to their own, if they are using this pegged tokens with the knowledge that it is not BTC but an altcoin, and also knowing what the risks are, then it is up to them to decide what they want to do.Quote from: KiaKia on December 23, 2023, 03:30:03 PMI still strongly stand with my own solution to this problem using Lightening Network rather than otherThe LN is not a total solution to the problem of high tx fees, the LN can help with micro tx's, but other than that i would not call it a solution to BTC's scalability issues. Take note that you also have to pay on-chain fees when opening and closing a channel.Quote from: KiaKia on December 23, 2023, 03:30:03 PMIf anyone is, just know that BTC on binance chain is not decentralized, this is a centralized network and anything can happen, you are at your own risk. I feel the people who use these pegged tokens do not care about this, my thinking is that many of them even hold their funds in Binance, they don't worry about security or anything like that, but just how to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "December 23, 2023, 04:12:35 PM",
      "body": "I thought it was a solution to the high transaction fees but then I saw that it's just pegged tokens which isn't really a good solution, better staying in Binance now and wait for the tx fees to go down than to use an altcoin as a replacement and if I recall correctly, when you choose other network options besides the bitcoin network and the lightning network, you will unknowingly convert bitcoin to the tokens that the chosen network uses that's not bitcoin. I'm getting tired of waiting for the transaction fees to go down though, I'm not sure how long I can wait for the ordinals to lose its charm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "December 23, 2023, 04:31:28 PM",
      "body": "Quote from: Oshosondy on December 23, 2023, 01:19:35 PMIt is an altcoin that is pegged to bitcoin price. The risk is that if something happen to the altcoin, it can be depegged. The real bitcoin are the ones on the bitcoin blockchain and lightning network.I think it's the best answer to the thread and we should not opt for this solution as it's quite risky becasue we are going to be trusting an altcoin that can loose its value anytime. I still believe that the only usable and genuine option in such high fee times is to go with lightning network.Fortunately, the LN is now available on Binance but still it's not widely used and we can't force others to use it. Even Hhampuz doesn't considers to open lightning channels for his managed campaigns to pay the participants of his campaigns via LN route which makes LN almost not usable as of this time. LN is not adopted by many users and still people hesitate to go with LN. The only option with us in current network congestion times is to go with an altcoin payment or send payment with Bitcoin by paying high fees.Here's his statement:Quote from: Hhampuz on December 22, 2023, 02:06:42 PMI currently have about 300 users in total in my campaigns, opening channels for all of the campaigns and getting everyone to get on LN to accept payments seems like an incredibly annoying endeavour and not something I'd be too interested in doing right now. To be honest I'd probably prefer to pay $100-$150 out of pocket to cover tx fees rather than that, lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "December 23, 2023, 04:39:11 PM",
      "body": "it's not a way to get around high bitcoin fees, but only to replace bitcoin using altcoins pegged to bitcoin to make transactions on the binance network. of course the fees offered are much lower compared to bitcoin, because the network used is bsc, which offers speed and lower fees. moreover, this method only applies if both people transact using a smart chain, it is impossible to do it across chains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}