{
  "id": "topic_5481377",
  "title": "Alpha Marine",
  "author": "Alpha Marine",
  "created_time": "January 12, 2024, 06:24:56 PMLast edit: January 12, 2024, 06:53:12 PM by Alpha Marine",
  "content": "My trust in Bitcoin grew exponentially when I knew the price history of Bitcoin. Besides other things, history is one main thing used in technical analysis. You can't analyze a market if you don't know the history of that market. History helps you determine how that market behaves at different points in time.Bitcoin price history is necessary for all Bitcoiners, but to be a successful holder you have to understand the price history of Bitcoin. This will help you understand the volatility of Bitcoin. When you know the price history of Bitcoin you will understand that there is nothing new about the fall and rise of price. Also, the history will let you know that the price always goes back up after a fall and that should help you in your effort to hold Bitcoin.When you read about the price history you'll see years like 2017 where Bitcoin peaked at just over $19000 from a thousand dollars. The volatility of Bitcoin goes both ways and you can only hold on to your Bitcoin when you know these things. This is a graph of Bitcoin price in 2014 by  Statmuse In 2014, Bitcoin went from about a thousand dollars to under $200 and finally ended the year at just over $300. This kind of knowledge helps you keep the faith as a Bitcoin holder when the price dips.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5481377",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "January 12, 2024, 06:36:55 PM",
      "body": "Checking charts can be useful, but understanding what caused significant market shifts in the past and calculating how much influence such events have now and in the coming years is also very important.Quote from: Alpha Marine on January 12, 2024, 06:24:56 PMWhen you read about the price history you'll see years like 2019 where Bitcoin peaked at just over $19000 from a thousand dollars. That was 2017. 2019 was a bear period just like the year before it, leading up to the bull run of late 2020/2021.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "January 12, 2024, 06:54:55 PM",
      "body": "Quote from: Upgrade00 on January 12, 2024, 06:36:55 PMThat was 2017Yes, that's true. My mistake. Thanks for the correction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "January 12, 2024, 06:57:28 PM",
      "body": "2019 was one of the bearish years where the price of Bitcoin had dropped following the dump started in 2018. Knowing Bitcoin price history is important but we still cannot speculate things with the past though we can relate it like we have seen bull run whenever halving has taken place (follows the next year from the halving year), reason I am saying we cannot predict or speculate based on price history is because I used to follow the same and in last couple of Decembers we haver seen Bitcoin dumping hence I though December brings this jinx which was not the case in 2023 as in the month of December in fact Bitcoin prospered even further.  But price history helps un in making calculated steps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "January 12, 2024, 07:04:00 PM",
      "body": "Quote from: Alpha Marine on January 12, 2024, 06:24:56 PMMy trust in Bitcoin grew exponentially when I knew the price history of Bitcoin. Sorry but I had to stop reading your post right there. The way I see it, you just found a way to f yourself exponentially. It is because the charts only give you the past data. They don't really tell you anything about the future. If you want to trust btc, look at its fundamentals. Look at its adoption rate. See how many mercs do business with btc. A good chart doesn't mean anything if btc fees keeps rising and the network becomes unusable for many people. All of that could come down very quickly. Slowly at first, then suddenly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "January 12, 2024, 07:11:08 PM",
      "body": "Most important, knowing Bitcoin price history is most important when you were going for trading. The price of Bitcoin we see is certainly through the chart, does it only show the current price of Bitcoin? The chart show the previous price of Bitcoin. Moreover, if you want to trade in Bitcoin or any other coin, it is possible to trade only after seeing its previous or history price, otherwise it will not be trading, it will be gambling. Moreover, for those who are trading in Bitcoin for long term or holding Bitcoin, it is necessary to see the previous price history of Bitcoin.  Because depending on it they can adopt their long term strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "January 12, 2024, 07:14:38 PM",
      "body": "As a beginner, you're not expected to know about the market price movement alone, but have the deep insight of what bitcoin is, the types of wallets, their security practice, how to track the market price, speculate and find for different resource needed for your own benefits with bitcoin, understand risk management and get every required information needed to know and always keep upto date as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "January 12, 2024, 07:20:04 PM",
      "body": "Quote from: kentrolla on January 12, 2024, 06:57:28 PM2019 was one of the bearish years where the price of Bitcoin had dropped following the dump started in 2018. Knowing Bitcoin price history is important but we still cannot speculate things with the past though we can relate it like we have seen bull run whenever halving has taken place (follows the next year from the halving year), reason I am saying we cannot predict or speculate based on price history is because I used to follow the same and in last couple of Decembers we haver seen Bitcoin dumping hence I though December brings this jinx which was not the case in 2023 as in the month of December in fact Bitcoin prospered even further.  But price history helps un in making calculated steps.That’s why only technical analysis like past bitcoin price history is not the only thing that most bitcoin traders look into there is also the fundamental analysis which plays a major role in the price movement. Just like the example you brought about the last quarter of 2023 been bullish instead of the regular bearish market we see most especially if it is year to bitcoin halving I will say it was fundamental like the hype around the just approved bitcoin ETF that made it so. You could remember that whenever a rumor is spread the market reacts to such rumors either by falling if was a negative one and by pumping if it was a positive one. Fundamentals play same role as technical in bitcoin price. Some few examples of these are government policies on cryptocurrency, regulations and also news around exchanges or banks like hacks or bankruptcy. Some economical effect too like recession or inflation rate also contributes to the situation surrounding the bitcoin price reaction",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "January 12, 2024, 08:22:06 PM",
      "body": "Quote from: Upgrade00 on January 12, 2024, 06:36:55 PMChecking charts can be useful, but understanding what caused significant market shifts in the past and calculating how much influence such events have now and in the coming years is also very important.This is the very statement that everyone should know as I definitely agree with you.Sure, the price history of index showed a significant increase to its price ever since it started way back in 2009. But understanding those key events that lead to its price right now should be taken into account before you invest. While a person may use its price history index as basis for investing, you must also know the reason on why bear and bull runs happened within those years also.A person should not just blindly invest without knowing on why the price of BTC increased in the first place. Not to mention, even during those bullish runs, there were some bearish runs that caused the price of BTC to crash in those said years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "January 12, 2024, 09:08:20 PM",
      "body": "Maybe somehow it is still good that we know something about the history of Bitcoin. Of course, it can be a guide that we know how it was created and why it was made. That's why it won't be proof to say that through history we can get a big profit here; of course that's not the case.   Actually, there are many things that should be considered, although it's a big factor from another angle that we are accurate about Bitcoin's past in this industry that we are in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "January 12, 2024, 09:20:27 PM",
      "body": "Quote from: Alpha Marine on January 12, 2024, 06:24:56 PMMy trust in Bitcoin grew exponentially when I knew the price history of Bitcoin. Besides other things, history is one main thing used in technical analysis. You can't analyze a market if you don't know the history of that market. History helps you determine how that market behaves at different points in time.[/url]Apart from in Bitcoin analysis, there is no type of analysis that does not put into account the history occurrences. Without past will present not form and on the basics of the present is the future formed. Although, historic trace alone cannot give you a well defined or an independently reliable information. There are other factors which negates the history track record most times. In a nutshell, I can say that Bitcoin price history is important to every bitcoiner, but should be more important to say traders and short term investors. I think HODLERS are free from the headache of price crises.Quote from: qwertyup23 on January 12, 2024, 08:22:06 PMQuote from: Upgrade00 on January 12, 2024, 06:36:55 PMChecking charts can be useful, but understanding what caused significant market shifts in the past and calculating how much influence such events have now and in the coming years is also very important.This is the very statement that everyone should know as I definitely agree with you.This is where fundamental and technical analysis meets and augments each other",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "January 12, 2024, 09:39:45 PM",
      "body": "Knowing the history is good indeed but it's not just that the only thing that is important to know but also the reason why it increase and decrease. One more thing is that you should also make some research if the information you got is correct so it won't be a misinformation when someone reads it just like what upgrade have explained. I don't know if you get it from somewhere else or you made a mistake of what you want to share 2019 is a bear market time where it was around $3k on January when on 2018 it was around $10k which shows a great difference on its price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "January 12, 2024, 09:40:56 PM",
      "body": "The history can be reviewed in minutes, a 24-hour history gives the necessary information for whoever interprets it, the longer the history, the better the tendency is towards that beautiful \"45º\" curve, so, it is indeed important, just We must use it correctly and add additional information to \"try\" to be as close as possible to the price we want to project with our prediction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "January 12, 2024, 09:45:21 PM",
      "body": "Quote from: Alpha Marine on January 12, 2024, 06:24:56 PMBitcoin price history is necessary for all Bitcoiners, but to be a successful holder you have to understand the price history of Bitcoin. This will help you understand the volatility of Bitcoin.It is true that we must know the Bitcoin price history to understand the price growth of Bitcoin. If we don't know the price history of Bitcoin, we can't understand the cycle of bearish and bullish. Understanding the price history of Bitcoin will help us to determine when we must buy and sell our Bitcoin. It is not only about to strengthen our mentality, but it is the way to make good decisions for Bitcoin investment.I'm sure every investor must learn carefully the price history of Bitcoin. It gives them an idea to predict the potential growth of Bitcoin price in the future. Investors want to know how good the potential of Bitcoin in the future. By analyzing the price history, investors can create a roadmap for the plan of their investments in the next few years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "January 12, 2024, 09:45:30 PM",
      "body": "First, all data is for reference only and then there is speculation, if it happens according to speculation then it is a coincidence and nothing really guarantees it is completely correct  . I also used to be very fascinated with past data to conclude that prices follow a specific rule, but that doesn't happen, or maybe it's just me and many people who can't afford it. If it's true, then I believe the crowd will become truly rich.So what is considered a statement is just a way to lure/counter the presence of an active object. With bitcoin we can implicitly understand that its value will increase over a long period of time with the fiat exchange rate, but it doesn't mean that the journey only increases, but it comes with fluctuations. It is simply the process of accomplishing goals through personal strategy, and no one is truly capable of helping people by acting on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbigtart",
      "created_time": "January 12, 2024, 09:54:37 PM",
      "body": "Of course, before investing in bitcoin, we must first know the history of bitcoin, because this is important to start investing, especially if the investment will be made in the long term. I think not only bitcoin, almost all investments, we should study their history.Apart from knowing the foundation, this is also our reference for making investment decisions because we already understand the history and graphic patterns. I even believe that one of the investments that produces hundreds of percent is bitcoin investment. I will continue to do dca and invest in bitcoin. because by studying the history of bitcoin we also know that bitcoin has a four-year cycle which makes the price of bitcoin always rise and creates a new ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "January 12, 2024, 10:01:22 PM",
      "body": "Quote from: Alpha Marine on January 12, 2024, 06:24:56 PMMy trust in Bitcoin grew exponentially when I knew the price history of Bitcoin. Besides other things, history is one main thing used in technical analysis. You can't analyze a market if you don't know the history of that market. History helps you determine how that market behaves at different points in time.Knowing the stages Bitcoin has gone through and its adoption rate makes it easier to predict where Bitcoin will go. At the same time, it can determine what kind of attitude one will have towards the speculations made today. So, having knowledge about Bitcoin can put you in an advantageous position.You can learn about the decisions you make and many issues you need to pay attention to when investing by looking at Bitcoin's history. Just looking at the price of Bitcoin may not be enough, so having as much information as you can about Bitcoin will help you move more easily in the market and benefit you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "January 12, 2024, 10:33:43 PM",
      "body": "Quote from: mindrust on January 12, 2024, 07:04:00 PMQuote from: Alpha Marine on January 12, 2024, 06:24:56 PMMy trust in Bitcoin grew exponentially when I knew the price history of Bitcoin. Sorry but I had to stop reading your post right there. The way I see it, you just found a way to f yourself exponentially. It is because the charts only give you the past data. They don't really tell you anything about the future. If you want to trust btc, look at its fundamentals. Look at its adoption rate. See how many mercs do business with btc. A good chart doesn't mean anything if btc fees keeps rising and the network becomes unusable for many people. All of that could come down very quickly. Slowly at first, then suddenly.They say that no knowledge goes to waste. I agree that the price history is past and doesn’t determine what will happen but it doesn’t hurt to know or learn about it. For me I think it’s important for those who want to trade Bitcoin and even those who want to invest over a long period of time. Let’s not forget that it’s still previous price charts that traders use to predict the next move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "January 12, 2024, 10:36:26 PM",
      "body": "Currently writing a book covering BTC price history:https://drive.google.com/file/d/1VZsSeyfJLDVL5BDubpus-TMSq-ngCKyd/view?usp=sharingBitcoin history book thread:https://bitcointalk.org/index.php?topic=5475400.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "January 12, 2024, 10:41:58 PM",
      "body": "The importance of knowing Bitcoin historical prices would enhance your confidence to  not panicking by the volatility of Bitcoin because at then, you Will be tendered to have the confidential believe that the appreciations or the depreciation current mode of Bitcoin could be changeable at any given time so, need for panicking would definitely have you no benefits while you have to remain calm.Meanwhile.... Learning about the historical prices of Bitcoin would profer you better chances to trade your coins amicably at most especially during purchase, the craving for hodling and when to sell. The honesty is that Bitcoin has never lost its potentials values although the prices would definitely remain unpredictably unassured by the Investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}