{
  "id": "topic_5466272",
  "title": "ZeeshanTrade",
  "author": "ZeeshanTrade",
  "created_time": "September 10, 2023, 04:10:28 AM",
  "content": "I would like to know if i use Instant Exchange https://exch.cx/ and convert my bitcoins to litecoin, will it serve as a mixing too and my coins can't be traced (act as a mixer) ?Meaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466272",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "September 10, 2023, 04:26:06 AM",
      "body": "Exchanges do not replace a mixer or a proper coinjoining service. You can sue it it you're trying to blur the transaction trail at a basic from family and friends but your transactions are logged by the exchange and they are liable to share that information and can lose it through a breach.Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMMeaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )AFAIK exchanges use multiple addresses and you will not get the same one each time except at the point of deposit (which they change sparingly for each user).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZeeshanTrade",
      "created_time": "September 10, 2023, 04:32:27 AM",
      "body": "Quote from: Upgrade00 on September 10, 2023, 04:26:06 AMExchanges do not replace a mixer or a proper coinjoining service. You can sue it it you're trying to blur the transaction trail at a basic from family and friends but your transactions are logged by the exchange and they are liable to share that information and can lose it through a breach.Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMMeaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )AFAIK exchanges use multiple addresses and you will not get the same one each time except at the point of deposit (which they change sparingly for each user).i always get a different btc deposit addresses at exch.cx which is instant exchange, not a trading exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 10, 2023, 04:40:50 AM",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 04:32:27 AMi always get a different btc deposit addresses at exch.cx which is instant exchange, not a trading exchange.I haven't used https://exch.cx/ but some exchanges allow change of deposit address at each transaction and some do not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 10, 2023, 05:43:51 AM",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMI would like to know if i use Instant Exchange https://exch.cx/ and convert my bitcoins to litecoin, will it serve as a mixing too and my coins can't be traced (act as a mixer) ?I will advice you to use monero.Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMMeaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )That should not be a prove that it acts as a mixer. If you are not exchanging to a privacy coin like monero, the transaction can be traced by the government and https://exch.cx/Monero is the primary coin that you can use. I will recommend you to exchange it on a decentralized exchange like bisq.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZeeshanTrade",
      "created_time": "September 10, 2023, 06:27:45 AM",
      "body": "Quote from: Charles-Tim on September 10, 2023, 05:43:51 AMThat should not be a prove that it acts as a mixer. If you are not exchanging to a privacy coin like monero, the transaction can be traced by the government and https://exch.cx/Well, i want to use LTC. Other than government and the exchanges (exch.cx) themselves, other people can't trace it like you , me and other people only access to the public blockchain ? Please tell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "September 10, 2023, 06:32:44 AMLast edit: September 10, 2023, 06:59:51 AM by OmegaStarScream",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 06:27:45 AMWell, i want to use LTC. Other than government and the exchanges (exch.cx) themselves, other people can't trace it like you , me and other people only access to the public blockchain ? Please tell.Yes, that's true. If that's what you're worried about then yes, other individuals are probably not going to be able to see much but then you should keep in mind that there are platforms like Arkham Intelligence that allow people to post bounties for this type of thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 10, 2023, 06:45:20 AM",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 06:27:45 AMWell, i want to use LTC. Other than government and the exchanges (exch.cx) themselves, other people can't trace it like you , me and other people only access to the public blockchain ? Please tell.If you do not care about the government and the exchanges to trace you, you can go for any exchange of your choice. Even you can go for other no KYC exchanges. Because you are depositing to the same address on other centralized exchanges, your withdraw would be in another address entirely. This is how exchanges works. So, if you are not looking for anything more than that, you can go for https://exch.cx/. It is one of the instant exchanges that I can recommend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "September 10, 2023, 01:04:21 PM",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMMeaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )No matter how many times you send bitcoin to the exchanges like exch.cx, they will always give you a new bitcoin address where you will deposit the bitcoin and in return they will send you whichever coin you want to exchange (in your case Litecoin). Usually, each time the Litecoin you will receive will be from a different address. Now there is no link between your bitcoin you have send and the Litecoin you have received. Quote from: Charles-Tim on September 10, 2023, 06:45:20 AMSo, if you are not looking for anything more than that, you can go for https://exch.cx/. It is one of the instant exchanges that I can recommend.exch.cx is by far the most economical one to use for these types of transactions but i haven't tested it for any big amount. Their exchange rate is the best, close to the centralized exchanges like binance etc. Usually, it is better to conduct small transactions from these centralized instant exchanges, so the chances for their scam are minimal. No matter we do a multiple 50$ transactions or a one 500$ transactions, the fee will be same (1% Fixed or 0.5% dynamic).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 10, 2023, 01:49:08 PM",
      "body": "Quote from: Upgrade00 on September 10, 2023, 04:26:06 AMExchanges do not replace a mixer or a proper coinjoining service. You can sue it it you're trying to blur the transaction trail at a basic from family and friends but your transactions are logged by the exchange and they are liable to share that information and can lose it through a breach.exch.cx is a no-kyc instant swap exchange, there is no registration and they don't have any private information about their customers to share, only their addresses. eXch may not be a mixer in itself, but it is a swap exchange that is privacy focused and they also do not aggregate utxo's in one address, so it becomes very difficult for blockchain surveillance companies to trace or track where the coins came from.Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMMeaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )It is a good option for privacy, but you have to do your own part and use a different address in receiving your LTC. Exch.cx will provide you with a different address to deposit your BTC and since they don't aggregate utxo's your LTC will come from a different address, so when swapping multiple times, it is great for your own privay to not reuse receiving addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 11, 2023, 05:32:29 AM",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMI would like to know if i use Instant Exchange https://exch.cx/ and convert my bitcoins to litecoin, will it serve as a mixing too and my coins can't be traced (act as a mixer) ?Meaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )My answer to your question on exch.cx is that it does not serve as a mixer, so your coins do not merge. Instead, your coins can be like a trace when you use them, dude. Maybe you should understand what a crypto mixer is and how it works. How does crypto Mixer work?We know that the mixer can be centralized or decentralized. Now,  if you really want to use a mixer, what I can recommend to you is /blog/coinjoin]Coinjoin You can use it because it's not an exchange, but you should also know that mixing still has risks involved if you're not careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 11, 2023, 06:30:15 AM",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMI would like to know if i use Instant Exchange https://exch.cx/ and convert my bitcoins to litecoin, will it serve as a mixing too and my coins can't be traced (act as a mixer) ?Meaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )This is fairly easy for a blockchain analysis company to trace.Blockchain analysis companies obviously know about the existence of these instant exchangers, and also know that they are popular for swapping bitcoin to other coins. They also know how they work, know the fees they charge, and probably have identified their wallet addresses on multiple chains. If they see you sending $100 worth of bitcoin to one of them, and then a few minutes after it is confirmed they see $98 worth of litecoin leave, then they can link those transactions together. If you send all the litecoin to the same address, then they can probably work backwards and link all your bitcoin transactions together too.If you don't want to be traced, then you'll either need to mix or coinjoin your bitcoin first, or swap it for monero which cannot be traced in this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "September 11, 2023, 07:14:27 AMLast edit: September 11, 2023, 09:52:57 AM by satscraper",
      "body": "Quote from: ZeeshanTrade on September 10, 2023, 04:10:28 AMI would like to know if i use Instant Exchange https://exch.cx/ and convert my bitcoins to litecoin, will it serve as a mixing too and my coins can't be traced (act as a mixer) ?Meaning if i do multiple transactions using that Instant Exchange and convert Bitcoin to Litecoin. (The destination address of LTC remains the same in all the transactions )If, as you said , destination address in all transactions  is the same, then the mixing via  https://exch.cx/ has no sense,you will be traced by chain-analysis agencies. On the other hand, if those  addresses  are different and you will make a few swap rounds using Instant Exchange/s  as well  a few intermediate transactions (that don't reuse addresses)  between those rounds then your coins  will become less traceable.Chain-analysis uses heuristics to trace coins thus, in my view, it would be helpful if you could read the relevant  guide  divided into four parts  [1], [2], [3] and [4].  [1]. Understanding Bitcoin Privacy with OXT — Part 1/4 [2].  Understanding Bitcoin Privacy with OXT — Part 2/4 [3].  Understanding Bitcoin Privacy with OXT — Part 3/4 [4].  Understanding Bitcoin Privacy with OXT — Part 4/4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 11, 2023, 03:29:09 PM",
      "body": "In addition to what was mentioned, Blockchain analysis does not depend on information received from the Blockchain, but rather runs full nodes, cooperates with closed-source wallets, exchnages, block explorers, and some mixing services can be tracked as it relies on the principle of dividing and delaying the arrival of currencies, which makes tracking process difficult, but Doesn't make it impossible.Using a full node via Tor, Monero, splitting output across multiple addresses, delaying the withdrawal time, and stopping using block explorers are all things that enhance your privacy. What I would like to say is that you make it difficult to be tracked, but that does not make it impossible, but it is an effort that rarely happens to a regular account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "September 14, 2023, 02:10:31 AM",
      "body": "Quote from: o_e_l_e_o on September 11, 2023, 06:30:15 AMThis is fairly easy for a blockchain analysis company to trace.Quote from: satscraper on September 11, 2023, 07:14:27 AMIf, as you said , destination address in all transactions  is the same, then the mixing via  https://exch.cx/ has no sense,you will be traced by chain-analysis agenciesUsing the instant exchange may not be a perfect way to hide your privacy but if we look at the OP point of view, he is only concerned with that ordinary people can't trace him. Quote from: ZeeshanTrade on September 10, 2023, 06:27:45 AMOther than government and the exchanges (exch.cx) themselves, other people can't trace it like you , me and other people only access to the public blockchain ? Please tell. In this case, any Instant exchange can be suitable for him. Blockchain analysis companies won't investigate unless they are hired by someone to trace anyone and in this case, OP have no concerns about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 14, 2023, 06:53:23 AM",
      "body": "Quote from: virasog on September 14, 2023, 02:10:31 AMUsing the instant exchange may not be a perfect way to hide your privacy but if we look at the OP point of view, he is only concerned with that ordinary people can't trace him.Still depends. Many exchanges have their central wallets publicly identified. If someone knows that OP is using one of these exchanges to swap his bitcoin to litecoin, for example, then they can simply look for any litecoin transactions of the same value at the same time. Quote from: virasog on September 14, 2023, 02:10:31 AMBlockchain analysis companies won't investigate unless they are hired by someone to trace anyone and in this case, OP have no concerns about it.There are almost certainly blockchain analysis companies which passively scan all transactions and make any easy links or easy identifications they can. Far easier for them when they need to investigate some specific transactions to already have all the groundwork done already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 15, 2023, 01:12:40 AM",
      "body": "Quote from: virasog on September 14, 2023, 02:10:31 AMIn this case, any Instant exchange can be suitable for him. Blockchain analysis companies won't investigate unless they are hired by someone to trace anyone and in this case, OP have no concerns about it.I don't think this is a good idea. While it is unlikely that a company will investigate him out of nowhere, the chance of his data being sold or accessed by malicious parties still exists. Not to mention the risk of using instant exchange for his fund is quite high (KYC, terrible rate, etc). If I learn anything from Chipmixer or how mixing companies store their customer's data while they claim the opposite, it is unwise to assume nothing can go wrong at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 15, 2023, 06:03:15 PM",
      "body": "Quote from: joniboini on September 15, 2023, 01:12:40 AMI don't think this is a good idea. While it is unlikely that a company will investigate him out of nowhere, the chance of his data being sold or accessed by malicious parties still exists.I don't know about other instant exchanges, but the one op proposed to use: exch.cx does not collect any personal data from their customers, so nothing can be sold, all you need to swap your coins is to send it to the unique address provided by eXch and provide a destination address to receive the coins you've swapped to.Quote from: joniboini on September 15, 2023, 01:12:40 AMNot to mention the risk of using instant exchange for his fund is quite high (KYC, terrible rate, etc).No kyc on exch.cx, and they have a flat rate of 1% and dynamic rate of 0.5%.Quote from: joniboini on September 15, 2023, 01:12:40 AMIf I learn anything from Chipmixer or how mixing companies store their customer's data while they claim the opposite, it is unwise to assume nothing can go wrong at all.We don't know what was in the 7TB of data that was seized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruw",
      "created_time": "September 16, 2023, 07:43:04 PM",
      "body": "Quote from: joniboini on September 15, 2023, 01:12:40 AMIf I learn anything from Chipmixer or how mixing companies store their customer's data while they claim the opposite, it is unwise to assume nothing can go wrong at all.Yep, ChipMixer is one among many \"mixing sites\" that scammed an enormous amount of Bitcoin and ended up turning over their customer's data to the government anyway.  Only coinjoins give you the guarantee of privacy without trusting third parties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 16, 2023, 08:15:36 PM",
      "body": "Quote from: Kruw on September 16, 2023, 07:43:04 PMYep, ChipMixer is one among many \"mixing sites\" that scammed an enormous amount of Bitcoin and ended up turning over their customer's data to the government anyway.  Only coinjoins give you the guarantee of privacy without trusting third parties.ChipMixer did not scam their customers, neither did they \"hand over\" customer's data to the government. ChipMixer were provably taken down by authorities and their servers as well as 7TB of data we don't know what's in it was seized. There is a different between a platform being taken down by authorities and one that scams or rug-pulls customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}