{
  "id": "topic_5417036",
  "title": "Sam BYB",
  "author": "Sam BYB",
  "created_time": "October 13, 2022, 11:26:24 PM",
  "content": "Hey EveryoneI'm here representing the team at Bet Your Beans, founded by Matt Campbell and myself. We are developing a social betting platform that centers around p2p betting, gamification aspects such as leaderboards and profile customization, crypto movement bets and sports content. We aim to create a platform that merges online betting with social media in order to provide a fun community betting experience. Withdrawals will be instant, there is no house edge as the user creates their own betlines/odds, the betmaker owns the smart contract so the funds always remain in the possession of the bettors. My question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. If there is anything that bothers you about your current online betting experience please let us know so we can create the most accessible betting experience available.Regards,Sam",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417036",
  "comments": [
    {
      "author": "IIrik11",
      "created_time": "October 14, 2022, 03:49:25 AM",
      "body": "for me the most frustrating aspect of crypto betting nowadays is kyc.everywhere u go, all platforms wants to grab ur data before allowing u to withdraw anything.i miss sites like directbet.eu where u did not even had to make an account to bet.it was all on chain betting with instant payouts as soon as the outcome of a bet was achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "D ltr",
      "created_time": "October 14, 2022, 12:25:31 PM",
      "body": "kyc is a frustrating thing at the moment, because it's actually very private, but if we don't do it we can't withdraw the proceeds from what is ours, I don't know what their purpose is for making kyc an obligation if you want to withdraw funds from the platformhope your plafrom doesn't require KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "October 14, 2022, 12:40:13 PM",
      "body": "You are suppose to show a direction or link that some people can check your site not just name to be sure of the right website and know if you are worth to follow. A new account is not always trusted in this forum so building trust is important first and not product selling or casino publication.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "October 14, 2022, 02:49:07 PM",
      "body": "Quote from: Sam BYB on October 13, 2022, 11:26:24 PMMy question for you all is what are the most frustrating aspects of the online crypto betting applications you use?One of the most inconvenient part for me recently are the confirmations that your transaction requires before it gets credited to your account, most casinos only require one and I usually don't mind waiting for a few mins but still, the waiting time could go up to an hour or sometimes longer if you're not aware of the network. I've said this before but it'd be great if casinos would offer an alternative where they can credit your deposit instantly but only if you follow their required miner fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "October 14, 2022, 02:53:55 PM",
      "body": "This idea is like what futuur offer. They offer other kind of prediction that includes politics, events and entertainment. Your idea is already being used by other casino with working betting system. I hope that you can provide a better platform about this since betting on this kind of entertainment is really exciting.Payment delay is not an issue anymore because casino sportsbook usually settle the payout right after or after a few minutes of the match ends. Betting platform is already improved than what you known.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "October 14, 2022, 03:02:15 PM",
      "body": "Quote from: D ltr on October 14, 2022, 12:25:31 PMkyc is a frustrating thing at the moment, because it's actually very private, but if we don't do it we can't withdraw the proceeds from what is ours, I don't know what their purpose is for making kyc an obligation if you want to withdraw funds from the platformhope your plafrom doesn't require KYCI also feel it and don't want to do KYC just because we play gambling using crypto but whether we like it or not, we may be asked to verify at the casino, especially if we use big money.We as casual gamblers should also be that we are better off playing fair and not trying to get more profit and even though we may get it one day, it is just luck.Maybe it will be a different story if we can get big luck one day and are asked to do KYC, we might do it to get or withdraw the winning money.But hopefully, the site doesn't require KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 14, 2022, 03:43:31 PM",
      "body": "Quote from: Sam BYB on October 13, 2022, 11:26:24 PMMy question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. For me, delay in deposit or withdrawer of funds, poor customer service and a slow website is one thing i can not tolerate about a casino, because i have used different casinos and there is nothing that could be more frustrating than withdrawing fund and hoping it will arrive instantly and only to be disappointed as sometimes take hours or days before fully confirmed. So if you intend to create a casino, try to work more on the features i just mentioned above",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "October 14, 2022, 04:17:17 PM",
      "body": "Quote from: Sam BYB on October 13, 2022, 11:26:24 PMHey EveryoneI'm here representing the team at Bet Your Beans, founded by Matt Campbell and myself. We are developing a social betting platform that centers around p2p betting, gamification aspects such as leaderboards and profile customization, crypto movement bets and sports content. We aim to create a platform that merges online betting with social media in order to provide a fun community betting experience. Withdrawals will be instant, there is no house edge as the user creates their own betlines/odds, the betmaker owns the smart contract so the funds always remain in the possession of the bettors. My question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. If there is anything that bothers you about your current online betting experience please let us know so we can create the most accessible betting experience available.Regards,SamWelcome to our humble little forum, Sam. I hope your gambling platform does very well and gains the trust of our community by active engagement and good moral conduct. As far as my thoughts on your gambling platform go:The slogan \"bet your beans\" seems like an extremely dangerous betting experience (for a man). Are you sure thats the marketing approach you want to take with advertising gambling? I might be wrong, I would love to know the reason behind the slogan.As to the things I cannot stand in betting apps: Delays, bugs, and bad user experience design.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "October 14, 2022, 06:31:53 PM",
      "body": "KYC and delay in withdrawal and then support sucks. It's really hard to play on that kind of platform, specially if you win big and let's say you did in the right way and you are just lucky to win. And suddenly the site ask you for KYC and then the withdrawal process took days to the point that you feel that the site is trying not to give you your winnings, in short trying to scam you, that will be the worst experience ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "October 14, 2022, 06:47:50 PM",
      "body": "Kyc plays a huge role in many exchanges and the gambling website.I had my account in BitMart ,but they making more then 4 days to complete the Kyc process.Even after 4 days,no good response from them.Mostly the website popularity was based on the Support of the exchanges or website.The BitMart is worst one in my list now,likewise some betting platform made compulsory of kyc for the withdrawal of the funds.They won’t consider on kyc for the deposit of the funds from it.And make some play with out kyc.While come to withdraw,kyc will become a compulsory one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "October 14, 2022, 07:02:27 PM",
      "body": "Quote from: CryptoHeadlineNews on October 14, 2022, 03:43:31 PMQuote from: Sam BYB on October 13, 2022, 11:26:24 PMMy question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. For me, delay in deposit or withdrawer of funds, poor customer service and a slow website is one thing i can not tolerate about a casino, because i have used different casinos and there is nothing that could be more frustrating than withdrawing fund and hoping it will arrive instantly and only to be disappointed as sometimes take hours or days before fully confirmed. So if you intend to create a casino, try to work more on the features i just mentioned above  Probably, having to experience a delayed payout is the most frustrating part about some casinos nowadays. It’s the reality that a lot of gamblers have experienced especially when they fail to verify their identification for big payment rewards. Maybe this is one thing that should be given quick response from casino operators as no gambler would want to stay in casino if there are issues like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 14, 2022, 11:30:44 PM",
      "body": "Quote from: Sam BYB on October 13, 2022, 11:26:24 PMMy question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. If there is anything that bothers you about your current online betting experience please let us know so we can create the most accessible betting experience available.Regards,SamI have no problem with the layout and I even encourage casinos to make their layout very much different from all the other existing casinos, so players may not attach your new casino to existing casinos, and accuse you of copying other casinos, the payout is always a high priority, this is where you build your reputation, a good FAQ and a well explained terms of service is also very important, so many players made a mistake of misinterpreting the TOS hence the mistakes while playing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "October 15, 2022, 05:37:00 AM",
      "body": "Quote from: Sam BYB on October 13, 2022, 11:26:24 PMMy question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. If there is anything that bothers you about your current online betting experience please let us know so we can create the most accessible betting experience available.Just always keep in touch with the community. Being active here in the forum is a must. That messy layout and the related thing is already a basic problem and obviously, once you start the service, you should also have a good layout. If you can't even work on a good layout, how much more to the service?Payouts - of course as much as possible, should be processed as fast as they can. Doesn't need to be instant but if that's possible, then good.KYC - as long as the site is not heavily pressured by the regulators, try to maintain a no-KYC policy on the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "October 15, 2022, 06:20:48 AM",
      "body": "Quote from: Sam BYB on October 13, 2022, 11:26:24 PMMy question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. If there is anything that bothers you about your current online betting experience please let us know so we can create the most accessible betting experience available.Prioritized having good and active customer support to the point that issues, either minor or major, are resolved right away and won't take several days to address. Users don't want to be hung up and wait for several days waiting for their tickets to be responded to regardless of the volume the site is receiving every day. Aside from quick payouts, also the deposit amount should be reflected right away once it was fully confirmed on the blockchain.Enhanced also the security and ensure that funds are safe from those who will attempt to make such bad attacks on the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 15, 2022, 11:54:46 AM",
      "body": "Most important thing should be fast delivery and  avoiding of difficulty in KYC procession and how secure user information are to the system, from my understanding I have seen one major thing people are after is privacy and customer service is another thing affected by most gambling site. So being amongst the competitive gambling site those things needs to put in places, as well online live support to assist in any kind of minor issues and as well User Interface should be friendly and easily accessible looking good to human readable text.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "October 15, 2022, 12:00:41 PM",
      "body": "I'd be happy if the withdrawal process would be instant because we don't like waiting long to withdraw our money. And if you're asking about the frustrating aspect, maybe it's about account verification, as other members have said. Many of the casinos decide to ask the member for verification and ask for it when the member wants to withdraw big money.But maybe you can give us your site so we can see how it looks and maybe we can give you some useful advice. From there, I think you will get a lot of input to make your casino site develop better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheGreatPython",
      "created_time": "October 17, 2022, 02:24:50 PM",
      "body": "Quote from: IIrik11 on October 14, 2022, 03:49:25 AMfor me the most frustrating aspect of crypto betting nowadays is kyc.everywhere u go, all platforms wants to grab ur data before allowing u to withdraw anything.i miss sites like directbet.eu where u did not even had to make an account to bet.it was all on chain betting with instant payouts as soon as the outcome of a bet was achieved.I don't mind doing a KYC on an old reputable gambling site but what I only dislike is sometimes KYC verification takes time to complete. Maybe gambling site owners can't mandate it during the sign up process so that we players can continue playing the game while our KYC is being processed in the background.Even though KYC is becoming a thing and many casinos are now implementing it, there are still sites which doesn't require it and one of it is this site being offered to us by the op. You can always play on them. On chain gambling sites that you mentioned are not active anymore. They are overcome by the off chain betting. You better accept this fact and move on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "October 17, 2022, 03:21:04 PM",
      "body": "Quote from: TheGreatPython on October 17, 2022, 02:24:50 PMI don't mind doing a KYC on an old reputable gambling site but what I only dislike is sometimes KYC verification takes time to complete. Maybe gambling site owners can't mandate it during the sign up process so that we players can continue playing the game while our KYC is being processed in the background.Even though KYC is becoming a thing and many casinos are now implementing it, there are still sites which doesn't require it and one of it is this site being offered to us by the op. You can always play on them. On chain gambling sites that you mentioned are not active anymore. They are overcome by the off chain betting. You better accept this fact and move on. my problem is my data being sold and misused.even though these establishment say that that would never happen. but they do sell it and if it get in hands of bad actors it will get misused.that is why if u do happen to send these people ur ids and what not. make sure to add a big fat watermark on them, so they can't be misused.but tell u what, the companies won't allow it. try it and see for urself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "October 17, 2022, 06:07:19 PM",
      "body": "Quote from: CryptoHeadlineNews on October 14, 2022, 03:43:31 PMQuote from: Sam BYB on October 13, 2022, 11:26:24 PMMy question for you all is what are the most frustrating aspects of the online crypto betting applications you use? For me I can't stand a messy layout or massive delays on payouts. For me, delay in deposit or withdrawer of funds, poor customer service and a slow website is one thing i can not tolerate about a casino, because i have used different casinos and there is nothing that could be more frustrating than withdrawing fund and hoping it will arrive instantly and only to be disappointed as sometimes take hours or days before fully confirmed. So if you intend to create a casino, try to work more on the features i just mentioned above  For me, poor customer service and delayed payouts are the worst. You won’t be interested again to come back to that online casino if you have experienced that. Although I seldom find these in reputable casinos, but sometimes having delayed payouts is becoming inevitable particularly if you have sudden high winnings. KYC is not a problem to me, but sometimes even in minimal amount of withdrawals it takes time to be fully confirmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}