{
  "id": "topic_5407883",
  "title": "Note3",
  "author": "Note3",
  "created_time": "July 28, 2022, 07:03:49 AM",
  "content": "I know that merit is one of the rules for increasing rankings other than activities after reading this thread https://bitcointalk.org/index.php?topic=2818350.0But I have questions, are there criteria so that the awarding of merits varies?, I just know that the post should informed but I see the merit rewarded very varies.The question popped up in my mind after seeing this post https://bitcointalk.org/index.php?topic=5199911.msg60641343#msg60641343this users have earned 50 merits when he just created the account 2 day ago, I think he will good posters so can earn many merits fast, but he only got it from one member.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407883",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 28, 2022, 07:21:35 AM",
      "body": "Post good and earn merit with your quality posting tactics. You can send merit to any post and any user can send you merit, but it should be of quality, helpful or useful post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 28, 2022, 07:34:57 AM",
      "body": "Quote from: Note3 on July 28, 2022, 07:03:49 AMBut I have questions, are there criteria so that the awarding of merits varies?, I just know that the post should informed but I see the merit rewarded very varies.The general idea is to award merits to quality posts. But, the concept of quality is subjective and varies with different individuals, so to an extent the criteria varies.I could merit something I find witty, or informative, or merit for the effort put into the post. I could also merit a post I disagree with depending on the content.Quote from: Note3 on July 28, 2022, 07:03:49 AMThe question popped up in my mind after seeing this post <snip>this users have earned 50 merits when he just created the account 2 day ago, I think he will good posters so can earn many merits fast, but he only got it from one member.I can't ascertain the reason for the merit dump, and don't need to cause users award merits differently. I typically give smaller chunks of merit, maybe cause I'm not a source and I quickly run out of smerits, but if a user feels like giving larger numbers to a post they are impressed by, then that's fine, and has been done many times before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Note3",
      "created_time": "July 28, 2022, 07:44:03 AM",
      "body": "Ok thanks for the answer, my curiosity has been answered",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}