{
  "id": "topic_5450083",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "April 25, 2023, 07:55:41 AM",
  "content": "I have a short question to ask to ask. I have noticed that whenever it is the cutoff day for signature campaign payment, the manager will be - see a example below from BestChange Signature CampaignQuoteWe have paid for week 169: https://www.blockchain.com/explorer/transactions/btc/4aac592d92e031aa0702d09d89f6e5decb805edf0d933e6bb9f69d22e0ffd4cfSometimes, when I click to check, I see a lot of addresses. I have a vague idea that it is for processing the payment(correct me if I am wrong). The question I have is:  how are the payment transactions processed? What actually goes on there?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450083",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "April 25, 2023, 08:10:27 AM",
      "body": "You can send a transaction to many addresses at once and some people call it pay to many, but it is a standard feature in the Bitcoin protocol that has been present since day one.It's also possible for a transaction to have many funding addresses, and both several funding and receiving addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "April 25, 2023, 08:14:49 AM",
      "body": "Quote from: Davidvictorson on April 25, 2023, 07:55:41 AMI have a short question to ask to ask. I have noticed that whenever it is the cutoff day for signature campaign payment, the manager will be - see a example below from BestChange Signature CampaignQuoteWe have paid for week 169: https://www.blockchain.com/explorer/transactions/btc/4aac592d92e031aa0702d09d89f6e5decb805edf0d933e6bb9f69d22e0ffd4cfSometimes, when I click to check, I see a lot of addresses. I have a vague idea that it is for processing the payment(correct me if I am wrong). The question I have is:  how are the payment transactions processed? What actually goes on there?What a campaign manager is doing is called a bulk payment, that is, creating a transaction with many outputs. Many wallets offer such functionality, for example, it can be achieved with Electrum: https://electrum.readthedocs.io/en/latest/faq.html#can-i-do-bulk-payments-with-electrum-batchingWhen preparing a transaction, a campaign manager also specifies which UTXO to use as inputs in a transaction: it is called coin control. Again, Electrum is an example of a wallet that has this: https://coinguides.org/coin-control-spend-specific-utxo/A transaction can have many inputs and many outputs, and all these inputs and outputs may belong to different users. The most illustrative example of a complex transaction is the CoinJoin transaction: https://en.bitcoin.it/wiki/CoinJoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 25, 2023, 09:36:26 AM",
      "body": "Quote from: Davidvictorson on April 25, 2023, 07:55:41 AMSometimes, when I click to check, I see a lot of addresses. I have a vague idea that it is for processing the payment(correct me if I am wrong). The question I have is:  how are the payment transactions processed? What actually goes on there?Transaction inputs are used for the paymentTransaction outputs are the addresses which the inputs are sent to. The output can also consist of change address (the address that the remaining change (bitcoin not spent) goes to after paying all the addresses).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "April 25, 2023, 02:54:12 PM",
      "body": "I think he is talking about how the transaction processing or how it is processed.There is a simple way to explain this with an image and you should understand how Bitcoin transaction works from sending BTC to mempool then to the receiver.Source: https://medium.com/coinmonks/bitcoin-mempool-simply-explained-7f76be235e85",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 25, 2023, 07:34:01 PM",
      "body": "Quote from: Davidvictorson on April 25, 2023, 07:55:41 AMSometimes, when I click to check, I see a lot of addresses. I have a vague idea that it is for processing the payment(correct me if I am wrong). The question I have is:  how are the payment transactions processed? What actually goes on there?The link you clicked on contains the transaction ID, which as the name suggests is a way of identifying the transaction which was signed and broadcasted. The addresses you see labelled To are the outputs of the transaction and those tagged From are the inputs of the transaction. Other information contained include hash ID and number of confirmations.A transaction ID is generated for a transaction and is used to monitor the transaction as it is processed. This process involved nodes validating the transaction and adding it to their mempool, it gets picked by a miner from there and added to their candidate block. If their block gets confirmed the transaction gets 1 confirmation. As more blocks are confirmed the transaction goes deeper into the blockchain and the number of confirmations increase. The transaction you linked has almost 2,000 transactions.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "April 25, 2023, 10:55:59 PM",
      "body": "Quote from: Davidvictorson on April 25, 2023, 07:55:41 AMSometimes, when I click to check, I see a lot of addresses. I have a vague idea that it is for processing the payment(correct me if I am wrong). The question I have is:  how are the payment transactions processed? What actually goes on there?If you look at the link you dropped to the multiple transaction, you will understand that everything is self explanatory.Let review it with pictures...The above picture shows these important information. The transaction ID,The total amount that was transacted,The transaction fee,From whom and to whom. (It does not necessarily need to be from one address to another address. It can be from one address to many, from many addresses to many, in the case of the above example)The status of the transaction and the block information. This second image shows in full the number of wallets involved and to how many it sent the transactions to and including change address for balance brought back. It is here you will also see how much was spent from each wallet and how much sent to each wallet.That is the beauty of the blockchain and the information is there forever and open for you to see but cannot be mutilated. Incase you may be confused about the type of address seen there which uses names in it, it is called a vanity address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "April 27, 2023, 04:19:17 AM",
      "body": "I get it now. Thank you all for your responses. It is good to read each and everyone of the responses with users trying to break it down and explain it to me from different points of view for easier understanding. I have come out with a fair knowledge of the process that takes place during a bitcoin transaction. Thank you all so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}