{
  "id": "topic_5408234",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "July 31, 2022, 05:45:20 PM",
  "content": "Alik Bahshi  Empire of Lies and its chief liar \"You are guilty by   I want to eat \"                             Krylov         These words Krylov surprisingly accurately reflect the predatory nature of the Russian Empire, as evidenced by today's Kremlin created a dangerous situation around Ukraine. Needless to say, finding freedom Ukrainian people, the most ethnically closest of all the many peoples of the empire, a painful blow to the ego constituent people (1) with its imperial worldview. The loss of Ukraine and Crimea as a result of the collapse of the Soviet Union affected the geostrategic situation in South-Western part of the Russian Empire. However, all this does not give any right to the Kremlin on the military intervention in Ukraine and the annexation of the Crimea, which, incidentally, never was the ancestral territory of Russia, as well as all the Black Sea coast, and the numerically dominant Russian population of Crimea is a consequence of the genocide of the indigenous Russian Tatar people and its settlement by Russian. Referring to the recent past, an identical situation has led to the Second World War, when Britain and France, following obligations, declared war on Germany for invading German forces in Poland. Strictly speaking, for the aggression of Russia, would be to follow the declaration of war by the United States and Great Britain, which in accordance with the Budapest Memorandum, are the guarantors of the security and integrity of Ukraine. However, this did not happen, or their extremely puzzled Whacker President Putin is not the involvement of Russian troops to war events in Ukraine, or, again, a blatant lie documented international scale - in fact and Russia signed in the same be the guarantor of the Budapest Memorandum Safety Ukraine. It is understood between the nuclear powers, when every second counts, no declaration of war should not be expected, but I must say that the West received such unexpected monstrous impudence of Moscow, bordering on some dense savagery, was rather reserved.        It would seem that the time of Hitler's fascism passed away, but no, the aggressive actions of Putin's Russia returned to Western politicians, scratched their necks, to reality. Krylov's fable \"The Wolf and the lamb,\" they certainly do not read it, but I hope to know that the wolf cry for justice case hopeless. Maybe they finally realize that \"friend Vladimir Putin,\" loudly announced his regret the collapse of the USSR and compare what happened with the catastrophe of universal scale, intended to recreate the Soviet Union, and not much different from Hitler, started to build a \"great Reich.\" I want to note the intentions of Putin to Hitler even have an advantage, because unlike Hitler Putin relies on the presence of the people and the imperial world chauvinism (2). Putin is no need to build a party, create an ideology, it is enough to throw the cry \"wet Chechnya\" or \"give the Crimea,\" and he provided support and a full understanding of the Russian people. It's amazing how a national consensus was accepted and supported Putin lies about non-participation of Russian troops, the so-called \"green people\", unmarked, with the annexation of the Crimea. This is the case when the words Fazil Iskander \"universal stink taken for consensus among the people.\"         It is necessary to note the unique feature of the Russian people, namely, its acceptability to lie. In the minds of Russian, without causing any damage to perfectly get the truth and a lie. Once when he was a student in the Soviet Union of Swedish, trained at the Moscow State University, told about his importance, as she presented the opening - \"in your country all say one thing and think another.\" It is usual for the state of our consciousness ambiguity caused her bewilderment. She grew up in a free society, I could not understand how this could happen, that all have one opinion on any issue. What we are accustomed to everyone's lies seemed self-evident, it seemed unnatural, and can be gregarious and savagery, as it certainly is silent. This explains the ease with which lies the Russian president meets the imperial world view of the people, without hesitation immediately accepted the consciousness of every Russian, regardless of whether the country in which he resides. The latter says that even changed circumstances can not change the world imperial Russian.         Maybe I'm wrong, but in my opinion the Russian society, accustomed during the existence of the Soviet Union to lie, plus pathological inability of the Russian people to live in a democracy (3), in conjunction with its imperial ideology itself is a kind of incarnation of the evil bearing danger World. And it is not in Putin, Putin is just the best conductor, organizer splash of Evil. Thus, by conventional, well-known definition of Russia as the \"Evil Empire\" is equally possible to add \"Empire of Lies,\" for \"false\" and \"evil\" is the concept of concomitant and do not exist one without the other. So Russia's aggression against Ukraine sopustvovalas an injection of massive Russian media incredible amount of misinformation and outright lies from the Kremlin and President Putin - the main thing I would say is unsurpassed today liar Russia. No sense to give a long track record of lies of the Russian president, for his every word through the lies. Probably after Putin has managed to Ukraine, it is difficult to find a diplomat who would take the responsibility to negotiate with Putin. No wonder friends with Putin whole world in the face of mob Belarusian Batko Lukoshenko, murderous Syrian dictator Assad, the former Prime Minister of Iran Ahmadinidzhata and has left the world of Hugo Chavez.           The Empire of Lies is one of today's strategic ally - Armenia, with the support of Moscow to annex 20% of the territory of Azerbaijan and Moscow waiting for go-ahead for the resumption of aggression, with undisguised aim of creating a \"Greater Armenia\" from sea to sea in sootetstvii a historical lie, which does not have place either Azerbaijan or its people (4). No Turkey or Georgia. Entirely Armenia with numerous Armenian enclaves in the North Caucasus, the Kuban, Crimea, Ukraine, Syria, Libya, and perhaps now in California, which can make in the future of \"Great Armenia\".     In its territorial claims in the South-East of Ukraine and Crimea, where there is a Russian diaspora - a consequence of the violent eviction of the indigenous people and the population of the Great Russians, Putin unwittingly copies of Armenian Party ideology of the Nazis \"ARF\", created in 1890, that is, long before Hitler's ideology of the superiority of the German nation. All the Nazi ideology, which can be heard national superiority and \"greatness\", generate primarily historical lie that the \"Greater Germany\", that the \"Great Armenia\", which serves as the basis for territorial claims and as a result of military aggression. A very accurate picture of the national \"superiority\" of the Armenians presented Vasily Grossman (\"Banner\", n.11, 1988):     \"From the wily easily loses its noble people nationalism basis, it does not become a formidable, he becomes a pathetic, not cause and humiliates. So trying to prove some kind of disability, a person discovers his own. Some of my buddies who are in all areas of human creativity especially singled out the Armenian national prioretet in architecture, science and poetry. They emphasized the superiority of the architectural merits of the temple of Garni over their seemingly primitive architecture of the Acropolis: speaking about the poet Tumanyan tried to convince me that the genius of Pushkin's genius Tumanyan above. The essence of the course is not that there are not perfect architecture Garni over architecture of the Acropolis, a genius if Tumanyan than Pushkin, the essence, and the essence of course sad that poetry, and architecture, and science, and history itself, by essentially talking to some of my buddies are no longer mean. They mean only to discover the superiority of the Armenian national character of the national character of other nations. Poetry is not important, but it is important only to prove that the Armenian national poet above say, Russian or French poet. My interlocutors, without noticing, impoverished their souls and hearts that ceased to enjoy poetry, perfection architectural greatness of science, and have seen in poetry and science is only a means to assert their national superiority. This desire can be so fanatical, narrow that minute seems a manifestation of madness. \"        A look at the national supremacy generates Nazism and Lies, and finally lead to evil. Thus, the ideology of Dashnak party contained a paragraph in which terror was presented a method to achieve the creation of \"Great Armenia\". Following this software item, Armenian Nazis subjected the civilian population of Turkey and Azerbaijan cruel terror, literally clearing the land for the \"Great Armenia\", which brought disaster neischeslimye peoples of Turkey and Azerbaijan, and most Armenian people. Go to global catastrophe and led the Nazi ideology of the German fascists, from which primarily affected the German people themselves.         Today, Putin opened the floodgates of Great Russian chauvinism, increasingly heard essentially fascist rhetoric of \"The Great Russian people\", \"The Great Russian Language\", where the word \"great\" is meant not so much the number, but how much quality. Interestingly, in the Russian sources of all the nations of the world only the Russian people is determined by the \"great\", even to the Chinese people, not given to be. As a Great this approach will allow it to Ukraine speak Ukrainian! Yes, how dare Ukrainians neglected by the great Russian language, without making it public! Remember what a smile and neglect in Russian living, such as Baku, Azerbaijani caused bad knowing Russian or accent speaking in Russian, and this despite the fact that they themselves did not even bother to Great-study of indigenous languages. They did not keep in mind how much was tactless in their mockery. Only an underlying feeling of inferiority and lack of culture leads to self-aggrandizement. By the way, if you really honest approach to the issue of the richness of language, the Russian language borrowed many Turkic words, while, for example, in the Azerbaijani language is not a word of Russian origin, and this in spite of the ongoing policy of Russification Moscow. It is appropriate to note that the Russian forced by deprived people of Azerbaijan alphabet, suddenly making him illiterate typing Cyrillic. Imagine that Russia suddenly transferred to the Chinese alphabet. I'd like to see the Russian reading Pushkin in Chinese characters.      Supporting chauvinistic frenzy Russian separatists in Ukraine, Putin throws another historical lie that Ukraine as a state did not exist. This raze, as should be taken to the agreement on the reunification of Ukraine with Russia, signed by Bohdan Khmelnytsky? If it was not Ukraine, as Putin claims, then which country the contract? It seems that one Bohdan Khmelnytsky without the Ukrainian people and became a Russian citizen in a single, so to speak-off. Thus, President Putin in his historical tours at all deny the Ukrainian people's right to their own country, arguing that most actions of the Russian separatists in the Ukraine.      Generally, with the separatists Putin, culturally speaking, \"full Albats\" (5). Thus, the Chechens who fought with the Russian for the freedom of their motherland as one bandits, robbers, in a word - the separatists, worthy to Putin urinating in the toilet. In this case, as called Russian, who had settled in the Ukraine, and who now want to tear away a part of Ukraine, where they live, and attach it to Russia? Or is there a bad separatists and secessionists have good, which should help, secretly transferring to Ukraine Russian fascists, equipped with the latest weaponry, until the anti-aircraft and tanks. In short, returning to the same fable: \"A strong always powerless to blame: Stories in fact we hear examples of darkness, \"       Passing the Russian nuclear weapons, Ukraine was defenseless against the Evil Empire. One might wonder, would have dared to attack Putin in Ukraine, whether she has missiles with nuclear warheads? Of course not. Evil Empire, promising to be the guarantor of the integrity and independence of Ukraine, in fact, lied to both Ukraine and America to the UK, which gives the right to call Russia and \"Empire of Lies.\" Therefore, all countries, especially the former colonies of the Russian Empire, it is necessary to be careful about the contracts, alliance commitments and other agreements with Moscow, dooming themselves to become a victim of fraud. Hence it is understandable fears peaceful neutral to Finland today, and suddenly arose a desire to join NATO.        Without a doubt, you can assume that if it were not for NATO, Putin, Hitler did not hesitate revived Russian Empire in its former borders, including Poland and Finland. 1 \"constituent peoples and its Fuhrer, or - Ukraine and the list goes on», http://alikbahshi.livejournal.com/21749.html  2 \"Great Russian chauvinism, and Putin his Fuhrer», http://samlib.ru/b/bahshi_a/alikbahshi-38.shtml3 \"People's fate, or each candle to his last», http://alikbahshi.livejournal.com/4732.html  4 \"Armenia and Moscow-Tehran axis», http://www.proza.ru/2008/03/22/521  5 \"The word fornication or full Albats\"   http://forum.bakililar.az/index.php?app=blog&module=display&section=blog&blogid=213&showentry=1184",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408234",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "July 31, 2022, 07:29:45 PM",
      "body": "When I clicked on this thread I was expecting something completely different.  I thought for sure this had to be about the white house saying we are not in recession in spite of every economist in the world without Trump Derangement Syndrome agreeing that the definition of a recession is 2 consecutive quarters with negative GDP growth.  I digress though.  I guess the common theme is that you cannot trust governments to be honest nowadays.  Everyone has their own agenda and is willing to say or do whatever to accomplish it in the realm of politics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 31, 2022, 08:16:50 PM",
      "body": "One of the major reasons that Alik Bahshi is so against Putin is this. Putin made the classified archives about Tartaria public.For whatever reason, secretive 'elongated skull' people who rule the world, don't want the history of the earth brought out into the open. So all this talk against Putin is simply a way to discredit him, and maybe destroy the ancient archives of Tartaria found in Russia.You can find more about this in a simple search like, \"Putin, the Tartarian Archives\" - https://duckduckgo.com/?q=Putin%2C+the+Tartarian+Archives&t=ffab&ia=web.If you search for it, you can find all kinds of Net opinions about Tartaria. And they join together in ways that show Tartaria once influenced the whole earth.I don't entirely believe Graham Hancock's info about all this. I don't believe that the methods to determine past ages are accurate. But there is a whole bunch of stuff that he has put together that shows that our understanding of history is false.My guess is that Alik Bahshi has either been covertly (covert, from/by his teachers) trained, or is actually being paid to help squelch any popularity that Putin has... just to divert away from people actually finding out the truth about history... and the truth about the individual power that each of us has... search on \"Wim Hof\" - https://duckduckgo.com/?t=ffab&q=Wim+Hof&ia=web.The point is that we have all been deluded about what is really going on in the world. And it might be good for us that we have, although I don't quite see how. Perhaps we need to not look at some of this history if we want to be believers in God and be saved from death into the new universe He is making.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 31, 2022, 08:42:59 PM",
      "body": "Quote from: BADecker on July 31, 2022, 08:16:50 PMOne of the major reasons that Alik Bahshi is so against Putin is this. Putin made the classified archives about Tartaria public.For whatever reason, secretive 'elongated skull' people who rule the world, don't want the history of the earth brought out into the open. So all this talk against Putin is simply a way to discredit him, and maybe destroy the ancient archives of Tartaria found in Russia.You can find more about this in a simple search like, \"Putin, the Tartarian Archives\" - https://duckduckgo.com/?q=Putin%2C+the+Tartarian+Archives&t=ffab&ia=web.If you search for it, you can find all kinds of Net opinions about Tartaria. And they join together in ways that show Tartaria once influenced the whole earth.I don't entirely believe Graham Hancock's info about all this. I don't believe that the methods to determine past ages are accurate. But there is a whole bunch of stuff that he has put together that shows that our understanding of history is false.My guess is that Alik Bahshi has either been covertly (covert, from/by his teachers) trained, or is actually being paid to help squelch any popularity that Putin has... just to divert away from people actually finding out the truth about history... and the truth about the individual power that each of us has... search on \"Wim Hof\" - https://duckduckgo.com/?t=ffab&q=Wim+Hof&ia=web.The point is that we have all been deluded about what is really going on in the world. And it might be good for us that we have, although I don't quite see how. Perhaps we need to not look at some of this history if we want to be believers in God and be saved from death into the new universe He is making.  What makes you think that I am trying to suppress Putin's popularity as a known liar, murderer and insidious poisoner? On the contrary, I applaud its wide popularity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 31, 2022, 09:36:38 PM",
      "body": "Quote from: Alik Bahshi on July 31, 2022, 08:42:59 PMQuote from: BADecker on July 31, 2022, 08:16:50 PMOne of the major reasons that Alik Bahshi is so against Putin is this. Putin made the classified archives about Tartaria public.For whatever reason, secretive 'elongated skull' people who rule the world, don't want the history of the earth brought out into the open. So all this talk against Putin is simply a way to discredit him, and maybe destroy the ancient archives of Tartaria found in Russia.You can find more about this in a simple search like, \"Putin, the Tartarian Archives\" - https://duckduckgo.com/?q=Putin%2C+the+Tartarian+Archives&t=ffab&ia=web.If you search for it, you can find all kinds of Net opinions about Tartaria. And they join together in ways that show Tartaria once influenced the whole earth.I don't entirely believe Graham Hancock's info about all this. I don't believe that the methods to determine past ages are accurate. But there is a whole bunch of stuff that he has put together that shows that our understanding of history is false.My guess is that Alik Bahshi has either been covertly (covert, from/by his teachers) trained, or is actually being paid to help squelch any popularity that Putin has... just to divert away from people actually finding out the truth about history... and the truth about the individual power that each of us has... search on \"Wim Hof\" - https://duckduckgo.com/?t=ffab&q=Wim+Hof&ia=web.The point is that we have all been deluded about what is really going on in the world. And it might be good for us that we have, although I don't quite see how. Perhaps we need to not look at some of this history if we want to be believers in God and be saved from death into the new universe He is making.  What makes you think that I am trying to suppress Putin's popularity as a known liar, murderer and insidious poisoner? On the contrary, I applaud its wide popularity.What makes you think that I think what you said I think? You seem to have a poor ability to understand much of anything that you read.Putin is simply bringing world history out into the open. This is history that the US and Western Europe have been hiding from their people for as much as hundreds of years. It's about Tartaria and the rulers of the world in Sumerian times.But you, by calling Putin a liar, are showing that you want to hide world history from people, just like those who are in control of America and much of the world.Look into the elongated skulls found in Peru and Crimea... and probably lots of other places in the world. These aliens are different than humans. They are still here, and are hiding and pulling strings from the hidden background.Putin is a breath of fresh air, bringing this all out into the open again. But you try to smear his good name because you are working for the aliens that are try to run the world by taking it over from people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "August 01, 2022, 07:00:49 AM",
      "body": "Quote from: BADecker on July 31, 2022, 09:36:38 PMQuote from: Alik Bahshi on July 31, 2022, 08:42:59 PMQuote from: BADecker on July 31, 2022, 08:16:50 PMOne of the major reasons that Alik Bahshi is so against Putin is this. Putin made the classified archives about Tartaria public.For whatever reason, secretive 'elongated skull' people who rule the world, don't want the history of the earth brought out into the open. So all this talk against Putin is simply a way to discredit him, and maybe destroy the ancient archives of Tartaria found in Russia.You can find more about this in a simple search like, \"Putin, the Tartarian Archives\" - https://duckduckgo.com/?q=Putin%2C+the+Tartarian+Archives&t=ffab&ia=web.If you search for it, you can find all kinds of Net opinions about Tartaria. And they join together in ways that show Tartaria once influenced the whole earth.I don't entirely believe Graham Hancock's info about all this. I don't believe that the methods to determine past ages are accurate. But there is a whole bunch of stuff that he has put together that shows that our understanding of history is false.My guess is that Alik Bahshi has either been covertly (covert, from/by his teachers) trained, or is actually being paid to help squelch any popularity that Putin has... just to divert away from people actually finding out the truth about history... and the truth about the individual power that each of us has... search on \"Wim Hof\" - https://duckduckgo.com/?t=ffab&q=Wim+Hof&ia=web.The point is that we have all been deluded about what is really going on in the world. And it might be good for us that we have, although I don't quite see how. Perhaps we need to not look at some of this history if we want to be believers in God and be saved from death into the new universe He is making.  What makes you think that I am trying to suppress Putin's popularity as a known liar, murderer and insidious poisoner? On the contrary, I applaud its wide popularity.What makes you think that I think what you said I think? You seem to have a poor ability to understand much of anything that you read.Putin is simply bringing world history out into the open. This is history that the US and Western Europe have been hiding from their people for as much as hundreds of years. It's about Tartaria and the rulers of the world in Sumerian times.But you, by calling Putin a liar, are showing that you want to hide world history from people, just like those who are in control of America and much of the world.Look into the elongated skulls found in Peru and Crimea... and probably lots of other places in the world. These aliens are different than humans. They are still here, and are hiding and pulling strings from the hidden background.Putin is a breath of fresh air, bringing this all out into the open again. But you try to smear his good name because you are working for the aliens that are try to run the world by taking it over from people.  Looks like I shouldn't waste time arguing with you if you've gone over to the aliens. Dear, here is a topic about Russia as the Empire of Lies and its liar dictator. In my topic, we are talking about the real Evil that Russia and Putin represent, and not about fantastic aliens. Find the fantasy section and talk about aliens there. Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 01, 2022, 01:59:58 PM",
      "body": "Quote from: Alik Bahshi on August 01, 2022, 07:00:49 AMQuote from: BADecker on July 31, 2022, 09:36:38 PMQuote from: Alik Bahshi on July 31, 2022, 08:42:59 PMQuote from: BADecker on July 31, 2022, 08:16:50 PMOne of the major reasons that Alik Bahshi is so against Putin is this. Putin made the classified archives about Tartaria public.For whatever reason, secretive 'elongated skull' people who rule the world, don't want the history of the earth brought out into the open. So all this talk against Putin is simply a way to discredit him, and maybe destroy the ancient archives of Tartaria found in Russia.You can find more about this in a simple search like, \"Putin, the Tartarian Archives\" - https://duckduckgo.com/?q=Putin%2C+the+Tartarian+Archives&t=ffab&ia=web.If you search for it, you can find all kinds of Net opinions about Tartaria. And they join together in ways that show Tartaria once influenced the whole earth.I don't entirely believe Graham Hancock's info about all this. I don't believe that the methods to determine past ages are accurate. But there is a whole bunch of stuff that he has put together that shows that our understanding of history is false.My guess is that Alik Bahshi has either been covertly (covert, from/by his teachers) trained, or is actually being paid to help squelch any popularity that Putin has... just to divert away from people actually finding out the truth about history... and the truth about the individual power that each of us has... search on \"Wim Hof\" - https://duckduckgo.com/?t=ffab&q=Wim+Hof&ia=web.The point is that we have all been deluded about what is really going on in the world. And it might be good for us that we have, although I don't quite see how. Perhaps we need to not look at some of this history if we want to be believers in God and be saved from death into the new universe He is making.  What makes you think that I am trying to suppress Putin's popularity as a known liar, murderer and insidious poisoner? On the contrary, I applaud its wide popularity.What makes you think that I think what you said I think? You seem to have a poor ability to understand much of anything that you read.Putin is simply bringing world history out into the open. This is history that the US and Western Europe have been hiding from their people for as much as hundreds of years. It's about Tartaria and the rulers of the world in Sumerian times.But you, by calling Putin a liar, are showing that you want to hide world history from people, just like those who are in control of America and much of the world.Look into the elongated skulls found in Peru and Crimea... and probably lots of other places in the world. These aliens are different than humans. They are still here, and are hiding and pulling strings from the hidden background.Putin is a breath of fresh air, bringing this all out into the open again. But you try to smear his good name because you are working for the aliens that are try to run the world by taking it over from people.  Looks like I shouldn't waste time arguing with you if you've gone over to the aliens. Dear, here is a topic about Russia as the Empire of Lies and its liar dictator. In my topic, we are talking about the real Evil that Russia and Putin represent, and not about fantastic aliens. Find the fantasy section and talk about aliens there. Good luck!Yep! You shouldn't waste your time. Now you are trying to deny the fact that Putin is opening up the history of Tartaria, and what really went on in the world in ages past. It was in the news. Google \"Putin Tartaria.\" And when you dig into it in depth, you will find connected to it, skulls of people in Peru and Crimea that have a brain capacity half again larger than that of people. Other things, including DNA sampling, show that they weren't entirely human.What's the matter? Are you scared that history the way we know it is a big lie? Is this what is driving you to be so against Putin?Now, don't pee your pants in a rage just because I am showing you a few things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "August 02, 2022, 08:26:16 AM",
      "body": "Quote from: BADecker on August 01, 2022, 01:59:58 PMQuote from: Alik Bahshi on August 01, 2022, 07:00:49 AMQuote from: BADecker on July 31, 2022, 09:36:38 PMQuote from: Alik Bahshi on July 31, 2022, 08:42:59 PMQuote from: BADecker on July 31, 2022, 08:16:50 PMOne of the major reasons that Alik Bahshi is so against Putin is this. Putin made the classified archives about Tartaria public.For whatever reason, secretive 'elongated skull' people who rule the world, don't want the history of the earth brought out into the open. So all this talk against Putin is simply a way to discredit him, and maybe destroy the ancient archives of Tartaria found in Russia.You can find more about this in a simple search like, \"Putin, the Tartarian Archives\" - https://duckduckgo.com/?q=Putin%2C+the+Tartarian+Archives&t=ffab&ia=web.If you search for it, you can find all kinds of Net opinions about Tartaria. And they join together in ways that show Tartaria once influenced the whole earth.I don't entirely believe Graham Hancock's info about all this. I don't believe that the methods to determine past ages are accurate. But there is a whole bunch of stuff that he has put together that shows that our understanding of history is false.My guess is that Alik Bahshi has either been covertly (covert, from/by his teachers) trained, or is actually being paid to help squelch any popularity that Putin has... just to divert away from people actually finding out the truth about history... and the truth about the individual power that each of us has... search on \"Wim Hof\" - https://duckduckgo.com/?t=ffab&q=Wim+Hof&ia=web.The point is that we have all been deluded about what is really going on in the world. And it might be good for us that we have, although I don't quite see how. Perhaps we need to not look at some of this history if we want to be believers in God and be saved from death into the new universe He is making.  What makes you think that I am trying to suppress Putin's popularity as a known liar, murderer and insidious poisoner? On the contrary, I applaud its wide popularity.What makes you think that I think what you said I think? You seem to have a poor ability to understand much of anything that you read.Putin is simply bringing world history out into the open. This is history that the US and Western Europe have been hiding from their people for as much as hundreds of years. It's about Tartaria and the rulers of the world in Sumerian times.But you, by calling Putin a liar, are showing that you want to hide world history from people, just like those who are in control of America and much of the world.Look into the elongated skulls found in Peru and Crimea... and probably lots of other places in the world. These aliens are different than humans. They are still here, and are hiding and pulling strings from the hidden background.Putin is a breath of fresh air, bringing this all out into the open again. But you try to smear his good name because you are working for the aliens that are try to run the world by taking it over from people.Yep! You shouldn't waste your time. Now you are trying to deny the fact that Putin is opening up the history of Tartaria, and what really went on in the world in ages past. It was in the news. Google \"Putin Tartaria.\" And when you dig into it in depth, you will find connected to it, skulls of people in Peru and Crimea that have a brain capacity half again larger than that of people. Other things, including DNA sampling, show that they weren't entirely human.What's the matter? Are you scared that history the way we know it is a big lie? Is this what is driving you to be so against Putin?Now, don't pee your pants in a rage just because I am showing you a few things. Please, show me yours  a few things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 03, 2022, 12:07:04 AM",
      "body": "All politicians are lies and master deceivers. Recently a friend told me that politics is not a dirty game and I told him he was lying. These politicians lie about the economy, international relation, social interactions, infact they lie about almost everything. For me there is no perfect reason for war or conflict that would result to the loss of lives and properties. Life is priceless and we have seen thousands of people loss their lives in Ukraine and it is not a topic what lying or politicking about. The world need peace and peace cannot be attained by wars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "August 03, 2022, 02:35:41 AM",
      "body": "Quote from: Zlantann on August 03, 2022, 12:07:04 AMAll politicians are lies and master deceivers. Recently a friend told me that politics is not a dirty game and I told him he was lying. These politicians lie about the economy, international relation, social interactions, infact they lie about almost everything. For me there is no perfect reason for war or conflict that would result to the loss of lives and properties. Life is priceless and we have seen thousands of people loss their lives in Ukraine and it is not a topic what lying or politicking about. The world need peace and peace cannot be attained by wars.       And how could peace be achieved in the Second World War that Germany unleashed?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 03, 2022, 02:59:31 PM",
      "body": "Quote from: Alik Bahshi on August 02, 2022, 08:26:16 AM... Please, show me yours  a few things.Just to show you that I am not a disagreeable kind of guy...https://bitcointalk.org/index.php?action=profile;u=149737;sa=showPosts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "August 04, 2022, 02:56:12 PM",
      "body": "Quote from: BADecker on August 03, 2022, 02:59:31 PMQuote from: Alik Bahshi on August 02, 2022, 08:26:16 AM... Please, show me yours  a few things.Just to show you that I am not a disagreeable kind of guy...https://bitcointalk.org/index.php?action=profile;u=149737;sa=showPostsSo, referring to a few of your things is meaningless. Here is the topic of Empire of Lies and its chief liar, as I understand it, you have nothing to say on the topic, so excuse me, but I see no reason for myself to have a useless dispute with you. But you continue to actively participate in my topics, which makes me very happy. Thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "August 10, 2022, 06:28:13 PM",
      "body": "Quote from: Alik Bahshi on July 31, 2022, 05:45:20 PMAlik Bahshi  Empire of Lies and its chief liar ....Very well conveyed essence! Thank you !And do not forget that a lie, moreover, stupid and primitive, and even bloody, is part of the genetic heritage of Muscovy, the ulus of the Golden Horde, and until the beginning of the 18th century, it was!Lies permeate the whole history, all the deeds, all the \"achievements\" of Muscovy / RSFSR / USSR / Russia! At the heart of everything lies! Lies or someone else's stolen! Lies about victories and losses, lies about achievements, lies about greatness and status, lies about everything. And if you talk to a classic resident of Muscovy, at some point you are guaranteed to come across such an interesting nuance: a couple of minutes ago, a Muscovite will say, for example, that a certain \"fact A\" takes place in history. But when this answer in the course of the dialogue leads to an unpleasant conclusion for the Muscovite, he will say - \"I never said that \"Fact A\" took place.\" You will be surprised and say \"So you just said that 5 sentences/minutes ago\". The answer will surprise you even more, the Muscovite will answer \"I didn't say that, you said that!\". An attempt to bring the dialogue to a logical continuation, and the restoration of the truth (for example, there will be a witness or even a dictaphone recording), will end with the fact that the Muscovite will definitely say “you are clearly a fascist and gay. We don’t have enough of you in 1945! We will fuck you all, and you personally!\", after which he will leave in the pose of a \"winner\" Maybe not in 100% of cases it will be exactly like that, but about homosexuality and the desire to commit a homosexual act towards you - in 95% of cases there will be a dialogue on topics that do not coincide with Muscovite propaganda",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "August 11, 2022, 07:36:06 AM",
      "body": "Quote from: DrBeer on August 10, 2022, 06:28:13 PMQuote from: Alik Bahshi on July 31, 2022, 05:45:20 PMAlik Bahshi  Empire of Lies and its chief liar ....Very well conveyed essence! Thank you !And do not forget that a lie, moreover, stupid and primitive, and even bloody, is part of the genetic heritage of Muscovy, the ulus of the Golden Horde, and until the beginning of the 18th century, it was!Lies permeate the whole history, all the deeds, all the \"achievements\" of Muscovy / RSFSR / USSR / Russia! At the heart of everything lies! Lies or someone else's stolen! Lies about victories and losses, lies about achievements, lies about greatness and status, lies about everything. And if you talk to a classic resident of Muscovy, at some point you are guaranteed to come across such an interesting nuance: a couple of minutes ago, a Muscovite will say, for example, that a certain \"fact A\" takes place in history. But when this answer in the course of the dialogue leads to an unpleasant conclusion for the Muscovite, he will say - \"I never said that \"Fact A\" took place.\" You will be surprised and say \"So you just said that 5 sentences/minutes ago\". The answer will surprise you even more, the Muscovite will answer \"I didn't say that, you said that!\". An attempt to bring the dialogue to a logical continuation, and the restoration of the truth (for example, there will be a witness or even a dictaphone recording), will end with the fact that the Muscovite will definitely say “you are clearly a fascist and gay. We don’t have enough of you in 1945! We will fuck you all, and you personally!\", after which he will leave in the pose of a \"winner\" Maybe not in 100% of cases it will be exactly like that, but about homosexuality and the desire to commit a homosexual act towards you - in 95% of cases there will be a dialogue on topics that do not coincide with Muscovite propaganda You perfectly displayed the thinking of the Russian. The complete lack of logic and common sense is their characteristic feature. The whole life of the Russian is accompanied by Lies, and they do not know another life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 14, 2022, 09:16:11 AM",
      "body": "The vote at the UN showed the attitude of the world community towards the false Russia and the false Putin. Lies coming from the Kremlin causes only a smirk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 14, 2022, 02:49:24 PM",
      "body": "Quote from: Alik Bahshi on October 14, 2022, 09:16:11 AMThe vote at the UN showed the attitude of the world community towards the false Russia and the false Putin. Lies coming from the Kremlin causes only a smirk.If Russia and Putin were false, they would be in agreement with the UN, and wouldn't even have defended Russia and Russian people in the first place. The fact that they are defending themselves and their people, shows that they are true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 14, 2022, 05:13:18 PM",
      "body": "Quote from: BADecker on October 14, 2022, 02:49:24 PMQuote from: Alik Bahshi on October 14, 2022, 09:16:11 AMThe vote at the UN showed the attitude of the world community towards the false Russia and the false Putin. Lies coming from the Kremlin causes only a smirk.If Russia and Putin were false, they would be in agreement with the UN, and wouldn't even have defended Russia and Russian people in the first place. The fact that they are defending themselves and their people, shows that they are true.Yes, Putin has put the Russian people and the country in such conditions that now they have to defend themselves. So Hitler had to defend Germany, suffering defeat at the front. However, he failed to do so. So Putin and his Russia will be defeated. The aggressor must be punished.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 14, 2022, 06:20:35 PM",
      "body": "Quote from: Alik Bahshi on October 14, 2022, 05:13:18 PMQuote from: BADecker on October 14, 2022, 02:49:24 PMQuote from: Alik Bahshi on October 14, 2022, 09:16:11 AMThe vote at the UN showed the attitude of the world community towards the false Russia and the false Putin. Lies coming from the Kremlin causes only a smirk.If Russia and Putin were false, they would be in agreement with the UN, and wouldn't even have defended Russia and Russian people in the first place. The fact that they are defending themselves and their people, shows that they are true.Yes, Putin has put the Russian people and the country in such conditions that now they have to defend themselves. So Hitler had to defend Germany, suffering defeat at the front. However, he failed to do so. So Putin and his Russia will be defeated. The aggressor must be punished.But it was Russia that defeated most of Germany in WW2. It's a much stronger Russia that the US and puppet Ukraine are going up against today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 14, 2022, 06:49:43 PM",
      "body": "Quote from: BADecker on October 14, 2022, 06:20:35 PMBut it was Russia that defeated most of Germany in WW2. It's a much stronger Russia that the US and puppet Ukraine are going up against today.Dear, you are again trying to get away from the topic. Here is the topic of the liar Putin. Please stay on topic. I have topics on the issue you are interested in, and participate there. Thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 14, 2022, 06:52:28 PM",
      "body": "Quote from: Alik Bahshi on October 14, 2022, 06:49:43 PMQuote from: BADecker on October 14, 2022, 06:20:35 PMBut it was Russia that defeated most of Germany in WW2. It's a much stronger Russia that the US and puppet Ukraine are going up against today.Dear, you are again trying to get away from the topic. Here is the topic of the liar Putin. Please stay on topic. I have topics on the issue you are interested in, and participate there. Thank you.I am simply staying on topic by showing you that Putin is not a liar in the ways you are saying. Do you simply want a bunch of people to agree with you whether it is truth or not?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}