{
  "id": "topic_5431191",
  "title": "Alex077",
  "author": "Alex077",
  "created_time": "December 24, 2022, 10:21:24 AMLast edit: December 24, 2022, 05:16:58 PM by Alex077",
  "content": "Россия легализует криптовалюту для международной торговлиРоссийские официальные лица объявили, что страна легализует использование криптовалюты для международной торговли в январе 2023 года, чтобы обойти западные санкции.Председатель финансового комитета Конгресса Анатолий Аксаков заявил , что хотя биткойн (BTC) и криптовалюта будут разрешены для международной торговли, их использование в качестве платежного средства внутри страны будет запрещено....https://crypto.kg/threads/rossija-legalizuet-kriptovaljutu-dlja-mezhdunarodnoj-torgovli.23269/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431191",
  "comments": [
    {
      "author": "Smartprofit",
      "created_time": "December 24, 2022, 10:54:37 AM",
      "body": "Quote from: Alex077 on December 24, 2022, 10:21:24 AMРоссия легализует криптовалюту для международной торговлиРоссийские официальные лица объявили, что страна легализует использование криптовалюты для международной торговли в январе 2023 года, чтобы обойти западные санкции.Председатель финансового комитета Конгресса Анатолий Аксаков заявил , что хотя биткойн (BTC) и криптовалюта будут разрешены для международной торговли, их использование в качестве платежного средства внутри страны будет запрещено....https://crypto.kg/forums/novosti-iz-mira-kriptovaljut.4/post-thread Известный экономист Потапенко писал что у государства просто нет другого выхода. Есть организации, которые осуществляют внешнеэкономическую деятельность. А перед ними стоит огромная проблема, Как получать оплату за поставленную продукцию. И вторая проблема, как покупать необходимые запчасти и материалы за границей.Единственный вариант - это разрешить использование криптовалюты во внешнеэкономических операциях. Причём нужно именно разрешение точка потому что государство не может одобрять каждую отдельную хозяйственную операцию. Просто никаких бюрократических сил не хватит.Ну а центральному банку конечно вся эта ситуация не нравится. Они же привыкли всё контролировать. Всё что касается российской валюты, российского рубля. Поэтому они всячески тормозят этот процесс. Но другого выхода нет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "December 26, 2022, 11:33:38 AM",
      "body": "Присутствие центробанка во всей цепочке лишь ухудшит ситуацию. Все ведь знают что такое Webmoney. Годами данные \"электронные деньги\" функционировали и не было проблем, пока не появился в Webmoney биткойн. Сначала все кошельки Webmoney стали принадлежать центробанку, а потом Центробанк отозвал лицензию у «Консервативного коммерческого банка», открывшегося еще в 1990 г. Он был известен в первую очередь тем, что являлся обслуживающим банком WebMoney – одной из старейших платежных систем в России с возможностью оперировать электронными деньгами. Буквально 2 года и ЦБ убил Webmoney.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Elektrovenik",
      "created_time": "January 03, 2023, 07:40:09 AM",
      "body": "Quote from: Alex077 on December 24, 2022, 10:21:24 AMРоссия легализует криптовалюту для международной торговлиРоссийские официальные лица объявили, что страна легализует использование криптовалюты для международной торговли в январе 2023 года, чтобы обойти западные санкции.Председатель финансового комитета Конгресса Анатолий Аксаков заявил , что хотя биткойн (BTC) и криптовалюта будут разрешены для международной торговли, их использование в качестве платежного средства внутри страны будет запрещено....https://crypto.kg/threads/rossija-legalizuet-kriptovaljutu-dlja-mezhdunarodnoj-torgovli.23269/Интересно, а если потребуется обналичивать уже в стране бизнесу, как они будут это регулировать?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}