{
  "id": "topic_5477094",
  "title": "Tuclikk",
  "author": "Tuclikk",
  "created_time": "December 08, 2023, 08:04:09 PM",
  "content": "As an investor when it comes to loss or profit no one will likely say yes to loss but profit am very sure everyone's admires that.The little that comes in could be useful if you chase the bigger profit and wind up losing everything. It's a gradual process. Because many Investors have bigger dream of their own.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477094",
  "comments": [
    {
      "author": "Xal0lex",
      "created_time": "December 08, 2023, 08:41:47 PM",
      "body": "No one is perfect in the world. Everyone has both gains and losses. Even very advanced investors and traders have losses. It's inevitable. And no matter how much we want it, we cannot do without losses. Periodic losses are even useful, I believe. They reveal weaknesses in our investing or trading strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "December 08, 2023, 08:57:49 PM",
      "body": "Quote from: Tuclikk on December 08, 2023, 08:04:09 PMAs an investor when it comes to loss or profit no one will likely say yes to loss but profit am very sure everyone's admires that.It's because there's no one that wants to lose but all of us are into profit and this is the reason why we're investing, to make possible outcomes and make it profitable. Because if you are an investor and all you want is to get some losses, there must be something wrong or you're still at the early phase of being an investor and learning is part of it that's why it's okay to lose but other than that, no investor want to lose.Quote from: Tuclikk on December 08, 2023, 08:04:09 PMThe little that comes in could be useful if you chase the bigger profit and wind up losing everything. It's a gradual process. Because many Investors have bigger dream of their own.As you've said, it's a gradual process. And if you're chasing something like bigger profit, you may not be able to chase it. Do it naturally and do your thing in the best way that you can. There is no need to chase it, someday it's going to be the profit that shall chase you when you've mastered your craft whether it is in investing or trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "December 08, 2023, 09:06:30 PM",
      "body": "Do not be too greedy because it will suffer losses if you are too chasing big profits, just target what you think is feasible and that is useful for you, because every investor is always different in the view of profit taking.There is always a term in bitcoin investment, when you the longer your HODL will be the greater the profit you get, because bitcoin always has a cycle where the price will go up and down so that's where set the target you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "December 08, 2023, 09:12:49 PM",
      "body": "Investing carries risk, but we all hope for rewards.  Still, best to avoid fantasies of massive profits.  Slow and steady may win this race.  Thats why I prefer a long view - compounding modest returns over time suits me fine.  No interest in hopping onto the latest hot shitcoin.  I will pass on that rollercoaster, thanks.   Steady as she goes works well enough.  If I stick to reasonable expectations and dont get impatient I can slowly build my portfolio.  No guarantees, but a sensible plan improves the odds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "December 08, 2023, 09:48:57 PM",
      "body": "Anyone that thinks it’s a one way street must be kidding. Anyone that thinks it’ll only be wins then you better get your mind together now because that’s not how it works. Cryptocurrencies are volatile in nature and you don’t get to choose what direction the price will go. So yes, prices will go up and prices will go down. Just stick to your holdings like cowboys stick to bulls, be optimistic/stay positive, and HODL! Maybe your dream may come true after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}