{
  "id": "topic_5514128",
  "title": "freedomgo",
  "author": "freedomgo",
  "created_time": "October 21, 2024, 11:28:20 PM",
  "content": "I read that \"Ripple Labs Founder Donates Another $10 Million in XRP to Support Kamala Harris,\" and we all know Ripple still has that ongoing SEC case. By principle, politicians shouldn't take gifts that could mess with their decision-making. So, what if Kamala becomes president? Ripple will definitely expect something back for their support.And what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5514128",
  "comments": [
    {
      "author": "_act_",
      "created_time": "October 21, 2024, 11:33:40 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMAnd what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?Definitely not. Bitcoin still remain obviously the strongest. A coin that its creator is not known and that has the highest marketcap among them all. Regardless of who won the election, no altcoins will be favored than bitcoin. What I think more about Kamala Harris is that crypto will just be as normal as it is now. It is Trump that is having crypto plan which will definitely favour bitcoin more but no altcoin will be in bitcoin place if either of them is elected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "October 21, 2024, 11:39:49 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMI read that \"Ripple Labs Founder Donates Another $10 Million in XRP to Support Kamala Harris,\" and we all know Ripple still has that ongoing SEC case. By principle, politicians shouldn't take gifts that could mess with their decision-making. So, what if Kamala becomes president? Ripple will definitely expect something back for their support.And what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?Taking donation cannot guarantee anything if you mean towards crypto adoption, but for sure those donators would get a favor if their candidate supported will win. We see how many times ripple got bothered by many controversy and face many trials so maybe what they do is somehow to stop this cases under since maybe Harris camp would think about that they owe one from ripple founder when campaign periods happen then maybe save their asses out of those controversies.But at least they see how useful crypto is by using on those transactions and maybe they can see it as currency with those matter and not only a risky investment option to take or use by people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "October 21, 2024, 11:43:46 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMI read that \"Ripple Labs Founder Donates Another $10 Million in XRP to Support Kamala Harris,\" and we all know Ripple still has that ongoing SEC case. By principle, politicians shouldn't take gifts that could mess with their decision-making. So, what if Kamala becomes president? Ripple will definitely expect something back for their support.And what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?Such donations shouldn't bother you but you should instead be delighted because in which ever way, it will favour the cryptocurrency industry. It is obvious that Trump is a pro bitcoin candidate. Gifts to Harris is trying to strike a balance such that anyone who emerges as a winner, the industry will not be negatively impacted. It is more risky when it is just one sided (the side of Trump), when he losses, things will shatter. But now, with Harris accepted the XRP donation, we are sure she wouldn't go against crypto even if she doesn't want to help it.Don't think much, in the eyes of the government, there's no great distinction between bitcoin and altcoins, when one wins, the other has won and vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 21, 2024, 11:46:07 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMSo, what if Kamala becomes president? Ripple will definitely expect something back for their support.Ripple will be expecting something back, but that does not mean that they must get something back for their support.Quote from: freedomgo on October 21, 2024, 11:28:20 PMAnd what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin? If the politician in question is someone who feels like they must reward everyone who supported them in securing a political position, then it is possible that the crypto donations they've received in altcoins can actually influence them into making decisions that will favor the coins that they received over Bitcoin, but if it's a politician that cares less for rewarding people who have supported him directly or, or rather, reward them in other ways, then we shouldn't expect any form of crypto donation to have an effect on them and the decision they plan to make.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "October 21, 2024, 11:57:16 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMSo, what if Kamala becomes president? Ripple will definitely expect something back for their support.Yes, surely if she gets elected as president then she will return the favor somehow and there's chance that favor might be the approval from SEC. In politics that always happens and such favors mostly become fruitful because the intention of sending such donations is always to expect some return. It won't impact Bitcoin in anyway but surely it can somehow open doors from XRP during the presidency of Kamala if she become president.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "October 22, 2024, 12:07:59 AM",
      "body": "Quote from: Rruchi man on October 21, 2024, 11:46:07 PMQuote from: freedomgo on October 21, 2024, 11:28:20 PMSo, what if Kamala becomes president? Ripple will definitely expect something back for their support.Ripple will be expecting something back, but that does not mean that they must get something back for their support.The fact that Kamala’s camp accepted such a huge donation means it's pretty much a given - whether she denies any influence or not. It feels like a behind-the-scenes deal, and honestly, those of us who’ve been around long enough can see right through it, right?Quote from: Rruchi man on October 21, 2024, 11:46:07 PMQuote from: freedomgo on October 21, 2024, 11:28:20 PMAnd what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin? If the politician in question is someone who feels like they must reward everyone who supported them in securing a political position, then it is possible that the crypto donations they've received in altcoins can actually influence them into making decisions that will favor the coins that they received over Bitcoin, but if it's a politician that cares less for rewarding people who have supported him directly or, or rather, reward them in other ways, then we shouldn't expect any form of crypto donation to have an effect on them and the decision they plan to make. Or put it this way: if they don’t plan on giving anything back to crypto devs, they shouldn’t accept crypto donations, simple as that. But since they accepted $10 million -and, let’s be real, this isn’t even the first time Ripple donated, you know Ripple’s banking on getting some help with their SEC troubles. If Kamala wins, she could just appoint a new SEC chairman, one who’s more favorable to them. And think about it: that $10 million is pocket change if Ripple wins. If the news came out, XRP will probably skyrocket. If XRP hits even $1, the devs are gonna make way more than that donation, no doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "October 22, 2024, 01:51:23 AM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMI read that \"Ripple Labs Founder Donates Another $10 Million in XRP to Support Kamala Harris,\" and we all know Ripple still has that ongoing SEC case. By principle, politicians shouldn't take gifts that could mess with their decision-making. So, what if Kamala becomes president? Ripple will definitely expect something back for their support.Ripple is a centralized shitcoin and SEC for many months centralized in Gary Gensler hands except recent months the SEC Chairman was forced to approve Bitcoin Spot ETFs and Ethereum Spot ETFs.The donation to Kamala Harris from Ripple can be their attempts to buy support from Kamala Harris if she gets elected and surely will order something on SEC to support Ripple. We know the Democratic Party are abusing laws and courts for their benefits.QuoteAnd what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?No altcoin will become Bitcoin killer, history proves that since 2009. Many altcoins died and many self-claimed \"Bitcoin killer\" altcoins died too.Altcoins can be more favorite than Bitcoin in bull run but let's see how a cryptocurrency bull run starts. It surely starts with Bitcoin, without Bitcoin bull run, no altcoin bull runs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "October 22, 2024, 02:01:10 AM",
      "body": "Quote from: SamReomo on October 21, 2024, 11:57:16 PMYes, surely if she gets elected as president then she will return the favor somehow and there's chance that favor might be the approval from SEC. In politics that always happens and such favors mostly become fruitful because the intention of sending such donations is always to expect some return. It won't impact Bitcoin in anyway but surely it can somehow open doors from XRP during the presidency of Kamala if she become president.Well it think it's better to use the statement; \" if she gets elected as president then she may likely return the favour\" this is because she is actually not obligated in any way to return their favour at all costs. Anyways I believe all these are just speculations since chances have it that she may or may not. However I really don't think that these donations will make altcoins progress better than bitcoin.I think the worst that could probably happen is that stricter regulations may be put in place probably against decentralisation however it's not actually guaranteed that any of these will happen. Last time I checked, US citizens are core users of bitcoin and I think that implies that there are a majority of decentralisation enthusiasts there too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 22, 2024, 02:06:46 AM",
      "body": "Provided there isn't a quid pro quo arrangement, it's not really that bad. After all, it's not like Kamala is directly asking Ripple for donations. They're probably given voluntarily and willingly in support of Kamala's campaign, and without demanding or even expecting any favor in return. However, it's within our nature to remember those who helped us when we needed them most. I guess it's hard to be purely objective. Should Kamala win, she will probably carry with her much gratitude toward Ripple. And it's possible she would somehow be lenient in dealing with it when the time comes. This is certainly what's in the mind of these companies. No strings attached doesn't exist. I don't expect Bitcoin to be sidestepped. Even altcoins bow down to it. There's nothing to worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "October 22, 2024, 02:23:42 AM",
      "body": "To the date, I have never seen any alt surpassing the Bitcoin in terms of popularity, pricing, volume and increasing caps. Altcoins are just profound ways to transfer huge sums of money without getting charged for it in terms of taxations unless and until you get them converted to fiat and withdraw in a bank. The trade that is outplayed in OP, is just another example of using alts for money exchange to avoid any forthcoming actions against Ripple. Many things goes into it, but at the end lets say Bitcoin cant be beaten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "October 22, 2024, 02:38:16 AM",
      "body": "You can see all the donation details at https://www.opensecrets.org/. Not sure if crypto is already counted in those numbers, but it's clear the total donations are huge--$10M is just a small slice of the pie. We can't be certain what the plan is, but if Kamala does end up helping Ripple, it better be justified. Otherwise, she'll get called out, maybe even sued, and I doubt she’d want that. Imagine being the first female President in US history and then facing a lawsuit like that, not a good look.As for Bitcoin regulation, there’s nothing particularly special right now. It’s treated like property, and people can trade it as long as they pay their taxes. But maybe the biggest change, if Kamala decides to help, could be making Bitcoin a legal tender. That could set the stage for other countries to follow suit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kevystia",
      "created_time": "October 22, 2024, 06:20:18 AM",
      "body": "I think this poses risks of conflicts of interest and could influence their regulatory decisions in favor of altcoins, to the detriment of Bitcoin. This raises ethical concerns about the impartiality and integrity of political decision-making.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "October 22, 2024, 06:26:45 AM",
      "body": "Donations can be used to buy supports from corrupted political party and politicians who are in their governmental administration term but I believe in most of nations, it won't last forever.This chart shows that things can be changed in countries with democracy and companies have to change their donation targets with time too. They need to maximize good effects from donation to their company benefit. How Twitter and Facebook censored tweets, posts, news feed recent years are examples.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "October 22, 2024, 06:29:19 AM",
      "body": "Quote from: MusaMohamed on October 22, 2024, 06:26:45 AMDonations can be used to buy supports from corrupted political party and politicians who are in their governmental administration term but I believe in most of nations, it won't last forever.This chart shows that things can be changed in countries with democracy and companies have to change their donation targets with time too. They need to maximize good effects from donation to their company benefit.Yeah, however, it all depends on the year and the campaign.Only time will tell how it may affect the BTC itself, but I wouldn't say that much.After all, we are talking about politicians - they can say anything and do all in reverse",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "October 22, 2024, 08:12:43 AM",
      "body": "Bitcoin and altcoins are different, there's no correlation at all if they regulate XRP, it doesn't influence them to regulate Bitcoin too.Quote from: Russlenat on October 22, 2024, 02:38:16 AMBased on this picture, Trump will win the election.Who cares with candidate committee, they're smaller than the whole population, Trump received more donation from outside money, so there are more people who support Trump over Kamala.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "October 22, 2024, 02:34:41 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMSo, what if Kamala becomes president? Ripple will definitely expect something back for their support.I don't think there's anything she can do for them, not legally at least. The case is too in the open for her to do anything illegal. She is not the one in charge of the case; it's the SEC, and she can't influence that. Quote from: freedomgo on October 21, 2024, 11:28:20 PMAnd what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?There is no decision on regulations that would favour altcoins over bitcoin. They can only make regulations that might favour that particular coin, which would favour bitcoin. There is no way you can be against Bitcoin and be for other crypto projects. It just shows you're a greedy fraud who just wants to make money, and politicians wouldn't want to be seen that way, even if they are that. All they can do is make favourable laws for crypto which also favours bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 22, 2024, 08:16:10 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMI read that \"Ripple Labs Founder Donates Another $10 Million in XRP to Support Kamala Harris,\" and we all know Ripple still has that ongoing SEC case. By principle, politicians shouldn't take gifts that could mess with their decision-making. So, what if Kamala becomes president? Ripple will definitely expect something back for their support.And what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?Without Bitcoin, I doubt if altcoins will remain stronger in the crypto market, because we all know that Bitcoin is a major cryptocurrency pair on all major exchanges, of which if it is affected, every other coins stands to be indirectly affected too. Hence, Bitcoin will always remain stronger weather it's been used as s medium to support the forthcoming US presidential election or not. However, judging from the central message of the thread it says \"Ripple Labs Founder Donates Another $10 Million in XRP to Support Kamala Harris\",, it didn't say the founder of Bitcoin, hence, you wouldn't have expected the founder of XRP to use Bitcoin, instead of prioritizing his in support of Kamala Harris quest for presidency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "October 22, 2024, 08:32:24 PM",
      "body": "Quote from: freedomgo on October 21, 2024, 11:28:20 PMI read that \"Ripple Labs Founder Donates Another $10 Million in XRP to Support Kamala Harris,\" and we all know Ripple still has that ongoing SEC case. By principle, politicians shouldn't take gifts that could mess with their decision-making. So, what if Kamala becomes president? Ripple will definitely expect something back for their support.And what if politicians take donations in altcoins, like how Trump also received some? Does that mean their decisions on regulations could end up favoring altcoins over Bitcoin?I don't really think all these donating and donations will have any impact whatsoever although that's from my won perspective and the reason why is because most of all these are just political strategies just like the way Bitcoin was paraded in Argentina by one of the candidate for their past Presidential elections.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "October 22, 2024, 08:35:54 PM",
      "body": "Are you aware that for instance Harris doesn't accept crypto donations directly. It's done by one of her committees. These PAC's work individually and come up with their own plans and ideas to earn money for a candidate. They usually don't even consult anything with the candidate and they don't connect donators with the candidate, so if you give them money there's no way you can attach a private message to Kamala IMO XRP does it as a PR move. Usually it's not the PAC that will inform the public about the donation, but the donator, so they donated and immediately went to the media so that everybody knows:-they are doing well financially and have excess money they can spend on donations-they support democratsTBH I couldn't care less about XRP and which political party they send money to. Cryptocurrencies should remain apolitical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}