{
  "id": "topic_5455984",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "June 10, 2023, 06:39:41 PM",
  "content": "Good thing that Biden stole the Presidency. As more and more comes out against him, when he goes down, he will crash with crater-making force. And if anyone says that he will die before he goes to court or is imprisoned, that will be worse for him. Then God will take his punishment in hand, rather than having the courts do it. And God is way more powerful than the courts.Exclusive — Marjorie Taylor Greene: FBI Holds 2 More Informant Files on Biden Business, 2 More Banks Subpoenaedhttps://www.breitbart.com/politics/2023/06/09/exclusive-marjorie-taylor-greene-fbi-holds-2-more-informant-files-biden-business-2-more-banks-subpoenaed/The FBI holds two more informant files on the Biden family's business ventures, triggering the House Oversight Committee on Friday to subpoena two more banks, Rep. Marjorie Taylor Greene (R-GA) exclusively told Breitbart News.Greene, a member of the House Oversight Committee, said the FBI holds at least two more FD-1023 forms referenced in the FBI informant document reviewed by the Committee Thursday. Greene expects the Committee will work to review those forms next week.On Thursday the committee viewed an FBI informant file that revealed the alleged existence of two pieces of evidence showing President Joe Biden received $5 million from Ukrainian energy company Burisma, Committee Republicans told reporters....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455984",
  "comments": [
    {
      "author": "TwitchySeal",
      "created_time": "June 10, 2023, 09:06:49 PM",
      "body": "Quote from: BADecker on June 10, 2023, 06:39:41 PMAnd if anyone says that he will die before he goes to court or is imprisoned, that will be worse for him. Then God will take his punishment in hand, rather than having the courts do it. And God is way more powerful than the courts.So God won't punish him if he goes to prison?I'm glad you are confident in the doj when it comes to prosecuting corrupt politicians.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "June 11, 2023, 01:04:20 AM",
      "body": "Quote from: TwitchySeal on June 10, 2023, 09:06:49 PMQuote from: BADecker on June 10, 2023, 06:39:41 PMAnd if anyone says that he will die before he goes to court or is imprisoned, that will be worse for him. Then God will take his punishment in hand, rather than having the courts do it. And God is way more powerful than the courts.So God won't punish him if he goes to prison?I'm glad you are confident in the doj when it comes to prosecuting corrupt politicians.  Do you really think that God doesn't punish through the courts that He set up?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 11, 2023, 10:15:47 AM",
      "body": "Quote from: BADecker on June 11, 2023, 01:04:20 AMQuote from: TwitchySeal on June 10, 2023, 09:06:49 PMQuote from: BADecker on June 10, 2023, 06:39:41 PMAnd if anyone says that he will die before he goes to court or is imprisoned, that will be worse for him. Then God will take his punishment in hand, rather than having the courts do it. And God is way more powerful than the courts.So God won't punish him if he goes to prison?I'm glad you are confident in the doj when it comes to prosecuting corrupt politicians.  Do you really think that God doesn't punish through the courts that He set up?I have always been taught that divine justice and human justice are very separate from one another, but may not mutually exclusive. I assume it depends on the personal believes of each one of us and the kind of upbringing we had. On the news that you shared, I am personally skeptical on any whistleblower document that there could be, however, if there is indeed evidence of a crime and Biden has indeed been involved in some corrupt dealings I would be in favor of prosecute him and anyone in his family who took part. Noone should be above law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "June 11, 2023, 08:43:59 PM",
      "body": "^^^ Romans 13 - https://biblehub.com/romans/13.htm - shows that God is the Guy Who sets governments in place... including the courts. But, God works in ways that we don't always understand.Look at the whole Old Testament following Israel's entry into the land of Canaan. When the people of Israel started to forget God, he allowed foreign governments to take them over. A good example is the Babylon captivity of Israel, the foreign ruler being Nebuchadnezzar. God even gave Egypt over to Nebuchadnezzar as payment for his campaigns against Israel, for which he receive little pay for conquering them (Israel) on God's behalf.Today, many American people are turning against God in many blatantly evil ways. The Russian people have turned against God somewhat. So have the Ukrainians. This doesn't mean that all the people have turned. But it seems that Zelensky is against God, Biden doesn't say much, and Putin is for God (if not in a dramatic way). Is God going to let Russia beat us in that war? Are we going to fall to BRICS because We the People don't have enough guts to stand up against individuals running our government system in a corrupt way?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 03, 2023, 04:09:21 PM",
      "body": "Now there are more people coming out as whistleblowers against Biden and Hunter. And they are explaining it clearly. Biden was doing all the things that Trump was being accused of by the Biden team, but Trump wasn't doing them.It's so ironic that Biden, who was fighting Ukraine just a few short years ago, is now giving them billions of US dollars. Did Ukraine really win the stuff in the article? Have they taken over the US thorough Joe Biden?Good stuff in that article, including opinions by people on Twitter.Devon Archer Spills The Beans: Tells Congress About Shady Burisma Dealings, Joe Biden's \"More Than 20\" Conversationshttps://www.zerohedge.com/political/devon-archer-spills-beans-tells-congress-about-shady-burisma-dealings-joe-bidens-more-20Hunter Biden's former business partner Devon Archer has spilled the beans to Congress, telling lawmakers in a closed-door session that Burisma Holdings pressured Hunter Biden in December 2015 to 'deal with' a Ukrainian prosecutor who was investigating the firm for corruption - shortly before then-VP Joe Biden threatened Ukraine with a quid-pro-quo over US aid in exchange for firing said prosecutor.According to Just the News, Archer also told the House Oversight and Accountability Committee that Hunter Biden was hired to sit on the board of Burisma because his family's \"brand\" had value at a time when the firm was facing corruption allegations from not only Ukraine's own prosecutor general's office, but the US and Great Britain as well.\"Devon Archer testified that the value of adding Hunter Biden to Burisma's board was 'the brand' and confirmed that then-Vice President Joe Biden brought the most value to 'the brand,'\" an anonymous source told JTN. \"Archer also stated that Burisma would have gone under if not for 'the brand.\"Selling the brandArcher also contradicted Joe Biden's claims that he had neveSelling the brandr met with Hunter Biden's foreign business associates - telling the committee that Joe Biden had gotten on speakerphone over 20 times with his son's business clients - not to engage in specific business, but he \"was put on the phone to sell 'the brand.'\"The former business partner at the Rosemont Seneca firm, who was convicted in 2018 in a tribal bond fraud scheme, also told lawmakers that Hunter Biden was pressured in late 2015 to help deal with Prosecutor General Viktor Shokin's corruption investigation as Joe Biden was preparing to travel to Ukraine. -JTN...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 11, 2023, 08:42:27 PM",
      "body": "It's about time.House Oversight Committee Announces Entire Biden Crime Family Will Be Subpoenaedhttps://banned.video/watch?id=64d5784f3a4bee5842419589Major breaking news when it comes to the investigation into the Biden Crime Family as James Comer tells America that the whole family will be subpoenaed. Biden continues to find new ways to get money to Ukraine, this time throwing it into a disaster relief package going to Hawaii. Donald Trump seems to be having the most fun of his life campaigning during the political witch hunt he's being subjected to. Dan Lyman joins the show in studio to talk about the latest border news and now the Democrats complaining about illegal immigration....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 11, 2023, 08:56:02 PM",
      "body": "I’m not sure what the end result will be for proving that our government is this corrupt, but hopefully it at least starts to open people’s eyes. These lifelong politicians that sellout our country to make millions have got to start having some consequences. The fact that Nancy Pelosi isn’t in jail is all you need to know about the regulators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "August 12, 2023, 06:48:26 AM",
      "body": "https://www.nytimes.com/2023/08/11/us/politics/garland-weiss-hunter-biden-special-counsel.htmlProsecutor in Hunter Biden probe receives special prosecutor status. It's unfortunate his plea bargain fell apart. According to the court transcript, Hunter's lawyers were demanding that he be immunized from future prosecution on other charges related to his business dealings. Unprecedented, of course. Judge and the prosecution declined. This will end up going to trial. Prison time is on the table if a conviction lands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 12, 2023, 05:28:04 PM",
      "body": "As a bonus, watch The Tiny Dot - https://www.youtube.com/watch?v=H6b70TUbdfs.Video in the article.545 vs 300 Millionhttps://banned.video/watch?id=64d6adda3a4bee58428bfd69It seems inconceivable to me that a nation of 300 million cannot replace 545 people who stand convicted – by present facts – of incompetence and irresponsibility.In 1984 Charley Reese of the Orlando Sentinel wrote the following. Still true today.One hundred senators, 435 congressmen, one President, and nine Supreme Court justices equates to 545 human beings, out of 300 million, who are directly, legally, morally, and individually responsible for the domestic problems that plague this country.I excluded the members of the Federal Reserve Board because that problem was created by Congress. In 1913, Congress delegated its Constitutional duty to provide a sound currency to a federally chartered, but private, central bank.I excluded all the special interests and lobbyists for a sound reason. They have no legal authority. They have no ability to coerce a senator, a congressman, or a President to do one cotton-picking thing. I don't care if they offer a politician $1 million dollars in cash. The politician has the power to accept or reject it. No matter what the lobbyist promises, it is the legislator's responsibility to determine how he votes.Those 545 human beings spend much of their energy convincing you that what they did is not their fault. They cooperate in this common con regardless of party.It seems inconceivable to me that a nation of 300 million cannot replace 545 people who stand convicted – by present facts – of incompetence and irresponsibility. I can't think of a single domestic problem that is not traceable directly to those 545 people. When you fully grasp the plain truth that 545 people exercise the power of the federal government, then it must follow that what exists is what they want to exist.If the tax code is unfair, it's because they want it unfair. If the budget is in the red, it's because they want it in the red. If the Army and Marines are in Iraq and Afghanistan it's because they want them in Iraq and Afghanistan. If they do not receive social security but are on an elite retirement plan not available to the people, it's because they want it that way. There are no insoluble government problems.Do not let these 545 people shift the blame to bureaucrats, whom they hire and whose jobs they can abolish; to lobbyists, whose gifts and advice they can reject; to regulators, to whom they give the power to regulate and from whom they can take this power. Above all, do not let them con you into the belief that there exists disembodied mystical forces like \"the economy,\" \"inflation,\" or \"politics\" that prevent them from doing what they take an oath to do. Those 545 people and they alone, are responsible. They and they alone, have the power. They and they alone should be held accountable by the people who are their bosses. Provided the voters have the gumption to manage their own employees....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "August 13, 2023, 03:03:41 AMLast edit: August 13, 2023, 03:32:47 AM by TwitchySeal",
      "body": "Quote from: BADecker on August 03, 2023, 04:09:21 PMNow there are more people coming out as whistleblowers against Biden and Hunter. And they are explaining it clearly. Biden was doing all the things that Trump was being accused of by the Biden team, but Trump wasn't doing them.Honestly if it came out Hunter fucked Stormy right before the election and then Joe gave Merrick $100k for hush money the country might end up a little less divided.  Until Donald Trump inevitably ends up in prison or the White House.  Or Stormy says Hunters was bigger.Prediction:  Hunter relapses.  I'd be very impressed if he hasn't already.  Gets tossed into rehab.He gets convicted but his addiction and mental health are considered at his sentencing and he ends up at a fancy rehab for most or all of his sentence.  Republicans now begin accusing Hunter of not being a drug addict.  \"Brandon Jr.\" becomes another way of saying \"drug free\".  They are mad as hell that Hunter Biden is in rehab instead of prison.  But while in rehab/prison Hunter finds Jesus and when he is released (about 6 months into Bidens second term) he joins a cult and makes friends with a bunch of magatards (89% of the 2022 global cult population were magatards).  Hunter becomes 100% loyal to Donald Trump.  He becomes a MAGA rock star, Trump has his lawyer post on his Truth account that Hunter is the son he wanted but never had while he was free.  Tiffany Trump has affair with Hunter, gets divorce after tabloids catch them at a shady motel in West Virginia.They start attacking democrats for trying to infringe on hunters 2 Amendment rights and start claiming Merrick Garland has always been after him all along.  Ron Desantis makes Hunter ag of Florida and gets him to files hundreds of lawsuits against his father and make up stories about how his father molested him, made his mother get abortions for the fun of it, could never figure out how to tie his shoes, and has a secret family in China with 12 half chinese half Biden children.  Republicans think this is hilarious but only BADecker actually believes any of it.  This boosts Rons confidence so he runs for president in 2028 - Trump crushes him from Prison with Hunter as his running mate, but now all the tick tockers are old enough to vote so Trump has no chance against the Buttigieg AOC ticket.  The racists and lgbtqphobes crawl back in their holes and a new conservative opposition party is formed by decent people and we all lived happily ever after.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 13, 2023, 05:05:42 PM",
      "body": "Quote from: TwitchySeal on August 13, 2023, 03:03:41 AMQuote from: BADecker on August 03, 2023, 04:09:21 PMNow there are more people coming out as whistleblowers against Biden and Hunter. And they are explaining it clearly. Biden was doing all the things that Trump was being accused of by the Biden team, but Trump wasn't doing them.Honestly if it came out Hunter fucked Stormy right before the election and then Joe gave Merrick $100k for hush money the country might end up a little less divided.  Until Donald Trump inevitably ends up in prison or the White House.  Or Stormy says Hunters was bigger.~I love your stories. They are kinda cute. Next you will be trying to say that Hunter is another Trump, from the ground up. Then you will be trying to say that I was the one who said it by taking some of my stuff out of context. Are they paying you enough to make up your stories? However, they aren't too bad. Just too much in one direction. Try getting an overview of what is really going on.Btw, like the Trump Russian collusion story has been proven false, now we find that the main propagator of the collusion story was found to have done the general things he was complaining about Trump doing.I know, I know. when you have gotten yourself into the goofy position you have gotten yourself into, why would you even care any longer?FBI Special Agent Who Investigated Trump-Russia Collusion to Pleads Guilty to Russian Collusionhttps://patriotclash.com/fbi-special-agent-who-investigated-trump-russia-collusion-to-pleads-guilty-to-russian-collusion/In a shocking turn of events, former FBI Special Agent Charles McGonigal, who played a central role in the investigation of alleged Trump-Russia collusion, is set to plead guilty to charges of illegally working with Russian oligarch Oleg Deripaska. McGonigal, a former top FBI counterintelligence agent based in New York, was indicted earlier this year on multiple counts, including money laundering and violating US sanctions.THE ALLEGATIONS AND CHARGESMcGonigal, 54, is accused of violating US sanctions by working for Oleg Deripaska and attempting to remove him from the US sanctions list. As a top FBI counterintelligence agent, McGonigal was legally obligated to report his contacts with foreign officials. However, it is alleged that he concealed these ties and engaged in business activities and overseas travel that conflicted with his role. The charges against McGonigal include conspiring to violate and evade US sanctions, money laundering, conspiring to commit money laundering, and conspiring to violate federal law against doing business with sanctioned individuals.THE PLEA AGREEMENTManhattan federal Judge Jennifer Rearden has scheduled a hearing for August 15th, during which McGonigal is expected to enter a guilty plea. This development comes after the court was informed of McGonigal's intention to change his plea. If McGonigal pleads guilty, it could have significant implications for the ongoing investigations into Russian interference in the 2016 US presidential election.MCGONIGAL'S ROLE IN THE \"RUSSIAGATE\" INVESTIGATIONCharles McGonigal played a central role in the FBI's investigation into alleged collusion between the Trump campaign and Russia during the 2016 election. This investigation, commonly known as \"Russiagate,\" eventually led to the appointment of special counsel Robert Mueller. The plea agreement by McGonigal raises questions about the credibility of the investigation and the potential impact it may have had on the outcome of the 2016 election....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "August 13, 2023, 10:29:57 PM",
      "body": "Quote from: BADecker on August 13, 2023, 05:05:42 PMBtw, like the Trump Russian collusion story has been proven falseOh, you haven't read the Mueller report.Here's some collusion for you:https://www.justice.gov/archives/sco/file/1373816/download",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 13, 2023, 11:09:13 PMLast edit: August 13, 2023, 11:20:46 PM by BADecker",
      "body": "Quote from: TwitchySeal on August 13, 2023, 10:29:57 PMQuote from: BADecker on August 13, 2023, 05:05:42 PMBtw, like the Trump Russian collusion story has been proven falseOh, you haven't read the Mueller report.Here's some collusion for you:https://www.justice.gov/archives/sco/file/1373816/downloadNotice that it doesn't say that Trump had something to do with it. Besides, it's purported to be FBI, who we all know is in collusion with the Biden team. They would easily blame Trump for something that would make him look bad, truth or not.MUST WATCH: Former FBI Section Chief Exposed Domestic Terror Attacks Of The Satanic Deep Statehttps://www.bitchute.com/video/7xa9GggrrOs0/Ted Gunderson FBI Section Chief lays out a laundry list of Domestic Terror attacks perpetrated by different factions of the Deep State. From Pearl Harbor to 9/11 and beyond Ted Gunderson's testimony proves everything Infowars has been saying for years....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "August 14, 2023, 02:30:25 AM",
      "body": "Quote from: BADecker on August 13, 2023, 11:09:13 PMNotice that it doesn't say that Trump had something to do with it. They were investigating Russian Government links to and contacts with the Trump campaign.Paul Manafort was the chairman of the Trump campaign.Quote from: BADecker on August 13, 2023, 11:09:13 PMBesides, it's purported to be FBI, who we all know is in collusion with the Biden team. They would easily blame Trump for something that would make him look bad, truth or not.The report was written by the special council, who was appointed by the Trump team in 2017.  Trump was elected president in 2016.  Biden was elected president in 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 14, 2023, 03:45:36 PM",
      "body": "Quote from: TwitchySeal on August 14, 2023, 02:30:25 AMQuote from: BADecker on August 13, 2023, 11:09:13 PMNotice that it doesn't say that Trump had something to do with it. They were investigating Russian Government links to and contacts with the Trump campaign.Paul Manafort was the chairman of the Trump campaign.Quote from: BADecker on August 13, 2023, 11:09:13 PMBesides, it's purported to be FBI, who we all know is in collusion with the Biden team. They would easily blame Trump for something that would make him look bad, truth or not.The report was written by the special council, who was appointed by the Trump team in 2017.  Trump was elected president in 2016.  Biden was elected president in 2020.I would agree with you that if someone does criminal activity or appears to have done criminal activity, investigate and prosecute as necessary.By the admission of the info you showed us, it was the Trump team and the Trump campaign manager that might have done wrongful activity. Since Trump has been shown to have had nothing to do with criminal Russian collusion, go after the people who did... not Trump. Trump doesn't control every activity of his people, or even know what they are doing all the time. There is the element of trust in there.Take Biden for example. He supposedly wants to send like $40 billion more to Ukraine. And Ukraine doesn't have anything to do with America. The money is increasing inflation which is already like double from a couple of years ago. How are Americans supposed to live with that.How is this Biden activity comparing with Trump's supposed Russian collusion activity? Simple. We all watch Biden on stage or anywhere. On a good day, he might understand some of what is going on. But so often he is simply a parrot of what is being supplied to him by his handlers. Does he even know what goes on in his regime? Possibly. But certainly not as much of it as he should. Even if he has a criminal mindset, he trusts others. And do they do all kinds of things that he doesn't know about? Certainly.Biden might just get off from his crimes by pleading insanity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 17, 2023, 09:35:26 PM",
      "body": "Finally Trump might be ready to do a counterstroke. And it is the Dems that are urging him on.Calls grow to indict Hillary Clinton, Obama and Biden for ‘Russia collusion hoax’ after GA charges drophttps://www.naturalnews.com/2023-08-17-calls-grow-to-indict-clinton-obama-biden.htmlA Georgia grand jury indicted President Donald Trump last night, charging him with felony racketeering and numerous conspiracy charges.(Article by David Hawkins republished from SlayNews.com)In addition to charging Trump, the grand jury returned an indictment Monday of 18 other people as co-defendants.The indictment mentions 30 unindicted “co-conspirators.”The RICO charges were filed against Trump and his allies by Fulton County District Attorney Fani Willis, a Democrat.“The indictment alleges that rather than abide by Georgia’s legal process for election challenges, the defendants engaged in a criminal racketeering enterprise to overturn Georgia’s presidential election result,” Willis said of her get-Trump case.Trump’s legal team said, “The events that have unfolded today have been shocking and absurd, starting with the leak of a presumed and premature indictment before the witnesses had testified or the grand jurors had deliberated and ending with the District Attorney being unable to offer any explanation.”As news of the anti-Trump charges dropped on social media, calls quickly emerged for Democrat President Joe Biden, Ex-POTUS Barack Obama, and twice-failed presidential candidate Hillary Clinton to be charged for their rile in the Russia collusion hoax.“The indictment is a joke,” Joel Pollak, the senior editor at Breitbart, said.“But it sets a standard that Republican AGs and DAs should follow in retaliation.“Convene a grand jury in some Republican jurisdiction and indict Hillary Clinton, Barack Obama, Joe Biden, and the rest of them for the Russia collusion hoax.“One law for all.”    The indictment is a joke. But it sets a standard that Republican AGs and DAs should follow in retaliation. Convene a grand jury in some Republican jurisdiction and indict Hillary Clinton, Barack Obama, Joe Biden and the rest of them for the Russia collusion hoax. One law for all. https://t.co/yimNKuMemG...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 20, 2023, 04:55:23 PM",
      "body": "Trump is having his troubles, as we all know. But tables are starting to turn against Biden... and this time from his own son's lawyers.Hunter Biden's Lawyers Threatened To Put President Biden On Witness Standhttps://www.dailywire.com/news/hunter-bidens-lawyers-threatened-to-put-president-biden-on-witness-stand-if-hunter-was-charged-by-doj-reportChris Clark, a lawyer for Hunter Biden, threatened the U.S. attorney investigating his client that if his client was charged in the case, the defense would call President Joe Biden to testify, thus creating a constitutional crisis by pitting the president against his own Department of Justice, POLITICO reported.The warning came after information had leaked to the news media that federal prosecutors believed they had enough information to charge Hunter Biden for illegally purchasing a firearm despite being a drug addict.\"President Biden now unquestionably would be a fact witness for the defense in any criminal trial,\" Clark said in a lengthy letter to prosecutors, later adding: \"This of all cases justifies neither the spectacle of a sitting President testifying at a criminal trial nor the potential for a resulting Constitutional crisis.\"...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}