{
  "id": "topic_5405501",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "July 07, 2022, 11:33:24 AM",
  "content": "BITCOIN IS ABOUT TO DO THIS CRAZY MOVE SOON!!!!! + Crypto Market Analysis https://www.youtube.com/watch?v=D6Q0dmu8RIY",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405501",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "July 07, 2022, 02:52:33 PM",
      "body": "Personally, I do not like the style of suspense YouTubers or their choice of video titles, it seems that they are sure of the direction of the market and therefore the advice they will give will be in one way or another investment advice that may lead to some losing their money.I remember one of the channels has several analyzes on the same day, and then after a month they delete the wrong predictions and tells the users that the technical analysis of the channel was accurate.Can you give us a few words as a summary of the video and leave us the option to watch it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "July 07, 2022, 03:20:41 PM",
      "body": "Quote from: Robert518 on July 07, 2022, 11:33:24 AMBITCOIN IS ABOUT TO DO THIS CRAZY MOVE SOON!!!!! + Crypto Market Analysis https://www.youtube.com/watch?v=D6Q0dmu8RIYAre you promoting the video channel? Regarding the analysis provided, it may be true or false. I tried opening the youtube you provided and looking at the creator's profile. I think this channel was created to make people follow opinions. Even I see he also has a telegram channel. Then also have twitter to spread prediction signals. It's everyone's right but I don't think it's good to follow through without doing your own analysis. You must still have your own way, relying on people's analysis will be to your own detriment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "July 07, 2022, 03:50:03 PM",
      "body": "Quote from: hugeblack on July 07, 2022, 02:52:33 PMPersonally, I do not like the style of suspense YouTubers or their choice of video titles, it seems that they are sure of the direction of the market and therefore the advice they will give will be in one way or another investment advice that may lead to some losing their money.They are ready to tell the people what they want to hear and that is why newbies fall for them. It is showing that business is the agenda and not the good. Op is not the only of the likes as they many interested in building the strength of their YouTube channel. This should not be taking as investment advise but an information to work on before investing. Dyor is always advised in crypto investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 07, 2022, 08:13:07 PM",
      "body": "Quote from: Robert518 on July 07, 2022, 11:33:24 AMBITCOIN IS ABOUT TO DO THIS CRAZY MOVE SOON!!!!! + Crypto Market Analysis It is possible that bitcoin is about to do the crazy thing, but know that nothing crazy like all-time-time, even bitcoin for now cannot reach over $30000 if my analyses is more accurate. You can see bull market and price of bitcoin may reach or almost reach $30000, but it may not go beyond. But what is most likely happening this time is just what looks like bullrun but the price may not still rise above $21000 for weeks. These are just guesses though, but the speculation should be accurate as the bear market continue to last longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "July 07, 2022, 08:36:59 PM",
      "body": "Quote from: hugeblack on July 07, 2022, 02:52:33 PMPersonally, I do not like the style of suspense YouTubers or their choice of video titles, it seems that they are sure of the direction of the market and therefore the advice they will give will be in one way or another investment advice that may lead to some losing their money.I remember one of the channels has several analyzes on the same day, and then after a month they delete the wrong predictions and tells the users that the technical analysis of the channel was accurate.Can you give us a few words as a summary of the video and leave us the option to watch it?Currently it does have 122 views (including mine) who did watch the video but i havent watched it and just checked out but didnt listen up on what he's saying.You are definitely right that youtubers would really becasually making some titles to be that catchy as possibly as it could be considering that not all people are experienced and pros where there are noobs who do easily fall out with market predictions.Someone do claim that they do have high accuracy in terms of market prediction and its no surprise about deletion of videos of past prediction? not new i would say.Therefore noobs out there should really be careful on believing something that they had able to read up around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "July 07, 2022, 09:36:16 PM",
      "body": "Quote from: Robert518 on July 07, 2022, 11:33:24 AMBITCOIN IS ABOUT TO DO THIS CRAZY MOVE SOON!!!!! + Crypto Market Analysis https://www.youtube.com/watch?v=D6Q0dmu8RIYBetter to post the summary here than to give us a link where we just need to watch that can increase the views.Bitcoin moves unpredictable, crazy move are always part of Bitcoin and seriously very few users able to see Bitcoin to crashed like this because many are over confident with Bitcoin. The pump may happen soon, or probably another drop before it happen, eventually Bitcoin will rise again and that is a good assurance that Bitcoin can give to us, TA works and right now we are still trying to break the first resistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 07, 2022, 11:47:53 PM",
      "body": "Quote from: hugeblack on July 07, 2022, 02:52:33 PMI remember one of the channels has several analyzes on the same day, and then after a month they delete the wrong predictions and tells the users that the technical analysis of the channel was accurate.This is almost similar to how \"fixed match tips\" sellers would do it back in the day. A Facebook page or telegram channel would make so many predictions, some of which were even hidden from the timeline and once it's full time, they would then delete all the wrong ones and un-hide the correct ones. To someone naive, they would think the tips were actually accurate and would be tricked into send money  OP if it's YouTube views that you are looking for here, then you are wasting time... Just make charts with your tech analysis, make a small overview and post it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 08, 2022, 01:17:46 AM",
      "body": "It was an analysis turned into a video so that visual aids can be used in a bit of an interactive way. And also well, plug some telegram groups here and there  . The title of the video seems kind of dumb though, it just screams \"clickbait\".Also if you're looking for views, doing crypto in itself is wrong imo, though you might get more views instead if you were to turn it into a news segment kind of thing about crypto. People would much rather see a small overview of the conclusion of an analysis, rather than the analysis itself. People will talk to you about the analysis as replies if they want to discuss it themselves but in general, an overview is a lot better as an intro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 08, 2022, 03:23:53 AM",
      "body": "Yeah it’s crazy the amount of Bitcoin trading content you can find on YouTube. Most of it is useless but they got the worst clickbait subjects out there.Many people follow these recommendations and they usually end up losing money. Most of those YouTube producers don’t actually trade. Most of their income is from the revenue streams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 08, 2022, 03:32:19 PM",
      "body": "OP, that strategy won't work for a forum that's full of bitcoin enthusiasts and many are real traders.That will only work for a forum that doesn't have much that bitcoin enthusiasts or the majority are a newbie about bitcoin.You can do better by making it not look like a clickbait and natural growth for your channel will come. Listen to what has been suggested to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 08, 2022, 09:26:27 PM",
      "body": "Quote from: adaseb on July 08, 2022, 03:23:53 AMYeah it’s crazy the amount of Bitcoin trading content you can find on YouTube. Most of it is useless but they got the worst clickbait subjects out there.Many people follow these recommendations and they usually end up losing money. Most of those YouTube producers don’t actually trade. Most of their income is from the revenue streams.We should not rely on Youtube, they are doing this for them to get the money and not to actually help the inspiring traders, you can learn some strategy but never follow their analysis because for sure, it might not fit to your own strategy. They have best clickbait but if you watch the whole analysis, you can notice something is wrong, if you are going to invest better to have your own analysis that can work with your own timeline by this, you can at least lessen the risk of losing money every time you trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 08, 2022, 09:48:59 PM",
      "body": "Quote from: blockman on July 08, 2022, 03:32:19 PMOP, that strategy won't work for a forum that's full of bitcoin enthusiasts and many are real traders.That will only work for a forum that doesn't have much that bitcoin enthusiasts or the majority are a newbie about bitcoin.You can do better by making it not look like a clickbait and natural growth for your channel will come. Listen to what has been suggested to you.Looks like just a normal analysis with a weak basis. I won’t follow that kind of advices, this forum has been the resistant to those who are trying to mislead the newbies, this kind of analysis is too risky to follow. Even newbies should be more aware about the genuine analysis, better for them to learn the process. Trading is fun and with Bitcoin, it can be more profitable you just need the right execution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 08, 2022, 11:30:51 PM",
      "body": "Quote from: adaseb on July 08, 2022, 03:23:53 AMMany people follow these recommendations and they usually end up losing money. Most of those YouTube producers don’t actually trade. Most of their income is from the revenue streams.Yeah, some even just use demo accounts... lol, while they mislead newbies into losing real month.Some YouTubers get their cuts from project owners and platforms to shill them on YouTube with stupid technical analysis. I know because some guy confessed how much they would even pay him.I prefer someone who performs live trading and doesn't push people to \"subscribe\" \"like\" the videos or sign up using their referral links in the description.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "July 09, 2022, 03:10:17 AM",
      "body": "Quote from: Robert518 on July 07, 2022, 11:33:24 AMBITCOIN IS ABOUT TO DO THIS CRAZY MOVE SOON!!!!! + Crypto Market Analysis https://www.youtube.com/watch?v=D6Q0dmu8RIYI never like YouTube videos for analysis. YouTubers always use something interesting in their video titles and thumbnails.  Which attracts people to view his videos. But they can't give accurate information in the video. And there are no views on your video.  And the channel is brand new. So it is more impossible to believe this video. You can choose this forum for proper analysis.  Here you will find the correct information.  If you can't find any information, you can post it here.  The experts will give you the right information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rojan",
      "created_time": "July 09, 2022, 05:52:58 AM",
      "body": "Quote from: smartaction on July 09, 2022, 03:10:17 AMQuote from: Robert518 on July 07, 2022, 11:33:24 AMBITCOIN IS ABOUT TO DO THIS CRAZY MOVE SOON!!!!! + Crypto Market Analysis https://www.youtube.com/watch?v=D6Q0dmu8RIYI never like YouTube videos for analysis. YouTubers always use something interesting in their video titles and thumbnails.  Which attracts people to view his videos. But they can't give accurate information in the video. And there are no views on your video.  And the channel is brand new. So it is more impossible to believe this video. You can choose this forum for proper analysis.  Here you will find the correct information.  If you can't find any information, you can post it here.  The experts will give you the right information.Yes it is provability true. This forum is sufficient for analysis and others matter. 90% of content on YouTube is fake.  So it is foolish to trust any kind of YouTube you. YouTube is just for fun not for crypto analysis. But sometimes we can learn some basic things from YouTube but not much",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 09, 2022, 12:51:23 PM",
      "body": "Quote from: Johnyz on July 08, 2022, 09:48:59 PMQuote from: blockman on July 08, 2022, 03:32:19 PMOP, that strategy won't work for a forum that's full of bitcoin enthusiasts and many are real traders.That will only work for a forum that doesn't have much that bitcoin enthusiasts or the majority are a newbie about bitcoin.You can do better by making it not look like a clickbait and natural growth for your channel will come. Listen to what has been suggested to you.Looks like just a normal analysis with a weak basis. I won’t follow that kind of advices, this forum has been the resistant to those who are trying to mislead the newbies, this kind of analysis is too risky to follow. Even newbies should be more aware about the genuine analysis, better for them to learn the process. Trading is fun and with Bitcoin, it can be more profitable you just need the right execution. He's in a forum and much better that he just post that analysis that he's got. Whether it's weak or not analysis, as long as we see his justification and visuals on how he's ended up with that analysis, that will be appreciated. He's already in a forum yet he wants people to go to his channel and video to gain views. Well, many don't like that type of gain on their own. He should have just done himself a favor by putting all of those analysis he's got on that video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "July 09, 2022, 11:57:25 PM",
      "body": "Quote from: rojan on July 09, 2022, 05:52:58 AMQuote from: smartaction on July 09, 2022, 03:10:17 AMQuote from: Robert518 on July 07, 2022, 11:33:24 AMBITCOIN IS ABOUT TO DO THIS CRAZY MOVE SOON!!!!! + Crypto Market Analysis https://www.youtube.com/watch?v=D6Q0dmu8RIYI never like YouTube videos for analysis. YouTubers always use something interesting in their video titles and thumbnails.  Which attracts people to view his videos. But they can't give accurate information in the video. And there are no views on your video.  And the channel is brand new. So it is more impossible to believe this video. You can choose this forum for proper analysis.  Here you will find the correct information.  If you can't find any information, you can post it here.  The experts will give you the right information.Yes it is provability true. This forum is sufficient for analysis and others matter. 90% of content on YouTube is fake.  So it is foolish to trust any kind of YouTube you. YouTube is just for fun not for crypto analysis. But sometimes we can learn some basic things from YouTube but not much Mostly the you tubers will do the paid promotion for the benefits of the crypto company with the paid promotion.It’s risky to accept the promoted coin from the you tube.You can use the you tube to know base about the project,but you can’t handle such nots realistic one.Quote from: Bitcoin_Arena on July 08, 2022, 11:30:51 PMQuote from: adaseb on July 08, 2022, 03:23:53 AMMany people follow these recommendations and they usually end up losing money. Most of those YouTube producers don’t actually trade. Most of their income is from the revenue streams.Yeah, some even just use demo accounts... lol, while they mislead newbies into losing real month.Some YouTubers get their cuts from project owners and platforms to shill them on YouTube with stupid technical analysis. I know because some guy confessed how much they would even pay him.I prefer someone who performs live trading and doesn't push people to \"subscribe\" \"like\" the videos or sign up using their referral links in the description.Some you tubers will get the partial amount of usd and their coin for their work,Some people will accept the fully money in USD.Because USD will be stable coin then the coin they promote for the money.any advice will be self analysis of the project will best as compared to any other social media reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 10, 2022, 12:33:51 AM",
      "body": "Quote from: hugeblack on July 07, 2022, 02:52:33 PMPersonally, I do not like the style of suspense YouTubers or their choice of video titles, it seems that they are sure of the direction of the market and therefore the advice they will give will be in one way or another investment advice that may lead to some losing their money.I remember one of the channels has several analyzes on the same day, and then after a month they delete the wrong predictions and tells the users that the technical analysis of the channel was accurate.Can you give us a few words as a summary of the video and leave us the option to watch it?Youtube is all about clickbaiting now. Every video thumbnail I see looks like this \":O\" They all have surprised fuckface face which is super irritating. You can still find some real information on youtube but you'll have to know what you are looking for because youtube algo brings the unrelated hype stuff mostly which you don't need.OP's post is probably an ad for his channel. Can't bother with clicking that link. Another click bait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$anounimus$",
      "created_time": "July 10, 2022, 08:17:36 PM",
      "body": "I love BTC and it's my favorite. If you are interested in investing in cryptocurrencies, my advice to you is to do some research. There are lots of informational links out there and not all of them are accurate, look for the ones with knowledge and calculations.So it's all about how you trade with the most appropriate policies. If you don't know about this then talk to experts who know the cryptocurrency space well and get as much input as possible before investing any amount of money that way every aspect of Cryptocurrency trading can be calculated wisely because crypto can be slammed instantly and suddenly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}