{
  "id": "topic_5436847",
  "title": "Z390",
  "author": "Z390",
  "created_time": "January 26, 2023, 09:40:35 AM",
  "content": "How can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issue, my concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? You as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436847",
  "comments": [
    {
      "author": "logfiles",
      "created_time": "January 26, 2023, 12:15:11 PM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? I had to laugh, so hard when I read this.Are there any more corrupt organizations in this world that the very Governments or politicians we seem to always blindly trust?Ooh, well some politicians even in the US gladly received \"donations\" from SBF QuoteCrypto is presently not regulated and I don't see how regulation will fix this issue,Why should Bitcoin be regulated by corrupt politicians, for example?Quote my concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? CBDCs are just a digital version of fiat. So what's the point of using them if you are trying to escape the traditional fiat currencies?People should learn to avoid shady projects and shitcoins. Bitcoin used to do well way before stablecoins and it shall still do well without shady stablecoins.Quote from: Z390 on January 26, 2023, 09:40:35 AMYou as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? No, thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "January 26, 2023, 12:31:07 PM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? We'll definitely see another one like that in the future. Government can't stop business bankruptcy. They cannot stop owner's malpractice despite having strict rules and regulations. They can only sue and penalize these owners after the crime is done.Quote...You as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? It doesn't really matter if it's a USDT pairing or CBDC. Just different issuer but the same function or utility.It's better to just choose fiat if you plan on using stable coins for long-term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "January 26, 2023, 12:43:40 PM",
      "body": "Even in Africa, people understand that CBDC is complete crap. If you haven't read the news then run the request: CBDCS FAILING IN NIGERIA.CBDC is a complete total control over the population, so a decentralized cryptocurrency will be the only way to prevent the implementation of CBDC. Relatedly, thanks to CBDC, people are starting to use cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "January 26, 2023, 01:18:25 PM",
      "body": "The op is right that crypto regulation won't fix the FTX issue, but I don't see how CBDC has got to do with anything. It can be a more of less stable coin, sure, but that won't stop exchanges from declaring bankrupcy, customers from losing money. It also won't kill the market of stable coins that already exists. Cryptos should be allowed to exist, and I guess banning CBDCs isn't going to happen either. What's needed is oversight of centralized crypto services. Better regulations to monitor what the exchanges are doing, whether they are faking volumes or not, whether they are using the money of their customers for personal purposes or not. But, given how banks also go bankrupt sometimes, it's not the only thing that needs better oversight, and I repeat that the oversight should be not of what customers do but what the CEO and other key people of the company do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "January 26, 2023, 03:58:33 PM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issue, my concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? I don't think CBDCs will be able to solve the problem of stablecoins being listed by trading platforms. It would not be a problem if the activity of the platforms is monitored including enough safeguards about the coins of the projects that are listed on the platform. The biggest problem is that the activity of these platforms is hidden, and the authorities do not have sufficient information about the policies of managing each platform, and they cannot claim that without a legal requirement. This is what makes us not know anything about the breaches in the management of these platforms until they collapse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "January 26, 2023, 05:27:09 PM",
      "body": "CBDC stablecoin to replace the stablecoin on the Defi platform is what he means. It could work at least it won't be devalued like the UST. We already see the algorithmic stablecoin didn't work on many DEFI systems not just in LUNA. But there will be regulators that will require the teams to make it not a DEFI anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "January 26, 2023, 05:42:55 PM",
      "body": "Quote from: cabron on January 26, 2023, 05:27:09 PMCBDC stablecoin to replace the stablecoin on the Defi platform is what he means. It could work at least it won't be devalued like the UST. We already see the algorithmic stablecoin didn't work on many DEFI systems not just in LUNA. But there will be regulators that will require the teams to make it not a DEFI anymore.But why would you need CBDC knowing it works against you. I see no reason for a person to ever need a CBDC.Assuming you want fast payments, you can use your card or a phone app connected to your bank. If you're a fan of decentralization you'll choose a decentralized cryptocurrency. Not a fan of crypto, but want some anonymity - cash. CBDC is a spying version of bank payments with no real benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "January 26, 2023, 09:32:17 PM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMYou as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? I'm yet to see the benefit of CBDC at the moment. It is a centralised system that is not free from government interference and manipulation. Well if it is a way to get some US Dollar in exchange like converting or outright sale in exchange for dollar, I would go for that but if not and if there are other alternatives then I will go for the next option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "January 26, 2023, 09:46:25 PM",
      "body": "The untold truth is that traditional banking institutions work the same way FTX did but with slightly less corruption. Banks do not hold cash -- if every single client at a local bank withdrew the digital balance they have on their accounts at once, the bank would run into the same liquidity issue FTX did. I suppose it would be possible for CBDC's to create new digital tokens if there was a problem with liquidity but the central banks already have the power to control the money supply anyways and most of it's digital. It's not as if they're physically printing cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "January 27, 2023, 02:31:57 AM",
      "body": "It depends on the CBDC regulation itself, does the government will have a reserve funds as an insurance for their CBDC? if CBDC regulation is same with fiat, well CBDC is better than the other centralized stable coin then. There's no reason to hold less and unregulated centralized stable coin since there's no any benefit and advantage than CBDC.After all any centralized stable coin is controlled by the developer, they can be frozen in your non custodial wallet, the smart contract can be hacked, the price will stick with real fiat price. But unregulated and less regulated stable coin can't offer any insurance, while CBDC they can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "January 27, 2023, 04:30:48 AM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issue, my concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? You as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? Scammers will always find a way to conduct their operations regardless of the regulations which are in place so no one can stop another fraud like FTX from happening again.And CBDCs are not going to be a solution either, after all tell me are fiat currencies backed by anything? Do you think CBDCs will be backed by anything? Just as a reminder the only fiat currencies which have not crashed to zero are the ones currently in use by governments, every single other fiat currency which ever existed is worth zero as a currency and at most they have value as a museum item, compare this to gold which has kept its purchasing power for thousands of years and the difference between the two should be obvious, so if I were given the chance to use CBDCs I will refuse as I am not interested on using an even worse version of fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "January 27, 2023, 04:39:29 AM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issue, my concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? I don't see any government can stop what happened to FTX, as you have said, it's not regulated, no one has control.CBDC and stable coins are very different, they have their own uses, obviously CBDC is going to be used by government so I don't think we can correlate it to stable coins or any other crypto in general.Quote from: Z390 on January 26, 2023, 09:40:35 AMYou as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? I will only used it if there are no choices, like government mandated their people to used CBDC to transaction with them.And I doubt that there are exchanges willing to store CBDC or work with governments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "January 27, 2023, 02:35:18 PM",
      "body": "Quote from: zasad@ on January 26, 2023, 12:43:40 PMEven in Africa, people understand that CBDC is complete crap. If you haven't read the news then run the request: CBDCS FAILING IN NIGERIA.CBDC is a complete total control over the population, so a decentralized cryptocurrency will be the only way to prevent the implementation of CBDC. Relatedly, thanks to CBDC, people are starting to use cryptocurrencies.Some people may not like CBDCs, especially when governments use them as a means to spy on their finances. They will have no other choice but to accept them, if they want to participate in the mainstream economy. Governments could easily force the use of CBDCs by eliminating paper money for good. For people who don't have Internet or access to a smartphone or PC, governments will find a way to get them to use the new digital cash system. The number of countries using CBDCs may be small, but that's bound to change in the future as the world shifts to the digital era. I think CBDCs will eventually replace stablecoins, as they serve nearly the exact same purpose. The only difference is that CBDCs will be backed by mainstream governments, while stablecoins will be backed by a private entity. People will trust CBDCs more than stablecoins just because it's backed by the government. Expect further scrutiny into stablecoins, after the downfall of UST. At least, decentralized cryptocurrencies (eg: Bitcoin, Ethereum) won't be going anywhere. Just my opinion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "January 27, 2023, 05:06:25 PM",
      "body": "Maybe only partially fixed. Total stable coin caps (including fake reserves) are not always traded on regulated exchanges. They also added a lot to almost all DEXs as they purposely added support for some of the most used crypto networks.While CBDC is not a single fiat that can only be made on one network basis. Some say CBDC is not crypto at all, so it is clear that this type of currency is actually not compatible with the crypto space industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "January 27, 2023, 06:06:55 PM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issueFTX is a centralized entity, surely government or authority regulation will be able to touch it. It will take time, it is known that regulation tends to lag behind technological progress. The recent fiasco gives the public the awareness of how crazy crypto has become. Governments also will take their part to \"protect\" the citizen, so that kinds of issues will be minimized in the foreseeable future.Quote from: Z390 on January 26, 2023, 09:40:35 AMmy concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? In order for CBDC acts as a stablecoin, it requires to exist within the currently existing network, which is not fully centralized. That is a big no from the government and bankers' standpoint, there is no reason for them to build a platform without their control. The term itself defines it is an central bank currency, so by creating a token on cryptocurrency coin, there isn't any \"centralization\" at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "January 27, 2023, 08:59:14 PM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issue, They can never make sure that it won't happen again. Because if they can, then they were able to stop the new projects scamming people because in the past there were tons of them and they're able to reach out and chase the cons and owners of those projects and even the endorsers of those projects.Quote from: Z390 on January 26, 2023, 09:40:35 AMmy concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? You as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? You can't be sure with it and there will be arguments that where these CBDCs will be made off? Just like the fiat money where aside from being made through gold reserves, we know that they can just print it out of thin air.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitgolden",
      "created_time": "January 27, 2023, 09:08:29 PM",
      "body": "Quote from: Abiky on January 27, 2023, 02:35:18 PMSome people may not like CBDCs, especially when governments use them as a means to spy on their finances. They will have no other choice but to accept them, if they want to participate in the mainstream economy. Governments could easily force the use of CBDCs by eliminating paper money for good. For people who don't have Internet or access to a smartphone or PC, governments will find a way to get them to use the new digital cash system. The number of countries using CBDCs may be small, but that's bound to change in the future as the world shifts to the digital era. I think CBDCs will eventually replace stablecoins, as they serve nearly the exact same purpose. The only difference is that CBDCs will be backed by mainstream governments, while stablecoins will be backed by a private entity. People will trust CBDCs more than stablecoins just because it's backed by the government. Expect further scrutiny into stablecoins, after the downfall of UST. At least, decentralized cryptocurrencies (eg: Bitcoin, Ethereum) won't be going anywhere. Just my opinion That won't happen, there is no way they would get rid of cash, paper money will stay as long as possible. I mean we could get rid of them even right now, even the oldest people can use credit cards and banks, and yet we still have cash and we still use it. Why do we use them? Because we are talking about something much easier with the amount of work required to use, it's a lot better.I am not saying that it's the best method, but it's a method that we can't get rid of just yet, and if we ever did, debit/credit cards would be something a lot more used than CBDC. The only reason they are making this is the fact that they will give you something fake, and take your money, that's all they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 28, 2023, 11:53:59 PM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issue, More oversight. More forced transparency from exchanges. This is just a matter of time and will happen in a whole different scale. Only thing prevented it happening until now was lack of interested to fund manpower for it.Quote from: Z390 on January 26, 2023, 09:40:35 AMmy concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? You as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? This is whole another issue. Would i like to use isn't really the issue. When CBDC takes over fully, there's no other option to transfer fiat money. Or if there is, it will be so much more unreliable, slow and expensive compared to it. Like writing checks compered to current system. When CBDC comes. It isn't really up to you if you want to adopt it. You will. Just like you did wireless transactions and visa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "January 29, 2023, 12:14:34 AM",
      "body": "Quote from: Z390 on January 26, 2023, 09:40:35 AMHow can the government make sure that something like FTX (cooperate finance enriching themselves) never happened again? Crypto is presently not regulated and I don't see how regulation will fix this issue, my concern is the CBDC, I think it will work better as the real Stable coin, unlike Luna UST that team claimed was back by dollar but was not backed by anything... Wouldn't CBDC fixed this issue of fake USD backed stable coins? You as a crypto adopter would you like to use CBDC if the pairs are available on all crypto exchanges as a way to store yourself some digital US Dollar? Even with regulation, it is not possible to prevent collapses and scams like FTX. The government cannot prevent their internal corruption, how can they guarantee other things? If you can't accept such collapse then you should not enter this market, you want to make high profit without taking risks then cryptocurrency is not for you. The only difference between CBDC and stablecoin is the issuer, CBDC is issued by the government while stablecoin is issued by private companies. But it's all centralized, so it doesn't matter which one to use because everyone here invests in bitcoin, and altcoins, no one hold stable coins for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}