{
  "id": "topic_5527104",
  "title": "BobsSocks",
  "author": "BobsSocks",
  "created_time": "January 20, 2025, 04:02:24 PM",
  "content": "This is a reboot of an old thread. It was suggested that I began a new one since the old one was more that 120 days old. I have decided to do so because whilst the general subject remains the same the claims from the company have shifted and now they are apparently testing their unproven technology on someone else's property.https://www.ft.com/content/5acb33a2-4690-4f56-add3-7e2b01530a21Background...https://quantumblockchaintechnologies.co.uk/images/QBT_-_Method_C_Hardware_Implementation_Oct_24_-_final.pdfhttps://quantumblockchaintechnologies.co.uk/images/QBT_-_Oracle_Patent_Application_15_Jan_25.pdfhttps://quantumblockchaintechnologies.co.uk/images/QBT_-_Method_C_Update_17_Jan_25.pdfAdditional...https://www.youtube.com/watch?v=uXoDWjrUSZA&list=PLnk_WM-WosgUhmpXsNtITda4VMwAPPe92They suggest that they have implemented an Oracle that decides whether or not a prospective solution to the latest block should be hashed or thrown away. They suggest that their Oracle can throw away 30% of the prospective solutions in order to improve mining performance. They say that they are mining on a pool. Not Bitcoin but Satoshi.It is my assumption that since they claim to be mining Satoshi they are not in fact mining anything but rather reporting a hash rate to the pool and claiming a share of the members rewards for contributing some hashrate.If I understand how pools are meant to work then it is a matter of trust that if a member is asked to mine a particular range they will mine that range and not throw away guesses because they think their new fangled and unproven anti-guessing machine knows better. Without such proof it may be throwing away valid guesses and denying the pool and its members the opportunity to mine a block.I consider such behaviour to be both arrogant and fraudulent.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5527104",
  "comments": [
    {
      "author": "ABCbits",
      "created_time": "January 21, 2025, 09:15:46 AM",
      "body": "It sounds like they throw lots of buzzwords, since SHA-256 have Avalanche Effect where makes it impossible to find pattern between input and hashed output. I don't expect it'll be another AsicBoost.Quote from: B-BossMan on January 21, 2025, 08:45:41 AMQuote from: vera123 on January 21, 2025, 08:17:16 AM--snip--Stop using AI to generate your thread comments, it will lead you to many problems in this forum, however anything you don't have an idea of just go for more research and study them very well and also read the superiors good and quality comments to acquire some knowledge.Please stop quoting post that contain SEO spam link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}