{
  "id": "topic_5452617",
  "title": "ShafixNero",
  "author": "ShafixNero",
  "created_time": "May 13, 2023, 03:08:03 PM",
  "content": "I was checking my wallet in tronscan and i noticed that my usdt was sent to an inactivated address.Can i recover it? I didn't approve any transaction. Thanks in advance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452617",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 13, 2023, 03:19:06 PM",
      "body": "What do you mean by \"inactivated address\"? Do you mean a wallet address that you don't personally own?Also, if you didn't approve any transaction, it might be the fact that your wallet got hacked. Hopefully it's not a lot — because the chances of you getting your money back is next to zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "May 13, 2023, 03:30:39 PM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PM<...>First of all, if your transaction has been confirmed on the network (and I assume it has), then you cannot recover it anymore.Secondly, if you didn't authorize the transaction, then either your system is compromised (you have some sort of trojan or spyware on your computer) or your private key is compromised (someone else has access to it). I suggest that you create a new wallet on a clean system as soon as possible and transfer all remaining funds to the new address. Finally, just because the funds are unspent at the destination address doesn't mean that the address is inactive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 13, 2023, 03:40:08 PM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PMI was checking my wallet in tronscan and i noticed that my usdt was sent to an inactivated address.Can i recover it? I didn't approve any transaction. Thanks in advance.Dear OP, in rush, you didn't provide the full details of incident, but as per my understanding of your situation i think your assets are sent to a wallet which you can't access means of which you have no key to open that wallet and make that transaction back to your own personal address. So  No  you can't get those assets back until you ask the owner of wallet that received that address and he could sent it back to yours but it highly unlikely to get those assets back. If i get your concerns wrong then help me out with more info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 13, 2023, 04:19:57 PM",
      "body": "What wallet exactly you are using?If the wallet you talking about is from exchange like Binance then all deposit BTC/altcoin is automatically transfer to other addresses that they own that's normal but your balance in your exchange account still there.Better add more details about your wallet and transaction so that we know what exactly happen to your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 13, 2023, 04:26:25 PMLast edit: May 13, 2023, 07:57:54 PM by hosseinimr93",
      "body": "What wallet did you send the tokens to?What do you mean by being inactive? Do you mean you can't spend the tokens you received? I guess you are using a non-custodial wallet and you can't spend the tokens due to not having TRON in your wallet. If that's the case, all you need is to deposit TRON to your address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "May 13, 2023, 04:33:40 PM",
      "body": "First of all Blockchain transections can't be recovered if you have not the access of the receiver Address. You said you sent your funds  to an inactive address so if you put wrong address and then send it now there is no chance to get your funds. You again said that you didn't approve any transection which means someone have access of your wallet. So your wallet maybe hacked. At this moment if you have been hacked you should transfer your assets to another wallet asap. And kindly don't post here with less information. If you provide detailed information with transection hash users may help you with the proper advise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 13, 2023, 04:35:19 PM",
      "body": "Quote from: hosseinimr93 on May 13, 2023, 04:26:25 PMWhat do you mean by being inactive? Do you mean you can't spend the tokens you received? Inactivated address or wallet is not a correct term written by OP and nobody understands what is OP's problem.First possible issue is OP sent USDT to an old receiving address on his exchange account. It can fall into two possible cases: That is a change address but still belongs to a same wallet for his account. Or it is a new receiving address in a new wallet because of latest upgrade from that exchange just like Binance did weeks ago. The first case is fine, money will not be lost. The second case is risky and OP might lose his money and must open a support ticket to resolve it.QuoteI guess you are using a non-custodial wallet and you can't spend the tokens due to not having TRON in your wallet. If that's the case, all you need is to deposit TRON to your address. Possibly.If it is OP case, OP must understand about a blockchain, its native currency and tokens on it.A native currency is needed to use as transaction fee on one blockchain, for any transaction like that native currency transaction or any token on that blockchain.TRON is a native currency on TRON network and it is used for transaction fee on that network. USDT TRC-20 is a token on TRON Network and USDT TRC-20 transaction will have to pay fee in TRON.Same for BNB and BEP-20 tokens, ETH and ERC-20 tokens. Bitcoin and BRC-20 tokens (like Ordinals).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "May 13, 2023, 04:40:32 PM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PMI was checking my wallet in tronscan and i noticed that my usdt was sent to an inactivated address.Can i recover it? I didn't approve any transaction. Thanks in advance.OP, you'll have to be patient for a moment to be able to answer a few questions about your problem since you didn't mention any details here instead of leaving your thread with a few unanswered questions. I think you should be active enough to answer anyone when you need answers to your problems, but only if the problems are real.If this is a really serious problems for you, then answer as soon as possible after you get back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "May 13, 2023, 07:56:50 PM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PMI was checking my wallet in tronscan and i noticed that my usdt was sent to an inactivated address.Can i recover it? I didn't approve any transaction. Thanks in advance.I would guess that with \"inactivated address\" you mean an address that you did not actively send your tokens to, but still your tokens where somehow sent to that address and are now not on your wallet anymore. If that is true, then there is nothing that you can do to get your USDT back i am afraid. The transaction was approved on the blockchain and there is no way to revert that.If you did not send that transaction yourself, than this also means that someone probably has access to your wallet, which is a very serious issue. Which wallet or application were you using? To which platforms did you connect your wallet? Check that and delete all the connections of your metamask or whatever wallet you are using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "May 13, 2023, 09:33:37 PM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PMI was checking my wallet in tronscan and i noticed that my usdt was sent to an inactivated address.Can i recover it? I didn't approve any transaction. Thanks in advance.Did you mean you send it to a wallet that is not yours? No, you can't recover it anyone, crypto transaction is irreversible.If you didn't approve that transaction, so maybe your PC or Laptop has malware on it that steals your password and other information that pertains to your crypto. So it's better to check everything out. Or the best thing to do is to move up all your crypto (if you still have them), and format your PC or your Laptop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 13, 2023, 09:39:19 PM",
      "body": "How did it happen that it was automatically sent to that address? Whether active or nonactive, it's still not going to happen if someone didn't have access to your USDT. To answer if you can still recover it, sorry to say but that's a no. You can no longer take it back unless the perpetrator sends it back to you. Transactions in crypto are irreversible and that's why even if you badly want that to happen, no can do. Review your activity, maybe you've input your private keys on some sort of form or you did approve a contract from your wallet or so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "May 13, 2023, 11:20:41 PM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PMI was checking my wallet in tronscan and i noticed that my usdt was sent to an inactivated address.Can i recover it? You can't but to be honest if you shall also write all of details regarding your problem. This statement is also become opposite compared with your statements below. Quote from: ShafixNero on May 13, 2023, 03:08:03 PMI didn't approve any transaction. Thanks in advance.It doesn't even make sense to see that you said like that and why? You have claimed that if you were not approving any transaction but your USDT already sent to the inactive wallet. If your money already sent to the another address and that means if you have been approving at least a single transaction. It's caused by your USD has been delivered to another address. Since you said that your transction already sent to the inactive address and im sorry for your lost. You won't able to get it back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "May 14, 2023, 10:18:35 AM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PMCan i recover it? Sure, you do.What you need to \"recover\" it or simply to use it, is to activate your address. You can activate it by simply sending TRX, make sure you send some extra excess amount as it is also required for the gas fee. Just send the coin to the address you have sent the USDT to, as soon it is confirmed, you can then use the address(account) immediately.The address activation fee is ranging from 0.1 to 1 TRX depending on the sender account. See also the referred link below for further information.Quote from: tranthidung on May 13, 2023, 04:35:19 PMQuote from: hosseinimr93 on May 13, 2023, 04:26:25 PMWhat do you mean by being inactive? Do you mean you can't spend the tokens you received? Inactivated address or wallet is not a correct term written by OP and nobody understands what is OP's problem.The address is not activated or inactivated (account) address is a known newcomer problem in the Tron ecosystem. Tron protocol requires you to activate the address before you are able to use it or search it on the blockchain. See https://developers.tron.network/docs/account#account-activation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShafixNero",
      "created_time": "May 19, 2023, 05:49:20 PM",
      "body": "Quote from: vv181 on May 14, 2023, 10:18:35 AMQuote from: ShafixNero on May 13, 2023, 03:08:03 PMSure, you do.What you need to \"recover\" it or simply to use it, is to activate your address. You can activate it by simply sending TRX, make sure you send some extra excess amount as it is also required for the gas fee. Just send the coin to the address you have sent the USDT to, as soon it is confirmed, you can then use the address(account) immediately.The address activation fee is ranging from 0.1 to 1 TRX depending on the sender account. See also the referred link below for further information.The address is not activated or inactivated (account) address is a known newcomer problem in the Tron ecosystem. Tron protocol requires you to activate the address before you are able to use it or search it on the blockchain. See https://developers.tron.network/docs/account#account-activation.Yes, that is my problem. I couldn't fully understand the process. It would mean a lot if you could explain it more specifically. I sent few TRX to that address(It doesn't show inactivated address anymore) but how can I change my current address to the new address in my wallet or use it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "May 20, 2023, 02:11:14 AM",
      "body": "Quote from: ShafixNero on May 19, 2023, 05:49:20 PMQuote from: vv181 on May 14, 2023, 10:18:35 AMSure, you do.What you need to \"recover\" it or simply to use it, is to activate your address. You can activate it by simply sending TRX, make sure you send some extra excess amount as it is also required for the gas fee. Just send the coin to the address you have sent the USDT to, as soon it is confirmed, you can then use the address(account) immediately.The address activation fee is ranging from 0.1 to 1 TRX depending on the sender account. See also the referred link below for further information.The address is not activated or inactivated (account) address is a known newcomer problem in the Tron ecosystem. Tron protocol requires you to activate the address before you are able to use it or search it on the blockchain. See https://developers.tron.network/docs/account#account-activation.Yes, that is my problem. I couldn't fully understand the process. It would mean a lot if you could explain it more specifically. I sent few TRX to that address(It doesn't show inactivated address anymore) but how can I change my current address to the new address in my wallet or use it?If you already activated the wallet, then you can simply just use the wallet. What are your goals actually? Do you want to store it or what? And also, what wallet did you use?If your only goal is to recover it, by activating the wallet, you can already move the funds or do anything with it. But if you want to move it to another address, then you must repeat the process. Create a new address/account(wallet), activate it, send the funds from your former wallet into this one, and then it is complete. Any reason why you want to change the address and not use the wallet that you have recently activated?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "May 20, 2023, 10:28:45 AM",
      "body": "Quote from: ShafixNero on May 13, 2023, 03:08:03 PMI was checking my wallet in tronscan and i noticed that my usdt was sent to an inactivated address.Can i recover it? I didn't approve any transaction. Thanks in advance.The information you provided here is very incomplete and it is hard for anyone to understand and then resolve your problem.The best thing you can do is to give the tx code of the transaction through which we can see your USDT was send to which inactivated address ? By inactive address, you mean that the address that does not belong to you ?Also note that if the transaction is confirmed, you won't be able to recover your USDT if it is send to any wrong address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "merekamo",
      "created_time": "May 24, 2023, 01:23:52 AM",
      "body": "What do you mean that your TRONSCAN address has not been used in crypto transactions for a long time? Regardless, it is unlikely that you will be able to recover your funds. Actually on the Tronscan support page it says that transactions on the blockchain are irreversible, and lost funds in such a case may be irreversible. So, always check to double check the address and transaction details before making any transfer to avoid such situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}