{
  "id": "topic_5430187",
  "title": "gx-",
  "author": "gx-",
  "created_time": "December 19, 2022, 03:49:04 PM",
  "content": "Selling this Ethereum casino website, fully made by me from scratch. It comes with the games limbo, mines, dice and coinflip- and is completely provably fair. The main development stack for this build is mongo, express, nuxt and node. The transactions go through web3.js and uses alchemy's node for scanning the mempool. Backend-to-frontend communication is done with websockets. The ui is not the best there is, but if you ever want to change it I will be able to assist you throughout that process. Purchase includes source code for both the casino and admin panel, database access, and help setting up the hosting. If you want the casino to have a different name and/or logo, then I'll change that for free. It's not white-labelled like most other site's being sold. It's solely owned by me and made from scratch. Preview: https://www.youtube.com/watch?v=h2qmp_9yKjk https://www.youtube.com/watch?v=XSagxPw84i8-The Bin is set at $3000, accepting offers.To inquire or purchase, message me onsite or on discord (gx#8888).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430187",
  "comments": [
    {
      "author": "fennic",
      "created_time": "December 31, 2022, 07:45:58 AM",
      "body": "Quote from: gx- on December 19, 2022, 03:49:04 PMSelling this Ethereum casino website, fully made by me from scratch. It comes with the games limbo, mines, dice and coinflip- and is completely provably fair. The main development stack for this build is mongo, express, nuxt and node. The transactions go through web3.js and uses alchemy's node for scanning the mempool. Backend-to-frontend communication is done with websockets. The ui is not the best there is, but if you ever want to change it I will be able to assist you throughout that process. Purchase includes source code for both the casino and admin panel, database access, and help setting up the hosting. If you want the casino to have a different name and/or logo, then I'll change that for free. It's not white-labelled like most other site's being sold. It's solely owned by me and made from scratch. Preview: https://www.youtube.com/watch?v=h2qmp_9yKjk https://www.youtube.com/watch?v=XSagxPw84i8-The Bin is set at $3000, accepting offers.To inquire or purchase, message me onsite or on discord (gx#8888).Bro there are things in which someone might buy from you and there are described below 👇 as followed. 1. Senior Member+ RankYou are newbie, that's why no one night deal with you. I have seen that a member that is A senior member rank people trust them. Cause they have made reputation. So work hard and in this wasy you might be able to do something good with this forum. EScrew DealOtherwise you can escrow deal with legendary members that do this task and they get some fee. In this way you might be safe and also other user might also he safe. So just do just and will be in god hands",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}