{
  "id": "topic_5449930",
  "title": "hasgeryar",
  "author": "hasgeryar",
  "created_time": "April 23, 2023, 11:05:35 PM",
  "content": "3 sene önce büyük crypto twitter hesapları hacklenmiş ve birisi tutuklanmıştı.An itibariyle Kucoin twitter hesabı yine sahte BTC gönderim tivitieriyle hacklenmiş görünüyor.https://twitter.com/kucoincom/status/1650259727652143105https://twitter.com/kucoincom/status/1650267200005996544En büyük borsalardan birisi nasıl twitter hesabını koruyamaz anlamıyorum.Tivitır'ın içinden mi yoksa borsa çalışanlarının sorumsuzluğundan mı bilinmez ama şimdilik diğer kripto hesaplarında bir sorun yok gibi gözüküyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449930",
  "comments": [
    {
      "author": "mandown",
      "created_time": "April 24, 2023, 09:42:24 AM",
      "body": "Kaç yıl geçti hala bu durumlarda millet para yolluyor kim kime bedava para verir. Bazen dolandırıcıya hak vermiyor değilim aslında adam kötü niyetliyi dolandırıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "April 24, 2023, 10:23:36 AM",
      "body": "Dolandırıcıları da bazen anlayamıyorum. Zor olanı yapıp Twitter hesabına erişim sağlıyorlar, hackliyorlar. Ama vizyon sıfır bak öneriye Btc ve Eth dağıtacakmış. Yahu artık herkes kripto paralardan dolandırıldığına defalarca şahit oldu. Hala bu duruma inanan var mı? Bu sadece KuCoin değil, diğer dünya borsaları için de geçerli. Hangi borsa bedavaya Bitcoin ve Ethereum dağıtır? Thodex, Vebitcoin gibi Türk borsalarında yapılır sadece diyordum ki KuCoin bile dolandırıcıların mekanı oldu. Şimdi bundan kim sorumlu olacak Twitter mi, KuCoin mi? Bana göre hatanın kaynağını araştırmaları lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "April 26, 2023, 02:41:31 AM",
      "body": "içeriden birisi yapmış olabilir, ne bileyim kucoin'den kovulduğu için borsaya düşmanlık besleyen eski bir çalışan yapmış olabilir, harbiden kepi kaptırmış olabilirler, her şey olabilir ama sonuç olarak bence çok önemli bir şey değil. twitter duruma müdahale eder ve her şey normale döner. önemli olan borsanın güvenliği, borsa hacklenmesin de ne olursa olsun; diyeceğim ama bunlar geçen sene o konuda da kepi kaptırdılar. :) yani sonuç olarak merkezi borsalardan fazla bir şey beklememek gerekiyor. onları işimize geldiği kadar kullanmalıyız ve işimize geldikleri ölçüde değerli görmeliyiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}