{
  "id": "topic_5424043",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "November 29, 2022, 08:35:29 AM",
  "content": "QuoteAustralia has long upheld some of the strictest game rating classifications on the planet, though a new bill just filed in Parliament will impose further restrictions on games with loot boxes. As reported by Games Industry.biz, the new legislation will amend the strict Australian Classification Board guidelines further, labeling any game with loot boxes to be R18+, Australia's equivalent to the ESRB \"Mature\" rating. Furthermore, games with loot boxes may be denied classification entirely, which would effectively ban the game from sale in Australia.https://www.msn.com/en-us/news/technology/australian-government-files-bill-to-limit-loot-boxes/ar-AA14ERy9....I have seen my nephew buy lootboxes in call of duty mobile in the USA. Didn't they ban those or make the illegal here? It seems as if their use remains active with minors.Australia appears to be pursuing an R18 distinction for game loot boxes. Which, I'm not certain will do much to prevent minors from purchasing them. It will however give australian regulators the power to ban select games from ever being released, which I'm not certain is a capability they had prior to the bill being introduced. Can age based content ratings like ESRB or R18+ do anything to limit lootboxes in a legitimate capacity? AFAIK they're similar to PG-13 or R ratings for films. The guidelines are very broad and tend to not be enforced. Perhaps it is simply not feasible to do much to regulate lootboxes given current formats and internet protocols?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424043",
  "comments": [
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 29, 2022, 11:09:16 AM",
      "body": "I am curious to know the effect buying loot boxes from games have on minors, not like they steal money to buy this loot boxes or use monies that they are supposed to use.I read the article shared on the op, it's very short and does not explain or put down details of why the Australian government decided to ban this, any body with more information on this should please share.It wont make sense concluding that the move is a bad one when we don't know the reason why they choose to take such action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "November 29, 2022, 02:46:04 PM",
      "body": "Quote from: Hydrogen on November 29, 2022, 08:35:29 AMCan age based content ratings like ESRB or R18+ do anything to limit lootboxes in a legitimate capacity? AFAIK they're similar to PG-13 or R ratings for films. The guidelines are very broad and tend to not be enforced. Perhaps it is simply not feasible to do much to regulate lootboxes given current formats and internet protocols? I doubt that they will completely eliminate minors from participating into games with loot boxes, same as some minors who visit casino websites (and even porn websites lol). But the fact that there is an ongoing bill with their Senate, I guess that this will give some companies the initiative to be more stringent with their games.Again, while this move will not completely eliminate minors from purchasing loot boxes, this will actually lessen them in doing so. I just hope that the bill comes into fruition and becomes a self-executory law. This kind of move is what most countries should implement and create as well for the safety and well-being of minors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}