{
  "id": "topic_5425961",
  "title": "Dr.Bitcoin_Strange",
  "author": "Dr.Bitcoin_Strange",
  "created_time": "December 06, 2022, 10:29:10 AMLast edit: December 31, 2022, 09:36:44 AM by Dr.Bitcoin_Strange",
  "content": "hello Bitcoiners, I'm happy today because today marked one month since I started accepting Bitcoin payments in my company. I decided to accept Bitcoin as a means of payment because it is fast and secure, unlike the frequent delays and errors with fiat and banks. Few of my customers were really impressed with the new development when I first started last month, but since then I have had more than 13 customers paying me with Bitcoin and stable coins ( USDT ). I feel more safe using Bitcoin in my business because it eases the stress of holding a lot more cash, there is no more SMS notification and charge from the bank for payment, and no one has to know about my bank balance by spying on my phone. There is no monthly charge of any kind for Bitcoin transactions, unlike with the banks.Knowing that the Bitcoin payment I receive from customers is not an investment but rather my business capital, what I do after receiving payment in bitcoin is convert my capital to  a stable coin USDT and leave my profit in bitcoin. I do this to avoid running a loss in my business. If I decide to hold the whole bitcoin and, peradventure, the Bitcoin price drops, I might not have my exact capital any time I want to buy more goods. I wish to ask if this is the right approach I should take given that we are still in a bear market.Steps I took: First, I browsed online about accepting Bitcoin payments. Then, I was able to get a picture, so I decided to print the picture on an A4 sheet of paper, and then I displayed the printed picture on the front gate of my shop. I also created a fresh wallet on the Trust Wallet app to be used. I decided to use a trust wallet because I just felt that since I was not holding the bitcoin for investment purposes, I should just use trust wallet to receive my payment. Dealer on all kinds of furniture works.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425961",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "December 06, 2022, 11:43:21 AM",
      "body": "I congratulate you on your decision to accept Bitcoin as a means of payment, because it is desirable for every business to have as many payment options as possible, which means that you have a greater chance that the customer will decide to come to your store. I would suggest one more, in my opinion, very smart business decision if you can afford it considering your costs - and that is to enable an additional discount (perhaps 5-10%) for those who pay in Bitcoin, and this can motivate some potential customers to decide on that method of payment.As for what would be best in relation to whether you want to save part of the profit in Bitcoin, I think that as a business person you always need liquidity, but you could invest a part of each sale in Bitcoin as a long-term investment. It doesn't have to be a lot, maybe 10-20% if you think it can help you in the future.In order to attract more customers, perhaps you should invest in additional advertising, whether it is paid advertisements on the radio station, or smaller billboards in front of the store.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 06, 2022, 12:12:44 PM",
      "body": "Congrats for this achievement,  it is little steps like this that will help promote btc to a more larger audience. I think you made a good decision to always convert your capital to stablecoins in other to keep the business running. Keeping your profit in btc is a good idea that way, when the market bull period comes in, your profit will be more.You have done yourself well by choosing to accept btc in your business, no more fiat drama unnecessary charges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 06, 2022, 12:20:27 PM",
      "body": "Very good decision and also a good strategy to just keep the earnings in bitcoin. You can convert always more money to bitcoin in an upwards market again. Please don’t make the mistake to not accept Bitcoin anymore if it is not used for some time. The bitcoin space needs dealers like you that get people interested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 06, 2022, 12:34:13 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 06, 2022, 10:29:10 AMhello Bitcoiners, I'm happy today because today marked one month since I started accepting Bitcoin payments in my company. I decided to accept Bitcoin as a means of payment because it is fast and secure, unlike the frequent delays and errors with fiat and banks. Few of my customers were really impressed with the new development when I first started last month, but since then I have had more than 13 customers paying me with Bitcoin and stable coins (USDT). Congratulations on your accomplishment and decision to work with bitcoin.This looks a nice start  13 customers in third days is nearly one every 2 days.How do you handle the payments? One address for each customer?Do you use any payment processor, such as btcpayserver.org?Do you handle technical stuff by yourself?maybe in the future, as your company grows,  you might need a payment processor. Specially if there is a website for online customers and purchases",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 06, 2022, 12:46:06 PM",
      "body": "That is a very nice step taking by your company. One of the major thing in this cryptocurrency (bitcoin) world is the individual adoption or acceptance of bitcoin in small shops or retail businesses so that it will be more popular, as for now I can't make a transfer of bitcoin to another person as p2p because I have not seen any other person that is doing it in my locality. Congratulations for you accepting Bitcoin in your office.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "December 06, 2022, 01:01:36 PM",
      "body": "I think you are taking a bold and commendable step in your acceptance of bitcoin as a mode of payment in your business. This would contribute in its own little way to spread the word about bitcoin and create awareness about its existence and uses in your locality. It’s also great to hear that you’ve had business of about 13 people pay for your services with bitcoin. That shows your business is doing fine and more people as time goes by would be interested in knowing about and using bitcoin as a mode of payment. Perhaps you would like to give us more update as time goes by on how it’s going.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "December 06, 2022, 01:12:12 PM",
      "body": "This a welcome development. I have actually been on this movement for quite a long time and as God may have it, it has been fruitful and successful. I was able to on-board skilled and unskilled, mini-vendors and traders. It gives me joy to see that Bitcoin adoption is fast rising and gaining  attention it requires globally. If you check my profile you will some few of the vendors that accepts bitcoin in my locality which i thought and showed them how the system works. If as you have done this, you take it to your locality using yourself as a case study, believe me you, the turn up would be very encouraging and more business vendors would want to follow your step in accepting bitcoin as you have done and gradually, the spread will be like wide fire which would become uncontrollable. You have done well OP in accepting bitcoin as a means of payment. I believe your customers those that are yet to know about bitcoin would definitely ask you about it when they see it and this would also lead to more people on-board the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "December 06, 2022, 01:16:29 PM",
      "body": "Accepting Bitcoin payment is a good initiative to your business because its a plus,with this you will be free from fiat transaction challenges. I guess in your area,the people there are happy that you receive payment in BTC, for you to have thirteen customers that have paid in Bitcoin in one month, I will say its a crypto friendly place. You will make more profit since you are dealing on furnitures, the purchase of furniture is expensive in my country, your profit will be left in your wallet untouched and there will be no buying of bitcoin anymore. You are also helping in the adoption of bitcoin by people in your locality with this your action,I wish you the best in your business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "December 06, 2022, 01:20:45 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 06, 2022, 10:29:10 AMDr. What you are doing is a good step, it should be emulated by household furniture entrepreneurs in your area, I'm sure your idea will increase new users who want to get to know Bitcoin, they will see the ad you posted.Maybe, if you have other social media, such as: facebook, Twitter, newspapers and so on maybe you can also post open advertisements, that you accept Bitcoin payments, for those who want to buy furniture such as sofas, dining tables, guest chairs etc.I'm happy to see entrepreneurs like you make payment methods with digital currencies like Bitcoin, I wish you a good and successful start for your business and also Bitcoin transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "December 06, 2022, 01:34:46 PM",
      "body": "Man, that's a lot of customers in such a short time -- they come and ask because of your Bitcoin sign or you talk to them about it? Because that's some amazing numbers, no other way to describe it, considering you're not advertising digitally for a digital payment method.Curious to know where, if you can share? -- because reading about delays in bank confirmations and needing to wait for SMS to confirm settlement, feels like it's a bit behind in fintech.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "glendall",
      "created_time": "December 06, 2022, 02:18:34 PM",
      "body": "congratulations to you, a very good innovation in the payment system, especially in your environment you already understand what bitcoin is, so it's no longer difficult for you to explain what bitcoin is, right?next you have to do online marketing so that your business can be known by all levels. I'm sure there will be many consumers who come from online because the payment system that you offer is easier and more practical,By the way, what country do you live in?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 06, 2022, 02:52:21 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 06, 2022, 10:29:10 AMKnowing that the Bitcoin payment I receive from customers is not an investment but rather my business capital, what I do after receiving payment in bitcoin is convert my capital to a stable coin and leave my profit in bitcoin. I do this to avoid running a loss in my business. If I decide to hold the whole bitcoin and, peradventure, the Bitcoin price drops, I might not have my exact capital any time I want to buy more goods. I wish to ask if this is the right approach I should take given that we are still in a bear market.Converting your business capital to stable coin is a smart move because of the volatility of bitcoin but you ensure you don't keep those funds in exchanges for a long time. This is because centralized exchanges cannot be trusted. Hopefully in the nearest future bitcoin would grow to the a level were it would be stable enough for business transactions. You have also choose the right path of hodling your profit in bitcoin because in the nearest future your investment would become very profitable. Hopefully these thirteen customers would spread the news of your alternative payments and more clients would be attracted. If bitcoin is not restricted in your country like mine, you can engage in more advertisement using affordable channels, hopefully more people might have the privilege of knowing about bitcoin. Happy One Month Anniversary, Mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "December 06, 2022, 03:10:37 PM",
      "body": "Bitcoin acceptance in making payments is one of the best decisions you can make currently with your handling of business because more people are getting used to bitcoin adoption as it increases across the globe, this is get you more attractive to the bitcoin customers within your country to have a patronage to your service and product and tou could wave away the difficulty to making fiat payment with network challenges or barrier with bulkiness in case you don't like it, enjoy the fastest and reliable means to making payments with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "December 06, 2022, 03:55:30 PM",
      "body": "It is very easy to accept Bitcoin payments as primary payments when the Regulations allow bitcoins for legal tender.As you did today, it is certainly a great start to introduce the digital currency Bitcoin. This is a small adoption made in your furniture business, a good step that has a positive effect on the future of Bitcoin in your environment.But not only accepting bitcoin payments, you even need a bitcoin payment platform that is easier and faster than having to use a wallet from a trust-wallet that doesn't support Lightning Network Bitcoin.The use of the Lightning Bitcoin network will be more recommended for fast payments and cheaper transaction fees and can make small transactions, you should study it.Many wallets support the Lightning Bitcoin Network such as Blue Wallet which is the recommended wallet for the Lightning Network Bitcoins.Good luck in your endeavors and learn more about the Lightning Networkhttps://cointelegraph.com/tags/lightning-network",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "December 06, 2022, 04:31:42 PM",
      "body": "Do I get it correct - one of the reasons you have started accepting Bitcoin, because you did not want anyone to \"know about my bank balance by spying on my phone.\" ? First of all, how is it possible to spy your bank balance? How do you make your trades? And isnt all the transactions in blockchain are transparent, so a person that has ever paid you in BTC, can always spy on you BTC balance ? Seems that you did not win much in that area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "December 06, 2022, 04:57:37 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 06, 2022, 10:29:10 AMhello Bitcoiners, I'm happy today because today marked one month since I started accepting Bitcoin payments in my company. I decided to accept Bitcoin as a means of payment because it is fast and secure, unlike the frequent delays and errors with fiat and banks. Few of my customers were really impressed with the new development when I first started last month, but since then I have had more than 13 customers paying me with Bitcoin and stable coins (USDT).Bitcoin and stablecoins are very different things. The key difference is that stablecoins are sem-centralized, their addresses and transactions can be frozen by the entity that controls the coin, just like with banks. So it's better to report their use separately.And may I ask, what is the percentage of Bitcoin payments among all payments that your business has received in that month? Because we have no idea if 13 is a lot for your business or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "December 06, 2022, 05:01:21 PM",
      "body": "Congratulations mate. You helped make Bitcoin a currency. I hope your business will continue to grow and that you will receive more Bitcoin payments in the near future. However, far from what you expect, Bitcoin transactions are traceable even if you create different addresses per payee. On the other hand, it helps government authorities in determining your sales and the intended tax. If you don't want to get tracked, maybe you use an exchange Bitcoin address. This way nobody has a clue how many Bitcoins you already received from your business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 06, 2022, 05:22:06 PM",
      "body": "Congratulations on this but one thing about the sign, you already seem to have a huge banner on the street at the entrance, wouldn't it is better to add a bitcoin sign there too? Cause it will help spread the word to people who just pass by your store, not just the ones that enter to make a purchase. Or, do you think it would attract way too much-unwanted attention there?QuoteKnowing that the Bitcoin payment I receive from customers is not an investment but rather my business capital, what I do after receiving payment in bitcoin is convert my capital to a stable coin and leave my profit in bitcoin. I do this to avoid running a loss in my business. If I decide to hold the whole bitcoin and, peradventure, the Bitcoin price drops, I might not have my exact capital any time I want to buy more goods. I wish to ask if this is the right approach I should take given that we are still in a bear market.But, with this you're again relying on a third party to exchange your bitcoins for the stable coins, you incur fees, and you risk having your accounts frozen, wouldn't be better to consider it an investment or either liquidate the sum you need directly via p2p for the expenses and keep a portion of coins as your profit rather than going for an intermediary (tether) that has no advantage? From my point of view I would simply liquidate 80-90% of the amount received, depending on what your profit take is and how much your running cost is, and keep the rest in BTC as an investment, be it even 1% or 3%. Moving it to a stablecoin that you might need to again convert to cash to pay your suppliers or other expenses seems to me like a useless step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "December 06, 2022, 05:36:59 PMLast edit: December 06, 2022, 05:51:42 PM by goldkingcoiner",
      "body": "congrats on your Bitcoin furniture selling business! I am sure you will be a big time furniture dealer with multiple stores in the near future! That being said, I recommend using a wallet like Electrum, if you are accepting Bitcoin. Its just a better and safer wallet than Trust Wallet. Especially if you plan on storing your Bitcoin for long amounts of time (in other words, hodling). The best option would be a hardware wallet, though. Thats the safest wallet.Since you accept Altcoins, you could even think about adding more payment options, since some of your customers might rather want to pay with SOL, for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}