{
  "id": "topic_5441162",
  "title": "Porfirii",
  "author": "Porfirii",
  "created_time": "February 25, 2023, 12:20:51 AM",
  "content": "Hace unas semanas leí que en el norte recomendaban esta página web (la del Subject, o sea, bitrefill.com). Había oído hablar de webs similares, como Purse.io, pero en su momento cuando les eché un vistazo me pareció que estaban muy orientadas hacia el mercado estadounidense y no cubrían bien nuestros países. Tendría que mirar a día de hoy a ver si ha cambiado o sigue igual, pero otro día.El caso es que mirando la web de bitrefill por encima he visto que tiene buena pinta, y me estoy planteando crear una cuenta. Así que si ya tienes cuenta en dicha web y quieres aprovechar, pásame el código de referral, que 5$ no son mucho pero menos da una piedra",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441162",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "February 25, 2023, 04:05:26 AM",
      "body": "Yo tengo cuenta, y creo que daría igual ponerla por aquí, porque no estoy identificado pero creo que mejor te la paso por privado. Eso sí, te recomiendo que bloquees el hilo, para que no te lleguen muchos más referidos a tu bandeja de entrada. Funciona bastante bien la verdad, rápido y seguro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 25, 2023, 09:25:41 AM",
      "body": "La web es buena, y te da una cantidad razonable de salidas para el uso de bitcoin y otras alternativas (incluso fiat), obteniendo un producto no nominal en casi todos los casos. Mírate bien las opiniones acerca de los sitios candidatos a su uso por si alguien ha apuntado algún pero. Que tenga ahora mismo presente, según los comentarios, los tickets regalo de ECI requieren que vayas a información y que muestres el DNI (no siempre lo piden por lo visto) y canjees lo comprado en la web de Bitrefill por una tarjeta regalo en el propio establecimiento.También hay que leer bien las condiciones de uso, por si alguna de las opciones sólo puede usarse online o bien sólo en tienda física.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "February 25, 2023, 09:43:04 AM",
      "body": "Quote from: DdmrDdmr on February 25, 2023, 09:25:41 AMQue tenga ahora mismo presente, según los comentarios, los tickets regalo de ECI requieren que vayas a información y que muestres el DNI (no siempre lo piden por lo visto) y canjees lo comprado en la web de Bitrefill por una tarjeta regalo en el propio establecimiento.El DNI siempre lo piden y si a alguien no se lo han pedido es por error, pero te lo piden igual si el cheque viene de un canje de bitrefill o de un regalo de tu tía por tu cumpleaños.  Entiendo que hay gente que no le hace gracia lo del DNI pero eso no supone reporte a hacienda*, y eso que para ellos, hacienda, que tu tía te regale 50€ por tu cumpleaños debería de tributar.*Por lo menos hasta ahora no lo ha supuesto y siempre que no pases de 3.005,06 euros, con lo que están obligados a presentar el modelo 347.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 25, 2023, 10:09:35 AM",
      "body": "Quote from: Don Pedro Dinero on February 25, 2023, 09:43:04 AM<…>Sí, suponía que era la política, y no pedirlo la excepción.Cuando miré la web tiempo atrás, podías efectuar el pago mediante fiat, usando una tarjeta bancaria tanto de débito como de crédito. No obstante, mirando ahora las opciones prácticas de pago, todas las opciones de pago son mediante criptomonedas, sin haber opción de pago en fiat. Desconozco si la opción ha sido quitada sólo en determinados países, o bien es algo global. Conceptualmente, preferiría que se pudiesen comprar también con fiat, de manera que un origen de compra determinado no estuviese únicamente ligado a compras con criptomonedas (paranoias supongo).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "February 25, 2023, 11:13:48 AM",
      "body": "Quote from: DdmrDdmr on February 25, 2023, 10:09:35 AMConceptualmente, preferiría que se pudiesen comprar también con fiat, de manera que un origen de compra determinado no estuviese únicamente ligado a compras con criptomonedas (paranoias supongo).Bueno, lo de paranoias se ve bastante en el foro, y yo no me libro.Se ve que no sabes cómo funciona bitrefill, si no, no dirías eso. Me suena haber explicado ya lo que voy a decir en nuestro foro local, pero igual me equivoco:Los cheques regalo no los proporciona bitrefill, sino una empresa intermediaria, con sede en Italia si no recuerdo mal. A efectos de investigaciones de las autoridades estamos en lo mismo de siempre: si has canjeado x dinero en bitcoin por cheques regalo en un año que al cambio son menos de 3.000€, ni van a saltar las alarmas en ningún sitio ni ningún juez va a enviar dos requerimientos, uno a bitrefill y otro a la empresa italiana para pedir información. Otra cosa es que ya te investiguen por otras cosas. Además, piensa que en ninguna de las dos te identificas. Lo único que tienen de tí es una IP y si acaso un email, que no es necesario ni ponerlo. Y a la mínima que tengas cuidado si quieren averiguar de ti, les va a costar trabajo quien hay detrás del email y la IP. Lo dicho, para importes bajos, no les vale la pena. Obtienen un ROI mucho más elevado con otros casos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 25, 2023, 01:29:10 PM",
      "body": "Quote from: Don Pedro Dinero on February 25, 2023, 11:13:48 AM<…> Se ve que no sabes cómo funciona bitrefill, si no, no dirías eso <…>La vertiente de usuario sí, la vertiente de su logística de compra de los cheques regalo la desconozco. La idea que tenía en mente es la de poder tener la certeza de que, a la postre, el código concreto del cheque regalo no esté trivialmente asociada a un pago realizado mediante criptomonedas. Pongamos por caso que una persona usa un cheque regalo en la web de Nike para efectuar una compra. Lo ideal es que Nike, que tendrá los datos nominales de la entrega, y el código del cheque regalo, no \"sepa\" que el producto adquirido en su web fue pagado de manera derivada con criptomonedas. Vale que no te van a perseguir ahora mismo por ello, y que hay un nivel de indirección, pero conceptualmente (o a nivel de \"peace of mind\") preferiría estar seguro de que no hubiese tal posible asociación. Obviamente si haces la compra en tienda con el cheque regalo te evitas esta inquietud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "February 25, 2023, 04:39:08 PM",
      "body": "Pues visto el movimiento que suscita, de momento no cierro el hilo.Qué bueno que ya conozcáis el servicio, me da mucha confianza. En el norte hablan bien, pero de cómo funciona en otros países a cómo lo haga en España hay un trecho. (o Latam, si otros se animan a comentar)Don Pedro Dinero, te he escrito antes pero no te había leído por aquí. Ya he usado tu código. En cuanto a compartirlo, no sé hasta qué punto violaría las normas del foro, pues más on-topic no puede ser... y quizá haya otros lectores ahora o en el futuro que se pasen por aquí y lo quieran usar también.Bueno, yo ahí lo dejo, por mi parte ningún problema si queréis compartir vuestros códigos.Lo dicho, no cierro el hilo, y si finalmente compro algo ya contaré mi experiencia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 25, 2023, 07:02:49 PM",
      "body": "Un apunte práctico que suele ser útil es que, en los comercios donde se usen a la postre los tickets regalo, suele bastar con llevar una fotografía o descarga del vale final generado en la web del comercio, de manera que te ahorras dejarte medio cartucho de tinta (en algunos casos) para realizar el pago. Normalmente, incluso con hacerle una fotografía al código de barras del vale debería bastar, dado que es lo que escanean los comercio para su uso.Por otro lado, las compras de los tickets regalo en Bitrefill genera en algún caso un recargo sobre el valor nominal de la compra, pero en otros casos genera un retorno de entorno al 1% del valor en bitcoin, saldo que queda en la cuenta para próximas compras (de abrirse una cuenta con email asociado).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "February 26, 2023, 05:19:15 AM",
      "body": "Quote from: Porfirii on February 25, 2023, 04:39:08 PMEn cuanto a compartirlo, no sé hasta qué punto violaría las normas del foro, pues más on-topic no puede ser... y quizá haya otros lectores ahora o en el futuro que se pasen por aquí y lo quieran usar también.Bueno, yo ahí lo dejo, por mi parte ningún problema si queréis compartir vuestros códigos.He recordado que hay una norma que prohibe compartir los enlaces de referido, o sea que mejor por privado.Quote from: DdmrDdmr on February 25, 2023, 01:29:10 PMQuote from: Don Pedro Dinero on February 25, 2023, 11:13:48 AM<…> Se ve que no sabes cómo funciona bitrefill, si no, no dirías eso <…>La vertiente de usuario sí, la vertiente de su logística de compra de los cheques regalo la desconozco. La idea que tenía en mente es la de poder tener la certeza de que, a la postre, el código concreto del cheque regalo no esté trivialmente asociada a un pago realizado mediante criptomonedas. Pongamos por caso que una persona usa un cheque regalo en la web de Nike para efectuar una compra. Lo ideal es que Nike, que tendrá los datos nominales de la entrega, y el código del cheque regalo, no \"sepa\" que el producto adquirido en su web fue pagado de manera derivada con criptomonedas. No lo sabe. Es lo que trataba de explicar antes. Bitrefill tiene un acuerdo con Amilon para la compra de tarjetas, pero Amilon proporciona tarjetas a diversas empresas, mírate la página si tienes curiosidad:https://amilon.eu/QuoteGift Card programs for CompaniesAmilon is the leading company in Italy and in Europe for Digital Gift Cards processing and distribution. Create your Gift Card Program now.Tú si tienes una empresa digamos DdmrDdmr S.L, y quieres incentivar a tus empleados con tarjetas regalo a modo de retribución en especie, llegas a un acuerdo con ellas y te las proporcionan. La única de las empresas que tiene como origen un pago en criptomonedas de las que trabajan com Amilon es Bitrefill. Cuando llega un cheque regalo a la tienda de Nike no tienen ni idea de que podría en algún caso provenir de un pago en criptomonedas, y si alguien tiene idea es probablemente porque esa persona también es cliente de Bitrefilll, pero no puede determinar con certeza cual es la empresa que le ha pagado a Amilon para obtener el cheque.En resumen que nos montamos unas películas a veces en el foro que distan mucho con la realidad, y yo me incluyo. Estamos de acuerdo en que a efectos de privacidad es mejor un cheque regalo con código de barras que liberas en una tienda física como si fuera efectivo y no un cheque regalo del Corte Inglés, que pide el DNI, o liberar el cheque online, pero a nadie le van a investigar por usar cientos de euros, o incluso un par de miles, en cheques regalo online o ECI. De hecho, la mejor prueba de esto es que no se ve a nadie en los diversos foros decir que ha tenido una investigación por usar bitrefill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 28, 2023, 04:35:24 PM",
      "body": "Otro aspecto a tener presente, es que puede que algunas cuentas de comercios pueden tener algo de celo al usar en ellas, en determinadas circunstancias, cupones regalos.El caso que me viene a la mente es el de Amazon, donde en la página de Bitrefill indica a modo de aviso que:QuoteNo uses tarjetas de regalo en cuentas nuevas de Amazon sin tarjetas de crédito o débito agregadas, o tu cuenta puede bloquearse hasta que puedan verificar su identidad.Parece un requisito sencillo, pero algunas personas puede que se hayan topado con algún inconveniente adicional. En este hilo reciente, un usuario (en EEUU) asegura haber cargado 4K $ con tickets regalo (sin especificar su origen), y ver como Amazon bloqueaba su cuenta sin que pudiese recuperar el importe o el acceso al mismo. Cree haber tenido una tarjeta vinculada con una dirección de EEUU pero ni aun así.En el caso anterior, seguro que hay algo más que lo contado. La base de agregar 4K $ en tickets regalo ya es quizás pasarse un tanto (aunque no debería ser). Desconocemos si todas las compras previas al bloqueo, de haberlas, fueron exclusivamente pagadas con tickets regalo, cuánto había gastado ya (siendo los citados 4K $ un saldo restante), etc. Dentro del mismo hilo, este otro usuario asevera haber vivido algo similar, habiendo tenido su cuenta bloqueada durante 9 meses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "March 04, 2023, 10:59:43 AM",
      "body": "Quote from: DdmrDdmr on February 28, 2023, 04:35:24 PMOtro aspecto a tener presente, es que puede que algunas cuentas de comercios pueden tener algo de celo al usar en ellas, en determinadas circunstancias, cupones regalos.El caso que me viene a la mente es el de Amazon, donde en la página de Bitrefill indica a modo de aviso que:QuoteNo uses tarjetas de regalo en cuentas nuevas de Amazon sin tarjetas de crédito o débito agregadas, o tu cuenta puede bloquearse hasta que puedan verificar su identidad.Parece un requisito sencillo, pero algunas personas puede que se hayan topado con algún inconveniente adicional. En este hilo reciente, un usuario (en EEUU) asegura haber cargado 4K $ con tickets regalo (sin especificar su origen), y ver como Amazon bloqueaba su cuenta sin que pudiese recuperar el importe o el acceso al mismo. Cree haber tenido una tarjeta vinculada con una dirección de EEUU pero ni aun así.En el caso anterior, seguro que hay algo más que lo contado. La base de agregar 4K $ en tickets regalo ya es quizás pasarse un tanto (aunque no debería ser). Desconocemos si todas las compras previas al bloqueo, de haberlas, fueron exclusivamente pagadas con tickets regalo, cuánto había gastado ya (siendo los citados 4K $ un saldo restante), etc. Dentro del mismo hilo, este otro usuario asevera haber vivido algo similar, habiendo tenido su cuenta bloqueada durante 9 meses.He estado curioseando un poco por la web y con Uber pasa algo similar: debes tener una tarjeta de crédito o débito registrada con carácter previo, o te manda directamente al KYC. Por otro lado, me ha parecido como que el saldo de los cheques regalo se asocia de alguna manera a la tarjeta correspondiente, ¿quizá por si era fraudulenta poder cobrar el importe directamente?En cuanto a los 4K, es una bestialidad, pero si dejan hasta 5K me puedo imaginar la gracia que le hará al afectado de turno. Quiero pensar que en los casos en que se bloquearon los fondos habría algo sospechoso detrás. Ah! y esos importes tienen que pasar por KYC en España necesariamente: recordemos que con el cambio de ley los límites en efectivo son 1.000€, aplicables también a las tarjetas regalo cuando se usen como método de pago análogo al dinero físico (anónimo). Aprovecho para recordar que pasa lo mismo con las criptos, cuando la transacción no está asociada a una cuenta bancaria u otro método con KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 04, 2023, 02:00:07 PM",
      "body": "Quote from: Porfirii on March 04, 2023, 10:59:43 AM<…>Leyendo las condiciones de las Tarjetas Regalo para Uber, son poco precisos en aspectos que son importantes conocer:Quote<…> 6) Añada la información de KYC (dependerá del importe de la recarga). Es posible que tenga que añadir una forma de pago secundaria para usar la Tarjeta regalo con la app Uber. Para evitar el fraude y cumplir la legislación del EEE, incluida la prevención del blanqueo de capitales, la financiación del terrorismo y las sanciones, se le pedirá que proporcione determinada información al canjear su Tarjeta regalo por Uber Money. Es posible que se apliquen límites al canje de la Tarjeta regalo <…>Términos genéricos como \"dependerá\" y \"es posible\" dejan la incógnita de cuándo y bajo qué condiciones se llevan a cabo los aspectos citados.Las instrucciones al respecto de la página de Bitrefill son más precisas al indicar que hará falta una tarjeta de crédito sí o sí, aunque luego en los términos y condiciones vuelve a usar un indefinido como \"may\" en lo relativo al KYC. No veo ningún comentario de compra, por lo que reduce el campo de conocimiento de la experiencia del usuario Bitrefill que ha pagado el ticket regalo con criptomonedas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "April 27, 2023, 03:48:41 AM",
      "body": "Por cierto, ¿alguien sabe si se han dejado de dar bitrefill rewards? El otro día hice una compra y no me los dieron. No es una cosa de la que llevara un seguimiento al 100% pero creo que me los daban en cada compra. Al no dármelos esta vez no tengo claro si es un error, o que no me los dieron puntualmente por algo. Pagué con bitcoin, y si que se que si pagas con altcoins no te los dan, pero no se qué pasó en este caso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "April 27, 2023, 11:36:52 AM",
      "body": "Quote from: Don Pedro Dinero on April 27, 2023, 03:48:41 AM<...>Si la información figuraba en el momento de la compra, te deberían haber abonado la recompensa. Otra cosa es que puede que la última vez que te fijaste figurase, pero al hacer la compra en un día posterior ya lo hubiesen quitado para esa compañía en concreto.Si miras la lista global de \"Top Productos\", en el caso de España, de los 30 listados (de 78) en la primera página, hay 9 que ofrecen un 1% de recompensa (figura debajo del logo y del rango de importes – el primero que veo en el listado parece ser Zalando). Diría que los casos de uso de las recompensas han ido variando (poner/quitar) con el tiempo, aunque no he mirado en detalle cómo varían.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "April 28, 2023, 03:03:38 AM",
      "body": "Quote from: DdmrDdmr on April 27, 2023, 11:36:52 AMSi miras la lista global de \"Top Productos\", en el caso de España, de los 30 listados (de 78) en la primera página, hay 9 que ofrecen un 1% de recompensa (figura debajo del logo y del rango de importes – el primero que veo en el listado parece ser Zalando). Diría que los casos de uso de las recompensas han ido variando (poner/quitar) con el tiempo, aunque no he mirado en detalle cómo varían.Ya ves si estoy pez que o no me había dado cuenta de que algunos productos dan recompensas y otros no, o me di cuenta en el pasado pero no me acordaba, jaja. En todo caso, gracias.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 05, 2023, 10:49:01 AM",
      "body": "Quote from: Don Pedro Dinero on April 27, 2023, 03:48:41 AMPor cierto, ¿alguien sabe si se han dejado de dar bitrefill rewards? El otro día hice una compra y no me los dieron. No es una cosa de la que llevara un seguimiento al 100% pero creo que me los daban en cada compra. Al no dármelos esta vez no tengo claro si es un error, o que no me los dieron puntualmente por algo. Pagué con bitcoin, y si que se que si pagas con altcoins no te los dan, pero no se qué pasó en este caso.Por lo que yo sé sí que los siguen dando. Debe ser lo que comentabas en el último post: que quizá no te fijaste en el detalle de que algunas compañías lo ofrecen pero otras (¿la mayoría?) no lo hacen.Un 1% tampoco es mucho, la verdad sea dicha, pero bueno, que nunca vienen mal unos pocos satoshis extra, y más si son gratis... ya cobra bastante comisión la propia web si no me he fijado mal. Y con la burrada que se está pagando estos días de fees ya ni os cuento. Hoy en día es poco, pero quizá llegue el momento que nos tiremos de los pelos al ver todo el dinero que tiramos, y puede que los rewards supongan un alivio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}