{
  "id": "topic_5428064",
  "title": "CryptSafe",
  "author": "CryptSafe",
  "created_time": "December 12, 2022, 03:36:22 PMLast edit: December 12, 2022, 05:21:16 PM by CryptSafe",
  "content": "If we are to go by this recent update from gcko.io on binance and cz  then their is likely going to be another melt down. The US prosecutors are at it again in their usual clampdown on Crypto currencies and exchanges thereby causing a drastic drop in the Crypto market. If binance should be conducting kyc for members onboard their platform how come they could not detect the money laundering activities going on onboard their platform. As it stands now, this would definitely cause another panic in the space as binance is the world leading exchange so therefore it would not be too long we would be up to hearing another news again. This year has been very rough and turbulent for the Crypto industry as it has it downs more than it it's up as it could mention or think of. Do remember the \"not your keys not your coin\" movement to safeguard your assets and funds.https://twitter.com/coingecko/status/1602283556633382914?t=T8vH06NLrciOV2OH1szWgA&s=19https://twitter.com/coingecko/status/1602283554536361985?t=ZCxAOsLgyz5ttWpgwu51zQ&s=19",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428064",
  "comments": [
    {
      "author": "rat03gopoh",
      "created_time": "December 12, 2022, 04:07:51 PM",
      "body": "KYC isn't a tool to detect money laundering, it is only to identify perpetrators. There were several methods before that they provided, and I doubt if the authorities don't know even those exchanges apply without the approval of the authority as the exchanges standard method. But when it comes to facts there are millions trading stolen identities and verified accounts out there.Criminals are always one step ahead of the police when it comes to ideas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 12, 2022, 04:32:18 PM",
      "body": "I have nothing against the fact that all the suspicions of many years are finally investigated and that we finally find out how CZ and its team of small communists conduct their operations around the world. Everyone who thinks that CZ is working according to the law, should put a picture of Comrade Bankman above their bed and tattoo Kwon on their shoulder and CZ on their chest to make it even closer to their hearts😍Quote from: CryptSafe on December 12, 2022, 03:36:22 PMThe US prosecutors are at it again in their usual clampdown on Crypto currencies and exchanges thereby causing a drastic drop in the Crypto market. We are surely doomed, by the end of this year 1 BTC may not be worth even $1 - but sir, that's good, isn't it? Everyone will be able to buy a whole bunch of BTC and be super rich when the price skyrockets again - of course with the help of your ultimate savior and leader Mr. Mars",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 12, 2022, 05:10:44 PM",
      "body": "It's not the end even if Binance and CZ were convicted as accessories to money laundering in the earlier years of their operation. Binance policies have changed over the years and became more friendly or cooperative to the regulators so that may be considered as well. This may end in a settlement should the Justice Department file a case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 12, 2022, 06:21:15 PM",
      "body": "Such kind of things will never end on crypto exchanges. Rather, we will see an increase in such kind of cases and lawsuits due to the recent bankruptcy of FTX. Regulatory bodies will try to extract as much money as possible from the crypto exchanges for their own gain. But it will be not great if Binance is attacked openly like this on an ongoing basis. It will have an impact on the crypto market and may give the required push towards decentralised exchanges for good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "December 12, 2022, 07:01:52 PM",
      "body": "Quote from: avikz on December 12, 2022, 06:21:15 PMBut it will be not great if Binance is attacked openly like this on an ongoing basis. It will have an impact on the crypto market and may give the required push towards decentralised exchanges for good. If a squabble between a centralized exchange and government authorities is what it takes to push users to decentralized platforms, then that would be a welcome development, but I'm not that optimistic. Users would switch to other CEXes for the main time and even move their funds back to finance one the dust has settled down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harapan",
      "created_time": "December 12, 2022, 07:25:08 PM",
      "body": "Quote from: avikz on December 12, 2022, 06:21:15 PMSuch kind of things will never end on crypto exchanges. Rather, we will see an increase in such kind of cases and lawsuits due to the recent bankruptcy of FTX. Regulatory bodies will try to extract as much money as possible from the crypto exchanges for their own gain. But it will be not great if Binance is attacked openly like this on an ongoing basis. It will have an impact on the crypto market and may give the required push towards decentralised exchanges for good. If we find out that Binance gets attacked or bankrupt in anyway the FTX saga would be considered less to what may happen.But more dump of the market and some see the opportunity in such situations like the dump where they make profits.Could it be that because they refused siding FTX who have been links to banks and governments, they are now being targeted, I hope that's not what is going down behind scenes.Binance or not, exchnages will remain the same it's advice to go full self custody else we are seeing more people loosing fund's which would be a bad one for crypto adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "December 12, 2022, 07:34:20 PM",
      "body": "I guess this will end in a friendly investigation and unveiling of perpetrator of such crime who are certified Binance users, this does not have the we're with thought to push the price of Bitcoin or any other cryptocurrency assets in the market down, and not like the FTX situation, Binance own case is different.CZ may not be 100% pure after all cryptocurrency is trustless but in line with the operation of a centralized exchange, Binance is one of the top exchanges with strong regulatory compliance KYC procedures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 12, 2022, 07:35:33 PM",
      "body": "You didn't think that CZ would be able to blow up FTX and get away without the SBF supporters going after him did you?  There is no doubt that the US regulators in bed with SBF are going to try and take down Binance now out of spite.  If Binance falls, it could be chaos in the markets.  I guess we'll see how this plays out.  CZ and SBF both use the same playbook with their businesses, but I think BNB has more community support and Binance has deeper pockets, so it's possible they could keep their Ponzi alive through this cycle.  At some point a bigger fish will do to Binance what CZ did to FTX.  Their business model is flawed, and that is the only outcome in my opinion.  I think they'll last another cycle though before Wall Street shorts BNB into the ground and causes BUSD to depeg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoPanda",
      "created_time": "December 12, 2022, 09:26:01 PM",
      "body": "I find it suspicious not surprising though that in recent times, crypto exchanges have been under attack multiple times. It’s barely a month after FTX saga went down, now the US is gearing towards Binance. I personally think this isn’t about the credibility of the exchanges, let’s be honest the government do not give af about Binance mode of operation. Let’s not forget that Binance were forced to imposed KYC on its customers by the same US government. This is a ploy to destroy crypto exchanges and promote CBDCs. The centralized exchanges are coming under the heat because they are more popular and ofcourse centralized so they can easily be persecuted, when they are done with CEX, they will find a way to attack the available DEXs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awkward_Public_Stoner",
      "created_time": "December 12, 2022, 09:28:38 PM",
      "body": "Didn't seem to make much of a dent wrt Bitcoin price, this news.Good to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FanEagle",
      "created_time": "December 12, 2022, 09:32:34 PM",
      "body": "The trick here is that if you do not know exactly who deposited and withdrew money one for one, then you can assume that it is money laundering. This means that US prosecutors would need 100% of ALL of our names and trades and deposits and withdrawals to see if there is any money laundering going on or not.I have to say it's not going to be that shocking neither if there is a chance that it became to known some people laundered money, but it would be hard to prove as well if you don't know them all. As such, this means they are just doing it to strong arm Binance and nothing more, and they can keep repeating it time to time but it just won't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 12, 2022, 09:42:18 PM",
      "body": "Well, the news said they are still considering, it's not like they've made up their minds to file the charges.But then, I still personally think that conspiracy is out in play here, like ognasty said, SBF will indeed try to fight back at binance and CZ for his role in ruining his business, and those will use to fight back are his friends in the government, so I am not surprised at all.And on the other hand, if it be true that they later decided to file the charges against binance and CZ, I personally do not think this is going to have any significant negative effect on the crypto market except a hidden mystery is unraveled in the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "December 12, 2022, 09:48:15 PM",
      "body": "Quote from: OgNasty on December 12, 2022, 07:35:33 PMYou didn't think that CZ would be able to blow up FTX and get away without the SBF supporters going after him did you?  There is no doubt that the US regulators in bed with SBF are going to try and take down Binance now out of spite.  If Binance falls, it could be chaos in the markets.  I guess we'll see how this plays out.  CZ and SBF both use the same playbook with their businesses, but I think BNB has more community support and Binance has deeper pockets, so it's possible they could keep their Ponzi alive through this cycle.  At some point a bigger fish will do to Binance what CZ did to FTX.  Their business model is flawed, and that is the only outcome in my opinion.  I think they'll last another cycle though before Wall Street shorts BNB into the ground and causes BUSD to depeg.Binance should be crushed. would allow for a real reboot. Have your cash read and look for low cost BTC coming your way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 12, 2022, 09:50:16 PM",
      "body": "The 2 things are different.1) Money laundering is tough to prove if they are doing KYC in some real way and keeping records and tracking and everything else it is a somewhat easy fight to win.2) Sanctions violations, from what is being discussed is a lot tougher, you move 1 doge for some sanctioned business  / country it really comes down to a yes or no answer. Did you allow an IP from North Korea to open an account, and trade 1 doge for something. If the answer is yes, you violated a sanction. [Yes I know you can't just sell 1 doge making a point] -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "December 12, 2022, 11:32:41 PM",
      "body": "Quote from: Awkward_Public_Stoner on December 12, 2022, 09:28:38 PMDidn't seem to make much of a dent wrt Bitcoin price, this news.Good to see.According to OP it did Quote from: CryptSafe on December 12, 2022, 03:36:22 PMThe US prosecutors are at it again in their usual clampdown on Crypto currencies and exchanges thereby causing a drastic drop in the Crypto market. OP must be living in some other time line and casually coming in to drop the news on us.The longer the bear market drags on the less impactful bad news become. We've already been in this for about 14 months. About time for the struggle to end.People will finally learn after 12 years of watching cryptocurrencies that they shouldn't hold money on exchanges and that it doesn't matter what scam gets exposed as long as your money is safe far away from it. Scams will always be there and so will bankrupt or hacked exchanges. You have to take care of yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "December 13, 2022, 01:52:21 AM",
      "body": "Binance released an article against this: https://www.binance.com/en/blog/leadership/inside-binances-fight-against-crypto-crime-5422427314690193337Even Binance's Twitter tweet and also retweeted by Binance CEO Changpeng Zhao, about there being a news company that they are wrong or did fake news: https://twitter.com/binance/status/1602287184400326656Overall, I am not against Binance exchange as long as they are not doing something fishy like using customers' funds for any other things that could lead to bankruptcy or a fully solvent exchange. Hoping no more next FTX exchanges will happen in the cryptocurrency space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Thomas Kralow",
      "created_time": "December 13, 2022, 02:02:34 AM",
      "body": "Quote from: Ojima-ojo on December 12, 2022, 07:34:20 PMI guess this will end in a friendly investigation and unveiling of perpetrator of such crime who are certified Binance users, this does not have the we're with thought to push the price of Bitcoin or any other cryptocurrency assets in the market down, and not like the FTX situation, Binance own case is different.CZ may not be 100% pure after all cryptocurrency is trustless but in line with the operation of a centralized exchange, Binance is one of the top exchanges with strong regulatory compliance KYC procedures.Now the most nervous one should be Binance. As a bystander, we don’t know the internal news of Binance, but judging from their positive attitude towards government supervision and the overall attitude of this FTT incident, Binance is very nervous. Binance is defending its status as the largest exchange, so it threw the FTT bomb, but it is often its most dangerous time. What the crypto world needs is not just one exchange, but coexistence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "December 13, 2022, 02:12:06 AM",
      "body": "Quote from: CryptSafe on December 12, 2022, 03:36:22 PMIf we are to go by this recent update from gcko.io on binance and cz  then their is likely going to be another melt down.They are doing shitshow by massively attack Binance and CZ whilst are still trying to say good words about Sam Bankman-Fried. I know SBF was arrested by Bahamasian authority but recent weeks, there are still good words and sympathy for SBF in the USA.QuoteThe US prosecutors are at it again in their usual clampdown on Crypto currencies and exchanges thereby causing a drastic drop in the Crypto market. If binance should be conducting kyc for members onboard their platform how come they could not detect the money laundering activities going on onboard their platform.Did you miss that Binance splited to Binance global and Binance US within a trade war between the USA. and China?Honestly it is a very smart decision of Changpeng Zao as Binance CEO should smell very well about coming risks.Did you forget that Binance already required KYC on US customers for Binance US. and require KYC on global users too just a few months ago?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 13, 2022, 04:21:40 AM",
      "body": "Weirdly enough, I would have assumed the US prosecutors were going after CZ for the alleged unregistered security Binance coin could be in the eyes if the American justice system, rather than this charges, specially money laundering. Binance already asks for documents, live-selfie, etc; in order for their clients to be able to operate (they ask for move personal date to unlock more perks in P2P) and I doubt Binance is willingly aiding criminals to launder their money. As long as any exchange complies with the law it should be let alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}