{
  "id": "topic_5413568",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "September 14, 2022, 03:06:59 PM",
  "content": "I want to share some websites that maybe much people knows them already but  i find so useful in cryptocurrencies market whether you are a trader or not and i hope someone will benefit from them.First we have CryptoQuant which gives you a big amount of data on most cryptocurrencies in the market millions of traders are using this website to predict the next move of any coin or token, beside sharing some analysis and next moves of market by combining between network data, market data and entity flow dataSecond website is well known as LunarCrush it’s a big platform for cryptocurrency and nfts with a large community, it’s the best place to spot the new trending tokens or altcoins that might explode and take the chance of making a big profit but also you should be carful on it because most of these alts are so volatile and can turn to 0 in any second.Third website is CoinMarketCal that i find so simple and very useful when it comes to crypto big events and news of all the market, as for now we have the Ethereum merge coming and it’s the biggest event now, we also find the dates and announcements of some good projects beside the ability of giving a rate for each project which going to make it easier to spot the scam projects If anyone has other websites that are useful please share them here in this topic so we all can benefit",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413568",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "September 15, 2022, 11:38:37 AM",
      "body": "Some websites that are useful for investors and traders.Glassnode: https://glassnode.com/ and Glassnode Insights: https://insights.glassnode.com/LookintoBitcoin: https://www.lookintobitcoin.com/ with on chain data for BitcoinCryptorank.io: https://cryptorank.io/ You can get monthly, quarterly return table for many coins.Checkonchain: https://checkonchain.com/ with lot of metrics for Bitcoin.Blockchaincenter: https://www.blockchaincenter.net/en/altcoin-season-index/ with index for Bitcoin, altcoin season. It can help you to join or exit based on market trend",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "September 15, 2022, 12:03:44 PM",
      "body": "Among those three you mentioned, I only used Coinmarketcal and indeed it's very helpful, not only news it also provide rumors of some crypto projects. Though I can say that a significant amount of the upcoming event on there is sometimes not true. I also use some very common site like Coinmarketcap, and Cryptorank, both are very useful, they provide technical data of coins. I also get insight from some twitter account like @BSCNews, they post what project is popular among BSC Community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "September 15, 2022, 12:13:51 PM",
      "body": "You can add cryptopanic app for news aggregator category. It collects all news related to crypto from different media outlet just like coinmarketcap that collects all the data of crypto from different exchange. I use this app for fundamental analysis because they are updating all there data real so you will become updated always on every news for crypto which is good for entering or exiting on the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jovan85",
      "created_time": "September 15, 2022, 08:36:22 PM",
      "body": "This is a very useful website for traders : https://bitcoinbookmarks.com/It contains information of a different nature that needs to be checked.It can be used for various things, not only for trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john1010",
      "created_time": "September 16, 2022, 01:58:48 AM",
      "body": "I just want to give all of you a merit guys, but I don't have enough to do it, well this will be a big help for all of us, especially traders, and me also. Sharing is caring I believe in that. I will bookmark all of that link, Again thanks for sharing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "September 20, 2022, 01:58:09 PM",
      "body": "1 - Bitcointalk 2 - Coinmarketcap3- TradingviewThese are enough for me. Sometimes I read very important ideas about cryptocurrencies on Bitcointalk. I see new and different perspectives here. That's why the forum is always number 1 for me.Coinmarketcap is a habit now. I can't use any other website than it.Tradingview drawing tools are very high quality. It gives us the opportunity to make the best and most subtle calculations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "September 20, 2022, 05:09:19 PM",
      "body": "For crypto investment and crypto trading, it is very important to consider market data and cryptocurrency movements.and to do successful crypto research, you can use tools that I think are good and allow you to make better trading decisions.messageGlassnodeLunarCrushCoin MetricSantimentCoinMarketCal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kocret02",
      "created_time": "September 20, 2022, 05:27:11 PM",
      "body": "1. Binance.USBinance.US has quickly become an excellent trading platform for US residents due to its high liquidity features, focus on innovation and user security, and better customer service than its predecessor, Binance.2. BittrexThe benefits of trading crypto on Bittrex include effective and reliable technology, an elastic multi-stage wallet strategy (80 percent to 90 percent security of funds), and a fast loading trading interface with no hangs or lagging. There is also an automated trading feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sweetbtc",
      "created_time": "September 20, 2022, 06:32:42 PM",
      "body": "Thank you for sharing these useful Websites guys. I usually get the details from Coinmarketcap, Telegraph, and the most efficient way for me is Twitter, I have followed main main Twitter account that share every news of Market on their handle. And another way to get news is Telegram Channels that are also useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bocyaj",
      "created_time": "September 20, 2022, 07:25:23 PM",
      "body": "Actually trading should be done with our own knowledge,because everything had a sense.It’s our own money,So we need to use the time and earn from it.People always depends on other for the strategy and the signals.But it’s not a good one,people should develop their own strategy for the trading.When the people use their their strategy,it’s nothing wrong in the loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 20, 2022, 07:55:19 PM",
      "body": "Quote from: bocyaj on September 20, 2022, 07:25:23 PMActually trading should be done with our own knowledge,because everything had a sense.It’s our own money,So we need to use the time and earn from it.People always depends on other for the strategy and the signals.But it’s not a good one,people should develop their own strategy for the trading.When the people use their their strategy,it’s nothing wrong in the loss.In order for someone to develop their own strategy and style they have to do their own research, and in order to do their own research they need tools in the form of useful websites to garner information and knowledge, they thus use this information to form their own investment and trading strategy, and that is what most of these websites that have been shared in this topic are for; we can't keep telling people to do their own research and create/develop their own strategy wihout providing them with materials they can use to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin-shark",
      "created_time": "September 20, 2022, 08:34:50 PM",
      "body": "In my opinion the only two sites who can really lend a hand to those approaching the world of crypto are coingeko and coinmarketcap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "September 20, 2022, 08:48:28 PM",
      "body": "For traders, I would also add the following sites.TradingView - Charts of various coinsListedOn - Listings of new coins and pairs on exchangesScew - Onchain analytics on exchangesCoinigy - Trade on multiple exchanges through one terminalAnd of course don't forget about cryptocurrency price monitoring services and tracking your crypto portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "September 20, 2022, 09:05:36 PM",
      "body": "Being a trader it’s really good to have a good source of information and personally I have some favorite sites to visit every time I trade and I find them very helpful. As a trader you should not only focus on the price trend, you need to read some crypto news as well because usually it affects the price movement and if you miss it, probably you’ll lose the chance to secure some profit or at least cut your losses. TradingviewCointelegraph CoinmarketcapBinance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "September 20, 2022, 09:31:00 PM",
      "body": "Actually I will applaud you for your research and the understanding toward the platforms you introduce to bring people up via prediction of cryptocurrency. But I stand to let you know that prediction of Bitcoin or the prediction of cryptocurrency cannot be accurate through all those site you mention because I know that before now many people has made a research and also some of the such information which I will assume that it should be some places where some people get the option of their prediction, and that's the point all their prediction falls so no of the site is authentic in cryptocurrency predictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "September 20, 2022, 10:08:56 PM",
      "body": "Quote from: GeorgeJohn on September 20, 2022, 09:31:00 PMActually I will applaud you for your research and the understanding toward the platforms you introduce to bring people up via prediction of cryptocurrency. But I stand to let you know that prediction of Bitcoin or the prediction of cryptocurrency cannot be accurate through all those site you mention because I know that before now many people has made a research and also some of the such information which I will assume that it should be some places where some people get the option of their prediction, and that's the point all their prediction falls so no of the site is authentic in cryptocurrency predictions.I agree about what you said and especially bitcoin price, the tools and websites i mentioned are just for helping you choose and give you a small idea in short or long term direction of many tokens and altcoins, some of the new token for example when they are just announced and many people liked the project which you will know from the website i mentioned, there is a high chance that the price will go up and you may make a good profit, but also not all the time. You need a good money management before going into any investment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 20, 2022, 10:15:15 PM",
      "body": "Quote from: bitcoin-shark on September 20, 2022, 08:34:50 PMIn my opinion the only two sites who can really lend a hand to those approaching the world of crypto are coingeko and coinmarketcapThese two websites, we're all hands up to them as they're the famous website for listing the entire market. But it is that, they don't have those full features that other websites got to offer. They may also have some charts but the other websites like tradingview offers various pairs of charts for the cryptos that it has on its website and that's why it's superior on its own feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "September 20, 2022, 10:20:24 PM",
      "body": "Quote from: GxSTxV on September 20, 2022, 10:08:56 PM[<...>]I agree about what you said and especially bitcoin price, the tools and websites i mentioned are just for helping you choose and give you a small idea in short or long term direction of many tokens and altcoins, some of the new token for example when they are just announced and many people liked the project which you will know from the website i mentioned, there is a high chance that the price will go up and you may make a good profit, but also not all the time. You need a good money management before going into any investment From your perspective you might be right, but what I'm trying to impact on you, is that some of those site are not reliable, they are been established to get view and being paid with the views, that's while so many of them do refer people to their sites, when you check very well you notice that some of their prediction always base on new developed token. You can't see them prediction the future of a good coin that have a very good potential. Yes of course, we know that profit and Lose is necessary in any investment, but let us choose to be careful in some predictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "September 20, 2022, 11:52:13 PM",
      "body": "Quote from: bitcoin-shark on September 20, 2022, 08:34:50 PMIn my opinion the only two sites who can really lend a hand to those approaching the world of crypto are coingeko and coinmarketcapYou know, I was wondering why OP didn't  mention both sites. Even those who mentioned Coinmarketcap also left out Coingecko. Aren't it and Coinmarketcap in the same category anymore? Though I started with Coinmarketcap as my favourite crypto news site in my formative year in crypto until I stumbled on Coingecko and then got hooked on it. I think CG is even better than CMC. Well OP, thanks for the exposition you did. That's helpful anyway. I now have extra two sites to the repertoire of sites I follow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}