{
  "id": "topic_5437960",
  "title": "Lee Dynamo",
  "author": "Lee Dynamo",
  "created_time": "February 03, 2023, 06:56:12 PM",
  "content": "The price of bitcoinBTC is slowly coming down.The price action is showing a higher-low formation from the $24,250 level.Elliott waves give a bearish signal towards $23000.The buyers often failed to register another sustainable high above $24,200. Everyone is looking to celebrate Bitcoin's new 2023 high. There is unlikely to be a slight panic among speculators as the sentiment indicates a minor correction in the BTC price.https://www.tradingview.com/x/aj4E64dX/BitcoinBTC price action forms higher-low and lower-high patterns in the near term. This bearishness comes with Sellers most favorite strategy of Elliott Waves Theory. The hourly price action has registered the fourth level of waves at the fib retracement of the 0.5 level. If the next horizontal support breaks, the market is likely to witness further decline towards the $23000 mark from the current levels of $23,440.$23,200 appears as an immediate support as the bulls draw an ascending trend line. This breakout could take bitcoin price towards $23,000 to complete the correction before any bullish recovery.losing thoughtsBitcoinBTC price often retests the consolidation zone, which means bears are actively trying to maintain dominance at higher levels. For safe trading, speculators should wait for the confirmation of the directional trend.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437960",
  "comments": [
    {
      "author": "Hamphser",
      "created_time": "February 03, 2023, 09:32:21 PM",
      "body": "Quote from: Lee Dynamo on February 03, 2023, 06:56:12 PMThe price of bitcoinBTC is slowly coming down.The price action is showing a higher-low formation from the $24,250 level.Elliott waves give a bearish signal towards $23000.Price is retesting or trying out to break out that 24,250 but it seems it do made out some bump and now we are hovering around 23.3 and this is why no technical indicators could really be that giving off that precise prediction and this is why it is really that hard to make out some conclusive approach knowing that this market is really that unpredictable and there's no way that it could really be that easy for us to tell on where it would be going.For now its not bad to buy up and treat this as the bottom which we might be breaking some resistance on upcoming days or weeks to come but of course this isntreally that assured thing because its never been that predictable in the first place.So its up to your risk management on what decisions you would be making.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "February 03, 2023, 11:55:31 PM",
      "body": "Quote from: Lee Dynamo on February 03, 2023, 06:56:12 PMBitcoinBTC price often retests the consolidation zone, which means bears are actively trying to maintain dominance at higher levels. For safe trading, speculators should wait for the confirmation of the directional trend.Technically, we are still in the bear market, so the price might go down from time to time, some correction is needed by the market.Just like what we have seen in the last couple of days, we go as high as $24,200 or even higher at certain time frame. But there is not enough push for the price. But I'm still positive that it's just minor correction that we are seeing. The big magical numbers that the bulls are tying to get is $25k And if we ever hit that, then we will see if we can get further or we see the price going onto another dip. So yeah, more time is needed, but as I have said, I\"m optimistic that the upward trend will continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "February 04, 2023, 01:03:16 AM",
      "body": "It basically moved from $16,000 to $23,000 and has been sitting here for a bit now. I’m surprised it’s been able to hold this level and not retrace after the $40%+ move it made. The longer it consolidates here the more likely I feel it is that we head to $30,000 with a quick move upward. The market keeps pressing up against resistance and I think it is only a matter of time until we take the next leg up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 04, 2023, 04:23:17 AM",
      "body": "There is a good chance it might head to that area with the horrible employment number news that came out. Basically over half a million jobs added and unemployment rates as low as the 1960s. The bond market took a huge dump as a result. Stocks somehow managed to survive. However the breaks above has been weak, same for ETH. Only certain alts are pumping. So I would not be surprised if we get a break and head down to that area. The next big news is the CPI. And if it’s positive by half a point or more then I think the local top was in both macro and crypto markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "February 04, 2023, 07:07:59 AM",
      "body": "Call me crazy if you want, but since I don't like to play roulette, I'm not worried about whether it will rise from the current $21.5k to $23k, what I'm thinking about is whether it will rise to $230k in the next cycle, which I think is most likely, or if reaching that level will be delayed until the next cycle. I understand that this is a normal question in this speculation section but the difference is minimal and getting something right will be more a matter of chance than anything to do with predictive ability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "February 04, 2023, 07:56:24 AM",
      "body": "-    It's probably finished at its bottom price, so that's why the resistance to the movement of bitcoin's price value is playing at 23k$-24k$ something, maybe I noticed it for 2 weeks.So maybe in this month of February, the value of bitcoin to target may be between 24k$-25K$ or more, you know that its movement is very unpredictable and that others will be nervous when its price moves without us price expectations are whether up or down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "February 04, 2023, 08:30:19 AM",
      "body": "Quote from: Mr. Magkaisa on February 04, 2023, 07:56:24 AM   -    It's probably finished at its bottom price, so that's why the resistance to the movement of bitcoin's price value is playing at 23k$-24k$ something, maybe I noticed it for 2 weeks.So maybe in this month of February, the value of bitcoin to target may be between 24k$-25K$ or more, you know that its movement is very unpredictable and that others will be nervous when its price moves without us price expectations are whether up or down.I'm also with this same opinion, I'm nervous but at the same time, thinking that bulls is not yet done in this run. Although I read that there is some negative news regarding the employment rate in the US, but it's not enough to put a dent to bring the price down significantly.So if we can stay above $23k for this weekend, then I'm seeing the price could still make it up in this run and go for $24k-$25k or more at the end of the month. As I have said, bulls is still in control of the market and will obviously try to go for higher price and continue with the positive sentiments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slapper",
      "created_time": "February 04, 2023, 10:08:34 AM",
      "body": "Seems like a good time to keep an eye on bitcoin's current value. It seems that we are still in a bear market, and prices may continue to drop periodically. I agree that the market needs a correction in order to stabilize, and such price swings are not unusual.But, I wouldn't give up hope just yet! Possibly after this pullback, the price will start to rise again and eventually return to the $30,000 level. To develop more accurate market predictions, additional information is always needed. What unfolds in the next several days/weeks should be fascinating. The market may be volatile, so it pays to remain patient and watch it closely. There are chances hidden among the risks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "February 04, 2023, 01:10:14 PM",
      "body": "Hopefully, the bitcoin price will still hold on to $23k and rebound after this correction. But if the price keeps dropping and goes back below $23k, we can do nothing about it and just try to buy bitcoin again at that price. But I don't worry if the price goes back down to $22k or even lower because it is a good opportunity to increase the number of bitcoins by buying them again. Iif the price can hold, there is a possibility that in the next week, there will be an increase in the price to return to the previous price and maybe the price will break to $ 24 again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoonOfLife",
      "created_time": "February 04, 2023, 02:17:57 PM",
      "body": "We are still in the bearish season, so bitcoin correcting and even falling below $20k again shouldn't be too surprising. We shouldn't think we have entered a bull season just because bitcoin has rallied in the last 3 weeks, all of that is not enough to say that the bearish season is over. What is happening may just be a short-term pump and bitcoin will correct in the coming days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lee Dynamo",
      "created_time": "February 04, 2023, 03:46:44 PM",
      "body": "Quote from: Baofeng on February 03, 2023, 11:55:31 PMQuote from: Lee Dynamo on February 03, 2023, 06:56:12 PMBitcoinBTC price often retests the consolidation zone, which means bears are actively trying to maintain dominance at higher levels. For safe trading, speculators should wait for the confirmation of the directional trend.Technically, we are still in the bear market, so the price might go down from time to time, some correction is needed by the market.Just like what we have seen in the last couple of days, we go as high as $24,200 or even higher at certain time frame. But there is not enough push for the price. But I'm still positive that it's just minor correction that we are seeing. The big magical numbers that the bulls are tying to get is $25k And if we ever hit that, then we will see if we can get further or we see the price going onto another dip. So yeah, more time is needed, but as I have said, I\"m optimistic that the upward trend will continue.I also have bullish view on Bitcoin but for this week, it may hit $23K as hourly chart reflects selling on high. Bulls need rapid growth to overcome minor pullbacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "February 04, 2023, 03:56:48 PM",
      "body": "bla bla bla bla.go back to 1992-2003  gold charts.it stayed in a 200-400 usd slot for that entire time.It is now at 1800btc has been in a 15k to 69k slot since fall of 2020 about 2.6 years.we could stay in that slot for 10 years and then go up to 310k .gold did that btc could to.the analysis I gave is as valid as the op'spatterns may match him or me or entirely some other thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "February 04, 2023, 04:42:13 PM",
      "body": "Honestly? It doesn't really matter. We are already doing pretty sweet and the \"anxiety\" people come out anytime it looks even a little bit better. Look I get it, there is a sickness and anxiety is definitely something that people need to work on, that's why we have so many medicines for that, and that's why people take anti-depressants constantly because the world has stress and anxiety issues. However, just because it drops just a bit, doesn't mean that its going to be suddenly 23k and then lower, not every tiny drop is a call for a bear market returning, sometimes a drop is just a drop, and we are still at 23k+ which we should be happy about, and not worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "takuma sato",
      "created_time": "February 04, 2023, 05:20:59 PM",
      "body": "Bitcoin is overbought right now im book. 40% gains since the bottom, has not took a break in a while. Employment data from the US came in good, so I think that caused the SP500 to not correct, which means the BTC price followed and is staying in there. However I think this is the last good US employment data before recession really kicks in, which means SP500 should correct and so will BTC. Not to mention Russia-NATO war is pretty unpredictable and could cause a crash that screws up resistances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "February 04, 2023, 05:29:10 PM",
      "body": "I am waiting for the confirmation of the BTC direction trend for safe trading but it is not easy to make money even though BTC is in an uptrend. You make all kinds of moves to make the investor lose and if you put a stop, you stop with a single needle as soon as you take it from the spot you keep it at a loss by decreasing. Binance whales disrupt psychology by using the best artificial intelligence systems produced in this regard in particular.If you sell btc as soon as you recover the loss, this time it will go up like crazy in a single candle regret it and make you unhappy again. It builds a nest somewhere at the top no longer descends from here the direction goes up in the same second as you take your lesson 1.5k dollars goes down in a 15-minute candle. Waiting there for a week depresses morale. The story returns to the beginning when i say i sold it again and got rid of it as soon as it went up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GideonGono",
      "created_time": "February 04, 2023, 08:29:47 PM",
      "body": "It is now resting around $23K and for me it seems that it is slowly trying to climb higher.Some are saying that we are now on Bull Market, but is it going to stay or is it just another one of those price increase before a huge fall again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "February 04, 2023, 09:16:38 PM",
      "body": "What separates us from $23,000 is about $400, and it does not represent a turning point or a support/resistance level for a long time. The barrier between 22,000 and 24,000 has been broken many times, and thus returning to $23,000 does not represent anything for the medium and long term.In general, it seems that we have reached a consolidation point, in which the price will stabilize for a long time, so expect prices between $19,000 to $26,000.Trying to predict this relatively narrow range is very complicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "February 04, 2023, 09:52:23 PM",
      "body": "Its likely to turn around and do a loop but how far we go in that go around is not known as BTC is still bullish for the moment.  We have higher highs and higher lows so not exactly a reason to doubt just a slowing of gains is some note but not a signal we have to go down to any extent.      23k is a good call but anything in that area even would be highly positive going forward relative to the prior lows its not much of a pullback at all.  My guess is we go as far as 20k and take longer before actually getting near to 30kIn 3 days month start we had fast movement from a range of 22.7k to 24.2k.   Not the largest move but a fairly large blip and thats how I'd judge the next move from, its break from this range.   We can just bounce back and forth for most of this month, BTC often keeps some kind of range not especially doing something new so I'll gain more interest when its altered behavior less cyclic short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "February 04, 2023, 11:18:29 PM",
      "body": "Quote from: Lee Dynamo on February 03, 2023, 06:56:12 PMThe price of bitcoinBTC is slowly coming down.The price action is showing a higher-low formation from the $24,250 level.Elliott waves give a bearish signal towards $23000.Well price can't keep going up, would it?There isn't a single set of investors in the market. Its always a struggle between the bears and the bulls so at some point, you've just got to expect one to have the upper hand.  The bears have had there go, they certainly aren't done having there go at the market but, haven't gotten enough momentum for a bullrun.Be it as it may, its just good enough to make investors keep faith and not panic sell like the weak hands do. Out it sentiment, I don't think we are going to face any serious bear moves just yet. We are going to have price push up again towards $30 and then go into some real consolidation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}