{
  "id": "topic_5432853",
  "title": "Question:",
  "author": "raybucks",
  "created_time": "January 03, 2023, 01:39:28 PMLast edit: January 04, 2023, 08:16:56 AM by raybucks",
  "content": "deleted",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432853",
  "comments": [
    {
      "author": "shasan",
      "created_time": "January 03, 2023, 02:37:15 PM",
      "body": "Quote from: raybucks on January 03, 2023, 01:39:28 PMHello ,I’m here for a small loan.Loan Amount                           250 UsdLoan type                                PersonalLoan Repay Amount                 250+5% Loan Repay time                      10 daysType of Collateral                      None LTC  :              MPG56BHWxP9khkuQSzNTVXZ6DjFjWyjiU1TRX :              TDTZd81mC2tHYehGUwSwnVGu4wf8BvxaLkTRC 20 USDT : TMqPrxZY5jMUCiw24CebfwHE1UN58Ym41EI know It's Hard to trust me I am new here and don't have proof of repayment but trust me I will Payback i am not a scammer just a needy girl need money for personal reasonIg:  https://www.instagram.com/pakjung23/Go to a market in your country and search for a person who does not know you and/or you do not know him/her. Once you find ask 50$ loan without any collateral then see what's going on there. No one will allow you the loan. In this case, how do you think from here you will get such a loan without collateral?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "January 03, 2023, 02:44:01 PM",
      "body": "A genuine person would never said \"trust me, trust me\" in the first place since he doesn't the one who need to convince everyone, but everyone are determine how genuine or legit is the person. I believe even an inactive or non reputable high ranked account post this offer, no one is willing to take a risk since it's quite good amount money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raybucks",
      "created_time": "January 03, 2023, 02:47:07 PM",
      "body": "if a person want to say the loan giver \"don't worry your money will not going any where \"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "January 03, 2023, 11:22:45 PM",
      "body": "Quote from: raybucks on January 03, 2023, 02:47:07 PMif a person want to say the loan giver \"don't worry your money will not going any where \" so why are you applying for a loan, if the money isn't going anywhere LOLQuote from: raybucks on January 03, 2023, 03:21:35 PMQuote from: shasan on January 03, 2023, 02:37:15 PMQuote from: raybucks on January 03, 2023, 01:39:28 PM****Go to a market in your country and search for a person who does not know you and/or you do not know him/her. Once you find ask 50$ loan without any collateral then see what's going on there. No one will allow you the loan. In this case, how do you think from here you will get such a loan without collateral? UPDATED , I will payback come on buddy, everything has its rules, and the hardest rule is if you are a newbie and don't have any collateral, never beg for a loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 04, 2023, 07:25:39 AM",
      "body": "I will post here what I said in the other one and report the other one for duplicated. This (supposed) girl is off to a good start, not only asking for loans without collateral, but also creating duplicate threads for the same thing.Quote from: Poker Player on January 04, 2023, 07:23:00 AMWhat do you need a loan of $30 for a month? I imagine that with 30 dollars you do more things in your country than in mine, but not many more.Then think about something else: if you're so strapped for cash that you need to borrow $30, having to pay back $33 will make you even worse off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}