{
  "id": "topic_5500299",
  "title": "The Hidebehinder",
  "author": "The Hidebehinder",
  "created_time": "June 18, 2024, 03:21:10 PM",
  "content": "Two weeks ago, when I faced a 500 sat fee  if I would have been crazy enough to pay then, I udnerstood from older members that the the congestion happened because one exchange stupidly overpaid their consolidations and spammed the mempool with hundreds and thousands of them.Somebody also pointed to this website where I found this list:https://bitinfocharts.com/top-100-dustiest-bitcoin-addresses.htmlThe first in this list is credited to have 1609190 (0.77659%) UTXOs in their 13 BTC balance.Afraid to even ask but does this mean they at one point will have to consolidate all that?Theoretically how would that affect the mempool even if they don't overpay, how long it would take to clear out?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5500299",
  "comments": [
    {
      "author": "dzungmobile",
      "created_time": "June 18, 2024, 03:36:03 PM",
      "body": "Quote from: The Hidebehinder on June 18, 2024, 03:21:10 PMAfraid to even ask but does this mean they at one point will have to consolidate all that?The congestion can come from attacks like from a team who don't like Bitcoin, in the past it's Bitcoin Cash & Roger Ver team.Consolidations can come from an exchange like your case study or it can be from regular processing of exchange like BitMex in the past.The daily BitMEX broadcast at 13:08 UTCQuoteTheoretically how would that affect the mempool even if they don't overpay, how long it would take to clear out?It depends on total size of transactions waiting in mempools for confirmation and next new waiting transactions. Because Bitcoin block has its cap for total size and clearing congested mempools quickly or slowly, depends on current waiting transaction size, coming new waiting transaction, network hash rate and difficulty retarget too.Time of next found blocks will depend on network hashrate and difficulty. If many mining pools shut down their ASICs, time to find new blocks will become longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "June 18, 2024, 11:50:20 PM",
      "body": "Quote from: The Hidebehinder on June 18, 2024, 03:21:10 PMAfraid to even ask but does this mean they at one point will have to consolidate all that?Theoretically how would that affect the mempool even if they don't overpay, how long it would take to clear out?If you receive bitcoins regularly or more so do DCA a lot and it constitutes to large number of UTXOs without regular consolidation then you might have to, but it is not a must, with wallets that have coin controls you can still manage them, if at all they ain’t tiny figure UTXOs. The case is different for exchanges who have large amounts of it and needs to make large amounts of transactions most often. The speed of transactions in the mempool is definitely affected by the congestion on the network but even they don’t overpay and pay the just needed amount they would still get their transactions picked and confirmed. The duration to clear out depends on how congested the pool is, when new transactions would still be coming in which gives it more time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 19, 2024, 04:16:42 AM",
      "body": "Quote from: The Hidebehinder on June 18, 2024, 03:21:10 PMSomebody also pointed to this website where I found this list:https://bitinfocharts.com/top-100-dustiest-bitcoin-addresses.html0.0001BTC is just a small amount ($6-$7) and is not exactly dust amount specially since it is way higher than the minimum fee needed to spend each of these outputs. But I have to say it is always strange to see 75% of all UTXOs (139 mil out of 185 mil) UTXOs are that small.QuoteAfraid to even ask but does this mean they at one point will have to consolidate all that?Most of these addresses belong to exchanges and they regularly receive and regularly spend such outputs by consolidating them. So it's a dynamic thing happening all the time.QuoteTheoretically how would that affect the mempool even if they don't overpay, how long it would take to clear out?It would take a very long time to clear out but to get a real answer we need to write a code that takes all these UTXOs and categorizes them based on the address(es) they belong to and the script type to come up with an estimated transaction size that would contain each type and then come up with multiple estimations based on how many of these transactions can be included in a block (eg. take up 60% of a block or 90% or 10%) then estimate how many blocks it takes to clear all of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 19, 2024, 03:43:19 PM",
      "body": "many of these dust payments is not recipients receiving true value for products/services delivered. but instead performed by junk spammers. so a dust receiver can decide to just spend the dust utxo just to remove them and get nothing back from it.. no gain no loss. jus remove the utxo from active utxoset by spending it at costa deal can be struck between a dust hoarder and a mining pool where he collaborates with the pool to (once individual wants to give up further use of an address) give the private key to a pool to sweep the address to one output whereby the pool takes a small cut(less than normal fee) just to get rid of the dust utxo's from the utxoset",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Hidebehinder",
      "created_time": "June 20, 2024, 12:07:18 PM",
      "body": "Quote from: dzungmobile on June 18, 2024, 03:36:03 PMIt depends on total size of transactions waiting in mempools for confirmation and next new waiting transactions. Because Bitcoin block has its cap for total size and clearing congested mempools quickly or slowly, depends on current waiting transaction size, coming new waiting transaction, network hash rate and difficulty retarget too.I don't understand what hashrate and dificulty target would have to do with this, unless we're going to experience flat -10% decreases for continuous periods leading a 10% decrease in block size this will not affect the calculations even by error margins, and such adjustment have not happened since China banned mining and they were still temporarily followed by faster blocks.My question was pretty simple, and reiterating this assuming these guys would do the same as the last exchange and outbid everyone how long it will be till their transaction get confirmed assuming they have 1609190 UTXO and let's say they are batching them by the 500 at once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 20, 2024, 05:16:09 PM",
      "body": "Quote from: The Hidebehinder on June 20, 2024, 12:07:18 PMMy question was pretty simple, and reiterating this assuming these guys would do the same as the last exchange and outbid everyone how long it will be till their transaction get confirmed assuming they have 1609190 UTXO and let's say they are batching them by the 500 at once.Each UTXO has an output script that determines how to spend it and based on that it would take a different transaction size. So as I said above if you want an accurate answer you have to write a script that takes all those types, calculates the sizes based on script type and measures the final size. For example spending a P2SH (2of3 multi-sign) would take a much bigger space than spending a P2WPKH.If you want a guess here are two ways:(1) https://blockchair.com/bitcoin/blocks#f=id,input_countBlocks usually have transactions with a sum of 5k-6k inputs so lets just take the lower value 5k. Remember that normal blocks with normal transaction have a much lower number of inputs that 500 you said.1609190 UTXOs would take 321 blocks. Each day we should get 144 new blocks that means it would take between 2.2, so lets just say 3 days to clear it out.(2) If we assume all of the inputs are P2WPKH (since a lot of the addresses in the link in OP are of this type) and with 500 inputs and 1 output the weight of this tx is about 136000 and each block max weight is 4000000 that means the block can contain 29 of these transactions or 29*500=14500 UTXO. The total of 1609190 would take 110 blocks which is less than a day to clear out with 144 blocks per day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Hidebehinder",
      "created_time": "June 20, 2024, 05:28:46 PM",
      "body": "Quote from: pooya87 on June 20, 2024, 05:16:09 PMQuote from: The Hidebehinder on June 20, 2024, 12:07:18 PMMy question was pretty simple, and reiterating this assuming these guys would do the same as the last exchange and outbid everyone how long it will be till their transaction get confirmed assuming they have 1609190 UTXO and let's say they are batching them by the 500 at once.Each UTXO has an output script that determines how to spend it and based on that it would take a different transaction size. So as I said above if you want an accurate answer you have to write a script that takes all those types, calculates the sizes based on script type and measures the final size. For example spending a P2SH (2of3 multi-sign) would take a much bigger space than spending a P2WPKH.If you want a guess here are two ways:(1) https://blockchair.com/bitcoin/blocks#f=id,input_countBlocks usually have transactions with a sum of 5k-6k inputs so lets just take the lower value 5k. Remember that normal blocks with normal transaction have a much lower number of inputs that 500 you said.1609190 UTXOs would take 321 blocks. Each day we should get 144 new blocks that means it would take between 2.2, so lets just say 3 days to clear it out.(2) If we assume all of the inputs are P2WPKH (since a lot of the addresses in the link in OP are of this type) and with 500 inputs and 1 output the weight of this tx is about 136000 and each block max weight is 4000000 that means the block can contain 29 of these transactions or 29*500=14500 UTXO. The total of 1609190 would take 110 blocks which is less than a day to clear out with 144 blocks per day.Thanks for this!Looking at the numbers with a bit of median then we can expect anything from half a year to a nearly a full year of blockspace needed to spend or consolidate that assuming all are economically viable to do so or those are normally spendable or not this new type of ordinals or runes or whatever!I do wonder why f2poll owns most of those dusty address but that's probably something only they know if they do at all!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}