{
  "id": "topic_5440435",
  "title": "DaveF",
  "author": "DaveF",
  "created_time": "February 19, 2023, 02:23:32 PM",
  "content": "I never did until this weekend and then I saw them pop up on 2 sites that I use.They seem to have been around for a while and have some nice features. Other things seem like they are doing a lot of tracking such as you can see a list of what purchases you made at what merchants and they do allow for subscriptions so a bit more tracking of what you do. Their accepted coins list is long with a standard array of crap coins too.As I said, up until yesterday never head of them, but since they have been out there for a while I figure someone else has.Did a quick forum search but did not see them discussed, but I'm on a crap tablet VPNed into my home so thins are REALLY slow.-Dave",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440435",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "February 19, 2023, 06:43:43 PM",
      "body": "I was looking for crypto payment processors for a project a few years ago, but I was not aware of their existence until today.  I am surprised that I had never heard of them before, especially since they have been in operation for at least the last five years.From what I can tell, there is only one mention of them on this forum, in this thread from last year: What crypto payment gate is the best?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 19, 2023, 09:06:20 PM",
      "body": "There is not much information about them, even searching on Google or on this forum does not give you many results.They claim to have been working since 2020, but the lack of many user experiences is suspicious.Based on this article, it appears they received license to operate as a crypto exchange https://ca.finance.yahoo.com/news/rocketfuel-blockchain-receives-license-operate-131500772.html and https://ca.finance.yahoo.com/news/rocketfuel-announces-first-customers-aci-131500475.htmlThey are in a gray area and the best to avoid them if you have several options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 19, 2023, 09:43:27 PM",
      "body": "Spent some time poking around and reading their stock filings and such.Looks like they are doing more of the back back end kind of thing.Like one of the links that Husires posted. If you are already using ACI for your credit card and other payments you can now take crpyo payments too since they have the integration with ACI. Same with a few other things I saw with them.Might not be the worst option for a business if they want to take crypto and get fiat. If you already use one of their partners there does not seem to be much more needed for integration.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 20, 2023, 08:01:56 PM",
      "body": "Quote from: DaveF on February 19, 2023, 02:23:32 PMI never did until this weekend and then I saw them pop up on 2 sites that I use.They seem to have been around for a while and have some nice features. On first glance it looks shady.I never saw this payment processor before and I am not impressed with their website, but there is one thing I really don't like and that is involvement with their $Rpay token shitcoin.This included some pricate sale with ''discount'' price, and I think this could be the reason for them to receive some kind of ban in future, that could seriously affect their business.There is no need for using of any money grab shitcoins for creation of payment processors, and since they have offices in US this could be a real problem down the line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "February 21, 2023, 12:01:41 AM",
      "body": "I never heard of this payment processor before and I tried to check their website I can't seems to find the open-source code.If you check the domain in whois they have already been here since 2018 but that thing can be easily manipulated by just buying old/aged domains.For me, without the open source code, it is not safe to use. I will stay using BTCpay than using this unknown payment processor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "February 21, 2023, 06:58:56 PM",
      "body": "I had never heard of this cryptocurrency payment processor before, I did some research on the Rocketfuelblockchain platform, and it turned out that it is not popular and unknown; in addition to that, the official account of the platform on twitter is inactive and has not posted any updates for almost six months, and they only have 500+ followers, so I advise you, like the rest of the members who wrote comments here, to stay away from dealing with this payment processor, as there are many more popular and trusted alternatives, and user reviews and ratings will help you better identify the appropriate platform for your business. You should also choose a crypto payment processor platform that can support multiple currencies, integrate with websites and applications, provide low transaction fees, and provide a high level of security and confidentiality and must have good customer service that responds to your inquiries and solves your problems, and among the crypto gateways platforms that I recommend are:[1] BinancePay - Coinbase Commerce[2] Crypto.com[3] Nowpayments.io[4] Btcpayserver.org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}