{
  "id": "topic_5475134",
  "title": "arabspaceship123",
  "author": "arabspaceship123",
  "created_time": "November 23, 2023, 12:51:29 AM",
  "content": "It's official CZ pleaded guilty to a felony charge of violating money laundering laws. CZ's on bail at $175M. He's replaced by Richard Teng after he resigned as CEO of Binance. The exchange's got to pay $4.3B to settle the case.Did we consider Sam Bankman Fried & Changpeng Zhao would've been convicted criminals in 2023? They're going to be sentenced next year.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475134",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "November 23, 2023, 05:16:33 AM",
      "body": "Well we knew SBF was a criminal as soon as his claimed bankruptcy last November. But nobody would of expected CZ to actually be charged with all this.His exchange was actually fairly honest and never scammed or defrauded individuals. This is why it was a shock to many and many are saying is was blackrock that claimed this needs to happen for the bitcoin etf to get approved. Binance just was way too big and they want the market share to separate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "November 23, 2023, 05:26:00 AM",
      "body": "Quote from: adaseb on November 23, 2023, 05:16:33 AMWell we knew SBF was a criminal as soon as his claimed bankruptcy last November. But nobody would of expected CZ to actually be charged with all this.His exchange was actually fairly honest and never scammed or defrauded individuals. This is why it was a shock to many and many are saying is was blackrock that claimed this needs to happen for the bitcoin etf to get approved. Binance just was way too big and they want the market share to separate. He's still probably violated the AML policies so he should still be accountable. If Blackrock really is behind this and saying that it's necessary then that spells doom for us because that means that they are planning to dominate the cryptocurrency market and it does make sense that they are going to do it because they're almost getting approved for the bitcoin spot right? The least if not the best that they can do is to cripple the competition or at least slow down their growth even just a little.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vitya1982",
      "created_time": "November 23, 2023, 07:17:15 AM",
      "body": "Quote from: adaseb on November 23, 2023, 05:16:33 AMWell we knew SBF was a criminal as soon as his claimed bankruptcy last November. But nobody would of expected CZ to actually be charged with all this.His exchange was actually fairly honest and never scammed or defrauded individuals. This is why it was a shock to many and many are saying is was blackrock that claimed this needs to happen for the bitcoin etf to get approved. Binance just was way too big and they want the market share to separate. Well, saying that nobody was expecting that is a bit wrong. There was a lot of FUD around Binance and CZ. People suggested that they don't have all BTC that they claim to have, and were suspecting some other shady stuff. I'm not saying that it's true, but there were some suspicions that's for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 23, 2023, 07:31:46 AM",
      "body": "As far as we know at this time, CZ does not appropriate users' money for personal purposes.Although the fine figure makes many people afraid and makes it difficult to send unconvincing signals, I do not have much doubt about Binance's ability to operate, and honestly, after this incident, I still think they will step down, entering the new market cycle and continuing to bring the vibrant atmosphere of the altcoin environment.And this is the reason why Satoshi disappeared and never appeared..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 23, 2023, 07:33:16 AM",
      "body": "Quote from: adaseb on November 23, 2023, 05:16:33 AMWell we knew SBF was a criminal as soon as his claimed bankruptcy last November. But nobody would of expected CZ to actually be charged with all this.Did you know the meaning of violating the anti money laundering law? CZ violated it and it may worth being jailed, but was not jailed. He was instead told that Binance should pay a settlement of $4.3 billion and he was granted bail which means he can still be arrested again.Quote from: adaseb on November 23, 2023, 05:16:33 AMHis exchange was actually fairly honest and never scammed or defrauded individuals. This is why it was a shock to many and many are saying is was blackrock that claimed this needs to happen for the bitcoin etf to get approved. Binance just was way too big and they want the market share to separate. Binance has been a good exchange though but there is nothing Blackrock has to do with this. If Binance is existing, Blackrock will still begin providing bitcoin spot ETF to their customers. Also not that Binance has stopped operation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "November 23, 2023, 08:58:43 AM",
      "body": "The exchanges cases are different but they've seen what happens if you're not 100% honest. FTX was so big it decided to commit fraud playing dangerous gambling with investors cash. Binance didn't defraud investors or steal but it tried to dominate the American market as fast as it could've so cut corners which's why they faced laundering allegations.Quote from: adaseb on November 23, 2023, 05:16:33 AMWell we knew SBF was a criminal as soon as his claimed bankruptcy last November. But nobody would of expected CZ to actually be charged with all this.His exchange was actually fairly honest and never scammed or defrauded individuals. This is why it was a shock to many and many are saying is was blackrock that claimed this needs to happen for the bitcoin etf to get approved. Binance just was way too big and they want the market share to separate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 23, 2023, 09:13:52 AM",
      "body": "I guess that $4B settles everything and CZ won't be ending up behind the bars. Although we're not defending him as he admitted that he committed that he's part of the money laundering based on what I've read about this case.While SBF, clearly spent and used people's fund and that's why he's convicted.Quote from: vitya1982 on November 23, 2023, 07:17:15 AMWell, saying that nobody was expecting that is a bit wrong. There was a lot of FUD around Binance and CZ. People suggested that they don't have all BTC that they claim to have, and were suspecting some other shady stuff. I'm not saying that it's true, but there were some suspicions that's for sure.It's always like that for most projects that they end up being criticized for not having the actual back up for the amount that they're projecting to people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 23, 2023, 10:40:31 AM",
      "body": "I knew CZ was being accused of some serious crimes in the United States, but I would have never expected him to plead guilty on making easier laundering through Binance. Binance is a very huge ecosystem so it is to be expected their staff won't have Information or everything under control at all times. In the end it does not matter because he as the former CEO was the biggest responsible of all those measures, in the eyes of the law. I doubt CZ will see any time in prison, by the way, unlike SBF I do not think CZ had bad intentions or malice when conducting their exchange operations.Whatever happens, hope for the best for Binance and the honest people who work there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "November 23, 2023, 10:44:10 AM",
      "body": "It's confirmed CZ didn't steal from Binance customers but he's the head of the company when laundering happened. The deal's going to let Binance continue trading. SBF's max sentence could be 115 years but we don't know about CZ.We don't know why Satoshi disappeared it's a mystery. We're probably never going to learn the truth about who Satoshi was but I've discussed his writings Why did Satoshi use GB British English and international English ?Quote from: bluebit25 on November 23, 2023, 07:31:46 AMAs far as we know at this time, CZ does not appropriate users' money for personal purposes.Although the fine figure makes many people afraid and makes it difficult to send unconvincing signals, I do not have much doubt about Binance's ability to operate, and honestly, after this incident, I still think they will step down, entering the new market cycle and continuing to bring the vibrant atmosphere of the altcoin environment.And this is the reason why Satoshi disappeared and never appeared..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 23, 2023, 11:56:19 AM",
      "body": "Quote from: arabspaceship123 on November 23, 2023, 12:51:29 AMIt's official CZ pleaded guilty to a felony charge of violating money laundering laws. CZ's on bail at $175M. He's replaced by Richard Teng after he resigned as CEO of Binance. The exchange's got to pay $4.3B to settle the case.Did we consider Sam Bankman Fried & Changpeng Zhao would've been convicted criminals in 2023? They're going to be sentenced next year.There's nothing that cannot come over CZ or Sam Bankman Fried for every deeds they made in the past, that's all about hunting shadow, do we think the way US is disturbing Binance and CZ is just an ordinary attack, things like this are part of the reasons and we don't just have to wait and see the dooms day with them both before we know the necessary actions to take against using them for any reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptounityCUT",
      "created_time": "November 23, 2023, 12:09:05 PM",
      "body": "Definitely, they found something that was not in regulation, but of course, it's the kind of news that we didn't expect. I was asking myself, probably propaganda starts to attack the crypto space. Binance is one of the biggest Bitcoin holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "November 23, 2023, 12:19:15 PM",
      "body": "Quote from: adaseb on November 23, 2023, 05:16:33 AMWell we knew SBF was a criminal as soon as his claimed bankruptcy last November. But nobody would of expected CZ to actually be charged with all this.I doubt nobody think that CZ will be charged because he was being target by SEC and DoJ many times while the only thing he do was deny it using his troll follower without any evidence supporting his innocence.I believe CZ is involved on shady things since he sold out FTX when he attack them without thinking the repercussions of user funds that will stuck in there. Allowing Luna foundation to still be trade despite the market is suffering a heavy attack. All the sign is  already but he is just can’t investigate because he keeps changing HQ to dodge the law.CZ is the real culprit in all crypto shit happened in the past while he just being protected by his blind followers. Even if he is now plead guilty his follower think he is still a hero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "November 23, 2023, 12:21:57 PM",
      "body": "I rest my case about CZ, he is really guilty and he is going to be behind bars for 18month, this is not the final but the hearing of CZ fate will happen somewhere in January or February of 2024 max, I think he isn't the hero we think he is after all, he lied and he was caught, sorry I read dip about this news yesterday and I don't have the link to the website anymore, I think this man is going to prison. There is nothing that the law will understand about trying to safe crypto by lying, when you aren't truthful the law will use that against you anyway, SBF sentence won't be like CZ for sure but this can't be overlook, and also remember that some people do what CZ to be dealt with, even those behind SBF. If CZ came into this crypto space with his own DEX it would have worth it, all he have to do is stay hidden just like Satoshi, anyone running any business in this space using centralization is calling for trouble with the law, Bitcoin saved itself from all these controllers because it's fully decentralized and no one knows who Satoshi really his, developers should learn from Bitcoin and it's maker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "November 23, 2023, 12:32:57 PM",
      "body": "Quote from: adaseb on November 23, 2023, 05:16:33 AMWell we knew SBF was a criminal as soon as his claimed bankruptcy last November. But nobody would of expected CZ to actually be charged with all this.His exchange was actually fairly honest and never scammed or defrauded individuals. This is why it was a shock to many and many are saying is was blackrock that claimed this needs to happen for the bitcoin etf to get approved. Binance just was way too big and they want the market share to separate. This is exactly what they are aiming for. Binance is too big and if it doesn't intervene soon, the entire market share will fall into the hands of CZ. This is something that Wall Street investors like Blackrock do not want. I know many people here don't like CZ because he is the CEO of the largest centralized exchange in the market but it would be lame to compare CZ with SBF, a guy who intentionally scams people. Meanwhile, Binance and CZ are doing very well and everyone is satisfied with their services. What is happening is just a redistribution of the market and Wall Street is gradually entering the market and manipulating it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "November 23, 2023, 12:33:37 PM",
      "body": "It's quite unfortunate when I hear the news about CZ, even though CZ is a good CEO of Binance in my opinion compared to SBF who is clearly a fraud. Binance and CZ were quite problematic when joining and opening Binance US and many other issues. We all know US how, they always want to control everything.Gary Gensler After rising as SEC, The crypto market has always been a target and Binance is one of them. Crypto idealism has been destroyed and the concept of crypto that was originally with the aim of decentralized has been mastered by capitalists, and it turns out that it didn't take long to be able to master crypto.CZ's mistake was why he had to open Binance US and this backfired which made him have to resign.And the US is already profiting now by getting fresh funds from fines received from Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 23, 2023, 12:34:04 PM",
      "body": "Quote from: KiaKia on November 23, 2023, 12:21:57 PMI rest my case about CZ, he is really guilty and he is going to be behind bars for 18month, this is not the final but the hearing of CZ fate will happen somewhere in January or February of 2024 max, I think he isn't the hero we think he is after all, he lied and he was caught, sorry I read dip about this news yesterday and I don't have the link to the website anymore, I think this man is going to prison. There is nothing that the law will understand about trying to safe crypto by lying, when you aren't truthful the law will use that against you anyway, SBF sentence won't be like CZ for sure but this can't be overlook, and also remember that some people do what CZ to be dealt with, even those behind SBF. What do you think he lied about, really? I mean, I'm not really a fan of the guy, but comparing him to SBF, who embezzled user funds, is off base, and I'm curious to know more about the details and what led you to believe he's guilty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "November 23, 2023, 12:55:49 PM",
      "body": "Quote from: taufik123 on November 23, 2023, 12:33:37 PMIt's quite unfortunate when I hear the news about CZ, even though CZ is a good CEO of Binance in my opinion compared to SBF who is clearly a fraud. Binance and CZ were quite problematic when joining and opening Binance US and many other issues. We all know US how, they always want to control everything.Gary Gensler After rising as SEC, The crypto market has always been a target and Binance is one of them. Crypto idealism has been destroyed and the concept of crypto that was originally with the aim of decentralized has been mastered by capitalists, and it turns out that it didn't take long to be able to master crypto.CZ's mistake was why he had to open Binance US and this backfired which made him have to resign.And the US is already profiting now by getting fresh funds from fines received from Binance.I think the comparison is wrong and erroneous between CZ as Binance CEO and SBF the CEO of FTX exchange, CZ have good reputation although SEC Commission due money laundering with Binance US. The exchange of CZ still operation well and not face problem with withdrawing fund and difference with cases happened to SBF who make FTX scam and run away much investors fund. CZ and Binance have reach deal agreement for paying $4.3B settlement to American regulators regarding his mistake with money laundering and leaves his position as Binance CEO. I don't know what happen with SEC Commission always attack with all exchange cryptocurrency owner, I don't sure they will stop for hunting the next target and pressure them to pay more money as did by CZ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "November 23, 2023, 01:13:27 PM",
      "body": "Quote from: armanda90 on November 23, 2023, 12:55:49 PMI don't know what happen with SEC Commission always attack with all exchange cryptocurrency owner, I don't sure they will stop for hunting the next target and pressure them to pay more money as did by CZ. That's why others should be alerted to this event because they will be the next target and they should prepare their statement and evidence that would make them innocent. Whatever it is, they shouldn't be slacking off even a small piece of evidence and loopholes in their exchanges because that's what the SEC needed from them in order to prove them guilty and make them pay with it. I hope Binance will continue its operation despite this kind of bad scenario in its crypto journey because lots of people are counting on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "November 23, 2023, 01:32:29 PM",
      "body": "Quote from: arabspaceship123 on November 23, 2023, 10:44:10 AMIt's confirmed CZ didn't steal from Binance customers but he's the head of the company when laundering happened. The deal's going to let Binance continue trading. SBF's max sentence could be 115 years but we don't know about CZ.But wait, are you justifying reasons that CZ is better than SBF, I don't quite understand what you mean by one used customer money and the other did only money laundering.A crime is a crime and if you are found guilty, you will definitely pay for the crime. No two ways about it, he has been the CEO for many years, there is no way he was going to deny that such activities has not be going on, he should have acted smartly to voice out and let the world knows instead he kept mum until US found out and now they are doing damage control, lmao.  He will do his time and the sentencing will come on February according to media, it will come before SBF prosecution day but he will last months because he will is not responsible for loss but he did accomplish a crime and that is what that fines will be settle for $4BQuoteWe don't know why Satoshi disappeared it's a mystery. We're probably never going to learn the truth about who Satoshi was but I've discussed his writings Why did Satoshi use GB British English and international English ?Quote from: bluebit25 on November 23, 2023, 07:31:46 AMAs far as we know at this time, CZ does not appropriate users' money for personal purposes.Although the fine figure makes many people afraid and makes it difficult to send unconvincing signals, I do not have much doubt about Binance's ability to operate, and honestly, after this incident, I still think they will step down, entering the new market cycle and continuing to bring the vibrant atmosphere of the altcoin environment.And this is the reason why Satoshi disappeared and never appeared..Satoshi is ahead of anyone in crypto and he did the best thing by not coming online and letting the people do what they want but I believe Satoshi intension were for good. The reason why I think he never come online again was to never allow any form of centralization through his influence and it's better that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}