{
  "id": "topic_5406723",
  "title": "Maestro75",
  "author": "Maestro75",
  "created_time": "July 18, 2022, 02:12:56 PM",
  "content": "There is something that am thinking and that has to do with accounts whose owners have been confirmed and announced dead in this forum. My question is this, what if that account becomes active again and begins posting? Is it going to terrify anyone thinking we have spirits lurking here or will that lead us to think a hacker or scammer is at work? But that can be any member of the dead forum user's family who eventually found the password to that account and decides to continue with it so they can earn and support themselves financially from it, maybe because the account is already high ranked. What will likely be the reaction of members of the forum to that?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406723",
  "comments": [
    {
      "author": "Apocollapse",
      "created_time": "July 18, 2022, 02:16:56 PM",
      "body": "This mean the account have been changed hands and everyone should know the person behind that's account no longer the person who already passed away, so it's deserve a red tag to warn other members.A hacker, scammer, bad person, or even good person that already controlled that account, I don't care. What I know is, I can't trust that's account anymore.If he want to start his journey in this forum, he should create a new accounts and start from bottom, to see how his contribution and can be trusted or not.I don't think this forum is just the only way to earn money, you can go work in McDonald and got payed more than joining bounties/signature campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "July 18, 2022, 02:24:49 PM",
      "body": "I think that if the community is notified if the person's death, a neutral tag will be given to the account. In my experience, when a member of my local board passed on,  Becky666, his account was given neutral tags. If that account becomes active again, we know for certain that the person behind the account isn't the rightful owner whether it is a family member, next of kin.. This brings an interesting question. Are bitcointalk account heritable?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 18, 2022, 02:28:46 PM",
      "body": "Move this to meta or reputation.Quote from: Maestro75 on July 18, 2022, 02:12:56 PMWhat will likely be the reaction of members of the forum to that?Definitely not the owner of the account, it has to be given neutral tag that people should be careful with the user. It can be a hacked account.If it is the family member of the person that is using it to make it active, people should still be very careful with the account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 18, 2022, 02:58:25 PM",
      "body": "Quote from: Maestro75 on July 18, 2022, 02:12:56 PMThere is something that am thinking and that has to do with accounts whose owners have been confirmed and announced dead in this forum.Online is hard to confirm things. Especially confirmation on death. Who will confirm it and how, with what proofs? Who will announce confirmations? Lot of things you can not trust and verify if you don't know the owner of that account in person.QuoteMy question is this, what if that account becomes active again and begins posting?Forum has information on seclog with woke up, password reset via email or secret question, recovery. In profile page, you can see orange highlighted text: woke up after a long inactive period, password changed. It is enough of warning from forum side.If you are a member and want to make warning by trust feedback. I think a neutral feedback is enough.Forum account: security, privacy, and recoveryLoyceV's Beginners guide to correct use of the Trust systemQuoteIs it going to terrify anyone thinking we have spirits lurking here or will that lead us to think a hacker or scammer is at work?If woke up, password change go together with loan request, scam activities, it should be a negative trust feedback.QuoteBut that can be any member of the dead forum user's family who eventually found the password to that account ad decides to continue with it so they can earn and support themselves financially from it, maybe because the account is already high ranked. What will likely be the reaction of members of the forum to that?Their family can use account from dead member. Hacker can use it and more. Forum does not deactivate accounts from dead members. Only a very rare cases will have termination like Lauda, or locked like satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "July 18, 2022, 03:00:03 PM",
      "body": "Quote from: Pokapoka124 on July 18, 2022, 02:24:49 PMThis brings an interesting question. Are bitcointalk account heritable? AFAIK, no they are not, i mean a bitcointalk account shouldn't be so important as to be inherited by any other person than the original user, if a user is dead, or decides to abandon their account, that should be the end of it, if any of their family member likes Bitcointalk, they will have to register their own personal account and start their own Bitcointalk journey.Bitcointalk has a lot to do with trust and reputation, which makes it absurd to be inheritable, imagine an account with a whole lot of positive trust and a good reputation in the hands of someone else who isn't the original user, that person can use the account to scam people. Post quality is another thing, it will be very annoying for a quality posters account to fall into the hands of someone that is not so good at posting, and the posts go from high quality to garbage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 18, 2022, 03:27:08 PM",
      "body": "I agree that neutral feedback as a warning is a sufficient measure, at least for those who know how to get that information, although perhaps all confirmed deceased members could have a special badge in the form of a black ribbon or something similar that would indicate that the original owner has passed away. Nowhere in the rules of the forum is forbidden for family members to take control of the BTT accounts of their deceased, so one of the most popular BTT accounts was revived three years after its owner passed away. It is about Hal Finney who passed away in 2014, while his account was last active in early 2017, and two members left neutral feedback after that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "July 18, 2022, 03:34:39 PM",
      "body": "Quote from: Maestro75 on July 18, 2022, 02:12:56 PMaccounts whose owners have been confirmed and announced dead in this forum. My question is this, what if that account becomes active again and begins posting?With this, that means there's every possible doubt about the account itself either from the real owner's end or from the person that has taken over with the account after his demise, this has to do with the trust system being placed on the account, but our actions in doing that may not be accurate enough because I don't see how such account can verified that it's not hacked or taken over by scammers, it may be the legitimate child or wife of the deceased using it, the real owner might have lied about his death, he might have been rumoured to be dead maybe due to inactiveness of his account, and what if the user was able to sign a message with the account, but i think it now depends on what activities been carried out with the account before and after the said event to also determine the judgement on the account which i think the moderators or admin knows better in this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "July 18, 2022, 06:06:44 PM",
      "body": "Quote from: OcTradism on July 18, 2022, 02:58:25 PMOnline is hard to confirm things. Especially confirmation on death. Who will confirm it and how, with what proofs? Who will announce confirmations? Lot of things you can not trust and verify if you don't know the owner of that account in person.There have been confirmed cases of deaths here. I can recall up to three cases right now and one of them is from my local board, Becky666. There are members here who also have people who know them outside here in real life.Quote from: OcTradism on July 18, 2022, 02:58:25 PMForum has information on seclog with woke up, password reset via email or secret question, recovery. In profile page, you can see orange highlighted text: woke up after a long inactive period, password changed. It is enough of warning from forum side.Am not talking of change of password or anything. I mean they continue using the account without changing anything because they now have access to it. It is not like hacking it in the true sense if it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 18, 2022, 06:18:28 PM",
      "body": "If relatives continue to use the account of a deceased person, then surely the spirits will not help them with this. That is, having someone else's account is not yet having the brain of that person and the knowledge of the person who died.If we know for sure that the owner is dead, and this is already a rather complicated statement, there will definitely be a difference in the publication, which will necessarily incur consequences, if not a negative review, then a big warning in the form of a neutral tag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 18, 2022, 06:36:03 PM",
      "body": "If the owner was dead then the account has changed hands, clearly. And people may find this out even if the death was not announced on the forum (e.g. writing style changes, difference in knowledge, habits, preferences...)If indeed the account is taken over by a member of his family, the forum may just give a neutral tag. In the other cases, I do expect somebody will paint it in red, since the new owner may have been hacking or buying the account then coming with a story to get away with this.So I would not really count on it that a neutral feedback will be all that the account will get. It really depends on each and every one's judgement...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "July 18, 2022, 10:06:14 PM",
      "body": "If a user dies, his/her properties such as land, houses are inherited and used by the relatives. Then, if it is social media account, any relative that has access to it could use it. When one dies, relatives use the phone and maybe the number. I believe it should be same for bitcointalk, the only difference is the trust rating. If accounts change hands, for the safety of the community, there should be a neutral tag to alert the members of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "July 19, 2022, 08:44:30 AM",
      "body": "Quote from: Maestro75 on July 18, 2022, 02:12:56 PMThere is something that am thinking and that has to do with accounts whose owners have been confirmed and announced dead in this forum. My question is this, what if that account becomes active again and begins posting? Is it going to terrify anyone thinking we have spirits lurking here or will that lead us to think a hacker or scammer is at work? Obviously, there's a change of hands the former owner who is confirmed dead left the password and email to the new owner who could be his relatives or friendsQuoteBut that can be any member of the dead forum user's family who eventually found the password to that account and decides to continue with it so they can earn and support themselves financially from it, maybe because the account is already high ranked. What will likely be the reaction of members of the forum to that?if it's one of the relatives I'm ok with it as long as the owner will continue the legacy of the former owner, if the account has a good reputation here he should continue it and add more merits and trust, there's a lot of accounts that change hands in the past and even now it continues to exist as long as they are not scamming and spamming the forum and the account is a relative of the former owner, but it's different if it is bought or hacked, the community frown on that changing of accounts and I will not support this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 19, 2022, 06:54:08 PM",
      "body": "Changed hands actually aren't prohibited by the forum. So we can't expect any action from the forum if dead users account become active. If I notice such a case I would leave neutral feedback about changed hands. As long as they do not abuse the forum trust system it's fine for me. But definitely, I would keep an eye to monitor activity. Because we don't know who is behind the account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 19, 2022, 07:02:00 PM",
      "body": "As far as I'm aware, and don't quote me on this as I vaguely remember it, in the past theymos has locked accounts by banning the account which the user was confirmed deceased. Obviously, I don't know what the requirements for that would be, and not even sure if I'm remembering that correctly. I'm pretty sure it has happened in the past though. However, I can't remember who. I just checked some that were pretty public with their declining health though, and seems they weren't banned, so I'm starting to doubt if I'm misremembering it. Obviously, the user might want to pass their account onto their family, and they're entitled to do that if they wish. However, I imagine most users would rather keep their online presence as their own upon passing. In the unlikely scenario where a user has already made it clear to either the admins or the community they wish to pass it onto their family if they were ever to pass, I wouldn't treat it as suspicious as long as it could be confirmed. I mean, I suspect it would be treated suspiciously without any proof of that death mind, because as sad as it sounds it would likely be abused by account sellers, which obviously the community isn't supportive of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 19, 2022, 07:05:08 PM",
      "body": "Quote from: Welsh on July 19, 2022, 07:02:00 PMHowever, I imagine most users would rather keep their online presence as their own upon passing. If I die and if my girl wants to reactive this account then my ghost will be happy to know it. But you need to understand, my girl will not have same interest as me. The users are brother to me they will become uncle to her. Unless she makes it public they will be confused.I wonder how would you guys take it once she will confirm her ownership of the account which she will inherit from me? Are you going to address her, niece bitcoingirl.club?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 19, 2022, 07:19:41 PM",
      "body": "Quote from: lovesmayfamilis on July 18, 2022, 06:18:28 PMIf relatives continue to use the account of a deceased person, then surely the spirits will not help them with this. That is, having someone else's account is not yet having the brain of that person and the knowledge of the person who died.If we know for sure that the owner is dead, and this is already a rather complicated statement, there will definitely be a difference in the publication, which will necessarily incur consequences, if not a negative review, then a big warning in the form of a neutral tag.I agree more about the neutral tag than the negative for an account that changes hands after being confirmed dead. But there are clear consequences for cases like this if the real person behind the account is not the heir but the hacker or the new user who bought the account. The reputation of such an account can never be trusted again unless the primary owner [before death] has made it known to the public who will inherit the ownership of the next account.I haven't thought about having an heir to this account. This is a dilemma that most people will probably feel, but perhaps we should take it as a reason to continue the knowledge of bitcoin in the next generation. They may never be the same, but it is still possible to teach them the correct knowledge of bitcoin and its uses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 19, 2022, 07:59:00 PM",
      "body": "Quote from: Maestro75 on July 18, 2022, 02:12:56 PMThere is something that am thinking and that has to do with accounts whose owners have been confirmed and announced dead in this forum. My question is this, what if that account becomes active again and begins posting?There are a dozen debatable reasons for an account to be declared dead, then active.For example: positive thinking and logic.• A relative or close friend, can use the account, while the primary owner provides the password, before he dies.Negative thinking.• For sale or hacked, but chances are slim.But in a case like this, if the account is used by his family, the main owner will provide all the data related to the account/exchange/wallet/address signed for security and risk in using, account in the future, if needed, even if the post is not the same as the main owner.Sold and hacked, if they (the current owners) can't show/verify the signed address, plus a post that is much different from the main owner, most likely the account has been sold and hacked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 19, 2022, 08:31:52 PM",
      "body": "Quote from: _BlackStar on July 19, 2022, 07:19:41 PM agree more about the neutral tag than the negative I don't understand the difference. If the account is hacked, it's a scam. If the account has been inherited, this is the same fraud.How can we trust a relative? Did he take over all the knowledge and skills of the previous owner at the gene level? Will the second owner prove kinship? How? Or maybe he decides to sell it. Again, how to find out the relationship?Why doesn't he start an account on his own behalf and grow it on his own? Are there any privileges? Is this allowed on the forum?It all comes down to the fact that the account of a deceased person will qualify for participation in signature companies; otherwise, why not develop your account? It follows from this that there is absolutely no difference between a hacker and a relative.Benefits work here and there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 19, 2022, 09:16:32 PM",
      "body": "Quote from: lovesmayfamilis on July 19, 2022, 08:31:52 PMQuote from: _BlackStar on July 19, 2022, 07:19:41 PM agree more about the neutral tag than the negative I don't understand the difference. If the account is hacked, it's a scam. If the account has been inherited, this is the same fraud.I think you forgot to mention one and that is,Even if it should be the deceased to have risen from the dead, the user is primarily not the same person anymore.You can't cross realms and still get to come back whole and be the same.Reputations are something we can't transfer and as such, I won't trust it. Be a sibling, relative, parent, friend, spouse and whatever relationship that might exist within our worldly existence, the user is gone and its done.Having access to the account doesn't make it original. The bottom line woul always be, its a new user behind the account and there would always be changes in content to prove and it remains that, the user can't be trusted. It's better off starting anew or maybe buy a corper membership account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}