{
  "id": "topic_5414740",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "September 24, 2022, 01:52:47 PM",
  "content": "Puede ser cierto, o una aparente relación que en la práctica no existe, pero el día antes de registrarse bitcoin.org por parte de Satoshi, alguien registró el nombre de netcoin (que no me digas no tiene un tono similar a bitcoin) en AnonymousSpeech, el proveedor de servicios Japonés para registrar dominios de manera anónima por aquel entonces.El dominio netcoin.org no tuvo contenido durante sus primeros años, y podría haber sido un nombre alternativo que se barajó. De hecho, las (supuestas) versiones preliminares del whitepaper de bitcoin parecían hablar de eCash, luego la terminología tiene pinta que dio varias vueltas antes de consolidarse en el nombre definitivo de Bitcoin.De hecho, es un ejercicio interesante (posiblemente el que ha hecho el autor del hallazgo): bajarse toda la lista completa de dominios (.org) y buscar nombres afines registrados entorno al 18/08/2008. He encontrado un sitio que lo proporciona, pero como era de esperar, la información es de pago...Ver: https://cointelegraph.com/news/bitcoin-was-almost-named-netcoin-by-satoshi-nakamoto-hints-domain-data",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414740",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "September 24, 2022, 02:39:08 PM",
      "body": "El echo de que la dirección y el teléfono sean los mismos nos confirma que la persona que registró el dominio es la misma persona. Por lo tanto hay una gran posibilidad de que Bitcoin podría haber sido llamado Netcoin en un principio. Personalmente me gusta mas el nombre de bitcoin, creo que el de Netcoin no abarca lo que es la criptomoneda. De momento se me ocurren otros nombres que hubieran sido interesantes como ChainCoin o CryptoCoin, sin embargo sin nombres muy largos por lo que Bitcoin se me hace un excelente nombre para el proyecto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 24, 2022, 03:53:21 PM",
      "body": "Quote from: seoincorporation on September 24, 2022, 02:39:08 PM<…>Los datos de contacto son, diría, realmente de la entidad registradora, que entiendo hace de proxy de alguna manera para sus clientes anónimos.Por cierto, que ahora me está costando encontrar el sitio que usó el autor de la imagen, donde la fecha de creación del dominio era del 2018. Los que estoy mirando me dan fechas del 2010, que es cuando el dominio parece que cambió de manos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 24, 2022, 04:24:08 PM",
      "body": "Hay quién opina que las casualidades no existen. Sí existen, aunque en este caso, con un día de diferencia, al parecer misma zona horaria... es mucha coincidencia (habría que ver cuántos xxxcoin se creaban al día, porque igual era más común de lo que imaginamos, dentro de la maraña de dominios que es Internet. Que actualmente se crearán varios al día no me cabe duda, pero por aquella época...).Netcoin no me disgusta del todo; me gusta más Bitcoin, aunque debe ser ya por familiaridad (lo de Bit y coin en un principio creo recordar que me pareció un poco cutre).Sea como sea, hablamos de un grupo de expertos en criptografía, no en marketing. Bastante mérito tuvieron en crear la blockchain, y toda la filosofía asociada a Bitcoin. Aunque el nombre sea mejorable, es secundario. Pero es interesante la labor de arqueología, y descubrir los pasos que siguieron para conseguir lo que han conseguido (hablo en plural, pero como sabéis me refiero a Satoshi).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 24, 2022, 07:05:10 PM",
      "body": "Bueno, todo apunta a qué efectivamente Bitcoin pudo haber estado muy cerca de tener un nombre alternativo, quizá sea porque ya estoy acostumbrado, pero Bitcoin me gusta más que otras alternativas mencionadas por aquí.Aprovecharé este hilo para hacer una pregunta, que me ha estado acosando desde que me uni a la comunidad de Bitcoin desde hace un par de años y que no he resuelto.¿Bien creo el logo de Bitcoin.?me refiero no solo a la simbología de BTC, sino también a la imagen del círculo naranja con con la BTC inclinada en el centro. ¿Fue Satoshi? ¿o fue alguien posterior a el? De ser Satoshi, seguramente fue algo que hizo en los primeros días de Bitcoin y lo hizo de forma simplificada, sin saber el enorme impacto de su diseño gráfico.¿Existe una hoja de dibujo tenico que muestre como dibujar el logo? (Cómo ocurre con otros símbolos estándar como el $ y el €)¿Acaso el BTC está inclinado 21° con relación a la horizontal?Por cierto, esa es una de las cosas que me gustan del logo, es simple pero reconocible a nivel mundial, como la manzana de Apple o la bandera de Microsoft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 24, 2022, 08:40:15 PM",
      "body": "Quote from: Hispo on September 24, 2022, 07:05:10 PM¿Bien creo el logo de Bitcoin.?me refiero no solo a la simbología de BTC, sino también a la imagen del círculo naranja con con la BTC inclinada en el centro. ¿Fue Satoshi? ¿o fue alguien posterior a el? Al parecer fue Satoshi y, posteriormente, Bitboy por encargo suyo, aunque no conozco los detalles de la historia.En este post del norte puedes ver la breve pero sorprendente evolución del logo. Aparte de no dedicarse al marketing, parece que tampoco se dedicaban a la ilustración los expertos en criptología a los que me refería en mi otro post   ¡BC!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 24, 2022, 08:44:10 PM",
      "body": "Llevo un buen rato intentando ver porqué el autor del hallazgo da fechas del 2018 en relación al dominio de coinnet, mientras que todas las herramientas de retorno de información de dominios me dan datos del 2010.Según he visto, @Or Weinberger, el autor de la información, obtuvo los datos de la imagen mostrada en el OP a través de una suscripción de pago a domaintools, donde uno puede obtener datos de los cambios históricos a la información del dominio (ver https://twitter.com/orweinberger/status/1573337271394254850?cxt=HHwWhICy1bL6ztUrAAAA).Si miramos la herramienta, la página que nos daría la información histórica diría que sería ésta:https://domainreport.domaintools.com/netcoin.orgSi no tenemos una suscripción de pago, ni queremos pagar los 49$ que cuesta el informe, por lo menos podemos ver que la página indica albergar información del dominio y los cambios sobre el mismo desde hace 14 años, empezando el 18 de agosto del 2008, la fecha clave que buscábamos.En el artículo de Cointelegraph se cita que:QuoteThe Netcoin.org domain was later deleted and re-registered to a subsidiary of Web.com in 2010.No control los detalles de lo que sucede con los dominios, pero da la sensación de que lo anterior justifica en gran parte el misterio de las fechas entre la imagen del OP y lo que indican los who is actualmente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 25, 2022, 01:26:33 AMLast edit: September 28, 2022, 07:29:49 PM by famososMuertos",
      "body": "Realmente creo que es solo una probabilidad, el promedio de registro de dominio por año ronda los millones y en el caso de la extensión .org es uno de los más solicitados, pero sin duda que al analizar los datos mostrados hay que decir, mmhh!... en todo caso haciendo de este caso presentado un hipotético conocimiento verdadero de la respuesta (cosa que no sabemos en la realidad) pero digo, para un concurso serio relacionado al bitcoin, diría, No. Aunque si me dan chance de llamar a un amigo, el mejor seria SN.  ________Gracias Porfirii por el link.Voy agregar esta conversación que tuvimos en su momento a FullNode :Quote from: FullNode on March 11, 2020, 09:39:00 AMQuoteLa historia y el simbolismo detrás del logotipo de BitcoinLa moneda naranja se ha convertido en un símbolo reconocible a nivel mundial, pero bitcoin no vino con esta marca apenas salió. Como con cualquier cosa relacionada con Bitcoin, Satoshi Nakamoto creó un logo rudimentario en los primeros días de la moneda descentralizada, y la comunidad repitió este símbolo hasta que se quedó.https://www.criptonoticias.com/comunidad/curiosidades/historia-simbolismo-logotipo-bitcoin/ampEl logotipo de bitcoin es su identificador,tambien es plagiado en otros proyectos,cambian color,inclinacion,las personas que no han visto una criptomoneda en su vida no distinguen por un logo si estan a punto de comprar un bitcoin real o una copia de bitcoin.Hispo: Hay algunos link en el desarrollo del hilo que de todos los que existen en la relación al tema encaminan en la historia real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "September 26, 2022, 10:03:54 PM",
      "body": "Pues sin lugar a dudas es una posibilidad interesante, como lo es casi cualquier cosa que nos lleve a los días primigenios de bitcoin, sin embargo, es una de esas cosas que no creo que hubiese tenido gran impacto, después de todo aunque me parece que la mayoría preferiría el nombre de bitcoin sobre netcoin esto me parece que tiene que ver más con la costumbre que con una valoración objetiva de cuál de los dos nombres es mejor.Después de todo ninguno de los dos nombres me parece demasiado descriptivo acerca de la verdadera naturaleza de bitcoin y los nombres barajados tampoco me parecen extremadamente atractivos, aunque le daría mucha ventaja al nombre bitcoin sobre netcoin cuando se trata de la simbología, el logo de bitcoin y el símbolo usado para representarlo me parecen muy fuertes y pienso que serían más débiles si Satoshi se hubiese decantado por el nombre netcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 27, 2022, 08:18:26 AM",
      "body": "Yo creo que el nombre hubiese sido indiferente. A mi entender, el \"bit\" no es que aporte una gran carga semántica sobre \"net\" como prefijo, y aunque cada uno tiene su connotación particular de contexto, no veo que sea para nada decisivo el haber usado uno u otro prefijo. Estoy convencido de que si el nombre hubiese sido Netcoin, no habría diferencia en apreciación ni aceptación de Bitcoin como red, ni bitcoin como moneda.He persistido en intentar encontrar algún sitio donde recabar los nombre de los dominios creados en una fecha determinada, sea de manera global, por extensión, o por compañía registradora, pero no hay manera de entrar en la gratuidad de la información en este terreno. Supongo que ya lo habrá mirado el autor del hallazgo, pero quería ver si habían dominios con el patrón *coin.org (o *coin.* de manera más genérica) en un intervalo de semana arriba, semana abajo, respecto del 18/08/2008. Creo que aquí se quede mi intento en este ejercicio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}