{
  "id": "topic_5466575",
  "title": "MetaDev",
  "author": "MetaDev",
  "created_time": "September 12, 2023, 09:02:32 PMLast edit: September 19, 2023, 06:44:36 PM by MetaDev",
  "content": "Image:https://cdn.discordapp.com/attachments/1150802626250805250/1150860721928806400/Add_a_heading_4.pngDescription: Paperclip is a powerful data breach search engine that allows users to quickly and securely search for breaches based on email addresses and phone numbers. Our robust search engine provides real-time results and ensures the privacy and security of user queries. Whether you're an individual concerned about your online security or a business safeguarding customer data, Paperclip is your go-to solution.Features:• Secure User registration, login, and forgot password functions for secure access• Advanced Search: Easily search for data breaches using email addresses or phone numbers.• Email Search Verify if your email address has been compromised in any data breaches.• Phone Number Search Check if your phone number has been exposed in any breaches.• Detailed Results, Reveal comprehensive breach details, including website names and Credentials.• Account credits system to pay for searches• Integrated payments via PayPal and Coinbase Commerce (cryptocurrency BTC)• Affiliate referral system to earn rewards• Email notifications• File storage on Cloud or local server (for your external data uploading)• Configurable search engine - local or cloud-based• Admin dashboard to manage users and settings• Secure authentication and reCAPTCHA protection• Rate limiting to prevent abuse• Customizable templatesTechnologies Used:• Python (Flask framework)• MySQL• HTML & CSS• Frontend (jQuery and Bootstrap)• Payment processing (PayPal, Coinbase Crypto)• Cloud storage (WASABI)• Bot prevention (reCAPTCHA)Real-Time Data Breach Search:• Paperclip allows instant queries of data breaches by email address or phone number. The advanced search engine checks the latest databases in real-time and displays matching results immediately[/li][/list]• Interested? join our discord for additional informations: https://discord.gg/Y3Vc95xMWA • The demo link is now active: https://paperclip.pythonanywhere.comTo access the admin panel, please use the following login credentials:Username: admin@example.comPassword: 123456789• Please note that certain functionalities have been disabled in this demo for demonstration purposes.For searching, you can utilize the following examples:Email: john.doe@example.com or robert.johnson@mailserver.netPhone Number: 999-888-7777",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466575",
  "comments": []
}