{
  "id": "topic_5480833",
  "title": "uneng",
  "author": "uneng",
  "created_time": "January 08, 2024, 02:03:46 PM",
  "content": "QuoteThe increased crypto regulatory frameworks around the world have significantly helped in the mass adoption of Bitcoin, altcoins, and the wider Web3 ecosystem. For instance, El Salvador has recorded more merchants accepting Bitcoin as a form of payment since the country adopted the flagship coin as the legal tender alongside the United States dollar....According to market data collected by BTC Map, merchants accepting Bitcoin as a form of payment experienced a 174 percent surge in 2023 to around 9,926 as of this report....From the map provided by BTC Map, it is evident that most of the merchants accepting Bitcoin as a form of payment are concentrated around Latin America, North America, and Europe. Fewer merchants in Africa and Asia accept Bitcoin as a form of payment.Bitcoin Adoption: Number of Merchants Accepting BTC Payments Surged by 174% in 2023Regulations are claimed to be helping to increase Bitcoin adoption by businesses as payment method around the world. Is this for real, or are regulations just forcing such businesses to officially accept Bitcoin, although they could be already accepting it informally before the approval of such regulations?Despite the raised percentage being really expressive (174%), it doesn't translate in great numbers when we conclude there are only 9926 businesses accepting Bitcoin as payment method in the world.In your opinion, why do you think more businesses accepting Bitcoin as payment method are concentrated in American and European continents?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5480833",
  "comments": [
    {
      "author": "BIT-BENDER",
      "created_time": "January 08, 2024, 02:20:23 PM",
      "body": "Am not surprised this is happening, alot would still happen as the bull run draws even closer, my country government just listed the ban on crypto-currency this could be an advice to them seeing everyone in the country has an idea or by now should have heard about Bitcoin one way or the other.I paid a friend who sells me call card with Bitcoin yesterday, this is a great improvement not just that big online merchants accepting Bitcoin but just those small everyday needs service providers in your area accepting Bitcoin then you know the adoption level is increasing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "January 08, 2024, 02:48:58 PM",
      "body": "Away from government regulation and all that, the biggest thorn to Bitcoin adoption is the recent surge in transaction fees caused by the ordinal spam on the network and I believe we are yet to see the worst during the bull run. If that is not addressed, I see very many merchants opting for altcoins instead as a mode of payment.Nobody in their right mind is going to spend $20 in fees every time for just a payment of $3.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "January 08, 2024, 03:00:18 PM",
      "body": "If we are going to follow up by the updates of what's going on daily with increasing acceptance of Bitcoin and adoption of it's use as means of payment by institutions, we can't keep the count because this is happening daily and the network is fast more increasing than before, even to the extent that we are not aware of some and yet they are happening, bitcoin indeed has been unstoppable by any means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "January 08, 2024, 03:06:46 PM",
      "body": "I think there are many news talk about merchants start to accept Bitcoin payments, that's good. But I'm more curious how many people are actually pay using Bitcoin and how much that they paid, so we will know does accepting Bitcoin make the merchants profitable or not. We can also know if the users already understand about Bitcoin or not by checking the price of product they buy is higher than the Bitcoin fee they paid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "January 08, 2024, 03:29:11 PM",
      "body": "Does anyone have the stats of how many Merchants stopped accepting BTC payments in the last three months only? I guess nobody has the stats! I asked this question because of obvious reasons. The fees! The ordinals thing changed everything in the last three months. Still, people were paying 500 sat/vB to confirm their transactions. The transaction fee has been reduced to 40 sat/vB this week but it started to increase again. If transaction fees remain like this, The Merchants will stop accepting Bitcoin payments. If mempool goes back to normal mode again, more merchants will start accepting BTC payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "January 08, 2024, 03:29:40 PM",
      "body": "Quote from: Jawhead999 on January 08, 2024, 03:06:46 PMI think there are many news talk about merchants start to accept Bitcoin payments, that's good. But I'm more curious how many people are actually pay using Bitcoin and how much that they paid, so we will know does accepting Bitcoin make the merchants profitable or not. We can also know if the users already understand about Bitcoin or not by checking the price of product they buy is higher than the Bitcoin fee they paid.There are a few restaurants here in my country that accept Bitcoin as payment I tried one of them before but their menu the list of food and beverages is a bit expensive I am lucky that they offer a 20% discount if I pay Bitcoin. At that time Bitcoin network was not congested unlike these days but Bitcoin is growing here in my country more restaurants and other merchants are accepting Bitcoin as a mode of payment. Until now they have accepted Bitcoin but the problem is since there is an issue on the network like stuck transactions due to network congestion they stopped accepting Bitcoin unless you are willing to pay a high transaction fee. Their alternative mode of payment is Lightning and no altcoins yet I don't know why they don't accept other coins but they only accept bitcoin mainnet or lightning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "January 08, 2024, 03:44:19 PM",
      "body": "Quote from: uneng on January 08, 2024, 02:03:46 PMQuoteThe increased crypto regulatory frameworks around the world have significantly helped in the mass adoption of Bitcoin, altcoins, and the wider Web3 ecosystem. For instance, El Salvador has recorded more merchants accepting Bitcoin as a form of payment since the country adopted the flagship coin as the legal tender alongside the United States dollar....According to market data collected by BTC Map, merchants accepting Bitcoin as a form of payment experienced a 174 percent surge in 2023 to around 9,926 as of this report....From the map provided by BTC Map, it is evident that most of the merchants accepting Bitcoin as a form of payment are concentrated around Latin America, North America, and Europe. Fewer merchants in Africa and Asia accept Bitcoin as a form of payment.Bitcoin Adoption: Number of Merchants Accepting BTC Payments Surged by 174% in 2023Regulations are claimed to be helping to increase Bitcoin adoption by businesses as payment method around the world. Is this for real, or are regulations just forcing such businesses to officially accept Bitcoin, although they could be already accepting it informally before the approval of such regulations?Despite the raised percentage being really expressive (174%), it doesn't translate in great numbers when we conclude there are only 9926 businesses accepting Bitcoin as payment method in the world.In your opinion, why do you think more businesses accepting Bitcoin as payment method are concentrated in American and European continents?I think the main reason for that is the excessive bureaucracy created by government, taxes and so on. Merchants wants only to sell their products or services, without permission or regulations from theses thiefs called politicians",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "January 08, 2024, 03:58:45 PM",
      "body": "Quote from: uneng on January 08, 2024, 02:03:46 PMIn your opinion, why do you think more businesses accepting Bitcoin as payment method are concentrated in American and European continents?It should be clear that the demand for transactions in cryptocurrency could be the major thing that triggered the increasing number of Merchants in Europe and AmericaQuote from: Shishir99 on January 08, 2024, 03:29:11 PMThe fees! The ordinals thing changed everything in the last three months. Still, people were paying 500 sat/vB to confirm their transactions. The transaction fee has been reduced to 40 sat/vB this week but it started to increase again. If transaction fees remain like this, The Merchants will stop accepting Bitcoin payments. If mempool goes back to normal mode again, more merchants will start accepting BTC payments.  The high transaction fees have been a problem lately and will drastically reduce the number of transactions that the Merchants will carry out these few months we have been experiencing high fees. They may stop transactions in Bitcoin if fees go way high than what we have currently, instead will start using other cryptos like LTC, XRP and the rest of them that have lower transaction fees in running their businesses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "January 08, 2024, 04:05:17 PM",
      "body": "Just accepting, not surprising facts. The question is, are there transactions there, I mean their customers actually pay with bitcoin?If my government allows it, I can just put labels on shops \"accepting bitcoin here\" then the media says the statistics are increasing, but that doesn't really suggest that adoption was increased especially if there are no customers who want that kind of payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "January 08, 2024, 04:08:27 PM",
      "body": "We see such news popping up every time when bull run is in place and especially when halving is near.It has become common now to see the number of merchants increasing when bitcoin is in hype.But we must find out how much of these merchants keep using bitcoin and doesn't abandon it later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 08, 2024, 04:19:11 PM",
      "body": "Quote from: Shishir99 on January 08, 2024, 03:29:11 PM~snip~The transaction fee has been reduced to 40 sat/vB this week but it started to increase again. If transaction fees remain like this, The Merchants will stop accepting Bitcoin payments. If mempool goes back to normal mode again, more merchants will start accepting BTC payments. QuoteAccording to market data collected by BTC Map, merchants accepting Bitcoin as a form of payment experienced a 174 percent surge in 2023 to around 9,926 as of this report. Out of this, around 5535 merchants accept Bitcoin’s on-chain payments whilst 5,107 accept lightning-powered Bitcoin payments.It would be good if you read the article from the OP, which is only 3 minutes of reading, so some things would be much clearer. From the data, we can say that the ratio of merchants who accept Bitcoin as a means of payment is close to 50-50 when it comes to on-chain and LN.As for the number of merchants, I think that it is greater than the number presented, and I conclude that from the fact that many are missing when I looked at the data on the map for my country (btcmap).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zakservers",
      "created_time": "January 08, 2024, 04:27:54 PM",
      "body": "I think BTC is awesome way for making transactions, just that I have seen its more popular payment method with people who want to stay anonymous, some how people who are willing to share their KYC, they still prefer paypal, and credit/debit cards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "January 08, 2024, 04:30:53 PM",
      "body": "Quote from: Bitcoin_Arena on January 08, 2024, 02:48:58 PMAway from government regulation and all that, the biggest thorn to Bitcoin adoption is the recent surge in transaction fees caused by the ordinal spam on the network and I believe we are yet to see the worst during the bull run. If that is not addressed, I see very many merchants opting for altcoins instead as a mode of payment.Nobody in their right mind is going to spend $20 in fees every time for just a payment of $3.There's this thing called the Lightning Network. Nobody is going to be doing on-chain transactions for buying things, that would simply make no sense.And nobody in their right mind is going to be accepting altcoins as a mode of payment. Bitcoin is going to be the only thing that gets widely used as payments. Altcoins are random tokens nobody cares about that serve no purpose accept for trading. They will never be a payment method. Please don't tell me you still think altcoins are trying to compete with Bitcoin as money, that ship sailed like 5 years ago once the market figured out that altcoins are nothing like Bitcoin. If every altcoin suddenly disappeared tomorrow that would have zero effect on the future of digital payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "January 08, 2024, 04:31:42 PM",
      "body": "Mid 2023 is also where the gradual rise of the value of BTC, I could only assume these merchants are also looking to maximize their profit while BTC price is going up. There will be more merchants to join soon when they hear accepting BTC as payment will be profitable. But I would strongly recommend also accepting stablecoin along with BTC as this will give options to the BTC users. These merchants may even prefer the stablecoins when the bull market is over. Its best that they are prepared on what to do when the time comes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "January 08, 2024, 04:41:46 PM",
      "body": "Quote from: uneng on January 08, 2024, 02:03:46 PMQuoteThe increased crypto regulatory frameworks around the world have significantly helped in the mass adoption of Bitcoin, altcoins, and the wider Web3 ecosystem. For instance, El Salvador has recorded more merchants accepting Bitcoin as a form of payment since the country adopted the flagship coin as the legal tender alongside the United States dollar....According to market data collected by BTC Map, merchants accepting Bitcoin as a form of payment experienced a 174 percent surge in 2023 to around 9,926 as of this report....From the map provided by BTC Map, it is evident that most of the merchants accepting Bitcoin as a form of payment are concentrated around Latin America, North America, and Europe. Fewer merchants in Africa and Asia accept Bitcoin as a form of payment.Bitcoin Adoption: Number of Merchants Accepting BTC Payments Surged by 174% in 2023Regulations are claimed to be helping to increase Bitcoin adoption by businesses as payment method around the world. Is this for real, or are regulations just forcing such businesses to officially accept Bitcoin, although they could be already accepting it informally before the approval of such regulations?Despite the raised percentage being really expressive (174%), it doesn't translate in great numbers when we conclude there are only 9926 businesses accepting Bitcoin as payment method in the world.In your opinion, why do you think more businesses accepting Bitcoin as payment method are concentrated in American and European continents?That's a good percentage gain. But yeah hardly anyone takes bitcoin payments. I'll take a couple decades of that sort of growth before bitcoin payments start becoming standard. But that's fine, it takes a while for a currency to organically grow from a single person to global adoption. No one should be under any illusion that paying with bitcoin is going to be normal any time soon. It'll be many many years before the average person could live off off using Bitcoin. Of course once the major online marketplaces like Amazon adopt bitcoin payments, which I'm guessing will be some time next decade, that'll give a big boost but still its gonna be a bunch of years after that until bitcoin payments are as widely adopted as something like Apple Pay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "January 08, 2024, 04:46:29 PM",
      "body": "this is good news but also confusing for me, because how can these merchants accept bitcoin when the current fees are unreasonable. do these merchants expect that buyers will be willing to pay a fee of 4 dollars just to buy a drink? because only a fool would do that. or do they use binance for payments with bitcoin? because as far as i know binance does not charge fees for transactions between their users. this is still a question for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "January 08, 2024, 04:47:36 PM",
      "body": "Quote from: uneng on January 08, 2024, 02:03:46 PMQuoteThe increased crypto regulatory frameworks around the world have significantly helped in the mass adoption of Bitcoin, altcoins, and the wider Web3 ecosystem. For instance, El Salvador has recorded more merchants accepting Bitcoin as a form of payment since the country adopted the flagship coin as the legal tender alongside the United States dollar....According to market data collected by BTC Map, merchants accepting Bitcoin as a form of payment experienced a 174 percent surge in 2023 to around 9,926 as of this report....From the map provided by BTC Map, it is evident that most of the merchants accepting Bitcoin as a form of payment are concentrated around Latin America, North America, and Europe. Fewer merchants in Africa and Asia accept Bitcoin as a form of payment.Bitcoin Adoption: Number of Merchants Accepting BTC Payments Surged by 174% in 2023Regulations are claimed to be helping to increase Bitcoin adoption by businesses as payment method around the world. Is this for real, or are regulations just forcing such businesses to officially accept Bitcoin, although they could be already accepting it informally before the approval of such regulations?Despite the raised percentage being really expressive (174%), it doesn't translate in great numbers when we conclude there are only 9926 businesses accepting Bitcoin as payment method in the world.In your opinion, why do you think more businesses accepting Bitcoin as payment method are concentrated in American and European continents? This just goes to show that the world is becoming more and more receptive and accepting of the crypto industry. They know that it's here to stay and best way to deal with it is to actually work with it closely, which is why more and more large-scale companies are starting to adopt crypto as a payment/financing option. But in my opinion, global adoption of crypto wouldn't really happen if the micro-infrastructures like small-businesses and establishment refuse to take the chance to adopt cryptocurrencies for themselves. In third-world countries this is especially more essential since impoverished people couldn't be expected to buy stuff wholesale, or at least in the same way that regular middle-class to high-class income earning families could. Crypto would need to penetrate this sphere as well to really hit the \"decentralized and for everyone\" slogan home and include everyone in its economy. Plus it would be a massive bummer for everyone if massive AAA companies are to take control of this market yet again. All in all though, this isn't a bad first step honestly, we're looking at the makings of a massive crypto revolution that may bring about global adoption within our lifetimes, that's a massive win for me anyday of the week. Just hoping that the power's still within the people's hands when that happens though. Cause what good is global adoption gonna do if the outside market doused in capitalism's still going to dominate the crypto market anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 08, 2024, 06:49:50 PM",
      "body": "Quote from: Bitcoin_Arena on January 08, 2024, 02:48:58 PMAway from government regulation and all that, the biggest thorn to Bitcoin adoption is the recent surge in transaction fees caused by the ordinal spam on the network and I believe we are yet to see the worst during the bull run. If that is not addressed, I see very many merchants opting for altcoins instead as a mode of payment.Nobody in their right mind is going to spend $20 in fees every time for just a payment of $3.Correct me if I'm way off base, but if a merchant accepts crypto at all, they're most likely using a payment processor like Bitpay which by default allows you to pay with coins other than bitcoin--and if that's true, then there would be no logical reason for anyone to pay with bitcoin when network fees are so absurdly high.Then again, if what you've got is bitcoin (and not an altcoin like LTC, for example), you'd still have to convert it to whatever altcoin you're going to use, and that would probably be even more expensive.  Eh.  I think it's great that bitcoin is being adopted by merchants, and the more the merrier I say.  But I've always questioned people's willingness to spend their bitcoin on goods & services when fiat works just fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "January 08, 2024, 07:38:21 PM",
      "body": "Quote from: uneng on January 08, 2024, 02:03:46 PMIn your opinion, why do you think more businesses accepting Bitcoin as payment method are concentrated in American and European continents?The nations have some of the best economies in the world. Bitcoin is gradually becoming a currency of the rich, so you don't expect companies in developed nations to adopt Bitcoin payment because most people are below the poverty line. These nations also have high literacy rates which helps in Bitcoin education and adoption. The bottom line is that more people use Bitcoin in these nations, which will encourage companies to accept Bitcoin payments. American and European nations also have advanced infrastructures and technology that make Bitcoin transactions easier and more convenient. Some countries in Africa lack electricity and internet facilities, therefore you don't expect companies to promote Bitcoin payments. Another reason might also be government policies. Most of these nations that are experiencing an increase in the number of merchants because these nations have favourable policies.         Quote from: zakservers on January 08, 2024, 04:27:54 PMI think BTC is awesome way for making transactions, just that I have seen its more popular payment method with people who want to stay anonymous, some how people who are willing to share their KYC, they still prefer paypal, and credit/debit cards.Privacy is one of the benefits of using Bitcoin for making payments. The high transaction fees might be discouraging but privacy is also a great advantage. Using decentralised wallets and platforms is the best if you want to maintain privacy. But those who don't care about privacy use centralised platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}