{
  "id": "topic_5447059",
  "title": "swaga",
  "author": "swaga",
  "created_time": "March 31, 2023, 07:29:13 PMLast edit: April 12, 2023, 11:58:04 AM by swaga",
  "content": "I've received around 9.7 SOL on my blockchain.com defi wallet.Then when I tried to transfer them to another wallet I got an error message \"Oops something went wrong while executing the SOL on-chain transaction.\"https://i.imgur.com/YZrgqDb.pngOriginal transaction went through and is confirmed on the sol blockchain. https[Suspicious link removed]AV2WKjDxxNpefHmefsMkczXHBTh43Q6XVRk1fpxvZwEHzBsURPGoFQ1V3kPnHowever I can't see that transaction on my blockchain.com app activity nor I can see the money/activity when logged in on browser.Does anyone know whats going on?EDIT:The official customer support answer to this problem is: \"...it seems that the issue you're facing is happening for others trying to send Solana. Our team is working on a fix for this bug and should hopefully have it fixed soon. Thank you in advance for your patience. 🙂\"For anyone facing this issue: All you can do is wait. For anyone planning to deposit solana to their blockchain app: DON'TEDIT 2:Issue solved. Blockchain has fixed the bug.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447059",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "March 31, 2023, 07:53:46 PM",
      "body": "Could you share the TXID (without the link)? What you posted doesn't look like a valid tx hash. I can't find it on solscan:Code:AV2WKjDxxNpefHmefsMkczXHBTh43Q6XVRk1fpxvZwEHzBsURPGoFQ1V3kPnAlso, from where did you send the 9.7 SOL? an exchange? If so, which one?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "March 31, 2023, 08:02:16 PM",
      "body": "Quote from: OmegaStarScream on March 31, 2023, 07:53:46 PMCould you share the TXID (without the link)? What you posted doesn't look like a valid tx hash. I can't find it on solscan:Code:AV2WKjDxxNpefHmefsMkczXHBTh43Q6XVRk1fpxvZwEHzBsURPGoFQ1V3kPnAlso, from where did you send the 9.7 SOL? an exchange? If so, which one?This is the signature:62Uq9uoW7NkHCe9mkJs6FmnF4eXEAV2WKjDxxNpefHmefsMkczXHBTh43Q6XVRk1fpxvZwEHzBsURPG oFQ1V3kPnI received 9.7 sol from another person, not an exchange, and wanted to swap it to btc. also here is a screenshot of my wallet on blockchain.com app. You can see here its the same address as on the transaction above.https://imgur.com/a/yZ5XgAz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 31, 2023, 09:26:11 PM",
      "body": "So did you asked their support first as indicated on the error message before making a thread here? Blockchain.com changed a lot together with their policies and its bugs when it become an exchange, so opening a support ticket could be a big help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "March 31, 2023, 09:29:49 PM",
      "body": "Quote from: PX-Z on March 31, 2023, 09:26:11 PMSo did you asked their support first as indicated on the error message before making a thread here? Blockchain.com changed a lot together with their policies and its bugs when it become an exchange, so opening a support ticket could be a big help.I sent a ticket to their support. They replied with a generic reply such as \"update your app\" which was no help.I looked for other such cases and found 3 other people had the same problem within the last 7 days but none of them provided any form of solution so i decided to ask here so anyone who gets this bug in the future can use the thread as an information source.I'll update the thread once I find a way to withdraw my SOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 31, 2023, 09:44:38 PMLast edit: March 31, 2023, 09:56:01 PM by PX-Z",
      "body": "Quote from: swaga on March 31, 2023, 09:29:49 PMI sent a ticket to their support. They replied with a generic reply such as \"update your app\" which was no help..Sounds like normal to blockchain.com, nothing has changed. Anyway, you can wait for them to respond. Quote from: swaga on March 31, 2023, 07:29:13 PMHowever I can't see that transaction on my blockchain.com app activity nor I can see the money/activity when logged in on browser.Btw, you mean your SOL is not there anymore on your balance and there's no transaction history either? Try to clear cache and hard refresh the page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "March 31, 2023, 09:46:19 PM",
      "body": "Quote from: swaga on March 31, 2023, 09:46:19 PMQuote from: swaga on March 31, 2023, 07:29:13 PMHowever I can't see that transaction on my blockchain.com app activity nor I can see the money/activity when logged in on browser.Btw, you mean your SOL is not there anymore on your balance and there's transaction history either? Try to clear cache and hard refresh the page.When I log on the blockchain.com I can't see my SOL balance at all.When I check my app i can see my SOL balance but I cant see the activity (transaction details).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 31, 2023, 10:04:44 PM",
      "body": "Quote from: swaga on March 31, 2023, 09:46:19 PMWhen I log on the blockchain.com I can't see my SOL balance at all.When I check my app i can see my SOL balance but I cant see the activity (transaction details).Now that's f*cked up, are you sure it is still there when viewing the app? Have you tried to clear cache the app, or clear app data and then reloggin because i think its not there anymore just like what you see on browser. Looks like blockchain.com didn't learned with their so many bugs even when they are just a wallet few years ago with just bitcoin onboard, how much more today with lots of crypto they are accepting and maintaining its wallets, etc. on its platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "March 31, 2023, 10:13:53 PM",
      "body": "Quote from: PX-Z on March 31, 2023, 10:04:44 PMQuote from: swaga on March 31, 2023, 09:46:19 PMWhen I log on the blockchain.com I can't see my SOL balance at all.When I check my app i can see my SOL balance but I cant see the activity (transaction details).Now that's f*cked up, are you sure it is still there when viewing the app? Have you tried to clear cache the app, or clear app data and then reloggin because i think its not there anymore just like what you see on browser. Looks like blockchain.com didn't learned with their so many bugs even when they are just a wallet few years ago with just bitcoin onboard, how much more today with lots of crypto they are accepting and maintaining its wallets, etc. on its platform.I'm sure it's still there. I can still receive money on the same address that I used the first time. And if you check the address the 9.7 SOL is still there.The problem is blockchain.com browser doesnt even allow me to receive SOL. Thus it doesnt show the balance of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "March 31, 2023, 10:33:39 PMLast edit: March 31, 2023, 10:51:21 PM by hosseinimr93",
      "body": "Quote from: swaga on March 31, 2023, 10:13:53 PMThe problem is blockchain.com browser doesnt even allow me to receive SOL. Thus it doesnt show the balance of it.You have received the 9.7 SOL. Click here to see the receiving transaction on solscan and here to see your balance. Just because you don't see your balance on blockchain.com doesn't mean you haven't received the fund. Note that blockchain.com explorer has no control over the blockchain and they can't stop you from receiving fund. I don't have any information about solana blockchain and defi, but it seems that their wallet is showing the correct balance. In the image you shared above, it's displaying the total balance of 9.69999 SOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "April 01, 2023, 01:46:43 AM",
      "body": "It will probably solve by itself over time but if you're in a hurry to get your funds out, try to ask in r/solana if there are compatible wallets you can import your blockchain.com sol wallet. From what I understand, defi wallets are non-custodial and backed up by your backup phrase, see: https://support.blockchain.com/hc/en-us/articles/360051018031-Technical-differences-between-the-DeFi-Wallet-and-Blockchain-com-Account (side note: please be careful of phishing/scam links, verify first!)Otherwise, you may also try starting in a fresh blockchain.com account using the same backup phrase, see: https://login.blockchain.com/en/#/recover. Suggesting this as I have seen account-only problems/errors before so perhaps starting on a new account will solve the withdrawal error?After importing, I suggest moving all your coins in a fresh wallet with a newly generated seed for better security. Hopefully, this wallet will not be blockchain.com again as I'm pretty sure there should be better options for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "April 01, 2023, 04:19:06 AM",
      "body": "Quote from: swaga on March 31, 2023, 09:46:19 PMQuote from: PX-Z on March 31, 2023, 09:46:19 PM-snip- Try to clear cache and hard refresh the page.When I check my app i can see my SOL balance but I cant see the activity (transaction details).I was going to suggest to clear the App's cache and saw that there's someone already suggested it to the web version,but based from your reply, you didn't in the App?To do that, go to your Phone's setting, look for \"Apps\", \"Manage Apps\" or similar name (where your installed apps are listed).Find and click \"Blockchain\" app and tap to open \"Storage\", tap \"Clear Cache\" to clear its cached data, force closing it may be needed or at least restart the phone.Be sure not to click \"Clear Storage\" or it will reset to its newly installed state.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "April 01, 2023, 07:42:09 AM",
      "body": "Quote from: swaga on March 31, 2023, 08:02:16 PMThis is the signature:62Uq9uoW7NkHCe9mkJs6FmnF4eXEAV2WKjDxxNpefHmefsMkczXHBTh43Q6XVRk1fpxvZwEHzBsURPG oFQ1V3kPnI received 9.7 sol from another person, not an exchange, and wanted to swap it to btc. also here is a screenshot of my wallet on blockchain.com app. You can see here its the same address as on the transaction above.https://imgur.com/a/yZ5XgAzThe signature you posted is not leading me anywhere either but if you can see the balance in your mobile app, then it should be there. If none of the solutions above work, I would suggest you install a SOL wallet (Phantom wallet for example) and then try using Blockchain's recovery phrase in there and see if the funds would show.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "April 01, 2023, 12:40:17 PM",
      "body": "Quote from: OmegaStarScream on April 01, 2023, 07:42:09 AMQuote from: swaga on March 31, 2023, 08:02:16 PMThis is the signature:62Uq9uoW7NkHCe9mkJs6FmnF4eXEAV2WKjDxxNpefHmefsMkczXHBTh43Q6XVRk1fpxvZwEHzBsURPG oFQ1V3kPnI received 9.7 sol from another person, not an exchange, and wanted to swap it to btc. also here is a screenshot of my wallet on blockchain.com app. You can see here its the same address as on the transaction above.https://imgur.com/a/yZ5XgAzThe signature you posted is not leading me anywhere either but if you can see the balance in your mobile app, then it should be there. If none of the solutions above work, I would suggest you install a SOL wallet (Phantom wallet for example) and then try using Blockchain's recovery phrase in there and see if the funds would show.Im not sure why its not taking you anywhere but you can try to copy and paste it again, it definitely exists and leads to a 9.7 sol transaction page.Also i've tried to use 12 word key on phantom but it says I have 0 SOL balance. However when I tried to do the same procedure on a 2nd phone on Blockchain app it told me I had 9.7 SOL, just like on my 1st phone.There is something really messed up with blockchain app and once I get to the bottom of it I'll add the solution to my first post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "April 01, 2023, 02:09:25 PM",
      "body": "Quote from: swaga on April 01, 2023, 12:40:17 PMIAlso i've tried to use 12 word key on phantom but it says I have 0 SOL balance. However when I tried to do the same procedure on a 2nd phone on Blockchain app it told me I had 9.7 SOL, just like on my 1st phone.There is something really messed up with blockchain app and once I get to the bottom of it I'll add the solution to my first post.Have you tried to clear cache the app, or just clear the data of it, or lastly uninstall the app on your phone? Or rebooting your phone. Because probably its an app issue only, in that case, it will be solved only by doing what mentioned, because app's data or cache can cause app's performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "April 01, 2023, 02:21:10 PM",
      "body": "Quote from: PX-Z on April 01, 2023, 02:09:25 PMQuote from: swaga on April 01, 2023, 12:40:17 PMIAlso i've tried to use 12 word key on phantom but it says I have 0 SOL balance. However when I tried to do the same procedure on a 2nd phone on Blockchain app it told me I had 9.7 SOL, just like on my 1st phone.There is something really messed up with blockchain app and once I get to the bottom of it I'll add the solution to my first post.Have you tried to clear cache the app, or just clear the data of it, or lastly uninstall the app on your phone? Or rebooting your phone. Because probably its an app issue only, in that case, it will be solved only by doing what mentioned, because app's data or cache can cause app's performance.I've tried all of the above. None seems to work as the blockchain app doesnt want to show me the Solana activity. I can see the balance on my phone app but i cant spent it or do anything else with it.Another forum member had the same problem with BTC but the problem was never resolved in the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "April 01, 2023, 09:09:41 PM",
      "body": "Quote from: swaga on April 01, 2023, 12:40:17 PMAlso i've tried to use 12 word key on phantom but it says I have 0 SOL balance. However when I tried to do the same procedure on a 2nd phone on Blockchain app it told me I had 9.7 SOL, just like on my 1st phone.Just to be clear, after recovering your wallet from seed in Phantom, did you get the same receiving address as the one you have on Blockchain app (it's supposed to be this one: EtZHmJtM2EbGT4SpJ2LMxxyGpsGgbqaNDZ4ngJHUW51w)? Did Phantom wallet finish syncing?Solscan shows that the 9.7 SOL are still there and haven't been moved. So, if you have recovered the right wallet and the app is fully since, I don't see any logical reason why the balance won't show up!This kind of bugs is so common on Blockchain.com and it usually get solved by itself as Potato Chips mentioned earlier.My advice is that after you get this sorted out to stop using blockchain.com and any other browser wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "April 02, 2023, 09:50:05 AM",
      "body": "Quote from: khaled0111 on April 01, 2023, 09:09:41 PMQuote from: swaga on April 01, 2023, 12:40:17 PMAlso i've tried to use 12 word key on phantom but it says I have 0 SOL balance. However when I tried to do the same procedure on a 2nd phone on Blockchain app it told me I had 9.7 SOL, just like on my 1st phone.Just to be clear, after recovering your wallet from seed in Phantom, did you get the same receiving address as the one you have on Blockchain app (it's supposed to be this one: EtZHmJtM2EbGT4SpJ2LMxxyGpsGgbqaNDZ4ngJHUW51w)? Did Phantom wallet finish syncing?Solscan shows that the 9.7 SOL are still there and haven't been moved. So, if you have recovered the right wallet and the app is fully since, I don't see any logical reason why the balance won't show up!This kind of bugs is so common on Blockchain.com and it usually get solved by itself as Potato Chips mentioned earlier.My advice is that after you get this sorted out to stop using blockchain.com and any other browser wallet. When I recover my wallet in Phantom nothing shows up, the address is completely different.This is the 2nd reply by support:\"Hi MyName,I've checked your account but I don't see any Solana. Can you send me a screenshot of your wallet showing your Solana balance? Please also send a screenshot of your SOL address when you go to Receive > Solana. Thank you.\"When I check my app or when I recover my wallet to another phones blockchain app I can still see 9.7 SOL.This seems like a MAJOR bug for blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "April 02, 2023, 11:46:48 AM",
      "body": "Quote from: swaga on April 02, 2023, 09:50:05 AMThis is the 2nd reply by support:-snip-When I check my app or when I recover my wallet to another phones blockchain app I can still see 9.7 SOL.This seems like a MAJOR bug for blockchain.Maybe not a major issue since it's quite common in other non-custodial wallets as well but usually can easily be fixed by a \"rescan\".Blockchain wallet however, may also be non-custodial as they claim but their whole system still relies on their server,so if there's an issue with the wallet's state in their server due to syncing issue, only them can fix it.The solution at the moment is to follow what their support is asking,but make sure that you're talking to the correct customer support since there are a lot of fake supports out there.I'd also recommend you to provide them the transaction id of the inbound transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swaga",
      "created_time": "April 02, 2023, 12:03:35 PM",
      "body": "Quote from: nc50lc on April 02, 2023, 11:46:48 AMMaybe not a major issue since it's quite common in other non-custodial wallets as well but usually can easily be fixed by a \"rescan\".Blockchain wallet however, may also be non-custodial as they claim but their whole system still relies on their server,so if there's an issue with the wallet's state in their server due to syncing issue, only them can fix it.The solution at the moment is to follow what their support is asking,but make sure that you're talking to the correct customer support since there are a lot of fake supports out there.I'd also recommend you to provide them the transaction id of the inbound transaction.Im not familar with all the technical details but this seems reasonable. The money is there for sure and the mistake is on their end.I've sent the support ticket through the app so there is no room for doubt.I provided all the transaction ids, addresses and screenshots so now all theres left to do is wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}