{
  "id": "topic_5436631",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "January 24, 2023, 04:20:33 PM",
  "content": "Quant is slowly becoming more recognized and with less supply than Bitcoin at only 14 million many are saying top 10 is not only possible next bull run but likely.Be interesting to hear everyone's thoughts on this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436631",
  "comments": [
    {
      "author": "Xal0lex",
      "created_time": "January 24, 2023, 05:51:35 PM",
      "body": "I don't think supply should have any effect on the ranking of cryptocurrencies. The most important thing is supply and demand, as well as the demand for the blockchain space. The top 10 is too competitive, with either native blockchain tokens or stablecoins concentrated there. It is unlikely that this token will be in that league in the near future, but even without the top 10 this token could be a good investment. DYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "January 24, 2023, 06:25:27 PM",
      "body": "Quote from: Xal0lex on January 24, 2023, 05:51:35 PMI don't think supply should have any effect on the ranking of cryptocurrencies. The most important thing is supply and demand, as well as the demand for the blockchain space. The top 10 is too competitive, with either native blockchain tokens or stablecoins concentrated there. It is unlikely that this token will be in that league in the near future, but even without the top 10 this token could be a good investment. DYOR.Will be minimum top 15 next bull run I feel - less supply than Bitcoin is massive and will bring a lot of demand. Solana shot up last bull run and I feel Quant will do something similar - maybe not $80b market cap but at least $50b.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "January 24, 2023, 06:59:39 PM",
      "body": "With the overall supply of Quant to be 16.6 million according to CG at rank No.30, for it to achieve top 10 spot in cmc ranking, QNT needs to surpass previous ath of $427.42 to achieve a new ath of around $650 to $700 to either beat sol at rank No.9 to be in the top 10. If the demand for it is high then it is possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "January 24, 2023, 07:00:11 PM",
      "body": "Quote from: JamesDaniel90 on January 24, 2023, 06:25:27 PMWill be minimum top 15 next bull run I feel - less supply than Bitcoin is massive and will bring a lot of demand.Why are you focusing around this proposition? It's less than bitcoin and then what? This is not an indicator at all. The question of demand is extremely controversial and it is unknown whether it will be at the right level to allow this coin to rise so high in the rankings.Quote from: JamesDaniel90 on January 24, 2023, 06:25:27 PMSolana shot up last bull run and I feel Quant will do something similar - maybe not $80b market cap but at least $50b. Solana has had rabid support from foundations, as well as huge demand for the blockchain space. So you shouldn't compare Solana and Quant. They are completely different classes of products.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 24, 2023, 07:41:43 PM",
      "body": "Quote from: JamesDaniel90 on January 24, 2023, 06:25:27 PMWill be minimum top 15 next bull run I feel - less supply than Bitcoin is massive and will bring a lot of demand. I was also like that where I'm basing the predictions that I got based on my feeling. But it has changed these days, supply is a big matter when I get to choose the projects that I invest with. But after some time, what I've realized is that its fundamentals and actual use case are much more important but in terms of comparison, people should stop comparing it with bitcoin whether it's just the supply or price. It's because we know that it's superior to the market and it's really incomparable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "January 24, 2023, 08:25:01 PM",
      "body": "Quote from: JamesDaniel90 on January 24, 2023, 06:25:27 PMQuote from: Xal0lex on January 24, 2023, 05:51:35 PMI don't think supply should have any effect on the ranking of cryptocurrencies. The most important thing is supply and demand, as well as the demand for the blockchain space. The top 10 is too competitive, with either native blockchain tokens or stablecoins concentrated there. It is unlikely that this token will be in that league in the near future, but even without the top 10 this token could be a good investment. DYOR.Will be minimum top 15 next bull run I feel - less supply than Bitcoin is massive and will bring a lot of demand. Solana shot up last bull run and I feel Quant will do something similar - maybe not $80b market cap but at least $50b. A valuation of 50 billion means a 22x growth for this coin or a price above 3400 dollars which is I must say very high, to put it into perspective this is 8 billions higher than the current market cap of BNB, and we know how powerful and influential the binance exchange is and this is your lowest prediction, if you are excited about this coin then you can invest or keep holding your coins but I think your expectations out of it should go down as I doubt the next bull market can bring so much growth to a project which has such a high valuation already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "January 24, 2023, 11:40:12 PM",
      "body": "Quote from: Bitstar_coin on January 24, 2023, 06:59:39 PMWith the overall supply of Quant to be 16.6 million according to CG at rank No.30, for it to achieve top 10 spot in cmc ranking, QNT needs to surpass previous ath of $427.42 to achieve a new ath of around $650 to $700 to either beat sol at rank No.9 to be in the top 10. If the demand for it is high then it is possible. It will easily surpass that next bull run , it reached $240 last year having been one of the best performing altcoins this bear market. $1k price minimum next bull run",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "January 25, 2023, 01:11:30 PM",
      "body": "I'm with Xal0lex on the insignificance of supply on today's market situation. Don't get caught up with that since it's only just for marketing now. It used to be a factor when deciding to invest or not but gone are those days. I think Dogecoin is a good example since it has an unlimited supply but look where it's currently ranked?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}