{
  "id": "topic_5460227",
  "title": "Bureau",
  "author": "Bureau",
  "created_time": "July 18, 2023, 01:22:11 PMLast edit: July 19, 2023, 01:28:00 PM by Bureau",
  "content": "I recently came across a new video by LLA on their YouTube channel. It was all about cryptocurrency tax and how to calculate it as well as where to file it. If you still have any doubts about crypto tax, then I recommend their video. The video was sponsored by clear tax naturally they did show on how to use their platform. I did visit the platform and found it to be very simple and easy to understand. What make my eyebrow go up was the atrocious fee they were charging for calculating & filing. I may be wrong, but I felt my local CA charging me less than what they were asking. This where it all started! Before I go further, I would like to inform everyone here on the board that I am unable to use these platforms as I am not liable to pay any tax for the last financial year. I would request fellow members to share their experience if they have used any of the listed platforms below. Since, I was not happy about the fee charged by clear tax I went ahead and did a few searches on Google & YouTube about other platforms that were providing the same service. I was able to find 4 more and I am listing them according to the fee, which from cheap to costly according to my understanding.BINOCS - CalculatorTAXnodes - Both Calculator and filerKoinly - Both Calculator and filerKoinx - CalculatorCleartax - Both Calculator and filerAs I have mentioned earlier this list is based on fees being charged, wherein I am focusing on the fee part. Again, I am repeating if anyone here has filed the tax using anyone of these platforms then do share your experience.Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460227",
  "comments": [
    {
      "author": "pakhitheboss",
      "created_time": "July 20, 2023, 03:35:44 AMLast edit: July 20, 2023, 08:22:28 AM by pakhitheboss",
      "body": "I have used Tax nodes and Binocs for calculation & filing. The reason behind using both is simple, Binocs allow 500 transaction free calculation whereas Tax node for only 100 transaction. Binocs doesn't provide filing service whereas Tax node does provide filing service. Tax node is offering good discount on filing at the moment, not sure whether it will offer those discounts next month.The last date for ITR filing is 31st of July which might get extended. Don't wait for the extension, if you haven't filed your returns please do it otherwise you might receive a love letter from Income tax department.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "July 20, 2023, 11:58:03 AM",
      "body": "I think Tax node would be the right platform for me as apart from crypto tax calculation they provide crypto and  normal ITR filing. First, I need to check whether I need to file ITR for crypto for the last financial year. I do not think that I have made any INR withdrawal last year. If,  I have then it would show when I calculate my tax. Another reason for choosing this platform is that I believe I would have less than 100 transaction. At the moment upto 100 transaction tax calculation is free on their platform. Yes, there is INR 500 discount voucher is available for buying any service that cost more than INR 1200. It is cheap compared to other platforms that has been listed by OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}