{
  "id": "topic_5469665",
  "title": "shield132",
  "author": "shield132",
  "created_time": "October 08, 2023, 05:46:14 PM",
  "content": "When we talk about Bitcoin Mining, it's impossible to ignore Bitmain. They manufacture one of the most popular asic miners and if anyone starts a mining business, they start with bitmain asic miners, at least it was like that before, can't be confident about today's situation because things have changed and only big corporations profit from mining today.There are companies like BitFury, The Foundry, ViaBTC and many more who share a big volume of total hashrate. These companies have datacenters all around the world and run their miners to generate coins. But I want to know, do these companies manufacture their own asic miners? Because I don't see them on market, I mostly see Bitmain miners. If these companies manufacture miners, then why don't they sell it like Bitmain does? Or do they buy miners from Bitmain? And I can't understand, why does Bitmain sells miners? Isn't it more profitable to use the investment in asic for only your own benefit and mine with every single equipment instead of selling them?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469665",
  "comments": [
    {
      "author": "safar1980",
      "created_time": "October 08, 2023, 06:02:28 PM",
      "body": "Quote from: shield132 on October 08, 2023, 05:46:14 PMWhen we talk about Bitcoin Mining, it's impossible to ignore Bitmain. They manufacture one of the most popular asic miners and if anyone starts a mining business, they start with bitmain asic miners, at least it was like that before, can't be confident about today's situation because things have changed and only big corporations profit from mining today.There are companies like BitFury, The Foundry, ViaBTC and many more who share a big volume of total hashrate. These companies have datacenters all around the world and run their miners to generate coins. But I want to know, do these companies manufacture their own asic miners? Because I don't see them on market, I mostly see Bitmain miners. If these companies manufacture miners, then why don't they sell it like Bitmain does? Or do they buy miners from Bitmain? And I can't understand, why does Bitmain sells miners? Isn't it more profitable to use the investment in asic for only your own benefit and mine with every single equipment instead of selling them?You cannot increase your mining profit due to stable block rewards, which decrease every 4 years for Bitcoin.And there is a lot of competition in the mining market. And the sale of ASICs is limited only by the demand for their purchase on the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 08, 2023, 07:31:37 PM",
      "body": "Quote from: shield132 on October 08, 2023, 05:46:14 PMBut I want to know, do these companies manufacture their own asic miners? Because I don't see them on market, I mostly see Bitmain miners. If these companies manufacture miners, then why don't they sell it like Bitmain does? Or do they buy miners from Bitmain? And I can't understand, why does Bitmain sells miners? Isn't it more profitable to use the investment in asic for only your own benefit and mine with every single equipment instead of selling them?I believe some of the pools have their own developed ASIC units I don't know the reason why they don't sell them but my guess is they can make more profit by keeping it while mining and they don't want someone to clone their units.I don't know the reason why Bitmains sells their units but my guess they use and mine first before they release their units to maximize their profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 08, 2023, 08:56:38 PM",
      "body": "Mining gets them more money over time (in theory) selling gets them cash now.If a miner costs $9000 to make and will generate $15000 after electricity & other costs over it's useful life. That's great and you mine with it.If that same $9000 miner can get you $12500 TODAY you sell it and use those funds to build more. Perhaps you keep that one and sell the next. And so on. If you are manufacturing constrained you keep more since over time that will get you more money. If you are hosting constrained you sell more.That's just business.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 09, 2023, 01:10:51 AM",
      "body": "There is actually a lot of Bitcoin ASIC manufacturer the list gets updated regularly you can see the profitability rate here https://whattomine.com/miners but the profit depend on a lot of factor. In there, you can see there is top manufacturer like Bitmain, MicroBT, Canaan, and many more but most people know Bitmain with their Antminer lineup because it is considered the old ASIC manufacturer. like DaveF said manufacturers sell to get the cash now without depending on many factors like electricity, maintenance, Bitcoin difficulty, Internet, and etc. But some manufacturer like Bitmain has division to run Cloud Mining like hashnest but now defunct. BitFury, The Foundry, ViaBTC is just the pool and luckily they got more share in fact BitFury was also asic manufacturer back couple of year ago, but now they are focused on mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "October 09, 2023, 08:38:42 AM",
      "body": "Quote from: DaveF on October 08, 2023, 08:56:38 PMIf that same $9000 miner can get you $12500 TODAY you sell it and use those funds to build more. Perhaps you keep that one and sell the next. That's a good point, especially if rumors that Bitmain creates miners, uses them for a while and then sells them as new is true. If that's true, then that's a perfect profit. But still I don't understand, a decade has passed and we don't have other massive ASIC miner manufacturers on market.Quote from: dansus021 on October 09, 2023, 01:10:51 AMBitFury, The Foundry, ViaBTC is just the pool and luckily they got more share in fact BitFury was also asic manufacturer back couple of year ago, but now they are focused on mining. They are not just pools. Bitfury, for example, has one of the biggest mining Datacenter in my country with lots of bitcoin miners, so that made me question, if they get miners from Bitmain, then why is Bitmain selling its miners in large quantity to competitors and if they manufacture it themselves, then why don't they sell it like Bitmain does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 09, 2023, 11:36:07 AM",
      "body": "Quote from: shield132 on October 09, 2023, 08:38:42 AMQuote from: DaveF on October 08, 2023, 08:56:38 PMIf that same $9000 miner can get you $12500 TODAY you sell it and use those funds to build more. Perhaps you keep that one and sell the next. That's a good point, especially if rumors that Bitmain creates miners, uses them for a while and then sells them as new is true. If that's true, then that's a perfect profit. But still I don't understand, a decade has passed and we don't have other massive ASIC miner manufacturers on market.Because mining is a very small market. Intel tried and then got out because the profits were just not there. Lack of profits was not the ONLY reason, they were doing other corporate changes but if it was making money or they thought in the short term it might, then that division might have been kept around.And, although there is no conformation of this, the rumor mill was that they could not even find a buyer for that part of intel. They were making chips and miners and it was a functioning part of intel, and anyone with money could have come in and picked it up but no other company was interested. As I said, just a rumor.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "October 09, 2023, 12:50:53 PM",
      "body": "AFAIK Block bought everything associated with Intel's chip https://www.coindesk.com/tech/2023/04/28/jack-dorseys-block-snaps-up-bitcoin-mining-chip-as-intel-winds-down-production/ and I mean everything - IP included.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 09, 2023, 01:58:23 PM",
      "body": "Quote from: NotFuzzyWarm on October 09, 2023, 12:50:53 PMAFAIK Block bought everything associated with Intel's chip https://www.coindesk.com/tech/2023/04/28/jack-dorseys-block-snaps-up-bitcoin-mining-chip-as-intel-winds-down-production/ and I mean everything - IP included.The last I heard, that deal was still in limbo. But I have not been keeping up.It might have finalized since the last discussion but when they were talking about it in financial discussions, nothing to do with BTC - crypto just the finance world, a few months after that press release nothing had happened yet. Now, big business moves slowly and both are public companies so that could be it. Since unlike DaveF taking over NotFuzzyWarm's mining company there are a lot of things that have to be done so the shareholders and regulators want their say also.Either way it's been so long (in mining time and hardware generation time) unless Jack Dorsey has something up that can help they are going to be way behind the competition.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "October 09, 2023, 03:25:24 PM",
      "body": "Quote from: DaveF on October 09, 2023, 11:36:07 AMBecause mining is a very small market. Intel tried and then got out because the profits were just not there. Lack of profits was not the ONLY reason, they were doing other corporate changes but if it was making money or they thought in the short term it might, then that division might have been kept around.Is it really that small? I'm sure you remember that in 2017 there was a boom of GPU mining and people were buying so many GPUs that Nvidia and some AMD graphics cards were not only out of stock everywhere but it had crazy prices too. I wanted to change my old GPU and buy a new one for gaming in 2017 and I simply couldn't let myself to pay thousands of dollars in a graphics card.Btw big mining companies were mostly mining via ASIC and individuals were mining ethereum and nicehash via GPU. There was a time when Nvidia was out of stock. I don't know if their manufacturing quantity is very low because that's strange if Intel found no big demand but probably if their business model will be like, one miner per person and this miner will have normal ROI, then they may find big interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 10, 2023, 12:53:39 AM",
      "body": "Quote from: shield132 on October 09, 2023, 03:25:24 PMIs it really that small? I'm sure you remember that in 2017 there was a boom of GPU mining and people were buying so many GPUs that Nvidia and some AMD graphics cards were not only out of stock everywhere but it had crazy prices too. I wanted to change my old GPU and buy a new one for gaming in 2017 and I simply couldn't let myself to pay thousands of dollars in a graphics card.I think there is a difference between the altcoin mining market and the Bitcoin mining market. I also don't think that your experience applies exactly the same right now. I don't think mining is the key reason why GPU has been hard to buy in the last two years, not to mention other devices like PS5 and Xbox are also hard to buy until recently. It is not hard to imagine that GPU manufacturers fuel the rumor to increase their GPU prices without too much backlash. CMIIW.Btw, if you compare the mining market size to the GPU market size, then some reports suggest that the number is hovering around $7 billion compared to $40 billion in 2023, which is quite a significant difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "October 14, 2023, 07:55:41 PM",
      "body": "What do you think about this?Exploring the Mountain Pine Cryptomining Facility: Noise vs. Profitshttps://www.youtube.com/watch?v=YKqJcmTQC0Q&ab_channel=KATVchannel7Residents of Mountain Pine are complaining that this mining farm is louder than the mining operation that has long operated near this town.But the mayor's office, in response to the growing flow of complaints, only ordered GMI Computing to erect a noise barrier around the facility by the end of the year.According to the video, the company uses several AntBox container-type installations from Bitmain at the site. The manufacturer introduced this type of equipment back in 2019. The AntBox T5 model, for example, can accommodate 205 Antminer S19 series Bitcoin miners.https://hashtelegraph.com/jeto-prosto-chertovski-gromko-bitkoin-ferma-bespokoit-zhitelej-amerikanskogo-gorodka/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "October 16, 2023, 02:32:43 PM",
      "body": "Quote from: jiso on October 16, 2023, 04:45:23 AM...**2. Proof of Work:** The miners then compete to solve a complex mathematical problem based on a cryptographic hash algorithm. The solution to the problem is called the Proof of Work....Pretty much the entire post is WRONG and also smacks of being AI generated.There is no 'complex equation' or 'complex problems' involved anywhere in the SHA encryption/decryption process nor in the mining process. Encryption/decryption is a very straight forward process which is why it can be so easily hard-coded into an array of logic gates on a chip.Mining is just submitting random guesses to match a hash with the work sent by the pools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 17, 2023, 01:44:07 AM",
      "body": "Quote from: jiso on October 16, 2023, 04:45:23 AM-snip-I don't think you answered OP's question, not to mention your posting format is quite annoying to some people. The content is also questionable as mentioned above. He's asking how the industry works, not how mining is done if you misread it.If this account is created to promote your project, I suggest you stick with it unless you want to risk yourself getting a temp ban or even a permanent ban for generated/copy-pasted content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "November 09, 2023, 07:32:33 PM",
      "body": "Quote from: joniboini on October 10, 2023, 12:53:39 AMQuote from: shield132 on October 09, 2023, 03:25:24 PMIs it really that small? I'm sure you remember that in 2017 there was a boom of GPU mining and people were buying so many GPUs that Nvidia and some AMD graphics cards were not only out of stock everywhere but it had crazy prices too. I wanted to change my old GPU and buy a new one for gaming in 2017 and I simply couldn't let myself to pay thousands of dollars in a graphics card.I think there is a difference between the altcoin mining market and the Bitcoin mining market. I also don't think that your experience applies exactly the same right now. I don't think mining is the key reason why GPU has been hard to buy in the last two years, not to mention other devices like PS5 and Xbox are also hard to buy until recently. It is not hard to imagine that GPU manufacturers fuel the rumor to increase their GPU prices without too much backlash. CMIIW.Btw, if you compare the mining market size to the GPU market size, then some reports suggest that the number is hovering around $7 billion compared to $40 billion in 2023, which is quite a significant difference.No, I don't mean the last two years. I mean 2016, 2017 and 2018. Can't talk about other years because I stopped GPU mining after 2019. I remember in those years that it was almost impossible to build a gaming computer but I can't say that GPU manufacturers used that as an excuse to increase GPU prices. I remember that GTX GPUs were sold 1 per customer on Nvidia and other shops but price was almost the same as it was before GPU boom or as it was expected for the new series of GPUs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "November 10, 2023, 06:56:30 PM",
      "body": "Quote from: shield132 on November 09, 2023, 07:32:33 PMQuote from: joniboini on October 10, 2023, 12:53:39 AMQuote from: shield132 on October 09, 2023, 03:25:24 PMIs it really that small? I'm sure you remember that in 2017 there was a boom of GPU mining and people were buying so many GPUs that Nvidia and some AMD graphics cards were not only out of stock everywhere but it had crazy prices too. I wanted to change my old GPU and buy a new one for gaming in 2017 and I simply couldn't let myself to pay thousands of dollars in a graphics card.I think there is a difference between the altcoin mining market and the Bitcoin mining market. I also don't think that your experience applies exactly the same right now. I don't think mining is the key reason why GPU has been hard to buy in the last two years, not to mention other devices like PS5 and Xbox are also hard to buy until recently. It is not hard to imagine that GPU manufacturers fuel the rumor to increase their GPU prices without too much backlash. CMIIW.Btw, if you compare the mining market size to the GPU market size, then some reports suggest that the number is hovering around $7 billion compared to $40 billion in 2023, which is quite a significant difference.No, I don't mean the last two years. I mean 2016, 2017 and 2018. Can't talk about other years because I stopped GPU mining after 2019. I remember in those years that it was almost impossible to build a gaming computer but I can't say that GPU manufacturers used that as an excuse to increase GPU prices. I remember that GTX GPUs were sold 1 per customer on Nvidia and other shops but price was almost the same as it was before GPU boom or as it was expected for the new series of GPUs.If we remember the peaks of mining on video cards, the price increase was due to the dishonesty of sellers. They sold large quantities of video cards to companies they knew for bribes.Therefore, there was a shortage of video cards in stores.And now, in a few months, Bitmain can release ASIC for many coins, and gaming video cards will only be for gamers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "November 21, 2023, 08:16:54 PM",
      "body": "I think it's more about us not knowing much about them. Those industries that are making mining components are also doing their own share of mining on their own. It's just that we don't know about it. The same goes for mining facilities and companies. Maybe they are making their own components but they are just not selling it to the average people. Or maybe I could be totally wrong about it.The thing is, people will try to replicate or make something better than what already exist. But in that process they may fail and quit or make something much better that they are not comfortable sharing with other people. So instead of selling it to average consumer, they use it on their own and profit from. Imagine a mining rig cost about $1,000 and someone out there has created something that cost about $10,000 but it is way too advanced. So theoretical speaking, the person with $10,000 component will have the advantage and because of its higher cost it may not be efficient for an average consumer. So instead of putting it out there for selling, they are just using it on their own to make their own profit from it. And as for companies that are making mining components, they have found out the way to make the cost cheaper and sell it to average consumer with a profit that they can work with. So they will stick to that and make more of it for profit and also they can use it on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}