{
  "id": "topic_5428607",
  "title": "Cryptomultiplier",
  "author": "Cryptomultiplier",
  "created_time": "December 14, 2022, 02:47:35 PM",
  "content": "How much do you tip a slot machine attendant?For those who visit and still enjoy the services of these live casino operators, am curious as to know how you tip the attenders. Do you tip only when you are winning and how much is too much tip to give? Also, I do not think online casinos even have this option, but if there is, can you share?In most parts of US, any payout of more than $1,200 is paid in person by the slot floor person. The tipping here starts with a minimum amount of $20 and can be up between 3-10 percent of the jackpot reward. It however, depends on the discretion of the customer. Do you think it is necessary to give tips or it is just a tradition that is required?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428607",
  "comments": [
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 14, 2022, 02:59:19 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you think it is necessary to give tips or it is just a tradition that is required?Well, I don't know about others but for me, tipping is a choice and not a necessity, I don't see it as necessary and I also don't see it as a tradition that is required.If I walk into a live and play the live slot, and luck shines on me that I made a good profit on my money(bet), the joy and happiness can switch on my philanthropic nature and by this, I can even decide to tip every one present in that casino, not just the slot machine attendants.But on very unlucky day, even I myself will be more angry with my self much later if I give a tip that is not straight from my heart, that is tip I wasn't willing to give, why do it in the first place if I won't be happy doing it.And for how much I can tip, I think this depends largely on how much I won and how good I feel, and maybe how impressed I am with the slot attendant, if the attendant is a female and very pretty, respectful and humble, I will likely give a tip more than $20, same goes too if the attendant is a male.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "December 14, 2022, 03:04:35 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you think it is necessary to give tips or it is just a tradition that is required?The question of being necessary or not to tip a machine attendant at the casino is not the issue because if it is necessary then it must be in rules and regulations of the casino that a winner must have to tip the attendant like one or two of them, so I have not seen where it is said to be necessary, no no. But the reason people tip is natural that when you have won, you are excited to give out. Excitement works wonder in trying to make someone act differently from their usual way for example like being intoxicated. And to top it up, if you have won alot of money, you are excited and you can give even your \"enemies\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "December 14, 2022, 03:06:13 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you think it is necessary to give tips or it is just a tradition that is required?This is an objective question which varies on the tradition of the country that will answer this question. Tipping is not a must in general but in some places it’s customary to give dealer a tip as sign of appreciation with there great service. I believe this also a norm on restaurants which some of them has a required percentage of tip base on the customer order total amount.In my country tip is not a big deal because players here don’t want to spend there money other than gambling. Only foreigners and some womanizer are giving tips to dealer when they are lucky but the rest just playing as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 14, 2022, 03:06:34 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PM...Do you think it is necessary to give tips or it is just a tradition that is required?Necessary means it's part of some rules and tipping is not so I would say it's just out of courtesy. I don't even know if there's a tipping tradition as I don't play with live dealers hehe.Maybe ask the online casinos such as livecasino if they have a tipping feature. They can probably add it if there are demands from players like you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 14, 2022, 03:16:20 PM",
      "body": "if the tip goes to the casino's chat/rep support BTC wallet maybe the gambler will consider tipping. sure its not compulsory.in my country, its not also compulsory to give tips but i guess a person gives to impress lookers. here, tips are centralized which all employees are going to get their tips which is divided and shared for all to receive when they day is over.  unless no one see when you slide the $20 bill inside the employees pocket that makes it his/her own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "December 14, 2022, 03:17:55 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMI do not think online casinos even have this option, but if there is, can you share?Roobet.com has a tip method that you can give to other users, the tip you want to give depends on your wishes, it can be $2-5-10 and so on.Example:Of course I give that tip when we win a bet, this is a tip on online gambling sites.If you talk about tips on live / land casinos, that's for sure it's all as you say, tips are privileges that want to be given to other users or the like, the tips that are given vary, there are $ 20 and so on, I'm sure that all are done by users who win in bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 14, 2022, 03:23:49 PM",
      "body": "Never had the habit of tipping others, even in other scenarios and not just in gambling so I doubt I'd actually do it if I'm ever put in such a situation. Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you think it is necessary to give tips or it is just a tradition that is required?I'd honestly say it isn't a necessary thing for gamblers to do, in a completely neutral view there's no reason as to why you should, it's just a matter of your goodwill I guess, not that not doing it doesn't mean you don't have any, nor does it mean that the experience was bad or anything. Especially in gambling, I reckon most would be more willing to spend money on the gamble itself, unless maybe they won big or something. Also never saw how tipping would be a tradition, at the very least it hasn't been one in my case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 14, 2022, 03:31:41 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you think it is necessary to give tips or it is just a tradition that is required?For me it's best to tip them when you're winning and about to leave. I think it's not necessary to tip them as it's not on the rules or maybe we just have different casino terms about tipping that we have visited. I don't think it's required at all, it's your money anyways and you can do whatever you like with that, tipping or no tipping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 14, 2022, 03:42:26 PM",
      "body": "Are there people that still give tips even if they're in a losing streak? Well, I don't give tips since most of my bets aren't that much.It's a culture that has made certain people in the society that it's an urged thing to do. But it's still a choice, those that have got a lot of wins and they tip, they have all the means to do that.And the same goes for those that don't really tip at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 14, 2022, 03:45:12 PM",
      "body": "It is not necessary but also not a bad thing if you want to tip a casino worker , if you do that you are sure next time you can get better service than the person not tipping off especial in physical casino. Most people tipping believe that more wining will come if you tip. It is not compulsory but it is good to give so you can have favour with the next game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "December 14, 2022, 04:06:39 PM",
      "body": "I rarely use the tip feature every time I play casino maybe if I win big I will use it, but unfortunately I never use that feature because I have never won big at casino games, although maybe in the future I will win big playing casino maybe I will share A few dollar tip for other gamblers, currently more into betting on sports",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 14, 2022, 04:23:42 PM",
      "body": "The rich probably have that tipping tradition. It's good to tip though not really required. In some hotels where the bellboy carries luggage is worth tipping just like the slot machine attendant. If it helps I think will people will consider tipping just as much as we would like to donate to the homeless on the streets at least the tip have some use to them.  But to whom will the tips go if the online casino has a tipping option?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "December 14, 2022, 04:54:46 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you think it is necessary to give tips or it is just a tradition that is required?Slot floor persons are paid, so tipping them is not always necessary. Any slot floor person that make it look like a must for you to tip them reported for painting a bad image for the casino like they are not being paid well. Tipping should be voluntary and something you should do when you feel like out of kindness and as an encouragement to a slot floor person for maybe his swift response to you or his/her charisma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "December 14, 2022, 05:29:22 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you tip only when you are winning and how much is too much tip to give? Also, I do not think online casinos even have this option, but if there is, can you share?Do you think it is necessary to give tips or it is just a tradition that is required?I rarely tip even if i'm winning since most of my winnings aren't that big but I remember doing it back then a couple of times as I felt like doing it. Someone already shared a screenshot of how tipping goes with online casinos and in other casinos, it's in a form of a chat command. Gamblers shouldn't feel the need to tip because they deserve to spend their winnings however they prefer.  Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMIn most parts of US, any payout of more than $1,200 is paid in person by the slot floor person. The tipping here starts with a minimum amount of $20 and can be up between 3-10 percent of the jackpot reward. It however, depends on the discretion of the customer. Also, you should quote this part since it likely came from this blog post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "December 14, 2022, 05:36:13 PM",
      "body": "Tipping isn't a necessity neither is it a tradition that we must uphold. Tipping is just a person way of maybe just saying thank you for the good work done. Most times I just tip even without waiting to be asked because I feel the attendant deserves it. I tip once in a while and I always let my find decide whenand who to tip, there was times I tipped everyday for two months but I was accused negatively and had to reduce and started letting my mind do most of the decisions because it's results came out best for me.There are things that would make me tip someone easily which includes the cleaniness of the casino and if a casino is neat and clean, I must tip and I'd tye attendant is very active, I must tip and if the service was nice and friendly, it's a tip must.I see nothing wrong with tipping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "December 14, 2022, 06:36:15 PM",
      "body": "Though tipping is being done voluntarily and cultural, I usually do it when I get lucky and have good winnings. I believe that we're not forced to tip them but we can do it out of love. I once tipped a machine attendant before and he was really happy and wasn't able to hide his emotions knowing that his son is sick and he could use the tipped money for his medication. Sometimes, our simple act of kindness could mean a lot to others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Genemind",
      "created_time": "December 14, 2022, 06:51:21 PM",
      "body": "In my opinion, tipping is not required or a tradition. Whenever we feel lucky or we are winning, a part of us always wants to share our winnings. I feel it will bring me more luck if I share my blessings with someone. It's also a way to give your thanks to the dealer or the slot operator since you might think he/she is the one who brought you luck. However, this is just my belief. Some people give tips because of excitement or to show off. Each of us has our own reason and belief in regard to tipping. In online casinos, there are options to tip other players, but it depends on the casinos if they have this kind of option or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "December 14, 2022, 06:54:22 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMHow much do you tip a slot machine attendant?For those who visit and still enjoy the services of these live casino operators, am curious as to know how you tip the attenders. Do you tip only when you are winning and how much is too much tip to give? Also, I do not think online casinos even have this option, but if there is, can you share?In most parts of US, any payout of more than $1,200 is paid in person by the slot floor person. The tipping here starts with a minimum amount of $20 and can be up between 3-10 percent of the jackpot reward. It however, depends on the discretion of the customer. Do you think it is necessary to give tips or it is just a tradition that is required?It's not mandatory to give tip as far as I know, so it's up to you whether you want to give up tip to the dealer or not. However, if I'm going to give a tip to the dealer, maybe if I won big in let's say baccarat or black jack.Yes, want I saw that the person that give tips is around $10-$20, so it's not that bad for a dealer to get that kind of tip. And for sure, in a night those dealers are making huge money just from the tip alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 14, 2022, 08:54:18 PM",
      "body": "Quote from: Cryptomultiplier on December 14, 2022, 02:47:35 PMDo you think it is necessary to give tips or it is just a tradition that is required?No it's not necessary, obviously dealer will appreciate it. But come to think, when you have lost so much money already, then why you need to give tips to the casino dealer? For good luck or you trying to impress everyone?So for me, I will not give any tips for them, even if I'm lucky and I don't think that it will sway your luck if you give them tips. They don't have control of the outcome of the card, everything is still based on your luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}