{
  "id": "topic_5462743",
  "title": "Amphenomenon",
  "author": "Amphenomenon",
  "created_time": "August 10, 2023, 03:53:26 AMLast edit: August 10, 2023, 02:40:27 PM by Amphenomenon",
  "content": "Most members of this forum knows the dangers of KYC and Centralize exchanage, so will try to avoid the use of them especially when there is a decentralized alternative, in the case of p2p there is a high chance of being scammed especially when you don`t know the person, though top CEX may not be entirely secure but they still offer some protection for this. Also DEX like Bisq exchange offer protection for this and this forum also offer a place for p2p.Questionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for Kyc p2p ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462743",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "August 10, 2023, 04:01:23 AM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMQuestionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for kyc ?Dex for KYC? Or do you mean Cex?You should know that they’re some cex out there that allows users to trade without having to complete KYC verification but the only drawback is that you’ll have a limit to the amount you can withdraw daily from the exchange and if you wish to increase your limit then you can undergo KYC verification.Current list of exchanges without KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "August 10, 2023, 04:06:24 AMLast edit: August 10, 2023, 06:00:01 AM by DaNNy001",
      "body": "Quote from: Cantsay on August 10, 2023, 04:01:23 AMQuote from: Amphenomenon on August 10, 2023, 03:53:26 AMQuestionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for kyc ?Dex for KYC? Or do you mean Cex?You should know that they’re some cex out there that allows users to trade without having to complete KYC verification but the only drawback is that you’ll have a limit to the amount you can withdraw daily from the exchange and if you wish to increase your limit then you can undergo KYC verification.Current list of exchanges without KYCI have heard of such CEX that KYC are abit limited although I haven't used any myself and I would also love to try out these because I am currently using Binance and my GOD the KYC requirements there is very hectic and so stressful most times because of all the recent update on the app. Although I know CEX are NOTgood for storing of coins since there is always a third party control over your coins but binance has proven it reliability to some extent when it's comes to exchanging your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 10, 2023, 05:12:32 AM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMQuestionthis are the only two legit DEX I know for p2p and so I will like to know other DEX I guess you are asking a different question here. DEx don't use KYC but if you need to know about other DEx that is legit and reliable. You can try Agora desk. It is a centralized exchange that you will need to use KYC before you can have full access to your trade. Kucoin claims to be DEx but there is a volume of trade that you will want to do that they will ask for KYC when using their P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "August 10, 2023, 05:49:40 AMLast edit: August 10, 2023, 05:59:41 AM by Zaguru12",
      "body": "Quote from: DaNNy001 on August 10, 2023, 04:06:24 AMAlthough I know CEX are good for storing of coins since there is always a third party control over your coins but binance has proven it reliability to some extent when it's comes to exchanging your coins.I think you missed this up here, there is no way storing coins or funds online been good, third party control of your funds has been totally advised against. Because once the exchange or platform gets compromised, so goes your funds. Don’t be confident because of the reputation of binance, many top centralized exchanges have bite the dust in the past with peoples fund going down with them. So just like every usually say it is always NOT YOUR KEYS, NOT YOUR COINSQuote from: Sim_card on August 10, 2023, 05:12:32 AMYou can try Agora desk. It is a centralized exchange that you will need to use KYC before you can have full access to your trade. I haven’t used Agora Desk but they said it is a Non KYC P2P exchange according to their ANN here on the forum, so no verification what so ever is required. Quote from: Sim_card on August 10, 2023, 05:12:32 AM Kucoin claims to be DEx but there is a volume of trade that you will want to do that they will ask for KYC when using their P2P.Yes they actually have levels to which there are limitations too. The highest level to which you wouldn’t submit documents is the level 1 and it is limited to trading of less than 500$ per day. Above that needs you to submit or scan documents and get verified. This thread by Ratimov explains each level on the platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "August 10, 2023, 06:04:20 AM",
      "body": "Quote from: Zaguru12 on August 10, 2023, 05:49:40 AMQuote from: DaNNy001 on August 10, 2023, 04:06:24 AMAlthough I know CEX are good for storing of coins since there is always a third party control over your coins but binance has proven it reliability to some extent when it's comes to exchanging your coins.I think you missed this up here, there is no way storing coins or funds online been good, third party control of your funds has been totally advised against. Because once the exchange or platform gets compromised, so goes your funds. Don’t be confident because of the reputation of binance, many top centralized exchanges have bite the dust in the past with peoples fund going down with them. So just like every usually say it is always NOT YOUR KEYS, NOT YOUR COINS sorry mate, thats not entirely what I intend in writing, I think I missed out the NOT I wanted to add to that statement and I have duly corrected it. Sometimes we type and make minor errors and for the record I won't advice anyone to actually save their coins in any exchange as I do use them myself for only the function of exchanging your coins. For storing of assets, I think there are couple of good non custodial wallet I would prefer than a third party CEX wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 10, 2023, 06:13:36 AM",
      "body": "DEX and P2P are similar but has some difference.DEX is an exchange where you trade your coin with someone you don't know who the person is, but you're actually trade via P2P, nothing linked with the exchange's pool. Trading via P2P, you're know the person you trade and it's really depend on the trustworthiness whether the trade is successfully or you get scammed.This is a good site to know the DEX and P2P that related with privacy level https://kycnot.me/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 10, 2023, 06:36:35 AM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AM-snip-this are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for kyc ?Bisq is only the most recommended exchange, not the official DEX sponsored/supported by this forum. If you ultimately want to implement KYC, you are better off using CEX. They are generally legally bound at least in writing to protect user documents. DEX doesn't have that and should never ask for KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "August 10, 2023, 06:52:32 AM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMQuestionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for kyc ?Judging from various user rhetoric, not everyone is comfortable with the concept of KYC over privacy, because the user's personal data is seen and controlled directly by the exchange manager. So, if you want to know other DEX’s that are good for KYC, I think there are many available, but of course you are looking for the safest and easiest one if one thing or another happens in the exchange and it can be resolved without harming you as a user, of course, and that too if it happens from time to time. My advice, you can try ByBit, about when you make DEPO and WD process is very fast and easy. The important thing is that you have to pay close attention to the address and network before making a depot or WD process. Yes. That's all from me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "August 10, 2023, 06:58:53 AM",
      "body": "Quote from: noorman0 on August 10, 2023, 06:36:35 AMQuote from: Amphenomenon on August 10, 2023, 03:53:26 AM-snip-this are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for kyc ?Bisq is only the most recommended exchange, not the official DEX sponsored/supported by this forum. If you ultimately want to implement KYC, you are better off using CEX. They are generally legally bound at least in writing to protect user documents. DEX doesn't have that and should never ask for KYC.I don't know about Bisq but a good number of these DEX are establish themselves as non-kyc required exchanges but at some point you'll find out that the no KYC is limited to a certain trading amount and withdrawal, however, when you go beyond the limit KYC verification is then required, perhaps a Dex was supposed to completely operates as a Dex, if a user was ready to give out his data he would have just settled for CEX at the first instance, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "August 10, 2023, 08:42:25 AM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMin the case of p2p there is a high chance of being scammed especially when you don`t know the personAs long your chosen p2p platform has a good reputation + offer escrow + you've read the common scam schemes on p2p trades, you should be fine. I've been p2p-ing for fiat <-> crypto for years and never been scammed. Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMQuestionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for kyc ?Honestly, I only know BISQ. There are other platforms which claimed to be decentralized but if you look closely, they aren't so that's something to keep in mind.I just wanna add that there are non-fully-custodial alternatives that also don't do identity verification like agoradesk and robosats. They may not be decentralized but they have taken users privacy into huge consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "August 10, 2023, 11:03:18 AM",
      "body": "Currently I personally mostly use p2p provided by top Cex like Binance and others. And for now I'm more comfortable with it. well, KYC is a bit of a pain but I think it's necessary for a reason. So it's not a problem for me. What I prioritize is security and speed.But about Bisq I got curious after seeing this thread. Maybe I'll try it sometime soon. And will I be more comfortable there until I switch there and leave the P2p provided by Cex.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "August 10, 2023, 11:17:18 AM",
      "body": "Quote from: letteredhub on August 10, 2023, 06:58:53 AMI don't know about Bisq but a good number of these DEX are establish themselves as non-kyc required exchanges but at some point you'll find out that the no KYC is limited to a certain trading amount and withdrawal, however, when you go beyond the limit KYC verification is then required, perhaps a Dex was supposed to completely operates as a Dex, if a user was ready to give out his data he would have just settled for CEX at the first instance, right?  Can you mention some of these decentralized exchanges that you are talking about, some exchanges might claim that they are decentralized, whereas they are not. Decentralized exchanges do not require KYC, but there are centralized exchanges that allow their users trade without kyc up to a certain amount, it doesn't mean that those exchanges are decentralized, neither do they claim to be, they are centralized and KYC is definitely required to trade above the limit for no-kyc trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 10, 2023, 02:21:03 PM",
      "body": "Quote from: Coyster on August 10, 2023, 11:17:18 AMCan you mention some of these decentralized exchanges that you are talking about, I think the two CEX he is talking about are the forum and the Bisq exchange, as he stated below.Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMAlso DEX like Bisq exchange offer protection for this and this forum also offer a place for p2p.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "August 10, 2023, 02:42:07 PM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AM Most members of this forum knows the dangers of KYC and Centralize exchanage, so will try to avoid the use of them especially when there is a decentralized alternative, in the case of p2p there is a high chance of being scammed especially when you don`t know the person, though top CEX may not be entirely secure but they still offer some protection for this. Also DEX like Bisq exchange offer protection for this and this forum also offer a place for p2p.Questionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for kyc ?You are mixing Cex, KYC and Dex together. The reason why exchanges are called centralized is because they:1. They ask you for your information and as a result, you must do KYC(know your customers) as means of identifying the user.2. They give you a unique wallet address, without the private key and that makes them a custodial organization which are always not safe to use, anything can happen, you don't want them to run off one day right and because they are here doesn't mean its not possible.  I want to scare you, read more about the MT Gox exchange.The Dex is the opposite of what I just highlighted about the centralized exchange. However, DEX and CEX both offer P2P feature where you can sell to any buyer or seller, the difference is that one Cex has act as the middle man that hold the coins while Dex doesn't hold the coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 10, 2023, 03:10:21 PM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for Kyc p2p ?If I am not wrong you are looking for p2p exchange with no KYC requirement.In that case you can go through List of P2P/no-KYC exchangesAlso https://kycnot.me/But the real issue with decentralized p2p platforms is there is not enough liquidity and premium prices so if you want to prioritize priavcy the the prices is going to be a lot than the market price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "August 10, 2023, 03:13:46 PM",
      "body": "Quote from: Cookdata on August 10, 2023, 02:42:07 PMYou are mixing Cex, KYC and Dex together. The reason why exchanges are called centralized is because they:1. They ask you for your information and as a result, you must do KYC(know your customers) as means of identifying the user.2. They give you a unique wallet address, without the private key and that makes them a custodial organization which are always not safe to use, anything can happen, you don't want them to run off one day right and because they are here doesn't mean its not possible.  I want to scare you, read more about the MT Gox exchange.The Dex is the opposite of what I just highlighted about the centralized exchange. However, DEX and CEX both offer P2P feature where you can sell to any buyer or seller, the difference is that one Cex has act as the middle man that hold the coins while Dex doesn't hold the coins.I beg to differ with your understanding of a CEX. The first reason for a CEX to be centralized is because it is controlled by a centralized authority. The best example would be Binance which is completely operated by CZ and a few 100 employees. The next example of wallets is irrelevant as there are wallets like trust wallets which are noncustodial but centralized.The simple difference between a CEX and a DEX is that a centralized exchange has someone or a group controlling its operation. Whereas a DEX is controlled by the users participating in trading on that exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "August 10, 2023, 03:42:46 PM",
      "body": "Quote from: Amphenomenon on August 10, 2023, 03:53:26 AMQuestionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for Kyc p2p ?Bisq is a good exchange and many members here use and recommend the exchange. Bitcointalk is also a good place to trade p2p, you can find reputable members to act as escrow for your trades. of course this two are not the only platforms to trade p2p,  read this thread by @Ratimov.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "August 10, 2023, 03:56:53 PM",
      "body": "Quote from: elevates on August 10, 2023, 03:13:46 PMQuote from: Cookdata on August 10, 2023, 02:42:07 PMYou are mixing Cex, KYC and Dex together. The reason why exchanges are called centralized is because they:1. They ask you for your information and as a result, you must do KYC(know your customers) as means of identifying the user.2. They give you a unique wallet address, without the private key and that makes them a custodial organization which are always not safe to use, anything can happen, you don't want them to run off one day right and because they are here doesn't mean its not possible.  I want to scare you, read more about the MT Gox exchange.The Dex is the opposite of what I just highlighted about the centralized exchange. However, DEX and CEX both offer P2P feature where you can sell to any buyer or seller, the difference is that one Cex has act as the middle man that hold the coins while Dex doesn't hold the coins.I beg to differ with your understanding of a CEX. The first reason for a CEX to be centralized is because it is controlled by a centralized authority. The best example would be Binance which is completely operated by CZ and a few 100 employees. The next example of wallets is irrelevant as there are wallets like trust wallets which are noncustodial but centralized.The simple difference between a CEX and a DEX is that a centralized exchange has someone or a group controlling its operation. Whereas a DEX is controlled by the users participating in trading on that exchange.  What have you said that I didn't simplify in my explanation or you want me to write an epistle about shitty centralized exchanges over decentralized exchange? Huh!Centralized exchanges are more than what you think, more like organized crime that package their self as clean people but deep down, they do worse than what you see in the public. Didn't you see SEC and Gary Gensler running after them.The idea of discouraging KYC is to protect privacy, you don't want your whole life to be monitor just because you want to trade a pair of Bitcoin to shitty usdt, you don't want to your account be lock one day and when you don't have the private key, you are screw as hell. Who do you run to when all this happened? Absolutely nobody and there is nothing you can do about it because it's in their terms and conditions, they could lie against you that you violate one of the terms.Wherther custodial or noncustodial, learn to hold your private keys in your pant secretly.Maybe you go through my reply once more, and you will understand we are saying the same thing but in different context.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "August 12, 2023, 03:59:34 AM",
      "body": "Quote from: Pokapoka124 on August 10, 2023, 03:42:46 PMQuote from: Amphenomenon on August 10, 2023, 03:53:26 AMQuestionthis are the only two legit DEX I know for p2p and so I will like to know other DEX that are good for Kyc p2p ?Bisq is a good exchange and many members here use and recommend the exchange. Bitcointalk is also a good place to trade p2p, you can find reputable members to act as escrow for your trades. of course this two are not the only platforms to trade p2p,  read this thread by @Ratimov.Thank you @Pokapoka124 for providing the link from the thread post by @Ratimov and this, so it's very easy for all of us who are busy visiting here and there and saving time. Yes, this is very useful of course for me and other friends if there are questions at any time.whell, I'll take my time to see it for a bit and visit it too.. .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}