{
  "id": "topic_5420604",
  "title": "Geremia",
  "author": "Geremia",
  "created_time": "November 12, 2022, 04:11:42 AMLast edit: February 11, 2023, 03:53:23 AM by Geremia",
  "content": "A CoinCloud ATM did not give me the $100 I sold my ₿ for. Going to the URL they texted me, the ATM says: \"Error: The transaction has already expired\", but the ₿ transaction confirmed!{I even had to use a different phone number, ∵ my original one (which used to work with these ATMs) gives an unknown error when I type in the PIN they text.}Their SMS support #, (855) 264-5046‬, is unresponsive; support@coin.cloud hasn't responded to me after weeks.Also, CoinCloud now only allows buying ₿ online. Why? Is it part of a Deep State scheme to deprive citizens of cash? (Or a scheme to combat fiat-induced inflation, an example of Gresham's Law?)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420604",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "November 14, 2022, 06:19:43 PM",
      "body": "Quote from: Geremia on November 12, 2022, 04:11:42 AMA CoinCloud ATM did not give me the $100 I sold my ₿ for. Going to the URL they texted me, the ATM says: \"Error: The transaction has already expired\", but the ₿ transaction confirmed!Does the URL lead to a page that clearly shows the Tx ID and the address that you were supposed to send it to as well or it only shows the status of the transaction with just a label?- Sorry if I'm asking a question, but I'm basically after anything that can be used as proof.Quote from: Geremia on November 12, 2022, 04:11:42 AMTheir SMS support #, (855) 264-5046‬, is unresponsive; support@coin.cloud hasn't responded to me after weeks.Have you tried calling their client support line instead [855-264-2046]?- I noticed they keep pointing users toward it on both \"Twitter\" and \"Trustpilot\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "November 24, 2022, 12:01:02 AMLast edit: November 24, 2022, 12:22:19 AM by Geremia",
      "body": "Quote from: SFR10 on November 14, 2022, 06:19:43 PMHave you tried calling their client support line instead [855-264-2046]?Thanks. That # worked. They were helpful.They told me to register as a private client. Maybe that'll help.Still, I'm disappointed that they think a blockchain-confirmed transaction \"expired\"…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "November 24, 2022, 02:07:07 AM",
      "body": "Haven't used this service yet, but let me help with my logic. Is it possible to request a transaction status with a different number from the one registered? I think your problem is at this point, the system cannot match your transaction if you use a new number.What if you first solve the problem on the first registered number that gets the wrong PIN number?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 24, 2022, 07:13:15 AM",
      "body": "Quote from: Geremia on November 24, 2022, 12:01:02 AMThanks. That # worked. They were helpful.They told me to register as a private client. Maybe that'll help.You're very welcome, but I'm not entirely convinced it had a positive impact on your case [I hope I'm wrong].- Their private client desk is for individuals who are looking to buy/sell $25K and above.Quote from: Geremia on November 24, 2022, 12:01:02 AMStill, I'm disappointed that they think a blockchain-confirmed transaction \"expired\"…I'm starting to think they're just making various excuses...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "November 24, 2022, 03:28:43 PM",
      "body": "Quote from: Geremia on November 24, 2022, 12:01:02 AMStill, I'm disappointed that they think a blockchain-confirmed transaction \"expired\"…I have read and seen the same case one month ago about CoinCloud ATM scamming crypto users out there, but that incident has passed 5 years, to be exact i read on Reddit @TheGreatElector.Proof:Beware of CoinCloud ATMs for Bitcoin!QuoteSo here is my advice, if you happen to be near a Coin Cloud ATM, don't. Don't purchase from a Coin Cloud ATM, hell if you need to use cash go and buy a visa gift card and purchase BTC online or any other atm than CoinCloud so that you don’t get robbed.At that time I checked this forum, there were no accusations and those who used CoinCloud ATMs, so I didn't think to warn members in this forum, don't use CoinCloud ATMs, uh apparently today I saw @Geremia being a victim of CoinCloud ATMs.But I tried to check the other reviews, indeed the CoinCloud ATM has lots of negative reviews, I think @Geremia is the umpteenth victim from CoinCloud, maybe in the future don't use CoinCloud ATM anymore, what happened can be a lesson for your to be more careful in the future, while shopping exchanging fiat for crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "November 29, 2022, 12:14:30 AM",
      "body": "Quote from: SFR10 on November 24, 2022, 07:13:15 AM- Their private client desk is for individuals who are looking to buy/sell $25K and above.Their Private Client Desk called back; he's escalating my issue to tech support…Quote from: SFR10 on November 24, 2022, 07:13:15 AMI'm starting to think they're just making various excuses...Me, too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "December 14, 2022, 12:06:31 AM",
      "body": "Quote from: Geremia on November 29, 2022, 12:14:30 AMhe's escalating my issue to tech support…Tech support still hasn't gotten back to me…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "December 14, 2022, 03:14:20 PM",
      "body": "Quote from: Geremia on December 14, 2022, 12:06:31 AMQuote from: Geremia on November 29, 2022, 12:14:30 AMhe's escalating my issue to tech support…Tech support still hasn't gotten back to me…I just found out they're struggling at the moment [it looks like we were right about them making excuses]... They're trying to get more capital from a brokerage firm that's having a hard time raising fresh capital [source] and if things don't go in their way, they may have to file for bankruptcy [it's a big mess]!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "December 18, 2022, 12:07:01 AM",
      "body": "Has anyone been able to speak to someone at 855-264-2046 anymore? I haven't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "January 16, 2023, 10:59:12 PM",
      "body": "Called them again, and they answered right away. They had no record of any transactions from my phone number, when really the last one was mid-year last year.Called again from my alt number and had to wait a bit longer. They said to email the ₿ transaction details to support@coin.cloud and call them back. I did so and called back, and a different agent didn't realize that there was an escalated tech support ticket on my account and put me on hold for an hour while investigating it and didn't seem to understand what a confirmed ₿ transaction is. Had to send an URL to an online blockchain explorer to prove it was a confirmed transaction. Do they even know that the address I sent to was one of theirs? How hard is that to determine?Either these people are incompetent, or they're scammers. I mean how many months is it gonna take them to fix this what one agent called a \"bug\"?For sure I'm using locally-operated ₿ ATMs from now on. I've had 100% reliability with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "January 18, 2023, 09:36:36 PM",
      "body": "Quote from: Geremia on January 16, 2023, 10:59:12 PMCalled them again, and they answered right away. They had no record of any transactions from my phone number, when really the last one was mid-year last year.Called again from my alt number and had to wait a bit longer. They said to email the ₿ transaction details to support@coin.cloud and call them back. I did so and called back, and a different agent didn't realize that there was an escalated tech support ticket on my account and put me on hold for an hour while investigating it and didn't seem to understand what a confirmed ₿ transaction is. Had to send an URL to an online blockchain explorer to prove it was a confirmed transaction. Do they even know that the address I sent to was one of theirs? How hard is that to determine?Either these people are incompetent, or they're scammers. I mean how many months is it gonna take them to fix this what one agent called a \"bug\"?For sure I'm using locally-operated ₿ ATMs from now on. I've had 100% reliability with them.That's some very terrible support service right there, and I would be so pissed If I was in the same situation as you, having to wait for months with no viable solution. I have equally come a cross so very poor customer support agents and I realized some were either just half-baked interns with barely any good technical knowledge or some random ignorant virtual assistants hired online",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "February 04, 2023, 08:27:57 PM",
      "body": "Well, they finally refunded me, so perhaps they're not scamsters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "February 06, 2023, 04:35:19 PM",
      "body": "Quote from: Geremia on February 04, 2023, 08:27:57 PMWell, they finally refunded me, so perhaps they're not scamsters.I'm glad you finally got what's yours, but considering how much time it took, it's still a bit strange they didn't process the exchange and give you the cash! Did you ask for a refund or that was the only way?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "February 06, 2023, 04:39:44 PM",
      "body": "@Geremia many thanks for this news! I am glad you solved this issue.At this point, please update first post and topic title. It would be useful also for other users  https://bitcointalk.org/index.php?topic=5420604.msg61279378#msg61279378",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "February 11, 2023, 03:52:46 AM",
      "body": "Quote from: SFR10 on February 06, 2023, 04:35:19 PMDid you ask for a refund or that was the only way?I didn't suggest they refund me; they did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "February 12, 2023, 06:28:23 PM",
      "body": "Quote from: Geremia on February 11, 2023, 03:52:46 AMI didn't suggest they refund me; they did.You are lucky you got a refund. It looks like they have been in some sort of financial difficulties lately. Not so long ago, they filed for bankruptcy. Your problem that resulted in a long period without getting a refund could have stemmed from their financial issues. You can follow all the details in this thread Bitcoin ATM Operator Coin Cloud Files for Bankruptcy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}