{
  "id": "topic_5455947",
  "title": "Promocodeudo",
  "author": "Promocodeudo",
  "created_time": "June 10, 2023, 12:05:59 PM",
  "content": "It has been some months that I have been in this forum, I have started making arrangements for transacting with Bitcoin in the aspect of buying and storing. I don't have much knowledge of wallet to the extent of knowing a preferable wallet to use for storing my Bitcoin, right now I know that Bitcoin is a valuable asset from my understanding but other people doesn't accept the fact that it is really an asset, so I want to know a good wallet to use for my Bitcoin because I notice that some wallet my friends recommend to me are all exchange kind of wallet and I was told that it's not proper to use an exchange wallet for storing or saving of Bitcoin for a long time. I wish to have more recommendation or articles to read concerning wallets and it's security values but during my research I was recommended to use electrum wallet but I was confused if electrum wallet is an exchange or a custodial wallet, therefore i need a good direction, clarification and update of suitable wallet from senior colleagues.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455947",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "June 10, 2023, 12:13:39 PM",
      "body": "Quote from: Promocodeudo on June 10, 2023, 12:05:59 PMduring my research I was recommended to use electrum wallet but I was confused if electrum wallet is an exchange or a custodial wallet, therefore i need a good direction, clarification and update of suitable wallet from senior colleagues.Electrum is a non-custodial wallet which means that it gives you full access to your private keys. Since electrum is open-source and its code has been reviewed by many people, you can be sure that it's secure enough. Note that if you want your fund to be completely secure, you should run electrum on an airgapped device. Any online device is always prone to hacking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 10, 2023, 12:16:08 PMLast edit: June 14, 2023, 10:00:56 PM by Nwada001",
      "body": "First, all you need is a secured, self-custodial wallet. Avoid storing your crypto on a centralized exchange. It all depends on the amount of crypto you want to transact; if it's worth a little more, then purchasing a hardware wallet will be a better idea.Check out the  list of open-source hardware wallets.Ledger Trezor should be avoided, though, since they are now gradually going centralized instead of fully decentralized and self-custodial. For security reasons, avoid them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "June 10, 2023, 12:49:09 PM",
      "body": "Quote from: Nwada001 on June 10, 2023, 12:16:08 PMFirst, all you need is a secured, self-custodial wallet. Avoid storing your crypto on a centralized exchange. It all depends on the amount of crypto you want to transact; if it's worth a little more, then purchasing a hardware wallet will be a better idea.Check out the  list of open-source hardware wallets.Trezor should be avoided, though, since they are now gradually going centralized instead of fully decentralized and self-custodial. For security reasons, avoid them.<-- Definitely check out the thread mentioned here.Regarding Trezor: Still much more recommended than a Ledger wallet though.May be a bit much for a newcomer, but you can always cross-check any wallet that may appeal to you here: https://walletscrutiny.com/They give a good summary on overall wallet security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 10, 2023, 01:05:20 PM",
      "body": "Your friends are right that you shouldn't keep your bitcoin on any exchange if you've got no plans of trading it there. Usually newbies keep their bitcoins there on exchanges because of the term that they've just read and heard about the funds being \"SAFU\". You don't believe into such that it will make your funds safe there but just remember that if you don't hold the keys, you don't hold those bitcoins that you deposit there. Just as suggested, hardware wallets are the most recommended but if you've got no budget yet for it, choose Electrum and the other recommended desktop wallet is Wasabi. And for more other options: Choose your Bitcoin wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "June 10, 2023, 01:25:00 PM",
      "body": "Quote from: Promocodeudo on June 10, 2023, 12:05:59 PMIt has been some months that I have been in this forum, I have started making arrangements for transacting with Bitcoin in the aspect of buying and storing. I don't have much knowledge of wallet to the extent of knowing a preferable wallet to use for storing my Bitcoin, right now I know that Bitcoin is a valuable asset from my understanding but other people doesn't accept the fact that it is really an asset, so I want to know a good wallet to use for my Bitcoin because I notice that some wallet my friends recommend to me are all exchange kind of wallet and I was told that it's not proper to use an exchange wallet for storing or saving of Bitcoin for a long time. I wish to have more recommendation or articles to read concerning wallets and it's security values but during my research I was recommended to use electrum wallet but I was confused if electrum wallet is an exchange or a custodial wallet, therefore i need a good direction, clarification and update of suitable wallet from senior colleagues.There is nothing wrong with keeping your assets in the exchange as long as you choose the correct exchange or one that has been there for a long time, since there are many traders and small investors who do just that. If you intend to keep your asset for a long period of time, it is important and practicable to keep it in a non-custodial wallet such as electrum because it's already tested. Because electrum only supports Bitcoin, you can keep your altcoins in Trustwallet or Metamask as a non-custodial wallet, which is considerably more secure than an exchange because you owned the private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 10, 2023, 01:29:17 PM",
      "body": "Quote from: jeraldskie11 on June 10, 2023, 01:25:00 PMThere is nothing wrong with keeping your assets in the exchange as long as you choose the correct exchange or one that has been there for a long time, since there are many traders and small investors who do just that. Not your keys, not your coins. With keeping your bitcoin on an exchange, you give full control over your fund to a third party. Even if a centralized service has been around for a very long time, everything is still possible. They may go bankrupt or they may be hacked.Quote from: jeraldskie11 on June 10, 2023, 01:25:00 PMBecause electrum only supports Bitcoin, you can keep your altcoins in Trustwallet or Metamask as a non-custodial wallet, which is considerably more secure than an exchange because you owned the private key.Trust wallet is close source and I would never recommend anyone to use it. We don't know how keys are generated on trustwallet.There is no guarantee that what happened to Atomic wallet recently won't happen to trustwallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "June 10, 2023, 01:37:32 PM",
      "body": "The most easy way to differentiate between exchange and wallet is the way of access.If you want to access an exchange, you must use username or email address with your password, while if you access a wallet, you only need to enter a seed phrase or private key for once time and you don't need to input anything except you use PIN/password/2FA etc.To secure your wallet, you need to learn how to make sure your PC or laptop is 100% secure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "June 10, 2023, 02:00:19 PM",
      "body": "Quote from: jeraldskie11 on June 10, 2023, 01:25:00 PMQuote from: Promocodeudo on June 10, 2023, 12:05:59 PMIt has been some months that I have been in this forum, I have started making arrangements for transacting with Bitcoin in the aspect of buying and storing. I don't have much knowledge of wallet to the extent of knowing a preferable wallet to use for storing my Bitcoin, right now I know that Bitcoin is a valuable asset from my understanding but other people doesn't accept the fact that it is really an asset, so I want to know a good wallet to use for my Bitcoin because I notice that some wallet my friends recommend to me are all exchange kind of wallet and I was told that it's not proper to use an exchange wallet for storing or saving of Bitcoin for a long time. I wish to have more recommendation or articles to read concerning wallets and it's security values but during my research I was recommended to use electrum wallet but I was confused if electrum wallet is an exchange or a custodial wallet, therefore i need a good direction, clarification and update of suitable wallet from senior colleagues.There is nothing wrong with keeping your assets in the exchange as long as you choose the correct exchange or one that has been there for a long time, since there are many traders and small investors who do just that. If you intend to keep your asset for a long period of time, it is important and practicable to keep it in a non-custodial wallet such as electrum because it's already tested. Because electrum only supports Bitcoin, you can keep your altcoins in Trustwallet or Metamask as a non-custodial wallet, which is considerably more secure than an exchange because you owned the private key.Not all centralized exchanges are bankrupt or will collapse, there are many old exchanges like Coinbase or Poloniex...so far, they still exist and work quite well. But if you are a long-term investor who is not a trader, you should not use an exchange's wallet to store bitcoins. There is no guarantee that one day they will not collapse, we should still prevent diseases than cure. The exchange is a place for us to exchange, buy and sell, not a place to store assets, we should use it for the right purpose. Electrum and matemask are good options, but Trust wallet, I don't think it is a good choice, it is a non-custodial but closed source wallet and is a product of Binance. We won't know what will happen to our assets when using a closed source wallet even though we own the seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "June 10, 2023, 02:01:19 PM",
      "body": "This is a question that has been answered too many times on this forum in the past, you don't have to go ahead and create another topic about this again, you can just use the search engine on the right top of the forum and type in how to secure your wallet I am very sure you will get tons of results because people like you already created topics like this few times before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 10, 2023, 02:30:26 PM",
      "body": "Quote from: hosseinimr93 on June 10, 2023, 12:13:39 PMElectrum is a non-custodial wallet which means that it gives you full access to your private keys. Since electrum is open-source and its code has been reviewed by many people, you can be sure that it's secure enough. Note that if you want your fund to be completely secure, you should run electrum on an airgapped device. Any online device is always prone to hacking. Electrum wallet is free, open source, non custodial and good to use. It has many 'modes' to use like single signature wallet, multi signature wallet, cold storage ...Always download it from the official website : https://electrum.org/#download and verify the wallet.[GUIDE] How to Safely Download and Verify ElectrumMultisig walletCold storage walletOP, when you use a non custodial wallet, always backup your wallet. Without backups, you will lose your bitcoin if your original device gets technical problems and can not be recovered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wahyuagung26",
      "created_time": "June 10, 2023, 02:50:43 PM",
      "body": "Keeping assets on the exchange for too long is actually not recommended even though the exchange has been around for a long time, and indeed there are traders and investors who do it, if it's in small form it's actually not too worried, but you should have a safer wallet, maybe some of the options among them are wallets that are securely accessed in full quasi-full control by yourself, for example like Electrum.The exchange is indeed a place that is often used by crypto traders and even investors often use it, but a crash from an exchange we will not know how big the impact will be even if it is an old and centralized exchange, so to anticipate you have to have a wallet where you can get access full private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "June 10, 2023, 03:57:27 PM",
      "body": "Quote from: hosseinimr93 on June 10, 2023, 01:29:17 PMQuote from: jeraldskie11 on June 10, 2023, 01:25:00 PMThere is nothing wrong with keeping your assets in the exchange as long as you choose the correct exchange or one that has been there for a long time, since there are many traders and small investors who do just that. Not your keys, not your coins. With keeping your bitcoin on an exchange, you give full control over your fund to a third party. Even if a centralized service has been around for a very long time, everything is still possible. They may go bankrupt or they may be hacked.Quote from: jeraldskie11 on June 10, 2023, 01:25:00 PMBecause electrum only supports Bitcoin, you can keep your altcoins in Trustwallet or Metamask as a non-custodial wallet, which is considerably more secure than an exchange because you owned the private key.Trust wallet is close source and I would never recommend anyone to use it. We don't know how keys are generated on trustwallet.There is no guarantee that what happened to Atomic wallet recently won't happen to trustwallet. Master Hoseeinimr93, whenever you are telling people not to use a wallet for storing their coins because they are closed source, do not hesitate to give them a better option, if Trust wallet is closed source, please give the name of an open source alternative that is multi-chain compatible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 10, 2023, 04:10:58 PM",
      "body": "Quote from: Z390 on June 10, 2023, 03:57:27 PMMaster Hoseeinimr93, whenever you are telling people not to use a wallet for storing their coins because they are closed source, do not hesitate to give them a better option, You can go for a good hardware wallet like Trezor. That's the best thing you can do. Visit the topic created by dkbit98 to know some other alternatives. [LIST ] Open Source Hardware WalletsIf you can't afford to buy a hardware wallet or you don't want to use a hardware wallet for any other reason, you can use Unstoppable wallet. Visit the topic created by theymos. Reminder: do not keep your money in online accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "June 10, 2023, 04:19:18 PM",
      "body": "I think you can visit bitcoin.org and select the Wallet menu. You will be given a choice of which wallet you want to use and a wallet available that can be installed on various devices. You just follow what is written there and later, you will have wallet names that you can choose to install.Of course, if you want to install the wallet on your phone, you must also adapt it to your phone's software. Or you want to install the wallet on your computer or laptop. And even if you want to buy a hardware wallet, you will be given a choice. You can see what wallets you can use.You don't need to buy a hardware wallet before you know more about Bitcoin because you can install the wallet on your phone, computer, or laptop. After you buy a hardware wallet, you must know how it works to store it properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 10, 2023, 04:27:29 PM",
      "body": "Electrum Wallet is not a bad wallet. You can use Electrum or Wasabi wallet. You can get the Electrum Wallet from Google play store if you are using Android phone or from the main official site if you are using desktop. Exchange are not recommended because they are centralized and because of that hackers and government are always attacking them. Government is attacking them more than even the hackers. Small things government want to close them or seized and with all those things your coins are not saved in their hands. So it better you look for non custodian wallets and keep your coins for the long term storing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fathafraink",
      "created_time": "June 10, 2023, 04:28:08 PM",
      "body": "Quote from: Promocodeudo on June 10, 2023, 12:05:59 PMIt has been some months that I have been in this forum, I have started making arrangements for transacting with Bitcoin in the aspect of buying and storing. I don't have much knowledge of wallet to the extent of knowing a preferable wallet to use for storing my Bitcoin, right now I know that Bitcoin is a valuable asset from my understanding but other people doesn't accept the fact that it is really an asset, so I want to know a good wallet to use for my Bitcoin because I notice that some wallet my friends recommend to me are all exchange kind of wallet and I was told that it's not proper to use an exchange wallet for storing or saving of Bitcoin for a long time. I wish to have more recommendation or articles to read concerning wallets and it's security values but during my research I was recommended to use electrum wallet but I was confused if electrum wallet is an exchange or a custodial wallet, therefore i need a good direction, clarification and update of suitable wallet from senior colleagues.Nothing wrong by storing or saving Bitcoin in Exchange wallet for a long time as long as the Exchange market has been regulated and supervised by government ( Not every country has regulation on Cryptocurrencies ), so I think it would be safe to store your Bitcoin in Exchange, and If the Exchange has a problem, the government could be a guarantor for the users of the Exchange market. By the way, I live in Indonesia, where the government has regulated and supervised the Exchange Market in Indonesia, so the Investors/Users of the Exchange Market could be Protected. So the point is, you need to make sure whether your government has a regulation or not. Here is the link where you can see how Indonesian Government regulation : - https://www.arkanantalaw.co.id/news/crypto-regulation-in-indonesia-protection-of-investors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "June 10, 2023, 04:38:59 PM",
      "body": "Quote from: Nwada001 on June 10, 2023, 12:16:08 PMTrezor should be avoided, though, since they are now gradually going centralized instead of fully decentralized and self-custodial. For security reasons, avoid them.Do you have any proof of what you are saying?  because after what happened with Ledger, I see many people are starting to move to Trezor, and it is currently the top choice in a hardware wallet.  Hosseinimr93 also says that Trezor is the best hardware wallet to use.  Trezor revenue has skyrocketed after Ledger disappointed investors and I am also planning to own a Trezor hardware wallet. i am really confused by what you are saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 10, 2023, 04:46:56 PM",
      "body": "Quote from: Mate2237 on June 10, 2023, 04:27:29 PMYou can use Electrum or Wasabi wallet. You can get the Electrum Wallet from Google play store if you are using Android phone or from the main official site if you are using desktop.Even if you are using an Android device you should not download Electrum wallet from Google play store, it is dangerous and you can download a fake version of Electrum, always download Electrum from their official website and verify your download to ensure that everything is fine and safe before using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "June 10, 2023, 05:08:34 PM",
      "body": "Just good housekeeping says it's equally important to have your stuff spread across a few wallets with differing technologies. Better to take a fractional hit than a full one.Like Examples: IT orgs never store data in just one place. Triple control systems on airliners. Never keep your money in one bank.No brainer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}