{
  "id": "topic_5453154",
  "title": "durop77",
  "author": "durop77",
  "created_time": "May 18, 2023, 05:19:33 AM",
  "content": "Прошел первый этап выборов в Турции. Как мы видим противостояние сильнейших кандидатов дало понять что шансы равны. Интересно наблюдать как там люди поделись на два общества (если конечно все прозрачно) . Интересно ваше мнение, если победит нынешний президент, он будет действовать по своей политике и дальше сотрудничать с кем и до? И если победит второй кандидат, то что значит для ближайший соседей такой поворот?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453154",
  "comments": [
    {
      "author": "ftopikit",
      "created_time": "May 18, 2023, 05:30:30 AM",
      "body": "Я считаю, что нынешний президент тоже моет изменить свою стратегию. Второй кандидат дал четко понять, с кем он уже дружить будет а кто будет не другом для их страны. Противостояние двух лидеров, говорит о разделении общество и о том, что у них есть своя позиция, именно у народа. кто бы не выиграл ни будут действовать в своих интересах, и если им будет выгодно с соседями ограничить общение это сделает любой.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koleusdat",
      "created_time": "May 18, 2023, 05:39:17 AM",
      "body": "Quote from: durop77 on May 18, 2023, 05:19:33 AMПрошел первый этап выборов в Турции. Как мы видим противостояние сильнейших кандидатов дало понять что шансы равны. Интересно наблюдать как там люди поделись на два общества (если конечно все прозрачно) . Интересно ваше мнение, если победит нынешний президент, он будет действовать по своей политике и дальше сотрудничать с кем и до? И если победит второй кандидат, то что значит для ближайший соседей такой поворот?Кто бы не выиграл, соседям будет непросто. Никто не хочет ни с кем делиться и быть лояльным к событиям у соседей. Второй этап может обернуться как угодно, но свои программы они уже выложили и думаю по их мнению там все уже понятно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 19, 2023, 10:01:30 AM",
      "body": "Я - человек дико заинтересованнай, т.к. вот уже примерно 15 лет назад купил квартиру в Турции, регулярно там бываю, общаюсь и тусуюсь.Но я хочу, чтобы победил Кемаль Кылычдероглу, потому что он против Путина. А Эрдоган - почти за. И это плохо. Надеюсь, что квартиру у меня не отожмут, в итоге. А все остальное можно решать даже дистанционно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ftopikit",
      "created_time": "May 25, 2023, 06:49:17 AM",
      "body": "Думаю каждый из них высказался о своей дальнейшей работе и о планах на соседей. Стоит открыть любую ссылку и будет понятно, кто будет дружить с соседними странами а кто побежит искать новых друзей. Скоро 28, поэтому будет ясно все.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}