{
  "id": "topic_5414548",
  "title": "ActivePrime",
  "author": "ActivePrime",
  "created_time": "September 22, 2022, 10:13:28 PM",
  "content": "Hello,I watched few tutorial to add currency to MetaMask and after ETH i am switching to other coins. I added 2 different coins on different networks. GOL is on Ethereum Mainnet and LOGOS on Binance smart chain (bep20).Both coins don't have the receiving option, i watched and everyone have receiving option by default when they add any coin but when I add coin I only have two options Send and Swap. Below, the link of the screenshot.https://www.dropbox.com/sh/g8m008oy8h2y9da/AADHFZoYNd2e1jEUnQqpSCZSa?dl=0NO ALTERNATIVE WALLETS FOR THESE COINS FOUND OTHER THAN METAMASK.Please Help me out!Best Regards,Aqib",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414548",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 23, 2022, 12:06:29 AM",
      "body": "I think you can add different chains to trustwallet too... Try out using the same settings and see if the receive button appears.Another question is, are other people able to send the token or perhaps its locked?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuda911",
      "created_time": "September 23, 2022, 08:26:36 AM",
      "body": "You trying to confuse me  , either Ethereum mainnet or BSC smart chain the address will be the same, how come they don't have receiving addresses? I've never heard about this problem before, what version of metamask are you using? Mobile or PC? Are you sure the wallet is up to date? Send the screenshot of your chain settings both BSC and ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 23, 2022, 05:29:15 PM",
      "body": "Look at your wallet address in the metamask. Send tokens to this addresshttps://latoken.com/exchange/USDT-GOLBuy some tokens on the exchange and make a withdrawal to your address, which will be the same for Ethereum and Binance (bep20).Smart contract addresses can be checked at coingecko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}