{
  "id": "topic_5447322",
  "title": "Hhampuz",
  "author": "Hhampuz",
  "created_time": "April 02, 2023, 08:44:06 PM",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447322",
  "comments": [
    {
      "author": "Hhampuz",
      "created_time": "April 02, 2023, 08:44:17 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hhampuz",
      "created_time": "April 02, 2023, 08:44:21 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "April 02, 2023, 08:47:08 PMLast edit: April 03, 2023, 12:07:30 PM by Gladitorcomeback",
      "body": "My First Review on Whirlwind Domain name: Most of the Mixer has included \"Mix\" in their domain to make it easy for new users to attract like Chipmixer, Yomix etc. I don't know the reason behind this domain but i think it would be much better if  The domain has also use Mix in thier website so that Domain name reflects its purpose easily for new users.Website Look:i am using Android Mobile and its quite friendly with mobile and there is no glitch or heavy loading while opening website. I like the first page of the whirlwind dashboard which directly showing the deposit option. One can easily understand how it works because all options(recieve address,service fee) are represented in very sample way. Deposit:There are two types of options for mixing your BTC.1) Fast( without any note)Fast Deposit is very sample and you have to just enter Btc Recieving address which is mandatory. adding multiple Recieving Btc address is new for me and there is option to adjust specific value of Btc (percentage) to any wallet for example 50% to first one and 25% to second and third wallet each. service fee will be increase with every wallet you add. One wallet service fee= 0.0001 BtcTwo wallet service fee= 0.0003 Btcthree wallet service fee= 0.0004 Btcthree wallet service fee= 0.0006 Btc and so onI deposited 0.00169 (49$) to check Whirlwind Mixing service and used Deposit fast. At first i intend to send Btc to two different wallet but after checking network fee i ignored and added only one Btc address. by default service fee was 1.5% but i adjusted to 1%. i kept Recieving hour by default which was 0 hours and it can be adjusted to 200 hours there i send btc address to given address . Website doesn't automatically refreshed to recieved message and after two minutes i manually refreshed and then i able to saw btc recieved Confirmed message. Note: before sending btc to given wallet first download the Guranatee later which will be proof for you if something wrong happen while mixing but don't share with someone because revealing this can eliminate your anonomity. Minimum deposit is 0.001 which is almost 28$ with current Btc rate (28k). i don't know what will happen if someone send less amount that minimum because Faq is not updated yet. I am Sharing Below Guarantee later just for information purpose:Quote<SIGNED MESSAGE>We have generated the deposit address bc1q23nftm5fg7xskwfv0dxnptzkecmqm28qqu8gu5 at Mon Apr 03 2023 10:26:19 GMT+0000 (Coordinated Universal Time) where the minimum deposit is 0.001. You can deposit from Mon Apr 03 2023 10:26:19 GMT+0000 (Coordinated Universal Time) until Tue Apr 04 2023 10:26:19 GMT+0000 (Coordinated Universal Time). Our fee is 1% and 0.00015 BTC per withdraw address. The withdraw address(es) are the following: 1 - bc1qamkfk7kcwwel9feuh2q06lwd8hq9l4q0cg0krm which will receive 100.00% of the deposit amount (- fee) 0 hours after deposit confirmation. ; This message was signed using the letter signing address which can be found on our website or at /verification/letter_signing_address on the system's API.</SIGNED MESSAGE><SIGNING ADDRESS>1JmCabMgyVZ8zmgaV5JGH7BXe48buVaUUd</SIGNING ADDRESS><SIGNATURE>IG2cPPwwNQIXfxktyrHThAxVtSjGJIZtk9lR7qVgwunZMpn9j23sUHLB3FVW+UoHw4o8pjcC98BroGNFw+QxdRc=</SIGNATURE>2) Deposit with NoteAt first I confused about Note deposit because there was no option for Recieving address but after research i got it. Deposit note is slow than first one and you have to adjust other optional setting and write mandatory Note which will be used while you withdraw. You should save your Note before sending BTC. after successful sending you can withdraw any time to any wallet with your note. for this you have to select Withdraw Note option available in website. Suggestions: 1: Website something showing white blank screen which should be solved. i don't know it just problem with me because i am using Android phone or with everyone but it should be solved for better experience. 2: Automatic refresh transaction not working with me which should be solved3: 24/7 Chat service is not available and I think it will be much better for fast support in case of any issue faced by mixers.4: Ethereum is most usable currency after BTC and it will better to add Ethereum mixing also.5: Faq and other button are not working in website which should be updated for better experience. i am waiting for payment and will update it laterspend almost 7$My Btc address : bc1qamkfk7kcwwel9feuh2q06lwd8hq9l4q0cg0krm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "April 02, 2023, 08:47:17 PM",
      "body": "Reserve",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "April 02, 2023, 09:03:48 PM",
      "body": "Reserve",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "April 02, 2023, 09:07:58 PMLast edit: April 03, 2023, 09:43:14 AM by John Abraham",
      "body": "There we go.This is my first ever mixer experience. I had never tried Mixers before because I did not understand how they worked. Moreover, I had a negative idea about the Mixer service. I heard that mixers ran away with coins. Since Whirlwind is here in this forum and is a reputed manager, escrows holding the funds, and I am a Campaign participant, I convinced myself to give it a try with a smart amount of Bitcoin. Here is how it goes.I tried the clearnet domain. The website popped up backend offline, Please try again later. When I refreshed the page, I saw a blank white page. Not sure if it's because of my internet or my browser. I tried a different browser and it's started working fine again. The Interface looks so good and straightforward. I believe anyone who uses Bitcoin or uses the internet will understand how it works. There are two types of deposits—fast and Note. Since I did not use mixers before, I don't know if the Note feature is new. But I will give it a try too. At first, I Choose the Fast Method. I adjusted the delay time to 1 Hour. At first, I didn't understand what was next to the Hour. It's showing 100% by default, and I can't adjust it. When I clicked Add Address, another form opened to fill in another Bitcoin address. Also, I can change the time for each address to get them to those wallets, which seems pretty good. I found a minor glitch there. When I click on Add Address, It Generates more Forms to fill. But I can delete all except the last one when I want to delete those forms. There is a button named Delete Address Next to the Add address button, but it's not clickable. (Can anyone from Whirlwind verify it?) See the image for reference (Buttom Red Boxed).Okay, To get rid of the glitch. I tried to refresh the page, and Becomes a blank white page again on another browser. I tried closing and opening the browser again, and it's the same. I tried VPN, and I got the Same result. Then I cleared my browser data, and finally, I could continue again. I went with a single address this time and adjusted the delay to one Hour. Choose 1% fee + 0.0001I Downloaded The guarantee letter and Deposited 0.005 BTC (Around $140)It didn't take long to appear the transaction once the transaction hit the Blockchain.Let's wait an hour, and I will update again.Let me try the Note Feature as well. It's easy as hell. Just Adjust the service fee, Generate the Withdraw Note and Copy it. You must be careful with storing your Withdraw note because losing this note means losing your funds. I tried with 0.003 BTC (Around $83) + fees this time.Okay, My deposit Got Confirmed, and now it's time to Withdraw Using the Withdraw Note.I don't have to write the process as it looks like the image below.I found another glitch here. I can't Click Add Address Button. It's not clickable. Also, I figured out I must write a unique address if I add another one. When you want to withdraw the funds, Write the amount substructing the withdrawal fee. Else, Withdraw button won't work. I have withdrawn the Note Funds. Let's see how long it takes as I choose a 1-hour delay. I will update this post again. Update: The First Transaction (Fast) landed in my wallet. But, The Strange thing is, It's been two hours (I chose one hour delay) I still did not get the 2nd Transaction (Note One). I cannot access the clearnet domain anymore. Tried multiple browsers so far.Update 2: Here is another update. I accessed the website using Tor. My \"Note withdraw\" Withdrawal didn't work even though the pop-up said withdraw sent. So I tried with my withdrawal Note again and found that the balance was still available. The possible reason is I used the same wallet address to receive my funds from where I sent them funds. The website said to Use Unique Wallet Address. This time I used a unique wallet that was never used before. Let's see how it goes. Update 3: The Funds landed in my wallet.Suggestion: I would ask the Whirlwind team to improve the clearnet website's user experience. Most of the time, it doesn't work properly. There are some glitches I mentioned in my post. Please review them and fix them. During the mixing process, I faced a couple of errors. I attached some screenshots below. Other than these two, I faced \"backend offline, Please try again later\" error and a Blank White Page.It seems like I paid around $17-18 as fees. xDbech32 BTC Address:  bc1q3652jcryqgy0l38unay7tx69h56a865z6t8ndx",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "April 02, 2023, 09:10:52 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "April 02, 2023, 09:10:56 PM",
      "body": "Review in progress... will be updated.bech32 address: bc1qjs846vvphyav6npn447tr50jk6eesrpark30d2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "April 02, 2023, 09:15:26 PMLast edit: November 15, 2023, 07:47:09 PM by Woodie",
      "body": "Will update review after testing the service outMY REVIEWBefore I jump into my review we need to understand by nature bitcoin is pseudonymous and not anonymous, and to protect our crypto footprints we can use mixers for BTC transactions to guarantee anonymity by breaking the link between our identity and our wallet.So to jump right into the action, at the time of trying whirlwind as of sunday evening on both clearnet and tor, it seems there were some maintenance works going on in the backend as I kept getting a \" Backend offline,  Please try again later \", and had to try this at a later time.and from the look of things seems like the Captcha service was down preventing me from proceeding...While I waited, looking at the cosmetic side of the website, the site is simple and clean for anybody to get around easily, and seeing some reference links of where to find them like here on the forum is a big plus which means you can easily track their reputation, service delivery and the alike.Eager to give whirlwind a test run, I tried service again on a Monday afternoon and everything was up and running and to continue my test run went ahead with the recommended way to use Whirlwind which was \"NOTE.\" one of the two deposit methods availableTHE \"NOTE\" EXPERIENCE I like the name behind \"note\" as this implies the note needs to written down somewhere and kept safe as this is what is needed to access the deposited funds, think of this as a gift card and you can only claim its funds using the generated code and is to be kept as a secret unless you sharing it with somebody else willingly.The process of the NOTE deposit was super easy to get around, simply adjust rates and remember to always adust this rate for better privacy to avoid predictability and most importantly keep the generated note SAFE until it's redeemed.After passing the captcha stage , and hitting the GO button, here I downloaded the guarantee letter and sent  about 70 dollars to the generated bitcoin address and all I had to do is wait for the  2 confirmations before I swept my mixed coins on the NOTE..and to complete my test on NOTE, I proceeded with claiming funds using the 55 character string I saved earlier on to sweep funds off this code and this process was easy as you only need to paste the generated code into the empty box and press enter and lastly paste your receiving btc addy and withdraw your coins, easy peasy.THE \"FAST\" EXPERIENCE This one is self-explanatory and was a breeze to use...Process involved with FAST deposit:Simply entered my BTC address to receive mixed coins Left my time at its default (0 hours) but advisable to adjust this  Split percentage was left at 100% as I only had one addy at the time Fee was set at its mimumum 0f 0.25  Solve the captcha which is always easy to solve though a refresh button will be appreciated lastly send coins on next page for mixing to begin Here we can see the deposit page isn't any different from the NOTE and once coins hit the given addy and confirmations are fulfilled, coins are sent to the addres that was given in the first page.MY TAKEAWAY NOTES- Good to see that whirlwind supports bench32 addresses- Fees are super low and can be set to ones liking. - Tor V3 that's a plus for anybody going the onion way.- Just out of curiosity I saw this \"Address valid for 24 hours after generation\" and in times when the network is clogged would one lose coins, or the NOTE is enough to guarantee you access your funds.- I had instances when the captcha wasn't clear for me, is it possible to have a captcha refresh button for the best user experience before waiting for auto refreash happens after a failed attempt ?bech32 BTC Address: bc1q6pm0afcphvqp594fgna8u63gza37qkrm3wvf0s",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babygun",
      "created_time": "April 02, 2023, 09:16:18 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "April 02, 2023, 09:17:22 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 02, 2023, 09:46:27 PMLast edit: April 03, 2023, 06:40:25 PM by SatoPrincess",
      "body": "My Review [Fast option]I accessed the onion version of the website using Tor, the page loaded smoothly. I really like the interface, it's very simple and clean. I also like that whirlwind took the initiative to list the steps and make the process as simple as possible for a newbie to understand. Step 1: Select Deposit Type The fast option seemed interesting so I decided to try that one and see how we do. Step 2: Insert receiving address and set delay time I tried using P2TR address as one of my receiving address but it was not valid.  The label was highlighted red to show there was an error.Then I tried my legacy address and segwit addresses, they were both valid (green). Honestly I would have preferred to use P2TR addresses for this, unfortunately I had to settle for a native segwit address. You have the option to spread your bitcoins across multiple addresses if you want. I provided only 1 Segwit addresses because I didn’t want to pay the costs for using multiple addresses. I set the delay time to 2 hours, and the mixing took exactly that long. Mempool was around 27.3 sat/vB at the time. Step 3: Choose service feeFor fast option, there is a fixed network fee of 0.0001btc, I set my service fee to the minimum which is 0.25%. I figured I wouldn’t be paying much sats. Step 4: Complete Captcha This is the last option on the first page. Supposed to be simple but I attempted the captcha twice before getting it right the third time. I would like if there was an option to reset the captcha myself so I don’t waste time with the captcha. All done. I clicked “Go” The next stage was straightforward. It had the same format, listing the required steps. I downloaded the guarantee letter, a feature which I think is really good especially if you’re going to send your mixed coins to an exchange. After that, all I had to do was send bitcoin to the address given. I scanned the barcode and sent 0.00011BTC. About two hours (which was my set delay limit) after my deposit, I received 0.00094725 BTC to my designated address. It seems the fees were a bit higher than I thought. I will have to do the calculation later. Even though I had received the bitcoins, the page didn’t update that transaction was completed even after refreshing the page.I asked previously on the official Ann thread of whirlwind keeps the logs of users and was informed of the Blind Certificates put in place but I don’t understand how that works. I’m curious to see what other members think of this.  My review bitcoin address : bc1quh4y8x8jyee8r5sx46lv3adawy8l3pz9c2kczc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hhampuz",
      "created_time": "April 02, 2023, 09:59:51 PM",
      "body": "Quote from: SamReomo on April 02, 2023, 09:55:11 PM~Did you try out the service? Looks more like you read the ANN thread and just reworded it a bit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minerjones",
      "created_time": "April 02, 2023, 10:02:33 PM",
      "body": "-----BEGIN PGP SIGNED MESSAGE-----Hash: SHA512April 2 2023 minerjones acting as escrow for the whirlwind.money review campaign-----BEGIN PGP SIGNATURE-----Version: Keybase OpenPGP v2.1.13Comment: https://keybase.io/cryptowsBcBAABCgAGBQJkKfwUAAoJEIRUCAKscQ+ODFIH/RWrJUJ584Spnk44dab1SNniXXRnXWfpucB1G+7KK+Qb6m1XSkiVkDW0oz5x8awg+LGPsBpc+vrEfrn43jrtAowV1NINPceMCVK9vyTs0AnOcJW0C/ratVqP9iurHvI6VHa3r6YGxt1x4Si6sflhuZRngvdu86DbnTD0CEr3WTo6BVE/Jw5mWt/LTGiGw2gY96gqyFuWUkVwX7SElQFQj/h+CGPCdn76HWRKtFBQ5tftnZM1LEAUlPXxoofywikT1cpbzF5l/pALPWCL0DkW+ORgcmn2IfC7aV7i3mPo4J/XEuXUtMoEEFgUy4WPB8mIuwMwsR8oucdB0vMEaPL6ibI==z0yb-----END PGP SIGNATURE-----",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "April 02, 2023, 10:08:38 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sujonali1819",
      "created_time": "April 02, 2023, 10:16:29 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "April 02, 2023, 10:30:38 PM",
      "body": "Quote from: SamReomo on April 02, 2023, 10:11:13 PMQuote from: Hhampuz on April 02, 2023, 09:59:51 PMQuote from: SamReomo on April 02, 2023, 09:55:11 PM~Did you try out the service? Looks more like you read the ANN thread and just reworded it a bit  Yes, I tried the site before writing the review. However, I couldn't mix bitcoins since I have recently converted most of them to altcoins. Nevertheless, I did my best in writing the review, and even if it is not selected, it is still okay. Thanks!That's not what this campaign is looking for. Your time was wasted, I can guarantee it 😂@Hhampuz, so how many members are going to be accepted or everyone is going to be paid as long as they are trying the service and writing review. I would like to know my efforts are not going to waste. What criteria determines to get $100. It seems if you send $5 then one need to agree that it was right amount.Thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "April 02, 2023, 10:30:55 PM",
      "body": "Quote from: SamReomo on April 02, 2023, 10:11:13 PMQuote from: Hhampuz on April 02, 2023, 09:59:51 PMQuote from: SamReomo on April 02, 2023, 09:55:11 PM~Did you try out the service? Looks more like you read the ANN thread and just reworded it a bit  Yes, I tried the site before writing the review. However, I couldn't mix bitcoins since I have recently converted most of them to altcoins. Nevertheless, I did my best in writing the review, and even if it is not selected, it is still okay. Thanks!If you have not mined bitcoins, you have not used the service. All you did in your review is that you described the services as presented by the Mixer, and you did not actually try them.There is no specific time for the end of the campaign, so you still have time to exchange some of your altcoins for bitcoins and try the service before publishing. I think it is permissible for you to modify your published post, and therefore you may not lose the effort you have made to write it. It's just that you were a little hasty. good luckI would like to ask Hhampuz when the campaign ends and how many are expected to accept their reviews. I don't expect all applicants will be accepted even registered before 2023.I also think that it is possible to know how much is the campaign budget pool or even publish the escrow address, since the participants will have to publish their addresses publicly, and therefore there is no point in hiding it. Thank You",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hhampuz",
      "created_time": "April 02, 2023, 10:33:47 PM",
      "body": "Quote from: BitcoinGirl.Club on April 02, 2023, 10:30:38 PM@Hhampuz, so how many members are going to be accepted or everyone is going to be paid as long as they are trying the service and writing review. I would like to know my efforts are not going to waste. What criteria determines to get $100. It seems if you send $5 then one need to agree that it was right amount.Thank you.Everyone who actually tries it out and tries to write a decent review will be given BTC. Just something basic like \"I sent btc with fast, I got btc and it was fast\" would get like $5-$10 but if you actually have some insights and write something good (and if you are \"known\" here on bitcointalk, like yourself) you'll likely get the $100.No limit as of now, may change depending on what kind of reviews we are seeing in the next few days!This reply goes to @coupable as well.Edit; Minerjones is currently holding ~$40k worth of DAI in escrow for this campaign. Please note that this escrow address will not be used for payments, it's basically just a safeguard so you can try out the service without having to worry that whirlwind would take your money and run. I've been told by whirlwind that if necessary and if requested they'd add more to it. @minerjones can confirm this when he's around, too.Payments for the reviews will be handled by me, from the signature campaign wallet (which I'm in control of). The reason why it's set up like this is that even though I could have escrowed the \"safeguard\" for this campaign I wanted someone from the outside, yet very trusted, to take on that role just for added legitimacy.Let me know if you have any other questions!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}