{
  "id": "topic_5467677",
  "title": "MCUKing",
  "author": "MCUKing",
  "created_time": "September 22, 2023, 07:04:45 AM",
  "content": "I was reading the latest Coindesk stories and this one was quite interesting from the historical price movement of Bitcoin. So the story says that the Bitcoin Price on Binance US dropped back in 2021 from $65.5k to $8k, almost a drop of 87% on Oct. 21, 2021. Initially, Binance reported that it was a technical bug in the order book algorithm of the institutional trading. The arbitrage traders took advantage of this opportunity. Back in time, I have a couple of questions about it.Those who booked profit on this opportunity were allowed to move funds (Withdrawals)In the same story on 20th September, this is what was reported.. According to the reports an EX-employee reported inside news that actually it was a fat finger act where by mistake the order was misplaced by the decimal point error. Sam Bankman-Fried's Alameda caused this drop. Obviously, Baradwaj said Alameda lost $millions.  A Second question did Alameda offer a refund?To follow more on the story you can have a look here",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467677",
  "comments": [
    {
      "author": "bayu7adi",
      "created_time": "September 22, 2023, 07:28:25 AM",
      "body": "It is indeed karma for Alameda for their actions alongside FTX a few years ago.https://www.cnbc.com/2022/11/15/how-sam-bankman-frieds-ftx-alameda-empire-vanished-overnight.htmlHistory has cast an unfavorable shadow over Alameda and FTX, where several cases often involved the prominent names, including the CEOs of both companies collaborating. Multiple Arbitration cases initiated by Alameda frequently ventured into legal territory, leading to Ellison and Wang, the CEOs of Alameda and FTX, losing public trust.Reportedly, they incurred losses of tens of millions of dollars due to the incidents outlined in this thread, but their fraudulent activities extended far beyond that. Alameda must face judgment and legal proceedings to restore the funds of investors that remain in their possession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 22, 2023, 07:40:31 AM",
      "body": "Binance US propblem is not a small matter; thats a huge drop. Now, I think the \"technical bug\" explanation is too easy. When you work as well as Binance does, these kinds of problems shouldnt happen. So, a former worker pointing to a \"fat finger act\" seems more likely. Big players like Alameda, which is run by Sam Bankman-Fried, could move the market by accident. How can a wrongly placed decimal point cause so much chaos? As fragile as it sounds, it really isIn answer to your questions:- Whether those who made money were able to move their money. The real litmus test would have been this. When mistakes lead to a lot of money being made, exchanges often stop payments. If they were allowed, that raises even more suspicions.- Did Alameda return the money? Given how big the mistake is said to be and how well-known Alameda is, they should have. But honestly, since they have been shut down, I really do not know",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 22, 2023, 07:46:45 AM",
      "body": "the pump of 2021's ATH was always a premium and would always have followed by a correction back down to meaningful valuein 2021-22 it did not correct down to $8k. in 2021 it declined to $50k.. then by late 2022 it corrected to $15k. a new raised bottom compared to 2009-2020 bottomsthe reasons for the late 2022 $15k were not fat fingers of FTX. but the whole market community sentiment fear of bad news and FUD.but this amount of sentiment gave a good test for the new bottom which shows where real value now lays compared to old numbers of 2009-2020",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 22, 2023, 08:05:39 AM",
      "body": "I have seen such errors about 3 times, and I remember that such extreme trading values occurred for several seconds, and you will find a few who benefited from them, as I remember a story of a person who bought Bitcoin at a price of 2000 dollars while its price was far from that. Such events do not cause losses. It is a big deal for the platform, which is easy to compensate for, or it could be an opportunity for some to evade paying a tax, but it is a rare occurrence and does not occur in a manner that would cause huge losses to the platform or lead to them being accused of tampering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 22, 2023, 08:23:24 AM",
      "body": "Quote from: Blitzboy on September 22, 2023, 07:40:31 AMIn answer to your questions:- Whether those who made money were able to move their money. The real litmus test would have been this. When mistakes lead to a lot of money being made, exchanges often stop payments. If they were allowed, that raises even more suspicions.So in the other sense what dear you are trying to say is if the people who made a lot of money from this incident were allowed to move the money it could be directly or indirectly the platforms involved, from inside this manipulation is carried out.Quote from: Husires on September 22, 2023, 08:05:39 AMI have seen such errors about 3 times, and I remember that such extreme trading values occurred for several seconds.Hmm dear can you mention those events I'm just familiar with this Binance US and OKX event which was not very attractive but in the stocks such incidents are widely reported. In the crypto market space, I would really like to know about the others if they are really demanding.Quote from: franky1 on September 22, 2023, 07:46:45 AM__SNIP__Dear, I think Op is indicating something else, that is not about the ATH and ATL or correction, Op is indicating a particular event that happened back in the ending months of 2021 on the Biannce US specifically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 22, 2023, 10:58:13 AMLast edit: September 22, 2023, 11:33:12 AM by franky1",
      "body": "Quote from: Hamza2424 on September 22, 2023, 08:23:24 AMDear, I think Op is indicating something else, that is not about the ATH and ATL or correction, Op is indicating a particular event that happened back in the ending months of 2021 on the Biannce US specifically.anomalies of a specific exchange are not sentiments of \"bitcoin\" as a whole. and such temporary glitches are not about \"bitcoin\" but exchange traded database units.. in which case when events happen, exchanges involved then halt any withdrawals whilst they sort out the bug, account the balances/errorbinance also had a glitch that seen a $138k in june this year but no one talks about \"bitcoin reaching new high\"many exchanges glitch.. so its become non-news. and does not impact \"bitcoin prices\" as a wholein short \"bitcoins price\" did not sink to $8k. just a exchange had an anomaly that no one cares about. and yes these anomalies do happen but are of no importance to the grand scheme of things. also the very short length of time of this event means not many traders were involved to take advantage. i do find it weird that someone is posting in 2023 about a non news event of 2021i knew its related to revelations of FTX in media.. but the way media and even this topic write about it, is as if FTX all by itself caused the whole of bitcoin to drop to $8k. when in reality the low of october 2021 was 60k not 8k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "September 22, 2023, 02:22:51 PM",
      "body": "Binance US. is a branch of Binance and is smaller than Binance in trading volume so some artificial manipulations can be done. Exchanges do those manipulations a lot to kill their users who use leverages.Price can recover quickly after liquidation kills but it can be part of a long correction. And you talk about Long squeeze, you must talk about short squeeze too but it is more related to exchanges with big trading volume. Sometimes you will see news that Bitcoin pumps to $200k or $500k else where and of course it is on unpopular exchange with small trading volume.The Bitcoin Crash of 2021 Compared to Past Sell-Offs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 22, 2023, 03:47:31 PM",
      "body": "Quote from: Hamza2424 on September 22, 2023, 08:23:24 AMSo in the other sense what dear you are trying to say is if the people who made a lot of money from this incident were allowed to move the money it could be directly or indirectly the platforms involved, from inside this manipulation is carried out.Crypto market is not regulated. This is why sometimes you can see market makers pumping or dumping altcoin prices in order to gather liquidity from traders and manipulate the price. Everyone knows the way it works and it would be illegal on a stock market but here it is fine and no one cares. Same with the BTC drop.Quote from: franky1 on September 22, 2023, 10:58:13 AMQuote from: Hamza2424 on September 22, 2023, 08:23:24 AMDear, I think Op is indicating something else, that is not about the ATH and ATL or correction, Op is indicating a particular event that happened back in the ending months of 2021 on the Biannce US specifically.anomalies of a specific exchange are not sentiments of \"bitcoin\" as a whole. and such temporary glitches are not about \"bitcoin\" but exchange traded database units.. in which case when events happen, exchanges involved then halt any withdrawals whilst they sort out the bug, account the balances/errorbinance also had a glitch that seen a $138k in june this year but no one talks about \"bitcoin reaching new high\"many exchanges glitch.. so its become non-news. and does not impact \"bitcoin prices\" as a wholein short \"bitcoins price\" did not sink to $8k. just a exchange had an anomaly that no one cares about. and yes these anomalies do happen but are of no importance to the grand scheme of things. also the very short length of time of this event means not many traders were involved to take advantage. i do find it weird that someone is posting in 2023 about a non news event of 2021i knew its related to revelations of FTX in media.. but the way media and even this topic write about it, is as if FTX all by itself caused the whole of bitcoin to drop to $8k. when in reality the low of october 2021 was 60k not 8kA large volume of orders was actually broadcasted to the market. This is not about the exchange. If you make an order with a volume which is high enough to cover all limit orders at once then the price will drop accordingly just in a second. This is what can happen in any exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 22, 2023, 04:06:39 PM",
      "body": "Quote from: franky1 on September 22, 2023, 10:58:13 AMbinance also had a glitch that seen a $138k in june this year but no one talks about \"bitcoin reaching new high\"I haven't heard of it well, as the whole market really doesn't had any weightage.Quote from: franky1 on September 22, 2023, 10:58:13 AMmany exchanges glitch.. so its become non-news. and does not impact \"bitcoin prices\" as a wholeYes, I do consider it, but here in this particular topic Op is clear with the context from the title it may seem misleading but in the content, it's clearly mentioned.Quote from: franky1 on September 22, 2023, 10:58:13 AMin short \"bitcoins price\" did not sink to $8k. just a exchange had an anomaly that no one cares about. and yes these anomalies do happen but are of no importance to the grand scheme of things. also the very short length of time of this event means not many traders were involved to take advantage. i do find it weird that someone is posting in 2023 about a non news event of 2021Hmm, even if there were not many traders involved still those who were made bundles of profit. For the point why Op is posting this now I think it can only be answered by the OP but still, I think its due to the latest development on the leaking of some internal information by an ex employee.Quote from: Beerwizzard on September 22, 2023, 03:47:31 PMQuote from: Hamza2424 on September 22, 2023, 08:23:24 AMSo in the other sense what dear you are trying to say is if the people who made a lot of money from this incident were allowed to move the money it could be directly or indirectly the platforms involved, from inside this manipulation is carried out.Crypto market is not regulated. This is why sometimes you can see market makers pumping or dumping altcoin prices in order to gather liquidity from traders and manipulate the price. Everyone knows the way it works and it would be illegal on a stock market but here it is fine and no one cares. Same with the BTC drop.So you want the crypto market to be regulated only for stability (Really I cant understand), Bitcoin's Volatility is its beauty it would be a dumb decision to make Bitcoin stable. I do consider that there is market manipulation what you really think is it never happens in the stocks even more widely it's reported with the stocks that stocks are malted. In every open market manipulation does come in handy but it on your responsibility to save your funds with your decision-making.Dear, the Bitcoin regulation may decrease the volatility but it can never be eliminated. I also support that volatility should never be eliminated. (Why I'm so general because buddy you were quite general so I'm responding in a informal, friendly way.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 22, 2023, 04:51:14 PM",
      "body": "Unlike this one, other cases similar to it are always a bug in the platform. For example I believe it was Coinbase a couple of years ago in 2017 where Ethereum buy order book was wiped clean and some orders are extremely low prices were filled. Later they reversed all those orders and ended the celebration of those few.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "September 22, 2023, 04:58:32 PM",
      "body": "Quote from: MCUKing on September 22, 2023, 07:04:45 AMThose who booked profit on this opportunity were allowed to move funds (Withdrawals)Typically, the exchange has the right to replay all the trades that involves bug with their service. There’s no way they will allow withdrawals from users that benefit on it unless they didn’t close the withdrawal immediately right after the bug occur. Nevertheless, an incident like this that involves bug usually refund everything since this is centralized service which they have control to all user funds inside the exchange. A fat finger or not, this is still considered as error from their big client which means there’s no way they will let them lose on this mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "September 22, 2023, 05:51:31 PM",
      "body": "Quote from: MCUKing on September 22, 2023, 07:04:45 AMAccording to the reports an EX-employee reported inside news that actually it was a fat finger act where by mistake the order was misplaced by the decimal point error. Sam Bankman-Fried's Alameda caused this drop. Obviously, Baradwaj said Alameda lost $millions.  A Second question did Alameda offer a refund?To follow more on the story you can have a look here I mean, why shouldn’t they?It was an honest mistake and was followed by honest trades by several traders who have spent time on the market looking for opportunities and this one opened up for them so legally, traders who took opportunity of this drop did no flaws. I can’t say for sure but, based on the quote below, QuoteBut because it had been an honest mistake, there wasn't much to do except to implement additional sanity checks for manual trades,” Baradwaj added.It’s seems all was in agreement for them to have their withdrawals in peace as should be the case. What seemed to have been done is an improvement on the means of placing orders in the market. Thanks yo there honest mistakes, mistakes such as that would be uncommon. A prices mistake indeed but, it’s the cryptospace and such a had thing for the organization to deal with but, they’ll deal with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 22, 2023, 08:31:42 PM",
      "body": "Quote from: MCUKing on September 22, 2023, 07:04:45 AMI was reading the latest Coindesk stories and this one was quite interesting from the historical price movement of Bitcoin. So the story says that the Bitcoin Price on Binance US dropped back in 2021 from $65.5k to $8k, almost a drop of 87% on Oct. 21, 2021. Initially, Binance reported that it was a technical bug in the order book algorithm of the institutional trading. The arbitrage traders took advantage of this opportunity. Back in time, I have a couple of questions about it.Those who booked profit on this opportunity were allowed to move funds (Withdrawals)A Second question did Alameda offer a refund?I suppose it was an opportunity for many whales to become really rich, even richer than they had been before. So, if we take a look at all the fluctuations of BTC price, which took place during these years, we can figure out that the price drop was carried out by people who knew what BTC would be like in a couple of years. So they somehow managed to dump cryptocurrency prices, and then bought crypto when the price was low...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "September 23, 2023, 12:05:13 AM",
      "body": "Quote from: pooya87 on September 22, 2023, 04:51:14 PMUnlike this one, other cases similar to it are always a bug in the platform. For example I believe it was Coinbase a couple of years ago in 2017 where Ethereum buy order book was wiped clean and some orders are extremely low prices were filled. Later they reversed all those orders and ended the celebration of those few. Is it GDAX exchange, not Coinbase?Ethereum briefly crashed from $319 to 10 cents in seconds on one exchange after ‘multimillion dollar’ tradeIt used to be Coinbase exchange, rebranded to GDAX, and rebranded again to Coinbase Pro. [1][1] https://www.investopedia.com/terms/g/gdax.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 23, 2023, 04:34:39 AM",
      "body": "We all knew it was Alameda because CZ tweeted somewhere along the lines “someone who recently launched a new exchange, had a bug in there code”. And if you were around that time you would of known that Ftx was launched maybe a couple of weeks prior. So it’s nothing new and we knew it was Ftx or their market maker.Didn’t think they sold tens of millions of dollars on that mistake. Probably the start to their skimming customer funds to pay for bad trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}