{
  "id": "topic_5452414",
  "title": "Wapfika",
  "author": "Wapfika",
  "created_time": "May 11, 2023, 05:54:18 PMLast edit: May 12, 2023, 02:50:06 AM by Wapfika",
  "content": "Siguro naman halos lahat tayo dito ay aware sa bagong trend sa Bitcoin Blockchain network. Maari na kasi gumawa ng NFT sa Bitcoin Blockchain dahil sa Ordinal. Wala pa akong nakikitang topic tungkol dito sa board natin kaya nais ko lang magshare kung paano gumawa ng sariling NFT sa Bitcoin Ordinal.Bago ang lahat ano nga ba ang Ordinal?Ang ordinal ay ang mga serial number na inimprinted sa isang satoshi (1sat) na pinakamababang unit ng Bitcoin. Dahil ordinal ay maari ng mtrack ang bawat isang satoshi dahil sa serial number na naka assign dito at pwede na din mag attach ng mga files kagaya ng mga pictures na karaniwang ginagamit sa NFT.Maaring halimbawa dito ay ang mga barya natin o 1 peso coin. Walang mga serial number ang mga ito sa ngayon kaya hindi malalaman kung ang hawak mong barya ay pareho o iba na kapag nagcirculate na ito. Ngayon, Imagine nyo na mayroong nag assign sa bawat baryang ito ng serial number. Ito ang ang nangyayari ngayon sa Bitcoin dahil sa Ordinal implementation. May mga serial number na ang bawat isang sat at maari ng madetect kung saan napunta ang dati mong Bitcoin example serial number 07 coins kung sakali man na ipinasa mo ito sa iba. Maari mo itong mabawi kung sakali man na mahanap mo ang owner ng address na kasalukayang may hawak ng coin mo.Ang pinakaunang satoshi ay may serial number na 1 at ang pinakahuling satoshi ay may serial number na 4,999,999,999. Maari nyong itrack ang Ordinals data sa explorer na ginawa ni @ddmrddmr https://dune.com/ddmrddmr/ordinals-dataAno ang Inscriptions?Ito ay ang proseso ng paglalagay ng assets sa sats or yung mga image para maging NFT gamit ang Ordinal protocol na naka depende sa Bitcoin core para sa pag manage ng private key at pagsign ng transaction. Ang kaibahan ng NFT sa ordinal sa normal na NFT ay direkta ito sa blockchain kumpara sa karaniwang NFT na gumagamit ng side chain or ibang token kagaya ng ERC721 para sa ERC20 token. Paano nga ba gumawa ng Bitcoin NFT?May dalawang paraan para gumawa ng Bitcoin NFT ito ay ang paggamit ng Sparrow Wallet at Ord Wallet.Setup guide ng Sparrow Wallet: https://docs.ordinals.com/guides/collecting/sparrow-wallet.html (Ginagamit lamang ito sa pagreceive ng Ordinals dahil may risk na mawalan ka ng control sa Ordinal mo kapag nagkamali ka)Setup guide ng Ord Wallet:  https://docs.ordinals.com/guides/inscriptions.html (Ito ang pina officialna paraan na paggawa ng Ordinal pero kailangan mo na idownload ang Bitcoin core data na sobrang laki)Pagkatapos nyo magsetup ng wallet ay parang normal NFT process nalang ito na kailangan nyong magattach ng files na gusto nyo ilagay sa sats nyo then set transaction fee at hintayin lang mamint yung Ordinal token nyo. Take note lang na sa Bitcoin Ordinals ay sa pamamagitan ng pagsend ng transaction lng nakakagawa ng NFT dahil nilalagyan lang naman ng files yung tokens naisesend or serial number.Maari nyong makita ang ginawa nyong Ordinal sa OrdinalViewer.Saan pwede bumili at magbenta ng Ordinal?Madami ng mga marketplace na available sa internet pero sa palagay ko ay ang https://ordinals.market/ at https://magiceden.io/ordinals. Trade at your own risk syempreMga reference na ginamit ko:https://cointelegraph.com/news/how-to-create-and-sell-bitcoin-nftshttps://www.reddit.com/r/BitcoinBeginners/comments/11ptlza/can_somebody_eli5_ordinals_to_me_i_dont_get_it/https://dune.com/ddmrddmr/ordinals-datahttps://docs.ordinals.com/guides/collecting/sparrow-wallet.htmlhttps://docs.ordinals.com/guides/inscriptions.htmlhttps://ordinals.market/collection-rankingshttps://ordinalsviewer.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452414",
  "comments": [
    {
      "author": "bhadz",
      "created_time": "May 11, 2023, 09:15:00 PM",
      "body": "Salamat sa pag share kabayan. Hindi naman pala ganun kataas ang demand sa market ng ordinals pero ang taas ng fee. Parang sinabay lang sa pag attack ng market itong Ordinals/Bitcoin NFT para lang sa kung ano man ang agenda nila. Kasi tinitignan ko itong ordinals market at 2.5BTC lang ang volume ng pinakamataas o top 1 na NFT which is ang Bitcoin punks. Top 1-4 lang ang may mga volume tapos yung karamihan puro zero na. Bumagsak din yung top 1 sa volume nila kaya siguro nakikita natin sa mempool na parang bumaba na din ang priority fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "May 11, 2023, 10:14:32 PM",
      "body": "Quote from: bhadz on May 11, 2023, 09:15:00 PMSalamat sa pag share kabayan. Hindi naman pala ganun kataas ang demand sa market ng ordinals pero ang taas ng fee. Parang sinabay lang sa pag attack ng market itong Ordinals/Bitcoin NFT para lang sa kung ano man ang agenda nila. Kasi tinitignan ko itong ordinals market at 2.5BTC lang ang volume ng pinakamataas o top 1 na NFT which is ang Bitcoin punks. Top 1-4 lang ang may mga volume tapos yung karamihan puro zero na. Bumagsak din yung top 1 sa volume nila kaya siguro nakikita natin sa mempool na parang bumaba na din ang priority fee.Kung susuriin mo mabuti kung ano talaga ang Ordinals malalaman na hindi yung demand sa NFT ang nakakapag pataas ng fee kundi yung paggawa mismo ng NFT dahil 1sat per Ordinal plus transaction fee lng ang kailangan para makapag mint ng sarili mo na NFT.  Ganito din kasi dati ang nangyari nung bagong introduce lang ang NFT sa ETH(cryptokitties). Madami ang gusto mauna kahit wala pang demand kaya lumobo ang fees dahil mismo sa mga nagmimint.Maganda ang paliwanag ni OP para maunawaan agad ang Ordinals. Kahit ako ay walang ideya dati dito dahil sobrang technical at gambling lang naman ang ginagawa ko dito sa forum. Parang ayos din subukan kung bababa ang transaction fee.Ito ang hindi ko magets ngayon sa Ordinals. Pano mo malalaman kung ano ang masesend mo na NFT kung sakaling madami ka ng Ordinals sa wallet. Parang normal Sats lang din naman sila pagdating sa wallet. Kita ba yung serial kapag isesend mo na sila sa iba?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "May 11, 2023, 11:36:42 PM",
      "body": "Quote from: dimonstration on May 11, 2023, 10:14:32 PMQuote from: bhadz on May 11, 2023, 09:15:00 PMSalamat sa pag share kabayan. Hindi naman pala ganun kataas ang demand sa market ng ordinals pero ang taas ng fee. Parang sinabay lang sa pag attack ng market itong Ordinals/Bitcoin NFT para lang sa kung ano man ang agenda nila. Kasi tinitignan ko itong ordinals market at 2.5BTC lang ang volume ng pinakamataas o top 1 na NFT which is ang Bitcoin punks. Top 1-4 lang ang may mga volume tapos yung karamihan puro zero na. Bumagsak din yung top 1 sa volume nila kaya siguro nakikita natin sa mempool na parang bumaba na din ang priority fee.Kung susuriin mo mabuti kung ano talaga ang Ordinals malalaman na hindi yung demand sa NFT ang nakakapag pataas ng fee kundi yung paggawa mismo ng NFT dahil 1sat per Ordinal plus transaction fee lng ang kailangan para makapag mint ng sarili mo na NFT.  Ganito din kasi dati ang nangyari nung bagong introduce lang ang NFT sa ETH(cryptokitties). Madami ang gusto mauna kahit wala pang demand kaya lumobo ang fees dahil mismo sa mga nagmimint.Maganda ang paliwanag ni OP para maunawaan agad ang Ordinals. Kahit ako ay walang ideya dati dito dahil sobrang technical at gambling lang naman ang ginagawa ko dito sa forum. Parang ayos din subukan kung bababa ang transaction fee.Ito ang hindi ko magets ngayon sa Ordinals. Pano mo malalaman kung ano ang masesend mo na NFT kung sakaling madami ka ng Ordinals sa wallet. Parang normal Sats lang din naman sila pagdating sa wallet. Kita ba yung serial kapag isesend mo na sila sa iba?Kapag ina-analyze ko parang kumplikado pa rin siya sa akin. Sabagay bago palang din siya para sa akin at nagsisimula palang din naman ito halos. Kung merong mga gustong mag mint, mababa lang pala ang need kaso parang ang pinakakailangan dito ay ang pagiging creative. Kasi sa nakikita ko wala naman talaga siyang pinagkaiba sa concept ng NFTs, ang pinagkaiba lang ay yung network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "May 11, 2023, 11:47:16 PM",
      "body": "Quote from: bhadz on May 11, 2023, 09:15:00 PMSalamat sa pag share kabayan. Hindi naman pala ganun kataas ang demand sa market ng ordinals pero ang taas ng fee. Parang sinabay lang sa pag attack ng market itong Ordinals/Bitcoin NFT para lang sa kung ano man ang agenda nila. Kasi tinitignan ko itong ordinals market at 2.5BTC lang ang volume ng pinakamataas o top 1 na NFT which is ang Bitcoin punks. Top 1-4 lang ang may mga volume tapos yung karamihan puro zero na. Bumagsak din yung top 1 sa volume nila kaya siguro nakikita natin sa mempool na parang bumaba na din ang priority fee.meron demand yan https://magiceden.io/ordinals hindi kasi kilala yung binigay ni OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "May 12, 2023, 03:00:57 AM",
      "body": "Quote from: malcovi2 on May 11, 2023, 11:47:16 PMQuote from: bhadz on May 11, 2023, 09:15:00 PMSalamat sa pag share kabayan. Hindi naman pala ganun kataas ang demand sa market ng ordinals pero ang taas ng fee. Parang sinabay lang sa pag attack ng market itong Ordinals/Bitcoin NFT para lang sa kung ano man ang agenda nila. Kasi tinitignan ko itong ordinals market at 2.5BTC lang ang volume ng pinakamataas o top 1 na NFT which is ang Bitcoin punks. Top 1-4 lang ang may mga volume tapos yung karamihan puro zero na. Bumagsak din yung top 1 sa volume nila kaya siguro nakikita natin sa mempool na parang bumaba na din ang priority fee.meron demand yan https://magiceden.io/ordinals hindi kasi kilala yung binigay ni OP.Salamat dito. Hindi ko kabisado mga market ng ordinal kaya recommended ko lang yung alam ako para maiwasan ang pagpromote ng scam services. Updated ko na ang OP para maidagdag ito at kung meron ka pang alam ay ipost mo lng dito para mashare natin sa iba.Quote from: bhadz on May 11, 2023, 11:36:42 PMKapag ina-analyze ko parang kumplikado pa rin siya sa akin. Sabagay bago palang din siya para sa akin at nagsisimula palang din naman ito halos. Kung merong mga gustong mag mint, mababa lang pala ang need kaso parang ang pinakakailangan dito ay ang pagiging creative. Kasi sa nakikita ko wala naman talaga siyang pinagkaiba sa concept ng NFTs, ang pinagkaiba lang ay yung network.  Ang kumplekado lang dito ay yung pagsetup ng Bitcoin core at Ord wallet pero may step by step guide naman nasa link kaya oks nmn yun. Need lang talaga ng space para Bitcoin core idodownload mo lahat ng blocks para maging updated. Hindi kasi yung gumagana ng partial blocks lang. May lalabas pa na wallet jan na mas user friendly. Hintay hintay lang tayo. Quote from: dimonstration on May 11, 2023, 10:14:32 PMIto ang hindi ko magets ngayon sa Ordinals. Pano mo malalaman kung ano ang masesend mo na NFT kung sakaling madami ka ng Ordinals sa wallet. Parang normal Sats lang din naman sila pagdating sa wallet. Kita ba yung serial kapag isesend mo na sila sa iba?First come in first out ang protocol ng Ordinals pagdating sa sorting ng Ordinals. Halimbawa una mo natanggap si Ordinal #7 sunod si Ordinal #44, kapag magsesend ka ng Ordinal sa iba ay Ordinal #7 ang una mo masesend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "May 12, 2023, 07:45:42 PM",
      "body": "Quote from: malcovi2 on May 11, 2023, 11:47:16 PMQuote from: bhadz on May 11, 2023, 09:15:00 PMSalamat sa pag share kabayan. Hindi naman pala ganun kataas ang demand sa market ng ordinals pero ang taas ng fee. Parang sinabay lang sa pag attack ng market itong Ordinals/Bitcoin NFT para lang sa kung ano man ang agenda nila. Kasi tinitignan ko itong ordinals market at 2.5BTC lang ang volume ng pinakamataas o top 1 na NFT which is ang Bitcoin punks. Top 1-4 lang ang may mga volume tapos yung karamihan puro zero na. Bumagsak din yung top 1 sa volume nila kaya siguro nakikita natin sa mempool na parang bumaba na din ang priority fee.meron demand yan https://magiceden.io/ordinals hindi kasi kilala yung binigay ni OP.Salamat, mukhang mas malaki laki nga demand sa market na yan. Tinitignan ko yung floor price ng mga on sale, grabe ang mamahal. Quote from: Wapfika on May 12, 2023, 03:00:57 AMQuote from: bhadz on May 11, 2023, 11:36:42 PMKapag ina-analyze ko parang kumplikado pa rin siya sa akin. Sabagay bago palang din siya para sa akin at nagsisimula palang din naman ito halos. Kung merong mga gustong mag mint, mababa lang pala ang need kaso parang ang pinakakailangan dito ay ang pagiging creative. Kasi sa nakikita ko wala naman talaga siyang pinagkaiba sa concept ng NFTs, ang pinagkaiba lang ay yung network.  Ang kumplekado lang dito ay yung pagsetup ng Bitcoin core at Ord wallet pero may step by step guide naman nasa link kaya oks nmn yun. Need lang talaga ng space para Bitcoin core idodownload mo lahat ng blocks para maging updated. Hindi kasi yung gumagana ng partial blocks lang. May lalabas pa na wallet jan na mas user friendly. Hintay hintay lang tayo. Masyadong malaking space needed kapag kailangan idownload buong network gamit bitcoin core. Pero meron na kaya dito sa forum na kababayan natin na nakapag mint at nakapagbenta na din? Interesting yung pricing niya pero alam ko hindi ganun kadali magbenta kapag hindi kilala ang minint mo at nagtry ka lang pero malay natin, di ba?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "May 13, 2023, 07:58:35 AM",
      "body": "-  Unang-una sabihin na nating nakapagbigay si OP ng klarong paliwanag tungkol sa ordinal na ito. Pero hindi parin maipagkakaila na nakapagdulot ito ng hindi maganda sa bitcoin community at ito ang totoong ngyari na kung saan nga ay naapektuhan ang fees sa bawat transaction sa bitcoin. Kaya pano natin masasabi na maganda ito talaga ito kung sa simula palang ay hindi na naging maganda ang epekto nito. Parang ang ngyari tuloy sa mga sitwasyon na ito ay yung matataas na fees na binawas sa mga bitcoin holders na nagsagawa ng transaction ay ang lubos na nakinabang talaga ay ang mga bitcoin miners sa aking nakita at naobserbahan. Saka hindi ako Fan ng NFT din, kamahal-mahal pag ibebenta tapos digital pa, di-bale sanang ibenta ng mahal kung merong titulo na kasama eh wala naman. Basta yung lang masasabi ko, wala pa ang ordinal na ito ay tahimik naman tayong mga bitcoin holders at walang problema, tapos bubulabugin lang at muntik pang sirain ang magandang nasimulan ng bitcoin sa industry na ito sa aking opinyon lang naman. Kaya para sa akin siraulo ang may pakana ng ordinals na iyan, pasensya na sa term na ginamit ko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "May 13, 2023, 04:44:38 PM",
      "body": "Quote from: Mr. Magkaisa on May 13, 2023, 07:58:35 AM     -  Unang-una sabihin na nating nakapagbigay si OP ng klarong paliwanag tungkol sa ordinal na ito. Pero hindi parin maipagkakaila na nakapagdulot ito ng hindi maganda sa bitcoin community at ito ang totoong ngyari na kung saan nga ay naapektuhan ang fees sa bawat transaction sa bitcoin. Kaya pano natin masasabi na maganda ito talaga ito kung sa simula palang ay hindi na naging maganda ang epekto nito. Sobrang disaster talaga nitong Ordinal dahil nabuha nanaman ang scalability issue ng Bitcoin na akala ng lahat ay tapos na dahil madami ng blockchain competitors. Pero ng dahil sa taproot ay naimplement itong Ordinals na naging way para ma attack nnaman ang Bitcoin sa weak spot nya which is scalability. Sa tingin ko ay mas naging vulnerable ang Bitcoin sa mga attack dahil dito since npakadali iispam ng network ng dust transaction sa panahong mababa ang fees. Medyo mababa ang fees ngayon dahil weekends pero mukhang hindi pa dn babalik sa normal dahil nasa 290K unconfirmed transaction pa din kahit na weekends.Quote from: Mr. Magkaisa on May 13, 2023, 07:58:35 AMParang ang ngyari tuloy sa mga sitwasyon na ito ay yung matataas na fees na binawas sa mga bitcoin holders na nagsagawa ng transaction ay ang lubos na nakinabang talaga ay ang mga bitcoin miners sa aking nakita at naobserbahan. Saka hindi ako Fan ng NFT din, kamahal-mahal pag ibebenta tapos digital pa, di-bale sanang ibenta ng mahal kung merong titulo na kasama eh wala naman. Basta yung lang masasabi ko, wala pa ang ordinal na ito ay tahimik naman tayong mga bitcoin holders at walang problema, tapos bubulabugin lang at muntik pang sirain ang magandang nasimulan ng bitcoin sa industry na ito sa aking opinyon lang naman. Kaya para sa akin siraulo ang may pakana ng ordinals na iyan, pasensya na sa term na ginamit ko. Agreed. Sobrang wala naman talagang kwenta ang NFT dahil yung iba ay doodle lang at random sketches na kayang gawin ng anak ko. Yung hype at price manipulation lang ang nagpapataas ng value nito lalo na kapag pinasok na ito ng sindikato na nagmamanipulate ng price para makapag launder. Biruin mo may NFT dati na million dollar ang halaga kahit na zero value talaga ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "May 20, 2023, 09:27:21 AM",
      "body": "Quote from: Eternad on May 13, 2023, 04:44:38 PMAgreed. Sobrang wala naman talagang kwenta ang NFT dahil yung iba ay doodle lang at random sketches na kayang gawin ng anak ko. Yung hype at price manipulation lang ang nagpapataas ng value nito lalo na kapag pinasok na ito ng sindikato na nagmamanipulate ng price para makapag launder. Biruin mo may NFT dati na million dollar ang halaga kahit na zero value talaga ito. Meron kasi talagang mga tao na amazed sa mga ganyan at sila nagbibigay ng value sa mga NFT na yan. Parang paintings lang yan, meron talagang mga tao na para sa collectibles ng mga yan at meron namang hindi at walang pakialam tulad natin. Ako naman naging interested lang ako sa NFT na yan magmula sa Axie kasi nakita ko daming kumikita hanggang sa medyo napalaki invests hanggang sa nagkaroon ng mga scholar na natulungan tapos ako na ang naiwan sa ere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}