{
  "id": "topic_5470160",
  "title": "God Of Thunder",
  "author": "God Of Thunder",
  "created_time": "October 13, 2023, 08:18:09 AM",
  "content": "I don't know if it is right to share personal things here. Yesterday, I completed seven years of marriage. And on our wedding anniversary, I went for a bike ride with my family today. On the way back home, the bike fell on a broken part of a culvert, causing the bike to jolt and my wife and my 2-year-old baby to fall off the back of the bike onto the road. The bike was at a speed of 60+, and many parts of their body were injured. My 2-year-old daughter is in a lot of pain. The skin is torn in many parts of the body. I was able to control the bike, and I did not fall off it. Now I ‍am thinking about why I didn't fall, even if they didn't get hurt; I don't know how much people can bear such a smeared body in front of their eyes and the crying of the wife and child. But I can't take it. I feel very guilty. I could have ridden slower; maybe it wouldn't have happened. Again and again, it seems that God could have given me these injuries and kept them well. I am a kinda religious person which is why I believe people's prayers work! All I am looking for is your prayer for my family. Keep my family in your prayers, please.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470160",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "October 13, 2023, 08:38:04 AM",
      "body": "Quote from: Learn Bitcoin on October 13, 2023, 08:18:09 AMEdited This is so heartbreaking and I want you to know that everything will be alright, just make sure your family have the best medical attention and also yourself too. Mind you biking with a family is too dangerous, rather you take a walk with your family or ride in the car but a bike is a bad choice for a family since a bike doesn't have anything to cover you you are exposed to dangers and most especially those at the back seat who does not have any child to hold on to and can easily fall off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 13, 2023, 08:43:20 AM",
      "body": "It's vert painful to have an experience of a bike accident, now we can see the reason why the normal protocols of wearing helmet while riding a bike for you and the other person is very important, maybe the level of injuries sustained could have been minimize, also, we should know this that it's very unlawful to take too much passenger as overload while riding a bike, it happens that in most cases of such related bike accidents, it appears to be brutal and the passengers happened to suffer much at the cause because of shock, fear and when they hold nothing to grip onto when it's about to happen, another thing is over speeding, it has no much benefits than the harm it could cause, this should be avoided on bikes and cars as well, as for your family, i wish them quick recovery, i hope nature will finds you with mercy and grant you the opportunity of being a car owner one day, but when such time comes, don't overspeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 13, 2023, 08:43:40 AM",
      "body": "It is useless at this point to think what could have been done to prevent this and to blame yourself for the situation. Rather you should focus on getting your wife and child treated and getting them back home, which I am sure you will be able to.I hope you find the strength to pull through this and not get emotional and make a mistake. Things will get better, just dont lose hope.Will pray for you and your family! Keep us posted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "October 13, 2023, 08:58:40 AM",
      "body": "Quote from: Wiwo on October 13, 2023, 08:38:04 AMI want you to know that everything will be alright, just make sure your family have the best medical attention and also yourself too. Thank you very much. I am trying my best, but sometimes I get emotional when I see my kid can't stop crying because of the pain. Quote from: Dunamisx on October 13, 2023, 08:43:20 AMas for your family, i wish them quick recovery, i hope nature will finds you with mercy and grant you the opportunity of being a car owner one day, but when such time comes, don't overspeed.Thank you. Recovery is what I want at this moment. If you talk about owning a car, I could buy one if I want. But I never dreamed of being a car owner. But I always has dreamed of owning a sports bike which I have right now. The problem is, that Bike is dangerous for family trips. Thanks for your words! Quote from: TheUltraElite on October 13, 2023, 08:43:40 AMI hope you find the strength to pull through this and not get emotional and make a mistake. Things will get better, just dont lose hope.Will pray for you and your family! Keep us posted.These words help get the strength. Sometimes we have no one to at least say good luck. Yesterday a rickshaw driver helped me a lot who is just a random person was. Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "October 13, 2023, 10:03:58 AM",
      "body": "Pray to Allah, and he won't disappoint you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "October 14, 2023, 04:00:59 PM",
      "body": "When you bought the bike it was serious mistake, and that's the reason of your accident. Especially if you have family. Just sale the bike as fast as possible and buy the car, if you don't want the second accident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "October 14, 2023, 08:27:50 PM",
      "body": "Quote from: Joeyp on October 14, 2023, 04:00:59 PMWhen you bought the bike it was serious mistake, and that's the reason of your accident. Especially if you have family. Just sale the bike as fast as possible and buy the car, if you don't want the second accident. Dude. really? So you are further guilting him with that bs? FFS, fuck off to fuckoffityville, assneck.  Prayers to you and yours @OP. Cheers,Owl",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "October 15, 2023, 04:08:42 AM",
      "body": "This is really sad for us to read. And that this horrible accident did occur on your wedding anniversary does only make it worst. I am sorry your baby is in so much pain, no child needs to feel something like that. But you can not feel guilty it was not your fault. I will keep your poor 2 year old daughter in my thoughts and prayers and your family too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "October 19, 2023, 02:41:35 AM",
      "body": "Quote from: DYING_S0UL on October 13, 2023, 10:03:58 AMPray to Allah, and he won't disappoint you.  Thank you, bro.Quote from: owlcatz on October 14, 2023, 08:27:50 PMPrayers to you and yours @OP. Cheers,OwlThanks, dear, Quote from: mich on October 15, 2023, 04:08:42 AMThis is really sad for us to read. And that this horrible accident did occur on your wedding anniversary does only make it worst. I am sorry your baby is in so much pain, no child needs to feel something like that. But you can not feel guilty it was not your fault. I will keep your poor 2 year old daughter in my thoughts and prayers and your family too. Thank you bud.Update. They getting cured day by day. Both have those injuries and are likely to take three more weeks or maybe four weeks. But, they are feeling better now. No bones were broken. Lucky this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Linggajanitra",
      "created_time": "October 25, 2023, 03:05:27 AM",
      "body": "Quote from: Learn Bitcoin on October 13, 2023, 08:18:09 AMI don't know if it is right to share personal things here. Yesterday, I completed seven years of marriage. And on our wedding anniversary, I went for a bike ride with my family today. On the way back home, the bike fell on a broken part of a culvert, causing the bike to jolt and my wife and my 2-year-old baby to fall off the back of the bike onto the road. The bike was at a speed of 60+, and many parts of their body were injured. My 2-year-old daughter is in a lot of pain. The skin is torn in many parts of the body. I was able to control the bike, and I did not fall off it. Now I ‍am thinking about why I didn't fall, even if they didn't get hurt; I don't know how much people can bear such a smeared body in front of their eyes and the crying of the wife and child. But I can't take it. I feel very guilty. I could have ridden slower; maybe it wouldn't have happened. Again and again, it seems that God could have given me these injuries and kept them well. I am a kinda religious person which is why I believe people's prayers work! All I am looking for is your prayer for my family. Keep my family in your prayers, please. All events or things have been arranged by God. We can only do all this.. we don't know what will happen today, tomorrow or even in the future.We can only surrender to God. God has created & given destiny to humans. Prayer is indeed the most important of all. So, don't forget to keep praying so that we are always under God's protection in any circumstances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CP9-Black",
      "created_time": "October 25, 2023, 08:43:14 PM",
      "body": "Quote from: DYING_S0UL on October 13, 2023, 10:03:58 AMPray to Allah, and he won't disappoint you.  Yes, I think that's exactly right",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vleroybrown",
      "created_time": "October 26, 2023, 10:25:15 AM",
      "body": "When you ask for a prayer from me, you're most definitely going to get a prayer. Joyfully I said a prayer for your family.  Family is such a miracle, especially when things are not easy. Having such a great responsibly as raising a young child to be a capable adult, is a real gift from God. I know God wants us to be happy. He does however, require us to ask. One of my sons also took a spill on a bike recently. He was asked by me if he wanted a blessing and accepted. I trust God that the outcome will be exactly what he and I need to experience greater joy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}