{
  "id": "topic_5454296",
  "title": "RobertClick",
  "author": "RobertClick",
  "created_time": "May 28, 2023, 02:33:21 PM",
  "content": "What happened: Just found another scam/clone website that sells mining asic miners, these guys are scamming for some time now.Domain was registered this month (2023-05-20) so it's clearly a clone.The official website is https://www.iceriver.io (NOTE! They have to proove too that they are legin, we will see for the 1st batch).Reference Link:https://iceriver.techWHOIS:Code:Domain Name: ICERIVER.TECHRegistry Domain ID: D369206634-CNICRegistrar WHOIS Server: whois.namecheap.comRegistrar URL: https://namecheap.comUpdated Date: 2023-05-20T10:52:07.0ZCreation Date: 2023-05-20T10:52:04.0ZRegistry Expiry Date: 2024-05-20T23:59:59.0ZRegistrar: NamecheapRegistrar IANA ID: 1068Domain Status: serverTransferProhibited https://icann.org/epp#serverTransferProhibitedDomain Status: clientTransferProhibited https://icann.org/epp#clientTransferProhibitedDomain Status: addPeriod https://icann.org/epp#addPeriodRegistrant Organization: Privacy service provided by Withheld for Privacy ehfRegistrant State/Province: Capital RegionRegistrant Country: ISRegistrant Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.Admin Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.Tech Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.Name Server: DNS1.NAMECHEAPHOSTING.COMName Server: DNS2.NAMECHEAPHOSTING.COMDNSSEC: unsignedBilling Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.Registrar Abuse Contact Email: abuse@namecheap.comRegistrar Abuse Contact Phone: +1.9854014545URL of the ICANN Whois Inaccuracy Complaint Form: https://www.icann.org/wicf/Payment Method: Only crypto (no card or paypal), red flag!Archive: https://web.archive.org/web/20230528143118/https://iceriver.tech/Reviews: NO REVIEWS!Additional Notes:I advise you not to purchase from iceriver.techYou have been warned, be careful with this website!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454296",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "May 28, 2023, 11:10:16 PMLast edit: May 28, 2023, 11:45:39 PM by PX-Z",
      "body": "They might be new but accusing a site without any strong evidence is useless, especially as a clone or a phishing site.  I see they are indeed clone, my bad.Google can't even give any enough details about them because it's only new. I'm not saying they might be legit too, i'm saying don't try to buy to a new site when purchasing stuffs just because they are cheaper than others. Always use trusted service for assurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 28, 2023, 11:43:37 PM",
      "body": "Great find, I don't even understand what these scammers are thinking why are they in such a hurry to make clones of sites that aren't even reputable yet (unless both are launched by the same developer).I'm not trying to be prejudice, in fact it's not that difficult to also run a clone with a cheaper domain to catch some idiots while making good deals on legit sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RobertClick",
      "created_time": "May 29, 2023, 07:48:08 AM",
      "body": "Well yea not even google can confirm that the .io domain is legit but we shall see next month in June.I just made these posts because it's a hype on KASPA miners and this should come hany to some beginners.SO, BE CAREFULL!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}