{
  "id": "topic_5456175",
  "title": "She shining",
  "author": "She shining",
  "created_time": "June 12, 2023, 10:42:02 PM",
  "content": "una well done. I know say some of us one way on the other still dey operate binance na make I run ahn here. I jam one post online https://[Suspicious link removed]day/binance-silently-changes-terms-of-service-details?amp wey talk say binance make small change for their terms and condition say if dem delist any coin and u still dey hold ahn dem fit convert ahn to anoda without ur consent more reason to avoid centralized exchange. This change wey dem make dem nor announce ahn bcus even me nor b see ahn and I dey use binance once in a while. This na proof say make we dey try dey read terms and condition bcus laziness b nor dey lemme read them since dey too dey long and dey boring, but this mata make me see how dangerous e dey to neglect terms and condition, na so dem go for make change wey go affect me and I nor go know.I believe is not going to be easy leaving binance since I don't believe all of us here only care about the HODL Bitcoin but also the trading of altcoins in platforms and to other users.Despite it's shortcoming as a centralized exchange Binance meets the requirement of allowing us buy coins from others without been easily scammed( safer than buying from vendors we know very little about and our country having no regulation on cryptocurrency to protect the victim), not to mention its popularity in Nigeria. Exercising caution is advisable. This forum has stressed on the disadvantage of centralized exchange so we should always try moving large amount to an open sourced non custodial wallet like electrum for HODL or decentralized exchange like Bisq, Dexilon(relatively young) etc for trading.Success on the Hustles.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456175",
  "comments": [
    {
      "author": "CryptSafe",
      "created_time": "June 13, 2023, 07:52:45 AM",
      "body": "Every organization has the power to change their terms of service at their will. They owe no obligation to informing anyone about the process of changing it. It only takes a sincere organization to do so if only the changes would not affect majority of their clients. Most organization do this secretly because they know what they are doing would greatly affect their clients negatively so they could benefit from it.That is why as a smart investor you are, it is pertinent that you do check for terms of service regularly so as to be on the safe side if there is any changes from the initial. These are the things they do to make away with customers funds and they have every right to doing that which is very absurd.That is why you are advised to keep your assets and funds in a self custodial wallet for your own good. Remember the sayings \" not your keys,not your coin\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "June 13, 2023, 08:33:37 AM",
      "body": "Binance, Kraken and one other exchange I can't remember the name now,  are facing law suit charges for varying reasons. I don't seem to understand why they have to change the terms of service after old users have agreed to the former. Does it mean I automatically agree to their new terms? What if I don't, what happens to my account and details and coins? It's not like some of us even bother to read the terms, but it's better the new updated terms be laid simply so users both old and new can see the difference.I hope the changes will make the exchange less congested, with less traffic and lesser charges too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 14, 2023, 10:02:59 AM",
      "body": "Anything they like to do or implement is their choice and they can go ahead as long as am not in support for the use of centralized exchanges, enough of risking my hard earned labour wages on centralized ponzi, though i believe they will soon end on this issue arising but i also believe if there should be any form of changes then they would have communicated wich through their user's appropriate channels of contact through their KYC informations on their system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 14, 2023, 07:21:32 PM",
      "body": "Quote from: She shining on June 12, 2023, 10:42:02 PMwey talk say binance make small change for their terms and condition say if dem delist any coin and u still dey hold ahn dem fit convert ahn to anoda without ur consent In as much as the value of the converted coin is same as that which was delisted,  for me, I don't think I will have any problem with that, because it's left for you the user to either convert your coin to stablecoin, Bitcoin, altcoins or rather withdraw the funds using p2p, because we all know that Binance is one exchange that is so selective when it comes to listing coin, and if they may they found a coin to be of risk to it's customer, & delist it, it's for your best interest. But in a situation whereby the value of my initial coin was $100 and after it's been converted to another coin of value $70, then only if will such terms & condition not be favorable to it's users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 14, 2023, 07:45:19 PM",
      "body": "First one thing we must get through with is that binance is a centralized cryptocurrency exchange and in as much as we understand the terms of centralized exchange is that,  there have the sole right to change the terms of service at whatever time and so we have to apply caution while dealing with them and better still you need to move your coins to your wallet instead leaving your coin exchange wallets where the exchange have the right to swap them to any coin of their choice if the coin is delisted. This may sound ok for some people who have no constant access to their exchange accounts as frequently as possible,  having your coin swapped into another crypto coin is good enough if the coin you are holding has a liquidity problem and there is a possible crisis in its network. The cryptocurrency market is full of unexpected event and I think binance as the leading cryptocurrency exchange have to put every measure in place to protect the interest of its customers,  so they may not be entirely wrong in this move to have a coin swap on behalf of its customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "June 14, 2023, 07:51:36 PM",
      "body": "Quote from: CryptoHeadlineNews on June 14, 2023, 07:21:32 PMQuote from: She shining on June 12, 2023, 10:42:02 PMwey talk say binance make small change for their terms and condition say if dem delist any coin and u still dey hold ahn dem fit convert ahn to anoda without ur consent In as much as the value of the converted coin is same as that which was delisted,  for me, I don't think I will have any problem with that, because it's left for you the user to either convert your coin to stablecoin, Bitcoin, altcoins or rather withdraw the funds using p2p, because we all know that Binance is one exchange that is so selective when it comes to listing coin, and if they may they found a coin to be of risk to it's customer, & delist it, it's for your best interest. But in a situation whereby the value of my initial coin was $100 and after it's been converted to another coin of value $70, then only if will such terms & condition not be favorable to it's users.The recent news about binance been banned in Nigeria sef make me fear small because I was worried of the way I have become so dependent on binance for the exchanging of my coins but I later come understand say the whole tori na just awareness story wey sec dey try tell most binance operator for naija here to be very careful about their assets in their system. But I know if binance had to change any term and conditions it will be of their customer benefits because they are the number exchange in the world today and it has not been easy to maintain such names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 14, 2023, 08:46:15 PM",
      "body": "Quote from: DaNNy001 on June 14, 2023, 07:51:36 PMQuote from: CryptoHeadlineNews on June 14, 2023, 07:21:32 PMQuote from: She shining on June 12, 2023, 10:42:02 PMwey talk say binance make small change for their terms and condition say if dem delist any coin and u still dey hold ahn dem fit convert ahn to anoda without ur consent In as much as the value of the converted coin is same as that which was delisted,  for me, I don't think I will have any problem with that, because it's left for you the user to either convert your coin to stablecoin, Bitcoin, altcoins or rather withdraw the funds using p2p, because we all know that Binance is one exchange that is so selective when it comes to listing coin, and if they may they found a coin to be of risk to it's customer, & delist it, it's for your best interest. But in a situation whereby the value of my initial coin was $100 and after it's been converted to another coin of value $70, then only if will such terms & condition not be favorable to it's users.The recent news about binance been banned in Nigeria sef make me fear small because I was worried of the way I have become so dependent on binance for the exchanging of my coins but I later come understand say the whole tori na just awareness story wey sec dey try tell most binance operator for naija here to be very careful about their assets in their system. But I know if binance had to change any term and conditions it will be of their customer benefits because they are the number exchange in the world today and it has not been easy to maintain such names.But I hope your entire fund is not kept on Binance exchange. Because if you did, I will strongly advise you move it right away to a more safer place which is on a noncustodial Bitcoin wallet such as \"Electrum\" or a hardware wallet like \"Trezor\". While secondly, if in case SEC meeting with Binance seems not to yield a positive result, and you are in need of a best alternative to Binance which is more user-friendly, fast and offers a good means to exchange your coins, buy & sell Bitcoin easily and ability to sell Bitcoin to get paid in fiats fast, and the name of the platform is called \"Remitano\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "June 14, 2023, 09:32:22 PM",
      "body": "Quote from: She shining on June 12, 2023, 10:42:02 PMuna well done. I know say some of us one way on the other still dey operate binance na make I run ahn here. I jam one post online https://[Suspicious link removed]day/binance-silently-changes-terms-of-service-details?amp wey talk say binance make small change for their terms and condition say if dem delist any coin and u still dey hold ahn dem fit convert ahn to anoda without ur consent more reason to avoid centralized exchange. This change wey dem make dem nor announce ahn bcus even me nor b see ahn and I dey use binance once in a while. This na proof say make we dey try dey read terms and condition bcus laziness b nor dey lemme read them since dey too dey long and dey boring, but this mata make me see how dangerous e dey to neglect terms and condition, na so dem go for make change wey go affect me and I nor go know.This one no be matter of centralized exchange or not, they're free to change their terms and conditions and when dem update their customers about this changes den no problem but if dem no info them na there problem for dey. Normally you no supposed dey store your coins dem for any exchange as e dey wrong and dangerous. Exchange as d name talk na to trade so na wetin we supposed dey run there. If you dey hold coin for exchange, you dun give control to them be dat na dem fit do as dem like. E just be like when you carry your woman go drop for another man house (wetin you dey expect).Dem dun delist coin and before dem run dat one dem dey give warning ahead and stop trading for the particular coin even deposit self. Na only withdraw dem dey allow (all this one na from past experience) so you wey no gree go withdraw the coin to your own wallet na mumu na, dem dun take decision for you to him converts your coins to another one wey dem still dey trade. Make we no blame dem everytime for wetin we fit run to avoid wahala. If an exchange talk say dem wan delist any coin, just use your head and do the needful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "June 15, 2023, 07:35:02 AM",
      "body": "Quote from: She shining on June 12, 2023, 10:42:02 PMI jam one post online wey talk say binance make small change for their terms and condition say if dem delist any coin and u still dey hold ahn dem fit convert ahn to anoda without ur consent more reason to avoid centralized exchange. This change wey dem make dem nor announce ahn bcus even me nor b see ahn and I dey use binance once in a while. This na proof say make we dey try dey read terms and condition bcus laziness b nor dey lemme read them since dey too dey long and dey boring, but this mata make me see how dangerous e dey to neglect terms and conditionBefore you signed up, if you had gone through the terms and conditions, you would have seen it well written that they have the right to change their update or change their service at any point in time. So it shouldn't come as a surprise. What you said about many users not reading exchange's terms and conditions is true and sadly I'm also guilty of that. Quote from: CryptopreneurBrainboss on June 14, 2023, 09:32:22 PMDem dun delist coin and before dem run dat one dem dey give warning ahead and stop trading for the particular coin even deposit self. Na only withdraw dem dey allow (all this one na from past experience) so you wey no gree go withdraw the coin to your own wallet na mumu na, dem dun take decision for you to him converts your coins to another one wey dem still dey trade. Make we no blame dem everytime for wetin we fit run to avoid wahala. If an exchange talk say dem wan delist any coin, just use your head and do the needful. Has you talk am centralized exchange na to just trade tokens and no be to dey store tokens, Government fit shot dem down anytime, dem fit go bankruptcy or dem fit get security breach and users fit lose their tokens as a result. Also, wetin you talk about delisting of coin na true, e don happen to me too. Sometimes dem fit give notification about delisting of their coin and if you no see na wahala for you. This na many reasons why person no suppose to dey use exchange to dey store crypto assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "June 15, 2023, 05:48:47 PM",
      "body": "Whatever Binance dey change for their T&C na for their own fat luck and I no think say e go bring any cause for alarm. When you no keep your coins for their exchange,nothing whatever them change go take affect you. Na only those pple wey no dey hear word or dey lazy to dey transfer their coins from one wallet to another na e any change go panic. Noncustodial wallet na e be baba for maximum safety of bitcoin since na u dey with the remote control of the wallet. All talk na lesson,this reading of T&C for any monetary involvement,I beg make we try dey follow am up to avoid story that touches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 15, 2023, 07:43:31 PM",
      "body": "Thank you for bringing this gud egberi for here. And as u tok am to read terms and conditions e no dey easy at all. Because those their conditions eh! Na die bi dat. If dem relish a coin and convert am to another with the owner's consent is also better because dey have the right to remove the coin and na u go still loss. But as e bi like this u no loss at las u go cash am out from another coin.na good thing be that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "June 15, 2023, 08:15:21 PM",
      "body": "To update or even read terms and conditions for any platform or exchange at all no easy ma broda because only the write up sef go discourage you to read am but I just believe say any changes wey dey happen for their platform na for the good of the customers because I trust binance and dem no reach this level wey dem dey without keeping and checking all possible errors for their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "June 15, 2023, 08:38:03 PM",
      "body": "I want to reiterate that I am still able to access my Binance account through the mobile app. For those encountering difficulties, have they considered using a VPN? Also, is there currently no access to peer-to-peer (P2P) trading?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 15, 2023, 08:55:57 PM",
      "body": "Quote from: She shining on June 12, 2023, 10:42:02 PMuna well done. I know say some of us one way on the other still dey operate binance na make I run ahn here. I jam one post online https://[Suspicious link removed]day/binance-silently-changes-terms-of-service-details?amp wey talk say binance make small change for their terms and condition say if dem delist any coin and u still dey hold ahn dem fit convert ahn to anoda without ur consent more reason to avoid centralized exchange. This change wey dem make dem nor announce ahn bcus even me nor b see ahn and I dey use binance once in a while. This na proof say make we dey try dey read terms and condition bcus laziness b nor dey lemme read them since dey too dey long and dey boring, but this mata make me see how dangerous e dey to neglect terms and condition, na so dem go for make change wey go affect me and I nor go know.You de right, most of us no de care to read terms and condition completely because say e de always long, but we need de very careful and try to de read dem all before we use any platform or exchanges no be only binance.QuoteExercising caution is advisable. This forum has stressed on the disadvantage of centralized exchange so we should always try moving large amount to an open sourced non custodial wallet like electrum for HODL or decentralized exchange like Bisq, Dexilon(relatively young) etc for trading.Even though we know say centralize exchange de help us they convert our money through p2p to Naira, make we no rely on dem.Make we try they keep our main money for our personal wallets so that we go de safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "June 18, 2023, 12:57:55 PM",
      "body": "For Binance to automatically converts your holding coin to stable coin or to reputable coin is best decision because I know we are too weak when it comes of readings and keeping to rules and regulations. With this steps investors funds are save and secured against any lost. This aspect is one that affects most forum gamblers for openly calling some exchange and casino site scammers. That notwithstanding, Thanks for sharing because Binance is a very popular exchange for we Nigerian and out 99 percent of we users are using Binance to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "June 18, 2023, 03:57:55 PM",
      "body": "Quote from: Mr.suevie on June 15, 2023, 08:15:21 PMTo update or even read terms and conditions for any platform or exchange at all no easy ma broda because only the write up sef go discourage you to read am but I just believe say any changes wey dey happen for their platform na for the good of the customers because I trust binance and dem no reach this level wey dem dey without keeping and checking all possible errors for their platform.Na true you talk, you fit to read di whole terms and conditions and still miss vital points wey fit to go against you. Personally I no de too border to read di whole terms and conditions for any established public company, instead I de focus on di company reputation, weda dem don build integrity, dem track record over di years, how many customers dem get and di level of trust wey dis customers get for where dem de and of course di customers feedback. I believe say any  changes wey established company like binance go make, go suppose be win win for dem and dem customers, because e must get reason wey make dem be the top exchange, so dem no go want to jeopardize am, to want to chop alone, at di detriment of dia customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 18, 2023, 05:10:08 PM",
      "body": "That is good but they (Binance) would have announced it publically so that users would be aware of what is going to happen in the platform. Oboy to read terms and conditions e no dey easy because di article dey always bogus. Binance na di sure exchange. So for us to leave Binance e no dey dey easy. So any how things go still okay for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "June 20, 2023, 05:13:57 PM",
      "body": "These terms and conditions wey Binance change so, many people dey aware of am? I think not. Because this is my first time of hearing such implementation in their terms and conditions. The issue of terms of terms and  conditions of an exchange, no be everyone the try read am when them don sign up for exchange finish. Their only focus na to trade and ends there. Any other thing wey d exchange d do, that one concern the exchange, em no concern them macha. But at least Binance for announce am sae they are implementing so so move on coins wey d go delist in the future for their exchange. In case of those who still keep their coin on Binance exchange. Anyway, for Binance to help their user to change the coin wey them don delist to another coin na good move sha. It shows that them get their customers welfare at heart. It is better to have something(other coin) than losing entirely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}