{
  "id": "topic_5409705",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "August 13, 2022, 06:59:10 AM",
  "content": "Forked from a different thread - why not list all subdomains of a website you don't want to use, and then blacklist them all?Quote from: LoyceV on August 13, 2022, 05:56:46 AMQuoteAnd on top of that, many famous services (Google, Facebook etc.) ask for your mobile number... why is that? Well, tracking becomes easier. They can associate phone numbers with social media profiles. You gain safety, but you lose freedom.That doesn't provide safety, it increases the risk of a sim swap attack.This is how you get safety from them:Code:grep facebook.com /etc/hosts~I'll stop going off-topic now I have an idea for improving privacy - For each privacy-invading website, someone should track all its subdomains in a text file, which can then be copied and pasted into the /etc/hosts file automatically.I'd still prefer some folder like /etc/hosts.d where you can put files for any website in individual files. That'll make it much simpler to add new subdomains without breaking everything. Maybe using something like https://unix.stackexchange.com/questions/60549/etc-hosts-file-refer-to-another-configuration-file",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409705",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "August 13, 2022, 01:11:10 PM",
      "body": "Quote from: NotATether on August 13, 2022, 06:59:10 AMsomeone should track all its subdomains in a text fileSomeone did that already  Allow me to quote myself:Quote from: LoyceV on January 16, 2018, 12:31:18 PMQuote from: Vod on January 16, 2018, 09:15:49 AMSomeone ~ should maintain a listSomeone already did that: https://github.com/StevenBlack/hosts (scroll down a bit to see many different categories hosts files).Quote from: NotATether on August 13, 2022, 06:59:10 AMI'd still prefer some folder like /etc/hosts.d where you can put files for any website in individual files. That'll make it much simpler to add new subdomains without breaking everything. Maybe using something like https://unix.stackexchange.com/questions/60549/etc-hosts-file-refer-to-another-configuration-fileI would have suggested exactly what it shows there already:Code:cat /etc/hosts.d/*.conf > /etc/hosts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}