{
  "id": "topic_5400159",
  "title": "Wapfika",
  "author": "Wapfika",
  "created_time": "May 25, 2022, 01:42:06 PM",
  "content": "According to Eric Balchunas\"Senior ETF Analyst @ Bloomberg\" tweet, FTX's proposal to CFTC for a new clearing model could open door to satisfy the SEC's requirement for a federally regulated spot bitcoin market if approved.[1]FTX's proposal before the CFTC for a new clearing model for its cryptocurrency-trading platform looks to us like it could eventually offer a path to US approval of a spot Bitcoin ETF. Puttng FTX's spot Bitcoin markets under CFTC oversight could satisfy the SEC's requirements for federally regulated monitored spot Bitcoin market.[1]Proposal could bring FTX under CFTC's jurisdictioncontent: FTX's platform could qualify as a federally regulated spot Bitcoin exchange under the company's proposal to the CFTC, which offers a \"non-intermediated\" model for crypto derivatives trading: FTX would directly hold collateral from the customer rather than use a Futures Commission Merchant (FCM). This would allow FTX to offer leverage or margin to anyone trading on the platform. A section of the Commodities Exchange Act of 1936 stated[sup][1][/sup]Commodities Exchange Act Section 2(c)2(D)[2](D)Retail commodity transactions           (i)Applicability                     Except as provided in clause (ii), this subparagraph shall apply to any agreement, contract, or transaction in                   any commodity that is -                (I) entered into with, or offered to (even if not entered into with), a person that is not an eligible contract                     participant or eligible commercial entity; and               (II) entered into, or offered (even if not entered into), on a leveraged or margined basis, or financed by the                      offeror, the counterparty, or a person acting in concert with the offeror or counterparty on a similar basis.Sources:[1]https://twitter.com/EricBalchunas/status/1529095347556974593/photo/1[2]https://www.cftc.gov/LawRegulation/CommodityExchangeAct/index.htmThis is surely a long shot but this idea can solve the uncertainty of SEC for te approval of Bitcoin Spot ETF. Note: I just re-echo the analysis of Eric Balchunas about the subject to share it here in the forum. Refer to the source for more details and conversation development.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400159",
  "comments": [
    {
      "author": "jackg",
      "created_time": "May 25, 2022, 03:40:22 PM",
      "body": "Does a sec regulated etf just mean that pension schemes can invest in crypto, is there actually going to be much that comes out of doing that (and can they not already buy Grayscale)?I think if ftx did get a federally regulated bitcoin etf, they'd have to enter into a partnership with someone who already hosts those sorts of investments to give themselves a better level of reputation too and not put investors off more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 25, 2022, 04:30:58 PM",
      "body": "Anybody can in theory invest in anything.HOWEVER, many funds and other investors will not want to invest money in something that is not regulated.The risks, which MAY or MAY NOT be higher give the appearance of higher risk so they are avoided. Either by policy or by intent.Obviously, there are exceptions to this but the overall point is the same.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dezoel",
      "created_time": "May 28, 2022, 12:05:32 PM",
      "body": "I understand that this \"Bitcoin ETF\" thing has been talked a lot and I know that many people think that they could make a ton of money from it as well and when it starts bitcoin could go up a lot as well. However, I am tired of seeing all these news as well because it feels like it is cheapening the situation and I believe that we should be considering it a boring thing nowadays. Each time there are news like this people get hyped about it, and they are waiting for the result as well as if it would happen suddenly and the price even goes up because of it as well. It never happens and it is a boring old news that will not change anything for us, we just need to start ignoring it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 28, 2022, 10:14:57 PM",
      "body": "a commodity. is a raw material used to create productsoil into car fuel or plasticwheat into bread or cerealetcbitcoin is not a commodity.. ill emphasise this BITCOIN IS NOT A COMMODITY...GOLD sits on 2 markets for 2 very different reasons.gold commodity for electronics and jewellery (CFTC regulated)gold asset for its investment (sec regualted)bitcoin does not fit the gold commodity analogy.bitcoin does fit the gold asset analogy.bitcoin wont belong and be regulated by CFTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 03, 2022, 03:52:10 AM",
      "body": "FTT is a second biggest exchange and it takes over this position from Coinbase, in May.Article from theblockcryptoA token from a big exchange is safe to invest in and in future, with growth of crypto, FTT might get its price higher than its current all time high $70. FTT is like Binance in 2017 and 2018 and if we see BNB was traded more than $500 in 2021, we can see the same for FTT in future, in 2024 or 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "June 03, 2022, 04:15:15 AM",
      "body": "Quote from: dezoel on May 28, 2022, 12:05:32 PMI understand that this \"Bitcoin ETF\" thing has been talked a lot and I know that many people think that they could make a ton of money from it as well and when it starts bitcoin could go up a lot as well. However, I am tired of seeing all these news as well because it feels like it is cheapening the situation and I believe that we should be considering it a boring thing nowadays. Each time there are news like this people get hyped about it, and they are waiting for the result as well as if it would happen suddenly and the price even goes up because of it as well. It never happens and it is a boring old news that will not change anything for us, we just need to start ignoring it.Agreed. Why don't people push for more bitcoin adoption instead? What good would it do if we have a bitcoin ETF anyway? It is just another toy for the WallStreet banksters. With this toy they may do what they did to gold. So why even try? Bitcoin is way better without WS. We don't need them. They need bitcoin. Push for the bitcoin adoption and then they'll shove an ETF into our throats even when we don't want it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}