{
  "id": "topic_5464818",
  "title": "willi9974",
  "author": "willi9974",
  "created_time": "August 28, 2023, 09:34:55 AMLast edit: August 29, 2023, 12:53:09 PM by willi9974",
  "content": "Hallo zusammen,da ich mega auf irgendwelche Auszeichnungen stehe, dachte ich mir ich erstelle mal einen Beitrag in dem die Auszeichnungen und Erfolgsgeschichten für den deutschsprachigen Raum gesammelt werden können.Ich bitte jeden gerne ein paar warme Worte über sich oder gerne auch über jemand anderen in diesem Beitrag zu erwähnen. Denkt aber bitte an die Privatsphäre und bitte keine negativen Kommentare, hier soll es ausschließlich über positive Erfolge gehen. Ich fange mal mit mir an, will es aber nicht als Eigenlob sehen, sondern danke da expliziert euch allen, da dies ohne euch nicht möglich gewesen wäre! Ich habe damals 2013 (wow das sind schon mehr als 10 Jahre) angefangen mich mit dem Thema Bitcoin zu beschäftigen und bin damals im Januar 2014 auf das Forum gestoßen. Da man hier seine Fragen loswerden konnte und jeder immer sehr hilfreich war, das Thema Bitcoin sehr interessant war, bin ich hier hängengeblieben und hat mein Leben als auch das Leben meiner Familie etwas geprägt und positiv beeinflusst. Man investiert schon sehr viel Zeit in das Hobby   zumindest vergeht die Zeit schneller als man denkt.Als ich damals auch ein paar Satoshis verloren hatte durch einen Betrug, dachte ich mir ich helfe anderen User mit einer Escrow Dienstleistung und bin stolz auf  das Ergebnis, da ich doch schon einigen Nutzern helfen konnte und vor Betrügereien bewahrt habe. Da ich öfters als Escrow empfohlen werde, schreckt das auch den einen oder anderen Übeltäter ab.Auf https://bpip.org kann man seinen Nutzernamen eingeben und eine schöne Statistik einsehen und bin auf den 10. Platz der vertrauenswürdigsten Nutzer sehr stolz.  https://bpip.org/Profile?p=willi9974##########################Was alles unter bpip.org angezeigt wird, was man alles machen kann, findet man hier nützliche Infos von 1miauhttps://bitcointalk.org/index.php?topic=5031433.0 oder verfolgt den ursprünglichen Beitrag https://bitcointalk.org/index.php?topic=5213618.0 von ibminer (er hat glaube ich das Projekt übernommen und kümmert sich aktuell um die Seite)In dem Sinne bitte ich euch alle gerne auch irgendwelche anderen Erfolge hier im deutschsprachigen Raum in diesem Beitrag zu dokumentieren. Viele Grüße und eine schöne Zeit,Willi",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464818",
  "comments": [
    {
      "author": "bullrun2024bro",
      "created_time": "August 28, 2023, 10:18:51 AM",
      "body": "Quote from: willi9974 on August 28, 2023, 09:34:55 AM~Schöner Thread @willi9974. Ich finde den Dank müssten wir als Community eher zurückgeben. Denn gerade du bist ein wesentlicher Bestandteil, warum in unserem deutschsprachigen Bereich so ein großes Gemeinschaftsgefühl herrscht. Du veranstaltest seit Jahren regelmäßig Mining-Runs für und mit der Community und hast so schon vielen Mitgliedern hier einen Bitcoin-Regen bescherrt.Daneben hast du schon unzählige Bitcoin gratis oder für ganz kleines Geld sicher verwahrt und Deals per Treuhand abgewickelt. Dementsprechend bist du ein ganz fester Bestandteil unseres Boards und hast dir die Auszeichnungen auf BPIP mehr als verdient. Und gerade den hohen Truststatus muss man nochmal hervorheben. Ich persönlich halte dich auch für eins der vertrauenswürdigsten Mitglieder des Forums. Darum hast du dir diesen Status mMn mehr als verdient.  Jetzt hast du ja schon gut vorgelegt. Bei meinem BPIP-Profil sieht das ganze noch etwas übersichtlicher aus, aber einen Meilenstein habe ich dann doch gesammelt. Ich gehöre zu den Top50 Mitgliedern des Forums mit den meisten gesammelten Merit. Mittlerweile sind es über 3800 und ich danke euch allen herzlich dafür, dass ihr meine Beiträge regelmäßig bedenkt und meine Zeit, die ich in das verfassen guter, interessanter Beiträge stecke, belohnt.Mal gucken was in Zukunft noch kommt..  Quelle: https://bpip.org/Profile?id=2744352",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "August 28, 2023, 10:32:45 AM",
      "body": "Ich hab erstmals im Dez 2016 über einen Freund von einem Freund von Bitcoin gehört. Damals war mir das alles suspekt. Ein Jahr später im Dez 2017 haben beide in selber Runde von Ihren Erfolgen berichtet. Ich bin dann im Jan 2018 noch schnell auf den Hype aufgesprungen, hab alles falsch gemacht was man als Anfänger eben so falsch machen kann, hab noch paar mal nachgeschossen und schließlich im März 2018 nen margin call hingelegt. Autsch!Neben jeder Menge Kohle hab ich mir auch ordentlich die Finger verbrannt.Ein Zyklus weiter und etwas klüger hab ich Q4 2020 mit nem Sparplan angefangen um mich nachträglich zu ärgern nicht alles (oder zumindest ne größere Einmalzahlung) direkt reingesteckt zu haben. Aber immerhin haben Einstieg in 2020/21 und Ausstieg in 2022 schon deutlich besser gepasst (wobei zugegebenermaßen die Messlatte sehr tief hing) und ich habe weitestgehend die Verluste aus 2018 wieder reingeholt.   Als ich dann Anfang 2023 das Forum hier entdeckt habe fing ich erstmals an wirklich tief in den Kaninchenbau hinabzusteigen, vorher war alles nur oberflächlich. Insofern auch von mir an alle ein Danke für das hier bereitgestellte Wissen und die vielen wirklich klugen Ratschläge. Was mich persönlich stolz macht, ist dass die Qualität meiner Beiträge hier so wertgeschätzt wird und die damit verbundenen persönlichen Erfolge einer Merit/Post-Ratio ~1 bzw. 500 Merit noch als Full Member. Die Anerkennung (stellvertretend messbar gemacht durch die Merits) hält mich motiviert mir hier auch weiter viel Mühe bei den Beiträgen zu geben und somit die \"Wissensdatenbank\" etwas zu erweitern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "August 28, 2023, 01:50:15 PMLast edit: August 28, 2023, 02:15:48 PM by cygan",
      "body": "@willi9974 ein sehr schöner faden, in dem man persönlich, wenn man zurückschaut auch etwas 'emotional' wird auch ich möchte mich hiermit für die gute 'zusammenarbeit' die wir zb. bei den bl-tippspiel-runden haben und hatten sehr bedanken. auch deine anderen aktionen (zb. mining runs), angebote (seed edelstahlplatten), treuhandservice usw. sind hier zu erwähnen und da nehme ich vor dir den hut ab was mich persönlich angeht, ich bin hier schon seit über 12 jahren gefangen und komme einfach nicht raus, bzw. kann nicht los lassen das ganze forum und natürlich die komplette d-a-ch gemeinschaft, haben mir auch in dieversen momenten sehr geholfen - ich konnte vieles lernen und auch vieles weitergeben. über das forum konnte ich viele neue kontakte knüpfen, 2-3 forumuser persönlich kennenlernen und auch mein projekt Icarus auf die beine stelle. auf alles was hier in den ganzen jahren erlebt habe, bin ich irgendwie auch stolz was meine auszeichnungen angeht, da möchte ich mich auch nochmal bei euch bedanken - ohne euch wäre ich jetzt bestimmt nicht da, wo ich momentan bin!!!btw es ist doch irgendwie machbar mindestens in einer kategorie die top10 zu erreichen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "August 30, 2023, 03:13:47 PM",
      "body": "Gratulation an willi9974 für die ganzen Auszeichnungen die erhalten bzw geschafft hast , das sieht man auch nicht alle Tage.Dies geht auch an bullrun2020bro und cygan und ist das ist nur mit viel arbeit und ergeiz zu erreichen.Hier ist auch meine Übersicht , wobei ich Anmerken muß das ich da nicht so viel wert darauf lege.Es ist ein schöner nebeneffekt , aber ist für mich jetzt nicht wichtig.Source : https://bpip.org/Profile?p=Lafu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "August 31, 2023, 02:01:40 PM",
      "body": "Meine Statistiken (die ich ehrlicherweise länger nicht geprüft habe) waren auch schon Mal besser... https://bpip.org/Profile?p=mole0815Aber ich mache es einfach wie der Bitcoin und stresse mich nicht. Es geht hoch, dann wieder runter aber auf alle Fälle geht es dahin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Koal-84",
      "created_time": "October 13, 2023, 07:59:00 AMLast edit: October 13, 2023, 08:25:20 AM by Koal-84",
      "body": "Denke es passt hier am besten rein und habe es auch etwas übersehen, aber durch mole (1000 Merit) und natürlich qwk ist es jetzt im Endspurt >900 Merits doch schneller gegangen als gedacht  Unknown01 und bct_ail haben mich darauf hingewiesen das ich jetzt zum Legendary aufgestiegen bin, ein DANKESCHÖN an alle, die in den letzten Jahren meine Beiträge gewürdigt und mir Merits zuerkannt haben.Quote from: Unknown01 on October 11, 2023, 07:58:29 PMEdit: Übrigens herzlichen Glückwunsch zum Legendary @Koal-84, habe gerade mitbekommen, dass durch meinen Merit die 1.000‘er Grenze erreicht wurde Quote from: bct_ail on October 12, 2023, 10:49:10 AMedit: Herzliichen Glückwunsch zum Legendary, Koal-84. Edit:MinoRaiola und Real-Duke auch übersehen  Quote from: MinoRaiola on October 13, 2023, 06:22:35 AMVon mir auch: Herzlichen Glückwunsch Koal-84Quote from: Real-Duke on October 13, 2023, 07:48:25 AMAuch von mir Glückwunsch zum Legendary @Koal-84  Ich habe die 1000 Merits leider verpasst, aber 1001 Merit sind doch wie aus 1000 und einer Nacht!Hier nochmal als kleiner Blickfang für alle, da strahlt er zufrieden mit seinem schönsten Zahnpasta Lächeln Grundsätzlich muss ich dazu sagen, der Avatar passt doch perfekt dazu  , eventuell gibt es ja einen Screenshot mit 1000 erhaltenen Merits in gegebener Zeit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "October 13, 2023, 08:13:34 AM",
      "body": "Dann auch einen Glückwunsch von meiner Seite und allzeit ein sicheres Wallet und glückliches Händchen bei Trades.Hab mein Legendary Status damals nicht übersehen und eher darauf hin gefiebert, aber egal nun hast du es ja geschafft.Nächste Schritte gibts daher nicht mehr aber mein Ziel ist es weiter Merit zu sammeln und weitere positive Trusts zu bekommen und irgendwann mal in den Statistiken wo auf Platz 1 zu landen, ich liebe diese Statistiken.Aber am meisten freue ich mich wenn ich jemanden helfen kann oder vor einer größeren Dummheit bewahren konnte... Das freut mich immer am meisten. Das ist mein Ziel...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Koal-84",
      "created_time": "October 13, 2023, 08:20:38 AM",
      "body": "Quote from: willi9974 on October 13, 2023, 08:13:34 AMHab mein Legendary Status damals nicht übersehen und eher darauf hin gefiebert, aber egal nun hast du es ja geschafft.Danke, übersehen war eventuell ein etwas schlecht gewählter Ausdruck, aber ich habe diese Woche einfach nicht mehr damit gerechnet und da kommt mole am 11. Oktober daher und verteilt an einem Tag 14 Merits (so ein Schlingel  ), daher habe ich das nicht so mitbekommen  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "October 13, 2023, 08:22:27 AM",
      "body": "ahhh ok, dann ab jetzt allzeit gute Kampagnen als Legendary",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "October 13, 2023, 09:08:51 AM",
      "body": "Quote from: Koal-84 on October 13, 2023, 07:59:00 AMEin DANKESCHÖN an alle, die in den letzten Jahren meine Beiträge gewürdigt und mir Merits zuerkannt haben.Gratulation auch von mir zu diesem tollen Meilenstein im Forum Quote from: Unknown01 on October 11, 2023, 07:58:29 PMÜbrigens herzlichen Glückwunsch zum Legendary @Koal-84, habe gerade mitbekommen, dass durch meinen Merit die 1.000‘er Grenze erreicht wurde Ähm, nö durch dich wurde sie mit 1001 überschritten aber erreicht wurden die 1000 schon davor Spaß beiseite Hauptsache wir haben unseren Koal-84 zum Legendary gemacht",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "October 13, 2023, 09:35:51 AM",
      "body": "@Koal-84 Auch von mir einen Glückwunsch zum Aufstieg.Es gibt doch immer wieder auch den einen oder anderen Aufstieg nach der Einführung der Merits. Bei einem dauert es etwas länger beim anderen geht es schneller oder wird sogar von der Aktivität ausgebremst (wird vermutlich bei Turbartuluk so sein).@bullrun2020bro war das bei dir auch nicht so, dass du von der Aktivität ausgebremst wurdest?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 13, 2023, 11:12:40 AM",
      "body": "@Koal-84 auch von mir glückwunsch zu dem aufstieg!aktuell haben wir dann noch folgende 6 aktive user aus unserem bereich, die noch den legemndary rank vor sich haben und den auch irgendwann erreichen könnten:virginorange (full), Turbartuluk (senior), AHOYBRAUSE (senior), citb0in (senior), Unknown01 (hero) und 5tift (hero)ich hoffe, dass ich niemanden vergessen habe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "October 13, 2023, 12:32:03 PM",
      "body": "Von mir natürlich auch Glückwunsch an @Koal-84 zum Aufstieg.Und ja @cygan ich arbeite noch an meinem Aufstieg, welcher sicher nächstes Jahr machbar ist  Euch allen ein schönes WE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 13, 2023, 12:35:24 PM",
      "body": "Quote from: Koal-84 on October 13, 2023, 07:59:00 AMDenke es passt hier am besten rein und habe es auch etwas übersehen, aber durch mole (1000 Merit) und natürlich qwk ist es jetzt im Endspurt >900 Merits doch schneller gegangen als gedacht  Von mir auch noch beste Glückwünsche zum Meilenstein @Koal-84 !Quote from: Buchi-88 on October 13, 2023, 09:35:51 AM~Im Grunde ist es bei mir ja jetzt schon so, die Merits für Hero hab ich ja schon zusammen. Und ja bei bullrun2020bro war das auch so. Ich meine er stand/steht auch irgendwo in so einem Leaderboard in den Top10 für die am schnellsten verdienten 1.000 merits, ging bei ihm auf jeden Fall auch sehr fix.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "October 16, 2023, 05:12:03 PM",
      "body": "Quote from: Koal-84 on October 13, 2023, 07:59:00 AMDenke es passt hier am besten rein und habe es auch etwas übersehen, aber durch mole (1000 Merit) und natürlich qwk ist es jetzt im Endspurt >900 Merits doch schneller gegangen als gedacht  Dann auch von meiner seite her \" Herzlichen Glückwunsch \" zum Legendary Rank aufstieg auch wenn es ein bisschen verspätet ist.Hätte ich das eher auf dem Schirm gehabt dann wären der ein oder andere Merit von mir auch dazu gekommen um dies zu erreichen.Aber wir haben hier ja viele andere Benutzer die das ebenfalls möglich gemacht haben oder machen wenn jemand kurz vor dem aufstieg ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Koal-84",
      "created_time": "October 17, 2023, 08:46:52 AM",
      "body": "Quote from: Buchi-88 on October 13, 2023, 09:35:51 AM@Koal-84 Auch von mir einen Glückwunsch zum Aufstieg.Quote from: cygan on October 13, 2023, 11:12:40 AM@Koal-84 auch von mir glückwunsch zu dem aufstieg!Danke euch beiden, ich hoffe ich habe jetzt auch keine vergessen.  Quote from: Turbartuluk on October 13, 2023, 12:35:24 PMVon mir auch noch beste Glückwünsche zum Meilenstein @Koal-84 !Danke für die Glückwünsche und wie du selbst schreibst es ist nur mehr eine Frage der Zeit bei dir  . Deine Aktivität wird ja in ca. 200 Tagen die erforderlichen 500 erreichen  , hört sich jetzt viel an aber auch diese Tage gehen schnell rum.Quote from: Lafu on October 16, 2023, 05:12:03 PMDann auch von meiner seite her \" Herzlichen Glückwunsch \" zum Legendary Rank aufstieg auch wenn es ein bisschen verspätet ist.Hätte ich das eher auf dem Schirm gehabt dann wären der ein oder andere Merit von mir auch dazu gekommen um dies zu erreichen.Aber wir haben hier ja viele andere Benutzer die das ebenfalls möglich gemacht haben oder machen wenn jemand kurz vor dem aufstieg ist.Ich habe den genauen Zeitpunkt ja auch selber etwas übersehen, ja es stimmt es gibt genug Verteiler bei uns im Bereich und ist auch gut so.Meine letzten beiden Merits habt jedenfalls ihr beiden bekommen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "October 18, 2023, 03:39:08 AM",
      "body": "Quote from: Koal-84 on October 13, 2023, 07:59:00 AM~Da ist man einmal ein paar Tage weniger online und schon werden hier die Merit-Rekorde geknackt. Aber in diesem Sinne auch noch einmal ganz herzliche Glückwünsche zu deinem Legendary Status lieber @Koal-84.Den Rang hast du dir mehr als verdient. Herzlichen Glückwunsch! Wird auch Zeit, dass du endlich zum Club der Legendären gehörst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "March 03, 2024, 05:48:11 PMLast edit: March 05, 2024, 01:00:00 PM by mole0815",
      "body": "oh wie cool wieder etwas verbessert, ich steh auf so ein scheiß  Most Trusted: eine Stufe rauf von Platz 10 auf Platz 9Most recogniced: von 22 auf 18 verbessertMost Active: von 87 auf 81 verbessert",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "March 05, 2024, 01:00:43 PM",
      "body": "Quote from: willi9974 on March 03, 2024, 05:48:11 PMMost Active: von 87 auf 814 verbessertIch habe es mir erlaubt deinen Tippfehler zu korrigieren willi Und Gratulation zur Verbesserung in 3 Kategorien!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}