{
  "id": "topic_5467368",
  "title": "sabotag3x",
  "author": "sabotag3x",
  "created_time": "September 19, 2023, 07:15:51 PM",
  "content": "Estou querendo começar uma coleção de moedas físicas de Bitcoin, algumas bem baratinhas.. tem umas bem bonitas lá na aba Collectibles..Mas estou com uma dúvida, serei taxado pelo nosso querido governo?Se eu comprar uma moedinha de R$ 100, pagarei uns R$ 100 de imposto?  alguém sabe como funciona?Estou perguntando porque hoje vi uma notícia de um cara que pagou R$ 31 de imposto por um produto de 3 reais, fonte: https://www1.folha.uol.com.br/mercado/2023/09/e-veridica-nota-fiscal-com-imposto-de-r-3145-sobre-produto-de-r-315.shtmlAproveitando, também queria saber quanto custa o envio dos EUA/Europa para o Brasil para esses itens pequenos. Estava até pensando em deixá-las com alguém lá fora até juntar algumas e então pagar um frete só.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467368",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "September 19, 2023, 08:02:23 PM",
      "body": "Pelo novo entendimento da norma da receita federal, objetos importados abaixo de 50 dólares estarão isentos do imposto de importação e pagarão apenas 17% de icms sobre o valor do produto. O valor desse  icms(imposto sobre circulação de mercadorias e serviços) será repassado para o Estado onde mora o importador do produto. *Obs: O Exportador do produto deverá fazer parte do programa Remessa. Senão vai ter que pagar o imposto de importação.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 19, 2023, 08:21:55 PM",
      "body": "É isso que o Paredao falou em teoria, só que para isso funcionar o site/loja onde você quer comprar precisa aderir ao programa \"remessa conforme\" do governo. Aliexpress já fez isso.Recentemente fiz uma compra abaixo de 50 $ no aliexpress e não fui tributado nem mesmo nos 17% de icms estadual, caso for acima de 50$ será tributado sim em 100%.... os \"especialistas\" vão falar que é somente 60% de imposto federal + 17% estadual... Mas na pratica tem tributação sobre o valor do produto + frete e cobrança do ICMS é feita sobre o valor do produto+frete+60% então isso leva aos famosos 100% de tributação pratica.Não sei se vale a pena a estratégia de juntar várias e enviar na mesma encomenda. A chance de ser tributado em 100% acredito que vai ser grande, mas é uma forma nova de tributar então vamos ter que testar pra ver como se comporta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 19, 2023, 08:27:48 PM",
      "body": "Dá uma olhada nesse tópico sabotag3x: https://bitcointalk.org/index.php?topic=5437556.msg61688908#msg61688908Eu ganhei num sorteio aqui do fórum mesmo e me enviaram dos EUA e fui taxado  Vou dar uma procurada aqui quanto paguei de imposto e posto mais tarde, mas já adianto que fazem alguns meses então acho que o imposto agora será maior",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 20, 2023, 12:04:22 AM",
      "body": "Quote from: Paredao on September 19, 2023, 08:02:23 PM*Obs: O Exportador do produto deverá fazer parte do programa Remessa. Senão vai ter que pagar o imposto de importação.Difícil ein. São pessoas físicas que vendem.Quote from: rdluffy on September 19, 2023, 08:27:48 PMEu ganhei num sorteio aqui do fórum mesmo e me enviaram dos EUA e fui taxado  Muito bonitas suas moedas! Esse é o problema, taxam até coisa que o cara recebe de graça.. Pelo visto vou ter que abandonar meu sonho e ficar apenas no mundo digital",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 20, 2023, 01:35:10 AM",
      "body": "Então, o @Paredao já deu uma prévia de como funciona e eu só gostaria de complementar que com a entrada dessa \"remessa conforme\" a maioria das importações de produtos vão passar direto pela alfândega após o sistema scanear o código do pacote.O que sobra? Uma minoria de pacotes vindo de outras fontes, então a Receita Federal vai conseguir focar melhor nesses pacotes \"clandestinos\", e até mesmo os que não tiverem valor comercial ou de fato enviados de pessoa fisica para pessoa física provavelmente também serão barrados para fiscalização.A regra dos 50 dólares é apenas para quem aderiu ao remessa conforme, certo?Demais produto importados tem que cuidar muito bem quanto ao valor do produto... se for considerado algo comercial, aí ferrou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 20, 2023, 11:41:31 AM",
      "body": "Quote from: rdluffy on September 19, 2023, 08:27:48 PMEu ganhei num sorteio aqui do fórum mesmo e me enviaram dos EUA e fui taxado  Esses dias eu fiquei pensando em fazer o sorteio de um item físico aqui na aba, tinha pensado em sortear um \"minerador\" ESP32 daqueles baratinhos mas entra no problema de que o ganhador tem que revelar nome, endereço... Dados sensíveis que eu acho que a maioria não quer revelar. No caso de sorteio internacional acho que é mais tranquilo pois o remetente está a milhares de quilômetros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 23, 2023, 12:27:34 AM",
      "body": "Quote from: sabotag3x on September 19, 2023, 07:15:51 PMAproveitando, também queria saber quanto custa o envio dos EUA/Europa para o Brasil para esses itens pequenos. Estava até pensando em deixá-las com alguém lá fora até juntar algumas e então pagar um frete só.Eu estou disponível para ajudar. Mas...Quote from: alegotardo on September 20, 2023, 01:35:10 AMA regra dos 50 dólares é apenas para quem aderiu ao remessa conforme, certo?Demais produto importados tem que cuidar muito bem quanto ao valor do produto... se for considerado algo comercial, aí ferrou.Como as encomendas entres particulares ficam? Também são abrangidos pela isenção dos 50$? Ou o risco de serem \"caçados\" é bem maior?Porque um particular, certamente não vai aderir a esse tal programa \"remessa conforme\".Ou, será que pode? O que é essa \"\"remessa conforme\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 23, 2023, 12:50:09 AM",
      "body": "Quote from: alegotardo on September 20, 2023, 01:35:10 AMA regra dos 50 dólares é apenas para quem aderiu ao remessa conforme, certo?Demais produto importados tem que cuidar muito bem quanto ao valor do produto... se for considerado algo comercial, aí ferrou.Sim... se for comprar algo no Aliexpress hoje, você ainda está participando da roleta entre ser taxado absurdamente ou passar sem taxas.Se comprar na Shein, já aparece a taxa do ICMS para ser paga naquele momento para compras < $50 e ICMS+II para compras > $50. Aí supostamente entra sem problemas no país.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 23, 2023, 01:57:32 AM",
      "body": "Quote from: joker_josue on September 23, 2023, 12:27:34 AMComo as encomendas entres particulares ficam? Também são abrangidos pela isenção dos 50$? Ou o risco de serem \"caçados\" é bem maior?Então, legalmente uma encomenda de pessoa física para outra pessoa física, desde que não ultrapasse os $ 50 e que não se seja visto como uma operação comercial, não pode ser taxado. A Remessa conforme nem se enquadra nesse fato, primeiro por que ela só se aplica para empresas e segundo porque as empresas precisam aderir ao programa, pedindo autorização ao governo e aguardando o aval para começar à operar.Mas, voltando ao seu assunto, mesmo estando tudo \"certinho\" sua engomenda ainda passará pelas fiscalização, agora com muito mais chances de ser sorteado, aberto e investigado se de fato o valor e o tipo do produto se enquadram nos $50 e uma operação \"não comercial\".Na minha opinião, aquelas empresas que fazem a redistribuição de compras do exterior estão com os dias contados, pois o negócio deles não deverá mais funcionar do jeito que os seus cliente precisam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 23, 2023, 01:39:13 PM",
      "body": "Quote from: joker_josue on September 23, 2023, 12:27:34 AMEu estou disponível para ajudar. Mas...Obrigado @joker_josue, lhe mandarei mensagem caso eu compre uma moeda de um europeu..Mas esse negócio do imposto me desanimou bastante.. essas moedas já são caras, com essa taxa do governo fica ainda mais difícil pensar em montar uma coleção",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 23, 2023, 06:03:27 PM",
      "body": "Quote from: sabotag3x on September 20, 2023, 12:04:22 AMMuito bonitas suas moedas! Esse é o problema, taxam até coisa que o cara recebe de graça.. Pelo visto vou ter que abandonar meu sonho e ficar apenas no mundo digital Obrigado, são bonitas mesmo    Só pra atuliazar aqui, eu consegui encontrar o PDF que paguei o impostoO user que me enviou, declarou 35 dólares e pagou 209 reais de freteEu paguei R$ 240,00 de imposto + 15 de serviços postais",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 23, 2023, 07:31:18 PM",
      "body": "Quote from: joker_josue on September 23, 2023, 12:27:34 AMComo as encomendas entres particulares ficam? Também são abrangidos pela isenção dos 50$? Ou o risco de serem \"caçados\" é bem maior?A isenção de 50 dólares de particular para particular continua existindo. É que nesses casos eles farão inspeções \"aleatórias\" para saber se aquela encomenda é realmente de particular para particular ou se alguma empresa está querendo burlar a norma da receita federal. Daí vai de como acontecerá a fiscalização e como estará o \"humor\" do fiscal no dia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 23, 2023, 09:03:26 PM",
      "body": "Quote from: Paredao on September 23, 2023, 07:31:18 PMA isenção de 50 dólares de particular para particular continua existindo. É que nesses casos eles farão inspeções \"aleatórias\" para saber se aquela encomenda é realmente de particular para particular ou se alguma empresa está querendo burlar a norma da receita federal. Daí vai de como acontecerá a fiscalização e como estará o \"humor\" do fiscal no dia.Nada que não resolva uma carta escrita a mão.  Será que ainda sou capaz, depois de escrever tanto aqui no fórum!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 23, 2023, 10:47:24 PM",
      "body": "Quote from: joker_josue on September 23, 2023, 09:03:26 PMNada que não resolva uma carta escrita a mão.  Novamente você está pensando demais do Brasil. Nenhuma carga dizendo que é um presente seria o suficiente para um fiscal de mal humor. Aliás, é impossível saber o que se passa na cabeça desses caras. Uma hora uma encomenda simploria é taxada em 120%, outra hora um item volumoso passa sem nenhuma taxa. Realmente uma roleta russa de respeito.As moedas colecionaveis que comprei passaram normalmente, mas a Ledger que ganhei em um concurso (presente) não foi nem mesmo aceita dentro do país.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "January 17, 2024, 07:43:14 PM",
      "body": "Uai, essa não entendi: \"CNI e CNC vão ao STF contra tarifa zero para imposto sobre importação\". Mas não é o Estado Malvadão e o Governo do Lula que queriam acabar com a isenção do imposto de importação para produtos abaixo de 50 dólares  Fiquei confuso ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "January 17, 2024, 08:35:58 PM",
      "body": "Quote from: Paredao on January 17, 2024, 07:43:14 PMUai, essa não entendi: \"CNI e CNC vão ao STF contra tarifa zero para imposto sobre importação\". Mas não é o Estado Malvadão e o Governo do Lula que queriam acabar com a isenção do imposto de importação para produtos abaixo de 50 dólares  Fiquei confuso ?Empresas no varejo em geral sempre foram a favor dessa tributação das pessoas físicas afinal de contas acaba sim gerando concorrência desleal quando estas tem acesso a produtos sem pagar imposto, considero inevitável essa tributação e este governo ou qualquer outro também é super a favor mas não quer impor ela de forma brusca para não se indispor com parte dos eleitores. Talvez se as entidades \"forçarem\" a aprovação fica mais tranquila de ser anunciada e o estado pareça menos malvadão",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "January 20, 2024, 08:21:25 PM",
      "body": "Quote from: rdluffy on September 23, 2023, 06:03:27 PM(...)Você faz importações pelo Alibaba ou somente pelo Aliexpress ?? É que estou querendo trazer um produto de um fabricante Chinês pelo Alibaba e não sei se eles também se adequaram ao Remessa Conforme. Eu sei que Aliexpress  se adequou. Será que também o Alibaba entrou no programa? É que vou importar diretamente de um fabricante. E o produto é bem baratinho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 20, 2024, 09:14:04 PM",
      "body": "Quote from: Paredao on January 20, 2024, 08:21:25 PMQuote from: rdluffy on September 23, 2023, 06:03:27 PM(...)Você faz importações pelo Alibaba ou somente pelo Aliexpress ?? É que estou querendo trazer um produto de um fabricante Chinês pelo Alibaba e não sei se eles também se adequaram ao Remessa Conforme. Eu sei que Aliexpress  se adequou. Será que também o Alibaba entrou no programa? É que vou importar diretamente de um fabricante. E o produto é bem baratinho.Paredao, só compro pelo Aliexpress, no Alibaba nunca compreiMas tem um detalhe, não são todos vendedores do Aliexpress que se adequaram ao remessa conforme, a maioria sim, mas ainda tem uns vendedores que não. Isso pode ser bom ou ruimPra conferir se o imposto já vai ser pago pelo remessa conforme é só simular a compra e no final vai aparecer o valor do imposto. Se não aparecer é porque o vendedor envia sem o remessa conformeE se ele enviar sem o remessa conforme, ainda vai pelas regras antigas: declara o valor e pode ou não ser tributado e o fiscal da receita pode ou não acreditarQualquer coisa pode me perguntar, e também recomendo falar com o vendedor caso tenha alguma dúvida ou pedido pois geralmente eles sabem o que fazerEdit: inclusive se quiser ajuda com a compra é só me falar que vejo pra você",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 20, 2024, 11:29:43 PM",
      "body": "Quote from: Paredao on January 20, 2024, 08:21:25 PMVocê faz importações pelo Alibaba ou somente pelo Aliexpress ?? É que estou querendo trazer um produto de um fabricante Chinês pelo Alibaba e não sei se eles também se adequaram ao Remessa Conforme. Eu sei que Aliexpress  se adequou. Será que também o Alibaba entrou no programa? É que vou importar diretamente de um fabricante. E o produto é bem baratinho.Será de notar que a Alibaba e Aliexpress são a mesma empresa. Então como plataforma eles estão preparados para que os vendedores realmente sigam essas normativas. Vai depois depender do vendedor.Apesar de nunca ter comprado no Alibaba, já tive algumas interações com vendedores lá, e pela minha experiencia costuma dar um bom suporte. Então será uma questão de falares com o vendedor em questão e verificar a situação.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}