{
  "id": "topic_5476505",
  "title": "Mookis123",
  "author": "Mookis123",
  "created_time": "December 04, 2023, 02:25:13 PMLast edit: December 04, 2023, 07:03:36 PM by Mookis123",
  "content": "My experience with chips. New player, won around 25k. Would not let me withdraw. I filed a complaint at casinoguruCheck my complainthttps://casino.guru/chips-gg-casino-player-unable-to-withdraw-winnings",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476505",
  "comments": [
    {
      "author": "Mahdirakib",
      "created_time": "December 04, 2023, 03:50:58 PMLast edit: December 04, 2023, 07:17:30 PM by Mahdirakib",
      "body": "I think you aren't going to get any help from here as the representative of Chips.gg isn't active on Bitcointalk forum. They haven't made any post here since the December month of 2022. We have seen a few many scam accusations against them in this year, but none of them were resolved.Quote from: Mookis123 on December 04, 2023, 02:25:13 PMCheck my complaint ~Or my reddit post if you can't see all the messages on the thread from casino guruChips.gg team has made their post private on Casino Guru. So, it isn’t possible for any of us to read and verify their judgement. And you haven't added any additional details or proof on the reddit post. It will be helpful to realize your issues easily if you add some evidences in your main post here in the forum.Quote from: Mookis123 on December 04, 2023, 03:16:53 PM~snip~I don't know whether Casino Guru directly sends emails to the victims or not. But it is true that Chips.gg has lost their gambling license a few months ago.Quote from: Mookis123 on December 04, 2023, 04:12:50 PM~snip~I have checked all the screenshots, but it is enough to make this two screenshot visible here. ~snip~ There are a lot of red signals. I'm aware about the conflicts of the owners of Chips.gg, efialtis has published an article about this when Chips.gg was down for maintenance: Chips.gg Casino Plunges into Chaos: Co-Founder Accusations and Unexpected MaintenanceI would like to mention @holydarkness here to know his opinion about this specific case.@Pmalek, if the above claim and statements are true then I will remove them from the KYC details and bonus details thread. I think you would like to remove them from your withdrawal lists thread too.Note: I have edited the posts, removed the images and merged my two replies together for the request of the OP. @holydarkness @Pmalek, you may send me a PM if you are still interested to know the issues. Otherwise, you can check the posts through Ninjastic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 05, 2023, 05:07:43 PM",
      "body": "Judging by OP's post on CasinoGuru, they unlocked her account and allowed her to withdraw. If she did and got all of her money, the scam accusation is resolved. @Mookis123 can you provide some more information what you were allowed to withdraw? It also seems that you gambled during the time your account was locked. Did you gamble away all the winnings?But another more serious issue exists, and that's the claims that have been made that Mahdirakib talked about. @Mahdirakib I have seen the screenshots. I am not going to comment on their content because the whistleblower doesn't want that. But if you want the information deleted from scrappers, someone should get in contact with LoyceV and TryNinja. They also need to do their thing to get rid of everything. I am sure you know what I am saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 05, 2023, 05:12:58 PM",
      "body": "OP, do I understand that you've managed to made your withdrawal in full? So they're not making you having any financial loss? As such, unfortunately, a flag or a feedback can not be raised against them. Flag for the obvious reason that the clauses in that flag are not correct, and feedback as there's no reference to tie them into a specific point that justifies the feedback.Quote from: Mahdirakib on December 04, 2023, 03:50:58 PM[...]I would like to mention @holydarkness here to know his opinion about this specific case. [...]Thank you for bringing this situation and what happened into my awareness. To be completely honest, we're in a tight situation here. In one side, a warning should be made so forum members and visitors can proceed with caution, however, on the other side, taking any action that our trust system offers will be a violation toward the guidelines, as stated above.I think the best approach for this, at least for the time being, will be to remove them from both of your threads so any \"publication\" about them will be minimal. Do you both mind to do this, mahdirakib, Pmalek? Another approach I can imagine to safeguard the community will be to make a slight alteration on both of your thread [though I can understand if any of you are reluctant to do so], that instead of removing their entry, you add a \"be advised to reconsider playing in this casino\" and the likes?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mookis123",
      "created_time": "December 05, 2023, 05:18:07 PM",
      "body": "I wasn't allow to withdraw for a week.the casino suport wasn't answering at all to my questions. I deposited 9k. I was left with around 400bucks. Last hand I bet all the money on ct. It hit crazy time 10x.i couldn't believe my eyes. I hit the 250x flapper. I was the biggest winner for that round.. They instantly blocked my withdrawal. Only after I made a complaint on casinoguru was I allowed to withdraw only my 9k deposited.Obviously the rest of the money I did indeed lose. It's about that they blocked my withdrawal instantly after winning, not letting me withdraw even 10 bucks. I knew that they intentionally blocked my withdrawal in order for me to lose the money but I couldn't prove anything until yesterday when the whistle-blower came out with those screenshots which currently I can't show because he risks losing his job. The  time for those will come. This is not about recovering my money and it's about raising awareness about chips.gg and how scamming they are. I had to delete my reddit post and the screenshots because the whistle-blower asked me to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 05, 2023, 05:34:23 PM",
      "body": "Quote from: Mookis123 on December 05, 2023, 05:18:07 PMI wasn't allow to withdraw for a week.the casino suport wasn't answering at all to my questions. I deposited 9k. I was left with around 400bucks. Last hand I bet all the money on ct. It hit crazy time 10x.i couldn't believe my eyes. I hit the 250x flapper. I was the biggest winner for that round.. They instantly blocked my withdrawal. Only after I made a complaint on casinoguru was I allowed to withdraw only my 9k deposited.Obviously the rest of the money I did indeed lose. It's about that they blocked my withdrawal instantly after winning, not letting me withdraw even 10 bucks. I knew that they intentionally blocked my withdrawal in order for me to lose the money but I couldn't prove anything until yesterday when the whistle-blower came out with those screenshots which currently I can't show because he risks losing his job. The  time for those will come. This is not about recovering my money and it's about raising awareness about chips.gg and how scamming they are. I had to delete my reddit post and the screenshots because the whistle-blower asked me to. Wait umm... I think I missed these details from your story. So you deposited 9,000 USD, you lose 8,600, then you bet on crazy time and make roughly 24,000 but they forfeited it and only entitle you for 9,000? Did they ever explain to you why they forfeited the other 15,000?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mookis123",
      "created_time": "December 05, 2023, 05:59:30 PM",
      "body": "Well yes. I still have the screenshots of my win. Not forfeited. The money were in my balance. They just wouldn't let me withdraw the money. The screenshots of chips employee chat group will explain how they intentionally wouldn't let me withdraw because new players don't usually win 24k. I had opened my account maybe few hours",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 05, 2023, 06:19:38 PM",
      "body": "Quote from: Mookis123 on December 05, 2023, 05:59:30 PMWell yes. I still have the screenshots of my win. Not forfeited. The money were in my balance. They just wouldn't let me withdraw the money. The screenshots of chips employee chat group will explain how they intentionally wouldn't let me withdraw because new players don't usually win 24k. I had opened my account maybe few hours That's their only explanation? That new players usually don't win 24,000? No violation of any rules? Can you make or do you have a screenshot showing that the rest of the balance can not be withdrawn?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "December 05, 2023, 06:51:58 PM",
      "body": "Quote from: Pmalek on December 05, 2023, 05:07:43 PMIt also seems that you gambled during the time your account was locked. Did you gamble away all the winnings? ~~snip~ They also need to do their thing to get rid of everything. I am sure you know what I am saying.Seems like OP doesn't have any funds stuck on Chips.gg now. He was allowed to withdraw his deposit, but Chips.gg didn't allow him to withdraw his winnings. Eventually, he lost his winnings by placing more bets.BTW, I got your point, but let's leave it like this.Quote from: holydarkness on December 05, 2023, 05:12:58 PMI think the best approach for this, at least for the time being, will be to remove them from both of your threads so any \"publication\" about them will be minimal. Do you both mind to do this, mahdirakib, Pmalek? I would like to remove them from my thread. It is not for this case only. I have witnessed unprofessional behaviour from Chips.gg team when I was inquiring about their license details in the September month. Moreover, their representative hasn't made any post in this year, and there was conflict between the owners a few months ago. I hope Pmalek will also make a perfect decision by judging all these facts (including OP's issue).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mookis123",
      "created_time": "December 05, 2023, 06:52:17 PM",
      "body": "There's no balance anymore. Only screenshots I have are those from the employee chat group and how they became aware of my win and plotting to intentionally block my withdrawals. Also muting my chat because I asked about withdrawals. As mentioned, I still can't show the screenshots until the whistle-blower gives me the ok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 05, 2023, 07:10:27 PM",
      "body": "Quote from: Mookis123 on December 05, 2023, 05:18:07 PMLast hand I bet all the money on ct. It hit crazy time 10x.i couldn't believe my eyes. I hit the 250x flapper. I was the biggest winner for that round.. They instantly blocked my withdrawal. Only after I made a complaint on casinoguru was I allowed to withdraw only my 9k deposited. Obviously the rest of the money I did indeed lose. Please take a look at the bolded part. Can you confirm if you lost that money by gambling? I already asked this in my previous post, but you didn't respond in a clear manner. So, I am asking again: After they blocked your withdrawals after your 250x win on Crazy Time, did you bet and lost everything except the $9.000 that you later withdrew? @Mahdirakib, @holydarknessI am probably going to post negative feedback on their forum account and they will obviously be removed from by threads. I would love to hear their side of the story, but I don't think we will hear it. The only things we have is the mediator at Casino Guru and the whistleblower sharing what he knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mookis123",
      "created_time": "December 05, 2023, 07:21:37 PM",
      "body": "Yes I did. I only withdrawn my initial deposit of 9k and gambled the rest. I only want to raise awareness for people who think will win on chips and they'll be able to withdraw.I also received a screenshot of a dude who won 147k on money train 2 on 20$ bet and chips claimed malfunction.My withdrawal shouldn't have been blocked for a week seconds after I won on crazy time. That's what this is about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "December 05, 2023, 07:33:18 PM",
      "body": "Quote from: Mookis123 on December 05, 2023, 07:21:37 PM.I also received a screenshot of a dude who won 147k on money train 2 on 20$ bet and chips claimed malfunction.if it is possible, would you mind getting in contact with the person who won 147k and ask if it is ok to share his/her store here in the forum? chips.gg's action regarding your issue is extremely concerning. As some members have already expressed, a warning should be posted against the casino to warn gamblers of their shady behavior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mookis123",
      "created_time": "December 05, 2023, 07:51:35 PM",
      "body": "I asked the guy in question to post here if he's comfortable. His win of 147k, they claimed it a malfunction. The whistle-blower told me that I'm not the only one who's withdrawal has been blocked after winning big. They do this on a regular basis but unfortunately we can't do anything about it because they have no license. I'm well aware that my money is gone but maybe I can help other players not to gamble there. Hopefully soon I can share the screenshots",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 05, 2023, 09:12:28 PM",
      "body": "Quote from: Pmalek on December 05, 2023, 07:10:27 PM[...]@Mahdirakib, @holydarknessI am probably going to post negative feedback on their forum account and they will obviously be removed from by threads. I would love to hear their side of the story, but I don't think we will hear it. [...]I am leaving a tag with this post as reference, the situation kinda changed when they refused OP's winning, only allowed her the deposit amount although there's no clear [or even unclear] abuse by OP that warrant any confiscation.I was previously uncertain and shied away from a tag because if OP got her withdrawal in full, then there's no scam happen, and though the risk of financial loss looms very closely from the other fact, it'll be a hearsay because [up to this post was made] we can't exactly publicly provide the prove of it.Given the recent fact that's now made clear to me, I think a negative tag is justified. If anyone feel a doubt and think the negative feedback is too heavy, please reach me through PM, I'll explain the whole circumstances behind this situation.Quote from: Mookis123 on December 05, 2023, 07:51:35 PMI asked the guy in question to post here if he's comfortable. His win of 147k, they claimed it a malfunction. The whistle-blower told me that I'm not the only one who's withdrawal has been blocked after winning big. They do this on a regular basis but unfortunately we can't do anything about it because they have no license. I'm well aware that my money is gone but maybe I can help other players not to gamble there. Hopefully soon I can share the screenshots Please do, but only if he's comfortable sharing his situation. If he has not cleared his balance with loses and still got some of his winnings confiscated, I think a flag can be argued, given a clause where a contract [either written or implicit] was breached when they deny the winning for no justifiable reason, and they did not make the victim whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 06, 2023, 04:12:03 PM",
      "body": "Quote from: Mookis123 on December 05, 2023, 07:21:37 PMYes I did. I only withdrawn my initial deposit of 9k and gambled the rest. OK, thanks for confirming it. In that case we can't say that the casino owns you anything. They did own you the winnings at the time when your withdrawals were locked, but sadly you lost everything you won on other games. Casino Guru has confirmed they are investigating the case with their most recent post in your topic.I am tagging Chips.gg as a warning for anyone thinking of playing there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mookis123",
      "created_time": "December 07, 2023, 09:17:53 AM",
      "body": "I'm not looking for money. Again, just to raise awareness about people who want to play there. They shouldn't have blocked my withdrawal for a week in the first place. They should've let me withdraw the full amount on the day I won.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BabyBandit",
      "created_time": "December 07, 2023, 09:32:59 AMLast edit: December 07, 2023, 09:43:02 AM by BabyBandit",
      "body": "Have I have missed some obvious proof? I cant see a single oneQuote from: Mookis123 on December 04, 2023, 02:25:13 PMMy experience with chips. New player, won around 25k. Would not let me withdraw. I filed a complaint at casinoguruCheck my complainthttps://casino.guru/chips-gg-casino-player-unable-to-withdraw-winningsAre you behind Casino.guru yourself? - https://bitcointalk.org/index.php?topic=5467332.0- https://bitcointalk.org/index.php?topic=5468477.0- https://bitcointalk.org/index.php?topic=5467332.0It's many many more...Quote from: Mookis123 on December 05, 2023, 05:18:07 PMI wasn't allow to withdraw for a week.the casino suport wasn't answering at all to my questions. I deposited 9k. I was left with around 400bucks. Last hand I bet all the money on ct. It hit crazy time 10x.i couldn't believe my eyes. I hit the 250x flapper. I was the biggest winner for that round.. They instantly blocked my withdrawal. Only after I made a complaint on casinoguru was I allowed to withdraw only my 9k deposited.Obviously the rest of the money I did indeed lose. It's about that they blocked my withdrawal instantly after winning, not letting me withdraw even 10 bucks. I knew that they intentionally blocked my withdrawal in order for me to lose the money but I couldn't prove anything until yesterday when the whistle-blower came out with those screenshots which currently I can't show because he risks losing his job. The  time for those will come. This is not about recovering my money and it's about raising awareness about chips.gg and how scamming they are. I had to delete my reddit post and the screenshots because the whistle-blower asked me to. If this is true, it's disgusting.. that's if.@holydarkness @PmalekWait... you gave a user negative feedback because of this thread? This is 0 proof that anything have happen. This is as far away how a proper Feedback-system should work. 😲So if someone creating an account, accuse an account it's free to give that user negative feedback? This was something new...And it's ridiculous I need to say this but users here has no limits: and of course I don't take any side in this. I am all for justice, but leaving this feedback is everything else then justice. I even had you (Pmalek) In my Trust-list before this and still have.. so please, could you explain the reason for this for someone that don't understand the feedback system?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 07, 2023, 09:56:58 AM",
      "body": "Quote from: BabyBandit on December 07, 2023, 09:32:59 AMHave I have missed some obvious proof? I cant see a single one[...]If this is true, it's disgusting.. that's if.Yes, you do. Try to look deeper.Quote from: BabyBandit on December 07, 2023, 09:32:59 AM@holydarkness @PmalekWait... you gave a user negative feedback because of this thread? This is 0 proof that anything have happen. This is as far away how a proper Feedback-system should work. 😲So if someone creating an account, accuse an account it's free to give that user negative feedback?  😆 This was something new...And it's ridiculous I need to say this but users here has no limits: and of course I don't take any side in this. I am all for justice, but leaving this feedback is everything else then justice. I even had you (Pmalek) In my Trust-list before this.  There are proof, and I assure you that the feedback I left was not without a thorough consideration and proper wording to touch the situation relevantly, and provable [pun intended]. I'd like to see myself as one that's not light-handed on feedback, that when I left feedbacks, they'll have a good reason behind them, I am not handing feedback like candy on Halloween. As such, I'd like to help you understand how this is proper [at least as far as I think it is], but to do that, I'll need your help to understand from your side, how is it improper and everything else but justice?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BabyBandit",
      "created_time": "December 07, 2023, 10:09:34 AM",
      "body": "Quote from: holydarkness on December 07, 2023, 09:56:58 AMQuote from: BabyBandit on December 07, 2023, 09:32:59 AMHave I have missed some obvious proof? I cant see a single one[...]If this is true, it's disgusting.. that's if.Yes, you do. Try to look deeper.Quote from: BabyBandit on December 07, 2023, 09:32:59 AM@holydarkness @PmalekWait... you gave a user negative feedback because of this thread? This is 0 proof that anything have happen. This is as far away how a proper Feedback-system should work. 😲So if someone creating an account, accuse an account it's free to give that user negative feedback?  😆 This was something new...And it's ridiculous I need to say this but users here has no limits: and of course I don't take any side in this. I am all for justice, but leaving this feedback is everything else then justice. I even had you (Pmalek) In my Trust-list before this.  There are proof, and I assure you that the feedback I left was not without a thorough consideration and proper wording to touch the situation relevantly, and provable [pun intended]. I'd like to see myself as one that's not light-handed on feedback, that when I left feedbacks, they'll have a good reason behind them, I am not handing feedback like candy on Halloween. As such, I'd like to help you understand how this is proper [at least as far as I think it is], but to do that, I'll need your help to understand from your side, how is it improper and everything else but justice?\"Please be very cautious when deciding to play on this platform, know that your winnings might be non-withdrawable for no reason or explanation from them\"This is your opinion & Your REF link is opinion. And what you saying in the post that is your REF-link is most man guessing. I don't doubt your intention my friend, but right should be right whoever stand on the other side.Your feedback is based on your opinions and not any proof. You should look deeper yourself to find real proofs and not just sayings. If GG has scammed he/she should be burned alive ye but this thread (that is the reason for both you to give him negative feedback) don't have any proofs of what OP claims.But maybe you hadn't left feedback for a couple of days and your fingers started to itch.   This Feedback-addiction in the forum is ____.  God luck in your digging!  I believe in you. 💪- Regards BabyB. 👼",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}