{
  "id": "topic_5401688",
  "title": "ANSEL_2.0",
  "author": "ANSEL_2.0",
  "created_time": "June 07, 2022, 02:04:32 PM",
  "content": "What is happening around Helium mining lately? All my youtube page is full of helium mining complains even from popular crypto YouTubers , is there anything wrong with the Helium project or it's just the mining profit that got fucked up real bad.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401688",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 07, 2022, 11:49:35 PM",
      "body": "Not a fan, but I did try to research about it sometime back. What kind of complaints are you seeing on YouTube?If it used to be profitable and the mining profits have been fucked up lately, then that's expected. You know what happens to all those promising projects especially during a bear market. I wonder what the once diehard Chiacoin folks are up to right now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 08, 2022, 10:56:22 AM",
      "body": "Quote from: ANSEL_2.0 on June 07, 2022, 02:04:32 PMWhat is happening around Helium mining lately? All my youtube page is full of helium mining complains even from popular crypto YouTubers , is there anything wrong with the Helium project or it's just the mining profit that got fucked up real bad.It really is like that from quite some time that Helium is not profitable anymore.I was interested to mine it but when I saw the stats,how many devices were needed to work contemporary to mine it became crystal clear to me that this project is not going to work and I stopped there.Helium was created to be mined by radio waves but so far is not having any success and it most probably will not also in the future.The calculator says if you have a few devices make like 5.03 USD a month which I believe is why the Youtubers are complaining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "a1 Hashrate LLC2022",
      "created_time": "June 08, 2022, 03:14:50 PM",
      "body": "Location is key. I have 2 units I earned 13.53 coins about 146.50 bucks. Outlay was around 500+500+200200 in better antennas .the unit with the best location will break even in 16-17 monthsthe unit with the lesser location will break even in 36-37 months.the bigger problem is not the amount of coins earned the problem is price was over 20 a coin and is now about 10 a coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VRExpress",
      "created_time": "June 08, 2022, 04:08:10 PM",
      "body": "Quote from: a1 Hashrate LLC2022 on June 08, 2022, 03:14:50 PMLocation is key. I have 2 units I earned 13.53 coins about 146.50 bucks. Outlay was around 500+500+200200 in better antennas .the unit with the best location will break even in 16-17 monthsthe unit with the lesser location will break even in 36-37 months.the bigger problem is not the amount of coins earned the problem is price was over 20 a coin and is now about 10 a coin.At this point every miners should hold their coins instead because selling now is literally throwing money away, a project like helium will surely survive and have a better value in the future, truthfully Helium miners shouldn't be complaining because that miner hardly take any significant power from wall, a 220ah battery will power two helium miners for almost 48hours without charging. Are you guys kidding me?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "a1 Hashrate LLC2022",
      "created_time": "June 08, 2022, 05:48:08 PM",
      "body": "Quote from: VRExpress on June 08, 2022, 04:08:10 PMQuote from: a1 Hashrate LLC2022 on June 08, 2022, 03:14:50 PMLocation is key. I have 2 units I earned 13.53 coins about 146.50 bucks. Outlay was around 500+500+200200 in better antennas .the unit with the best location will break even in 16-17 monthsthe unit with the lesser location will break even in 36-37 months.the bigger problem is not the amount of coins earned the problem is price was over 20 a coin and is now about 10 a coin.At this point every miners should hold their coins instead because selling now is literally throwing money away, a project like helium will surely survive and have a better value in the future, truthfully Helium miners shouldn't be complaining because that miner hardly take any significant power from wall, a 220ah battery will power two helium miners for almost 48hours without charging. Are you guys kidding me?.I have zero problems with it. I will mine on as these 2 burn under 1kwatt every 2 days. Or about 180 kwatts a year which is only 36 bucks a year at 20 cent power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "June 08, 2022, 09:45:43 PM",
      "body": "Seems like it's just a way to get people to buy their hardware.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "a1 Hashrate LLC2022",
      "created_time": "June 08, 2022, 10:57:09 PM",
      "body": "Quote from: JayDDee on June 08, 2022, 09:45:43 PMSeems like it's just a way to get people to buy their hardware.well over 800000 x 500 = 400 million in sales plus antennas.They have some involvement with direct TV investing so it may be a better way to do direct tv down the road.I would not be getting more units than my 1200 worth of gear. If price goes back to $25 could be a good item.Time will tell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 09, 2022, 11:13:39 PM",
      "body": "Quote from: VRExpress on June 08, 2022, 04:08:10 PMAt this point every miners should hold their coins instead because selling now is literally throwing money away, a project like helium will surely survive and have a better value in the future, truthfully Helium miners shouldn't be complaining because that miner hardly take any significant power from wall, a 220ah battery will power two helium miners for almost 48hours without charging. Are you guys kidding me?.The problem with most people is that they are only looking at the profit part when the market is good. They never always consider mining when it's a bear market so those who were not prepared will definitely sell off their coins at a giveaway price, others will even give up on the venture",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nsummy",
      "created_time": "June 11, 2022, 06:31:22 AM",
      "body": "When I looked into it last year, I thought it was definitely interesting.  The giant problem seemed to be getting ahold of the hardware.  It seemed like dealing with the hardware manufacturers was a borderline scam.  The hardware used has to be pre-approved, and the only pre-approved hardware was basically a router based on a $35 raspberry pi compute module.  They would then mark it up hundreds of dollars.  You would then have to pre-order and wait months while hoping you actually got it.  Not sure if Helium is an outright scam or something they truly want to see happen...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}