{
  "id": "topic_5458216",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "July 01, 2023, 10:21:04 AM",
  "content": "A short article from yesterday. It doesn't really say why, in SEC's opinion, application filling was inadequate, but I think it's obvious that SEC just doesn't want spot BTC ETF to happen.I think the price actually dropped by almost 4%, but rebounded back to above 30k levels, so no major impact as of yet.Bitcoin Drops After Report SEC Says BlackRock Spot Bitcoin ETF Filing Inadequatehttps://www.barrons.com/articles/bitcoin-ethereum-price-crypto-markets-today-58d478b2QuoteBitcoin dropped Friday following a report that the Securities and Exchange Commission said filings for a spot Bitcoin exchange-traded fund from BlackRock and others—which have recently buoyed crypto prices—were inadequate.The price of Bitcoin has dropped 1.5% over the past 24 hours to $30,250. The largest crypto fell from $31,000 to as low as $29,600 after The Wall Street Journal reported, citing anonymous sources, that the SEC has said a recent wave of applications to launch ETFs that hold spot Bitcoin, or the token itself, were inadequate.(...)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458216",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "July 01, 2023, 01:25:53 PM",
      "body": "The reason is actually trivial as it seems from what can be read in the explanation - and it is that BlackRock did not in the opinion of the SEC cite one important piece of information for them. And the fact that the price has dropped a bit just means that there are a lot of stupid people who have no idea what's really going on - the same as the author of the article from which you constructed this post.https://bitcointalk.org/index.php?topic=178336.msg62483259#msg62483259",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 02, 2023, 11:11:54 AM",
      "body": "The Securities and Exchange Commission (SEC) are merely an instrument for politicians to garner support for their US elections. We know a lot of successful Fiat companies are funding politician's election campaigns and they will use that leverage over the politicians to squash their competition. (which is Crypto currencies)The world is governed by the \"entities\" with the deepest pockets to keep these politicians in power. BlackRock and Vanguard might not be funding these politicians, so their applications will be sabotaged. The only \"inadequate\" party to this decision, is the decision makers with their hidden agendas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "July 06, 2023, 10:12:05 PM",
      "body": "Would it be fair to say that Black Rock submitted the filing with these motives, given with the reason of denial?:- To see the market effect of an ETF announcement, paired with EDX Markets news - To see if the known lack of information would be the only reason the SEC has to deny the application Technically, it is an easy solve. Finish EDX Markets, nominate this as the surveillance-sharing exchange, re-file ETF?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "July 07, 2023, 03:23:59 PM",
      "body": "Looks like the reports of the reason for rejection being trivial are right, as BlackRock has already re-filed their application as reported by CNBC (video):https://www.cnbc.com/video/2023/07/05/blackrock-refiles-spot-bitcoin-etf-binance-us-market-share-crypto-world.htmlI hear almost 100% of their past ETF application received approval, so things are looking quite good. Lets see how will this one pan out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "July 08, 2023, 05:18:09 AM",
      "body": "Quote from: pawel7777 on July 07, 2023, 03:23:59 PMLooks like the reports of the reason for rejection being trivial are right, as BlackRock has already re-filed their application as reported by CNBC (video):https://www.cnbc.com/video/2023/07/05/blackrock-refiles-spot-bitcoin-etf-binance-us-market-share-crypto-world.htmlI hear almost 100% of their past ETF application received approval, so things are looking quite good. Lets see how will this one pan out.Their track record is great but is this really a valid metric to go from, considering Bitcoin is a completely new kind of asset class that has faced regulatory, publicity and government scrutiny since its inception?I think justifying the odds of approval based on the track record is not an accurate way to do so. It's still possible that the SEC will turn around and say they are not ready yet, or come up with some reason to delay. I'd say the odds are 65/35 in favor for imminent approval, all things considered. I think more regulation must come in first and delay due to that feels probable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "July 08, 2023, 07:37:44 AM",
      "body": "Quote from: BenCodie on July 08, 2023, 05:18:09 AMTheir track record is great but is this really a valid metric to go from, considering Bitcoin is a completely new kind of asset class that has faced regulatory, publicity and government scrutiny since its inception?I think justifying the odds of approval based on the track record is not an accurate way to do so. It's still possible that the SEC will turn around and say they are not ready yet, or come up with some reason to delay. I'd say the odds are 65/35 in favor for imminent approval, all things considered. I think more regulation must come in first and delay due to that feels probable.I think the general idea is that, given its size, position and connections, BlackRock would not bother filing their application if they didn't know that it'll likely get approved.I would imagine that people at the very top of the food chain know each other, or are at least closely connected, to the point they could discuss any future moves informally, over a cup of coffee, before doing that officially.In other words, if SEC had an unwritten rule that no BTC spot ETF will ever get approval, then giants like BlackRock would probably know about it from their unofficial channels.And it's kind of telling that they haven't filed for BTC ETF until now, despite Bitcoin being around for 14 years. I'm sure they could spot an opportunity much earlier on, but for some reason, they didn't make a move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "July 08, 2023, 10:03:32 AM",
      "body": "Quote from: pawel7777 on July 08, 2023, 07:37:44 AMQuote from: BenCodie on July 08, 2023, 05:18:09 AMTheir track record is great but is this really a valid metric to go from, considering Bitcoin is a completely new kind of asset class that has faced regulatory, publicity and government scrutiny since its inception?I think justifying the odds of approval based on the track record is not an accurate way to do so. It's still possible that the SEC will turn around and say they are not ready yet, or come up with some reason to delay. I'd say the odds are 65/35 in favor for imminent approval, all things considered. I think more regulation must come in first and delay due to that feels probable.I think the general idea is that, given its size, position and connections, BlackRock would not bother filing their application if they didn't know that it'll likely get approved.I would imagine that people at the very top of the food chain know each other, or are at least closely connected, to the point they could discuss any future moves informally, over a cup of coffee, before doing that officially.In other words, if SEC had an unwritten rule that no BTC spot ETF will ever get approval, then giants like BlackRock would probably know about it from their unofficial channels.And it's kind of telling that they haven't filed for BTC ETF until now, despite Bitcoin being around for 14 years. I'm sure they could spot an opportunity much earlier on, but for some reason, they didn't make a move.That's definitely a fine way to look at it and by no means would I argue with that. I think another way to look at it, would be greed. BlackRock, like other firms, are in it for the wealth. Bitcoin is clearly here to stay, the halving clearly provides fruits, it's clearly underpriced, and its so liquid that multiplications of very large amounts of capital is possible. Though would the SEC or the US Government allow corporate conglomerates like Black Rock to gain so much more power, while they fall short on the opportunity? I think despite this it's definitely a matter of when and not if for the approval, but some form of benefit must be created for the government bodies if it is to go forward. Right now it just seems like corporations will benefit the most. So, there might be some delays (which ultimately provide another buying opportunity from the negative press) before it's given the go ahead.Only time will tell anyway, and either way the fact that it is a \"when not if\" situation is good for us all!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 08, 2023, 05:33:15 PM",
      "body": "It is certain that BlackRock will not waste their time submitting requests unless they have prepared well for this step and calculated the rejection and response to it as well. If there were legal impediments, they would not have risked their time and reputation, but most likely the SEC wants to manipulate these requests and try to procrastinate to create confusion in the market or perhaps To get some money from these companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "July 08, 2023, 06:08:31 PM",
      "body": "Quote from: pawel7777 on July 07, 2023, 03:23:59 PMLooks like the reports of the reason for rejection being trivial are right, as BlackRock has already re-filed their application as reported by CNBC (video):https://www.cnbc.com/video/2023/07/05/blackrock-refiles-spot-bitcoin-etf-binance-us-market-share-crypto-world.htmlI hear almost 100% of their past ETF application received approval, so things are looking quite good. Lets see how will this one pan out.Let's see where this goes. Yes, exciting on the one hand, on the other hand if it really does get approved it is just another brick in the massive building that defines Bitcoin's future.Suprised they would mess up such a tiny detail on their first submission, but oh well, not much harm done I guess (except for some funds burned in the process).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "July 10, 2023, 02:43:24 PM",
      "body": "It's funny how SEC and regulation have taken center stage to shape cryptocurrencies direction... and with all this happeing I would have said we don't them but unfortunately big money of today wants to work with regulated instruments to protect themselves incase of anything. But whatever SEC is cooking,  BlackRock should  be more than prepared to see this through...Quote from: pawel7777 on July 07, 2023, 03:23:59 PMLooks like the reports of the reason for rejection being trivial are right, as BlackRock has already re-filed their application as reported by CNBC (video):https://www.cnbc.com/video/2023/07/05/blackrock-refiles-spot-bitcoin-etf-binance-us-market-share-crypto-world.htmlI hear almost 100% of their past ETF application received approval, so things are looking quite good. Lets see how will this one pan out.Then this is not only good news for Blackrock but the entire cryptospace!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 10, 2023, 02:54:03 PM",
      "body": "But wait!!!!!!!!!!!!!For weeks I've been told that the whole attack on Binance is orchestrated by the Wall Street whales behind Blackrock to push Binance out of the US once through their pawns and puppets in the SEC.So, what's going to happen to the tin foil industry, going bankrupt?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "July 10, 2023, 10:12:30 PM",
      "body": "Quote from: Woodie on July 10, 2023, 02:43:24 PMThen this is not only good news for Blackrock but the entire cryptospace!I'm not sure how I feel about BTC price potentially being dictated by institutional investors trading ETFs. This isn't quite the direction early bitcoiners were aiming for, but time will tell.Quote from: stompix on July 10, 2023, 02:54:03 PMBut wait!!!!!!!!!!!!!For weeks I've been told that the whole attack on Binance is orchestrated by the Wall Street whales behind Blackrock to push Binance out of the US once through their pawns and puppets in the SEC.So, what's going to happen to the tin foil industry, going bankrupt?What does Binance have to do with BlackRocks's filing for ETF and how does this prove SEC is not trying to push Binance out of US? Wrong thread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}