{
  "id": "topic_5437058",
  "title": "Socrvtes",
  "author": "Socrvtes",
  "created_time": "January 27, 2023, 11:35:02 PM",
  "content": "N.B. : I am not a devHello everyone, I’m just a random guy doing some research about Bitcoin. I ask some help for one thing : If Satoshi did a “ Peer to Peer Electronic Cash System “, based on a decentralized system “ which provides strong control of ownership “, it certainly comes with a way to keep your bitcoin safe INCLUDED in the Bitcoin protocol/Bitcoin Core ? (N.B.). What makes me think that, is : First, he had to detain some Bitcoins. Same for the first miners and receivers.From there : Satoshi only wanted to build this P2P ECS, and the economy/detention was not a question for him/her/them/Cypherpunk(s) ? I know that if you have your key, you have access to your Bitcoin. But something is wrong for me…. How was it possible to have bitcoin, except from mining or receiving  ?I read a lot that the only way to have some, in the early era (and still), was to buy them on a CEX.How and why did people start to give their keys ?I mean, I can't sleep anymore since the moment I understood that all the first “ Crypto GODS “, after research,  had certainly understood that they can’t touch/manipulate Bitcoin, but can manipulate people's minds. Telling them, send me $, i'll buy and keep your funds to make some profit of it, until the day you ask me for it. ( it sounds like an old song).I also tried to find something that could allow me to not only own my BTC, but to send/hodl/buy/sell it by my OWN way. Very often I found that you must have to give your keys at a moment, and then, still have trust... (N.B.)I know that I have a lot of questions, so I spend all my daytime to know more about Bitcoin. Maybe someone can send me a link, a book or anything that could help me. Thank you to everyone for your time. scio me nihil scire.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437058",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "January 28, 2023, 05:13:30 AM",
      "body": "Quote from: Socrvtes on January 27, 2023, 11:35:02 PMI also tried to find something that could allow me to not only own my BTC, but to send/hodl/buy/sell it by my OWN way. Very often I found that you must have to give your keys at a moment, and then, still have trust... (N.B.)Centralized exchange is actually defeat the Bitcoin's purpose and that's why Bitcoin enthusiast always suggest to use decentralized exchange e.g. Bisq if you want to sell and buy Bitcoin, then transfer it to your own hardware wallet to hold Bitcoin for long term. Bisq is different than centralized exchange, you're don't need to create a new account, your account in Bisq are non custodial and the developer has no way to touch your coin and you have better privacy since Bisq run over Tor network.This is the complete tutorial to use Bisq https://bisq.network/getting-started/To learn Bitcoin:If you want to read books, you can read this https://github.com/bitcoinbook/bitcoinbookIf you want to watch a video, you can watch this https://www.youtube.com/@aantonop",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 28, 2023, 05:30:09 AM",
      "body": "Quote from: Socrvtes on January 27, 2023, 11:35:02 PMHow was it possible to have bitcoin, except from mining or receiving  ?Bitcoin is a currency and like any other currency there are 3 ways of acquiring it: (1) printing it (which is mining in bitcoin) (2) receiving it as payment (like your salary or paycheck) (3) having another currency and exchanging that for the other currency (like exchanging dollar for euro or dollar for bitcoin).QuoteHow and why did people start to give their keys ?You don't \"give your key\" when you want to spend bitcoin. Bitcoin uses what's called asymmetric cryptography. This is where you create a \"signature\" using your private key to transfer ownership of your \"coins\" to someone else.QuoteI mean, I can't sleep anymore since the moment I understood that all the first “ Crypto GODS “, after research,  had certainly understood that they can’t touch/manipulate Bitcoin, but can manipulate people's minds. Telling them, send me $, i'll buy and keep your funds to make some profit of it, until the day you ask me for it. ( it sounds like an old song).That makes no sense!Why would anyone want to \"manipulate people's minds\" about bitcoin for its price to go up? The adoption is increasing and that means more demand. Considering the limited supply bitcoin has, automatically price would go up.QuoteI found that you must have to give your keys at a moment, and then, still have trust... (N.B.)As I said you do NOT give your keys to anyone.You should start studying how bitcoin works from reliable sources! Here is one example: https://learnmeabitcoin.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Socrvtes",
      "created_time": "January 28, 2023, 10:26:34 AM",
      "body": "> To solosanz : thank you for Bisq, i will take a look ! And i agree with you , CEX are quite defeating the Bitcoin fundamentals. Don't throw the baby out with the bathwater tho. > To Pooya87 : as i see, you seem to not understand what i ask.I said that so many people have been stolen because they gave money to someone in the idea of profit. There is nothing new about it. Cupidity always existed.My question is : How Satoshi planned the way you hold your bitcoin, while not being a dev or someone without technical capacity ?More ,you're saying the same as me : \"The adoption is increasing and that means more demand\". Means no one can touch bitcoin, but everyone can exchange. Im new to Bitcoin and if i only knew guys like you, i would cerainly never discovered Bitcoin. All i asked is a link that could explain more RELIABLE infos (as you did finally).I seriousy thank you for your explications tho, and next time be kind, and keep in mind that people do what they can with what they found. Not everyone know as much as you  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 28, 2023, 01:05:16 PM",
      "body": "Quote from: Socrvtes on January 28, 2023, 10:26:34 AMMy question is : How Satoshi planned the way you hold your bitcoin, while not being a dev or someone without technical capacity ?You can think of an idea without knowing how to actually implement it, i.e not knowing how to code it. In fact, I'd say the vast majority of people here have good ideas when it comes to certain systems, the difference is Satoshi put that idea into practice, and actually pursued it. Even, if he wasn't the best programmer at the time of the idea, he learned, and implemented it. However, from my understanding he did have some sort of idea, and it's very much like any other programmer they have an idea, they break it down, and then they research as they go. Since, it's almost impossible to just go, and code something without researching certain aspects, since we don't know everything when it comes to projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "January 28, 2023, 01:39:01 PM",
      "body": "What is the theme of your story? What you want to convey is that to anyone who wants to own bitcoin, you advise that it is better to buy or hold it on decentralized platforms.     Also, what the majority of the community here in the bitcoin industry also knows is that no one can manipulate bitcoin. But whalers can give bitcoin value to move it by affecting the market. And in fairness, you also have a point in what you said. Besides that, if you want to store bitcoin the best thing to use is Electrum and a hardware wallet in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "January 28, 2023, 01:50:46 PM",
      "body": "Quote from: Socrvtes on January 28, 2023, 10:26:34 AM> To solosanz : thank you for Bisq, i will take a look ! And i agree with you , CEX are quite defeating the Bitcoin fundamentals. Don't throw the baby out with the bathwater tho. Bisq is not a Bitcoin wallet but it is a decentralized exchange.If you want to get more exchanges with no KYC requirement, https://kycnot.me/Bisq is a good DEX but its trading volume is too low and it can not be matched with needs of many people.Best wallets are hardware wallets then open source, non custodial wallets like Bitcoin Core, Electrum wallets.https://bitcoincore.org/en/download/https://electrum.org/#download[Guide] Verify Electrum wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 28, 2023, 02:01:01 PM",
      "body": "Quote from: Socrvtes on January 27, 2023, 11:35:02 PMWhat makes me think that, is : First, he had to detain some Bitcoins. Same for the first miners and receivers.The same question you may probably ask yourself now if you're investing in bitcoin and trying to hodl it for some reasons vest known to you, since he's the founder I don't see anything bad there in hodling some reasonable amount in his wallet till date, just as some other people could have hodl without selling ever since the creation of bitcoin, its a thing of choice either you have been holding ever since 2009 or thereafter doesn't mean as long as you're still holding, this is not limited to Satoshi alone to hodl, anyone can as well do so and the more reason we have many bitcoin whales across the world.Quote from: Socrvtes on January 27, 2023, 11:35:02 PMHow was it possible to have bitcoin, except from mining or receivingHave you taken your time to read all that's about bitcoin mining, it's not just what we say by mouth because it requires a not of efforts to set up a mining rig and to then solve a complex mathematical equations before you received a bitcoin reward been the first to complete the task among others attempting to do so, talking about receiving bitcoin, you must have done something to place you on the receiving priority by the giver which must have been a tangible task, what we worked for to earn it, i believe no one can teach you before you know how to give someone or the quantity to give.Quote from: Socrvtes on January 27, 2023, 11:35:02 PMHow and why did people start to give their keysBecause they don't know how, which means you must first have the understanding of what a centralized exchange is from a decentralized exchange, types of wallet and their advantages and disadvantages, some dont even know that their keys lies in the hands of the CEX, while others may know but never care because they believe in their reputation, while some never understand why they were into such at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Socrvtes",
      "created_time": "January 28, 2023, 02:31:44 PM",
      "body": "> To Welsh : Big thank ! This is what i wanted to talk. Of course, as long the magical things don't exist, He probably just did what he did, step by step, like any other programmers.If people starded to use this P2P System, why do others people started to go outside of the original way planned by satoshi ? ( Ethereum, MtGox, Bitinstant, QuadrigaCX ) > To Bettercrypto : Quote from: bettercrypto on January 28, 2023, 01:39:01 PM What is the theme of your story? What you want to convey is that to anyone who wants to own bitcoin, you advise that it is better to buy or hold it on decentralized platforms.Yes, exactly. But i know that i'm not the only one to be saying that. But unfortunaly this is something I must explain to my surrounding everytime they want to know more about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "January 28, 2023, 06:49:53 PMLast edit: May 16, 2023, 04:18:52 AM by yhiaali3",
      "body": "Third party services are the worst thing that happened to Bitcoin.I will give you an example if you want to buy bitcoin from the official bitcoin website https://bitcoin.org/ it will take you to the third party purchase page which is MoonPay service.Unfortunately, I get a message :                        This is the worst I can imagine!!!Is this peer to peer??!! Is this the freedom that we dreamed of getting through Bitcoin??!!! of course not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Socrvtes",
      "created_time": "January 28, 2023, 08:41:52 PM",
      "body": "> To Aanuoluwatofunmi :I agree with you 100%, and I see nothing wrong with people doing what they want with their fund. But what bothers me is the fact that to get it in the beginning, it seems like you had to be part of PoW protocol, in order to be rewarded for your work of verification and security, in other words, to be a dev or to know one. Of course I know the existence of the SHA-256 hash function. I also understand the fact that you can't realize what you're doing at any given time, and that \"some dont even know that their keys lies in the hands of the CEX, while others may know but never care because they believe in their reputation, while some never understand why they were into such at all\". But it also seems that it was possible to buy bitcoins online on specialized platforms (CEX ?), physical terminals or in exchange for any good or service with a person who already had it.And that's my whole problem: how would I have held my Bitcoins, without any computer skills, without any desire to sell it, loan it or trade it, ONLY wanted to exchange my fiat in BTC, WITHOUT any third party ?(trust me, I know where I'm going, I know it takes several questions and messages, but you should never rush into your conclusions, but rather confirm them)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "January 29, 2023, 03:05:32 AM",
      "body": "Quote from: Socrvtes on January 28, 2023, 08:41:52 PMAnd that's my whole problem: how would I have held my Bitcoins, without any computer skills, without any desire to sell it, loan it or trade it, ONLY wanted to exchange my fiat in BTC, WITHOUT any third party ?Other than using bisq or another decentralized bitcoin exchange network, the only other option I can think of is in-person trading, where you meet someone who is willing to exchange their bitcoin for your fiat. However, that is a more conventional approach and can put you at more danger of being physically identified while also increasing the likelihood of a $5 wrench attack during the exchange.Also, even though putting your BTC inside a centralized exchange (it's a transfer of ownership by providing a signature, not transferring your keys) is kinda foolish, you have to remember that bitcoin is multifaceted. This means that people use bitcoin for a number of reasons, one of which is speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "January 29, 2023, 04:47:39 AM",
      "body": "Quote from: Maus0728 on January 29, 2023, 03:05:32 AMOther than using bisq or another decentralized bitcoin exchange network, the only other option I can think of is in-person trading, where you meet someone who is willing to exchange their bitcoin for your fiat.In-person trading is a risky trading type.A trade partner who will make that deal with you must be a person who trust a lot. This trading type is risky if you are doing it with a stranger or with someone who was introduced to you by your friends. You can trust your friends but should not trust friends of your friends.You can be a victim of robbery with this trading type and I will avoid it as much as possible.Trading is safer with Escrow service and do it online, not offline, not in-person without Escrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlockMinusOne",
      "created_time": "January 29, 2023, 11:06:31 AM",
      "body": "To own Bitcoin, one must have control over their private key. This key allows access to the bitcoins associated with a specific address. In the early days of Bitcoin, the only way to obtain bitcoins was through mining or receiving them as payment. As the ecosystem grew, people started buying bitcoins on centralized exchanges (CEX), where they would need to trust the exchange with their private key to hold their funds. It's important to keep in mind that with this type of setup, the owner's control over their bitcoins is dependent on the exchange's security measures. To maintain full control over your bitcoins, it's recommended to store them in a hardware wallet or self-custodied wallet, where you have sole control over the private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "January 31, 2023, 01:45:06 AM",
      "body": "Quote from: Socrvtes on January 28, 2023, 02:31:44 PMIf people starded to use this P2P System, why do others people started to go outside of the original way planned by satoshi ? ( Ethereum, MtGox, Bitinstant, QuadrigaCX ) Because people can innovate, they have their own motives (the majority are for-profit obviously), some believe the network is not suitable for their purpose etc. At the end of the day, no one can guarantee that the project will always go the way its creator intended, you can even see some forks here and there claiming to follow the original idea of satoshi but some details are quite different from what has been discussed on the whitepaper.Quote from: Socrvtes on January 28, 2023, 08:41:52 PM But what bothers me is the fact that to get it in the beginning, it seems like you had to be part of PoW protocol, in order to be rewarded for your work of verification and security, in other words, to be a dev or to know one. What is the alternative in your mind? You need to consider that the network is still in the early stages. No one would bother running software for no reason. You don't have to know the dev or be an insider, you can just download the program and run it on your own. Basically, you can mine it yourself. This way there will be competition and the distribution will be fair. At least it is fairer than producing 1 million coins out of nowhere and then sending 1 satoshi for each new user. Quote from: Socrvtes on January 28, 2023, 08:41:52 PMAnd that's my whole problem: how would I have held my Bitcoins, without any computer skills, without any desire to sell it, loan it or trade it, ONLY wanted to exchange my fiat in BTC, WITHOUT any third party ?I don't get it. If you have no plan on trading Bitcoin or using it as a currency, why bother owning it in the first place? Wanting to own some BTC without learning any 'skill' or knowledge related to wallets at the very least sounds like a silly idea. It sounds like you want to ride in a car, but don't want to drive, don't want to hire somebody to drive for you, don't want to rent a car, etc. It sounds like wishful thinking if I get what you're trying to say correctly.If this question is related to how you can get BTC without going through exchanges, as others have mentioned P2P is probably the alternative. If you don't want to interact with anyone else but get the BTC directly from the network then mining is the only choice, but it is unrealistic to do it without any capital. Hoping to mine without spending any dime is also silly since the network has grown so much compared to the early days. I believe trading or earning BTC, not through mining is still within what satoshi envisioned if that is what you're worried about. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "January 31, 2023, 08:32:59 PM",
      "body": "Quote from: Socrvtes on January 28, 2023, 08:41:52 PMAnd that's my whole problem: how would I have held my Bitcoins, without any computer skills, without any desire to sell it, loan it or trade it, ONLY wanted to exchange my fiat in BTC, WITHOUT any third party ?You want to exchange your fiat money for bitcoins without a third party and without submitting your documents. There are platforms that allow you to do that, and there is another way that I used to do transactions in the past, which is that I used to buy bitcoins with fiat money through people in Facebook groups and via Twitter, through a personal interview in one of the neighboring places from my place of residence, so I pay him the fiat, and then he transfers the amount of bitcoin that I want to my wallet address. I know that you are concerned about the CEX platforms and you do not want a third party or any institution to control your assets or your legal documents, and this is a good thing, but if you would like to be anonymous and keep up with the decentralization, as there are many solutions that can help with that. And I always advise you to have a hardware wallet that holds your currencies through it, as it will spare you the need to deal via CEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}