{
  "id": "topic_5399917",
  "title": "roadrunnerjaiv2025",
  "author": "roadrunnerjaiv2025",
  "created_time": "May 24, 2022, 12:22:24 AM",
  "content": "The crypto market isn't essentially or intrinsically affected by the situations of other financial markets. The reason it is being dragged along is that many investors trade on multiple markets (together with many other factors). They usually move assets here and there but sometimes, they scrape off multiple assets into their pockets all at once. Some of them treat their crypto assets as a lifejacket, which keeps them afloat when the rest of their assets are sinking. Dependence on crypto usually entails increased sell-offs.Just when we thought things are starting to quiet down and getting ready to swing back, the Federal Reserve announces that they will raise interest rates and tighten their monetary policy to combat inflation, landing another strong blow on the already beaten financial market. And we're likely to see more interest rate increases in the future until they bring inflation under control. One expert says that if economies don't hold up amid these hikes, Bitcoin's price might plunge further to about 70% of its current price, which is around $8000.But of course, the Fed is careful not to trigger a full-scale recession that will take years to reverse so they'll jack up rates slowly to allow economies to grow simultaneously. Aggressive hikes are out of the question. Raising interest rates helps slow down the economy. When the economy reaches a point tolerable for both consumers and providers, it will start increasing its pace again. This will hopefully prevent any unwanted trends in the crypto market.But like every bear market we've faced in the past, this situation is temporary. No matter how low Bitcoin's price goes from here, it will recover. That's because the only significant issue big investors have with Bitcoin and crypto, in general, is that they are, in the words of ECB chief Christine Lagarde, \"worth nothing.\" And this can be solved by creating an ecosystem where people get used to using cryptocurrencies for transactions and are confident they will hold their value, which can be achieved with additional technological advances. If there's one thing humans are good at, it's creating technological advances. And if there's one thing that won't slow down or stop from advancing anytime soon, it's technology. So we are heading that way no matter what.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399917",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "May 24, 2022, 12:55:11 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 24, 2022, 12:22:24 AMOne expert says that if economies don't hold up amid these hikes, Bitcoin's price might plunge further to about 70% of its current price, which is around $8000.An expert with a crystal ball? 🔮What I can tell is that people will be afraid. Most people will be afraid to buy more, and they will wait prices get back to 50k to buy again.In a bear market like this fear is everywhere. Every news is bad news.This is when we should be brave.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "May 24, 2022, 01:33:01 AM",
      "body": "A big panic from people That may happen to them, especially for small and medium investors who already bought bitcoin at a high price and in the market, there will be a panic sell from them.But the big investor will be happy to buy bitcoin at that price because the price is lower and they might not see that in the next year.But after the price reaches the lowest price, sooner or later, the price will bounce and start the rally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "May 24, 2022, 03:05:58 AM",
      "body": "it is very possible if big institutions sell their bitcoins and cause panic in retail holders after which big institutions buy back at such prices. Panic occurs in retail holders and there maybe many new poor people because they enter in crypto without sufficient knowledge, especially those who still hold altcoins because their value will be much lower and even very likely to be ashes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "May 24, 2022, 03:18:00 AMLast edit: May 30, 2022, 03:38:34 PM by Queentoshi",
      "body": "If the price of bitcoin somehow falls below $8,000, it is an opportunity to buy more. The price slump would have been something to worry about so much if the situation is a case where there is a new digital innovation that is threatening to take the place of bitcoins, one could easily see such a situation then as bitcoin loosing the battle, but currently this is not the case, bitcoin is still a big deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "May 24, 2022, 03:22:17 AM",
      "body": "I suppose I would buy a few more coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 24, 2022, 04:10:20 AM",
      "body": "So basically you read that article about that minard guy who said Bitcoin might go to $8K correct?He had like 3-4 predictions in the past and all of them were incorrect. You would of been better to countertrade him. When he says to buy you sell and vice versa. If anything this is a bottom signal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nur rochid",
      "created_time": "May 24, 2022, 04:45:00 AM",
      "body": "predictions are only possibilities, and for sure no one can predict 100% correct, only coincidences make the predictions the same, therefore personal analysis will make us human beings who are free to have their own point of view. but suppose bitcoin reaches $ 8k, then most altcoins also experience a decline, and whoever dares to take the risk will be the winner. this is exactly what happened in 2018, where bitcoin became $3500, and a lot of fud happened",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 24, 2022, 05:44:19 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 24, 2022, 12:22:24 AMOne expert says that if economies don't hold up amid these hikes, Bitcoin's price might plunge further to about 70% of its current price, which is around $8000.I'm definitely not saying it's impossible (because it's always a possibility) — but if you've been in this industry long enough, you'd immediately realize that you shouldn't listen to these so-called \"eXpErTs\".Also take note that for every bearish \"expert\", there will always be a bullish \"expert\". Listening to them is a total waste of time.But whatever, if it reaches $8k, I'll be really happy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "May 24, 2022, 06:26:11 AM",
      "body": "The last time the FED raised interest rates was in March of 2018, when the price of bitcoin was at about $8k. From then on, the price of bitcoin only dropped by about 25% for the next 8 months, reaching a low of just below $6k. Only around November did the price of bitcoin really tank, and this coincided with the splitting of bitcoin cash, which could have had its effects.Predicting a 70% drop in bitcoin as a result of this increase in interest rates, although the highest in a while, is still mere speculation, with no concrete correlation with the bitcoin market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 24, 2022, 06:26:17 AM",
      "body": "No matter what happens with bitcoin, there will always be people who will cover the news from the side of pessimism and vice versa.For many, the price of eight thousand is the reason for further large investments. The person who flees in fear only allows others to become even richer.The main thing is to stay calm. Otherwise, we hear rather tragic stories when people, in desperation, take very stupid actions.The faint of heart in a bear market just needs to stay away from reading all sorts of analysts who think they are all-seeing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "May 24, 2022, 06:54:25 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 24, 2022, 12:22:24 AMWhat happens if BTC's price falls to $8,000?Such a long read, but I'm gonna answer the main question. Well, If these so called experts are worried when Bitcoin falls as low as $8k, then mine is different, I am more than happy to fill my bags again and sit back relax enjoy the next trip to the moon. Because, you just have stated the most obvious right here. Quote from: roadrunnerjaiv2025 on May 24, 2022, 12:22:24 AMBut like every bear market we've faced in the past, this situation is temporary. No matter how low Bitcoin's price goes from here, it will recover.Right? Coz when you say bear season or bear market that automatically means it's temporary and the market essentially needs it to consolidate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MiF",
      "created_time": "May 24, 2022, 07:32:41 AM",
      "body": "If bitcoin price fall then many crypto enthusiasts will be happy because they can buy more bitcoins and full thier bags as a preparation for the bull run, i remember the dip last year 2018 to 2020 it seems like bitcoin has no chance of rising that time, but in year 2021 it rise drastically on its very astonishing price up to 60k$, so i think if bitcoin drops up to 8000$ the best strategy is to buy more and keep calm it is repeatedly happen big opportunity always come to is but we ignore it because we are affected of the dip controling emotion is very important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "May 24, 2022, 07:53:40 AM",
      "body": "and therefore you have to be prepared with all the worst possible things about the crypto market ... but I have been in this market for 6 years and have seen how this market survives in the midst of a lot of speculation and bad news attacking it .. you know those who survive until in the end he's the winner",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "May 24, 2022, 08:29:44 AM",
      "body": "We're used to hearing those experts and known people telling bitcoin is worth nothing, we've it as a rat poison, as a worthless asset, anything negative, we've heard all of them. They can't tell the whole truth that they can't ignore of how much it is already and how many lives it has changed, well including those that have lost their life savings and blames it to bitcoin due to the scams that they've been involved. If anything happens and bitcoin falls under $10k, is there anything new? We'll just go back at that price and more bitcoins will be on hold because majority of us are going to hold since we saw $20k, $40k, $60k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BOAEDAN",
      "created_time": "May 24, 2022, 08:53:40 AM",
      "body": "Basically, krypto is a risky asset that is classified as the most volatile compared to other assets such as gold and stocks, the price of bitcoin is also easy to influence the sentiment of its supporters, but even though the price of bitcoin drops like raindrops, I am very sure investors will take the opportunity to buy bitcoin when the price goes down, including myself will buy bitcoin, because I also believe the price of bitcoin will definitely increase someday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 24, 2022, 09:32:33 AM",
      "body": "Quote from: Queentoshi on May 24, 2022, 03:18:00 AMIf the price of bitcoin somehow falls below $8,000...it is an opportunity to buy more. The price slump would have been something to worry about so much if the situation is a case where there is a new digital innovation that is threatening to take the place of bitcoins, one could easily see such a situation then as bitcoin loosing the battle, but currently this is not the case, bitcoin is still a big deal.You are right, but likely bitcoin can not fall below $10000 ever again, not to talk of $8000. Bitcoin price is still volatile, but not volatile if compared to the past time. Bitcoin all time high in 2017 was around $20000, it falled to around $4000 in 2019 and 2020 before making it up to around $69000 all-time-high in 2021. If the volatility is calculated to be around 5x before the last halving, it is less volatile than the past. The volatility should not be more than or up to that of last halving during this times.Quote from: BOAEDAN on May 24, 2022, 08:53:40 AMBasically, krypto is a risky asset that is classified as the most volatile compared to other assets such as gold and stocks, the price of bitcoin is also easy to influence the sentiment of its supporters, but even though the price of bitcoin drops like raindrops, I am very sure investors will take the opportunity to buy bitcoin when the price goes down, including myself will buy bitcoin, because I also believe the price of bitcoin will definitely increase someday.We should not compare the price of other cryptocurrencies to the price of bitcoin, altcoins are more volatile and riskier. Although, bitcoin can be more volatile than gold, but it reached all-time-high and that still also makes it a store of value in long term. About stock, bitcoin price is less volatile than many stocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 24, 2022, 09:46:50 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 24, 2022, 12:22:24 AMOne expert says that if economies don't hold up amid these hikes, Bitcoin's price might plunge further to about 70% of its current price, which is around $8000.Just put the source for this and stop trying to rewrite articles because you end up with misleading things like the one above!The text in the original news clearly mentions a drop of 70%,  the way you wrote it, it would mean a drop to 70% of the value, so just to 20k.That aside I'm really curious about one thing with those so-called cheap coins, if everyone is waiting to buy cheap coins, obviously from people who will sell at a loss, who is going to buy your coins in return for you to get a profit and why wouldn't those people buy now when the price is $30k and not by the time you've made your x10 gains?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "May 24, 2022, 12:00:49 PM",
      "body": "Then maybe this is perfect time to buy since for sure many whales will think about that this is the dip that they are waiting for. Imagine if those new people will experience that bitcoin reach on its new ATH before but suddenly it drops at the worse $3k+ level and that follows with heavy long days of bear market season for sure many of them will rant around here and think that bitcoin or even the whole crypto market will die. So basically if that case would really happen just make sure you have balance to buy bitcoin for you not to miss any open opportunity offered by bitcoin itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 24, 2022, 12:47:40 PM",
      "body": "Sounds good.It was a clean-up phase starting with weak hands including those who believed in expert opinion, and some bullshit altcoin lists that filled aggregator sites. I actually love it if someone throws bitcoins at me for being too cheap and thinks it's the end of their journey in this space. Yep, maybe a lot of wholetraders and institutions put up caps like me when bitcoin really hits $8k.You will have no chance of owning even a small amount of yours in the future if you sell it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}