{
  "id": "topic_5413252",
  "title": "mu_enrico",
  "author": "mu_enrico",
  "created_time": "September 12, 2022, 10:03:35 AMLast edit: December 18, 2023, 07:26:40 PM by mu_enrico",
  "content": "Koin Proof-of-Work atau PoW dahulu merupakan algo yang \"wajib\" untuk para pecinta cryptocurrency, bahkan dahulu adalah era di mana koin yang menggunakan algo selain PoW (PoS, DPos, dsb.) seringkali dicap sebagai koin \"scam.\" Akan tetapi tren penurunan koin algo PoW sangat terlihat ketika kita mengamati data top-15 koin berdasarkan marketcap dalam 5 tahun terakhir. Terlihat bahwa hanya BTC dan ETH yang stabil di puncak klasemen dengan urutan #1 dan #2.Data dari coinmarketcap.comDi 2022, fenomena ini semakin parah dengan hanya ada 3 koin PoW, itupun dengan DOGE di urutan ke-3 yang kita ketahui kalau koin ini hanyalah koin meme dan bisa dimerge-mining dengan LTC. Kemudian ETH yang beralih ke PoS akan meninggalkan koin PoW di top-15 hanya ada BTC dan meme coin DOGE. Tentu ini adalah kabar baik untuk Bitcoin, karena praktis saingan Bitcoin hanyalah koin-koin code fork atau blockchain fork seperti LTC, BCH, BSV, dsb. Akankah penggemar PoW di ETH migrasi ke Bitcoin?Bagaimana tanggapan agan mengenai hal ini? Apakah Bitcoin akan menjadi satu-satunya koin PoW yang tersisa dan apakah ini berpengaruh baik atau buruk terhadap Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413252",
  "comments": [
    {
      "author": "abhiseshakana",
      "created_time": "September 12, 2022, 12:34:34 PM",
      "body": "PoW adalah identitas Bitcoin karena itu merupakan mekanisme konsensus yang diciptakan oleh SN. Salah satu kekurangan dari PoW adalah boros energi, dimana untuk mendapatkan tingkat keamanan yang lebih bagus maka akan menghabiskan lebih banyak sumber energi (dengan asumsi terjadi pemerataan global hashrate). PoW juga menjadi dasar untuk harga Bitcoin itu sendiri, yang secara umum insentif yang didapat harusnya bisa menopang biaya produksi (cost mining).Untuk Bitcoin saya bisa mengatakan jika akan tetap berbasis PoW karena itu adalah jati dirinya. Sedangkan untuk coin lain, ya bisa saja suatu saat mereka akan beralih menggunaan mekanisme konsensus lain, jika masing-masing dari mereka menemui kendala terkait dengan penggunaan PoW (seperti halnya ETH yang bermasalah dengan difficulty bomb). Mungkin ada beberapa yang akan tetap berpegang teguh pada PoW, namun bagi mereka bukan sebuah hal yang pelik jika pada akhirnya harus melakukan migrasi dari PoW ke konsensus lainnya karena mereka tidak memiliki visi (100%) Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "September 12, 2022, 12:46:16 PM",
      "body": "Opini saya:- Kalau menjadi satu-satunya koin PoW belum akan terjadi dalam waktu dekat ini karena setidaknya masih ada coin lain termasuk coin fork dari Bitcoin sebagaimana disebut diatas yang masih menggunakan PoW. - Penggemar PoW di ETH mungkin saja sebagian ada yang beralih ke Bitcoin dan sebagian lagi ke coin lainnya yang masih menggunakan PoW atau mungkin saja malah ada yang beralih haluan ke PoS. Salah satu faktor yang bisa saja turut mempengaruhi keputusan tersebut adalah perangkat mining yang tentunya perlu lebih ekstra ketika memilih beralih ke Bitcoin.- Perihal jika nantinya ternyata hanya tersisa Bitcoin yang menjadi satu-satunya koin PoW, menurut saya pengaruh baik dan buruk akan ada.Pengaruh baiknya kemungkinan yang memang berpendirian tetap mempertahankan PoW dari koin lain akan ada yang berusaha beralih ke Bitcoin dan ini bisa menambah kekuatan jaringan bitcoin yang menganut desentralisasi.Sementara pengaruh buruknya antara lain, Bitcoin akan menjadi satu-satunya koin kripto yang \"dikritik habis-habisan\" (meskipun kritikan ini sudah berlangsung cukup lama) karena masih mempertahankan PoW yang dicap \"tidak ramah lingkungan\" sementara koin lain sudah beralih ke metode seperti PoS yang dianggap lebih \"hijau\" dalam penggunaan energi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "September 13, 2022, 01:40:14 AM",
      "body": "Kayaknya untuk menjadi koin PoW satu-satunya masih belum sih, meskipun koin PoW keluar dari top 15 dalam 5 tahun terakhir, bukan berarti mereka itu sudah berakhir. Kecuali mereka juga mengikuti langkah ETH semuanya dengan beralih ke metode PoS, baru bisa dikatakan the only one  Sebenarnya ada banyak yang berspekulasi \"Apakah mungkin bitcoin akan pindah ke PoS\". tapi memang sejauh ini keyakinan terhadap mekanisme yang ada saat ini masih lebih baik daripada pemindahan ke PoS. Kecuali jika tiba-tiba akun satoshi di forum ini memberikan posting kalau BTC akan pindah ke PoS ini baru akan menggegerkan jagad kripto. Jika PoW adalah jati diri Bitcoin, maka Satoshi dan komunitas yang mendukung pemrograman BTC tidak akan pernah menyetujui merge ke PoS.Kalau dari list CMC, hanya ada 175 daftar koin dengan sistem PoW yang eksis sedangkan dari Cryptoslate ada 328 koin PoW yang eksis. https://coinmarketcap.com/view/pow/https://cryptoslate.com/cryptos/proof-of-work/Saya tidak mengetahui berapa jumlah pasti dari koin PoW yang saat ini benar-benar eksis. karena sebagian dari list tidak memiliki volume perdagangan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luffygroove",
      "created_time": "September 13, 2022, 03:35:27 AM",
      "body": "Menurut saya, semakin banyak coin yang tidak menggunakan PoW akan semakin baik karena hal ini berarti meminimalisir peran cryptocurrency terhadap pemanasan global yang saat ini semakin parah. Mekanisme PoW sepertinya dipandang negatif oleh kebanyakan orang di luar crypto atau beberapa komunitas crypto sendiri karena dianggap memakan banyak energi dan berdampak negatif terhadap lingkungan. Berkurangnya proyek yang menggunakan PoW ini juga mungkin berarti semakin berkembangnya teknologi yang digunakan dan mulai meninggalkan PoW yang sudah mulai dianggap tidak efisien. Bila Bitcoin bertahan dan menjadi satu-satunya koin PoW mungkin tidak akan terlalu berdampak karena sedari awal Bitcoin memang dikenal sebagai koin yang menggunakan PoW, dan sepertinya tidak akan berubah karena Bitcoin berbeda dengan proyek lain. Proyek lain developer-nya masih ada dan dikenal publik sehingga dengan bebas dapat membuat perubahan dan pengembangan, sedangkan Bitcoin sepertinya sudah ajeg, sebagai pelopor di dunia crypto, bilapun ada perubahan-perubahan yang terjadi itu akan sangat minim sekali terkecuali nanti ketika semua bitcoin sudah habis ditambang dan seluruh supply-nya mulai bersikulasi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "September 13, 2022, 01:23:09 PM",
      "body": "Quote from: masulum on September 13, 2022, 01:40:14 AMKayaknya untuk menjadi koin PoW satu-satunya masih belum sih, meskipun koin PoW keluar dari top 15 dalam 5 tahun terakhir, bukan berarti mereka itu sudah berakhir. Kecuali mereka juga mengikuti langkah ETH semuanya dengan beralih ke metode PoS, baru bisa dikatakan the only one  Ya mungkin lebih tepat \"the only one that matter...\" soalnya koin-koin PoW yang lain itu hashratenya kecil sekali dibandingkan dengan BTC untuk ASIC dan ETH untuk GPU. Palingan hanya 2% hashrate SHA256, dan 10% hashrate Ethash yang tidak mining di BTC & ETH.Quote from: masulum on September 13, 2022, 01:40:14 AMKalau dari list CMC, hanya ada 175 daftar koin dengan sistem PoW yang eksis sedangkan dari Cryptoslate ada 328 koin PoW yang eksis. Eksis tapi hashratenya kecil-kecil 175 itu palingan cuma beberapa aja yang \"kuat\" kek LTC+DOGE dan Monero.Kalau feeling ane (NFA, DYOR) nanti akan banyak holder yang migrasi dari ETH karena banyak dari mereka yang mengagungkan desentralisasi, sementara dev akan cenderung migrasi ke ETH Classic (ETC). Ya nanti ditunggu saja apakah terlihat jelas di \"Bitcoin Dominance Chart\" at least sampai level 50%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}