{
  "id": "topic_5441281",
  "title": "Maus0728",
  "author": "Maus0728",
  "created_time": "February 26, 2023, 07:35:23 AM",
  "content": "Share ko lang tong bitcoin tshirt na nakita ko sa SM Department Store ng NORTH EDSA branch. Baka makatulong sa mga naghahanap ng mga bitcoin related merch hahaha.Hindi ko na tiningnan yung presyo kasi nagmamadali ako haha, pero ang cool lang tingnan na may nagbebenta pala ng ganyan sa market ngayon. Yun lang",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441281",
  "comments": [
    {
      "author": "mk4",
      "created_time": "February 26, 2023, 08:45:35 AM",
      "body": "Cute ung mga spoof-style designs, pero watch out lang. Alanganing may mangyaring masama pero better safe than sorry!https://cryptosec.info/wrench-attack/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "February 26, 2023, 10:11:52 AM",
      "body": "Quote from: mk4 on February 26, 2023, 08:45:35 AMCute ung mga spoof-style designs, pero watch out lang. Alanganing may mangyaring masama pero better safe than sorry!https://cryptosec.info/wrench-attack/Kung isusuot ko yan dito sa place namin kung saan iilan or bilang lang ang nakakaalam ng cryptocurrency o Bitcoin, walang problema or mas mababa ang risk ng ganyang attacks sa tingin ko at isa pa nasa probinsya din kasi ako. Sa kabilang banda, kung yan ang isusuot mo at nasa Metro Manila ka or kahit saang siyudad na matao ang lugar, mas mataas ang risk mo.Overall, maganda yung mga ganyang spoof-style designs. Nakakita na rin ako ng ganyang mga klaseng damit noong napadpad kami jan ibang branches ng SM at natatawa rin ako sa ibang nakasulat.Maganda yung \"Bitcoin King\" na design. Kuhang kuha yung logo ng Burger King.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "February 26, 2023, 12:01:03 PMLast edit: February 26, 2023, 02:48:35 PM by Eureka_07",
      "body": "Quote from: Maus0728 on February 26, 2023, 07:35:23 AM<snip>Ayos ah, mukhang maganda ang quality ng t-shirt at pati na rin ng pagkakaprint ng design, rubber-printed ba to? Sang-ayon ako sa nabanggit ni maus, tingin ko is plus \"target points\" kang mahold-up if may idea yung holdaper na enthusiast ka ng btc, tingin ko kasi, sa Pinas, pag sinabing nag Bibitcoin ang isang tao, tingin na agad is mapera. Kaya doble ingat na rin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "February 26, 2023, 12:20:12 PM",
      "body": "Quote from: mk4 on February 26, 2023, 08:45:35 AMCute ung mga spoof-style designs, pero watch out lang. Alanganing may mangyaring masama pero better safe than sorry!https://cryptosec.info/wrench-attack/Wala naman sigurong masama mangyayari sayo since parang statement shirt lang din yan. Maliban nalang siguro kung nakalagay dyan ay I am bitcoin owner na word siguro dun mapapaisip ang mga criminal na biktimahin ka.Pero if sensitive talaga sa mga ganito better wag nalang talaga magsuot para sa peace of mind habang nasa labas ka ng bahay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "February 26, 2023, 05:21:36 PM",
      "body": "Ayos ang ganda ng mga design at mukang high quality din ang mga tshirts kaso sigurado mahal kase sm department store hehe. Quote from: mk4 on February 26, 2023, 08:45:35 AMCute ung mga spoof-style designs, pero watch out lang. Alanganing may mangyaring masama pero better safe than sorry!https://cryptosec.info/wrench-attack/Grabe di naman siguro aabot sa ganito ng dahil lang sa tshirt, I mean siguro may posibility nga din naman since di ka naman magsusuot ng ganito if wala kang alam sa bitcoin or cryptocurrency pero siguro naman pagiisipan din naman muna nila kung sinong target, if may balak man sila tatargetin na siguro nila ung siguradong mayroong malaking amount or cash siguro mga influencers. Hilig ko talaga mga ganitong spoof designs sobrang dami kung spoof na damit kaso dahil sa sinabe mo parang ayaw ko na bumili ng ganito   stay safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 26, 2023, 06:55:15 PM",
      "body": "Quote from: arwin100 on February 26, 2023, 12:20:12 PMWala naman sigurong masama mangyayari sayo since parang statement shirt lang din yan. Maliban nalang siguro kung nakalagay dyan ay I am bitcoin owner na word siguro dun mapapaisip ang mga criminal na biktimahin ka.Kung may crypto-related tshirt ka — chances are, meron kang crypto. Hindi naman siguro kailangan pang diretsong sabihin na may bitcoin ka para maging interesado sayo ung mga kidnapper/holdaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlisle1",
      "created_time": "February 26, 2023, 07:07:12 PM",
      "body": "Quote from: arwin100 on February 26, 2023, 12:20:12 PMQuote from: mk4 on February 26, 2023, 08:45:35 AMCute ung mga spoof-style designs, pero watch out lang. Alanganing may mangyaring masama pero better safe than sorry!https://cryptosec.info/wrench-attack/Wala naman sigurong masama mangyayari sayo since parang statement shirt lang din yan. Maliban nalang siguro kung nakalagay dyan ay I am bitcoin owner na word siguro dun mapapaisip ang mga criminal na biktimahin ka.Pero if sensitive talaga sa mga ganito better wag nalang talaga magsuot para sa peace of mind habang nasa labas ka ng bahay.Ang hirap na rin kasi ng panahon ngayon kaya kung gusto mo ng mas may peace of mind ka at hindi ka tamang hinala habang naglalakad kamabuti pang wag ka nga lang magsuot ng ganitong damit.Pero sa kabilang banda, ang ganda din talaga kasi ung mga design eh ginaya dun sa mga legit na logos tapos mababasa BTC.Siguro pag napadpad ako dyan sa location mapapabili ako nyan, pang porma lang din naman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cydrix",
      "created_time": "February 26, 2023, 08:14:33 PM",
      "body": "Quote from: Maus0728 on February 26, 2023, 07:35:23 AMShare ko lang tong bitcoin tshirt na nakita ko sa SM Department Store ng NORTH EDSA branch. Baka makatulong sa mga naghahanap ng mga bitcoin related merch hahaha.Hindi ko na tiningnan yung presyo kasi nagmamadali ako haha, pero ang cool lang tingnan na may nagbebenta pala ng ganyan sa market ngayon. Yun langThe quality of the merch looks good to me. Bibili ako for sure if meron dito nyan samin kasi wala ako kahit anong crypto related stuffs and hoping na magkaroon pero siguro di ko naman to gagamitin for security purposes, idisplay lang para motivated.Ang price estimate ko ay 300-600 PHP since good ang merch and magaganda ang design.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "February 26, 2023, 11:46:35 PM",
      "body": "Quote from: Maus0728 on February 26, 2023, 07:35:23 AM....Share ko lang tong bitcoin tshirt na nakita ko sa SM Department Store ng NORTH EDSA branch. Baka makatulong sa mga naghahanap ng mga bitcoin related merch hahaha.Hindi ko na tiningnan yung presyo kasi nagmamadali ako haha, pero ang cool lang tingnan na may nagbebenta pala ng ganyan sa market ngayon. Yun langThis is very interesting- branded ba itong mga shirts na ito or nakita mo ito sa loob ng department store? I am surprised na may nag bebenta ng mga ganitong klaseng shirts + designs inside SM given na usually personally customized mga shirt na ganito. Siguro it is safe to say na yung may ari ng brand na yan ay isang BTC enthusiast. Maybe, baka isa rin siya sa mga forum lurkers dito! Maganda makakita na madami na nga sumusuporta sa BTC dito sa bansa compared dati na wala masyado ang may alam nito. I alsohope na sana may mga ibang produkto din silang i-aadvertise about cryptocurrencies pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "February 26, 2023, 11:46:45 PM",
      "body": "Quote from: mk4 on February 26, 2023, 06:55:15 PMQuote from: arwin100 on February 26, 2023, 12:20:12 PMWala naman sigurong masama mangyayari sayo since parang statement shirt lang din yan. Maliban nalang siguro kung nakalagay dyan ay I am bitcoin owner na word siguro dun mapapaisip ang mga criminal na biktimahin ka.Kung may crypto-related tshirt ka — chances are, meron kang crypto. Hindi naman siguro kailangan pang diretsong sabihin na may bitcoin ka para maging interesado sayo ung mga kidnapper/holdaper.It is possible since hindi kasi normal na sinusuot ang ganyang mga design sa ngayon.  At isa pa, karamihan sa nagsusuot nyan ay siguradong involved sa cryptocurrency.  Iilan lang siguro sa mga non-crypto enthusiast ang magsusuot nya.  Sa mga paglabas labas ko at pamamasyal, halos wala akong makitang tao na nagsusuot ng ganyang design na merch,kaya tama ka na hint sa mga holdaper at kidnaper na may cryptocurrency holdings ang taong magsusuot ng mga merch na yan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "February 26, 2023, 11:52:38 PM",
      "body": "Mukang parody type yung design ng shirts na yan ahhh. Parang nakita ko na yung Bitcoin King before at luckily meron na tayo available locally. I think I might purchase one pag naka daan ako ng SM megamall. Parang pansin ko din na puro nasa SM megamall yung mga bitcoin inspired shirts since I have saw another post na nag bebenta din sa SM megamall ng bitcoin shirt pero iba yung design at last time na pag punta ko dun is may metaverse booth akong nakita dun. Sana may ibang colorways sila at big sizes HAHA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "February 27, 2023, 02:10:16 AM",
      "body": "Quote from: mk4 on February 26, 2023, 08:45:35 AMCute ung mga spoof-style designs, pero watch out lang. Alanganing may mangyaring masama pero better safe than sorry!https://cryptosec.info/wrench-attack/I agree. Mas maganda na yung maingat lalo pa sa panahon ngayon, hindi natin masabi. Pero dito naman samin konti lang ang may alam ng tungkol sa Bitcoin at dahil na rin nawala na ang hype ng play to earn games naging less interested ang mga tao sa crypto in general.But anyway, ang ganda ng shirts type ko yung orange. Hehe Kung meron sana dito samin may available na ganyan bibili rin ako as souvenir bilang Bitcoin enthusiasts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "February 27, 2023, 03:29:37 PM",
      "body": "Quote from: Eureka_07 on February 26, 2023, 12:01:03 PMQuote from: Maus0728 on February 26, 2023, 07:35:23 AM<snip>Ayos ah, mukhang maganda ang quality ng t-shirt at pati na rin ng pagkakaprint ng design, rubber-printed ba to? not sure if rubber printed pero seeing na sa maxwear ang nag bebenta, certain na high quality yung T-shirt, sa maxwear ako lagi bumibili ng mga T-shirt at shorts ko kasi bukod na sa high quality yung product na binebenta nila, mas madami din yung sizes na available sakanila at na accomodate yung mga plus size na tao.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "February 28, 2023, 07:15:24 AM",
      "body": "Matagal ko ng bumili ng merch na merong bitcoin logo o kaya palatandaan at malalaman ng mga taong makakasalubong ko na nasa crypto/bitcoin ako.Pero katulad nga ng sabi ni mk4, madami ring mga tao dyan sa paligid natin na merong masamang intention. At ang akala nila kapag nasa crypto ka mayaman ka na agad on instant. Okay naman magsuot ng ganyan, meron akong tshirt na giveaway galing sa isang crypto convention at sinusuot ko paminsan minsan pero pag nasa bahay lang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "March 01, 2023, 12:44:42 PM",
      "body": "Quote from: cydrix on February 26, 2023, 08:14:33 PMsiguro di ko naman to gagamitin for security purposes, idisplay lang para motivated.Quote from: blockman on February 28, 2023, 07:15:24 AMat sinusuot ko paminsan minsan pero pag nasa bahay lang.  Kung may printer na kayo sa bahay, mas maigi nalang na mag DIY [alam ko na hindi magiging perfect ang quality, pero at least hindi malalaman ng ibang tao na may alam kayo sa crypto-related stuff]: How to Print your Photo on T shirt at Home using a Flat IronQuote from: abel1337 on February 26, 2023, 11:52:38 PMParang nakita ko na yung Bitcoin King beforeMukhang kinuha nila ang mga design na ito sa redbubble:1st design2nd design3rd design",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 01, 2023, 01:43:25 PM",
      "body": "Quote from: SFR10 on March 01, 2023, 12:44:42 PMQuote from: blockman on February 28, 2023, 07:15:24 AMat sinusuot ko paminsan minsan pero pag nasa bahay lang.  Kung may printer na kayo sa bahay, mas maigi nalang na mag DIY [alam ko na hindi magiging perfect ang quality, pero at least hindi malalaman ng ibang tao na may alam kayo sa crypto-related stuff]: How to Print your Photo on T shirt at Home using a Flat IronSalamat sa tip, ta-try ko yan.Ayos itong technique na ganito, may ganyan palang strategy. Siguro gagawin ko yan kapag may free time pero yung design is not related sa crypto para lang safe.Mas okay sa akin yung ganun kasi may mga wrench attack at lalo na dito sa atin, hindi natin alam yung mga nakakasalamuha natin lalo na ngayon sa hirap ng buhay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "March 01, 2023, 09:12:52 PM",
      "body": "Maraming Bitcoin merch na nagbebenta online pero its good to see na makikita naren pala ang mga ganito sa malalaking store, not sure lang ako if available ito sa area namen pero panigurado, marame ang bibili ng ganito. Anyway, personally hesitant ako to wear anything related about cryptocurrency, medyo natatakot kase ako baka mabash ako or kung hinde naman baka may magkainterest sa akin at kung ano pa ang gawin nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "March 03, 2023, 09:26:48 PM",
      "body": "Mukhang mas ok if magcustomize ka nalang ng design kesa bumili ng ganyan and medyo pricey.Anyway, its not about the design or price naman, its more about the thought that the bigger store ay nagbebenta na ng merch ni Bitcoin at hinde malabong mangyare na magaccept naren sila ng Bitcoin as mode of payment at kapag nangyare ito, panigurado marame talaga ang maeenganyo magadopt ng Bitcoin at cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "March 04, 2023, 03:16:17 PM",
      "body": "Quote from: Johnyz on March 03, 2023, 09:26:48 PMMukhang mas ok if magcustomize ka nalang ng design kesa bumili ng ganyan and medyo pricey.Anyway, its not about the design or price naman, its more about the thought that the bigger store ay nagbebenta na ng merch ni Bitcoin at hinde malabong mangyare na magaccept naren sila ng Bitcoin as mode of payment at kapag nangyare ito, panigurado marame talaga ang maeenganyo magadopt ng Bitcoin at cryptocurrency. Yep the point of this is nakikita natin na yung mga big malls like SM is na rerecognize na yung cryptocurrency and shirt brands like the one na nakikita natin sa OP has the confidence that crypto inspired shirt will sell in the public. Kung siguro ito ay nang yari 6 years ago ay siguradong bibilhin ko lahat ng design ng shirts nila dahil sa sobrang rare ng crypto inspired shirts dito sa Pilipinas and mas lalo na yung malls na open para sa crypto booths and events. It is so rare before na parang isang maliit na community lang ang cryptocurrency users dito sa Pilipinas and here we are today seeing brands doing crypto design shirts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}