{
  "id": "topic_5468579",
  "title": "Nalain420",
  "author": "Nalain420",
  "created_time": "September 29, 2023, 06:50:11 PM",
  "content": "السلام عليكم لجميع إخوتيآمل أن تكونوا جميعًا بأتم الصحة.اليوم، كنت أتحقق من أقسام مختلفة لجمع بعض المعلومات. صادفت قسمًا يسمى \"مناقشة التداول\"، الذي يحتوي على قسمين مختلفين ربما يُشير إليهما باسم لوحات فرعية. ثم زرت قسم السمعة واكتشفت أنه هنا يمكنهم إنشاء مواضيع مختلفة للإبلاغ عن مشاكل متنوعة.بدأت في التحقق من المواضيع واحدًا تلو الآخر، وبعد النظر في بعض المواضيع، وجدت موضوعًا بعنوان \"موضوع الإبلاغ عن البريد العشوائي\". عندما زرته، لاحظت أن العديد من الإخوة الأسطوريين والمستخدمين الآخرين كانوا يبلغون عن شيء ما، لكنني لم أستطع معرفة طبيعة هذه البلاغات، مثل هذه الأداة المسماة \"البريد العشوائي\". لم أكن أعرف ماذا يعني ذلك. في النهاية، تحققت ورأيت بلاغًا من أحد إخوتنا في المجتمع العربي، ألفن. لا أعرف لماذا تم الإبلاغ عنه.ثم، رأيت تعليقًا من مستخدم آخر يذكر حظرًا في مشاركتهم، واعتقدت ربما تلقى ألفن تحذيرًا بسبب شيء ما. ولكن في أسفل المشاركة، كان هناك شيء كتب يلفت انتباهي.https://bitcointalk.org/index.php?topic=5456516.msg62913539#msg62913539QuoteAutoban user: N/A in topic #0 by member #2561049وجدت هذا مشبوهًا، لذا ذهبت إلى BPIP للبحث عن ملف ألفن. عندما رأيته، صُدمت لاكتشاف أن حسابه الأسطوري قد تم حظره. كنت حقًا حزينًا جدًا عندما رأيت أن كل سنوات عمله الشاق ذهبت هباءًا.https://bpip.org/Profile?id=2561049لماذا حدث هذا؟ هل هناك أي طريقة يمكنكم توجيهي بها؟ أو هل هناك أي طريقة لاستعادة حساب ألفن الأخ الأسطوري، ربما من خلال إعطائه تحذيرًا وإلغاء الحظر عنه حتى يتمكن من العودة إلى النشاط والمشاركة في المناقشات معنا؟ أشعر بأسف شديد لألفن الأخ.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468579",
  "comments": [
    {
      "author": "GxSTxV",
      "created_time": "September 29, 2023, 08:30:26 PM",
      "body": "مع الاسف الامر صحيح وما حدث هو ان العضو ulven كان يقوم باستخدام الذكاء الاصطناعي للنشر هنا في المنتدى وهو الامر الممنوع لهذا تم حظره اي قام باكتشافه في عدة تعليقات ومواضيع اين يسهل كثيرا اكتشافها لانها في الغالب تكون مثل مقالات وفي بعض الاحيان تخرج على الموضوع باكمله.ارجو تفادي النسخ من الروبوتات او اضافة مقالات بدون ذكر مصدرها لان الاثنين يعتبران plagiarism والان توجد العديد من المواقع التي تقدم خدمة التحقق من النصوص اذا ما كانت من كتابة بشرية او عن طريق الذكاء الاصطناعي Quote from: nutildah on September 27, 2023, 09:28:15 AMFound some undeleted AI spam just by doing a forum search for \"knowledge cutoff\". First up, another \"Legendary\" member using AI to write their posts for them, womp womp.Ulven…..لا اعرف اذا ما كان الحظر مؤقت او نهائي لكن لاحظت ايضا من خلال موقع. Bpip انه تم الغاء الحظر لهذا من المحتمل ان الحظر مؤقت فقط حسب ما اظن . ويبقى الامر للتاكيد اذا عاد العضو بنفسه وننتظر توضيح افضل من طرف الاعضاء القدامى هنا وما يعتقدون حول الامر وهل يستحق هذا الامر الحظر النهائي او فقط تحذيربالاضافة ان اخر ظهور له هو اليوم على  05:17:46 PMلكن اخر منشور له منذ يوم 27/09",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mulven",
      "created_time": "September 30, 2023, 02:21:23 AM",
      "body": "و عليكم السلام نعم صحيح أخي تم حظري بشكل دائم لسبب أنني أستخدم أدوات الذكاء الصناعي لإنشاء المنشورات و هذا يعتبر خرق للقوانين هنا في المنتدى مع العلم أنني أبذل جهداً كبيراً لكتابة مشاركة هنا أنت مثلا تستطيع إنشاء مشاركة مفيدة بلغتك الأم في عشر دقائق بالقسم العربي أما أنا فلا تأخذ مني وقتاً أكثر لأنني لست عربيا بل من أصول أمازيغية و الحمد لله أنني تعلمت اللغة العربية من خلالها أستطيع التواصل مع مختلف الأجناس. كما تعلم تم تأسيس هذا المجتمع لمشاركة الأفكار و تقييمها فأنا كل ما أفعله هو ترجمة أفكاري بهذه الأداة و مشاركتها مع المجتمع.بعد حظري قمت بتقفي الأثر و جدت أنه تم الإبلاغ عني لدى شرطة أنتربول ثم حظري و بعد إطلاعي على الموضوع قمت بعمل نفس الشيء على مستخدم يقوم بتقديم الإبلاغات وجدته أيضا يلصق مشاركات عديدة يتبين أنها مكتوبة بالذكاء الصناعي أردت أن أضحك لكنني لا أستطيع \"بغيت نضحك و أنا مريض\" هههه هذا مثال لذلكQuote from: lovesmayfamilis on September 28, 2023, 10:15:47 AMWho do you think is easier for scammers to deceive? Who often suffers because they do not know their rights? I think you already understand what I want to say. The more educated a person is, the more protected he is. Yes, it is probably difficult to get a well-paid job right away, but there is always a difference in who and what you can do. A person without education can be used in any direction, knowing that he will still not be able to stand up for himself since he is not educated. He can be paid less, and because he is in a hopeless situation, he will be forced to agree to all types of difficult and poorly paid work.But you, having several degrees of education, will never allow people to behave inappropriately towards you, firstly, having respect for yourself. Therefore, you should not think that people who strive for self-improvement will always remain at the bottom of life. There should always be a chance that should not be missed. It's always better than sitting and spitting at the ceiling and complaining about your poor life.https://sapling.ai/ai-content-detector/c8e45b2247d92e78a6d22f95627bc8cfWritefull: 88% likely this comes from GPT-3, GPT-4 or ChatGPT.كما أنني رسلت مشرف القسم العربي الأخ أميغا و لم أتلقى منه بعد أي جواب فإنتباني فضول قمت بتحقق أيضاً من منشوراته وجدته أيضاً يفعل نفس الشيء Quote from: OmegaStarScream on September 29, 2023, 12:22:58 PMI don't really use Exodus anymore, but I have their wallet installed on my phone and I never had this issue before.What happens when you tap \"Fix\" though? does that automatically uninstall the app? either way, their support team is very response, so you may want to contact them if the problem persists.https://sapling.ai/ai-content-detector/62834f57807133655ca083d3e910ccb3و بعدها تحققت من مجموعة كبيرة من المستخدمين وجدت أن البرامج التي يتم الإعتماد عليها للإمساك بغشاشين لا تفرق بين الصح و الغلط.هذا يعني حتى إذا كنت تتقن الإنجليزية قد تتعرض للعقوبات هههه لكي تتفادى ذلك يجب عليك أولا التحقق من المنشور في مواقع كشف الإنتحال أولا قبل نشره. لتفادي شرطة المرورفي الواقع الذكاء البشري أقوى بكثير من الذكاء الصناعي ليكن هذا في علم الجميع. إذا كنت ذكيا و نظرت إلى موضوع الإبلاغ من عدة جوانب سوف تبدأ بالضحك.رغم هذا فأنا سعيد بإنضمامي إلى هذا المجتمع حتى لو تم طردي سأبقى على إطلاع أحداث هذا المجتمع عن قرب هذا لا يعني أنني سأنشيء حساباً من جديد و البدأ من جديد بل سأكتفي بقراءة أفكار الغير و مشاركة أفكاري مع نفسيتحياتي للكلأولفين",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "September 30, 2023, 02:49:34 AM",
      "body": "Quote from: Mulven on September 30, 2023, 02:21:23 AM……سعيد جدا لدرجة كبيرة اخي الفاضل اني اجد شخصا امازيغيا في نفس المنتدى رغم قلتنا لكني افتخر بهذا الامر كثيرا. الامر الذي حدث لك مؤسف جدا ولقد رأيت ان الادوات التي يتم استخدامها ليست دقيقة في كل المرات ومن الامثلة التي قدمت في المنشور هذا مثلا لان الامر الذي يقوم به الموقع هو فقط بسيط و مقارنة بين الفواصل والنقط بين الجمل واذا قمت بمحو النقاط والفواصل في اي فقرة او نص قمن بالتاكد منه سوف يعطيك نفس الاجابة. اذا قمت باضافة فواصل و نقاط بالمكان المناسب يحتسبك بوت واذا لم تقم بذلك فيحتسب ردك كانسان عادي وهو الامر الذي لا اعتبره عادلا.لا يمكنني التاكد بنسبة كبيرة اذا قمت بالتعدي على قوانين المنتدى لكن انا متاكد انك قمت بامور ايجابية كبيرة في المنتدى واذا كانت العقوبة قاسية على الاقل مدة معتبرة حظر الحساب فقط وليس حظر نهائي ونتمنى رؤيتك في مستقبلا في المنتدى لما تقدمه من فائدة لنا ومن افضل الاعضاء في القسم العربي واذا كان هناك فرصة لك للرجوع فانا اول الداعمين لك",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 30, 2023, 03:08:13 AM",
      "body": "آسف جدا لسماع هذه الأخبار أخي ألفين، أتمنى أن تراجع الإدارة قرارها ويلغوا الحظر. في الواقع جربت هذه الأداة التي تسمى ذكية ولكن للأسف اكتشفت أنها شديدة الغباء لدرجة يمكن أن يحصلوا على براءة اختراع باسم \"الغباء الاصطناعي\" نسخت عدة مواضيع لي أنا متأكد مليار بالمئة أن كل حرف منها من أفكاري وبدون الاستعانة بأي مصدر ورغم ذلك حصلت على نتائج مخزية جدا، بعض المنشورات أعطتني نتائج أن المقالة مزيفة 100% وأنا واثق كل الثقة أنني لم أنسخ ولا حرف من أي مصدر آخر. هذه صور التجربة، أولا نسخت المقالة كما هي في الصورة: النتيجة كانت أنها مزيفة 100% وهذا كذب 100%:                      وكما ذكر الأخ GxSTxV قمت بتغيير بعض الفواصل والنقط فأعطاني النتيجة 0.0%، كما هي في الصورة:                      كما تلاحظون في الصورة قمت فقط بإزالة الفواصل والنقط من السطر الأول فقط وكانت النتائج عكسية تماما. هذه مهزلة حقيقية.  هذا عيب، يجب على إدارة المنتدى أن تنهي هذه المهزلة فورا، لا أدري لماذا تسمح الإدارة لبعض الأشخاص بالتدخل بعملهم والتدخل فيما لا يعنيهم، هناك بضعة أعضاء أصبحوا معروفين في المنتدى ولا عمل لهم سوى مراقبة الآخرين وتصيد أخطائهم، ويبنون سمعتهم في المنتدى من خلال تدمير سمعة الآخرين.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "September 30, 2023, 03:24:04 AM",
      "body": "Quote from: yhiaali3 on September 30, 2023, 03:08:13 AM…..مع الاسف اخي فالامر واضح انه عبارة عن سوء فهم كما تاكدت ايضا من الامر لان الامر يدعي التحقق كيف يعمل هذا الموقع الذي يتحق من التعليقات. كما تم برمجة الروبوتات التي تعمل على الذكاء الاصطناعي تم برمجة الموقع على التعرف على النصوص. لسوء الحظ اذا كان شخص ما يتعامل كثيرا مع الفواصل والنقاط و صدفة مع بعض الكلمات التي يستخدمها الروبوت المبرمج من انسان بطبيعة الحال فانه سوف يقول ان الكلام من صنع روبوت حتى و ان كان الامر عكسيا.والاسوء من ذلك هو ان بعض المستخدمين وللاسف الشديد رغم وضعيتهم و مرتبتهم الكبيرة الا انهم محدودي التفكير جدا لدرجة كبيرة وبعض الاحيان تستدعي القلق حتى اني في اخر مرة تعرضت للهجوم على حسابي بشان تعدد الحسابات بمجرد ان شخصا اخر قام بنسخ محفظتي عن طريق الخطأ. لحسن الحظ اني قمت بتقديم كل الادلة وتوصلت الى ارسال رسالة شخصية للعضو الذي اتهمني مع كل الدلائل ان اتهامه باطل وهو الذي يستحق التقييم السلبي بسبب ذلك قام خوفا من حذف التهام الباطل.اتمنى ان القسم العربي والاعضاء هنا سوف يقفون دائما مع كلمة الحق مهما كان الامر لان ما يحدث شبه عنصري واتهام ضد كل الاشخاص التي لا تعتبر اجنبية.لا اعني بالذات هذه الحادثة لكن يوجد العديد من الحوادث اين يتم اتهام بعض الاشخاص باطلا بمجرد إنهم اصدقاء يتم اتهام الطرف الاخر ظلما و هذا من وجهة نظري",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 30, 2023, 05:17:03 AM",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "September 30, 2023, 10:50:32 AM",
      "body": "Quote from: yhiaali3 on September 30, 2023, 03:08:13 AMهذه صور التجربة، أولا نسخت المقالة كما هي في الصورة: النتيجة كانت أنها مزيفة 100% وهذا كذب 100%:                      Sorry, I never learned Arabian so will answer in English.No one will ever blame anyone basing on one AI detector which will show something is a single case. I checked the text you detected with sapling with two most popular detectors also. You can see that both showed human written text.If someone uses AI, his posts will get multiple positive results from multiple detectors, not just one occasional from one detector. Try to find 3 posts of anyone who writes by himself without AI bots which will be false detected by at least two of such detectors as hivemoderation, copyleaks and sapling at once. No one blames anyone just on occasional results of some random AI detector.Once again sorry for writing here in English.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 30, 2023, 11:09:28 AM",
      "body": "Quote from: jokers10 on September 30, 2023, 10:50:32 AMSorry, I never learned Arabian so will answer in English.No one will ever blame anyone basing on one AI detector which will show something is a single case. I checked the text you detected with sapling with two most popular detectors also. You can see that both showed human written text...If someone uses AI, his posts will get multiple positive results from multiple detectors, not just one occasional from one detector. Try to find 3 posts of anyone who writes by himself without AI bots which will be false detected by at least two of such detectors as hivemoderation, copyleaks and sapling at once. No one blames anyone just on occasional results of some random AI detector.Once again sorry for writing here in English.We are honored to have you with us in the Arabic section. You are, of course, welcome even if you write in English.We are sad for our friend, so we are trying to find out what really happened.You are correct. It is not possible to rely on one tool or one post to judge a member that he is using artificial intelligence. Using more than one tool on a group of posts would be fair.As you can see, in the experiment I conducted on one of my posts, completely opposite results appeared once I changed some commas and periods, so I said that this smart tool is ineffective. It would be safer to use 3 tools as you mentioned to give a correct ruling.Thank you for interacting with us on the problem, and we welcome your presence in the Arabic section.أهلا وسهلا بك في القسم العربي وشكرا على مشاركتك.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 30, 2023, 04:10:32 PM",
      "body": "أشارككم جميعا الأسف على خسارة عضو مميز مثل الأخ أولفن و قد أغبطني كثيرا على نفس الدرجة أن علمت أنه أمازيغي من الصحراء الغربية حيث قلة قليلة منهم تتفاعل مع المجتمع العربي و ليس متاح لهم المعلومات جميعها بلغتهم الأم التي تريد بعض الحكومات محوها من الحضارة. الأخ أولفن كان من القلة الذين بدؤوا مبكرا في المساهمة في القسم العربي و اثرائه بالمساهمات الهادفة و الفعالة و مساعدة الاخرين بالاضافة لاسهماته في بقية فروع القسم الرئيسي. سيكون مؤسفا أكثر أنه لن يكون بامكانه اعادة استعمال حساب بديل لأن هذا مخالف لقوانين المنتدى.بعد التثبت قليلا فهمت ان استعمال الذكاء الاصطناعي للنشر على المنتدى لم يكن السبب في الحضر و هذا بديهي تماما لأن هذا لا يمكن ان يكون سببا للحضر وفق قوانين المنتدى و وفق الأعراف الجاري بها العمل. الاحتمال الوحيد الأقرب للحقيقة هو أن حساب الأخ أولفن متورط في مجموعة حسابات farming accounts على ملك شخص واحد و قد تم حضر أحد تلك الحسابات و بالتالي فان بقية الحسابات التي على ملك نفس الشخص يتم حضرها اليا. و حسب ما وجدت فان هذه الوضعية تم رفع التقرير بها في منشور خاص منذ سنة 2020 و لم يتم تفعيل الحضر سوى منذ يومين و هذا يدخل في اعتبارات الادارة التي لا يمكن مناقشته ضمن الأولويات. أكرر أسفي لما حصل مع الأخ أولفن متمنيا له كل التوفيق في حياته العملية و الخاصة على أمل أن لا يتكرر هذا مع أي من أعضاء القسم العربي و هذه فرصة للاعتبار.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "September 30, 2023, 04:37:33 PM",
      "body": "لقد شاركت بموضوع الأخ GXSTXV -بارك الله فيه- حول هذه القضية بالإنجليزية، ويسعدني أن أشارك هنا أيضا، فالأخ أولفين عضو جيد ومعروف في القسم العربي واختفائه بمثابة خسارة للجميع، وأنا سعيد حقا لأن الأخ أولفين غير محظور الآن ويستطيع مواصلة إثراء المنتدى والقسم العربي بمشاركاته الجيدة واستخدام حسابه الأساسي دون حسابات أخرى، وكما تفضل أخوانى الكرام فإن الحظر الذي دام لشهرين لم يكن ناتجاً من إستخدام الذكاء الاصطناعي، ولكن هذا لا يمنع أن كتابة بعض المشاركات بالذكاء الاصطناعي قد يعتبر سرقة أدبية (إذا لم يذكر صاحبها أن هذه المشاركات بواسطة هذه التقنية) وقد يحرم صاحبها من المشاركة في العديد من حملات التوقيع التي من ضمن قوانينها أن استخدام الذكاء الاصطناعي ممنوع، لذلك بدل من الاعتماد عليه يمكن الاعتماد على الصيغة البشرية للشخص وأفكاره المطروحة وطريقة كتابته.وبما أن قضية الأخ أولفين انتهت الآن، فيرجى إغلاق الموضوع. شكراً لكم جميعاً",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "September 30, 2023, 05:21:15 PM",
      "body": "السلام عليكم أيها الإخوة.أرغب في التعبير عن امتناني الصادق للجميع على تقديم وجهات نظر مختلفة حول هذا الموضوع. فيما يتعلق بحظر الأخ أولفن، لم يكن ذلك بسبب تقارير السخرية منه وإنما بسبب حسابه السابق الذي كان حسابًا بديلاً. لقد شاهدت تقريره عن موضوع تجاوب الحظر، ويبدو أن حساب الأخ أولفن الأصلي تم حظره في عام 2021، وأنشأ حسابًا جديدًا بعد مرور عامين. للأسف، تضيع جميع الجهد الذي وضعه في المنتدى خلال تلك السنتين. أنا أفهم وأحترم قوانين المنتدى، ولست أقول أنها خاطئة. أقدرها بشدة. ومع ذلك، فإنه من الواضح أن أولفن قد ساهم كثيرًا في القسم العربي، وقام بمشاركة المعرفة والمشاركة في مختلف النقاشات. يجب أن يكون هناك وسيلة لتحذيره من انتهاك حسابه السابق وربما إلغاء حظره. إذا قمت بفحص ملفه الشخصي، ستجد أنه لديه \"ثقة إيجابية\"، مما يشير إلى مساهماته في هذا القسم أو هذا الموضوع. شعرت بالحزن الشديد عند رؤية حسابه محظورًا فجأة مثل هذا. أنا أدعو بأن يجد الأخ أولفن وسيلة للعودة إلينا والمشاركة في النقاشات مرة أخرى.فيما يتعلق بالأخ GxSTxV، صادفت هذا الموضوع في القسم \"ميتا\" بعنوان \"الإبلاغ عن الاستنساخ والنسخ/اللصق\"، الذي أنشأه الأخ LoyceV. لم يكن لدي الكثير من المعرفة حوله، ولكن بعد قراءة الموضوع، تعلمت أن المستخدمين يقومون بالإبلاغ عن آخرين يقومون بنسخ محتوى من مواقع الويب أو مقالات أو وسائل التواصل الاجتماعي، ثم يقدمونه هنا كملكهم الخاص. وجدت هذا الموضوع مفيدًا للغاية.قرأت أيضًا مشاركة الأخ yhiaali3، حيث ذكر أنه استخدم أدوات كشف الذكاء الاصطناعي لفحص مشاركاته الخاصة. تم اكتشاف مشاركته على أنها مزيفة بنسبة 100٪، مما يعني أنه تم إنشاؤها بواسطة أداة ذكاء اصطناعي. ومع ذلك، زعم الأخ yhiaali3 أنه قام بإنشاء المشاركة بنفسه دون استخدام أدوات ذكاء اصطناعي. سؤالي هو، إذا قام مستخدم بإنشاء مشاركة بشكل كامل بنفسه دون استخدام أي أدوات ذكاء اصطناعي ولاحظت أدوات الكشف عن الذكاء الاصطناعي وجود محتوى ذكاء اصطناعي فيها، كما ذكره الأخ jokers10، هل ستعتبر مشاركته مُنتجة بواسطة الذكاء الاصطناعي؟ في مثل هذه الحالة، إذا قام مستخدم بإنشاء 1000 مشاركة على المنتدى وتم اكتشاف وجود محتوى ذكاء اصطناعي في بعضها، مثلاً من 6 إلى 8 مشاركات، ماذا سيحدث لحسابه؟ هل سيتم حظره، أم سيتلقى علامة محايدة أو سلبية؟ كيف يمكن للمستخدم أن يثبت براءته إذا نفى استخدام أدوات ذكاء اصطناعي؟هذه هي الأسئلة التي كانت في ذهني والتي لم أتمكن من العثور على إجابات لها. رأيت العديد من التقارير في هذا الموضوع، وليس لدي الكثير من المعرفة حول كيفية التعرف على المستخدمين الذين يستخدمون أدوات ذكاء اصطناعي والإبلاغ عنهم هنا في موضوع الرسائل المزعجة الذكية. لذلك، أود أن تُوضح كل هذه الأسئلة، وربما يمكننا البحث عن المستخدمين الذين يستخدمون أدوات ذكاء اصطناعي والإبلاغ عنهم في موضوع الرسائل المزعجة الذكية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "September 30, 2023, 06:14:07 PM",
      "body": "Quote from: Nalain420 on September 30, 2023, 05:21:15 PMقرأت أيضًا مشاركة الأخ yhiaali3، حيث ذكر أنه استخدم أدوات كشف الذكاء الاصطناعي لفحص مشاركاته الخاصة. تم اكتشاف مشاركته على أنها مزيفة بنسبة 100٪، مما يعني أنه تم إنشاؤها بواسطة أداة ذكاء اصطناعي. ومع ذلك، زعم الأخ yhiaali3 أنه قام بإنشاء المشاركة بنفسه دون استخدام أدوات ذكاء اصطناعي. سؤالي هو، إذا قام مستخدم بإنشاء مشاركة بشكل كامل بنفسه دون استخدام أي أدوات ذكاء اصطناعي ولاحظت أدوات الكشف عن الذكاء الاصطناعي وجود محتوى ذكاء اصطناعي فيها، كما ذكره الأخ jokers10، هل ستعتبر مشاركته مُنتجة بواسطة الذكاء الاصطناعي؟ في مثل هذه الحالة، إذا قام مستخدم بإنشاء 1000 مشاركة على المنتدى وتم اكتشاف وجود محتوى ذكاء اصطناعي في بعضها، مثلاً من 6 إلى 8 مشاركات، ماذا سيحدث لحسابه؟ هل سيتم حظره، أم سيتلقى علامة محايدة أو سلبية؟ كيف يمكن للمستخدم أن يثبت براءته إذا نفى استخدام أدوات ذكاء اصطناعي؟Thank you for your question!As the one who actively fights with AI posting on this forum I can say that it is very unlikely that a human written post is detected by two or more detectors as an AI written. There were a couple cases when it was probably so that there was a fake result for one post from a couple of detectors. But any active user has many posts and usually all other posts give human written probability. So it is highly unlikely to get several false positive results from several AI detectors even for all the time user posted on the forum and nearly impossible to get several false positive in a couple of weeks or months of posting. If it was so, if it was just a writing style, then the same user should have the same false positives in the time before ChatGPT. But all those who was caught on AI using have 0% AI probability on pre-ChatGPT posts. So it is not about writing style.We tested this on the posts with grammar improved with Grammarly, on the posts translated with Google Translator, etc. If a post was written by human, detecting it will still give that it is human written, even if its grammar was improved or it was automatically translated.I checked many thousands of posts, I checked many respected users of the forum to be sure that AI detectors say that their posting is natural. And it is so. We know that in very rare cases even such a good tool as copyleaks can give false positives, but combination of two or more good tools will highly unlikely give false positive and nearly impossible for several posts on the timeline of several months.So no need to worry about it. Even if some random tool gives occasional false positive. Those who are fighting against AI posting on the forum know it and consider doubts in such cases as false positive. The aim is not even to find anyone who ever used AI for posting, the aim is to prevent it and demotivate users to use AI for posting. So if some AI users are not being caught but will stop doing so it is even better than to find them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}