{
  "id": "topic_5415400",
  "title": "fifi0547",
  "author": "fifi0547",
  "created_time": "September 29, 2022, 07:13:11 PM",
  "content": "I recently came across this site: https://robotscrypto.fr/. I wanted to know if you use crypto bots to help you in your trading?This site has quite a few, and it seems to work well.I would love to have your opinion on this thank you! And if you have any crypto trading bot platforms to suggest don't hesitate!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415400",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "September 29, 2022, 07:23:29 PM",
      "body": "Crypto trading robot to help someone trade? I don't do that. I trade myself after analysing the market with indicators. I use fundamental analysis too. I also use sentiment at times. I have not used bot to trade before. Although I have seen something like that on OKX before and you can also make use of other bots to trade, but I do not see any reason I should use bot to trade. Only what I can use bots for is for arbitrage trading to list prices of certain coins on different exchanges for me, and for making automatically trades. But I am not an arbitrage trader and exchanges nowadays can be used in a way you can automatically trade after the coin of your choice get to certain price you want the trade to be filled. I have not used bots before and I am not thinking that I can use one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 29, 2022, 07:57:23 PM",
      "body": "I am thinking that you are the owner of the site. The website basically just has links to existing crypto bots like 3commas so what you are doing in this case is trying to get people to register on the bot through your referral link on the site.Not every Tom, Dick and Harry can use crypto trading bots. To use them, you still need to have technical knowledge about markets and trading indicators. So first step is usually learning how to trade by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 29, 2022, 09:29:50 PM",
      "body": "There’s a lot of crypto bot already in the market, but I haven’t tried any since I do my trades on my own and I still have time for this. Bot still need to be set-up though they already have the default setting by I think without any knowledge in trading it is still hard to make profit. Don’t use bot if you don’t know yet how to use indicators, better to learn it first. Anyway, you can try other platform like Gunbot, I’ve heard many good reviews from this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "September 29, 2022, 10:04:45 PM",
      "body": "Quote from: fifi0547 on September 29, 2022, 07:13:11 PMI recently came across this site: https://robotscrypto.fr/. I wanted to know if you use crypto bots to help you in your trading?This site has quite a few, and it seems to work well.I would love to have your opinion on this thank you! And if you have any crypto trading bot platforms to suggest don't hesitate!^ Dude, trading bots won't do anything upon predicting the market, they are just a tool that can be used by selling or buying open orders when you are away from your PC. I don't have much experience but I used this before when I was active in trading, believe me, there is nothing that happen in my trading activity except another cost of buying that boot, it is a waste of time and money. However, it will help a little but can not give the exact result when it comes to market prediction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "melody82",
      "created_time": "September 29, 2022, 11:47:43 PM",
      "body": "I wish it was so easy that I could just turn on a bot and make all the money. We can all dream right? For me I think the better strategy is probably just buy and hold. Other wise I am just chasing losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 29, 2022, 11:49:21 PM",
      "body": "When did you find that site? The site only contains guides for trading bots but only 2 or 3 trading bots are mentioned there the site owner seems doesn't yet know there are lots of trading bots.How about adding this https://bitcointalk.org/index.php?topic=5278392Take note trading bot only automates your task on trading but there is no guarantee that you can make a big profit. Trading bots are also following a strategy that you set.It's risky for most traders that do not know how to use it to make sure you are familiar for some strategies before you use a bot to set up them properly for success. I notice that the website is pretty new it's 2 months old according to whoisCode:Expiry Date: 2023-07-14T12:49:01Zcreated:     2022-07-14T12:49:01ZThere is no special on that site except for a few bots and links with referral links so I think the website is just a landing page and gets benefits by referring users. Do you own this website?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "September 29, 2022, 11:57:55 PM",
      "body": "Quote from: fifi0547 on September 29, 2022, 07:13:11 PMI would love to have your opinion on this thank you! And if you have any crypto trading bot platforms to suggest don't hesitate!Bots are effective to others since that's what bots are supposed to do.Just for clarification, bots are meant to work for you based on the algorithms you will set.It is not meant to give you profits where all you need to do is to wait for the bot's actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 30, 2022, 12:01:45 AM",
      "body": "I do use trading bots like Gunbot in order to trade 24/7. This is one of the most helpful things for me, because I get to take advantage of the market, 24/7 whether any type of market is happening. I could easily automate the strategies that I’m going to utilise in trading. Have you managed to see this? Let me know and I can help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beefcake",
      "created_time": "September 30, 2022, 01:34:01 AM",
      "body": "Quote from: crwth on September 30, 2022, 12:01:45 AMI do use trading bots like Gunbot in order to trade 24/7. This is one of the most helpful things for me, because I get to take advantage of the market, 24/7 whether any type of market is happening. I could easily automate the strategies that I’m going to utilise in trading. Have you managed to see this? Let me know and I can help you.Wow gunbot goes from like 10$ to WTF! lol. But, I am curious. I could scrape together the wtf money needed, maybe I'll just start with the $10 version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "deathcode",
      "created_time": "September 30, 2022, 01:47:44 AM",
      "body": "I don't like trading with the help of robots. although some traders in the crypto market use it. there are only trials, but there are also ambitions to make a profit in the market.some of my friends who have tried bot trading, it seems that they no longer use bots in trading. maybe because the results are not satisfactory. but I've never heard of the trading bot the OP is talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 30, 2022, 02:14:24 AM",
      "body": "Quote from: Beefcake on September 30, 2022, 01:34:01 AMQuote from: crwth on September 30, 2022, 12:01:45 AMI do use trading bots like Gunbot in order to trade 24/7. This is one of the most helpful things for me, because I get to take advantage of the market, 24/7 whether any type of market is happening. I could easily automate the strategies that I’m going to utilise in trading. Have you managed to see this? Let me know and I can help you.Wow gunbot goes from like 10$ to WTF! lol. But, I am curious. I could scrape together the wtf money needed, maybe I'll just start with the $10 version.That's the super entry level. That's just to get a taste of it. It basically shows you the GUI and makes you feel like you are using the bot. It's not as customizable but it's going to get something going for your account with the stepGrid strategy integrated in the bot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "September 30, 2022, 04:46:42 AM",
      "body": "I don't use crypto trading robots for me it's too complicated because it requires knowledge to be able to set it up properly and in my opinion it becomes more time-consuming than directly trading on an exchange website. Unfortunately, many think that robots in trading can increase profits, but they don't, robots only help to make trading more automated after being set as desired.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "September 30, 2022, 05:52:56 AM",
      "body": "Quote from: fifi0547 on September 29, 2022, 07:13:11 PMI recently came across this site: https://robotscrypto.fr/. I wanted to know if you use crypto bots to help you in your trading?This site has quite a few, and it seems to work well.I would love to have your opinion on this thank you! And if you have any crypto trading bot platforms to suggest don't hesitate!For a first post like this along with shilling the website link, there is no doubt that this guy is either the owner of that website or he just hired someone to post on forums and spam links. This kind of post makes us understand that he is only here to shill and not being a passionate organic member of this forum. Link building at its finest. P.S. Correct me if I’m wrong mods, but all links here are no-follow right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "September 30, 2022, 07:04:03 AM",
      "body": "Pretty much a waste of money I guess. There's nothing special about them, because you could exactly what it does, even more to be honest. Trading bots are for those who doesn't have any time in trading, which is pretty ironic because you're supposed to spend your time on it to make sure you'll get enough experience and profit that'll benefit you in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "September 30, 2022, 08:31:56 AM",
      "body": "Quote from: fifi0547 on September 29, 2022, 07:13:11 PMI recently came across this site: https://robotscrypto.fr/. I wanted to know if you use crypto bots to help you in your trading?This site has quite a few, and it seems to work well.I would love to have your opinion on this thank you! And if you have any crypto trading bot platforms to suggest don't hesitate!It seems to work well doesn't mean it can work properly because at least you have to try it yourself to see if the robot can work or not. But my advice is that you don't need to use a robot to trade. Moreover, the crypto market is up and down, making it difficult for you to set orders so that the robot can run according to your settings. If you want to trade, it is better if you study your own market analysis so that you will have the ability to analyze. This is much better than using a robot and. You can stop whenever you want and don't have to pay rent or buy any robots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaveOurSea",
      "created_time": "September 30, 2022, 09:18:47 AM",
      "body": "Quote from: AicecreaME on September 30, 2022, 07:04:03 AMPretty much a waste of money I guess. There's nothing special about them, because you could exactly what it does, even more to be honest. Trading bots are for those who doesn't have any time in trading, which is pretty ironic because you're supposed to spend your time on it to make sure you'll get enough experience and profit that'll benefit you in the long run. Trading bots are not a good choice although indeed some people use them for various reasons like they want to trade but on the other hand they don't have enough time,if you have to choose, of course it's better to trade manually because we can also learn while",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "September 30, 2022, 10:02:24 AM",
      "body": "I preferred actual trading as I wanted to learn more about trading. May trading bots seem it works well but not all. But if you have enough time in front of your computer and do trading, I suggest doing it rather than relying upon bots which as we know that was relying on you back and the decision is also coming from you. If you fail to set it carefully, never think it will make its own decision and for sure it will fail as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "September 30, 2022, 02:19:38 PM",
      "body": "Quote from: Kelvinid on September 30, 2022, 10:02:24 AMIf you fail to set it carefully, never think it will make its own decision and for sure it will fail as well. This is one of the disadvantages of using bots. You have to always be sure that the settings are right otherwise you would have wasted your time or it does a wrong trade for you and you run into loses or risk your account being close out of fund. It is better like most responses have said to do a manual type of trading to analyse the market, trade while learning to be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "monineklutak",
      "created_time": "September 30, 2022, 04:45:41 PM",
      "body": "Quote from: fifi0547 on September 29, 2022, 07:13:11 PMI recently came across this site: https://robotscrypto.fr/. I wanted to know if you use crypto bots to help you in your trading?This site has quite a few, and it seems to work well.I would love to have your opinion on this thank you! And if you have any crypto trading bot platforms to suggest don't hesitate!Trading Robot does look convincing because it is like auto pilot, but there is a dangerous side,especially if I analyze their site https://robotscrypto.fr/ it's really not worth it, because they really don't have the credibility and security that guarantees their users, because there are many cases of traders using trading robots ending sadly. Yest hey lost all cryptocurrency assets in the exchange wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}