{
  "id": "topic_5404421",
  "title": "Rruchi man",
  "author": "Rruchi man",
  "created_time": "June 28, 2022, 09:47:41 PM",
  "content": "The most popular suggestion you can get when trying to quit gambling especially when you are continuously loosing money is mostly that you should just stop gambling itself. This sounds like an almost impossible task for many who are already hooked to it and just hearing that alone is discouraging. A better suggestion and an alternative to quitting gambling completely is to start betting with fake money gambling apps. With FAKE MONEY GAMBLING APPS, you can continue gambling on the app even on live games, but with fake money. So in reality you can maintain the experience you derive from gambling and not loose any money except the fake one in the process.Although the original idea behind the creation of such apps was to provide a platform were individuals can practice their betting skills without loosing money before actually gambling with real money, i still find it useful to those trying to quit because they keep loosing money. In Order of user rating and for suggestion sake, some of the best fake money gambling apps according to user experience, core functionality & innovative solution are (please note that some of these apps still offer real gambling services, and if you really want to stop loosing money, you should avoid)                                                                                                                                          Quote- Bovada is an app made by Toloka Product. It has an average rating of 4.9 and has received 6648 ratings.- DraftKings – Daily Fantasy Sports for Cash is an app made by DraftKings, Inc.. It has an average rating of 4.5 and has received 81454 ratings. - BetQL – Sports Betting Data is an app made by QL Gaming Group. It has an average rating of 4.2 and has received 591 ratings.- Sports Betting Tips & Sports Picks by KingPin.pro is an app made by www.KingPin.pro LLC. It has an average rating of 4.2 and has received 376 ratings.- BETUP is an app made by UPAPP. It has an average rating of 4 and has received 31685 ratings. source What is your opinion on Fake money gambling apps, do you recognize the potential I think they have to assist in reducing the number of gamblers who loose real money?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404421",
  "comments": [
    {
      "author": "Johnyz",
      "created_time": "June 28, 2022, 09:55:25 PM",
      "body": "Gambling apps that involves no money is still giving you an idea about how gambling works and you might be tempted to gamble again later on especially if you gain skills on those gambling apps.If you really want to quit gambling, you should disconnect from any gambling games or activities, this might not look easy but slowly you can be good again, just stay committed on quitting and you can recover from that addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "June 28, 2022, 10:20:56 PM",
      "body": "Gambling with fake money won't give the satisfaction you get from betting with real money because you're not taking a risk and you know you are not winning or losing in the real sense. It can't be called gambling if there is no possibility of a true win or loss. I don't think anyone who enjoys gambling would patronize those apps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "June 28, 2022, 10:24:07 PM",
      "body": "There has been a lot of apps that you play with fake money, like slots, card games and others that simulate real games with real money. But still I don't think there is thrill with playing this games because at the back of our mind this is still fake. Gamblers wanted that adrenaline rush, but they will not get it from this fake games. On the contrary, it will make them more addicted in my opinion, because it will make them to play the real stuff once they got money in their wallets.If someone wants to stop gambling, then simply disengage yourself from any activity related to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "June 28, 2022, 10:39:00 PM",
      "body": "Quote from: Rruchi man on June 28, 2022, 09:47:41 PMWhat is your opinion on Fake money gambling apps, do you recognize the potential I think they have to assist in reducing the number of gamblers who loose real money?How come you ended up with that horrible idea? Do you really think it has the potential to minimize the gambling activity of a certain gambler?Non-paying apps are already common apps and there are lots of them from anywhere. Did you even imagine what's the effect of it on a player who will experience big winnings on that app but it's just virtual money that they will receive? If they can win big at these apps, it will just give them more interest to test their luck at legit gambling-paying application apps.That tool won't help. You just contradicted this statement of yours if you truly believed on that idea:Quote\"This sounds like an almost impossible task for many who are already hooked to it and just hearing that alone is discouraging.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "June 28, 2022, 10:41:15 PM",
      "body": "Quote from: Rruchi man on June 28, 2022, 09:47:41 PMWhat is your opinion on Fake money gambling apps, do you recognize the potential I think they have to assist in reducing the number of gamblers who loose real money?It's known that this kind of thing like: \" Fake money gambling apps or when it comes to day trading there's a demo account \" this doesn't help at all, when the person is playing with fake money they don't have the feeling of pain when they lose or feeling of joy when you win and for this reason the person will not make an effort to win and will end up giving up using the application. about using the app to fight addiction this is a bad idea, addiction is only treated with the help of a doctor and stop for some time and or permanently (never play again). That's why in my opinion using Fake money gambling is a waste of time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 28, 2022, 10:42:32 PM",
      "body": "Quote from: Rruchi man on June 28, 2022, 09:47:41 PMA better suggestion and an alternative to quitting gambling completely is to start betting with fake money gambling apps. With FAKE MONEY GAMBLING APPS, you can continue gambling on the app even on live games, but with fake money. So in reality you can maintain the experience you derive from gambling and not loose any money except the fake one in the process.Although the original idea behind the creation of such apps was to provide a platform were individuals can practice their betting skills without loosing money before actually gambling with real money, i still find it useful to those trying to quit because they keep loosing money. This reminds me of the formal Chelsea manager Maurizio Sarri who chewed on a synthetic cigarette to mimic the actual thing while watching the game. This was to serve some therapeutic purpose or some other reasons to his addictive nature but sadly, he haven't stopped smoking.This could be related to this fake money of a thing. It's likely not going to help so many, instead it would recycle back to its original purpose of actually helping them to practice some other techniques to betting on there favourite sports and the next thing, they would be ready to go live. Just like in demo trading! Your always sure to test out your tricks in the life and make profits off it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "June 28, 2022, 10:52:06 PM",
      "body": "Quote from: Rruchi man on June 28, 2022, 09:47:41 PM....A better suggestion and an alternative to quitting gambling completely is to start betting with fake money gambling apps.The main intention of these fake money apps is to get you stay hook with gambling and play with real money again when you get funds. This is just giving the gambler a temporary break the way I see it and I don't really consider that as a better alternative. It's really a stretch to think it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "June 28, 2022, 11:09:30 PM",
      "body": "Quote from: Rruchi man on June 28, 2022, 09:47:41 PMWhat is your opinion on Fake money gambling apps, do you recognize the potential I think they have to assist in reducing the number of gamblers who loose real money?I don't think it will help reduce the number of gamblers, there's no fun for a gambler if there's no money involved, they will just blame themselves if they win a lot from these Fake money gambling apps but no real money attach to it, the real challenge and excitement is when there is money involve and you are challenged to double or not lose that money, many will find it boring, they will just use it as a test skill or develop their skill but if they decide to go to play serious games, the casino is still the place to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "June 28, 2022, 11:20:35 PM",
      "body": "That's not the essence of gambling if you'll play with fake or play money.The purpose of why gambling isn't just for fun and entertainment, we do get to hear this most of the time but let's embrace that the reality is all about gambling with real money.And the real fun is when you're winning with those bets you made and knowing that it's an actual crypto or money that you can spend again for anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "June 28, 2022, 11:31:56 PM",
      "body": "Quote from: Pokapoka124 on June 28, 2022, 10:20:56 PMGambling with fake money won't give the satisfaction you get from betting with real money because you're not taking a risk and you know you are not winning or losing in the real sense. It can't be called gambling if there is no possibility of a true win or loss. I don't think anyone who enjoys gambling would patronize those apps.  ^ Though that does not give satisfaction, when I want to withdraw the fake money from the gambling casino it becomes real when it will arrive in my wallet but if not, it is complete nonsense. But there is an app that I remember like this when you have a lot of fake money that they had, you can convert it as a load in any internet provider that found in your place. But the game is kind of difficult to hunt the fake money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "June 28, 2022, 11:40:56 PM",
      "body": "Quote from: Yogee on June 28, 2022, 10:52:06 PMQuote from: Rruchi man on June 28, 2022, 09:47:41 PM....A better suggestion and an alternative to quitting gambling completely is to start betting with fake money gambling apps.The main intention of these fake money apps is to get you stay hook with gambling and play with real money again when you get funds. This is just giving the gambler a temporary break the way I see it and I don't really consider that as a better alternative. It's really a stretch to think it is. Exactly.The real thrill will come with real money and that's why these fake money will just attract you more to deposit and get on the real action. That's part of psychological factor that will make the curious to get into the actual thing.It's part of the marketing of the casinos to have you engage with them and it's good for them if they have this feature because it's another way to convince that playing with fake money ain't enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "June 28, 2022, 11:48:48 PM",
      "body": "But eventhough you use fake money from those apps it will just raise up your curiosity to gamble by using the real money if you see your strategy work on those free apps. For sure you will be intrigue the money you possible to earn if you use your own hard earned money to gamble.If people really want to stop gambling if this is really their intention they should uninstall those apps since it will be a convincing tool for them to gamble a lot of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "June 29, 2022, 12:36:42 AM",
      "body": "Well, see the idea behind gambling being addicting isn't the game itself, nor the idea of \"being able to use money\" aspect, but rather the fact that if they win, they get money. REAL money they can use and pay for stuff outside. I honestly would just say to a person getting addicted is to spend that money elsewhere instead and not for anything good like donations or whatnot, but rather to hobbies that they can enjoy. Let's say, buy Gundam models, maybe even gacha games since even though they spend money, the return they get is the enjoyment which limits the possibility of being addicted due to \"money\". Heck, it may even be a detriment at some point to spend money for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 29, 2022, 12:38:42 AM",
      "body": "Using BTC was already an alternative because back then they were using fiat money and it worked because BTC still is a currency but the addiction persist.Using Fake money is likely not going to work l, most of these gamblers find thrill in betting something with real value. What they need is something that will keep them occupied until they forget gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "June 29, 2022, 01:34:46 AM",
      "body": "Quote from: Pokapoka124 on June 28, 2022, 10:20:56 PMGambling with fake money won't give the satisfaction you get from betting with real money because you're not taking a risk and you know you are not winning or losing in the real sense. It can't be called gambling if there is no possibility of a true win or loss. I don't think anyone who enjoys gambling would patronize those apps.  Thats true. Its not the same if you use real money. However this can be helpful to those gamblers who cant refrain themselves from playing but afraid to lose their money or should I say doesnt have money at all to gamble. Using fake money might not be enough to satisfy ourselves but still its a good alternative for gamblers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "June 29, 2022, 01:59:09 AM",
      "body": "Quote from: Rruchi man on June 28, 2022, 09:47:41 PMWhat is your opinion on Fake money gambling apps, do you recognize the potential I think they have to assist in reducing the number of gamblers who loose real money?I don't think playing with fake money would help addicted players.When playing with fake money there is not that thrill of winning a prize and feeling rich, in the same way the player will not be desperate to try to recover his bankroll if he loses all his money.Fake money platforms are good for testing a player's skills or knowledge before moving on to real money, but I don't think they help to control the emotions of playing for real money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "June 29, 2022, 02:02:20 AM",
      "body": "I recall asking a similar question some weeks back that if there was a place where a gambler could practice his skills to mitigate loss and have more exposure to casino games but the reply I had was that it was going to be expensive for gambling house to maintain them for free as this may become a more capable expenditure.If we are to go by those apps, you wouldn't have much experience as the games may be limited and moreover, what's the purpose of playing if you are not playing to have the money, you wouldn't have this zeal and passion for that, it will just look as if you are playing a normal game on your mobile phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "June 29, 2022, 02:13:26 AM",
      "body": "Quote from: Rruchi man on June 28, 2022, 09:47:41 PMThe most popular suggestion you can get when trying to quit gambling especially when you are continuously loosing money is mostly that you should just stop gambling itself. This sounds like an almost impossible task for many who are already hooked to it and just hearing that alone is discouraging. A better suggestion and an alternative to quitting gambling completely is to start betting with fake money gambling apps. With FAKE MONEY GAMBLING APPS, you can continue gambling on the app even on live games, but with fake money. So in reality you can maintain the experience you derive from gambling and not loose any money except the fake one in the process.Although the original idea behind the creation of such apps was to provide a platform were individuals can practice their betting skills without loosing money before actually gambling with real money, i still find it useful to those trying to quit because they keep loosing money. In Order of user rating and for suggestion sake, some of the best fake money gambling apps according to user experience, core functionality & innovative solution are (please note that some of these apps still offer real gambling services, and if you really want to stop loosing money, you should avoid)                                                                                                                                          Quote- Bovada is an app made by Toloka Product. It has an average rating of 4.9 and has received 6648 ratings.- DraftKings – Daily Fantasy Sports for Cash is an app made by DraftKings, Inc.. It has an average rating of 4.5 and has received 81454 ratings. - BetQL – Sports Betting Data is an app made by QL Gaming Group. It has an average rating of 4.2 and has received 591 ratings.- Sports Betting Tips & Sports Picks by KingPin.pro is an app made by www.KingPin.pro LLC. It has an average rating of 4.2 and has received 376 ratings.- BETUP is an app made by UPAPP. It has an average rating of 4 and has received 31685 ratings. source What is your opinion on Fake money gambling apps, do you recognize the potential I think they have to assist in reducing the number of gamblers who loose real money?If ever there is a Fake money gambling apps,  there is a big reason why the owner of that apps has been created, it could be a trap for the new investors who will get attempt to download it and try to play it. In that way for sure the victims will decide to invest even there is a condition in the Fake gambling apps. I guess you get what I mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "June 29, 2022, 02:25:00 AM",
      "body": "If it is fake then obviously, every is going to be fake as well, the experience the money etc. So it's not a better alternative for gamblers to spent their time as if trying to heal themselves from gambling. But they know it's not going to work, maybe they can used this apps to just pass their time. But it won't help them to completely stop from gambling. And I'm thinking this free apps might encourage others to try and maybe want to try the real one?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}