{
  "id": "topic_5440901",
  "title": "nathan_tek",
  "author": "nathan_tek",
  "created_time": "February 22, 2023, 09:51:08 PM",
  "content": "Die Qual  der Wahl. Aber welcher solls sei? Welcher wirft etwas an Profit ab,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440901",
  "comments": [
    {
      "author": "Lakai01",
      "created_time": "February 23, 2023, 05:47:54 AM",
      "body": "Wenn dir diese Frage jemand mit Gewissheit beantworten könnte wer derjenige schon lange nicht mehr hier sondern irgendwo auf einer einsamen Insel die ihm gehört. Es gibt verschiedene Strategien um möglichst viel Profit aus dem kommenden Bullrun mitzunehmen. Meine ist ganz einfach: Staken von sehr gut performenden Coins wie ADA und AVAX, geringe Positionen von vielversprechenden Coins wie Aleph Zero aufbauen und den Großteil in BTC halten ... UND NICHT TRADEN ... wenn man nicht genau weiß was man tut!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hanz-Wurscht",
      "created_time": "February 23, 2023, 03:56:32 PM",
      "body": "Es gibt keinen COIN , wo man ein ROI von unter einem Jahr hat. Die Coins, wo man viel raus bekommt, sind die Miner extrem teuer, wobei auch komplett unrentable Miner noch richtig Geld kosten.Jetzt ist es wirklich besser, direkt in den Coin zu investieren.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "February 23, 2023, 03:57:16 PM",
      "body": "Du kannst dich ja mal auf https://www.whattomine.com/ umschauen und eingeben was du an Hardware hast / GPUs und wenn ja welche und wie viele bzw. Asics und wenn ja welche und wie viele, dann deine Stromkosten, Pool Fees, etc. eingeben, dann wirfst dir der Calculator raus was grob zu erwarten wäre...Wäre mal der erste Schritt um es grob einzunorden.Im zweiten schritt dann schauen mit welcher Software / welchen Pool du minen willst um effektiv und wenig fees zu bezahlen.Aber erst mal einen Schritt vor dem anderen...Meld dich gerne wenn du fragen hast, hier gibts einige die das auch machen oder hinter sich haben, bei den Strompreisen  Viele GrüßeWilli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "February 23, 2023, 04:13:42 PM",
      "body": "Quote from: nathan_tek on February 22, 2023, 09:51:08 PMDie Qual  der Wahl. Aber welcher solls sei? Welcher wirft etwas an Profit ab,Ich habe deinen Thread verschoben da es zu den Altcoins gehört nathan_tek.Die passenden Rückmeldungen hast du ja bereits erhalten",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "February 23, 2023, 08:30:54 PM",
      "body": "@nathan_tek Hast du bisher erste Erfahrungen mit Mining gesammelt oder bist du komplett neu auf dem Gebiet?Falls du komplett neu bist, solltest du dir vielleicht Gedanken in die andere Richtung machen, ob es sich nicht sogar eher lohnen könnte, statt in Miner/Hardware direkt in die jeweiligen Coins zu investieren.Rechne dir auf jeden Fall auch die Zeit bzw. den Aufwand mit ein, die du investieren müsstest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "February 27, 2023, 08:42:52 AM",
      "body": "Quote from: sam00 on February 23, 2023, 08:30:54 PMFalls du komplett neu bist, solltest du dir vielleicht Gedanken in die andere Richtung machen, ob es sich nicht sogar eher lohnen könnte, statt in Miner/Hardware direkt in die jeweiligen Coins zu investieren.Rechne dir auf jeden Fall auch die Zeit bzw. den Aufwand mit ein, die du investieren müsstest  Das würde ich genauso unterschreiben. Wenn man nicht bereits die Infrastruktur zu Hause hat (allen voran Hardware und kostenlosen/kostengünstigen Strom), dann wird sich der Mining-Aufwand kaum lohnen. Da wäre das Geld vermutlich in stake-bare Coins besser aufgehoben, die werfen dann auch noch gut Prozente ab über die Jahre hinweg gesehen. Gab es hier im Forum nicht sogar mal Berechnungen inwieweit eine Direktinvestition sich besser rechnet als das Mining für den jeweiligen Coin aufzubauen? Habe jetzt leider auf die Schnelle nix dazu gefunden ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "March 03, 2023, 01:16:41 PM",
      "body": "Quote from: Lakai01 on February 27, 2023, 08:42:52 AMGab es hier im Forum nicht sogar mal Berechnungen inwieweit eine Direktinvestition sich besser rechnet als das Mining für den jeweiligen Coin aufzubauen? Habe jetzt leider auf die Schnelle nix dazu gefunden ... Ja stimmt da gab es auf jeden Fall etwas.Auf die Schnelle hätte ich nur diesen Thread zu dem Thema gefunden: Mining von Altcoins sinnvoll ?Wenn mir noch etwas dazwischen kommt werde ich es hier einfügen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}