{
  "id": "topic_5452351",
  "title": "Black susano",
  "author": "Black susano",
  "created_time": "May 11, 2023, 10:25:36 AM",
  "content": "As a trader many skills are required for trading successful ly in the financial markets, they include the abilities to evaluate a trading fundamental and to determine the direction of a stocks trend.But for me neither of these technical skills is as important as the trader mindset that is the \" PSYCHOLOGY OF A TRADER\" SOME KEYPOINT IN PSYCHOLOGY OF A TRADER * UNDERSTANDING FEAR ÷ When trader get bad new about a certain stock or about the economy in general, they naturally get scared. They also overreact and compelled to liquidate their holding and sit on the cash refraining from taking any more risk. A Trader need to understand what fear is, it is a natural reaction to aperceived threal. *OVERCOMING GREED÷ As a trader the major problem is overcoming greed in my country they is an old saying on wall street that \" pigs get slaughtered \" this means the habits of greedy investors have of handing on to a winning position too long to get every last tick upward in price. sooner or later, the trend reverses and the greedy get caught. I no as a human greed is not easy to overcome, it's often based on the instinct to do better and get a little more. *SETTING RULES÷ A trader need to create rules and follow them when the psychological crunch comes. always set out guidelines based on your rise reward tolerance for when to enter a trade and When  to exit it. set a profit Target and put a stop loss in place to take emotion out of the process. *STAY FLEXIBLE÷ It's very important for trader to remain flexible and consider experimenting from time to time. one of the best ways a trader can learn is by experimenting ( within reason ). The experience may also help reduce emotion influence. This period assessment can help us the trader to correct our mistakes and change our bad habits for trading. source https://www.investopedia.com/terms/t/trading-psychology.asp",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452351",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "May 11, 2023, 10:34:48 AM",
      "body": "OP let me first advise you by making this important correction to how you should post a content in case of next time, always make use of line spacing or let me put it this way, paragraphing is very important in making your work more presentable to the reader, you will need to apply such network it point you're raising and discussing than writing everything altogether without a paragraph inserted at all,  this should be an added psychological application of writing a post and making it presentable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 11, 2023, 11:05:09 AM",
      "body": "Psychology is important for human.If you are not confident about yourself, you can not be strong enough to succeed as along your way to success, you will be challenged by many troubles, barriers and even enemies. You must be strong mentally to succeed.In trading, in the market, you will have to understand Psychology cycles of market to know why most of people response the same in a same market. The crowd is mostly manipulated by whales and market makers because they can not control their fear, greed, emotion and generally it's about psychological challenge.Psychology of a market cycle",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 11, 2023, 11:10:49 AM",
      "body": "Overcoming greed is most important thing in trading. Just use the amount of money that you are able to afford to lose for trading. Do not use leverage that can lead to fast liquidation of your trading fund. Going less than 2x leverage can be better. Do you know that some people are good traders but they continue losing because of greed.In addition, a trader should not be addicted. Have something recreational that you are doing. Do not let trading take your time in a way it will become a problem for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 11, 2023, 11:15:30 AM",
      "body": "Quote from: Oshosondy on May 11, 2023, 11:10:49 AMOvercoming greed is most important thing in trading. Just use the amount of money that you are able to afford to lose for trading. Do not use leverage that can lead to fast liquidation of your trading fund. Going less than 2x leverage can be better. You must overcome your greediness by don't use leverage.With newbies, if they fail to not use leverage, they will fail to control what leverage they use. It is very easy to say I will not use leverage is higher than 2x but later you will use 5x, 10x or 50x.On some exchanges, you have to click on Confirm to start using their leverage trading tab and if you don't complete that confirmation, it is a good prevention to not use Leverage.It can be more risky if you use altcoins as your collateral for leverage trading. Altcoins can be dumped a lot and reduce your collateral value to a level that can cause forced liquidation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "May 11, 2023, 03:01:30 PM",
      "body": "Quote from: Black susano on May 11, 2023, 10:25:36 AM* UNDERSTANDING FEAR ÷ When trader get bad new about a certain stock or about the economy in general, they naturally get scared. They also overreact and compelled to liquidate their holding and sit on the cash refraining from taking any more risk. A Trader need to understand what fear is, it is a natural reaction to aperceived threal. It is the natural reaction for action to happen after the feeling of fear has been accommodated. It is natural to have some kind of fear no matter how hard you try not to show it to seem tough, what understanding fear means to me is for you to understand that the reaction after should not be made without control or consideration. The chances of making wrong decisions in trading increase if you make decisions without controlling the effect that the feeling of fear gives.Quote from: Black susano on May 11, 2023, 10:25:36 AM*STAY FLEXIBLE÷ It's very important for trader to remain flexible and consider experimenting from time to time. A trader who refuses to be flexible with their strategy will not be a successful trader. A part of trading requires you be able to observe and know when your strategy is no longer functional or effective and then be flexible ssek and accept changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 11, 2023, 04:08:09 PM",
      "body": "Quote from: Oshosondy on May 11, 2023, 11:10:49 AMOvercoming greed is most important thing in trading. Just use the amount of money that you are able to afford to lose for trading. Do not use leverage that can lead to fast liquidation of your trading fund. Going less than 2x leverage can be better. I agree with you because it's the greed that empties the portfolio of a trader. We humans are emotional beings by nature and in trading some people get affected very adversely by the emotions that they put all their money into trading without gaining proper understand about markets. The greed is the main destructive factor in the case as a trader when earns some profits thinks that in few days the trading will change their life and make them rich. That's why they put all their savings into trading without getting familiar with the risks that one must have to understand before jumping into trading. There are some over greedy traders who are so naive in this case that they leverage blindly and lose their capital. Leverage is the riskiest thing for a trader, it holds the power to liquify the whole capital of a trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 11, 2023, 06:03:19 PM",
      "body": "Normally, trading is not for everybody; some people are just good at holding, but due to that act of greed, they think that trading is what can give them more profit, so they end up going into trading and ending up losing their funds along the way. It's not as if everyone who is involved in trading loses their funds, but every crypto trader doesn't make a 100% successful trade all the time. The truth of this matter is that not everyone can really be good at trading because, phycologically, they cannot have control over their emotions when carrying out trades. They can mismanage their funds and run into big losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 11, 2023, 08:48:02 PM",
      "body": "IMHO. You shouldn't put them altogether closely on this thread and you may add some space to make it easier to read for each important factor you've mentioned.Quote from: Black susano on May 11, 2023, 10:25:36 AM*STAY FLEXIBLE÷ It's very important for trader to remain flexible and consider experimenting from time to time. one of the best ways a trader can learn is by experimenting ( within reason ). The experience may also help reduce emotion influence. This period assessment can help us the trader to correct our mistakes and change our bad habits for trading. source https://www.investopedia.com/terms/t/trading-psychology.aspAnd this isn't just all about being influenced by the market but being a trader with a decisive approach towards the market. You're not easy to be influenced by any other influencer or news that you see.However, you're also good in adopting any helpful thoughts and sentiments being shared by other traders but you're just going to consider them if they're good enough with your trading strategies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "May 11, 2023, 09:13:40 PM",
      "body": "Quote from: tbct_mt2 on May 11, 2023, 11:15:30 AMQuote from: Oshosondy on May 11, 2023, 11:10:49 AMOvercoming greed is most important thing in trading. Just use the amount of money that you are able to afford to lose for trading. Do not use leverage that can lead to fast liquidation of your trading fund. Going less than 2x leverage can be better. You must overcome your greediness by don't use leverage.With newbies, if they fail to not use leverage, they will fail to control what leverage they use. It is very easy to say I will not use leverage is higher than 2x but later you will use 5x, 10x or 50x.On some exchanges, you have to click on Confirm to start using their leverage trading tab and if you don't complete that confirmation, it is a good prevention to not use Leverage.It can be more risky if you use altcoins as your collateral for leverage trading. Altcoins can be dumped a lot and reduce your collateral value to a level that can cause forced liquidation.Not all would really be having that kind of patience on going with the right path on a slow and steady pace but rather they would really be going into that fast pace and would directly be going into those high leveragewithout even trying to look at on the imposing risks on which it could really give on. They would really be just mindful on the time that they would really be losing up huge money on the time that they have dive in into this market. Being greedy would really be the first thing you would really be minding or feeling off when you are really just a newbie, you would really be minding on how to make yourself make huge income or money or profits when you do make out trades but on the time that you would really be on the field then this is where impression and realization would kick in.We do have different approach about of this speculative or random market.Some might be thinking that they could handle it in no time and having those unrealistic approach and to those people who are really that mindful about taking steps and really be that careful on what they are doing . Each person is different and this is why different actions would be madewill really be that different too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "May 11, 2023, 09:29:26 PM",
      "body": "Quote from: greengrassis on May 11, 2023, 06:55:28 PMThe issue of psychology in trading is quite acute. You need to understand that it is precisely due to the ability to psychologically correctly respond to market movements that you can significantly change the results of work.Emotions are the common problem with regards to trading, and many are tend to be more emotional which results to a negative trade, this is not easy to control but you have to learn how to. If you are going to trade, the first thing that you need to learn is how to control your emotion, and how you can trade effectively because if there’s too much emotion, you might forget how to trade properly and follow your emotion which is not good at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 11, 2023, 10:59:23 PM",
      "body": "I am a psychology student and let me tell you this what I have learned from experience and knowledge. Human mind is not as simple as that. Just saying and acting on that is never an easy job. Human mind needs training and overtime it becomes a habit. We all know that we are slaves to our habits. Trials and errors are the best way to do it. Keep practicing until you make it perfect. The more you do it, the easy it becomes. As human beings, it is natural for us to experience such emotions, but as I said, we are all slaves to habit. The more you face your fear, the more you earn the courage to fight it back. This is where psychology should be used. In order to have control over our emotions when it comes to trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 11, 2023, 11:35:06 PM",
      "body": "Yes, and I tend to agree with the OP that psychology is a very important aspect of trading, as it can help traders develop the mental skills and strategies needed to navigate the risky and challenging world of the financial markets, especially in trading.  Because IMO, trading isn't for everyone and if you don't have knowledge or skills trading isn't for you. Quote from: goaldigger on May 11, 2023, 09:29:26 PMQuote from: greengrassis on May 11, 2023, 06:55:28 PMThe issue of psychology in trading is quite acute. You need to understand that it is precisely due to the ability to psychologically correctly respond to market movements that you can significantly change the results of work.Emotions are the common problem with regards to trading, and many are tend to be more emotional which results to a negative trade, this is not easy to control but you have to learn how to. If you are going to trade, the first thing that you need to learn is how to control your emotion, and how you can trade effectively because if there’s too much emotion, you might forget how to trade properly and follow your emotion which is not good at all. Traders who can manage their emotions and make rational decisions are more likely to be successful than those who are driven by fear, greed, or other emotions.  IMO, psychology can help traders understand how their emotions affect their trading decisions and develop strategies to keep emotions in check.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 12, 2023, 07:29:09 AM",
      "body": "Talking is easy, but taking action seems difficult, especially when you are trying to risk something that the brain considers valuable and a reason for happiness, which is money.Greed is an emotion and a feeling, and without it, we would not have undertaken any high-risk trading, and therefore you must tune in to that greed that controls this emotion, otherwise you will be satisfied with the guaranteed profit that the bank offers you.I can write thousands of influential words, but after reading them all and in the first test, you fail in trading. The reason for that is that emotions and controlling them comes from real practice in doing trading more than from theoretical knowledge. When fear comes, logic loses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "May 12, 2023, 01:29:32 PM",
      "body": "Quote from: Black susano on May 11, 2023, 10:25:36 AM*STAY FLEXIBLE÷ It's very important for trader to remain flexible and consider experimenting from time to time. one of the best ways a trader can learn is by experimenting ( within reason ). The experience may also help reduce emotion influence. This period assessment can help us the trader to correct our mistakes and change our bad habits for trading. I believe this is kind of related to a trader tasting his strategy from time to time doing demo trading. In trading, you don't experiment with live account because anything can happen while you try to adjust parameters of and on. So advise using a demo account is good for experiment before getting back to trading live. Experimenting itself is very good for a trader because it helps to be flexible and understanding better ways to trade even in most difficult times and volatility.Quote from: Oshosondy on May 11, 2023, 11:10:49 AMDo you know that some people are good traders but they continue losing because of greed.This is right and the reason is greed and abandoning the proper thing. Some professional traders sometimes avoid using stop loss in an order because they are over confident that trade will go there way but they ended up blowing out there account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irhact",
      "created_time": "May 12, 2023, 02:21:32 PM",
      "body": "Quote from: Black susano on May 11, 2023, 10:25:36 AM*STAY FLEXIBLE÷ It's very important for trader to remain flexible and consider experimenting from time to time. one of the best ways a trader can learn is by experimenting ( within reason ). The experience may also help reduce emotion influence. This period assessment can help us the trader to correct our mistakes and change our bad habits for trading. source https://www.investopedia.com/terms/t/trading-psychology.aspStaying flexible is very important for a trader, it's good to have a strategy that you use and only rely on but at some times that strategy mightn't be effective therefore it's good when a trader is very flexible that he can change between different strategy that he has and choose the best rio use often so he can return to making profits from his traders.A trader shouldn't have close mind, he shouldn't be greedy as greed brings downfall to traders. Don't over expect more gains from the market. When your target has been reached, just take profits and close that particular trade before the market turns it against you and you lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 13, 2023, 12:32:31 PM",
      "body": "Quote from: irhact on May 12, 2023, 02:21:32 PMStaying flexible is very important for a trader, it's good to have a strategy that you use and only rely on but at some times that strategy mightn't be effective therefore it's good when a trader is very flexible that he can change between different strategy that he has and choose the best rio use often so he can return to making profits from his traders.Being flexible is hard to manage and it is not like being impatient and give up your initial plan then turn to a new plan. A flexible trader like that will lose money even if his first plan is good, and he loses money for the second plan which is bad and not well-planned.If you are flexible, open minded to realize your mistake, then turn to a new plan or simply just close your positiong, stay outside the market to observe it for a while, it would be better. You will have time to learn more about trading as well as think about your mistakes with previous decision.QuoteA trader shouldn't have close mind, he shouldn't be greedy as greed brings downfall to traders. Don't over expect more gains from the market. When your target has been reached, just take profits and close that particular trade before the market turns it against you and you lose. A good trader must take profit as well as cut loss without hesitance if it is a time to do that. Even it causes a less profit than expected or a loss that is painful but by cutting loss, he will avoid bigger loss when the market reverses its trend completely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "May 13, 2023, 02:29:56 PM",
      "body": "In the field of trading, especially in crypto, having the power to be able to control your own psychology is indeed a must. Because if traders cannot control their psychology, they will usually tend to always be in a hurry, do not have their own stance in determining which crypto assets to use as trading material, and will give up more quickly in carrying out the trade. Because traders in crypto can't control their psychology, they definitely don't have enough patience and follow their passions too much.But controlling your own psychology is not an easy thing. It will definitely take quite a long time to be able to control it. Because I personally got valuable lessons about being able to control this psychology, mostly from the experiences I had when trading. Not just once, but many times, and finally all of these experiences made me aware. And things like this are natural for people who are plunging into a new field for the first time, including in the world of crypto trading too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "May 13, 2023, 03:28:52 PM",
      "body": "Quote from: Rruchi man on May 11, 2023, 03:01:30 PMIt is the natural reaction for action to happen after the feeling of fear has been accommodated. It is natural to have some kind of fear no matter how hard you try not to show it to seem tough, what understanding fear means to me is for you to understand that the reaction after should not be made without control or consideration. The chances of making wrong decisions in trading increase if you make decisions without controlling the effect that the feeling of fear gives.You're actually on spot there and I was telling the same thing for other users/people even outside the forum. They think that it is possible to keep these emotions away especially \"fear\".  It's just part of being a trader/hodler to have fear as nobody hella know what's it's going to be in the next couple of weeks even though for the veteransPeople just grow over it over time. To this day, I do have some fears still in hodling, but knowing that the amount I invested is definitely a-ok to be gone just reduces the fear significantly, but ya know, it is still there. Quote from: Gallar on May 13, 2023, 02:29:56 PMBut controlling your own psychology is not an easy thing. It will definitely take quite a long time to be able to control it. Because I personally got valuable lessons about being able to control this psychology, mostly from the experiences I had when trading. Not just once, but many times, and finally all of these experiences made me aware. And things like this are natural for people who are plunging into a new field for the first time, including in the world of crypto trading too.Even those \"experienced\" traders still do encounter some fucker in psychology, it's just one of those slumps that would make you quit in trading and that's entirely normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 13, 2023, 03:49:40 PM",
      "body": "What is your view on the market and what do you think about its psychology phase now?It's difficult to define what phase it is when we are in a market but it is not too important if you have a wider vision. Next year, Bitcoin will have its halving and do you mind to find its psychology phase now?Depression, Disbelief, Nope, Optimism, they are not matter when you are in a bull run after a next halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}