{
  "id": "topic_5474806",
  "title": "cryptoWODL",
  "author": "cryptoWODL",
  "created_time": "November 20, 2023, 07:15:02 PM",
  "content": "picture source    picture source Javier Milley has won Argentina's second round of presidential elections. In Argentina's second round of presidential elections, Miley's opponent was left-wing candidate Sergio Massa.Almost 90 percent of the votes have been counted in Argentina's presidential election. According to the preliminary results, Millei got about 56 percent of the votes. Masa got about 44 percent of the vote.In other words, Milley won by a margin of more than 10 percent of votes over Masa.Milley was elected president of Argentina at a time when the country was in the midst of an economic crisis. Inflation is increasing in the countryArgentina's annual inflation has exceeded 140 percent.Milley sees Bitcoin as a transformative solution to improve her standard of living in Argentina. He envisions it as a way to return control of money to the private sector. Milley sees the decentralized nature of Bitcoin as the right way out of the centralized control exercised by Argentina's traditional financial institutions, including the central bank. So far, however, Milley has not explicitly proposed making Bitcoin legal tender in Argentina. If Milley proposes and implements it, Argentina will be the second country to use bitcoin as legal tender. As before, El Salvadar became the first country to use Bitcoin as legal tender in 2021.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474806",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "November 20, 2023, 07:28:10 PM",
      "body": "From what i have read it looks like they will not make Bitcoin a legal coin as El Salvador did, but they will work in some crypto-friendly laws to warrant some free circulation of cryptocurrencies. Let's keep an eye on Argentina because with this president they will bring some surprises to the world. And if they start adopting cryptos that will be something great for the country's economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "November 20, 2023, 07:47:33 PM",
      "body": "Quote from: cryptoWODL on November 20, 2023, 07:15:02 PMMilley sees Bitcoin as a transformative solution to improve her standard of living in Argentina. He envisions it as a way to return control of money to the private sector. Milley sees the decentralized nature of Bitcoin as the right way out of the centralized control exercised by Argentina's traditional financial institutions, including the central bank.Bitcoin is not a transformative solution and does not solve economic crisis which is a result of poor fiscal policies. I sincerely hope he does not hope Bitcoin will be a band-aid solution to the country's situation cause that will show lack of connection with the reality of fixing a troubled state.The government cannot function without the central bank and will not (cannot) replace that with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 20, 2023, 09:05:32 PM",
      "body": "El Salvador was the first country to make bitcoin a legal tender, but followed by Central Africa Republic. So Argentina will not be the second becuase CAR is the second. Let us see if Argentina will be the third. But what matters most is not about making bitcoin a legal tender, but for a country to be very friendly with bitcoin and accept it for payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 20, 2023, 09:13:00 PM",
      "body": "It seems that those anticipating that bitcoin can solve every problem of a country is going to extend from country to country. They need to understand that it doesn't work like that but at least it can be a contributor to the solution that they're going to have in solving the inflation and economic crisis that they are facing right now. If Argentina decides to make Bitcoin as a legal tender then that only means that we're seeing coming from Central to South America, the adoption is going to be on that region and so on. While our optimistic minds want them to do that or its new president will tackle with it as said during the campaign. What we just want is all the best to the new authority and leadership there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "November 20, 2023, 09:27:05 PM",
      "body": "A government at the helm can change its stance on bitcoin easily. I would never be surprised if Javier Milley didn't adopt bitcoin as a legal currency in Argentina for one reason or another - but some rules that would benefit his country would be within his considerations and policies.After all governments don't need to legalize bitcoin as a legal currency if they're only after profits - taxing it just makes more sense to them than fully adopt. Of course it would be great if Argentina eventually catches up with El Salvador in terms of adopting bitcoin as a currency - but Argentina has a lot to learn from El Salvador's shortcomings that could make it better at planning things regarding bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "November 20, 2023, 09:29:59 PM",
      "body": "Quote from: seoincorporation on November 20, 2023, 07:28:10 PMFrom what i have read it looks like they will not make Bitcoin a legal coin as El Salvador did, but they will work in some crypto-friendly laws to warrant some free circulation of cryptocurrencies. Let's keep an eye on Argentina because with this president they will bring some surprises to the world. And if they start adopting cryptos that will be something great for the country's economy.  I think Milley still includes in his plan of making Bitcoin a legal currency in their country, but dealing on that matter immediately might not be good for now, he will disclose that concern maybe on the later part of his administration.But creating some crypto-friendly laws is a sure thing. Since he has the power already, then it's easier for him to promote bitcoin with his team and educate the citizens on the essence and great potentials of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 20, 2023, 10:30:27 PM",
      "body": "Why will he need to propose and make bitcoin a legal tender? Will making bitcoin a legal tender and becoming the next El Salvador make a difference? I don't also see it as a competition, as many people are almost taking bitcoin as a legal gender in countries and placing a bet on which country will be next. It's a good thing if bitcoin is being accepted and recognised by governments and top regulatory authorities; it will expand coin usage and create massive awareness for the coin, which could also create room for price increases, but then again, we should not always have high hopes for things like this because it might end up disappointing us on that high hope. Another thing is that making bitcoin a legal tender takes a lot of process, and many opposition parties will stand out against that ruling party's decision as they will make everything look like you are forcing it on the people. What is just the best thing to do is create a bitcoin-friendly environment and make things easier for those who want to trade, hold, or adopt it with a friendly regulatory system that should allow anyone who ever wants to use it to make use of it without criticising anyone as if they are being forced to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "November 20, 2023, 10:59:55 PM",
      "body": "As we can see, El Salvador faced different criticism when they accepted Bitcoin as a legal tender and might do the same with Argentina, this has become more challenging to them.  That's right, each country has unique political and social factors that influence such decisions in making Bitcoin a legal tender, IMO, I would rather want to be neutral upon embracing Bitcoin than face those consequences of risk.As Argentina considers its economic policies, including the possibility of cryptocurrency adoption, it might be interesting to observe how these developments unfold and what lessons can be drawn from experiences in other countries.  I wish the new leadership in Argentina's success in terms of Bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "November 20, 2023, 11:02:07 PM",
      "body": "Quote from: cryptoWODL on November 20, 2023, 07:15:02 PMMilley sees Bitcoin as a transformative solution to improve her standard of living in Argentina. He envisions it as a way to return control of money to the private sector. Milley sees the decentralized nature of Bitcoin as the right way out of the centralized control exercised by Argentina's traditional financial institutions, including the central bank. So far, however, Milley has not explicitly proposed making Bitcoin legal tender in Argentina. If Milley proposes and implements it, Argentina will be the second country to use bitcoin as legal tender. As before, El Salvadar became the first country to use Bitcoin as legal tender in 2021.Well don’t get your hopes up. I think its unwise to trust the words of a politician campaigning for votes, they say sweet words to get attention and more voters. Does Javier Milei have a solid knowledge of Bitcoin or is this just a script that’s planed to appeal to the younger voters and the populace who are tired of the old system. You said it yourself, nothing concrete has been set in place for such a move. Now that he’s President, we will see if he is going to keep to his promises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 20, 2023, 11:28:50 PM",
      "body": "He never said that he's planning to make it a legal tender, but there's a good chance that he will, giving his extreme political views. Or maybe he'll find another way to make it easier to use Bitcoin for the population, starting with lowering the regulations on Bitcoin and lowering or even removing taxes. I'm sure that he will do at least something for Bitcoin, and that's already good news even for those who aren't from Argentina, because it will boost the price, especially now that the market will soon turn bullish and all the positive news will get amplified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 21, 2023, 01:35:50 AM",
      "body": "Quote from: hatshepsut93 on November 20, 2023, 11:28:50 PMHe never said that he's planning to make it a legal tender, but there's a good chance that he will, giving his extreme political views. Or maybe he'll find another way to make it easier to use Bitcoin for the population, starting with lowering the regulations on Bitcoin and lowering or even removing taxes. I'm sure that he will do at least something for Bitcoin, and that's already good news even for those who aren't from Argentina, because it will boost the price, especially now that the market will soon turn bullish and all the positive news will get amplified.He did not say he will make Bitcoin legal tender in Argentina but we can not prohibit people to think about it. They love Bitcoin legal tender and Market makers can use this Argentina President Election and their new Elected President, to shill Bitcoin Legal tender again.There are two countries in which Bitcoin is legal tender so far.Legal tender countries are El Salvador (a first nation made it), and Central African Republic (a second nation made it). The interesting information from that website is Argentina does not have a top position from community votes for a next Bitcoin legal tendered nation. They are in middle of the vote result table.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 21, 2023, 01:42:21 AM",
      "body": "Quote from: hatshepsut93 on November 20, 2023, 11:28:50 PMHe never said that he's planning to make it a legal tender, but there's a good chance that he will, giving his extreme political views. Or maybe he'll find another way to make it easier to use Bitcoin for the population, starting with lowering the regulations on Bitcoin and lowering or even removing taxes. I'm sure that he will do at least something for Bitcoin, and that's already good news even for those who aren't from Argentina, because it will boost the price, especially now that the market will soon turn bullish and all the positive news will get amplified.He said he was going to end central banking in his country. Sure seems like he’s going to at least consider the possibility of using Bitcoin a la El Salvador. Now that the price is rising again people seem to think that was a good idea for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "November 21, 2023, 01:56:45 AM",
      "body": "What can be applied in another country may not be applicable to another country and that may be true for Bitcoin. The success of Bitcoin in El Salvador, may not be as successful in Argentina (or more successful). So maybe the Argentine government will carry out in-depth analysis and evaluation before implementing it, because it will be closely related to the economic conditions of the country. One wrong move, maybe Argentina's inflation situation will get worse or better, so maybe it's 50-50 for Argentina to adopt Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "November 21, 2023, 02:44:20 AM",
      "body": "Quote from: cryptoWODL on November 20, 2023, 07:15:02 PMMilley was elected president of Argentina at a time when the country was in the midst of an economic crisis. Inflation is increasing in the countryArgentina's annual inflation has exceeded 140 percent.If he only relies on bitcoin and thinks it can help Argentina escape inflation and crisis, I think he will be the stupidest president in the world. For a country to have a developed economy, hundreds of different factors are needed, not just relying on the adoption of a volatile asset like bitcoin to solve everything. Bitcoin is just an asset, a decentralized currency, it is not a panacea for the world. I am not opposed to the idea of accepting bitcoin as legal tender if he intends to do so but I do not expect him to rely solely on it to improve his country's economic situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 21, 2023, 03:21:46 AM",
      "body": "He has too many problems to think about before that one. The first thing he wants to do is to dollarize the economy and I only see the Bitcoin thing as plausible if he spends a long time in power, that is, if he renews in 4 years. Besides, we have to think that he has no power in Congress, so his room for maneuver will be very limited at least until 2 years from now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "November 21, 2023, 03:35:09 AM",
      "body": "Quote from: hatshepsut93 on November 20, 2023, 11:28:50 PMHe never said that he's planning to make it a legal tender, but there's a good chance that he will, giving his extreme political views. Or maybe he'll find another way to make it easier to use Bitcoin for the population, starting with lowering the regulations on Bitcoin and lowering or even removing taxes. I'm sure that he will do at least something for Bitcoin, and that's already good news even for those who aren't from Argentina, because it will boost the price, especially now that the market will soon turn bullish and all the positive news will get amplified.If he does then it will be great news for the people of Argentina but I doubt it will be able to boost the bitcoin market as Argentina is not a major power or has any major influence on the market Cryptocurrency? If similar news comes from countries like the US or China, it will certainly have a huge impact on the market, but for the remaining countries, I don't think it will have an impact on the market. As far as I remember, El Salvador's adoption of bitcoin as legal tender didn't even receive more attention than Tesla's acceptance of bitcoin. So I'm not optimistic about the information coming out of the Argentinian market for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "November 21, 2023, 03:36:14 AM",
      "body": "Quote from: cryptoWODL on November 20, 2023, 07:15:02 PMInflation is increasing in the countryArgentina's annual inflation has exceeded 140 percent.Milley sees Bitcoin as a transformative solution to improve her standard of living in Argentina.Does he think making Bitcoin legal tender in his country will reduce high inflation? I think he's just like most politicians who use trendy things to get lots of voters but actually don't understand the program he will implement to reduce inflation in the country and like most people consider Bitcoin as a god that can solve all economic problems but in practice, they will realize that Bitcoin is not a solution to every problem that occurs in this world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 21, 2023, 03:53:39 AM",
      "body": "Quote from: Strongkored on November 21, 2023, 03:36:14 AMQuote from: cryptoWODL on November 20, 2023, 07:15:02 PMInflation is increasing in the countryArgentina's annual inflation has exceeded 140 percent.Milley sees Bitcoin as a transformative solution to improve her standard of living in Argentina.Does he think making Bitcoin legal tender in his country will reduce high inflation? I think he's just like most politicians who use trendy things to get lots of voters but actually don't understand the program he will implement to reduce inflation in the country and like most people consider Bitcoin as a god that can solve all economic problems but in practice, they will realize that Bitcoin is not a solution to every problem that occurs in this world.That is without a doubt a possibility, however Argentina cannot really afford to waste more time with experiments and implement some crazy ideas, the elected president really needs to improve the economy of Argentina, as we are talking about a country that has suffered several economic crisis during the previous decades.So even if bitcoin is not declared legal tender, as long as friendly laws were passed that will be more than enough to get most people happy about it and bring some investments towards the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "November 21, 2023, 03:56:49 AM",
      "body": "Quote from: cryptoWODL on November 20, 2023, 07:15:02 PM So far, however, Milley has not explicitly proposed making Bitcoin legal tender in Argentina. If Milley proposes and implements it, Argentina will be the second country to use bitcoin as legal tender. As before, El Salvadar became the first country to use Bitcoin as legal tender in 2021.What I see is that the issue of adoption is also used as a tactic in seeking support and acceptance. If you say it hasn't been realized until then, it's better to be positive first, it's not impossible to realize it because usually there are things to do in the first 100 days where he has to prioritize current issues related to real economic conditions at that time to be immediately addressed. Perhaps, after these stages, he will continue his vision and mission which will be implemented one by one, including discourses such as El Salvador and sitting down with the parties by seeing that the biggest risk is regulation, which could limit his ability to provide services or outright prohibit them. and that is the first thing that must be strengthened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}