{
  "id": "topic_5449067",
  "title": "Calimero987",
  "author": "Calimero987",
  "created_time": "April 16, 2023, 06:44:31 PMLast edit: April 16, 2023, 07:09:30 PM by Calimero987",
  "content": "Grüße Ich habe jetzt lange meine Coins auf Exchange-Wallets aufgehoben. Aber seit der letzten Vorfälle, die immer wieder auftauchen, kümmere ich mich um eine andere Lösung. Das stellt sich als schwieriger heraus, als gedacht. Habt Ihr für mich einen Tipp, welche Wallet sich da am besten eignet? Hauptkriterium ist Sicherheit.Ich möchte die Coins einfach auf die externe SSD-Festplatte (Samsung Portable SSD T7 Shield) packen und liegen lassen. Vielen Dank im voraus.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449067",
  "comments": [
    {
      "author": "1miau",
      "created_time": "April 16, 2023, 09:05:07 PMLast edit: April 16, 2023, 09:36:52 PM by 1miau",
      "body": "Quote from: Calimero987 on April 16, 2023, 06:44:31 PMIch möchte die Coins einfach auf die externe SSD-Festplatte (Samsung Portable SSD T7 Shield) packen und liegen lassen. Also wenn du das auf deiner externen SSD-Festplatte speichern willst, würde ich dazu Bitaddress von GitHub herunterladen (nur Originalquelle, siehe hier https://github.com/pointbiz/bitaddress.org/releases), offline ausführen und dann kannst du das generierte Schlüsselpaar auf deine externe SSD-Festplatte packen. Die sollte dann natürlich auch immer offline sein. Zudem würde ich mir den privaten Schlüssel noch physisch notieren, falls deine SSD-Festplatte (durch welchen Grund auch immer) beschädigt werden sollte. So hast du noch eine Sicherheitskopie und kommst an dein Bitcoin, selbst wenn du auf deine SSD-Festplatte nicht mehr zugreifen kannst. Kommt natürlich auch darauf an, wie oft du auf deine Bitcoins zugreifen willst oder ob es einfach nur x Jahre liegen lassen (HODL) sein sollen. Edit: gerade gesehen, das du Altcoins meinst, hatte ich zunächst nicht gesehen, weil du den Beitrag nicht bei Altcoins erstellt hattest und war von Bitcoins ausgegangen. Für ETH und Ethereum-basierte Token nutze ich MEW, jedoch ist in den neuesten Versionen die Sicherheit zugunsten der Bedienbarkeit reduziert worden, weshalb ich aktuell nur zur Nutzung der Versionen 3.xx.. raten kann, welche man nur noch hier findet: https://github.com/MyEtherWallet/etherwallet/releases?page=1 (vieleicht fällt MEW ja irgendwann ein, dass Sicherheit über Bedienbarkeit geht  ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 17, 2023, 07:30:46 AM",
      "body": "Herzlich Willkommen im Forum @Calimero987,du möchtest ja in erster Linie Sicherheit gewinnen und nicht mehr abhängig sein von Börse XYZ.Wäre ein Hardware-Wallet eventuell auch eine Option für dich? Bei der SSD hast du immer die Gefahr, dass diese den Geist aufgibt, weshalb du nun mehrere Wallets nochmal offline sichern oder regelmäßige Backups deiner SSD machen müsstest.Bei einem Hardware-Wallet notierst du dir den Key (12-24 Wörter) auf einem sicheren Medium (am besten redundant also auf mehrere Zettel oder Metallplatten (@willi9974) und verwaltest dann darüber alle deine Coins (sofern diese unterstützt werden vom Anbieter).Die Sicherheit hast du hier gegeben und gleichzeitig weniger Verwaltungsaufwand meiner Meinung nach.Falls du dich aber für die SSD entscheidest, würde ich dir auf jeden Fall raten, mehrere SSD mit Backups einzurichten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "April 17, 2023, 08:01:37 AM",
      "body": "Auch von mir herzlich willkommen im Forum!Ich persönlich schließe mich dem Vorschlag hier an:Quote from: sam00 on April 17, 2023, 07:30:46 AMWäre ein Hardware-Wallet eventuell auch eine Option für dich? Bei der SSD hast du immer die Gefahr, dass diese den Geist aufgibt, weshalb du nun mehrere Wallets nochmal offline sichern oder regelmäßige Backups deiner SSD machen müsstest.Bei einem Hardware-Wallet notierst du dir den Key (12-24 Wörter) auf einem sicheren Medium (am besten redundant also auf mehrere Zettel oder Metallplatten (@willi9974) und verwaltest dann darüber alle deine Coins (sofern diese unterstützt werden vom Anbieter).... und kann die Verwendung einer Metallplatte für die Einstanzung des Seeds ebenfalls sehr empfehlen. Du stellst dir jetzt vmtl. die Frage was passiert, wenn das Hardware-Wallet kaputt geht: Das ist nicht weiter schlimm wenn du dir die 24 Wörter gut und richtig notiert hast. Damit kannst du deine Wallets sowohl in Software-Wallets als auch anderen Hardwarewallets (vom gleichen Anbieter oder auch von anderen Anbietern) wiederherstellen. Wenn du technisch wissen willst wie das funktioniert einfach melden, dann können wir dir hier den Ablauf kurz schildern. Also: Es ist eine sehr gute Idee deine Coins von einer Börse abzuziehen und sollte unbedingt gemacht werdenHardware-Wallets wie bspw. der Ledger Nano X sind günstig zu haben und bieten dir und deinen Coins sehr viel Komfort bei gleichzeitiger SicherheitWichtig ist die sichere Verwahrung deiner 24 Wörter, da bieten sich diverse Vorgehensweisen an die auch hier im Forum schon des Öfteren diskutiert wurden. Eine Möglichkeit ist bspw. die Einstanzung in Metallplatten und Ablage der Metallplatten in einem zugriffsgeschützten Safe.Ledger hat übrigens grad noch eine Aktion laufen, dass man 20-30$ Cashback bekommt, wenn man bis 18. April einen Nano S oder Nano X kauft: https://shop.ledger.com/pages/safe-journey-offer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "April 17, 2023, 09:43:30 AM",
      "body": "Hier mal der Link zu meiner Recovery Seed Plate Wenn es was für dich ist einfach mal in den Beitrag schauen, dort gerne Fragen stellen.Bestellung dann gerne per PMhttps://bitcointalk.org/index.php?topic=5319811.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "April 18, 2023, 01:45:29 PM",
      "body": "Quote from: Calimero987 on April 16, 2023, 06:44:31 PMGrüße Ich habe jetzt lange meine Coins auf Exchange-Wallets aufgehoben. Aber seit der letzten Vorfälle, die immer wieder auftauchen, kümmere ich mich um eine andere Lösung. Das stellt sich als schwieriger heraus, als gedacht. Habt Ihr für mich einen Tipp, welche Wallet sich da am besten eignet? Hauptkriterium ist Sicherheit.Ich möchte die Coins einfach auf die externe SSD-Festplatte (Samsung Portable SSD T7 Shield) packen und liegen lassen. Auf jeden Fall ist es schon mal sinnvoll, dass du deine Coins selber verwahren möchtest. Was du dazu aber nicht unbedingt für eine Langzeitlagerung brauchst ist eine Festplatte oder ein ähnlicher Speicher wie USB-Stick. Das wichtigste ist die Verwahrung des Seeds bzw. der Private Keys. Für deren Sicherung gibt es verschiedene Methoden, die hier im Forum vorgestellt wurden. Trotz alledem musst du natürlich erstmal ein Wallet (bzw. Adressen) haben, um die Coins von der Börse zu holen. Für ETH und erc20-Token kann ich hierfür MetaMask empfehlen. Aber dort kannst du auch Coins anderer Netzwerke wie Polygon verwalten. Um welche Altcoins geht es denn?Wichtig ist dabei immer, dass du den Seed bzw. Privatekey aufschreibst. Die Festplatte kann kaputt gehen oder das Wallet wird in x jahren nicht mehr unterstützt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Calimero987",
      "created_time": "April 18, 2023, 08:30:00 PM",
      "body": "Ein Dank an alle!Ich habe mich jetzt für zwei Ledger entschieden. Eine verwahre ich nur und mit der anderen werde ich ein wenig Staken. Ich gehe davon aus, dass manche Altcoins wohl auf der Platte nicht laufen werden. Daher werde ich mich wohl erneut melden, wenn ich soweit bin und die meisten Coins auf Ledger gezogen habe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 19, 2023, 06:50:11 AM",
      "body": "Quote from: Calimero987 on April 18, 2023, 08:30:00 PMEin Dank an alle!Ich habe mich jetzt für zwei Ledger entschieden. Eine verwahre ich nur und mit der anderen werde ich ein wenig Staken. Ich gehe davon aus, dass manche Altcoins wohl auf der Platte nicht laufen werden. Daher werde ich mich wohl erneut melden, wenn ich soweit bin und die meisten Coins auf Ledger gezogen habe.Sehr gerne doch!Es wäre natürlich schön wenn du uns hier im Forum erhalten bleibst. Bei weiteren Fragen kannst du hier eigentlich immer mit einer Antwort rechnen Was genau meinst du nun mit Platte? Die Metallplatte oder die ehemals SSD, welche angedacht war?Ein Tipp noch vorweg, wenn du deine Ledger einrichtest. Schreibe dir deine 24 Wörter sorgfältig auf und setze den Ledger bevor du etwas hin schickst nochmal zurück und richte ihn mit deinen Wörtern neu ein. So gehst du sicher, dass du dein Recovery-Seed auch richtig notiert hast Und dann eben den Seed redundant aufbewahren, am besten brandsicher usw...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "April 19, 2023, 07:45:56 AM",
      "body": "Noch ein kleiner Tipp oben drauf.Wie es Sam00 sagte, neu aufsetzen aber vorher mal eine Testüberweisung für wenige Cent / Euro machen, dann sieht man das die TX also die Balance nach dem neu aufsetzen des Ledger auch wieder sichtbar ist. So mach ich es wenn ich einen neuen Ledger einrichte Viele GrüßeWilli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 19, 2023, 08:04:17 AM",
      "body": "Quote from: willi9974 on April 19, 2023, 07:45:56 AMNoch ein kleiner Tipp oben drauf.Wie es Sam00 sagte, neu aufsetzen aber vorher mal eine Testüberweisung für wenige Cent / Euro machen, dann sieht man das die TX also die Balance nach dem neu aufsetzen des Ledger auch wieder sichtbar ist. So mach ich es wenn ich einen neuen Ledger einrichte Viele GrüßeWilliSo hat man natürlich noch mehr Gewissheit aber normalerweise sollte es ja gar nicht funktionieren, wenn man z.B das 13. Wort falsch eingibt (Hand statt Have beispielsweise), da am Ende eine Checksumme gebildet wird.@Calimero987 du kannst auch auf einem Ledger für eine Währung (bspw. Ethereum) mehrere Accounts anlegen. Also theoretisch bräuchtest du nicht mehrere Ledger, wenn du manche Coins staken möchtest und andere einfach einlagern willst.Ein zweiter Ledger kann dir Zeit/Arbeit ersparen, falls einer mal kaputt geht aber du bräuchtest nicht zwei verschiedene Seeds aufbewahren.Falls du dich allerdings für den Nano S entschieden hast, ist hier der Speicher recht gering, wodurch der Umgang mit vielen verschiedenen Coins etwas umständlich wäre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}