{
  "id": "topic_5436879",
  "title": "internetional",
  "author": "internetional",
  "created_time": "January 26, 2023, 01:07:57 PM",
  "content": "На бирже kollider.xyz торгуются инверсные контракты BTC/USD и BTC/EUR с плечом до 1:10. На сайте написано, что можно торговать ещё и контрактами ETH/USD, но в торговом интерфейсе я этот инструмент не нашёл.Реальной поставки нет: на биржу можно завести только сатоши и вывести с неё можно тоже только их. Максимально допустимый баланс - 15 млн сатоши. (Не знаю, что будет, если завести на биржу 15 млн, открыть позицию и выйти в плюс. Пока кажется, что ничего хорошего.) Вводы и выводы обрабатываются как на цепочке (ончейн), так и на молнии (лайтнинг).Биржа, так сказать, широко известна в узких кругах. Думаю, что о ней слышали все энтузиасты молнии. Дело в том, что проект изначально ориентирован именно на эту сеть, и пользователей молнии привлекает то, что разработчики создают биржу прям с душой, с любовью. Мне нравятся диалоги трейдеров и разработчиков в чате биржи в телеграме:- А давайте вот это сделаем!- Не, так не получится.- А вот это?- О, классная идея! Если кому-то ещё это надо, то давайте попробуем внедрить. У меня сложилось впечатление, что разработчики - это очень открытые, очень увлечённые своим делом ребята. Поэтому вокруг биржи постепенно складывается достаточно тёплое комьюнити, и информация о ней в основном распространяется через сарафанное радио.Мне больше всего нравится в этой бирже её ориентация на то, чтобы монеты на баланс вносились лишь в минимально необходимом количестве. Хочешь открыть позицию - указываешь объём, цену и плечо на сайте биржи, нажимаешь «Order», и только в этот момент потребуется депозит. Ровно в том объёме, который нужен для открытия этой позиции. Биржа сама его рассчитает; трейдеру достаточно только отсканировать куар-код своим кошельком и подтвердить в нём отправку соответствующего количеств монет. Если перевод отправляется на молнии, то позиция мгновенно открывается. И вывести деньги после закрытия позиции тоже можно мгновенно. (На цепочке, правда, так не получится. Там сначала нужно внести депозит, а потом уже ввести параметры сделки и нажать на кнопку «купить» или «продать». А как на цепочке устроены выводы с биржи - я вообще не знаю. Сам только через молнию вводил-выводил.)Несмотря на то, что все процессы на бирже пропитаны атмосферой «для своих», разработчики явно рассматривают проект как бизнес. Такой вывод я делаю, например, из того, что изначально там были привычные мне по старому Битмексу комиссии и вознаграждения за сделки: комиссия 0,075% для тейкера и вознаграждение 0,025% для мейкера, - но со временем хозяева биржи поняли, что при том объёме торгов, который есть сейчас, они при таких комиссиях вообще никаких денег не увидят, и подняли сборы. Но сделали они это как-то неумело, не по-деловому. Вот какие комиссии на бирже сейчас.Нетрудно заметить, что при определённом объёме торгов биржа взимает с тейкера меньше, чем отдаёт мейкеру. Сейчас, пока биржей балуется лишь небольшое комьюнити, такая схема пока проблем не вызвала. Но что если основные клиенты наберут такой объём и будут торговать преимущественно друг с другом? Откуда биржа будет брать деньги на выплаты заявленных вознаграждений?Я боюсь, что если пара клиентов доберётся до нужного объёма, то их обоих сразу забанят. Или изменят схему взимания комиссий и начисления вознаграждений. И в том, и в другом случае получится, что два человека зря потратят почти 5 млн сатоши на те комиссии, которые будут сопутствовать набору нужного объёма торгов. Это будет обидно. И это, конечно, испортит всю ту тёплую атмосферу, которая сейчас формируется вокруг площадки. Есть у биржи и ещё один проект, который рано или поздно обязательно станет для неё испытанием на прочность. Это платёжная система Kollider Pay.Суть её такова. Алиса вносит на баланс некоторое количество сатоши и «конвертирует» их в доллары или евро. Реальной конвертации не происходит - для Алисы просто открывается позиция шорт с плечом 1:1 на ту сумму, которую она хотела конвертировать. И баланс Алисы теперь учитывается не в сатоши, а в долларах. (За конвертацию, разумеется, взимается комиссия, равная комиссии тейкера на бирже.)  Алиса может не только держать эти «синтетические» доллары или евро в своём кошельке, но и переводить их, расплачиваться ими с другими пользователями платёжной системы. Если Алиса хочет передать часть своих долларов Бобу, то система создаёт сделку на бирже, в ходе которой у Алисы закрывается часть позиции, а у Боба открывается соответствующая позиция. Залогом за позицию Боба становятся те сатоши, которые раньше использовались как залог для позиции Алисы, а теперь переданы Бобу. Разумеется, за такой перевод и Алиса, и Боб платят бирже комиссию за сделку. А если у них обоих большие объёмы, то один из них заплатит меньше, чем получит другой.Но не в этом основная проблема создаваемой платёжной системы. Проблема в том, что если все её пользователи захотят одновременно сконвертировать обратно свои синтетические доллары и евро в сатоши, то на бирже может не хватить ликвидности. На первом скриншоте видно, какой маленький объём у заявок в стакане. Общий объём стакана BTC/USD сейчас - чуть больше 6000 контрактов (6000 долларов). То есть если сейчас семь человек, хранящие по 1000 синтетических долларов в своих кошельках, одновременно захотят выйти из системы, они не смогут закрыть позиции по цене, близкой к рыночной, и потеряют часть активов. И это тоже испортит дружеские отношения между владельцами биржи и её клиентами.В общем, на мой взгляд, мы имеем дело с романтической, несколько наивной и возможно даже утопичной попыткой создать классную площадку для друзей и заработать на ней. Не знаю, что у ребят в итоге получится, но наблюдать за развитием биржи мне очень интересно. Давайте наблюдать вместе!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436879",
  "comments": [
    {
      "author": "A.L.F.",
      "created_time": "January 26, 2023, 04:33:50 PM",
      "body": "Запрещён доступ из ряда стран!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "April 03, 2023, 10:23:45 AMLast edit: April 03, 2023, 10:34:22 AM by internetional",
      "body": "Вместо Kollider Pay биржа запустила браузерное расширение Kollider Wallet: https://kollider.xyz/walletРазница не только в форме представления, но и в том, что в этом воллете при конвертации сатошей в синтетические доллары или евро не берётся комиссия за открытие позиции на бирже. (Между тем, не стоит забывать, что сделка на бирже всё-таки совершается, и второй стороной сделки может быть участник торгов с большим объёмом, получающий вознаграждение мейкера. Не устаю повторять, что это очень уязвимое место в бизнес-стратегии биржи.)Не взимается комиссия и за перевод синтетических долларов или евро из одного кошелька в другой. Ну вот это как раз можно понять. Зачем закрывать позицию у одного клиента и открывать её у другого, если биржа, будучи CEXом, может просто перенести позицию в своей базе данных от одного клиента к другому? В этом плане всё правильно сделали.  Quote from: A.L.F. on January 26, 2023, 04:33:50 PM  Запрещён доступ из ряда стран!!! Да, из США, Канады и неких «стран из списка OFAC».",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "September 14, 2023, 10:06:23 AM",
      "body": "Биржа Kollider закрывается. Причём даже без уведомления на сайте. О закрытии можно узнать только обратившись к их команде в телеграме. А на сайте это можно понять, только если попытаться открыть позицию. Тогда получишь уведомление, что биржа работает в режиме «Только закрытие».Очень жаль, что не смогли ребята превратить своё интересное начинание в полноценный бизнес.Задумка-то была неплохая.В принципе, есть альтернатива: lnmarkets.com . Условия у них пожёстче: комиссия за сделку 0,1%, комиссия за овернайт в среднем 0,03% независимо от направления позиции (списывается по 0,01% три раза в сутки; в периоды высокой волатильности комиссия повышается). И торги там идут только к доллару (евро не поддерживается). Ещё на LNMarkets есть опционы, но их нельзя надписывать, а можно только покупать. Получается, что продавец - монополист, и это держит цены на опционы неоправданно высокими. Так что можно считать, что опционов нет. Следовательно, LNMarkets является альтернативой закрывающемуся Коллайдеру лишь в двух аспектах: бессрочные контракты BTCUSD и «синтетический стейблкоин», обеспеченный шортовой биржевой позицией.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}