{
  "id": "topic_5468301",
  "title": "RioBlemz",
  "author": "RioBlemz",
  "created_time": "September 27, 2023, 12:39:39 PM",
  "content": "It is not a must to take every trade and it is not a must to trade. Have you experience difficulty in the Financial Market or disappointment that affected your well being. Stated below are some essential things you need to look out for once you noticed them please stay off the market. 1) Series of Losing Trade  If you noticed that the losses you had are more in a series of trade you took then take a break. If you proceed you will start doing revenge trading and lose out. A break will help you re-evaluate yourself and maintain psychological and emotion balance.2) Market is Consolidating Surely there is no direction in the Market once it is consolidating. This will waste your time and make you make irrational decisions.3) When Emotionally Unstable Are you angered, troubled, disturbed, or even excited etc. At that point don't engage the market.4) Market Conditions are not Favourable Every technical Analyst knows when things are unfavourable. The skill of spotting unfavorably conditions in the market is gotten by practice and study. If you are a technical analyst and you don't know please try and develop yourself.5) When your set-up is not establishedYou know your pattern of trade and your set up more than I do. Once this set up has not been confirmed or has past don't trade. Don't help the market.6) Financial PressureDon't put your financial burden on the market if not you will have yourself to blame. What is good is that you make a term plan and stick to it. Be gradual and moderate in your pursue of profit.7) Series of SuccessesThis is difficult as one success makes you want to go on and on. Know that with series of successful trade especially in a season comes with over confidence which will make you not pay attention to your rules to effectively execute trade .NOTE: These are not rules but advise that will advance you and make you profitable.Do well to write what your intake is on the subject of discussed.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468301",
  "comments": [
    {
      "author": "DVlog",
      "created_time": "September 27, 2023, 01:02:41 PM",
      "body": "Quote from: RioBlemz on September 27, 2023, 12:39:39 PM2) Market is Consolidating Surely there is no direction in the Market once it is consolidating. This will waste your time and make you make irrational decisions.When the market is moving sideways its a great time for accumulation. But if you are looking for short term profits then you can use grid trading bot to take advantage of market sideways move and set the bot between its support and resistance levels.Quote from: RioBlemz on September 27, 2023, 12:39:39 PM3) When Emotionally Unstable Are you angered, troubled, disturbed, or even excited etc. At that point don't engage the market.It is not easy to control your emotions when you are watching your trade go down. Our emotions tell us to add more funds and lower the average. Sometimes this works if you can hold on for the long term. It's better to use a stop-loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 27, 2023, 01:08:57 PM",
      "body": "Everything you mentioned is related to trading psychology or psychological factors, the impact of which can be reduced by using trading bots and a short- and medium-term strategy that saves you from emotional problems or market fluctuations, but in all cases, stay away from trading when there is financial pressure, as you must trade with the money that you You do not need it. If you need money, trading comes second, because most of the time the decisions you make when your financial situation is bad are stupid and hasty decisions.You need to change your topic title.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 27, 2023, 01:20:15 PM",
      "body": "We're not forced to trade and whoever trades is doing it based on his own intellect. No one will stop you from trading and it doesn't matter to other people whether you're winning your trades or you're losing money because it's not our money in the first place. But the good side of this is you're learning more about the approach in the market. Trading isn't a game where you just bet your money and you're okay losing it. Most traders are serious folks that are targeting to grow their money but before that, there's a need to experience losing because you are not yet knowledgeable about it. And when you've learned from the losing experience, you'll have the understanding that it's not really at all. With that, you're going to have the thought whether to pursue it or stop it and just choose the easier part which is holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "September 27, 2023, 01:41:46 PM",
      "body": "All of those things seem to be a reason why we should think that Trading is not for everyone nor we are forced to do that knowing the situation that we make it hard. Giving is not just an option but certainly a decision to make if we know ourselves that we are struggling hard to analyze and understand the market. We never think that we are too unlucky because we have not become pro-traders, maybe there is a place for us at least we try and find out that this is not really for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 27, 2023, 02:37:35 PM",
      "body": "Blaming continued losses on market conditions, emotional state, etc. is one way of looking at it, another way is to realize that your trading skills need a lot more work specially if you think you are losing because \"market is consolidating\". Of course there are times when the market is not as predictable as you want it to be, but a skilled trader has enough experience to know how to make some profit from any market conditions. For example they can make profit even when the shitcoins are dumping.Not to mention that we are talking about the cryptocurrency market, that includes altcoins which means there is always some shitcoins that are being pumped and the profit is there, waiting to be grabbed. But not for those who buy and bag hold, hoping for a long term rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "September 27, 2023, 02:44:12 PM",
      "body": "Quote from: RioBlemz on September 27, 2023, 12:39:39 PM7) Series of SuccessesThis is difficult as one success makes you want to go on and on. Know that with series of successful trade especially in a season comes with over confidence which will make you not pay attention to your rules to effectively execute trade .I do agree on most of your point except this one. Success is the ultimate goal of every trader that’s why we are trading so if you are stopping just because you have multiple successful trading is kinda stopping your momentum. Consistency means you are using the right strategy which you should capitalize once still working.Stop when you are experiencing loss and not multiple success. I believe the one you are trying to express here is to stop aiming for more profit by adding more risk to your current successful trading. Because there’s a lot of trader that loss everything despite they have consistent profit just because they are greedy to enter more risky trade just earn higher profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "September 27, 2023, 05:42:08 PM",
      "body": "Quote from: RioBlemz on September 27, 2023, 12:39:39 PM1) Series of Losing Trade  If you noticed that the losses you had are more in a series of trade you took then take a break. If you proceed you will start doing revenge trading and lose out. A break will help you re-evaluate yourself and maintain psychological and emotion balance.We can also say never marry with a coin, but marriage with a coin is longer, while a series of trades is not longer. We should definitely take some break time from trading, not only when we are making losses but also when we are making profits too. Because in a series of losing trades, we can build up the emotions of taking risks, but if in a series of profits, we can build up the emotions of greed and also lose money in that too.Therefore, never get into emotions, whether they are of revenge, greed, love, etc.Quote from: RioBlemz on September 27, 2023, 12:39:39 PM2) Market is Consolidating Surely there is no direction in the Market once it is consolidating. This will waste your time and make you make irrational decisions.We can definitely not make huge profits in consolidation, but we can make some decent, small, and consistent profit, which is far better than taking huge risks. Unfortunately, after consolidation, sometimes the market took unexpected turns that not even big analysts had predicted.I have seen many big players making good profits even in consolidation states, just like in the recent consolidation state, in which many made huge amounts by timing the market. Which is not an easy task.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "September 27, 2023, 05:50:44 PM",
      "body": "I agree with some of your points but I think every point you make is psychologically related.  Before trading you must have enough knowledge about it.  Although trading depends on the market, I think a skilled trader can anticipate the market.  And if someone is unskilled in it, his chances of loss are very high. If one sees losing his money then it is a bit difficult to control the emotions.  You are right that if someone is mentally disturbed, he should not come to trading, but in my opinion, if you are mentally disturbed, neither trading nor any work is good.  And if someone is financially weak, then he should think about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 27, 2023, 06:20:51 PM",
      "body": "I would say this does work for some people like me. Not everyone has to be a trader and I still trade a small amount just for fun and to learn how to be better and try to learn more about trading even after so many years, but majority of my money is on long term investment and I do not think that I could continue to trade for a profit. It would be a bad idea to do something like that and it should be quite difficult to handle something like that.I believe that we are going to end up with a result that should be something that would be a lot more risky if we are not careful and that is why we are going to end up with a good result if we are careful and should be something that would make a lot more profit if we go long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "September 27, 2023, 06:44:17 PM",
      "body": "3) When Emotionally UnstableAre you angered, troubled, disturbed, or even excited etc. At that point don't engage the market.This is the best time that you should consider on stopping trading. Why? When emotion is really that at great kind of effect then it would be better to ease it up before you would be proceeding on doing tradingbecause you would really be finding up yourself to be that very impulsive on that time and we know that once emotions do kicks in then it would really be that so hard to make such control and it would really be much better that you should be finding up some activity or things for you to divert out that anger or emotion so that you could really be going back to trade with having that clear mind.On the time that you are really under the influence of such condition then you are really putting yourself on great danger on making up some impulsive trades.You would really be that becoming desperate and the worst you would really be taking up that impulsive approach towards trading which might end up on on doing gambling type of trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 27, 2023, 07:09:53 PM",
      "body": "Quote from: RioBlemz on September 27, 2023, 12:39:39 PMNOTE: These are not rules but advise that will advance you and make you profitable.Do well to write what your intake is on the subject of discussed.You have pointed out some good factors that we all should keep in mind before making trades, but I don't know why you chose the title \"Stop Trading\" when you can write a better one. I hope you won't mind my words, but I wanted to add it to your account that an eye-catching and valuable title is better.Besides that, you have shed good light on the above factors.You should add another factor, which is never marrying with one coin. A few days ago, I read a topic in which the OP tried to emphasize that we should not stick to only one coin for trading but instead, we should diversify our investments. And a series of successes is not that important to stop the trading, instead, we should be a little more careful with our discipline and never spread more legs.Like I did when I made $9 in one day and still took another trade without any analysis and ended up cleaning up my whole future account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "September 27, 2023, 07:19:13 PM",
      "body": "Quote from: el kaka22 on September 27, 2023, 06:20:51 PMI would say this does work for some people like me. Not everyone has to be a trader and I still trade a small amount just for fun and to learn how to be better and try to learn more about trading even after so many years, but majority of my money is on long term investment and I do not think that I could continue to trade for a profit. It would be a bad idea to do something like that and it should be quite difficult to handle something like that.I believe that we are going to end up with a result that should be something that would be a lot more risky if we are not careful and that is why we are going to end up with a good result if we are careful and should be something that would make a lot more profit if we go long term.And that is something many traders do not see, they only think about the profits they can get and think long term holders are just wasting their time by holding their coins for so long, however the majority of the traders lose all their money and only a small minority make any profits, while long term holders which can keep their coins for a few years not only make more money on average than all of those traders put together, but they do so with way less effort and with better odds of this happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shivansps",
      "created_time": "September 27, 2023, 07:33:40 PM",
      "body": "In addition to the series of successes, I would also add a series of money losses. This is sometimes even harder to accept than earning money. When there is some desire to recoup and return the money, which often ends in even greater defeat.Also, you should not trade if you have had a hard day and you are simply tired and your thought process is slow and your body needs rest.You need to know yourself, in addition to your strengths, know your weaknesses and protect them as much as possible so as not to lose money where this can be avoided",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "September 27, 2023, 08:37:41 PM",
      "body": "Quote from: RioBlemz on September 27, 2023, 12:39:39 PM1) Series of Losing Trade 2) Market is Consolidating 3) When Emotionally Unstable 4) Market Conditions are not Favourable 5) When your set-up is not established6) Financial Pressure7) Series of SuccessesAll of the reasons you listed depend on having a solid background and foundation in trading bitcoin and other cryptocurrencies. Learning before you start trading is crucial because it will help you manage your money and teach you how to make the proper choices that will lead to profits.QuoteNOTE: These are not rules but advise that will advance you and make you profitable.Do well to write what your intake is on the subject of discussed.They are in fact sound recommendations that are crucial for traders, particularly those who are new to trading cryptocurrencies or bitcoins, in order to reduce risk and prevent them from losing money on deals that weren't profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "September 27, 2023, 10:36:36 PM",
      "body": "Quote from: |MINER| on September 27, 2023, 05:50:44 PMIf one sees losing his money then it is a bit difficult to control the emotions.  You are right that if someone is mentally disturbed, he should not come to trading, but in my opinion, if you are mentally disturbed, neither trading nor any work is good.  And if someone is financially weak, then he should think about it.The reality in trading is that when you trade there is actually emotion involved either you're winning or losing. The difficult thing is that when we are just a beginner in trading we don't have an edge yet.So if you're going to trade, you have to make sure that your trading plan is enough to be profitable. You can confirmed it by backtesting your strategy. Since backtesting trades has no emotion, live trading has. So we have to make sure that no matter what happens to our trade we have to accept no matter the outcome, don't afraid of losing trades. The most important is, you stick in your plan and journal your trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "September 28, 2023, 03:37:42 AM",
      "body": "Good advise OP, there are many traders in the community have been experiencing losses in their investment and they don't want to take a break and go into personal research to know how to recover from their failure in crypto trading. Once you take a break to study the market price very well, and see when potential traders use to buy coins and hold for the right time to come before they can trade to make a good profits from the market, I think it will really help new traders to improve in profit making. Don't invest what you can't afford to lose in crypto trading, because some traders has invested all they have in crypto investment hoping that the amount of money you invest will determine your profits when you trade in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RioBlemz",
      "created_time": "September 28, 2023, 07:13:00 AM",
      "body": "Quote from: Eternad on September 27, 2023, 02:44:12 PMQuote from: RioBlemz on September 27, 2023, 12:39:39 PM7) Series of SuccessesThis is difficult as one success makes you want to go on and on. Know that with series of successful trade especially in a season comes with over confidence which will make you not pay attention to your rules to effectively execute trade .I do agree on most of your point except this one. Success is the ultimate goal of every trader that’s why we are trading so if you are stopping just because you have multiple successful trading is kinda stopping your momentum. Consistency means you are using the right strategy which you should capitalize once still working.Stop when you are experiencing loss and not multiple success. I believe the one you are trying to express here is to stop aiming for more profit by adding more risk to your current successful trading. Because there’s a lot of trader that loss everything despite they have consistent profit just because they are greedy to enter more risky trade just earn higher profit.I find out that Hedge Funds managers gives there staff that are profitable holidays. I was thinking it was just for fun or for them to enjoy themselves but I was wrong all the way. It was one of the Hedge fund managers that exposes the truth that with a lot of successes comes other factors. He said the break they give is for the staff to ease off and regain their mental wellness. He said that if successes is not manage it will eventually lead to failure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "September 28, 2023, 10:54:59 AM",
      "body": "Next time you want a suitable subject for your thread, look for something that blend with the content and not something like this, stop trading is a very misleading topic and when they find out you are looking for a click bait, the attention you might be looking for will bot come. So take that corrections, now let's look at some of your key points you discussed.Quote from: RioBlemz on September 27, 2023, 12:39:39 PMIt is not a must to take every trade and it is not a must to trade. Have you experience difficulty in the Financial Market or disappointment that affected your well being. Stated below are some essential things you need to look out for once you noticed them please stay off the market. 1) Series of Losing Trade  If you noticed that the losses you had are more in a series of trade you took then take a break. If you proceed you will start doing revenge trading and lose out. A break will help you re-evaluate yourself and maintain psychological and emotion balance.This is the best thing to do when losses turn to normal thing, but will an expert who understands trading very well have losses concurrently, I don't think so, that's why it's better to always use have at least two open trade instead of one, it help you manage risk when things goes south.Quote2) Market is Consolidating Surely there is no direction in the Market once it is consolidating. This will waste your time and make you make irrational decisions.3) When Emotionally Unstable Are you angered, troubled, disturbed, or even excited etc. At that point don't engage the market.4) Market Conditions are not Favourable ]Every technical Analyst knows when things are unfavourable. The skill of spotting unfavorably conditions in the market is gotten by practice and study. If you are a technical analyst and you don't know please try and develop yourself.Market consolidation is always choppy is better to avoid trades in this time or open a long trade and buy at that point but only if you are anticipating for upside direction, consolidation doesn't mean it will go up, fundamental news can screw it up and break the support to start another trend. The same goes for unstable market conditions If you are emotionally affected, there is no point in even looking at the trades you will only blow up your account.Quote5) When your set-up is not establishedYou know your pattern of trade and your set up more than I do. Once this set up has not been confirmed or has past don't trade. Don't help the market.6) Financial PressureDon't put your financial burden on the market if not you will have yourself to blame. What is good is that you make a term plan and stick to it. Be gradual and moderate in your pursue of profit.7) Series of SuccessesThis is difficult as one success makes you want to go on and on. Know that with series of successful trade especially in a season comes with over confidence which will make you not pay attention to your rules to effectively execute trade .NOTE: These are not rules but advise that will advance you and make you profitable.Do well to write what your intake is on the subject of discussed.All your points are correct but I think they are just primary mistakes in trading, a good trader that is a serious type should know this before even going technical aspects of trading, if you failed to master all this mistakes, technical aspects of trading will not end well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 28, 2023, 01:01:10 PM",
      "body": "When the market does not favor what you want to happen in trading based on your analysis, it indicates you do not have to force yourself to trade that day. You may be dealing with the risk and volatility of the coin or bitcoin you are trading.It is also required since, as an independent trader in the crypto world, you must be responsive to market action. That's accurate, there will be periods when we will make money and times when we will not be able to make as much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}