{
  "id": "topic_5463655",
  "title": "Scammer_Sara_Leppaenen",
  "author": "Scammer_Sara_Leppaenen",
  "created_time": "August 18, 2023, 02:41:11 AM",
  "content": "My previous post got deleted, it seems bitcointalk is protecting these big scammers.I am looking for more information about the scammer Sara Leppänen, I have exported all her Facebook friends, what do would be the next step? Hiring somebody who contacts every one of them and ask about the whereabouts of her?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463655",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "August 18, 2023, 04:37:54 AM",
      "body": "Your post was not deleted, it was just moved to investigations board: https://bitcointalk.org/index.php?topic=5463548.0It cannot be accessed by guests and Newbies, but here is proof:I already warned you, that since your post contained personal information that moderators would move it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "August 18, 2023, 09:02:50 AM",
      "body": "Quote from: Scammer_Sara_Leppaenen on August 18, 2023, 02:41:11 AMMy previous post got deleted, it seems bitcointalk is protecting these big scammers.I would like to add besides the previous post by NotATether Bitcointalk is not protecting anyone we don't know who this Sara is, the admins and mods are protecting this forum from spammers like you QuoteI am looking for more information about the scammer Sara Leppänen, I have exported all her Facebook friends, what do would be the next step? Hiring somebody who contacts every one of them and ask about the whereabouts of her?It's not right to post her friends' names here unless they are accomplices to her crimes and do you think they will provide information about her whereabouts to strangers, they could in fact sue you for invading their privacy for dragging their names here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "August 18, 2023, 09:33:07 AM",
      "body": "Quote from: Scammer_Sara_Leppaenen on August 18, 2023, 02:41:11 AMMy previous post got deleted, it seems bitcointalk is protecting these big scammers.I am looking for more information about the scammer Sara Leppänen, I have exported all her Facebook friends, what do would be the next step? Hiring somebody who contacts every one of them and ask about the whereabouts of her?Your previous post moved not deleted like @NotATether said, but still I don't think that it's necessary to post someone's friends list on the forum because if that person has scammed you then you should create scam accusation against her. It's not ethical way to create scam accusations because it's totally abnormal to leak the privacy of someone's friends. I don't think that anyone is going to contact every one of her friends to ask about the location of someone because that's another thing which is against someone's privacy.If you have solid proof that you have been scammed by Sara Leppänen then you should at least show us some screenshots or other things that would prove your words against her. I think that @OP is interested in knowing about that female and he's creating fake accusations against that person only to gain attention or to get her personal details which is totally unacceptable. I would again recommend you to show us proofs or her scamming that she has done to you and if you don't have valid proofs then you should admit the wrong that you were trying to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "August 18, 2023, 10:51:49 AM",
      "body": "You keep doing the same things against the forum ethics and being the problematic kind of person you are, you chose to ignore what members told you about sharing personal information/doxxing people here, and now you are blaming the forum for censoring your posts.The truth is some of your posts even from your alts have been moved to investigations boardhttps://bitcointalk.org/index.php?topic=1576015",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "August 18, 2023, 10:57:29 AM",
      "body": "Quote from: Scammer_Sara_Leppaenen on August 18, 2023, 02:41:11 AMMy previous post got deleted, it seems bitcointalk is protecting these big The first thread you (probably your alt account) create contained the address of the accused person, while the second thread contains some sensitive information like their phone numbers. And from what I have observed since I’ve been in this forum; any posts that contain sensitive information about an accused individual are always been moved to the “investigation” board to prevent it from appearing in any google searches.Moreover, you didn’t actually state what the person did you just came with your username and dropped those sensitive infos and I’m sure you’ve been directed in your previous thread how to properly make a scam accusation thread. If you continue like this all your posts will keep getting moved to investigation board so to avoid that just follow the regular format and you’ll get the result/reply that you seek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "August 18, 2023, 10:59:26 AM",
      "body": "Quote from: Scammer_Sara_Leppaenen on August 18, 2023, 02:41:11 AMMy previous post got deleted, it seems bitcointalk is protecting these big scammers.I am looking for more information about the scammer Sara Leppänen, I have exported all her Facebook friends, what do would be the next step? Hiring somebody who contacts every one of them and ask about the whereabouts of her?What do you expect from this forum? The Bitcointalk forum is not the competent authority for detecting or punishing Facebook scammers. How do you even connect these two things?This forum is intended to discuss Bitcoin and cryptocurrencies, it has nothing to do with Facebook and its users.Why don't you assume the possibility that a scammer, the person you are talking about, is behind a fake profile? In fact, it is almost certain, and there is a high probability that friends do not even know who the real person is behind the profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "August 18, 2023, 11:26:52 AM",
      "body": "OP should leave this forum if he thinks he is being treated unfairly when in fact he is violating a lot of forum rules, the forum does not owe him anything, in fact, he is not posting evidence like transaction references or chat screenshots to make his accusation valid, he chooses to spam than posting pieces of evidence and now complaining without basis, I don't want to help this kind of user who disregards forum rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "August 18, 2023, 12:18:13 PM",
      "body": "OP I noticed that this account is a new one though and I have no doubt the previous account created was for this same course which you are desperately in pursuit of the so called scammer you are after. There are laid down rules and procedures of must tag one a scammer here. Just as the other replies you got here to follow procedures before you accuse someone. You have no evidence to prove your point here.I checked and based on what was said here, the previous complaints of yours was having sensitive details which are against the policies and as such should be protected until investigations are done but you will need to provide evidence for which you are talking about.So OP if you must call this a course on your path then you must present a proof of allegations for your accusations to be taken serious otherwise you have no case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "August 18, 2023, 05:03:54 PM",
      "body": "Quote from: Scammer_Sara_Leppaenen on August 18, 2023, 02:41:11 AMMy previous post got deleted, it seems bitcointalk is protecting these big scammers.I don't know how you get this impression from but i think you're totally having a misconception somewhere else, deleted posts is mostly hadled by moderators, what else do you want to know other than this.Quote from: Scammer_Sara_Leppaenen on August 18, 2023, 02:41:11 AMI am looking for more information about the scammer Sara Leppänen, I have exported all her Facebook friends, what do would be the next step? Hiring somebody who contacts every one of them and ask about the whereabouts of her?Looking at your topic and the first paragraph of your post, it creates an impression that you are on an attack mission against the forum for your deleted post, but to my surprise is seing that this has swindles back to the main target for the creation of this content over the scam related issues, maybe you should follow the required procedures as you've been advised to get this right on your accusation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 18, 2023, 08:53:08 PM",
      "body": "why not hire a private investigator if you are so desperate to find information about Sara Leppänen? you are not getting much help here in the forum because you fail to provide any information about the issue and because doxxing is discouraged here(as nutildah has said).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 19, 2023, 07:15:57 AM",
      "body": "Quote from: acroman08 on August 18, 2023, 08:53:08 PMwhy not hire a private investigator if you are so desperate to find information about Sara Leppänen? you are not getting much help here in the forum because you fail to provide any information about the issue and because doxxing is discouraged here(as nutildah has said). Yeah, as far as this community goes, and even if have the freedom here, doxxing is discourage by Theymos. We can read everything here,https://bitcointalk.org/index.php?topic=1576015.0So in any case, if up to you how to chase Sara Leppänen, whether to hire private investigator or not, but the community will not be part of it, sorry to burst the bubble for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 20, 2023, 07:17:50 AMLast edit: August 20, 2023, 03:00:45 PM by robelneo",
      "body": "Quote from: Scammer_Sara_Leppaenen on August 18, 2023, 02:41:11 AMMy previous post got deleted, it seems bitcointalk is protecting these big scammers.I am looking for more information about the scammer Sara Leppänen, I have exported all her Facebook friends, what do would be the next step? Hiring somebody who contacts every one of them and ask about the whereabouts of her?It's obvious this is the first time you've used a forum all you have to do is to check your account and under it check your post history from there you will find that your post is not deleted it still exists you cannot see it because it's restricted based on your level as stated by NotATether.So next time check your post history I have this feeling that no one here is going to help because you are not providing anything, and about hiring people here to contact them to ask his whereabouts, you are violating the privacy of these people, you should do it in a legal way not using people to your battle, they might even charge you from dragging them here, your legal battle should be yours alone,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "August 20, 2023, 02:50:06 PM",
      "body": "Quote from: robelneo on August 20, 2023, 07:17:50 AM-snip-You just posted a screenshot of sensitive data where OP is attempting to dox someone, including some innocent victims. It's why the thread was moved to investigations, and you haven't helped protect the innocent people by posting the screenshot here yet again.Please at least blur off the sensitive information",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}