{
  "id": "topic_5444356",
  "title": "TryNinja",
  "author": "TryNinja",
  "created_time": "March 10, 2023, 07:41:33 PM",
  "content": "Se você tem USDC, pode ser uma boa ideia se desfazer deles por ora. Lembre-se, você tem muito a perder arriscando seu dinheiro em um bank run ou colapso, enquanto não tem nada a ganhar ficando e tentando a sua sorte. Eu mesmo percebi algumas dúvidas quanto ao FTX antes do seu colapso e não parei para ver se era verdade. O risco ao valor que deixei lá era absoluto e o lucro nulo ainda que essas pessoas estivessem erradas.A USDC tem cerca de $10b em \"cash\" em alguns bancos americanos. Entre esses bancos, há dois que vinhemos a conhecer bastante essa semana: Silvergate Bank e Silicon Valley bank.O Silvergate está em colapso.O Silicon Valley está em colapso.https://twitter.com/ChrisBlec/status/1634255612195291136Da atestação da Circle: https://6778953.fs1.hubspotusercontent-na1.net/hubfs/6778953/USDC%20Reserves%20Reports/USDC%20Reserve%20Breakdown_June.pdfOu seja, o risco é não-zero. Veremos o que a Circle e Coinbase tem a dizer.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444356",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "March 10, 2023, 07:52:06 PM",
      "body": "Quote from: TryNinja on March 10, 2023, 07:41:33 PMOu seja, o risco é não-zero. Veremos o que a Circle e Coinbase tem a dizer.É de se preocupar um pouco mesmo.Mas segurar qualquer stable tem sempre um risco. isso nunca foi risco-zero. Se trocar por USDT ou BUSD ou qualquer outra o risco sempre existe.O pior é que a remuneração é zero pelo risco assumido, então é em teoria algo bem ruim de segurar, a não ser que por algum motivo você não possa trocar por fiat.Quote from: TryNinja on March 10, 2023, 07:41:33 PMDa atestação da Circle: https://6778953.fs1.hubspotusercontent-na1.net/hubfs/6778953/USDC%20Reserves%20Reports/USDC%20Reserve%20Breakdown_June.pdfesse documento é meio antigo, junoh de 2022, e a SVB aparece no final da lista. Pode ser uma exposição pequena mesmo.Eu peguei o documento mais recente e está mais ou menos igualhttps://www.circle.com/hubfs/USDCAttestationReports/2023%20USDC_Circle%20Examination%20Report%20January%202023.pdfQuoteCash held at U.S. regulated financial institutions: Bank of New York Mellon, Citizens Trust Bank, Customers Bank,New York Community Bank, a division of Flagstar Bank, N.A., Signature Bank, Silicon Valley Bank and SilvergateBank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 10, 2023, 07:55:00 PM",
      "body": "Quote from: bitmover on March 10, 2023, 07:52:06 PMO pior é que a remuneração é zero pelo risco assumido, então é em teoria algo bem ruim de segurar, a não ser que por algum motivo você não possa trocar por fiat.Não faz sentido segurar USDC por segurar USDC, a menos que você queira uma exposição rápida e/ou talvez sonegada ao dólar. O interessante é (era) usar ele para ganhar mais dinheiro (alguém se recorda do DeFi? ) ou ter dólares on-chain para o que quer que seja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "March 10, 2023, 11:55:23 PM",
      "body": "Vi as noticias agora a pouco sobre o SVB, curioso que o banco ficou em apuros por estar com um % de caixa muito exposta a títulos americanos. Ele precisou fazer dinheiro e para isso teve que desfazer dos títulos justamente agora que a taxa de juros subiu e teve que assumir enorme prejuízo vendendo os títulos com valor descontado com a marcação a mercado. Esse colapso de bancos talvez faça o fed repensar a continuidade do aumento de juros pois isso pode acarretar uma quebradeira de empresas e bancos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 10, 2023, 11:59:21 PMLast edit: March 11, 2023, 12:36:32 PM by TryNinja",
      "body": "Quote from: tg88 on March 10, 2023, 11:55:23 PMVi as noticias agora a pouco sobre o SVB, curioso que o banco ficou em apuros por estar com um % de caixa muito exposta a títulos americanos. Ele precisou fazer dinheiro e para isso teve que desfazer dos títulos justamente agora que a taxa de juros subiu e teve que assumir enorme prejuízo vendendo os títulos com valor descontado com a marcação a mercado. Esse colapso de bancos talvez faça o fed repensar a continuidade do aumento de juros pois isso pode acarretar uma quebradeira de empresas e bancos.Para você ver que até algo considerado \"seguro\" pode resultar no colapso financeiro... depois falam mal do Bitcoin e das cryptomoedas... O problema é que aumentar os juros faz isso, enquanto não aumentar supostamente causa inflação. Se de ambos os lados estão (e estamos aqui também) lascados, qual a solução?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 11, 2023, 03:16:01 AMLast edit: March 11, 2023, 03:55:41 AM by TryNinja",
      "body": "Confirmado!!A Circle tem $3.3 bilhões no SVB, banco em colapso. Isso representa cerca de 8% das suas reservas de $40 bilhões. https://twitter.com/circle/status/1634391505988206592A stablecoin já perdeu cerca de 2% do seu peg na Kraken, local onde vendi o restinho que eu tinha na carteira (consegui dumpar logo após a criação desse thread, sem nenhuma perda). Em outras exchanges o depeg é ainda maior. Loucura que eu estou considerando tentar pegar a faca (com moderação)? A própria Coinbase parece já ter bloqueado o swap 1:1 entre USDC e USD: https://twitter.com/keoneHD/status/1634388307516768256edit: 7% off peg; 1 USDC = $0.93",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 11, 2023, 08:50:32 AM",
      "body": "Acho que chegou a hora de acabar com aquela brincadeira de converter BTC em alta por stablecoin, e depois voltar a comprar em baixa.O Bitcoin foi criado para as pessoas deixarem de estar expostas ao fiat, mesmo assim a malta continua a querer ligar uma coisa a outra, acabando por se expor a estes tipo de perigos.Lembrem-se que o Bitcoin foi criado na crise financeira de 2008. Então, nos estamos a ver isso volta acontecer uns 15 anos depois. Será que agora que temos o Bitcoin, queremos continuar a correr os mesmos riscos?Hoje li uma noticia bem interessante, a comparar a queda do Silicon Valley Bank as quedas em 2008, indicando que esta é a primeira grande queda desde essa altura:Falência do Silicon Valley Bank é das mais importantes desde crise de 2008Temos de nos lembrar, que agora vai ser tudo de seguida... o medo aumenta e todos vão a correr levantar o dinheiro, o que poderá resultar em mais problemas.Vamos ver e o fim de semana, acalma as coisas, para que as coisas não descabem na próxima semana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 11, 2023, 10:28:17 AM",
      "body": "Quote from: TryNinja on March 11, 2023, 03:16:01 AMConfirmado!!A Circle tem $3.3 bilhões no SVB, banco em colapso. Isso representa cerca de 8% das suas reservas de $40 bilhões. https://twitter.com/circle/status/1634391505988206592A stablecoin já perdeu cerca de 2% do seu peg na Kraken, local onde vendi o restinho que eu tinha na carteira (consegui dumpar logo após a criação desse thread, sem nenhuma perda). Em outras exchanges o depeg é ainda maior. Loucura que eu estou considerando tentar pegar a faca (com moderação)? A própria Coinbase parece já ter bloqueado o swap 1:1 entre USDC e USD: https://twitter.com/keoneHD/status/1634388307516768256edit: 7% off peg; 1 USDC = $0.93Que péssima notícia em. E que agilidade a sua. Ontem eu fiquei sabendo e não fiz nada e tenho uma exposição relevante, até por causa de um projeto recente. E de todas as notícias possíveis que poderíamos imaginar, jamais imaginei que debateriamos o USDC perdendo o peg por conta dos títulos que lastreavam o ativo, é simplesmente absurdo como tudo é completamente impossível de ser previsto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 11, 2023, 10:52:28 AM",
      "body": "Obrigado por ter avisado, talvez eu ia deixar pra depois, pensando que era só especulação do twitterEu tinha um pouco de USDC sim, mas consegui converter tudoDetalhe, a Binance ontem deixou de converter depósitos em USDC para BUSD 1:1, era uma boa estratégia mas muita gente deve ter tentando fazer isso.A minha solução foi comprar MATIC e BTC mesmoEspero que ninguém aqui perca dinheiro",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 11, 2023, 12:40:50 PM",
      "body": "Quote from: Disruptivas on March 11, 2023, 10:28:17 AMQue péssima notícia em. E que agilidade a sua. Ontem eu fiquei sabendo e não fiz nada e tenho uma exposição relevante, até por causa de um projeto recente. E de todas as notícias possíveis que poderíamos imaginar, jamais imaginei que debateriamos o USDC perdendo o peg por conta dos títulos que lastreavam o ativo, é simplesmente absurdo como tudo é completamente impossível de ser previsto. No máximo absoluto vai ser uma perde de 8%, e isso apenas se o a Circle perdesse 100% do que eles tinham no SVB (o que me parece impróvavel).Se eles recuperarem 50%, é uma perda de 4%.Se eles recuperarem 90%, é uma perda de 0.8% (que eles ainda conseguem cobrir por conta própria).Talvez acabe que você não perca nada, a resposta provavelmente começará a se fazer na segunda.Falamos tanto da USDT aqui e olha no que deu... BUSD fechada, USDC $0.91 ... enquanto a USDT chegou a bater um premium.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 11, 2023, 01:23:50 PM",
      "body": "Quote from: TryNinja on March 11, 2023, 12:40:50 PMQuote from: Disruptivas on March 11, 2023, 10:28:17 AMQue péssima notícia em. E que agilidade a sua. Ontem eu fiquei sabendo e não fiz nada e tenho uma exposição relevante, até por causa de um projeto recente. E de todas as notícias possíveis que poderíamos imaginar, jamais imaginei que debateriamos o USDC perdendo o peg por conta dos títulos que lastreavam o ativo, é simplesmente absurdo como tudo é completamente impossível de ser previsto. No máximo absoluto vai ser uma perde de 8%, e isso apenas se o a Circle perdesse 100% do que eles tinham no SVB (o que me parece impróvavel).Se eles recuperarem 50%, é uma perda de 4%.Se eles recuperarem 90%, é uma perda de 0.8% (que eles ainda conseguem cobrir por conta própria).Talvez acabe que você não perca nada, a resposta provavelmente começará a se fazer na segunda.Falamos tanto da USDT aqui e olha no que deu... BUSD fechada, USDC $0.91 ... enquanto a USDT chegou a bater um premium. É isso, o risco que vemos parece que NUNCA é o risco real. Os holofotes não veem o que importa e chamam atenção pro que é melhor. Esses dias fizemos uma análise da eficiencia energética dos nós, considerando os requisitos minimos necessários. O Bitcoin foi praticamente o melhor de uma análise de 10 blockchains. Todo mundo fala dele, mas ele é o que tem mais se esforçado pra fazer da melhor forma. Me parece o mesmo caso, sabe?Mas ei já fiquei meio puta comigo mesma por ter stablecoin, acho que é contra minha filosofia anarquista e to me traindo então na raiva contra mim mesma, comprei um tanto em Bitcoin. E agora só quero investir em btc, tijolo, abelhas, terrenos e coisas reais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 11, 2023, 04:50:07 PM",
      "body": "Uma oportunidade para quem quiser brincar de arbitrar... o USDC está custando $0.92 na Kraken e on-chain, enquanto tem gente pagando $0.95 na Gemini. Recomprei o meu restinho de USDC na Kraken, mandei para a Gemini e vendi lá.Principais riscos: 1. Problemas na Gemini; 2. Volatilidade, preço do USDC corrige na Gemini. O meu deposito demorou um pouco pra ser creditado, então aumenta esse risco.No final das contas deu certo. 3576 USDC -> 3924 USDC -> 3794 USD. Lucro de $218 ou ~6% em uma tacada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 11, 2023, 05:17:04 PM",
      "body": "Quote from: TryNinja on March 11, 2023, 04:50:07 PMUma oportunidade para quem quiser brincar de arbitrar... o USDC está custando $0.92 na Kraken e on-chain, enquanto tem gente pagando $0.95 na Gemini. Recomprei o meu restinho de USDC na Kraken, mandei para a Gemini e vendi lá.Principais riscos: 1. Problemas na Gemini; 2. Volatilidade, preço do USDC corrige na Gemini. O meu deposito demorou um pouco pra ser creditado, então aumenta esse risco.No final das contas deu certo. 3576 USDC -> 3924 USDC -> 3794 USD. Lucro de $218 ou ~6% em uma tacada.TryNinja e os seus malabarismo, de troca de moedas de um lado para o outro, de modo a conseguir a melhor rentabilidade possível.Felizmente deu certo, e conseguiu recuperar boa parte do valor que lá tinha.Boa dicas para quem tem USDC na Kraken ou em outra exchange que esteja a custar menos que na Gemini. Mas, a coisa não deve durar muito, por isso é aproveitar rápido antes que deixe de compensar essas movimentações.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 11, 2023, 06:40:25 PM",
      "body": "Acordei hoje com o usdc valendo 0.89 e agora está valendo 0.95Sinceramente,  acho q isso é so fud. Tenho uma pequena posição rm usdc  e resolvi não mexer.É provavel que a busd e a usdt tenham saldos ainda maiores no SVB , mas como são menos transparentes o mercado não penalizou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 11, 2023, 06:43:11 PM",
      "body": "Quote from: bitmover on March 11, 2023, 06:40:25 PMSinceramente,  acho q isso é so fud. O que seria FUD? Foi confirmado pela Circle que eles tem 8% das suas reservas no SVB, que foi fechado pelo FDIC...Quote from: bitmover on March 11, 2023, 06:40:25 PMÉ provavel que a busd e a usdt tenham saldos ainda maiores no SVB , mas como são menos transparentes o mercado não penalizou.De acordo com eles, não. Claro que você pode especular ser mentira, mas vai ser só especulação.https://twitter.com/paoloardoino/status/1634304670184222722https://twitter.com/PaxosGlobal/status/1634242623916642304",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "March 11, 2023, 08:13:59 PM",
      "body": "Quote from: bitmover on March 11, 2023, 06:40:25 PMAcordei hoje com o usdc valendo 0.89 e agora está valendo 0.95Sinceramente,  acho q isso é so fud. Tenho uma pequena posição rm usdc  e resolvi não mexer.É provavel que a busd e a usdt tenham saldos ainda maiores no SVB , mas como são menos transparentes o mercado não penalizou.Eu já penso que não seja apenas fud. Está mais parecendo malandragem mesmo. Se por enquanto a Cicle diz que 3 bilhões foram bloqueados no SVB, por que não usaram os outros 8 bilhões que eles dizem ter em cash em outros bancos para manter a paridade?Por que a coinbase, que é tão ligada a eles, não sei se ainda são sócios, bloqueou imediatamente a troca por USD.Isso é muito estranho. Pode-se criar até uma teoria da conspiração achando que a própria Cicle recomprou seu tokem pagando deságio de 5 a 8% e assim amortizando a possível perda no SVB.Eu ainda mantenho minhas posições em USDC e também em BUSD. Não tenho motivo para trocar por outra shitcoin e também não quero aumentar meu portfólio em bitcoins. Já tenho BTC suficiente. Vou manter minha estratégia de vender minhas stablecoins um pouco por vez. Devagar e sempre.   Vamos aguardar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 11, 2023, 08:20:09 PMLast edit: March 11, 2023, 08:31:44 PM by TryNinja",
      "body": "Quote from: Paredao on March 11, 2023, 08:13:59 PMEu já penso que não seja apenas fud. Está mais parecendo malandragem mesmo. Se por enquanto a Cicle diz que 3 bilhões foram bloqueados no SVB, por que não usaram os outros 8 bilhões que eles dizem ter em cash em outros bancos para manter a paridade?Por que a coinbase, que é tão ligada a eles, não sei se ainda são sócios, bloqueou imediatamente a troca por USD.Isso é muito estranho. Pode-se criar até uma teoria da conspiração achando que a própria Cicle recomprou seu tokem pagando deságio de 5 a 8% e assim amortizando a possível perda no SVB.Não é assim que funciona... já ouviu falar em um bank run?Eles tem $40 bilhões em circulação e $10 bilhões liquidos, em cash, sendo que $3 bilhões estão travados no SVB. O que acontece se eles liberam tudo? Todo mundo sai correndo para a porta de saida, sendo que há espaço apenas para $7 bilhões. E aí? Vai favorecer os mais rápidos e/ou o pessoal de dentro? E o restante dos $33 bilhões?Além do mais, há um bilhão de regulamentos e medidas a se pensar. Esse bloqueio aliado a uma recompra escondida provavelmente ainda seria ilegal. Eles ainda disseram que vão abrir os saques na segunda (ainda que eu ache impróvavel, ou que seria 1:1). Ou eles encontram uma solução para aguentar o bank run (mesmo que seja dando uma paridade de 1:0.92), ou vão seguir com tudo bloqueado até que o governo decida se vai salvar ou não os bancos.edit:Outro update da Circle, planejam cobrir qualquer perdas que ocorrerem por conta da SVB: https://www.circle.com/blog/an-update-on-usdc-and-silicon-valley-bank",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 11, 2023, 09:49:53 PM",
      "body": "Quote from: TryNinja on March 11, 2023, 08:20:09 PMQuote from: Paredao on March 11, 2023, 08:13:59 PMEu já penso que não seja apenas fud. Está mais parecendo malandragem mesmo. Se por enquanto a Cicle diz que 3 bilhões foram bloqueados no SVB, por que não usaram os outros 8 bilhões que eles dizem ter em cash em outros bancos para manter a paridade?Por que a coinbase, que é tão ligada a eles, não sei se ainda são sócios, bloqueou imediatamente a troca por USD.Isso é muito estranho. Pode-se criar até uma teoria da conspiração achando que a própria Cicle recomprou seu tokem pagando deságio de 5 a 8% e assim amortizando a possível perda no SVB.Não é assim que funciona... já ouviu falar em um bank run?Não acho que seja assim q funcione.Isso não é bank run. As exchanges não são bancos. Isso é só marcação a mercado.É fud pq só 8% das reservas estão potencialmente comprometidas, e o preço caiu 20%.É fud pq os 8% podem ser recuperados e ser 0 o buraco É fud pq as outras stablecoins podem estar mais alavancadas.A circle não vai em exchanges comprar usdc pra manter a paridade, por isso a tese do paredao não faz sentido tb.É só fud. Bom pra quem comprou, Ruim pra quem vendeu.De qq forma, segunda deve tá 1:1 e vou trocar pro usd pq não tenho q passar essa volatilidade",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 11, 2023, 09:59:42 PMLast edit: March 11, 2023, 10:10:51 PM by TryNinja",
      "body": "Quote from: bitmover on March 11, 2023, 09:49:53 PMNão acho que seja assim q funcione.Isso não é bank run. As exchanges não são bancos. Isso é só marcação a mercado.Essa é a definição de bank run.Você tem $40 bilhões de USDC, o lastro desses $40 bilhões não é liquido, você só tem 17% desse valor disponível para saques + 8% em perdas (seja temporaria ou não), todo mundo correndo para sacar com medo de insolvência = é a DEFINIÇÃO de bank run. Não é por que tem \"bank\" no nome que é limitado aos bancos e deixa de ser um bank run.QuoteWhat Is a Bank Run?A bank run occurs when a large number of customers of a bank or other financial institution withdraw their deposits simultaneously over concerns of the bank's solvencyAs more people withdraw their funds, the probability of default increases, prompting more people to withdraw their deposits. In extreme cases, the bank's reserves may not be sufficient to cover the withdrawals.https://www.investopedia.com/terms/b/bankrun.aspQuote from: bitmover on March 11, 2023, 09:49:53 PMÉ fud pq só 8% das reservas estão potencialmente comprometidas, e o preço caiu 20%.Um exagero. O preço caiu, no máximo, 10-12%.E caiu tudo isso pois tem gente querendo sair da moeda, normal. Não significa que a notícia confirmada pela própria empresa é FUD.Quote from: bitmover on March 11, 2023, 09:49:53 PMÉ fud pq os 8% podem ser recuperados e ser 0 o buraco Pode, pode... mas a notícia é clara. \"Temos 8% das reservas em um banco que foi fechado e vai ser liquidado\"Quote from: bitmover on March 11, 2023, 09:49:53 PMÉ fud pq as outras stablecoins podem estar mais alavancadas.\"Pode, pode\"E o foco aqui é a USDC.Se você acha FUD, tudo bem. Mas, notoriamente, FUD engloba notícias que são criadas ou mal-interpretadas para botar medo no pessoal. Não é o caso aqui, pois são fatos concretos. Só posso discordar.QuoteFUD is a disinformation strategy used by marketing and sales professionals that stands for Fear, Uncertainty, and Doubt. It’s commonly used in the sales, marketing, polling, and public relations fields. FUD is used to influence consumer perception of a competitor’s product by appealing to fear.https://www.webopedia.com/definitions/fud/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 11, 2023, 10:26:00 PM",
      "body": "Uma coisa é certa, na segunda-feira se a ficar 1:1, a malta vai toda vender.Resta saber se a Circle vai conseguir suportar toda essa venda que será realizada.A menos que até segunda os reguladores deem indicação ao mercado que irão assegurar o dinheiro no SVB.Alias, convém eles dizerem alguma coisa, por caso contrario o mercado poderá continuar em queda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}