{
  "id": "topic_5474240",
  "title": "logfiles",
  "author": "logfiles",
  "created_time": "November 15, 2023, 11:58:35 PM",
  "content": "ViaBTC offers 100 Free hourly slots for transactions they can help to accelerate if they meet the requirements but this get used up in just 3 minutes lately  Can anyone recommend any good free alternative transaction accelerator to viaBTC that they know?We are looking at real transaction accelerators and not transaction rebroadcasters.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474240",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "November 16, 2023, 02:34:07 AM",
      "body": "As far as I know they (ViaBTC) are the only one miner that offer this service for free for small transactions... all other that I found are only rebroadcasters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 16, 2023, 03:33:14 AM",
      "body": "You can determine whether the Bitcoin transaction accelerator is real or a scam if you find that it is linked to a specific mining pool. ViaBTC has about 10.12%, which means that out one of every 10 blocks that are mined, on average they have one block every 100 minutes that can accelerateOther mining pools like btc.com had accelerators, but the links are not working now.So viaBTC is your only option and you need to wait until mempool.space launches this service https://twitter.com/mempool/status/1659619347910803466If you have time, search for mining pools contact links and ask them personally to list your transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 16, 2023, 05:27:27 AM",
      "body": "They're right, it's only viabtc that's working. This was my problem before and I've stumbled upon this thread made by Zepher: FREE BTC Tx Accelerators. Stop paying for something that is free!But sadly, most of them are gone already and the one that's real working is viabtc and the rest, yes just rebroadcasters. With most of the research that I've done, none of them really are going to work except viabtc.If you want a real accelerator, the real ones are requiring fee just like with Binance transaction accelerator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 16, 2023, 07:14:59 AM",
      "body": "Quote from: logfiles on November 15, 2023, 11:58:35 PMViaBTC offers 100 Free hourly slots for transactions they can help to accelerate if they meet the requirements but this get used up in just 3 minutes lately  Wait for the next one hour and you will be able to submit your txid successfully. I still used ViaBTC free accelerator some hours ago with 20 sat/vbyte paid as fee in my transaction and it worked perfectly. Wait for the next one hours. You can submit your txid within that 3 minutes.The only accelerator that I know again is Binance pool and it is not free and likely only available to Binance users is my guess. And you know that the exorbitant fee required for paid accelerators made them not worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "November 16, 2023, 09:02:06 AM",
      "body": "From my experience bitaccelerate.com has always worked well. It rebroadcasts the transaction among many nodes, and is completely free.Everything else I have tried has either been paid, or free but not effective. I've tried and experimented with every single one, except I have done this some time ago. There may be better solutions, however bitaccelerate has always done the job for me.I hope this helps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 16, 2023, 09:27:41 AM",
      "body": "Quote from: BenCodie on November 16, 2023, 09:02:06 AMFrom my experience bitaccelerate.com has always worked well. It rebroadcasts the transaction among many nodes, and is completely free.Rebroadcasting a different from acceleration. There are many other websites that allow you to (re)broadcast your transaction freely. With rebroadcasting your transaction, you only broadcast it again and its only effect is that if a node has dropped your transaction from its mempool, it may receive and put your transaction in its mempool again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 16, 2023, 09:35:22 AM",
      "body": "Quote from: hosseinimr93 on November 16, 2023, 09:27:41 AMWith rebroadcasting your transaction, you only broadcast it again and its only effect is that if a node has dropped your transaction from its mempool, it may receive and put your transaction in its mempool again. And instead to just let the transaction to be dropped from mempool and be spent again if not supporting replace-by-fee, rebroadcasting makes it frustrating and not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 16, 2023, 09:35:29 AM",
      "body": "That's something weird, but when i'm using viabtc it always like 90+ available, it happen at least 3 times this past week, or maybe it just a timing, i don't know, coz i didnt mind the time.But for recommendation? Nah, viabtc is the only existing miner who has free transaction accelerator since antpool stop theirs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 16, 2023, 10:36:23 AM",
      "body": "Quote from: PX-Z on November 16, 2023, 09:35:29 AMThat's something weird, but when i'm using viabtc it always like 90+ available, it happen at least 3 times this past week, or maybe it just a timing, i don't know, coz i didnt mind the time.But for recommendation? Nah, viabtc is the only existing miner who has free transaction accelerator since antpool stop theirs.Just now I tried to use VIABTC but it shows zero I've been using this for two months already and this is the first time it shows zero, probably because of the congestion my other alternatives are bitaccelerate and this Code:https://t.me/BitcoinAccelerator_BOT this bot offer one time free acceleration and you have to pay a ONE TIME PAYMENT For 12 months, I don't guarantee their service and use it at your own risk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "November 16, 2023, 10:49:28 AM",
      "body": "Quote from: logfiles on November 15, 2023, 11:58:35 PMViaBTC offers 100 Free hourly slots for transactions they can help to accelerate if they meet the requirements but this get used up in just 3 minutes lately  Can anyone recommend any good free alternative transaction accelerator to viaBTC that they know?We are looking at real transaction accelerators and not transaction rebroadcasters.Last time I checked them, they were always available because they changed their terms and were only accepting specific transactions, I couldn't imagine if that slots would ever get filled.There is not any good free bitcoin transaction accelerator, simply there isn't one. Paid ones ask you so much that it doesn't worth it. I remember that Quickseller has an access to some pools and can accelerate your transaction, you can contact him but he is not active lately.Quote from: BenCodie on November 16, 2023, 09:02:06 AMFrom my experience bitaccelerate.com has always worked well. It rebroadcasts the transaction among many nodes, and is completely free.Everything else I have tried has either been paid, or free but not effective. I've tried and experimented with every single one, except I have done this some time ago. There may be better solutions, however bitaccelerate has always done the job for me.I hope this helps You are just lucky. When you were using bitaccelerator, your transaction got broadcasted again but that is not what made it confirmed. Luckily, transaction fees decreased at the same time and your transaction has got included in bitcoin blocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 16, 2023, 12:41:57 PM",
      "body": "Quote from: robelneo on November 16, 2023, 10:36:23 AMCode:https://t.me/BitcoinAccelerator_BOT this bot offer one time free acceleration and you have to pay a ONE TIME PAYMENT For 12 months, I don't guarantee their service and use it at your own risk I don't know if that is the same bot that some user send me time ago, but all those bots or services are just rebroadcasters.Quote from: hosseinimr93 on November 16, 2023, 09:27:41 AMRebroadcasting a different from acceleration.Yes that is true, but all those services that just rebroadcast transactions they sell itself as accelerators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "November 16, 2023, 02:48:08 PM",
      "body": "Quote from: Charles-Tim on November 16, 2023, 07:14:59 AMWait for the next one hour and you will be able to submit your txid successfully. I still used ViaBTC free accelerator some hours ago with 20 sat/vbyte paid as fee in my transaction and it worked perfectly. Wait for the next one hours. You can submit your txid within that 3 minutes.I know this. I am just looking for an alternative Bitcoin transaction accelerator, just in case viaBTC decided to stop their service. I have seen almost 8 bitcoin transaction accelerators that were working in the past and all of them are now defunct. What are the odds that ViaBTC might also stop this free service soon? Pretty high IMO.Quote from: BenCodie on November 16, 2023, 09:02:06 AMFrom my experience bitaccelerate.com has always worked well. It rebroadcasts the transaction among many nodes, and is completely free.Rebroadcasting doesn't help if the mempool is packed to the brim and your transaction fee rate is way low. What probably happened was a coincidence that at the time you made a rebroadcast, the optimal transaction fee rate for the transaction to be included in the next block had dropped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 16, 2023, 04:43:12 PM",
      "body": "Quote from: logfiles on November 16, 2023, 02:48:08 PMI know this. I am just looking for an alternative Bitcoin transaction accelerator, just in case viaBTC decided to stop their service. I have seen almost 8 bitcoin transaction accelerators that were working in the past and all of them are now defunct. What are the odds that ViaBTC might also stop this free service soon? Pretty high IMO.Are you sure it was transaction accelerators or was it just rebroadcasting services? I have never found any free BTC accelerator except ViaBTC, and it has been the only free service that works for years. I don't see why Via would decide to cancel that service now, because it doesn't cost them too much, and it does a very good job of advertising for them. In addition, they changed some conditions for free transactions, and I think that some new changes could happen rather than canceling the free service.Fees are obviously too high for some at the moment, but let's remember that at the end of 2017 they were even $50 at one point, and not so long ago almost x3 than they are now. I don't know if it's ordinal nonsense or something else, but I hope it will go as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 17, 2023, 08:02:02 AM",
      "body": "Quote from: shield132 on November 16, 2023, 10:49:28 AMI remember that Quickseller has an access to some pools and can accelerate your transaction, you can contact him but he is not active lately.You're right, Quickseller can accelerate transactions through F2Pool, and last time I checked, he/she was charging a small [reasonable] fee, so it might not come in handy for OP.Quote from: Lucius on November 16, 2023, 04:43:12 PMI don't see why Via would decide to cancel that service now, because it doesn't cost them too much, and it does a very good job of advertising for them.I completely agree... Having said that, back in the day, AntPool was also offering free TX accelerations [without limits (IIRC)] but for some reason, they halted its operations [unfortunately].@logfilesI've been monitoring ViaBTC for the past few hours and it appears that there's less stress on their services now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "November 17, 2023, 11:31:55 PM",
      "body": "Quote from: Lucius on November 16, 2023, 04:43:12 PMAre you sure it was transaction accelerators or was it just rebroadcasting services? I have never found any free BTC accelerator except ViaBTC, and it has been the only free service that works for years. Yes real transaction accelerators. Let me list some of them for you1. https://pushtx.btc.com ---- Archive2. https://www.antpool.com/user/prioritiseTransaction.htm?m=savePrioritiseTx 3. https://www.f2pool.com/pushtx 4. http://pushtx.com/Quote from: Lucius on November 16, 2023, 04:43:12 PMI don't see why Via would decide to cancel that service now, because it doesn't cost them too much, and it does a very good job of advertising for them. In addition, they changed some conditions for free transactions, and I think that some new changes could happen rather than canceling the free serviceThe same reason other genuine transaction accelerators stop their service. The fees the miners will earn compared to other mining pools. Remember, mining pools are now getting more reliant on the transaction fees rather than block rewards and are soon going to be halved again. 100 transactions with way fewer fees per hour means less fees for the miners every time ViaBTC mines a block. If it's after 4 hours, that's 400 transactions with fewer fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 18, 2023, 03:12:58 AM",
      "body": "While I have no proof whatsoever(I am not that smart), based on my experience in the last bullrun where fees skyrocketed, viaBTC's transaction accelerator is the only accelerator that actually works. The trick around the 100-per-hour limit is to get ready the next hour and accelerate your transaction the first second.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 18, 2023, 03:35:39 AM",
      "body": "Quote from: robelneo on November 16, 2023, 10:36:23 AM... this Code:https://t.me/BitcoinAccelerator_BOT this bot offer one time free acceleration and you have to pay a ONE TIME PAYMENT For 12 months, I don't guarantee their service and use it at your own risk Can you tell what miner did your transaction is mined? It can be seen on any bitcoin explorer using the transaction id with the block number. If it's other miner other than viabtc, the chance of it being legit is high, but if the other way around, then it's just using the current network condition to scam people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 18, 2023, 11:49:20 AM",
      "body": "Quote from: logfiles on November 17, 2023, 11:31:55 PMThe same reason other genuine transaction accelerators stop their service. The fees the miners will earn compared to other mining pools. Remember, mining pools are now getting more reliant on the transaction fees rather than block rewards and are soon going to be halved again. 100 transactions with way fewer fees per hour means less fees for the miners every time ViaBTC mines a block. If it's after 4 hours, that's 400 transactions with fewer fees. I don't think that ViaBTC can generate any serious losses with this free service, but that it uses them very well to attract a large number of people to visit their website, which offers some other tools besides transaction accelerators. Of course, there is also an accelerator that is not free, and it is certainly used by some, so we can talk about some kind of source of income here as well.At the end of the day, we cannot rely on such services forever, and even if they are still available with only 100 free transactions every hour, this will not solve the problem of expensive fees, not even for 1% of users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 18, 2023, 01:23:09 PM",
      "body": "Quote from: PX-Z on November 18, 2023, 03:35:39 AMQuote from: robelneo on November 16, 2023, 10:36:23 AM... this Code:https://t.me/BitcoinAccelerator_BOT this bot offer one time free acceleration and you have to pay a ONE TIME PAYMENT For 12 months, I don't guarantee their service and use it at your own risk Can you tell what miner did your transaction is mined? It can be seen on any bitcoin explorer using the transaction id with the block number. If it's other miner other than viabtc, the chance of it being legit is high, but if the other way around, then it's just using the current network condition to scam people.Sorry for the late reply, I could have upgraded because they offer a cheap price for acceleration for 12 months but they did not disclose their nodes they just say its private nodes but they offer a one-time free acceleration which I used to accelerate one of my pending transactions you can try to use their one-time use of free acceleration but I don't recommend that you upgrade seeing that there's no transparency, for all we know they just rebroadcast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}