{
  "id": "topic_5432424",
  "title": "maxtra",
  "author": "maxtra",
  "created_time": "December 30, 2022, 07:48:18 PM",
  "content": "Hello Friends, I'm from New Delhi, India and into crypto things since 2012. Recently I interacted with many people through random channels and sources and found: Many people are unaware of cryptocurrencies. Not even C of CRYPTO word.Many of them have an interest but don't have an idea to get started. Many of them only heard about digital assets but are afraid of losing funds. And the people who are aware of bitcoin & cryptos, but aren't aware of money-making strategies. Considering the above, we are starting a webinar to educate people about cryptocurrencies and the digital asset investment process. What do you think about this idea?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432424",
  "comments": [
    {
      "author": "teosanru",
      "created_time": "December 30, 2022, 09:32:03 PM",
      "body": "Quote from: maxtra on December 30, 2022, 07:48:18 PMHello Friends, I'm from New Delhi, India and into crypto things since 2012. Recently I interacted with many people through random channels and sources and found: Many people are unaware of cryptocurrencies. Not even C of CRYPTO word.Many of them have an interest but don't have an idea to get started. Many of them only heard about digital assets but are afraid of losing funds. And the people who are aware of bitcoin & cryptos, but aren't aware of money-making strategies. Considering the above, we are starting a webinar to educate people about cryptocurrencies and the digital asset investment process. What do you think about this idea?I think it's a great idea and it's a pretty good time to start it as well. These days people as the bear run is going on people are being lured into some schemes saying that this will be the next good investment for bull run. Also the enthusiasm of people in crypto is lower. In sometime say an year or so whenever bull run clicks in people will once again jump rapidly towards the market and then will be your time to shine as a channel and become pretty popular as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}