{
  "id": "topic_5417047",
  "title": "GreatArkansas",
  "author": "GreatArkansas",
  "created_time": "October 14, 2022, 04:05:44 AM",
  "content": "Are there any exchanges that have a feature on their orders about putting a limit on how long the order will stay?Example: Like let's say, you put in a buy limit order with the following price, and you want if this order will not be triggered for a given date or time, the order will be canceled.Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417047",
  "comments": [
    {
      "author": "Cointxz",
      "created_time": "October 14, 2022, 04:21:48 AM",
      "body": "Quote from: GreatArkansas on October 14, 2022, 04:05:44 AMAre there any exchanges that have a feature on their orders about putting a limit on how long the order will stay?Example: Like let's say, you put in a buy limit order with the following price, and you want if this order will not be triggered for a given date or time, the order will be canceled.Thanks!I use most of the CEX such as Binance, Okex, Kucoin, Bybit and other bunch of mediocre exchange but there’s no such conditional order that based on time limit. Most of the order types depends only on the price and not on the time frame. I think only bot can give you this special feature since a bot devs can code this command base on time.I’m interested too if there’s really an exchange that has this kind of order feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 14, 2022, 05:22:29 AM",
      "body": "I have used 4 exchanges before for a long time, I did not see anything like that. Presently using Binance and OKX, also I have not see anything like that. I do not think there is anything like that on exchanges. Only setting the price is available on those exchanges, but setting the data is not possible as the exchanges make it not to be possible. What I think is that, it is because exchanges prefer users to make orders using price and not time.But what I think is that someone should not think like that, unused money should not be on an exchange, while this kind of feature will only encourage leaving money on exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue_hurricanger",
      "created_time": "October 14, 2022, 09:45:31 AM",
      "body": "Order time out after a set of times? Haven't seen anything like that yet on most exchanges I've used (Binance, Kucoin, MEXC, HitBTC, Bittrex,...). I think you can still do it with the exchange's API or ask some dev to implement that in their bot/auto-trade or anything similar to that. Maybe it wasn't needed for the majority of traders so exchanges didn't have it but now you saying it, I think there may be some cases for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 14, 2022, 12:21:09 PM",
      "body": "I think you can do this using trading bots or using some auto click browser based solutions.I don't know if you'll find a free or paid solution but you can pay a developer to make this work, not requiring a lot of coding.How you will pay for such service?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 14, 2022, 01:38:44 PM",
      "body": "I got to know this on stock trading as GTC (Good Til Canceled) which is the default setting. I was looking for a glimpse of this feature for crypto platform and I found it on Coinbase. Unfortunately, I'm not a coinbase user here so I can't explain in detail how it works.Edit: just found this.I think \"Good Til Time\" is the feature you are looking for, the expiry time of the order can be adjusted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "October 14, 2022, 02:58:33 PM",
      "body": "Quote from: noorman0 on October 14, 2022, 01:38:44 PMI got to know this on stock trading as GTC (Good Til Canceled) which is the default setting. I was looking for a glimpse of this feature for crypto platform and I found it on Coinbase. Unfortunately, I'm not a coinbase user here so I can't explain in detail how it works.Edit: just found this.I think \"Good Til Time\" is the feature you are looking for, the expiry time of the order can be adjusted.I think this could be what Op is asking for, the time expiration for orders incase it order didn't fill up and I think this is a very good feature incase the price action keep delaying you could set the expiration for the time to cancel the order.Meanwhile I think you should reduce the height.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ararbermas",
      "created_time": "October 14, 2022, 03:00:32 PM",
      "body": "Quote from: GreatArkansas on October 14, 2022, 04:05:44 AMAre there any exchanges that have a feature on their orders about putting a limit on how long the order will stay?Example: Like let's say, you put in a buy limit order with the following price, and you want if this order will not be triggered for a given date or time, the order will be canceled.Thanks! i don't know if its possible because what i know is it's manual and your order will be floating in the market until it got executed or the price reached the limit order..  And i never heard such features to be honest,  however if its existed, in other platform and it get expired as well probably a big help coz you don't need to monitor your trade everytime especially if you're busy in other things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 14, 2022, 03:19:43 PMLast edit: May 20, 2023, 07:28:15 PM by stompix",
      "body": "Quote from: noorman0 on October 14, 2022, 01:38:44 PMI got to know this on stock trading as GTC (Good Til Canceled) which is the default setting. I was looking for a glimpse of this feature for crypto platform and I found it on Coinbase. Unfortunately, I'm not a coinbase user here so I can't explain in detail how it works.It's still available for coinbase, you just set the time for which you want to keep the trade open and that's it.Bitpanda (pro) has the same thing:Unfortunately, there is a small problem, you can't set the time when it expires, you can just select predetermined values, like expire 1,5,30mins from now, 4,6,12 hours a day or a week, so if you plan on setting it up for an exactly specific moment when you know something big will happen, like a FED announcement you can't do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 15, 2022, 03:58:08 AM",
      "body": "Easiest way to do this without any expert programming would be to just use the API and basically set some task such as cron job or whatever it’s called to execute at a specific time.So you get your private API keys and basically send the command to cancel the order at a specific time. It’s most likely the easiest way except doing it manually perhaps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "October 15, 2022, 04:39:50 AM",
      "body": "Quote from: GreatArkansas on October 14, 2022, 04:05:44 AMAre there any exchanges that have a feature on their orders about putting a limit on how long the order will stay?Example: Like let's say, you put in a buy limit order with the following price, and you want if this order will not be triggered for a given date or time, the order will be canceled.Thanks!I've never encountered such exchange. I mean what's the catch of such feature? I think it doesn't benefit any of both parties, because let's say you've made an order, you won't need anything but to wait especially in this kind of market, hassle free and the time you'll open up the account on that certain exchange, maybe it's been sold already and you made a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 15, 2022, 04:54:50 AM",
      "body": "FTX has conditional orders, what I'm not sure about is if their conditional orders supports stuff concerning time. If not — then yea you're probably stuck with using scripts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "October 16, 2022, 05:42:07 PM",
      "body": "Quote from: GreatArkansas on October 14, 2022, 04:05:44 AMAre there any exchanges that have a feature on their orders about putting a limit on how long the order will stay?Example: Like let's say, you put in a buy limit order with the following price, and you want if this order will not be triggered for a given date or time, the order will be canceled.Thanks!Haven't really encountered any exchange with such feature but it feels like every exchange must have one so users don't have to ise API and set it using scripts it should be available for every users and I guess in future we may see this feature will be implemented on exchanges. But as if now available in coinbase unfortunately its only available for limited countries so exchange like Binance,Kucoin,etc should add this into their to do list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "October 22, 2022, 12:18:34 PM",
      "body": "Quote from: jrrsparkles on October 16, 2022, 05:42:07 PMQuote from: GreatArkansas on October 14, 2022, 04:05:44 AMAre there any exchanges that have a feature on their orders about putting a limit on how long the order will stay?Example: Like let's say, you put in a buy limit order with the following price, and you want if this order will not be triggered for a given date or time, the order will be canceled.Thanks!Haven't really encountered any exchange with such feature but it feels like every exchange must have one so users don't have to ise API and set it using scripts it should be available for every users and I guess in future we may see this feature will be implemented on exchanges. But as if now available in coinbase unfortunately its only available for limited countries so exchange like Binance,Kucoin,etc should add this into their to do list. Me neither but some users above already found it. It seems that most of us here didn't use coinbase or bitpanda. Coinbase is also popular as the other exchange that we are using but I think they are only a little strict which is why we avoid it but bitpanda is the opposite of coinbase, it isn't popular which is why many of us avoid it as well.Lots of exchanges doesn't have this time feature yet, maybe because they think it wasn't really needed? And there is also less to no people that request to add this feature, which is why they didn't bother adding it. Other suggestions above like using a bot might also work too if the op won't use coinbase and bitpanda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 23, 2022, 10:52:37 AM",
      "body": "Quote from: mk4 on October 15, 2022, 04:54:50 AMFTX has conditional orders, what I'm not sure about is if their conditional orders supports stuff concerning time. If not — then yea you're probably stuck with using scripts.They don't have what I am looking for, they only have this TWAP (Time-weighed average price) order. There is input for a time but it's something with size, etc. It's very far from what I am looking for in a type of order.I'm very curious why popular or top exchanges don't have this kind of order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "October 23, 2022, 07:02:39 PM",
      "body": "Quote from: GreatArkansas on October 23, 2022, 10:52:37 AMQuote from: mk4 on October 15, 2022, 04:54:50 AMFTX has conditional orders, what I'm not sure about is if their conditional orders supports stuff concerning time. If not — then yea you're probably stuck with using scripts.They don't have what I am looking for, they only have this TWAP (Time-weighed average price) order. There is input for a time but it's something with size, etc. It's very far from what I am looking for in a type of order.I'm very curious why popular or top exchanges don't have this kind of order.That's one future your suggesting over there. It sort of reminds me of the spot market in FX trading where, orders are placed on a bull or bear side within a give time frame and the reward comes at a ratio if it ends in your favour or you lose your order.Although, this is of a different kind. I think the popular platforms have become more traditional to have this missing in there tools but a good to be integrated one when suggested. Most of these could be missing due to not seeing the need of having them.More over, a bot could serve that purpose if you can get one and programme it to manage your trades or perhaps, leave notifications on the development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 25, 2022, 04:57:24 PM",
      "body": "Quote from: GreatArkansas on October 23, 2022, 10:52:37 AMI'm very curious why popular or top exchanges don't have this kind of order.You can see why in this topic, some don't even know this was a possibility for an older, so if you get people that trade coins and never felt the need for such a thing nor do they see an immediate need for it neither will exchanges see the need to implement this and add a ton of possible problems with it for a small userbase. Most of them in order to avoid this, have gone the way of API, you want something special, here, you play with it, our stock services are for one-two clicks customers, you want something more complicated, do it yourself, plus the ones with high volume will never use their dashboard and they have their own custom bots setting trades all times.On top of that, if they really do implement more of those options, like Bitpand they will go for the \"pro\" version, exchanges are always looking for something to sell to their users so if one will ever implement such features it will be most likely behind a premium package, you need extra features to temp users into buying, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}