{
  "id": "topic_5444408",
  "title": "Onyeeze",
  "author": "Onyeeze",
  "created_time": "March 11, 2023, 01:44:01 AM",
  "content": "Since some days i have not be on the forum because of sickness, and yet i have not fully recovered but i had Bitcoin on mind to learn from the forum, when i remember to login i felt tired, And i assured myself that i will continue to learn the procedures of Bitcoin in the forum. I can see that what makes people to be reluctant of pushing the dream is a minor thing. The reason i establish this thread is to encourage people not to backslide for anything they want because obstacle can you to lose focus and it's quit knowledgeable that having determination is most thing that contribute to achievement of goal, and i promise myself that i most know bitcoin and it's investment in the bitcointalk and it's my determination.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444408",
  "comments": [
    {
      "author": "mk4",
      "created_time": "March 11, 2023, 03:21:05 AM",
      "body": "Quick tip: 100% of your learning shouldn't be on Bitcointalk. If anything, I think majority of your learning should be off-site.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://chainsec.io* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "March 11, 2023, 06:44:41 AM",
      "body": "You aren't limited to learn bitcoin in bitcointalk alone.If you are looking for an explanation of the concept in layman's terms, with funny infographics, then you can check out the website https://learnmeabitcoin.com/. Other resources to consider include r/Bitcoin, Bitcoinwiki, and the extensive learning resources provided by Jameson Lopp.Additionally, it's important to remember that learning should be enjoyable to be cosistent in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "March 11, 2023, 11:15:11 AM",
      "body": "OP, Health is wealth. There is no amount of wealth you acquire in this world that can be spend by you again after death. Some non-serious illnesses have cost some people their lives. I say this because I remember a friend who died some months ago. He was so strong before I went to work that day, but when I returned from work, they told me he had died of head ache. Can headache kill? The answer is yes. Migraine headaches can lead to death and could also result in brain damage.Always Take care of your health, and know that you must be healthy and mentally fit before you can strive to achieve your goal. There's no way you can think well on a sick bed; all you will think of first is getting well. So, my friend, you must not come online first to learn. There are some materials you can also learn with off-line, and MK4 has given you some good materials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "March 11, 2023, 02:04:32 PM",
      "body": "I think it is important to have a balance in your life and set certain priorities. If you are sick, focus on your health and there will always be time for investments and job.Family is also important and should not be neglected.As for investing in bitcoin or crypto, it is important to invest based on a specific plan, and after you have analyzed the crypto market in detail and informed yourself about everything.Once the investment decision is made, you should follow the original plan and not let your emotions control you, you should remain rational until the end. It is also important to have a clear exit strategy.There will always be certain obstacles and problems, but if you are determined enough and have a clear plan of what you want and a strategy to achieve it, you will succeed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "March 11, 2023, 04:24:29 PM",
      "body": "Bitcoin can be studied anywhere and everywhere, you don't have to have a forum account or even access to the Internet. You can study bitcoin offline by reading an e-book or a paper edition. I don't see any barriers to studying bitcoin as time goes by if you don't have enough time for one reason or another. This does not mean that you will lose concentration or it will weaken your resolve. Study bitcoin as you find free time and desire, you don't have to follow any kind of schedule or adhere to a strict study plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "March 11, 2023, 09:56:53 PM",
      "body": "Quote from: Onyeeze on March 11, 2023, 01:44:01 AMSince some days i have not be on the forum because of sickness, and yet i have not fully recovered but i had Bitcoin on mind to learn from the forum, when i remember to login i felt tired, And i assured myself that i will continue to learn the procedures of Bitcoin in the forum. I can see that what makes people to be reluctant of pushing the dream is a minor thing. The reason i establish this thread is to encourage people not to backslide for anything they want because obstacle can you to lose focus and it's quit knowledgeable that having determination is most thing that contribute to achievement of goal, and i promise myself that i most know bitcoin and it's investment in the bitcointalk and it's my determination.Hope you get recovered soon and continue to live a normal life again. I don't think you have to log into your account and learn about bitcoin from this forum. You can browse through different posts from this forum with your smartphone and also if you find thread reading boring you can watch some videos about bitcoin or any cryptocurrency related video since you are determined to learn more about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "March 12, 2023, 09:09:53 AM",
      "body": "Determination is indeed a key factor in achieving one's goals, especially when faced with obstacles and challenges.One of the great things about the bitcointalk forum is that it provides a wealth of information and resources for learning about Bitcoin and its various aspects, including investment. By continuing to engage with the forum and actively seeking out information and resources, you can deepen your understanding of Bitcoin and its investment potential.Best of luck on your learning journey, and don't hesitate to reach out to the forum community for support and guidance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}