{
  "id": "topic_5402404",
  "title": "roadrunnerjaiv2025",
  "author": "roadrunnerjaiv2025",
  "created_time": "June 13, 2022, 11:24:50 AM",
  "content": "Apparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402404",
  "comments": [
    {
      "author": "Oasisman",
      "created_time": "June 13, 2022, 11:37:18 AM",
      "body": "This could go far down even below $20k, nobody knows what happens next. After the crypto market losses $100b it immediately drops $25k level and currently Btc continued to fall down as it's currently trading at $23,700+. Please replace that \" now what\" type of mindset coz this the \"this is it\" situation. This is what the crypto enthusiast is looking for. A good entry point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "June 13, 2022, 11:46:17 AM",
      "body": "This day have really brought bitcoin price down with continuous fall in price from the today's opening at $27,342 and now down to $23,543. This has dropped almost $4,000 from yesterday close. It could be fulfilling the continuous downward prediction for the trend. This doesn't look good for the cryptocurrency because more altcoins are going down with this development as there will be panic sell soon after today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 13, 2022, 11:58:50 AM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?Nobody really knows what will happen next. It could go even below the current price range or it could have a resistance around the current price level. I mean anything could happen. But one thing I am sure about - it's a once in a lifetime opportunity to score more bitcoins at a low price and average out to an even lower price. This opportunity may not ever come back!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 13, 2022, 12:01:15 PM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMAny suggestions what to do?You might want to sell your altcoins now, many of them will not survive this bear market, so do not think they will all come back up when the market is green again, so selling your altcoins might be a good option, even if you are at a loss now, selling it so you do not completely lose eveything makes more sense. You should hold your bitcoins if you have any, do not sell it at a loss, it will surely come back up again, if you still have some spare money in this inflation period, you can buy more bitcoins, or leave the crypto network and diversify into other areas, maybe Real estate, gold, Silver, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mm2543363580",
      "created_time": "June 13, 2022, 12:36:18 PM",
      "body": "Quote from: Z-tight on June 13, 2022, 12:01:15 PMQuote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMAny suggestions what to do?You might want to sell your altcoins now, many of them will not survive this bear market, so do not think they will all come back up when the market is green again, so selling your altcoins might be a good option, even if you are at a loss now, selling it so you do not completely lose eveything makes more sense. You should hold your bitcoins if you have any, do not sell it at a loss, it will surely come back up again, if you still have some spare money in this inflation period, you can buy more bitcoins, or leave the crypto network and diversify into other areas, maybe Real estate, gold, Silver, etc.The tagline of the discussion is very catchy.  I just finished discussing the same thing with my friend over phone. We are going downhill on a very steep hill and the breaks are not working at all. Its good to save yourself from the coming trouble, beforehand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 13, 2022, 12:37:26 PM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?There's nothing much to fear for in this period, why the fear if missing out, i think this has happened before and it still rises back to ATH or even beyond if am not mistaken that occurrs in 2018, we know this is just for a little time and not a downsize at all, mind you bitcoin still remains an acceptable digital currency and the volatile moves is something that is embedded with price speculation in which bitcoin operates with for buy and sell to be accomplished.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "June 13, 2022, 01:22:13 PM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?After seeing an inverted hammer 2 weeks ago, I thought that it would be the start of the reversal of trend, but it seems like the trend still continues. We are still in a downtrend and it's understandable knowing that we are in a global recession, tech stocks falling down, interest rates going up and some other bad events happening around the world.What to do? Brace for impact, don't make reckless decisions and be better if you will just do nothing. Hope most of the investors will not make bad decisions such as selling at a loss and panicking while watching the market. Maybe it would be better if you will stay away from seeing the crypto market right now, especially if you are panicking that easily because right now, looks like Bitcoin is heading towards the $20,000 which is the next support right now. I'm hoping to see a light after this downtrend, but it seems that it will take weeks to months before it will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "June 13, 2022, 02:39:35 PM",
      "body": "the only thing we can do is wait and hold on.. as long as we don't sell the tokens that we hold in my opinion it won't be a loss, only the valuation will decrease.. I've felt a trend like this since a few years ago, so I'm ready for this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 13, 2022, 03:28:04 PM",
      "body": "Unfortunately, most of us believed about the happening of reversal of trend, but market proved that bottom was not around $30k levels. This is why I always say that chart reading and indicators do not show the whole picture. They are definitely good to trade daily if you can, but when you look at the long term results, there could be some crazy dude selling 50k bitcoins in a single sale and drop it all alone, that would be quite possible.The \"possibility\" of that is all we need to understand that market is not something that you play with, or even think that you can predict with 100% accuracy, because anything could happen and that risk is always there. I do not know the reason of todays drop, but I know that charts didn't show it, and none of us expected it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "June 13, 2022, 03:38:55 PM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMOr do you think this is as far down as it goes? IMO asking that question after any huge one-day crash is silly.  In fact, it's always silly because it assumes you can read the future and the minds of everyone who makes up the market.  Oddly enough, that doesn't ever stop people from answering it.I woke up this morning and my eyes almost popped out of my head when I checked preev and saw that bitcoin was at $23k.  If you'd told me it was headed that low, I probably would have told you I wouldn't be surprised--but goddammit, turns out I'm totally surprised!Not sure if the whole Celsius thing is due to bitcoin's drop or is contributing to it, but usually when there's a major market correction like this you usually start seeing a bunch of crooks being forced out of the woodwork, and a whole bunch of other shenanigans as well.  Unless bitcoin recovers quickly, the next few weeks should be very interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "June 13, 2022, 04:53:03 PM",
      "body": "QuoteThis could go far down even below $20k, nobody knows what happens next. After the crypto market losses $100b it immediately drops $25k level and currently Btc continued to fall down as it's currently trading at $23,700+.  I agree with you because the price just decreased to 23,000 few minutes ago, showed that the bear market will take a long time before investors will experience bullish market. I think the price will still decrease more than $20,000 because the green light is not showing over some days now, show that it will be difficult for the price to hit $50,000 before the end of this year 2022. People will continue holding because everybody want to make a good income when the price increase higher in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "June 13, 2022, 06:22:39 PM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?DCA if you do have the funds or wait up for possible bottom but we know that it cant be possible on knowing on whats the bottom but you could make your own guess or call.Lots of rumors about for the price to go below 20k which i didnt expect for it to happen and i dont know on whats their basis or something in correlate with the situation.This is really that too unexpected as always yet market is unpredictable.Dont panic out and you wont lose nothing if you wont sell.Why people cant just really consider on buying into these dips rather than on freaking out?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "June 13, 2022, 09:35:00 PM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do? Bitcoin is currently priced at $23,197 so i think its way down to $20k or lower than that. Well, the chart looks bad but its certainly the one that we are all waiting for. Bitcoin is very cheap right now so its time to maximize your purchase and expect huge profits in the future. However, since its hard to predict its bottom price, its best to do with DCA so you will surely not miss every dropping price of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "June 13, 2022, 09:49:11 PM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do? Everything is happening to what we always wanted, bitcoin is now very affordable so there's no reason not to fill in our portfolio with a lot of potential bitcoin. And its not only bitcoin, but also those established altcoins are also in bargain right now so might as well buy them too so we can diversify our investments and create multi profits when bitcoin goes to the moon again. And for those who don't care buying, just hold your coins until everything in the market becomes stable again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "June 13, 2022, 10:52:43 PM",
      "body": "As expected with the market but I didn't expect to happen so soon. lolAnyway, the important thing to do this time is to wait or HODL if you can but don't dump everything if you feel like selling. Just hodl and stay away from the market to protect your investment, just imagine what was the ATH and the price today that you have to sell. If you don't like that to happen then stop looking at the chart and proceed to make yourself busy with other things because the more you stare with the market the more you will likely to lose yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "June 14, 2022, 03:43:07 AM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?The market is falling and will continue to fall and there is nothing we can do to stop it. Instead of panicking and leaving the market, this is clearly an opportunity to own bitcoin cheaply, you should continue to hold your bitcoins, not sell for the time being. the market will surely recover the way bitcoin did in 2018 after bitcoin dropped from $20k to $3k and then it bounced back and hit an ATH of 67k in 2021.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "June 14, 2022, 07:00:12 AM",
      "body": "We really cant predict the movement of the market and im surprised how fast the downfall happened. Well, its not something unusual because anything is possible in crypto but I thought $25k is the bottom and it will bounce back, obviously im wrong about this.Anyway, keep holding thats the best thing to do in times like this. If you cant bear seeing the market in bloody then much better to stay away for a while to not be tempted selling at loss. This is just temporary on the other hand you can do DCA if you have a budget to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 14, 2022, 07:12:28 AM",
      "body": "Quote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?1. As said, we don't own a crystal ball.2. Bitcoin movements are not so much predictable.3. If the 4-year cycle patterns are still correct (I don't say they are, and I don't say they're followed accurately!) then the price may start looking good only in Q4/2022. And this means that going lower is possible. (And again, this doesn't mean it will).What to do?* If you trade, learn to use stop loss* If you bought, learn patience for longer holding (or face the truth that you blew it, if your only option is to sell). Historically, if you hold for 4 years you're usually in profit.* If you plan to buy consider DCA, so no matter the future price direction you're pretty much covered",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judaspriest",
      "created_time": "June 14, 2022, 07:15:00 AM",
      "body": "Quote from: Minecache on June 14, 2022, 03:43:07 AMQuote from: roadrunnerjaiv2025 on June 13, 2022, 11:24:50 AMApparently, the sideways market broke down not out. Are we in a \"now what\" situation? Or do you think this is as far down as it goes? Even the week chart looks bad for BTC. Any suggestions what to do?The market is falling and will continue to fall and there is nothing we can do to stop it. Instead of panicking and leaving the market, this is clearly an opportunity to own bitcoin cheaply, you should continue to hold your bitcoins, not sell for the time being. the market will surely recover the way bitcoin did in 2018 after bitcoin dropped from $20k to $3k and then it bounced back and hit an ATH of 67k in 2021.I agree with what you said and currently the price of Bitcoin continues to show a decline and we don't know how far Bitcoin will go down,but clearly we don't need to panic by selling our assets and it's better to be patient and wait for the market to recover,and this moment needs to be used also to take profit by buying potential coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}