{
  "id": "topic_5476182",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "December 01, 2023, 01:10:58 PM",
  "content": "I have been trying to get through to customer care on the app for over 72 hours and had no reply. They usually reply within an hour is anyone else having this problem? I have tried contacting them on the chat online too and also no reply for over 24 hours.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476182",
  "comments": [
    {
      "author": "MAAManda",
      "created_time": "December 01, 2023, 02:33:56 PM",
      "body": "Quote from: JamesDaniel90 on December 01, 2023, 01:10:58 PMThey usually reply within an hour is anyone else having this problem?I'm not a crypto.com user, so I don't know whether crypto.com is currently experiencing problems with their support or not. Wouldn't it be better if you asked questions about this in their native community, of course you would get relevant answers.Official Crypto.com CommunitiesNot only a global community, they even have communities for local users, so you can communicate well using your native language, I hope this helps you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "December 01, 2023, 02:36:07 PM",
      "body": "Have you tried to check this out OP?https://help.crypto.com/en/Or on the website? On the lower right? I think you could chat there directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 01, 2023, 02:41:19 PM",
      "body": "They are probably overwhelmed but 72 hours is a lot of time to respond. Have you tried their email contact@crypto.com? You can also try their social media pages. If you want to be more aggressive in getting their attention then you can post in review sites like trustpilot https://www.trustpilot.com/review/crypto.com It seems they have a bot responding there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "December 01, 2023, 04:41:33 PM",
      "body": "I have tried the website chat also and had no reply for almost 48 hours now. It is strange as they are usually very good with the customer service. I may have to try their community forum see if I can get any update. I sent them an email yesterday and they acknowledged it but no reply yet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 01, 2023, 05:43:40 PM",
      "body": "Did they have any Ann thread here to contact their representatives? Is been long I used this exchange to trade, I don't know if could even remember my login details anymore. I have always seen that exchange as a good one but if you could lodge a complaint like this then it's better to stay away from that exchange because what customers like is to get help when needed otherwise it will be hard to reach them to fixed any issues that may arise later or sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "December 01, 2023, 05:48:35 PM",
      "body": "Quote from: Adbitco on December 01, 2023, 05:43:40 PM-SNIP-They already have their own customer-service dashboard. No need to process on a forum, everything need via CS-Dashboard or Email.Quote from: JamesDaniel90 on December 01, 2023, 04:41:33 PM-snip-My friend have some case with them about (NFTs) needed to be migrated. Required a few days 4-7 days to get some response + migrated his NFTs, try to wait a few days they really hard to be contact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "December 01, 2023, 07:12:51 PM",
      "body": "Quote from: JamesDaniel90 on December 01, 2023, 01:10:58 PMI have been trying to get through to customer care on the app for over 72 hours and had no reply. They usually reply within an hour is anyone else having this problem? I have tried contacting them on the chat online too and also no reply for over 24 hours. No one's gonna help you here because they don't have a forum representative. And that's why your only hope is go get them again and keep on following up your concern.So, you contact them again and again because the ticket might have been covered up by other concerns that are also doing the same thing as you and that's what you need to do.I haven't used them and yeah, not having any answer for 24 hours is something odd for a known crypto exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 01, 2023, 07:26:42 PM",
      "body": "I haven't used Crypto.com as an exchanger and I don't have any experience with their support. But based on my familiarity and experience with similar platforms, they typically offer prompt and quick customer service. Take Binance or Kraken, for example in case of any issues, they rapidly guide you to the relevant department to fix your issue.Considering your situation and the platform having a good reputation, it's likely that they are encountering a high volume of support messages related to a specific issue and with the end of year maybe many of their workers are in leave. I recommend reaching out to them via email or by opening a support ticket. Beside that, explore their community on Telegram or Discord for potential assistance and if they encountering the same issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "December 01, 2023, 07:30:44 PM",
      "body": "There are a few possible scenarios. They have been overwhelmed by the customer request or their is some work going on with their management team or you are trying to contact them through the wrong channel. What ever the case, you can try to get their attention in their twitter handle if they are not giving any response to your support request. If their have been any problem with the whole exchange their have been an update in their social media. So i am not seeing any issue to be concerned about right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "December 02, 2023, 07:35:36 AM",
      "body": "Quote from: Yogee on December 01, 2023, 02:41:19 PMThey are probably overwhelmed but 72 hours is a lot of time to respond. Have you tried their email contact@crypto.com? You can also try their social media pages. If you want to be more aggressive in getting their attention then you can post in review sites like trustpilot https://www.trustpilot.com/review/crypto.com It seems they have a bot responding there.Even if they're overwhelmed, 72 hours is indeed a  long time for them to respond, maybe they have some technical issues, that they're sorting out. I've not used their services before, but from what I'm hearing about them in this thread, I think that they're reputable, hopefully they'll start to respond soon. OP can try the links that you shared, maybe he'll get a response from one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "December 02, 2023, 08:31:50 AM",
      "body": "This is not a big issue brother you should wait I think there will be any maintenance issue or can be any developments will be made. I don't use this platform I mostly use others and they reply with in an hour or some give answer on quick basis and resolve the issue as soon as can possible.I think you are trying to get help from live chat so live chats take some time or may be you are right there can be sever down issue. I think you should reach them with your email. Here is the email.contact@crypto.comAnd if you already contacted via email so I will recommend you should wait.And some more methods you can reach them these are their discord or telegram channels.Here is there discord channel. Check this out.https://discord.com/invite/cryptocom",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "December 07, 2023, 12:53:11 PM",
      "body": "Update with this. I first contacted them 29th November and got a reply 2nd December but they only answered half my query. I then asked them to confirm the rest of my query on the same day and i have still not had a reply 5 days later. I have been using the crypto.com app for over a year and up till this the longest i ever had to wait for a reply was 3 hours so not sure what is happening here and why they are struggling to reply. Anyone else have this problem? If this is sign of what to come when things get busy, bull run is going to be a nightmare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}