{
  "id": "topic_5431245",
  "title": "WhyFhy",
  "author": "WhyFhy",
  "created_time": "December 24, 2022, 03:18:34 PMLast edit: December 24, 2022, 04:21:28 PM by WhyFhy",
  "content": "I'm noticing a lot of communication gaps with newcomers in the bitcoin ecosphere.A lot of the bitcoin ecosphere commodities and opensource projects require a pretty deep understanding of a few things that majority of people don't have. 1. Computer science.2. Commonsense.3. Security.(+More)Retail investors can't be their own bank. This is due to a variety of things, like its highly technical, needs a steep learning curve, or lacks user-friendly features or documentation.Documentation that is available is assumptive that 1, 2 and 3 is assumed knowledge. So how could bitcoin be remarketed for retail investors to not use exchanges?Education helps, but the complexities drive a lot of people away and they may dip toes in the crypto water but, not without the assistance and simplicity of an exchange or custodial service.A Proposed PlanRe-design Core or have a light wallet/version of core targeted for retail investors kind of like electrum but redesigned easy enough for a child to understand and navigate.Implementing official things like an official core sanctioned APK or iOS App would be a great start. Re-educate on CoreElaborate and implement documentation on how it works and allow then to go deeper as they keep reading at will, avoid terms like elliptical curve on the surface and stop doing shit like assuming people can compile their own apps or run checksums. As cringy as it sounds saying it out loud. It's still a barrier that points to Coinbase or other exchanges for retail investors.Re-Market Bitcoin Core  Bitcoin is the most successful organic product I've ever seen marketed, If re-design and re-educate are executed properly this will organically follow.Let's discuss how we could make organic opensource products in this ecosphere better than exchange counterparts.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431245",
  "comments": [
    {
      "author": "maikrothaman",
      "created_time": "December 24, 2022, 03:39:13 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 03:18:34 PMA Proposed PlanRe-design Core or have a light wallet/version of core targeted for retail investors kind of like electrum but redesigned easy enough for a child to understand and navigate.Implementing official things like an official core sanctioned APK or iOS App would be a great start. It will centralize bitcoin and place a great deal of trust in the hands of a select group of central figures.Quote from: WhyFhy on December 24, 2022, 03:18:34 PMRe-educate on CoreElaborate and implement documentation on how it works and allow then to go deeper as they keep reading at will, avoid terms like elliptical curve on the surface and stop doing shit like assuming people can compile their own apps or run checksums. As cringy as it sounds saying it out loud. It's still a barrier that points to Coinbase or other exchanges for retail investors.This breaks that idea of trust-less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "December 24, 2022, 03:48:41 PM",
      "body": "Quote from: maikrothaman on December 24, 2022, 03:39:13 PMIt will centralize bitcoin and place a great deal of trust in the hands of a select group of central figures. A core wallet isn't centralized. All exchanges run on core.Quote from: maikrothaman on December 24, 2022, 03:39:13 PMThis breaks that idea of trust-less.No it doesn't, I propose and educational tiering here, kind of like a Russian nesting doll, a simple set of read more buttons can open the next level of education if wanted. You have to understand people just react 90% of the time before they observe and react informed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maikrothaman",
      "created_time": "December 24, 2022, 03:54:15 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 03:48:41 PMQuote from: maikrothaman on December 24, 2022, 03:39:13 PMIt will centralize bitcoin and place a great deal of trust in the hands of a select group of central figures. A core wallet isn't centralized. All exchanges run on core.Quote from: maikrothaman on December 24, 2022, 03:39:13 PMThis breaks that idea of trust-less.No it doesn't, I propose and educational tiering here, kind of like a Russian nesting doll, a simple set of read more buttons can open the next level of education if wanted. You have to understand people just react 90% of the time before they observe and react informed.  If you place your trust in a particular developer, it's possible that BTC will experience an FTX moment. Imagine every bitcoiner promoting a specific wallet. The App Store and other third parties can introduce a malware/backdoor into that wallet. As a result, a lot of cryptocurrency will be lost by millions of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 24, 2022, 04:03:57 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 03:18:34 PMThis is due to a variety of thingsWhich all come down to one: responsibility. If people aren't responsible, no matter how good UI, or educational papers we give them, they'll just screw it up. On the other hand, if a person is responsible, then despite the potentially non-friendly UI, they'll just take the time and read how to acquire bitcoin privately, how to store them securely, how to move them across wallets, which fee rate is sufficient, which wallet software is the best for their use etc.Quote from: WhyFhy on December 24, 2022, 03:18:34 PM2. Mathematics.You don't need math to configure and use a bitcoin wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simpleSliv3r",
      "created_time": "December 24, 2022, 04:06:51 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 03:18:34 PMRe-design Core or have a light wallet/version of core targeted for retail investors kind of like electrum but redesigned easy enough for a child to understand and navigate.Implementing official things like an official core sanctioned APK or iOS App would be a great start. I really think this is not a good idea, this would centralize a lot the ecosistem focusing on a simple \"official\" application. If that wallet is committed, there won't be too many alternatives, it would be catastrophic.We definitely have to try to make things easier for inexperienced users but we have to find a way to do it in a decentralised way with open source projects where the whole community can participate.Quote from: WhyFhy on December 24, 2022, 03:48:41 PMQuote from: maikrothaman on December 24, 2022, 03:39:13 PMIt will centralize bitcoin and place a great deal of trust in the hands of a select group of central figures. A core wallet isn't centralized. All exchanges run on core.Core wallet is not centralized but there's a lot of different versions running on the different nodes and that's important. You can check that here. E.g United States Nodes: https://bitnodes.io/nodes/?q=United%20States",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "December 24, 2022, 04:10:52 PMLast edit: December 24, 2022, 04:23:38 PM by WhyFhy",
      "body": "Quote from: maikrothaman on December 24, 2022, 03:54:15 PMIf you place your trust in a particular developer, it's possible that BTC will experience an FTX moment. Imagine every bitcoiner promoting a specific wallet. The App Store and other third parties can introduce a malware/backdoor into that wallet. As a result, a lot of cryptocurrency will be lost by millions of people.You are 100% missing the point and contradicting yourself due to misunderstanding. Therefore, solidifying my argument even further.  however, you might be onto something about the app situation but it's beside the point. Quote from: BlackHatCoiner on December 24, 2022, 04:03:57 PMQuote from: WhyFhy on December 24, 2022, 03:18:34 PMThis is due to a variety of thingsWhich all come down to one: responsibility. If people aren't responsible, no matter how good UI, or educational papers we give them, they'll just screw it up. On the other hand, if a person is responsible, then despite the potentially non-friendly UI, they'll just take the time and read how to acquire bitcoin privately, how to store them securely, how to move them across wallets, which fee rate is sufficient, which wallet software is the best for their use etc.Quote from: WhyFhy on December 24, 2022, 03:18:34 PM2. Mathematics.You don't need math to configure and use a bitcoin wallet.  Your right, but outside looking in it sure looks like it! (Fixed it to commonsense) Admittedly even I don't fully grasp bitcoin ( I mentioned math as a personal experience with my project endeavors not thinking as I made the post) We need to figure out how to re-educate the whole responsibility aspect.  Not keep allowing exchanges to accept responsibility they don't actually have. Quote from: simpleSliv3r on December 24, 2022, 04:06:51 PMI really think this is not a good idea, this would centralize a lot the ecosistem focusing on a simple \"official\" application. If that wallet is committed, there won't be too many alternatives, it would be catastrophic.We definitely have to try to make things easier for inexperienced users but we have to find a way to do it in a decentralised way with open source projects where the whole community can participate.I ask, how could making core better centralize anything? makes 0 sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 24, 2022, 04:21:43 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 04:10:52 PM We need to figure out how to re-educate the whole responsibility aspect.I think we already do our best, as a community, but as I said it all comes down to responsibility-- and that isn't easy peasy. The main reason why bitcoin --and cryptocurrencies in general-- won't catch on on a global scale, with a daily usage (just as fiat) is because they require responsibility, and people are frightened of responsibility; same applies for freedom unfortunately. However, we do have a more mature userbase, and we will as times goes on. I do know a few retail investors who're doing self-custody with their bitcoin. I know no person who's serious about investing in bitcoin and leaves it in exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simpleSliv3r",
      "created_time": "December 24, 2022, 04:30:13 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 04:10:52 PMQuote from: simpleSliv3r on December 24, 2022, 04:06:51 PMI really think this is not a good idea, this would centralize a lot the ecosistem focusing on a simple \"official\" application. If that wallet is committed, there won't be too many alternatives, it would be catastrophic.We definitely have to try to make things easier for inexperienced users but we have to find a way to do it in a decentralised way with open source projects where the whole community can participate.I ask, how could making core better centralize anything? makes 0 sense. It's not about improving the core. You talked about launching an official mobile wallet, for example. That's what centralises the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "December 24, 2022, 04:34:21 PM",
      "body": "Quote from: simpleSliv3r on December 24, 2022, 04:30:13 PMQuote from: WhyFhy on December 24, 2022, 04:10:52 PMQuote from: simpleSliv3r on December 24, 2022, 04:06:51 PMI really think this is not a good idea, this would centralize a lot the ecosistem focusing on a simple \"official\" application. If that wallet is committed, there won't be too many alternatives, it would be catastrophic.We definitely have to try to make things easier for inexperienced users but we have to find a way to do it in a decentralised way with open source projects where the whole community can participate.I ask, how could making core better centralize anything? makes 0 sense. It's not about improving the core. You talked about launching an official mobile wallet, for example. That's what centralises the system.\"an official core sanctioned APK or iOS App\" wouldn't centralize anything it's just a wallet. All existing wallets and exchanges are built on core.  edit- figured I would inform you the only way to decentralize bitcoin would be through mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 25, 2022, 03:11:54 AM",
      "body": "I agree that we have a UI unfriendliness problem and a lack certain features. But I disagree with wanting to see all that in bitcoin core project or by their team. Because that would put pressure on those developers and would also grow the project size which would make it harder to review, maintain and update.Let core be core and let other developers enter the scene and built stuff on top of core or even as standalone projects (like Electrum). That way we have dedicated team to a dedicated feature who don't have to worry about the backend (eg. core) and having to merge all their stuff in their project or having to follow their conventions or even programming language (ie. C++).For example a C#, Python, Rust,... dev can not contribute to the C++ core (or make any major contribution). But they can create projects on top of core in the programming language they are expert at. That way we are also expanding the development circle hence making bitcoin even more decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "December 25, 2022, 12:21:09 PM",
      "body": "Quote from: pooya87 on December 25, 2022, 03:11:54 AMI agree that we have a UI unfriendliness problem and a lack certain features. But I disagree with wanting to see all that in bitcoin core project or by their team. Because that would put pressure on those developers and would also grow the project size which would make it harder to review, maintain and update.Let core be core and let other developers enter the scene and built stuff on top of core or even as standalone projects (like Electrum). That way we have dedicated team to a dedicated feature who don't have to worry about the backend (eg. core) and having to merge all their stuff in their project or having to follow their conventions or even programming language (ie. C++).For example a C#, Python, Rust,... dev can not contribute to the C++ core (or make any major contribution). But they can create projects on top of core in the programming language they are expert at. That way we are also expanding the development circle hence making bitcoin even more decentralized.I hear you; I selected core as the main option as its root, trust is established and \"if\" core did such a project it would be the easy organic marketing approach.I'm proposing a UX redesign of a light \"Wallet\" version of core targeting retail investors. Not really wanting to reinvent the wheel. Just add training wheels.But after the above examples by other posters, we definitely need to hit the drawing board. One of these guys has their own ecosystem (pandora?), This poster either is a bad actor, (this isn't the topic to debate that) or we %100 missed a mark in educating. Another felt educated enough to offer advice and weigh in on a topic about the subject totally uninformed.So, my point has been proven we, have to rethink things. Doesn't matter if it's through core or not at this point, a strategy needs to be deployed with a real cause & multiple backers.It can't be one person's opinion, or one teams project, a consensus needs to be formed and a direction needs to be laid out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 25, 2022, 03:39:00 PM",
      "body": "Quote from: WhyFhy on December 25, 2022, 12:21:09 PMI'm proposing a UX redesign of a light \"Wallet\" version of core targeting retail investors. Not really wanting to reinvent the wheel. Just add training wheels.If by \"light wallet\" you mean SPV client then it takes a lot more than UX redesign since it needs changes in the backend because the code doesn't exist in bitcoin core to fully support SPV clients. For example the protocol Electrum uses requires a new communication protocol and implementation of SSL certificate authentication and possibly even changes in wallet layer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 25, 2022, 04:46:35 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 03:18:34 PMRe-design Core or have a light wallet/version of core targeted for retail investors kind of like electrum but redesigned easy enough for a child to understand and navigate.Why release a new wallet \"kind of like Electrum\" when we already have Electrum?There is limit to how simple you can make a UI and still have access to the important features of bitcoin. I'd argue Electrum gets pretty close, if you hide all the extra tabs and advanced features. All you have then is a tab showing your history, a tab to generate a new address to receive to, and a tab to enter an address to send to. You can't get much simpler than that, and that's certainly no more complicated than your average online banking portal or brokerage account.I agree with pooya - these are issue to be solved, but they aren't to be solved by changing Core or by the Core developers. Core is first and foremost node software. The average retail investor won't be running a node, and so will be looking elsewhere for their information and software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "December 25, 2022, 05:23:26 PM",
      "body": "Quote from: o_e_l_e_o on December 25, 2022, 04:46:35 PMQuote from: WhyFhy on December 24, 2022, 03:18:34 PMRe-design Core or have a light wallet/version of core targeted for retail investors kind of like electrum but redesigned easy enough for a child to understand and navigate.Why release a new wallet \"kind of like Electrum\" when we already have Electrum?There is limit to how simple you can make a UI and still have access to the important features of bitcoin. I'd argue Electrum gets pretty close, if you hide all the extra tabs and advanced features. All you have then is a tab showing your history, a tab to generate a new address to receive to, and a tab to enter an address to send to. You can't get much simpler than that, and that's certainly no more complicated than your average online banking portal or brokerage account.I agree with pooya - these are issue to be solved, but they aren't to be solved by changing Core or by the Core developers. Core is first and foremost node software. The average retail investor won't be running a node, and so will be looking elsewhere for their information and software.Does it educate you in the process? Is it intuitive to all? Does it have confusing jargon to retail investors (casual users)?Has electrum accomplished what I'm talking about already?I'm talking about improving user interaction to make cold storage intuitive to all \"easy enough for a child to understand and navigate\".Sort of like nicehash did for mining, or how apple made the home computer or cashapp for banking. Electrum wouldn't be a bad place to start, My entire point isn't about necessarily about starting with core, just utilizing an existing structure for trust & marketability.I could attempt make said client. Intuitive versions for newcomers, with advanced options like sweep % of deposit to sandmany in different % distribution and ntimelock all the neat bells and whistles bitcoin offers. all with a simple ass UI like cashapp. However, in the event I succeeded in creating it, it would fail due to lack of trust even if I launch with source code (understandable)But I already pointed out.Quote from: WhyFhy on December 25, 2022, 12:21:09 PMDoesn't matter if it's through core or not at this point, a strategy needs to be deployed with a real cause & multiple backers.It can't be one person's opinion, or one teams project, a consensus needs to be formed and a direction needs to be laid out.This should have been indicative of wanting to move on from the \"core\" concept.  What do you propose? How do you propose I reword this topic to avoid unnecessary filibuster and focus on the goal? The core idea was a loose proposal, I want to contribute to this cause in some fashion, any ideas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 25, 2022, 08:43:35 PM",
      "body": "Quote from: WhyFhy on December 25, 2022, 05:23:26 PMDoes it educate you in the process? Is it intuitive to all? Does it have confusing jargon to retail investors (casual users)?Has electrum accomplished what I'm talking about already?To an extent. It is entirely possible to use Electrum without knowing anything about elliptic curve multiplication or how transaction signing works or even how bitcoin transactions are constructed or how they are mined. You click receive, you copy the address. You click send, you paste an address. You could change the GUI to make it even simpler and remove any mention of advanced options, but the underlying process I think is as simple as can be. Even a third party custodial wallet or centralized exchange account can't get much simpler than simply \"send\" and \"receive\". Although if you also want it to educate people in the process, then you need to leave in some mention of more advanced concepts so people can learn about them as they go.Quote from: WhyFhy on December 25, 2022, 05:23:26 PMHow do you propose I reword this topic to avoid unnecessary filibuster and focus on the goal? The core idea was a loose proposal, I want to contribute to this cause in some fashion, any ideas?Then it seems we have all misunderstood you, as your original post very much reads like you want Core developers and the Core software to be responsible for implementing this proposal.Some of the things you talk about already exist, such as elaborate yet simple to understand documentation which can then be expanded as people want to learn more. I would point to https://learnmeabitcoin.com/ as a great example of this. A lot of your proposal might be simply bringing together existing solutions in to one place or integrating them together. Maybe there is a market for an incredibly bare bones beginner friendly wallet, but I'm not sure how much simpler you can really get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "December 25, 2022, 10:29:27 PM",
      "body": "Quote from: WhyFhy on December 24, 2022, 03:18:34 PMI'm noticing a lot of communication gaps with newcomers in the bitcoin ecosphere.A lot of the bitcoin ecosphere commodities and opensource projects require a pretty deep understanding of a few things that majority of people don't have. 1. Computer science.2. Commonsense.3. Security.(+More)Retail investors can't be their own bank. This is due to a variety of things, like its highly technical, needs a steep learning curve, or lacks user-friendly features or documentation.Documentation that is available is assumptive that 1, 2 and 3 is assumed knowledge. So how could bitcoin be remarketed for retail investors to not use exchanges?Education helps, but the complexities drive a lot of people away and they may dip toes in the crypto water but, not without the assistance and simplicity of an exchange or custodial service.A Proposed PlanRe-design Core or have a light wallet/version of core targeted for retail investors kind of like electrum but redesigned easy enough for a child to understand and navigate.Implementing official things like an official core sanctioned APK or iOS App would be a great start. Re-educate on CoreElaborate and implement documentation on how it works and allow then to go deeper as they keep reading at will, avoid terms like elliptical curve on the surface and stop doing shit like assuming people can compile their own apps or run checksums. As cringy as it sounds saying it out loud. It's still a barrier that points to Coinbase or other exchanges for retail investors.Re-Market Bitcoin Core  Bitcoin is the most successful organic product I've ever seen marketed, If re-design and re-educate are executed properly this will organically follow.Let's discuss how we could make organic opensource products in this ecosphere better than exchange counterparts. Finally I read something interesting for those who approach this technology for the first time, in fact what I see is a lack of education and many think that btc is easy and fast money but they have not understood what the protocol actually does and what it can solve. Many rely on centralized exchanges and do not understand the difference between custodial and non- custodial. In Italy lately I see that someone is starting to understand thanks to a little information and use tools such as bitkipi, relai or pocketapp to buy btc safely and with extreme ease. More education is needed to make it clear what the right means are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 26, 2022, 04:16:00 AM",
      "body": "Quote from: WhyFhy on December 25, 2022, 05:23:26 PMHowever, in the event I succeeded in creating it, it would fail due to lack of trust even if I launch with source code (understandable)Any new project has to check some boxes and only fails if it doesn't. Being 100% open source is only one of them.In my opinion the most important one can be summarized in a simple question: \"What's new in this project?\" (This is true about new altcoins too). For example if your new project is offering the same features as other existing wallets (eg. Electrum) then it has a higher chance of failing but if it has some new and actually-useful features that don't exist elsewhere, it will definitely succeed.Keep in mind that the alternative here is to contribute to the existing project to improve that if the ideas already exist instead of giving up altogether.Another thing to consider is that success and popularity takes time. Electrum has been around for a decade, core from day 1, etc. so it could take years for any new project to gain any popularity and build trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 26, 2022, 09:25:18 AM",
      "body": "Quote from: pooya87 on December 26, 2022, 04:16:00 AMKeep in mind that the alternative here is to contribute to the existing project to improve that if the ideas already exist instead of giving up altogether.Along those lines, the first thing to do would be to identify what is wrong with the existing solution which is impeding newbies.Let's use the Electrum example we have been using above. What is wrong with it in its current format that makes it too hard for newbies to use?Is it the process of verifying the download before installing it? I can appreciate that point, but it is an important step to ensure security. Do newbie guides on how to do this need to be more prominently advertised, or do they need to be made simpler?Is it the process of creating a new wallet? The wallet creation wizard is pretty straightforward. You can't really make it any simpler without removing options and railroading every newbie in to a standard hot wallet, which I don't think is the right thing to do.Is it the GUI of the wallet itself? Should we hide every tab except history/send/receive by default? Should we hide expiry on the receive tab? Should we hide description on the send tab? These are optional features which are not required to send or receive coins.Is all of the above actually fine, and we just need better and jargon-free documentation and guides?Is Electrum the wrong wallet to be recommending to newbies at all, and we should be recommending something else which is even simpler to use?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 26, 2022, 11:35:58 AM",
      "body": "Quote from: WhyFhy on December 25, 2022, 05:23:26 PMQuote from: o_e_l_e_o on December 25, 2022, 04:46:35 PMI agree with pooya - these are issue to be solved, but they aren't to be solved by changing Core or by the Core developers. Core is first and foremost node software. The average retail investor won't be running a node, and so will be looking elsewhere for their information and software.Does it educate you in the process?If you read all the documentation (which I didn't): probably. Just installing it won't teach you everything about Bitcoin's inner workings, and I don't think retail investors would be interested in that either.QuoteIs it intuitive to all?Easy answer: nothing is intuitive to all. There are always exceptions. So let's back down to \"is it intuitive to the majority?\", and I still think it's not. Let's face it: Bitcoin Core isn't meant for that.If a retail investor wants to keep his own Bitcoin in his own wallet, he's probably much better off buying an established hardware wallet.QuoteDoes it have confusing jargon to retail investors (casual users)?I don't think Bitcoin Core was designed for investors at all. It's designed for Bitcoin users, and can be the backbone of websites that provide Bitcoin services.QuoteHas electrum accomplished what I'm talking about already?It can't. One of the steps (security) depends on the system, and Electrum can't improve that.QuoteI'm talking about improving user interaction to make cold storage intuitive to all \"easy enough for a child to understand and navigate\".Cold storage requires knowing what you do before you do it. The closest you'll get for people who don't want to read instructions is a hardware wallet.Quotehow apple made the home computer or cashapp for banking.The few times in my life I've touched anything from Apple, it wasn't intuitive. I've even had it do the exact opposite of what I expected. So don't confuse people who are used to certain ways with being intuitive for inexperienced users.QuoteI could attempt make said client. ~ it would fail due to lack of trustThe one thing I would recommend new Bitcoin users, is to use an established wallet. But that doesn't mean new wallets can't reach that after a while. I've seen several new (mobile) wallets that earned trust in the past few years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}