{
  "id": "topic_5419904",
  "title": "Aurpay",
  "author": "Aurpay",
  "created_time": "November 08, 2022, 06:42:32 AM",
  "content": "Many business owners now accept customer pay with bitcoin, like Coinbase Commerce crypto.com and others, but none of their main business is about payments, so they pay very little attention to users experience. If a customer studies their way carefully, he will find that each order needs to bear an extra fee of about 0.0003btc, which is about 6 US dollars, that is a huge cost. If there are 1000 orders, then the customer loses $ 6000.but many business owners do not know this !  Smiley,why?because none of those brands want to show the real cost to their users, they cheat users use lower fee, balabal,This cost is too expensive for customers，so, is there a solution for this? Yes, Aurpay!Thanks to our innovations in blockchain technology, Aurpay could centralize all orders on one address,  this could saving a lot of fees. Taking 1,000 orders as an example, it saves nearly $6,000 compared to competitors. That is amazing!Now Aurpay invite any business owners to try Aurpay's  bitcoin plugin , and we are appreciate someone give us suggestions, we‘re constantly striving to provide excellent service. We’d love your suggestion about Aurpay. Or what product features do you need. We will reward satoshi for valuable suggestions,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419904",
  "comments": [
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 08, 2022, 08:28:42 AM",
      "body": "Quote from: Aurpay on November 08, 2022, 06:42:32 AMbecause none of those brands want to show the real cost to their users, they cheat users use lower fee,Paying in btc doesn't mean that you shouldn't take your own responsibility to calculate the amount of what you're buying and it worth when converted to USD, this is a normal arithmetic calculation and conversion, just take your calculator and work out the price of what you're buying in their decimal point with respect to current btc price and the rate it amount in USD, if it's ok by you then you can make the purchase, if you're been cheated then it's your fault for negligence to foresee it coming. but unfortunately not until i got to read the later end to your post to discover it's another idea entirely you're coming up with which I don't think this board permit such, no advertisement of a third party sites is allowed here, you're referring people to your website through this medium which i think is bad enough for being here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aurpay",
      "created_time": "November 08, 2022, 08:45:22 AM",
      "body": "Quote from: Aanuoluwatofunmi on November 08, 2022, 08:28:42 AMQuote from: Aurpay on November 08, 2022, 06:42:32 AMbecause none of those brands want to show the real cost to their users, they cheat users use lower fee,Paying in btc doesn't mean that you shouldn't take your own responsibility to calculate the amount of what you're buying and it worth when converted to USD, this is a normal arithmetic calculation and conversion, just take your calculator and work out the price of what you're buying in their decimal point with respect to current btc price and the rate it amount in USD, if it's ok by you then you can make the purchase, if you're been cheated then it's your fault for negligence to foresee it coming. but unfortunately not until i got to read the later end to your post to discover it's another idea entirely you're coming up with which I don't think this board permit such, no advertisement of a third party sites is allowed here, you're referring people to your website through this medium which i think is bad enough for being here. this is not about calculate the price ,because price is fixed , this is about the gas fee, as a business online owner, if you choose a crypto payment provider like crypto.com or coinbase commerce, you need to bear extra fee for using the services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 08, 2022, 11:17:35 AM",
      "body": "Quote from: Aurpay on November 08, 2022, 06:42:32 AMMany business owners now accept customer pay with bitcoin, like Coinbase Commerce crypto.com and others, but none of their main business is about payments, so they pay very little attention to users experience. If a customer studies their way carefully, he will find that each order needs to bear an extra fee of about 0.0003btc, which is about 6 US dollars, that is a huge cost. Coinbse commerce charges 1%  not a fixed ratehttps://commerce.coinbase.com/faq#what-are-the-fees-to-use-coinbase-commerceCrypto.com charges 0.5%https://help.crypto.com/en/collections/1512001-crypto-com-pay-for-business-merchant-faqBitpay charges also 1%https://bitpay.com/pricing/So, leaving aside the fact that you're posting misleading facts about your competition, what are your fees and why aren't they mentioned anywhere on your website? Quote from: Aurpay on November 08, 2022, 06:42:32 AMThanks to our innovations in blockchain technology, Aurpay could centralize all orders on one address,  this could saving a lot of fees.So you have managed to find a way to spend 100 UTXOs using the same byte size in a tx as one?Do tell us more about this!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "November 08, 2022, 02:12:48 PM",
      "body": "I think most people use faster blockchains to pay for things or is there a stat on them not doing? I used to use bitcoin to pay for things £10+ but now I use chains like litecoin or usdc for the faster confirmation and lower fee if I'm not paying a lot for something. The processor has to take the burden of the security of the chain, I don't - as long as my transaction confirms on their end it doesn't matter how secure I think that chain was I just tried to use.A service like this (I'm assuming some sort of prepayment system) I could see being used a lot in the future, and in the past, it just might've come out at a weird time where most alts are stable enough for long enough that you can pay with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aurpay",
      "created_time": "November 08, 2022, 02:26:43 PM",
      "body": "Quote from: stompix on November 08, 2022, 11:17:35 AMQuote from: Aurpay on November 08, 2022, 06:42:32 AMMany business owners now accept customer pay with bitcoin, like Coinbase Commerce crypto.com and others, but none of their main business is about payments, so they pay very little attention to users experience. If a customer studies their way carefully, he will find that each order needs to bear an extra fee of about 0.0003btc, which is about 6 US dollars, that is a huge cost. Coinbse commerce charges 1%  not a fixed ratehttps://commerce.coinbase.com/faq#what-are-the-fees-to-use-coinbase-commerceCrypto.com charges 0.5%https://help.crypto.com/en/collections/1512001-crypto-com-pay-for-business-merchant-faqBitpay charges also 1%https://bitpay.com/pricing/So, leaving aside the fact that you're posting misleading facts about your competition, what are your fees and why aren't they mentioned anywhere on your website? Quote from: Aurpay on November 08, 2022, 06:42:32 AMThanks to our innovations in blockchain technology, Aurpay could centralize all orders on one address,  this could saving a lot of fees.So you have managed to find a way to spend 100 UTXOs using the same byte size in a tx as one?Do tell us more about this!Bingo , thank u for your reply ,but you just got a part of the surface right.Yes, their rates are what you said, but you didn't look into their other cost, which is the cost of fees, which is hidden,For each order they will use a new address, who do you think will be charge for the fee at this time when bitcoin needs to be transferred to the customer's address? According to our data, most of the e-commerce orders are within 300 US dollars. Including the miner fee, this cost is at least as high as 2%.So, just like i said, you're also one of those people who doesn't understand how crypto pay works.but thanks !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aurpay",
      "created_time": "November 09, 2022, 02:54:14 AM",
      "body": "Quote from: jackg on November 08, 2022, 02:12:48 PMI think most people use faster blockchains to pay for things or is there a stat on them not doing? I used to use bitcoin to pay for things £10+ but now I use chains like litecoin or usdc for the faster confirmation and lower fee if I'm not paying a lot for something. The processor has to take the burden of the security of the chain, I don't - as long as my transaction confirms on their end it doesn't matter how secure I think that chain was I just tried to use.Yh,you are right, it would be faster confirmation when you pay use crypto on ETH OR TRON ,if you care more security, you could find non-custodial provider.A service like this (I'm assuming some sort of prepayment system) I could see being used a lot in the future, and in the past, it just might've come out at a weird time where most alts are stable enough for long enough that you can pay with them. I think that still need l long time to see a majority people use this service to pay for shop! but ,worth a shot now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 10, 2022, 12:31:15 PM",
      "body": "Quote from: Aurpay on November 08, 2022, 02:26:43 PMYes, their rates are what you said, but you didn't look into their other cost, which is the cost of fees, which is hidden,No, it's not, it's pretty transparent unlike yours!Quote from: Aurpay on November 08, 2022, 02:26:43 PMFor each order they will use a new address, who do you think will be charge for the fee at this time when bitcoin needs to be transferred to the customer's address? Irrelevant as even if you would use the same address for each customer each payment will still be an individual UTXO, so consolidating 1000 UTXO from one address is the same as consolidating 1000 addresses with dust, the size of the tx will be the same.Quote from: Aurpay on November 08, 2022, 02:26:43 PMAccording to our data, most of the e-commerce orders are within 300 US dollars. Including the miner fee, this cost is at least as high as 2%.Your data is wrong:https://www.statista.com/statistics/239247/global-online-shopping-order-values-by-device/QuoteIn the second quarter of 2022, online orders placed from a mobile phone in the United States had an average value of approximately 112 U.S. dollars, compared with almost 95 dollars in the EMEA region and 155 for a desktop order compared to 167 for EMEA.Quote from: Aurpay on November 08, 2022, 02:26:43 PMSo, just like i said, you're also one of those people who doesn't understand how crypto pay works.but thanks !So as previously, you're simply posting misleading things and not answering real important questions about your own service.No thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aurpay",
      "created_time": "November 10, 2022, 02:48:58 PM",
      "body": "Quote from: stompix on November 10, 2022, 12:31:15 PMQuote from: Aurpay on November 08, 2022, 02:26:43 PMYes, their rates are what you said, but you didn't look into their other cost, which is the cost of fees, which is hidden,No, it's not, it's pretty transparent unlike yours! Hey, man ,did you really use their services? do you really know exactly how much you pay or your customers? come on try it .Quote from: Aurpay on November 08, 2022, 02:26:43 PMFor each order they will use a new address, who do you think will be charge for the fee at this time when bitcoin needs to be transferred to the customer's address? Irrelevant as even if you would use the same address for each customer each payment will still be an individual UTXO, so consolidating 1000 UTXO from one address is the same as consolidating 1000 addresses with dust, the size of the tx will be the same.Quote from: Aurpay on November 08, 2022, 02:26:43 PMAccording to our data, most of the e-commerce orders are within 300 US dollars. Including the miner fee, this cost is at least as high as 2%.Your data is wrong:https://www.statista.com/statistics/239247/global-online-shopping-order-values-by-device/QuoteIn the second quarter of 2022, online orders placed from a mobile phone in the United States had an average value of approximately 112 U.S. dollars, compared with almost 95 dollars in the EMEA region and 155 for a desktop order compared to 167 for EMEA.Thanks for your data, We use transaction data within the industry, so our data will appear to be a bit more than yours; based on your data, their hidden cost rates are higher, not lower. But, this is not so important. the important thing is you need to try and use it , if you don't use something, you can not really understand it.Quote from: Aurpay on November 08, 2022, 02:26:43 PMSo, just like i said, you're also one of those people who doesn't understand how crypto pay works.but thanks !So as previously, you're simply posting misleading things and not answering real important questions about your own service.No thanks.Just i said, not just talk ,you should use all above the services as a merchant first, after that, you'll really come to meaningful conclusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}