{
  "id": "topic_5398746",
  "title": "RockBell",
  "author": "RockBell",
  "created_time": "May 15, 2022, 12:34:39 PM",
  "content": "The invention of the crypto currency backed by blockchain have bring about many questions and debate If bitcoin is a currency or an asset or just a virtual currency that can be used as a payment system it is very difficult to decide which or contain both features , recently I got to know that Emirates which is biggest airline in  (UAE) to accept bitcoin as a method of payment  , I once came across an article talking about if it would be possible for bitcoin to be seen as a financial freedom when applying for a visa it will be actually interesting if possible , bitcoin is gaining more ground so please just want to know what you guys think about bitcoin as a currency or an asset.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398746",
  "comments": [
    {
      "author": "death69",
      "created_time": "May 15, 2022, 01:49:43 PM",
      "body": "The monetary system is simply based on people's beliefs. Thousand years ago, we have seashell as currency. More than 200 years ago, Dollar was created. Now, we have tons of cryptocurrencies on the Internet. Bitcoin was first used by hackers or any people who want to make transactions on the dark web. Soon, when they realize the benefits of bitcoin, more and more started to use it as an appropriate form of currency in Clearnet. However, it does not stop there. From what I see, bitcoin transforms into some sort of sustainable online investment rather than just a currency. It is viewed as digital gold, which makes people rarely spend bitcoin for buying daily stuff like food or milk. The current fee of a bitcoin transaction is around $2.5 , which is too high for such simple exchange. Therefore, I believe bitcoin has currently used as an asset more than a currency and this has been done for years",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "May 15, 2022, 01:51:56 PM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PMThe invention of the crypto currency backed by blockchain have bring about many questions and debate If bitcoin is a currency or an asset or just a virtual currency that can be used as a payment system it is very difficult to decide which or contain both features , recently I got to know that Emirates which is biggest airline in  (UAE) to accept bitcoin as a method of payment  , I once came across an article talking about if it would be possible for bitcoin to be seen as a financial freedom when applying for a visa it will be actually interesting if possible , bitcoin is gaining more ground so please just want to know what you guys think about bitcoin as a currency or an asset.For each of us, bitcoin has a different meaning and purpose.I would say that most people here still see bitcoin as an investment and want to make money from it.After all, we all want financial freedom and for average people it is much easier to invest in crypto than on traditional stock exchanges.Personally, I have been buying some technical goods with bitcoin so far, but I still want to keep bitcoin in the long run and earn from the price increase in the future..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 15, 2022, 03:43:06 PM",
      "body": "It's either, or it's both. Really, Bitcoin is for whatever you want/need to use it for. Want to use it for payments? It's a currency. Want to hold bitcoin in your portfolio in the hopes that it will be priced far more in the future? Bitcoin is an investment asset. Etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 15, 2022, 05:48:51 PM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PMso please just want to know what you guys think about bitcoin as a currency or an asset.Bitcoin is both a currency and an asset, but long before now it was more of an asset, as a money invested in bitcoin over years yields more profit to our fiat currencies. But with the help of most physical and online shopping store who has now integrated the use of bitcoin, enabling users to easily access goods & services directly without the need for convertion into fiat.. So over time now, i can boldly say bitcoin is a currency and an asset, as you can work into any MacDowell's Restaurant to buy a plate of food with a fraction of Satoshi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 15, 2022, 05:52:13 PM",
      "body": "Its called global adoption. Yes bitcoin can be used on that as Ive also seen the article. There are othrr sources too that it can be used to much more wider stores and ssrvices. Its typical but of course some are still not open for that. But as time pass by there will be more adopting or started to accept bitcoin as payment method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "May 15, 2022, 07:25:17 PM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PMThe invention of the crypto currency backed by blockchain have bring about many questions and debate If bitcoin is a currency or an asset or just a virtual currency that can be used as a payment system it is very difficult to decide which or contain both features , recently I got to know that Emirates which is biggest airline in  (UAE) to accept bitcoin as a method of payment  , I once came across an article talking about if it would be possible for bitcoin to be seen as a financial freedom when applying for a visa it will be actually interesting if possible , bitcoin is gaining more ground so please just want to know what you guys think about bitcoin as a currency or an asset.Bitcoin is basically all you mentioned. It's one unique digital asset that posses multi dimensional features. It can serve both as an asset and a currency alike. It depends on how you choose to see yours. Its financial freedom benefit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "May 15, 2022, 08:44:42 PM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PM/cut/so please just want to know what you guys think about bitcoin as a currency or an asset.Does it have to be one or the other? I think Bitcoin is going to be the platform for an entire new economy that is going to revolutionize the world. For example it is possible to spend BTC in a coffee shop without handing them cash. It is also possible to buy a car or property without going to a traditional bank. But of course the argument is now that more and more investors are understanding the potential of this new platform and making use of this to generate new economic value. When you look at the monetary base and compare it with what is available in the market you can see how they are creating new asset class and it will make sense to me that we will be able to create an entire new financial ecosystem with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "May 15, 2022, 08:55:08 PM",
      "body": "Currently, both can apply if you know what you are doing. Initially, if you read the Bitcoin white paper, Satoshi aimed at creating at an alternative peer to peer cash system that help with transactions without a third party getting involved but as Bitcoin gain value has been considered as a store of value or a tradable asset as well",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "May 15, 2022, 10:17:53 PM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PM... so please just want to know what you guys think about bitcoin as a currency or an asset.The answer is simple. A currency is a kind of asset, so if Bitcoin is a currency, then it is an asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "May 15, 2022, 11:10:53 PM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PMThe invention of the crypto currency backed by blockchain have bring about many questions and debate If bitcoin is a currency or an asset or just a virtual currency that can be used as a payment system it is very difficult to decide which or contain both features It is not that kind of difficult.Bitcoin can be both, used as a currency for payment method and also can be used as asset that is traded or ivested. The problem is now laying on every country's regulation related to Bitcoin and other crytocurrencies. There are countries that legalize Bitcoin both as a currency and also an asset.There are countries that legalize Bitcoin and cryptocurrency only as assets, but illegal if used as a currency (as in my country).And there are also countries that ban cryptocurrency for all.  But aside from the rule and regulations of every country, Bitcoin can be accessd by all people in the world and we can use it both for whatever it can be if possible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 15, 2022, 11:52:51 PM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PM..just want to know what you guys think about bitcoin as a currency or an asset.They've function both, it's either a currency or an asset but the main goal of the creator is to become a currency, on the other hand, people were found a way of making a profit by holding and making it an asset.  It is the same as gold but the difference is gold can be physically touched and can be seen while Bitcoin composed of a number in a computer code, or a digital asset.  It can be a currency or an asset.Because of its wide adoption, people use it as a currency and it isn't a surprise people use it as a currency, and many establishments or companies accept it as payment.  In fact, there are a few countries already announced Bitcoin is a legal tender in their place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 16, 2022, 03:28:44 AM",
      "body": "The two are not mutually exclusive. In other words if you consider bitcoin a currency that doesn't prevent you from seeing it also as an investment. That only thing that is always there is the currency part because without bitcoin being a currency that other utilities it provides don't make much sense anymore.If you also look at fiat, it also acts as an asset and a currency at the same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 16, 2022, 03:45:19 AM",
      "body": "In my opinion, today Bitcoin is viewed more as an Asset than a Currency, since people tend to speculate with its value for profit, while on the other hand other cryptos or tokens like USDT or USDC are the ones which are actually used for the transfer of value.Or course, Bitcoin can be also used for transfer of value but I suppose the volume of these cases are less than the volumen belonging to the speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "May 16, 2022, 04:51:07 AM",
      "body": "You see people accepting bitcoin as payment option and people paying with it is monetary aspect of bitcoin while many prefer to hold it as investment for future returns so it's investment purposes.It is being used in both ways depending on how you personally use it but in future it will be more of a currency when global adoption will be there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "May 16, 2022, 10:53:01 AM",
      "body": "Quote from: pooya87 on May 16, 2022, 03:28:44 AMThe two are not mutually exclusive. In other words if you consider bitcoin a currency that doesn't prevent you from seeing it also as an investment. That only thing that is always there is the currency part because without bitcoin being a currency that other utilities it provides don't make much sense anymore.If you also look at fiat, it also acts as an asset and a currency at the same time.Exactly this is what we need to understand that you can use it any context but it won't dilute it's originality like you could save it and spend it as currency at the same time like fiat but there is much difference in both of them as it's decentralised and deflationary while the fiat is totally opposite to it.To explain further like you have $100 with you in legal cash how would you treat it? There are some possible explanations for it like you could spend it on buying stuff and anything you like and for example say you spend $40 on it now this is payment part of fiat for which you use it.Now you saved $60 in bank account or invested it somewhere on stock market or anywhere you wish to do so for long term this will be your investment usage of the fiat.So you used same $100 for two purpose but it can be used for single one of them also or jointly so they have both the purpose.Same is the case with bitcoin also like you could spend it as payment with merchant accepting it or through third party software that pays them in fiat directly or you could accumulate bitcoin for long term but the underlying concept of payment processing is main idea for bitcoin but due to high returns many prefer to hold it over the years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "May 17, 2022, 07:05:17 AM",
      "body": "Thanks guys actually learned a lot am always ready to learn , it serves both as a payment system and likewise an asset if a quality is accumulated for a long time , it depends on what it is used for at that moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "May 17, 2022, 09:33:13 AM",
      "body": "Quote from: RockBell on May 15, 2022, 12:34:39 PMThe invention of the crypto currency backed by blockchain have bring about many questions and debate If bitcoin is a currency or an asset or just a virtual currency that can be used as a payment system it is very difficult to decide which or contain both featuresYou have a friend, both of you know about bitcoin and you are both using it. You can send bitcoin to your friend and your friend can send you bitcoin. You can send bitcoin to anyone that accept it as payment. You can make bitcoin to buy items on some online stores that support it. Bitcoin is a legal tender in El Salvador, Centralized Africa Republic and an island in Honduras. Russia is considering to make bitcoin legal and regulated. Definitely, bitcoin is a virtual means of payment. The value of bitcoin will increase decrease and increase again and hit all-time-high. It has a finite supply of only 21 million coins, it is compared with fiat that are inflationary. Then, let me ask, is bitcoin an asset? Yes bitcoin is an asset. Which I think is the question you asked.If you look at what pooya87 post, even fiat are assets, but they are assets that devalue, unlike bitcoin which is an asset that its value increase and decrease but later have a net increase which makes it an asset that increase in value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 17, 2022, 09:27:49 PM",
      "body": "Bitcoin is asset and it's not a virtual currency as people may say about it development and it values, actually some people misunderstood the fact that bitcoin is currency that is applicable to fiat currencies base of it values, i know vividly that some people doesn't regards bitcoin as a legal tender, and people who knows it's values understand the adoption of bitcoin and it development.Bitcoin is use for payment for the country who embrace it value, nothing fiat can purchase bitcoins can not purchase, depending the company and the country you want or the transaction of exchange of goods and services with cryptocurrency is taking place, i will say bitcoin will be regarded in future time than fiat currency because of it's faster processing of transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 17, 2022, 10:08:59 PM",
      "body": "Asset just means \"a valuable thing\". Every currency is an asset. Currently Bitcoin's most popular use is buying it and holding to get profit, aka store of value asset. It is used as a currency, but it's not common, so right now Bitcoin usually is not considered a currency, even though it was designed to be one. So the answer to the question is Bitcoin a currency or not depends on the context.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}