{
  "id": "topic_5407891",
  "title": "Mark301",
  "author": "Mark301",
  "created_time": "July 28, 2022, 07:48:24 AM",
  "content": "Bitcoin soars as the Federal Reserve raises the key interest rate by 75 basis points.Inflation has probably been the most significant difficulty confronting the present administrations of most nations throughout the world; in the case of the United States, the Federal Reserve has been on the lookout for ways to counteract the country's 40-year high inflation.The US Federal Reserve stated on Wednesday that it will raise interest rates by 75 basis points to 2.5 percent in order to combat the country's ongoing rise in food, fuel, and housing prices, which are emptying Americans' purses.Although the Fed's decision on Wednesday was not predicted, market pricing had risen by 75 basis points ahead of the Fed's announcement. Prior to this, investors had priced in a one-in-four probability of 100 basis points; however, this had been priced out earlier in the week.\"Inflation has clearly surprised to the upside during the last year, and more surprises might be on the way.\"According to Federal Reserve Chair Jerome Powell, the central bank might contemplate \"an even greater\" raise if needed in the future.The Fed's action is also part of efforts to avert a recession that is expected to slam global markets shortly.Continue Reading: https://mycryptoparadise.com/bitcoin-soars-as-fed-raises-key-interest-rate-by-75-basis-points/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407891",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "July 28, 2022, 08:34:13 AM",
      "body": "This is a bit counter-intuitive, as raising rates is not usually bullish for the economy, but both the USA stock market and Bitcoin had a fair price spike following the news. I understand that this is because the Fed is showing that it is determined to tackle inflation, but it is not clear to me that it can keep rates like this or higher without us going into recession, so they are in a dilemma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 28, 2022, 09:42:12 AM",
      "body": "Quote from: Mark301 on July 28, 2022, 07:48:24 AMBitcoin soars as the Federal Reserve raises the key interest rateThis is both wrong and completely irrelevant.First of all bitcoin didn't \"soar\", it just went back up a little. It has been doing that for some time now. In fact this is the 4th attempt to rise after the crash ended on June 18.Secondly FED's interest rates don't really affect bitcoin price. Example is in May when they increased it while bitcoin dropped from $38k to $25k.Quote from: Mark301 on July 28, 2022, 07:48:24 AMInflation has probably been the most significant difficulty Money printing is the problem, inflation is the result. In the past couple of years ever since COVID began, they've been printing US dollar non-stop. It was inevitable to see high inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "July 28, 2022, 12:20:15 PM",
      "body": "Welp, I expect BTC to track tech stocks FAANG. Seems like they are doing well at this writing. I was was expecting a dip and buy some ore but may take some profit and sit back and watch.They are saying this action was already \"baked into\" the initial response to the hike. Maybe so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "July 28, 2022, 12:34:09 PM",
      "body": "Bitcoin went up by only 6.17% Please do keep in mind that most cryptocurrencies like uniswap and bitcoin cash are rising up by more than 15% which does mean that this small increase in price would only be able to stand up in the market if it's maintained throughout. With federal interest rates going up by 0.75% it's not really convenient for people to go and invest in bitcoins always, some of them would even sell of their own coins and pour the money in the banks to make some amount of profit' as well. Therefore one can be sure of one thing ' you cannot tell at all, if the interest rates are going to be a good thing for Bitcoins or not'. Some people can try and sell their Bitcoins to make that extra 0.75%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 28, 2022, 12:35:03 PM",
      "body": "Quote from: Mark301 on July 28, 2022, 07:48:24 AMBitcoin soars as the Federal Reserve raises the key interest rate by 75 basis points.'soars'...?!?ZOOM OUT YOUR CHART VIEWyou have your price chart zoomed in too much that small changes look large.ZOOM OUT YOUR CHART VIEWin the big scheme of market prices in the last 2 years. todays/this weeks changes are not \"soaring\"you will find that speculation is a great, fun, and unpredictable gamewhen interest rates go down. 3 paths may result+people use low interest rate loans to invest in bitcoin and raise the price with all those buys+people get less bank account rewards(interest) they buy bitcoin to get more returns in the long run-low interest loans = higher qualifying requirements = not qualifying thus sell btc to get spare cash they cant get via loanswhen interest rates go up 3 paths may result- people avoid loans and sell BTC to get cash +people get more bank account rewards(interest) the invest less in other assets because bank balance is insured+high interest loans = lower qualifying requirement = more loans and less need to sell btc. as btc hedges against loans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "July 28, 2022, 12:35:57 PM",
      "body": "A reversal occured but not pointing towards a new wave of bull runs. The gain may possibly be temporary and will gradually correct again. It earlier pumped to as much as $23,400 and now it goes down to $22,900 as of this time of writing. Many are expecting for the Bitcoin price to fall, spreading FUD and calling to short on futures, etc. But oh well, it’s unpredictable and unexpected that it goes up instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 28, 2022, 12:48:22 PMLast edit: July 28, 2022, 12:58:49 PM by franky1",
      "body": "Quote from: cheezcarls on July 28, 2022, 12:35:57 PMA reversal occured but not pointing towards a new wave of bull runs. The gain may possibly be temporary and will gradually correct again. It earlier pumped to as much as $23,400 and now it goes down to $22,900 as of this time of writing. Many are expecting for the Bitcoin price to fall, spreading FUD and calling to short on futures, etc. But oh well, it’s unpredictable and unexpected that it goes up instead. yep. we are witnessing an era where 'short' traders are enmasswhere by them taking on btc(offmarket acquired) and selling it on market to then put in a lower buy position. the 'sells' of their first act causes the price drop to reach the buy of their second act. (which if the market only existed of shorters would be a endless snowball of price drop)but luckily. knowing that in majority of regions, a market price can be less than that regions own mining cost.where by:alot of people see the benefit of buying coin when its cheap rather than mining offmarket to then sell on market. alot of people see high mining costs thus not the best time to offload their btc which counters the 'short' game",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "July 28, 2022, 01:03:42 PM",
      "body": "Quote from: pooya87 on July 28, 2022, 09:42:12 AMQuote from: Mark301 on July 28, 2022, 07:48:24 AMBitcoin soars as the Federal Reserve raises the key interest rateThis is both wrong and completely irrelevant.First of all bitcoin didn't \"soar\", it just went back up a little. It has been doing that for some time now. In fact this is the 4th attempt to rise after the crash ended on June 18.Secondly FED's interest rates don't really affect bitcoin price. Example is in May when they increased it while bitcoin dropped from $38k to $25k.Quote from: Mark301 on July 28, 2022, 07:48:24 AMInflation has probably been the most significant difficulty Money printing is the problem, inflation is the result. In the past couple of years ever since COVID began, they've been printing US dollar non-stop. It was inevitable to see high inflation.Great someone actually believes that both are irrelevant because they are actually irrelevant. Some facts are always connected but this fed thing is always there when bitcoin moves a little bit. Its actually disconnected fact since very long time, SEC has also revised many conditions in earlier days but none of them really affected bitcoin community. The money in bitcoin is anyway safe and anonymous as long as it's not sold and withdrawn in the local currencies. My point here is, why would anyone get bothered if FED's are rising some shit or not? For that matter wall street might get hampered but why they always connect the dots with bitcoin market? It's hilarious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 28, 2022, 01:08:16 PM",
      "body": "That's quite strange that bitcoin is impacted positively after FED rate hike. It should have been the other way around. Bitcoin should have gone down a bit. Because when such interest rate hike happens, people move their investment from non-traditional assets to traditional asset classes. That's what should have happened to bitcoin. So the current price increases has probably happened due to some other reason and not FED rate hike.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "July 28, 2022, 01:25:59 PM",
      "body": "Perhaps the market has gradually become stubborn before the Fed raises interest rates and previous predictions are also almost exactly what the Fed announced, so it may no longer cause panic among investors. Assuming the interest rate is not 75 points as previously predicted but 100 points, perhaps the market will have fluctuations in my opinion that will be extremely sharp causing panic in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 28, 2022, 01:48:24 PM",
      "body": "The only way FED affects bitcoin price is when they print more money causing US dollar value to dump. If you look at price of anything from groceries to rent and utilities in the past couple of years you can clearly see how US dollar is dumping.And yet bitcoin (the only deflationary currency with a limited supply) price has dropped which only means that it is extremely undervalued compared to USD right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}