{
  "id": "topic_5467741",
  "title": "Stvru",
  "author": "Stvru",
  "created_time": "September 22, 2023, 06:39:33 PM",
  "content": "اريد من المتحدثين بالعربية قرض مبلغ 250$ لبداية مشروع من دون اي فائدة تفاديا للربا ، و لمساعتي في بداية مشروع .عنواني محفظتي الاثيريوم :  0x67743F4691d261730527bD00E3555Ae6F3896C80My etherum wallet address :  0x67743F4691d261730527bD00E3555Ae6F3896C80",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467741",
  "comments": [
    {
      "author": "mikeywith",
      "created_time": "September 22, 2023, 08:45:48 PM",
      "body": "لا اريد ان ابدو كشخص سيء او بدون مشاعر, ولكن ماهذا الذي تفعله؟ هل تتوقع انه يوجد شخص بدرجة سداجة كافية ليقرض شخص غريب اول منشور له في القسم العربي يطلب فيه قرض؟ بحساب جديد بالكاد تجاوز عمره الشهر وباجمالي تعليقات لم يتجاوز ال 5 تعليقات جلها غير مفيد وغير متعوب عليه؟انا متأكد بنسبة 100% انك لن تتحصل على قرض حتى وان كانت الفائدة 100%, فما بالك بقرض ب 0% فائدة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hg_away",
      "created_time": "September 24, 2023, 01:20:39 PM",
      "body": "Quote from: mikeywith on September 22, 2023, 08:45:48 PMانا متأكد بنسبة 100% انك لن تتحصل على قرض حتى وان كانت الفائدة 100%, فما بالك بقرض ب 0% فائدة.نشاط هذا الحساب غريب فهو مرتبط بمجموعة من الحسابات التي تطلب قروضا بدون اي نية للسداد في احدي الحسابات ذكر انه يحتاج لقرض لانه من موريتانيا ويريد ان يشتري عملات بديلة ويصبح ثريا بسرعه Quote from: Dlogd123 on May 04, 2023, 06:16:53 PMIAM from Mauritania I want to start with btc I need a loan for 0.03 btc To invest in my account get io I want to buy a lot of crypto like shiba I want to wait 5 year I will be a millionaire , and I want to work here on bitcoin talk , I need only helping , this is my 1st post , nice people of bitcoin need helping me , I want to be a legendary in this forum iam 1st one know btc in Mauritania know bitcoin talk .وفي حساب آخر تحدث باللغة الفرنسية واخبر انه يحتاج الاموال لمساعدة شخص من الجزائر تم اتهامه زورا https://ninjastic.space/post/62233303والان قصة انه يريد قرض ولا ينوي دفع الفائدة والدخول في الربامن الصعب تصديق ما اذا ان صادق ام كاذب ولكن الثابت انه يريد المال دون نية السداد او الشكر او بتعرف آخر الاحتيال علي الناس.انت محظوظ لانك لم تحصل علي ثقة سالبة, حاول ان تعود بحساب جديد, ارتقي وتعلم وابتعد عن الاحتيال او فكرة ان احد سيمنحك قرضا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 24, 2023, 05:14:34 PM",
      "body": "Quote from: hg_away on September 24, 2023, 01:20:39 PMمن الصعب تصديق ما اذا ان صادق ام كاذب ولكن الثابت انه يريد المال دون نية السداد او الشكر او بتعرف آخر الاحتيال علي الناس.انت محظوظ لانك لم تحصل علي ثقة سالبة, حاول ان تعود بحساب جديد, ارتقي وتعلم وابتعد عن الاحتيال او فكرة ان احد سيمنحك قرضا.لقد أصبح الأمر معتادا على المنتدى خصوصا في قسم الاقراض \"Lending\" حيث تظهر حسابات جديدة بشكل يومي تقريبا تطلب قروضا بأحجام مختلفة مع وعود بالتسديد و بنسب فائدة كبير. للأسف هناك ناس لازالوا بالسذاجة التي يتخيلون فيها ان هناك من يوزع المال بالمجان و يفضلون مواصلة التوصل على محاولة توظيف مهاراتهم لتحقيق الربح بالعمل. و أشك أن تتوقف هذه الحسابات عن الظهور. في القسم العربي لا نلاحظ هذا دائما و كانت المرة الوحيدة هي عندما نجح احدهم بالحصول على قرض من الأخ يحي و تأخر كثيرا بالسداد ثم اتضح فيما بعد انه يملك حسابات عديدة و قد تضررت شخصيا منه لأنه بدأ بمهاجمتي أنا و كل من حاولنا اقناعه بالعدول عن تلك التصرفات.هناك قاعدة في قوانين المنتدى تمنع التوسل من أجل المال و هي تعرض صاحبها الى أن يتم حضر جميع حساباته. حذاري من الحسابات الجديدة و حتى الحسابات النشطة لان البعض ايضا يقوم بانشاء حسابات بديلة ليترك تقييمات ايجابية لنفسه و يجعل الناس يعتقدون انه محل ثقة.من الجيد وجود نظام للثقة على المنتدى ليسهل التنبيه من خطورة بعض الحسابات.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "September 24, 2023, 08:14:07 PM",
      "body": "اظن ان هذه المواضيع يفضل تجاهلها واخذ عبرة من الاشخاص الذين يقومون بطلب قروض وعدم قرائة الشروط او حتى تقديم ضمانات مثل عملات او اي شيء له قيمة تتدعى المبلغ المطلوب قرضه. وطبعا لن تجد شخصا اذا لم يكن من معارفك او اصدقائك يعطونك قرض بدون فائدة لانه مخاطرة له وعلى الاقل نسبة قليلة من الربح فاذا لا تريد اخذ قرض بفوائد يمكن التوجه الى البنوك الاسلامية لانه المكان الوحيد على ما اضن يمكنه تقديم قرض من هذا النوع.اذا كان لديك ضرورة قصوى وتحتاج اموال من غير المعقول التوجه الى المنتدى وطلب من اشخاص لا تعرفهم او سوف يكون لديك الوقت الكافي للانتظار، على الاقل ان يكون لديك حساب موثوق في المجتمع بين اعضاء المنتدى وللاسف نجد بعض الحسابات الجديدة يوميا بنفس الطلب ولا احد منها حصل على قرض من قبل ولم افهم الغرض منها فقط تضييع للوقت في نظري.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 25, 2023, 04:10:12 AM",
      "body": "للأسف كثير من الحوادث السيئة التي حدثت في المنتدى نتيجة الإقراض سواء في القسم الأجنبي أو العربي. أنا مثلا تعرضت لحادثة سيئة بسبب إعطاء قرض بدون فائدة لأحد الأعضاء في القسم العربي(مع أن العضو دفع في النهاية بعد قصة طويلة)، وكذلك الأخ أوميغا كان يقدم خدمة قروض بدون فائدة أيضا تعرض لحادثة مماثة من عضو في القسم العربي اختفى بعدها على ما أذكر. في القسم الأجنبي كان هناك أيضا العضو شاسان يقدم خدمة قروض مع فائدة ولكنه أيضا تعرض لأكثر من حادثة والحادثة الأخيرة له كانت مع عضو رتبته جيدة لكن لم يستطع هذا العضو الدفع بسبب ظروفه. بكل الأحوال هذه الخدمة أثبتت فشلها في المنتدى بسبب تكرار هذه الحوادث، يعني حتى لو كان هناك أعضاء محترمين يسددون القروض في وقتها لكن وجود بعض الناس المخادعين يجعل الجميع يمتنع عن المساعدة. يمكن أن يمر الإنسان بظروف صعبة ويطلب المساعدة من معارفه وأصدقائه، لكن بصراحة أستغرب جدا من الأعضاء الجدد الذي يبدأون مشوارهم في المنتدى بطلب قرض من أشخاص لايعرفون عنهم شيئا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 26, 2023, 08:49:42 PM",
      "body": "Quote from: GxSTxV on September 24, 2023, 08:14:07 PMاظن ان هذه المواضيع يفضل تجاهلها واخذ عبرة من الاشخاص الذين يقومون بطلب قروض وعدم قرائة الشروط او حتى تقديم ضمانات مثل عملات او اي شيء له قيمة تتدعى المبلغ المطلوب قرضه. التجاهل ليس حل لهده المشكلة, والامر يحتاج للتوعية المستمرة خصوصا في القسم العربي نظرا للطيبة المفرطة للعرب بصفة عامة فهم يتسارعون لتقديم المساعدة وهدا امر جيد ان كان في محله ولكن التفريق بين شخص محتاج وشخص نصاب ليس بالامر السهل خصوصا للمستجدين, وقد حدث الكثير من عمليات النصب المشابهة في القسم العربي في السابق لذلك وجب التنويه والحديث عن هده المواضيع.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abderrazak belkhir",
      "created_time": "September 30, 2023, 01:25:03 AM",
      "body": "Quote from: mikeywith on September 26, 2023, 08:49:42 PMQuote from: GxSTxV on September 24, 2023, 08:14:07 PMاظن ان هذه المواضيع يفضل تجاهلها واخذ عبرة من الاشخاص الذين يقومون بطلب قروض وعدم قرائة الشروط او حتى تقديم ضمانات مثل عملات او اي شيء له قيمة تتدعى المبلغ المطلوب قرضه. التجاهل ليس حل لهده المشكلة, والامر يحتاج للتوعية المستمرة خصوصا في القسم العربي نظرا للطيبة المفرطة للعرب بصفة عامة فهم يتسارعون لتقديم المساعدة وهدا امر جيد ان كان في محله ولكن التفريق بين شخص محتاج وشخص نصاب ليس بالامر السهل خصوصا للمستجدين, وقد حدث الكثير من عمليات النصب المشابهة في القسم العربي في السابق لذلك وجب التنويه والحديث عن هده المواضيع.اتفق معك تماما اخي اعتقد انه يجب التعامل بصرامة اكثر مع هكذا مواضيع حتى نتجنب الوقوع في عمليات النصب و الإحتيال خاصة على الاعضاء الجدد الذين ليس لديهم  دراية عن نضام المنتدى و كيفية معرفة الاشخاص الموثوقين",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minoxpro",
      "created_time": "October 30, 2023, 04:54:30 PM",
      "body": "لقد قرأت هذا المنشور انا لا أوافق على  هذه الفكرة خاصة للمشتركين الجدد لا أنصحهم بفكرة الاقتراض لان يجب على الاقل التطلع على جميع الشروط الخاصة لهذا المنتدى، يمكن أن تتعرض للاحتيال  يمكنك التوجه للبنوك الأخرىكالاسلامية  التي تعمل بدون فائدة",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "October 30, 2023, 05:31:42 PM",
      "body": "Quote from: minoxpro on October 30, 2023, 04:54:30 PMلقد قرأت هذا المنشور انا لا أوافق على  هذه الفكرة خاصة للمشتركين الجدد لا أنصحهم بفكرة الاقتراض لان يجب على الاقل التطلع على جميع الشروط الخاصة لهذا المنتدى، يمكن أن تتعرض للاحتيال  يمكنك التوجه للبنوك الأخرىكالاسلامية  التي تعمل بدون فائدة دون الحديث على الامور الدينية المنتدى لديه قسم خاص بالقروض [1]ويوجد العديد من المواضيع والعروض وحاليا انا اخذت قرض ولدي تعاملات اخرى بالاضاقة الى اعضاء اخرين من قسمنا يتعاملون بشكل عادي. الفرق الوحيد هو العضو الذي لديه تعاملات ومشاركات ذو قيمة مع امكانيته العمل في اي حملة توقيع وهو امر مهم لانه يمكلك دخل اسبوعيواو شهري يمكنه من دفع القرض الذي اخذه.صاحب الموضوع لديه حساب جديد وليس لديه اي تعاملات او لديه القدرة على المشاركة في اي حملة توقيع. الحل الوحيد له هو تقديم شيء ذو قيمو اكبر من القرض الذي يود اخذه واعطائه  للشخص الذي يود اعطائك القرض كضمان[1]: https://bitcointalk.org/index.php?board=65.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}