{
  "id": "topic_5398679",
  "title": "Leviathan.007",
  "author": "Leviathan.007",
  "created_time": "May 14, 2022, 04:38:38 PMLast edit: May 14, 2022, 07:20:49 PM by Leviathan.007",
  "content": "Today I had a meeting with a friend of mine who teaches economics at university.He believes when the inflation rate rises that's profitable to take a loan even with high interest to buy other assets such as gold, bitcoin, and even real estate. On one side of this theory, we usually suggest people never invest money that they can't afford to lose and don't invest the money that does not belong to them for many reasons. These are golden tips and useful in any market.But the question is what if you do not own enough money for investing? can you take a loan and invest?Because if you look deeply into charts of inflation rates in most the countries you can easily understand taking loans even with high interests could be useful and profitable. Personally, I don't suggest doing this because using other people's money will put me under stress and this can have negative effects on my decisions. What do you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398679",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 14, 2022, 09:08:31 PM",
      "body": "Quote from: Leviathan.007 on May 14, 2022, 04:38:38 PMBut the question is what if you do not own enough money for investing? can you take a loan and invest?Only what is advisable is to borrow money for business. Some people can take the risk and borrow to invest in bitcoin, if they study the market very well, they can be lucky, but, yet, not a good advice.Quote from: Leviathan.007 on May 14, 2022, 04:38:38 PMBecause if you look deeply into charts of inflation rates in most the countries you can easily understand taking loans even with high interests could be useful and profitable.Especially, this would be a good idea in developing and underdeveloped countries where high inflation persists (but fiat is inflationary generally), but not a good idea. It would rather have been better using loan for business.Quote from: Leviathan.007 on May 14, 2022, 04:38:38 PMPersonally, I don't suggest doing this because using other people's money will put me under stress and this can have negative effects on my decisions. What do you think?Yes, not good at all, what if the investment plan go wrongly, that will be a big problem for the person.Have you heard about die borrow die strategy before. You can read about it. About the borrow aspect of it, rich people prefer not to sell their asset because of the high tax, because of this, they borrow in which the tax would be reduced if compared to selling of property or asset. Let me use bitcoin being an asset as an example. If I have certain worth of bitcoin, but because if I sell it, much money would be paid to the government in tax if compared to borrowing of fiat, I will rather borrow. First, because fiat is inflationary. Second, because tax that would be paid in borrowing fiat will be reduced if compared to sellimg of bitcoin holding directly. Because of this, if someone borrow, it is not a bad idea at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 14, 2022, 09:19:41 PM",
      "body": "I also don't suggest to do it and that's the actual risk if that's the strategy of other people. I knew wealthy people that have been borrowing money to buy another assets and this is a common style to them and that's making them more wealthy. But in able for you to do it, you have to make sure that you'll be able to pay the loan + the interest of it and most wealthy people have a lot of sources of income and that's why they're free in doing it. And if you're just an average and minimum wager man, you'll hardly do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 14, 2022, 09:20:47 PM",
      "body": "Inflation or no inflation to me taking a loan to buy asset is just another glorified debts. In my very eventful few years of crypto-Currency I have come to understand that it’s very wrong to take a loan to buy any Crypto-currency asset, so inflation aside I believe a loan is a bondage and using it to buy an asset as volatile as crypto-currency is very far foolish, that’s where the start slow and rise steady comes in, Crypto-currency is very much unpredictable and taking loan to enter it can be a bad decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajochems",
      "created_time": "May 14, 2022, 09:21:39 PM",
      "body": "At first,it demands on the capacity of you.If you are going to take a loan from friends,kindly take a loan of 5000$ or above.Because you need to keep the bet on most trusted coin,which is bitcoin and Ethereum.Keep the first bet of 1.5K$ on both bitcoin and Eth.When the pump occur,their will be huge profit.Then keep the remaining 2k dollars for best 8 coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "May 14, 2022, 09:31:07 PM",
      "body": "Quote from: blockman on May 14, 2022, 09:19:41 PMI also don't suggest to do it and that's the actual risk if that's the strategy of other people. I knew wealthy people that have been borrowing money to buy another assets and this is a common style to them and that's making them more wealthy. But in able for you to do it, you have to make sure that you'll be able to pay the loan + the interest of it and most wealthy people have a lot of sources of income and that's why they're free in doing it. And if you're just an average and minimum wager man, you'll hardly do it.But there are people who do have that kind of mindset on which they do really believe in that taking risk is really worth if you are really that having those goals on having a good future but since we knowthat not all things we've been engaging through would end up to be on positive then you should have back up plans on the time that things doesnt really come on what you are expecting.Taking loan is never been recommendable specially if you are having some problems in terms of other source of income but if you do have lots of sourcesthen it wont really be an issue at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "May 14, 2022, 09:38:33 PM",
      "body": "It's the question of risk as well, are you willing to take that big risk to make a loan and invest right now in crypto or any other assets assuming that we might be in another recession period?If people are going to say yes, then go with your instinct and borrow money but make a good plan B and mitigation in case your investment fails and you know where to get money to pay for your loans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "May 14, 2022, 09:53:27 PM",
      "body": "Quote from: Leviathan.007 on May 14, 2022, 04:38:38 PMToday I had a meeting with a friend of mine who teaches economics at university.He believes when the inflation rate rises that's profitable to take a loan even with high interest to buy other assets such as gold, bitcoin, and even real estate. If this belief and theory are really realized and true happen, we will be very lucky to have the loans. But it doesn't guarantee that every investment with loans will exactly bring high profits right?As we know that if we have loans, we should pay for them and their interest monthly or even in some certain period. And what will happen if the reality is not like the expectation? We will be stressful enough because of the loan. That is why if we are not really ready with the loans or we are not able to have good management, it is better not to take loans for investment. Aways DYOR because everything here is not an investment advise",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "May 14, 2022, 10:26:16 PM",
      "body": "Have a loan if there's a guarantee that you can earn money from that investment but if there's no guarantee I believe its too risky but having loan is still possible, just make sure you can pay that loan even if you didn't make profit on that investment. The market is very cheap right now, and I'd better choose to use my savings in the bank to invest it than to having a loan because the interest is really high and of course that is your not money after all and you might fall on a big debt trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptocanon",
      "created_time": "May 14, 2022, 10:31:07 PM",
      "body": "Taking loans to invest on a high volatility business can never be an option for me and neither will I advice any individual or firm to have it considered. The term \"Don't invest more than you can afford to lose\" basically means to put in with loose funds and not going to the top aim of taking loans to risk it all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "May 14, 2022, 10:50:45 PM",
      "body": "Quote from: kryptocanon on May 14, 2022, 10:31:07 PMTaking loans to invest on a high volatility business can never be an option for me and neither will I advice any individual or firm to have it considered. The term \"Don't invest more than you can afford to lose\" basically means to put in with loose funds and not going to the top aim of taking loans to risk it all. Very hard to consider on taking up some loan when you do intent to make investment specially on crypto where everything is really not guaranteed whether you could really make money out of the investment you made or totally lost it for which it would really be in resulting for you to make more problems since you do need to repay those interest but if you couldable to do so without depending with your crypto investments then its good but if not and you are totally depending on it then you would really be having a very big problem ahead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 14, 2022, 10:59:15 PM",
      "body": "Quote from: Leviathan.007 on May 14, 2022, 04:38:38 PMBut the question is what if you do not own enough money for investing? can you take a loan and invest?Investing in a business is good that you'll surely see that there's ROI will come, though the risk is not that heavy since we know business will generate money that could possibly you can pay your debt.  As an expert says, many successful businessmen have taken debt to the banks and bought assets and let them generate profit until they will becomes successful and also paid the debt at the right time.But this story is different from investing in crypto which is we don't know when we generate profit since the price is unpredictable, the period of time is unknown and the more time you'll wait the more you will pay the interest of your debt.  That's why the golden rule must exist, invest what you can afford and never take a loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "May 14, 2022, 11:18:10 PM",
      "body": "Quote from: Leviathan.007 on May 14, 2022, 04:38:38 PMToday I had a meeting with a friend of mine who teaches economics at university.He believes when the inflation rate rises that's profitable to take a loan even with high interest to buy other assets such as gold, bitcoin, and even real estate.I'm not aware about this money making method and it's probably not practicable, as banks and governments would never give this advantage to common citizens. I keep in mind loans must be very well calculated and thought before borrowed, because the consequences can be catastrophic if not paid in time. Therefore, you can't rely on passive income investments which depend on market fluctuations to pay it back. That is just too risky to be executed. Moreover, I would suggest everyone to never borrow money from banks or any other financial institution, since their rates are abusively high. A friendly loan with fair rates is the only thinkable alternative in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 14, 2022, 11:44:49 PM",
      "body": "Inflation or no inflation, investing money that don't belong to you is pure idiocy. Same as investing money that you are saving for an emergency, education, housing or other goals. The golden rule of investing is to never invest money that you can't afford to lose. Taking a loan is only acceptable if you have enough other assets that could be liquidated to bail yourself out in case of a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "May 14, 2022, 11:52:13 PM",
      "body": "Quote from: Leviathan.007 on May 14, 2022, 04:38:38 PMBut the question is what if you do not own enough money for investing? can you take a loan and invest?Personally, I don't suggest doing this because using other people's money will put me under stress and this can have negative effects on my decisions.You actually have answered the question yourself. It is true that taking a loan for crypto investment isn't advisable. Why? Not only because we will be stressed, but it is also related to the high risk in crypto investment. Since the high risk in crypto investment, we are better to avoid taking a loan, just invest with our extra money. There is no guarantee for profits in crypto investment whether in the bearish or bullish trend. We can lose money at any time when we do a wrong decision. Please think about this, it is too risky to use loan money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "May 14, 2022, 11:55:59 PM",
      "body": "Taking the loan as a minor cost is effective, liquidity is key I agree.  It becomes dangerous when you cannot service the loan for various reasons, inflation does lead to economic loss and industry contraction and failure.      A quick take on why this is quite certain is perhaps consider 'Just in time' that idea of order flow and parts provided perfectly and it allows lower cost production.  Now also consider unstable currency, without the ability to fix value and cost known of parts this perfect balance breaks down and production becomes impaired slightly.   Across entire countries inflation can destroy business and unemployment can easily rise beyond expectations.QuoteHe believes when the inflation rate rises that's profitable to take a loan even with high interest to buy other assets such as gold, bitcoin, and even real estate.Real estate is the most genuine reason to borrow, if its the primary residence and its used everyday its not so great a risk as you now have no rental costs.  Its a justified cost to the loan at that point, to speculate on gold is far more risky to do as the market price is not always clear.    Commodities at any time can half in price this is their true nature and volatility and even Gold can do this though its stable over decades and centuries most of us cant wait this long to get the money back.   Most would lack utility to borrowing and incurring costs to own Gold, unless you can shape the gold to make rings perhaps most wont.   Im not against gold at all, it will likely rise but it has no yield just holding this elemental rock in fact there is some cost of insurance maybe.   The ideal to me is to fix your interest rate cost to the loan, then if economic factors alter and rates rise you will remain intact in your original calculations.    I tried to tell my friend this, fix your mortgage rate cost so you know the future but most wont accept advice like that and its a personal matter; its never simple unfortunately but I agree with the premise OP",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "May 14, 2022, 11:58:55 PMLast edit: May 15, 2022, 12:10:17 AM by Vaskiy",
      "body": "Taking loan is good when you know that the investment will bring profit and the time required for the same. With cryptocurrencies this isn't possible, because we know our investment will bring profit, but the time required for the same is unknown. There are successful people who have taken loans and turned themselves successful in cryptocurrency investment. Everyone can't be the same, and when we think of loans we need to think about the interest repayment. This means atleast the interest needs to be got out of the Investment, so that the capital profiting will help in the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "24Kt",
      "created_time": "May 14, 2022, 11:59:46 PM",
      "body": "Quote from: STT on May 14, 2022, 11:55:59 PMTaking the loan as a minor cost is effective, liquidity is key I agree.  It becomes dangerous when you cannot service the loan for various reasons, inflation does lead to economic loss and industry contraction and failure.    QuoteHe believes when the inflation rate rises that's profitable to take a loan even with high interest to buy other assets such as gold, bitcoin, and even real estate.Real estate is the most genuine reason to borrow, if its the primary residence and its used everyday its not so great a risk as you now have no rental costs.  Its a justified cost to the loan at that point, to speculate on gold is far more risky to do as the market price is not always clear.    Commodities at any time can half in price this is their true nature and volatility and even Gold can do this though its stable over decades and centuries most of us cant wait this long to get the money back.I can agree if it is real estate because they increase their value thru time but others, you need to assess the situation first. Also, make sure you have the capability to pay on the agreed timeline. Otherwise, you may incur high fees just because you have late payments. Anyway, this for me depends on the person, how he look at his financial conditions in the future. Can he afford to take the loan? Because if not, better stay within your means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "May 15, 2022, 12:12:25 AM",
      "body": "Average loan interest rate start from 5% to 25% depends on the your credit scores too, in other hands average inflation on some countries around 1-2% per year except they're faced high inflation >3%. Increase of money supply is the most reason why inflation happen, banks will increase their saving interest in order to attract people to save their money. Taking a loan during high inflation is just making the situation worst!The thing is the loan interest is really high, can you guarantee your investment return will higher than your loan interest? Average Gold return only around 1-5% per year, Real Estate you need a lot money to invest, Bitcoin? You may earn good APY due to high volatility, but you could loss more too. I'd always suggest, if you don't have enough money to invest moreover during high inflation, just don't invest. You should read there are some investors commits suicide because they're invest on LUNA.[1] https://www.bankrate.com/loans/personal-loans/average-personal-loan-rates/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 15, 2022, 03:04:54 AM",
      "body": "Unless it’s one of those 0% car loans then most likely the interest rate will be too high anyways. Also it’s crazy to borrow money to invest.Go on the Luna Reddit and read some of those posts. People borrowed money to buy Luna or to stake UST and now they are ruined and need to pay back all that debt.Never borrow money to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}