{
  "id": "topic_5452428",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "May 11, 2023, 09:49:45 PM",
  "content": "What do you use to store your nano ledger s, s plus or x or do most of you just put it out there on your desk like a usb flash drive or inside a drawer in your desk?  Ledger sells a case but not only is it expensive, reviews say overprice and it's not that good?  Also what about you people that travel a lot with it and move around a lot with your ledger?  What case you use?  Or you just put it in your bag compartment?  What about a ziplog bag?  Or that isn't good because it might get humid?Saw amazon and there are several that has decent reviews.  Anyone here bought any of these?Also, couldn't you buy on amazon one of those earbud or usb pouch cases and just use one of those instead?  However, what about the temperature?  Now if's it's closed up, any concern of humidity?  So your apartment or house is humid, then what?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452428",
  "comments": [
    {
      "author": "Yamane_Keto",
      "created_time": "May 15, 2023, 11:14:34 AM",
      "body": "I traveled to a country that have some Bitcoin restrictions, and when the airport employee searched my things, he found my HW and he thought it was a flash memory as I put it with some external External Hard Drives.the size Nano Ledger is small using a crypto bag or case will be attractive especially with company logo and the large Crypto word (I do not know what they were thinking when they printed it with this size) and thus will raise the attention of thieves.Travelling using these cases is more harmful I do not recommend anyone to do it. These cases are useful when leaving at home, provided that they are have Fire, heat , corrosion and crush resistant",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 15, 2023, 09:41:18 PMLast edit: May 16, 2023, 07:08:47 AM by bitmover",
      "body": "Quote from: jerry0 on May 11, 2023, 09:49:45 PMWhat do you use to store your nano ledger s, s plus or x or do most of you just put it out there on your desk like a usb flash drive or inside a drawer in your desk?  Ledger sells a case but not only is it expensive, reviews say overprice and it's not that good?  Also what about you people that travel a lot with it and move around a lot with your ledger?  What case you use?  Or you just put it in your bag compartment?  What about a ziplog bag?  Or that isn't good because it might get humid?You can store it anywhere. Mine is just hidden in my house , but you shouldn't think too much.The device itself isn't worth anything  , just the price you paid.What you should really take care of is your seed phrase, the real backup of your wallet.Protect the seed phrase from possible water and fire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}