{
  "id": "topic_5464778",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "August 28, 2023, 02:05:10 AM",
  "content": "EDL has declared a halt in providing power to cryptocurrency mining ventures in Laos. The majority of the country's electricity, sourced from hydropower plants, will no longer be supplied to these operations. In September 2021, the Laotian government granted permission to six companies for cryptocurrency trading and mining.The Governor of EGAT said that if the drought in Laos becomes severe, hydropower plants in Laos will generate less electricity, reducing export capacity.https://en.vietnamplus.vn/laos-stops-power-supply-to-cryptocurrency-mining-businesses/266967.vnpWhat do you guys think about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464778",
  "comments": [
    {
      "author": "spectre71",
      "created_time": "August 28, 2023, 12:06:58 PM",
      "body": "Well if you don't have the water then something has to be done. I would consider mining a sub critical load. Nothing bad is going to happen if they stop mining. Power goes out to hospitals, schools, airport, business and such you have a much bigger problem. They do the same in Texas during extreme events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "August 28, 2023, 12:48:41 PM",
      "body": "\"Lao authorities said that cryptocurrency mining operations have failed to repay mounting debts.\" besides the problem of insufficient electricity, they also have unpaid debts until now, maybe this is an excuse for the government to cut off the electricity supply to their business. because a good and profitable company certainly has an electricity generator which they can use to support their business, even though turning it on is expensive but it shouldn't paralyze their business, unless this mining company has complex problems and is on the verge of bankruptcy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 28, 2023, 01:44:54 PM",
      "body": "Quote from: moneystery on August 28, 2023, 12:48:41 PM\"Lao authorities said that cryptocurrency mining operations have failed to repay mounting debts.\" Well, if that's the actual case then we can't blame the government really! Electricity is a commodity which requires money to produce. So if the mining companies are failing to pay their bills, the government has taken the correct course of action. Crypto mining operations across the world needs to be self-reliant when it comes to electricity. Otherwise it's a huge risk as we are seeing here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 28, 2023, 02:02:59 PM",
      "body": "Laos is a small nation and it follows communism so its government can do many things while their citizens have very power to ask for their rights.Cambridge Bitcoin Electricity Consumption Index and Bitcoin Mining Map show that Laos is not a big nation in Bitcoin mining. In Bitcoin Mining and Energy Statistics does not have description about Laos in Bitcoin Mining.It had Bitcoin mining but is small in hashrate and it won't impact the Bitcoin network a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "August 28, 2023, 02:37:58 PM",
      "body": "Laos is a small nation that is located in the South Eastern part of Asia. The percentage bitcoin mining compared to the rest of the world is very minimal. Country that is much dependent on hydropower and unable to meet the necessity due to the shortage of water resources and limiting the supply to bitcoin mining operations is not a big issue and this doesn't affect the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "August 28, 2023, 03:26:40 PM",
      "body": "Quote from: moneystery on August 28, 2023, 12:48:41 PM\"Lao authorities said that cryptocurrency mining operations have failed to repay mounting debts.\" besides the problem of insufficient electricity, they also have unpaid debts until now, maybe this is an excuse for the government to cut off the electricity supply to their business. because a good and profitable company certainly has an electricity generator which they can use to support their business, even though turning it on is expensive but it shouldn't paralyze their business, unless this mining company has complex problems and is on the verge of bankruptcy.So the government has another reason why they wouldn't supply a electricity to the mining operation. It is also a common sense that the Laos government will prioritize important necessity in their country like schools, hospitals and government facilities, removing power sources from crypto miners who are basically a business that consume a lot of electricity would be the first option. Most of the government would probably do the same because the crypto mining business that they aren't supply isn't contributing much to the economy of their country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 28, 2023, 03:47:57 PM",
      "body": "This has been happening over the past years in China. Mining in China has stopped several times due to the dry season, either because of high electricity prices or because the authorities have restricted electricity consumption. The mining farm can be seen from the activity of electricity consumption and the Internet, even those that include good insulation can be known.QuoteRegional authorities in the province of Sichuan are reportedly pressuring bitcoin miners to scale down operations amid electricity shortages during the dry season in southwest China.https://asiatimes.com/2019/12/dry-season-offensive-against-china-bitcoin-miners/Sometimes it may come to the closure of the farms and sometimes to fines, but soon the miners move to other places.The article is dated 2019 and you can see the impact in the hash-rate here:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 28, 2023, 04:10:00 PM",
      "body": "Quote from: ImThour on August 28, 2023, 02:05:10 AMEDL has declared a halt in providing power to cryptocurrency mining ventures in Laos. The majority of the country's electricity, sourced from hydropower plants, will no longer be supplied to these operations. In September 2021, the Laotian government granted permission to six companies for cryptocurrency trading and mining.The Governor of EGAT said that if the drought in Laos becomes severe, hydropower plants in Laos will generate less electricity, reducing export capacity.https://en.vietnamplus.vn/laos-stops-power-supply-to-cryptocurrency-mining-businesses/266967.vnpWhat do you guys think about this?Very well, I am not saying that the Miners should not be facilitated with cheap electricity, I'm just commenting on the policy by the ELD as they're taking export capacity and their own utility into account rather than an unnecessary load, Bitcoin is still hanging between the LEgal and Illegal tender so for now in the government policies we'll count it in the private load, where if a good dinner is spending a lot of money on the machinery by just having a few difficulties he can arrange the self-generated electricity. I am not familiar with the geographical conditions of Laos, my comment is general for all.Sticking to the topic if the government is not ready to supply electricity for Bitcoin I think it directly doesn't mean that they trying to discourage BTC mining because Minner can have enough capital to produce electricity from Solar or start a private power plan at least I'm taking 10,000 TH/s in general. If they are discouraging the self-produced power so the case is different until they've allowed you the self-power mining you can mine BTC freely.Another offtopic viewAs for here in our country we produce the world's most expensive electricity even though we have better environmental resources, we have better hydropower opportunities, Solar but as for now our maximum plants are on Fuel, The Government is generating 56RS per unit of electricity after subsidies, providing the electricity to the consumers around 32RS 34RS per Unit on average and not costing taxes to the over users unit costs same for the 1000 unit consumers and 300 unit consumers.Haha well, still people are paying...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "August 28, 2023, 07:22:43 PM",
      "body": "These types of events are what must be taken into account when you want to start mining Bitcoin, not only legal issues can prevent a good flow of these operations, a large part of the countries generate their electricity based on hydroelectric plants, located in rivers with large water capacities that allow supplying an entire country, and this despite being good since it is occurring naturally and sustainably, it can have its defects when climate changes become drastic and produce extreme droughts, reducing this process and causing electrical failures and therefore affecting mining......And of course other sectors considered more important such as hospitals.....But even if this happens and the reduction of bitcoin mining in that country is not so compromising as to destabilize the general market, i believe that they can take other measures to be able to continue with their work and not harm the government's decisions as such, i believe that everything Anyone who wants to get involved with this work must be prepared with other alternatives or at least have another option to support this type of event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 28, 2023, 08:06:51 PM",
      "body": "Quote from: ImThour on July 15, 1970, 11:18:03 PMWhat do you guys think about this?The government took the right decision to halt the power supply. The country is going through a drought and their major source of power is hydro-powered plants. The government would have to give electricity to important sectors of the economy and one of them is to export power to Taiwan. The article confirmed that the mining plant is not paying its electric bills regularly. So the government prefers to supply power to areas that can generate income. Bitcoin mining farms should look for alternative sources of power if they still want to be in business or pay up their debts which might make the government see miners as an important source of revenue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 28, 2023, 08:33:20 PM",
      "body": "Quote from: ImThour on August 28, 2023, 02:05:10 AMWhat do you guys think about this?The government of Laos are just trying to ensure that they have enough electricity for next year to maintain the signed memorandums of understanding that they have with countries around them, so that they be able to meet up with the demands of these country that they export this their hydro generated electricity to since they are one of the major hydroelectric generators in Asia. Electricity sale is one of the countries major export from which they generate capital from, and since the cryptocurrency mining operators have failed to meet up with debt that they owe the government, it is unprofitable for them to continue supplying them with electricity.Cryptocurrency mining operators will face a major challenge with power when they are cut off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 28, 2023, 08:51:33 PM",
      "body": "Quote from: Zlantann on August 28, 2023, 08:06:51 PMThe government would have to give electricity to important sectors of the economy and one of them is to export power to Taiwan. Doubt that, probably Thailand, not Taiwan!Quote from: hd49728 on August 28, 2023, 02:02:59 PMLaos is a small nation and it follows communism so its government can do many things while their citizens have very power to ask for their rights.And what do you think the citizens would want?Keep powering the miners that with each machine burns around 72kwh per day while the average person uses 2kwh a day?And for what, $7 a day in revenue, that will mostly go to a few businessmen while half of the population risks blackouts?Get real, if it were a referendum anywhere in the world, including in Salvador in such a  case there will be a 90% vote to shut them down!Rights, what rights? The right to have your power shut down while some miner is making money with dirt cheap energy?Quote from: Hamza2424 on August 28, 2023, 04:10:00 PMSticking to the topic if the government is not ready to supply electricity for Bitcoin I think it directly doesn't mean that they trying to discourage BTC mining because Minner can have enough capital to produce electricity from Solar or start a private power plan at least I'm taking 10,000 TH/s in general.Solar is the most expensive option for any miner, nobody can mine on solar cycles, batteries are expensive as hell and without a grid and subsidies you have no chance to break even.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "August 28, 2023, 09:08:04 PM",
      "body": "We hope the drought eases off very soon and things can return to some degree of normalcy. There are more important things than allowing a miner to take electricity that have been used to help the general public and the miner only get a reward from it.I can hardly fault the decision of the government to prioritize necessities over mining. There are thousands of other miners around the world and the void will be filled easily",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "August 28, 2023, 09:34:55 PM",
      "body": "Quote from: ImThour on August 28, 2023, 02:05:10 AMEDL has declared a halt in providing power to cryptocurrency mining ventures in Laos. The majority of the country's electricity, sourced from hydropower plants, will no longer be supplied to these operations. In September 2021, the Laotian government granted permission to six companies for cryptocurrency trading and mining.The Governor of EGAT said that if the drought in Laos becomes severe, hydropower plants in Laos will generate less electricity, reducing export capacity.https://en.vietnamplus.vn/laos-stops-power-supply-to-cryptocurrency-mining-businesses/266967.vnpWhat do you guys think about this?I say that he is not sure that electricity will be cut, he said \"if\" and in any case Africa is a very hostile country to use hydroelectric power especially in areas where water is scarce and there are no rivers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 29, 2023, 12:53:32 AM",
      "body": "Quote from: stompix on August 28, 2023, 08:51:33 PMQuote from: Zlantann on August 28, 2023, 08:06:51 PMThe government would have to give electricity to important sectors of the economy and one of them is to export power to Taiwan. Doubt that, probably Thailand, not Taiwan!My bad, the correct country is Thailand. Thank you. Quote from: mendace on August 28, 2023, 09:34:55 PMI say that he is not sure that electricity will be cut, he said \"if\" and in any case Africa is a very hostile country to use hydroelectric power especially in areas where water is scarce and there are no rivers.The drought has already lasted for six months and export capacity is already decreasing. The statement from Electricite du Laos (EDL) is that it will no longer supply power to these mining facilities. Two things might make them change their mind which is if they experience an improvement in rainfall or if the miners prove their importance to the Laos economy by paying electric bills when due. Laos is not located in Africa but in the Southeast Asia. It is bounded by Thailand, China, and Myanmar. The part of Africa that experiences drought is East Africa mainly the area called the Horn of Africa which includes countries like Kenya, Somalia, and Ethiopia. Some other parts have access to rivers and have hydropower dams for electricity. Mining in Africa will be difficult because of the high cost of electricity and unstable power supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 29, 2023, 06:54:13 AM",
      "body": "Quote from: Zlantann on August 29, 2023, 12:53:32 AMThe drought has already lasted for six months and export capacity is already decreasing. The statement from Electricite du Laos (EDL) is that it will no longer supply power to these mining facilities. Two things might make them change their mind which is if they experience an improvement in rainfall or if the miners prove their importance to the Laos economy by paying electric bills when due. Is it always like this, or this is the first time they have experienced a drought in the dry season? If I'm not wrong, most countries in SEA have the same seasonal changes, so the earliest rain should be expected to come in around October. If they had this in mind, I believe they should have planned it earlier and told miners to use other sources of electricity as soon as the dry season hits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 29, 2023, 07:01:41 AM",
      "body": "Quote from: mendace on August 28, 2023, 09:34:55 PMI say that he is not sure that electricity will be cut, he said \"if\" and in any case Africa is a very hostile country to use hydroelectric power especially in areas where water is scarce and there are no rivers.Actually rivers in Africa are anything but scarce. The Nile river is a famous example. Not enough rainfall though, is another thing.Now I don't know if the Blue Nile even passes through Laos, but most of these countries are making use of hydropower for their electric loads, so they are just cutting power to non-essential industries if they can't generate enough to satisfy everyone, which seems fine to me.And there is something about debts not being repaid either so that is also an additional factor to consider.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "August 29, 2023, 10:13:20 PM",
      "body": "Governments shutting down mining when it starts to threaten the stability of the energy grid is nothing new, it happened many times before in other countries. Quote from: hd49728 on August 28, 2023, 02:02:59 PMLaos is a small nation and it follows communism so its government can do many things while their citizens have very power to ask for their rights.This has nothing to do with communism, there are few if any countries on this planet that would allow a private business to take electric power for themselves at the expense of the population. People hate blackouts and they would easily overthrow a government, even an authoritarian one, if it can't guarantee them the most basic living conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "August 29, 2023, 10:58:48 PM",
      "body": "Quote from: joniboini on August 29, 2023, 06:54:13 AM-snip-If they had this in mind, I believe they should have planned it earlier and told miners to use other sources of electricity as soon as the dry season hits.They should already have a primary solution by using other renewable energy sources such as solar, wind, and biomass systems. The Lao government has already thought about this and ensured energy security to overcome the power shortage due to the long dry season. Laos currently has 90 energy plants across the country, with a combined installed capacity of nearly 11,000 megawatts. This also includes 77 hydropower plants, 8 solar power plants, 4 biomass schemes, and 1 coal-fired power plant.Quote from: NotATether on August 29, 2023, 07:01:41 AM-snip- so they are just cutting power to non-essential industries if they can't generate enough to satisfy everyone, which seems fine to me.So the bitcoin industry is not an important industry, so there is no electricity supply for Bitcoin mining in Laos. Quote from: NotATether on August 29, 2023, 07:01:41 AMAnd there is something about debts not being repaid either so that is also an additional factor to consider.Yes, that also seems to be the problem that made the electricity supply stopped.“Another reason we must suspend supplying electricity to cryptocurrency mining businesses in Laos is that they are unable to pay their outstanding electricity bills,” an EDL employee told Laotian Times.Source: https://laotiantimes.com/2023/08/25/laos-suspends-power-supply-to-cryptocurrency-mining-businesses/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}