{
  "id": "topic_5433045",
  "title": "Doktore1907",
  "author": "Doktore1907",
  "created_time": "January 04, 2023, 10:53:29 PMLast edit: January 05, 2023, 11:34:30 AM by Doktore1907",
  "content": "Hello to everyone I’m in a likely situation so I wanted to ask some questions. First of all, I never opened another sportsbet account. I opened just one account on sportsbet and I don’t have any else. My nickname is ‘doktor17’.On 1st of January, I win a bet and won 6472 usdt totally. I tried to withdraw 6000 but couldn’t. There was a notification that tells me I must contact with safety team of SB by email. I tried to connect live and ask about the withdrawal problem that I had but there was no live support button. So I mailed to safety and assurance team and they wanted me to verificate identity. I did the verification successfully and told them. They mailed me that my verification is successfully completed, they’re making an investigation about multi accounting on me and they also said that if I have any other accounts, it would be nice to tell them. I told I never had any other then they sent me 3 account nicknames that I don’t know and never get in touch with. They also told me that I successfully got over second level investigation (I dont know what it is). That was the last mail I had. During this proccess, I tried to withdraw my money and get a notification that tells me ‘I cannot withdraw money in 48 hours since I deposited money for security reasons’ but I had not deposited any money for security reasons. After all of these, I deposited some more USDT in my account because of that ‘security reasons’ notification. It’s been 1 day after my deposit. I cannot get any answer from safety team, my budget is still same in SB. I cannot take bets on the site. I want to ask that how long does it take to investigate an account? My bets were clean, I’m just a person who likes betting and 6400 bucks is a big money for me. Thx 🙏🙏 https://www.hizliresim.com/ht8n972  https://www.hizliresim.com/djfj99k  https://www.hizliresim.com/6m6pecu  https://www.hizliresim.com/b8bmw2f  https://www.hizliresim.com/1xvpivy  https://www.hizliresim.com/lfi4uar  https://www.hizliresim.com/9igdrwb  https://www.hizliresim.com/3wrxfto  https://www.hizliresim.com/awj1amp",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433045",
  "comments": [
    {
      "author": "OcTradism",
      "created_time": "January 05, 2023, 10:19:59 AM",
      "body": "First of all, you should never create multiple topics for one issue.Sportsbet.io multi-accounting problemSportsbet.io frozen accountYou created two topics already and it is time to lock one topic and let only one topic to be actively for discussion. Sportsbet.io's representative won't join all topics created by you. Additionally, forum members will have more difficulty to follow all discussions and evidence from two or many topics.Second, if a casino detects and announces that you are cheating with multiple accounts, it seems you have very slim chance to appeal. Their decisions are usually very correct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}