{
  "id": "topic_5422127",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "November 18, 2022, 02:48:24 PM",
  "content": "Sportsbet, an Australian betting giant, has said that it will support any move to prohibit the use of credit cards for gambling. The operator said that this type of payment method promoted a “play now, pay later” culture which was detrimental to the well-being of players and consumers. Here is a summary of the news belowThe problem:Gambling with credit cards is high-risk in nature and could have serious financial consequences. Proposed solution: Responsible Wagering Australia is putting forth a new interactive gambling legislation should block operators from offering credit cards as viable payment methods.The Challenge: If this legislation is implemented, it would also affect lottery tickets, which would not be purchasable through credit cards anymore.How Sportsbet is working to address the problem - They are building a “real-time intervention” solution that will allow it to leverage the power of AI to quickly predict customers’ daily deposits and send alerts when the depositing amounts begin to climb up too rapidly.What other solutions can you think of?Read the full news here",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422127",
  "comments": [
    {
      "author": "jackg",
      "created_time": "November 18, 2022, 02:57:07 PM",
      "body": "Are lottery tickets in Australia bought in the same place as other things in stores? I know for the UK that would be less of a problem (if credit card users get points from spending in a grocery store) as lottery tickets are generally sold at a different desk (along with cigarettes and other age restricted products - excluding alcohol). So I don't really see how it might be a problem, except for smaller shops. I think gambling with credit cards was quite a big thing to stop and it's good there's legislation for it.Data sharing between gambling providers would probably also help for determining if someone is gambling much more than normal and should take a break/be moved to a slower interface - if only one provider has that, there's nothing stopping someone addicted to gambling to just change sites unless they're already using most of them and all have the same features.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "November 18, 2022, 03:00:54 PM",
      "body": "Quote from: Davidvictorson on November 18, 2022, 02:48:24 PMSportsbet, an Australian betting giant, has said that it will support any move to prohibit the use of credit cards for gambling. The operator said that this type of payment method promoted a “play now, pay later” culture which was detrimental to the well-being of players and consumers. Here is a summary of the news belowwhy did they even allow credit cards as a payment method on a gambling site in the first place? this \"play now, pay later\" culture would not have happened if they did not allow gamblers to credit cards when gambling. Quote from: Davidvictorson on November 18, 2022, 02:48:24 PM Proposed solution: Responsible Wagering Australia is putting forth a new interactive gambling legislation should block operators from offering credit cards as viable payment methods.I agree with this.Quote from: Davidvictorson on November 18, 2022, 02:48:24 PMThe Challenge: If this legislation is implemented, it would also affect lottery tickets, which would not be purchasable through credit cards anymore.I am confused as to why this would be a \"challenge\".Quote from: Davidvictorson on November 18, 2022, 02:48:24 PMHow Sportsbet is working to address the problem - They are building a “real-time intervention” solution that will allow it to leverage the power of AI to quickly predict customers’ daily deposits and send alerts when the depositing amounts begin to climb up too rapidly.I like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 18, 2022, 03:04:12 PM",
      "body": "Quote from: Davidvictorson on November 18, 2022, 02:48:24 PMWhat other solutions can you think of?Read the full news herecrypto. best way and something that can be deposited instantly with the minimum risk. coins are received without the need of 3rd party,credit card users are getting lesser. people are not paying their debts anymore. with so many companies laying off, the credit cards are abused to buy the supplies at least it saved the jobless. they need the supplies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 18, 2022, 05:38:00 PM",
      "body": "I think it's a good idea. Anything that helps to curb people who get out of control with gambling and end up losing much more than they can afford, even if they are in debt, is a good thing. Although it seems to me that with the ease of credit today the effect will be small. Nowadays many people have a pre-conceded personal that with two clicks on their cell phone they get the money in their account. Or instead of spending the credit card you can spend all the money you have in the casino and then pay the month's expenses with the credit card. I have already said that I think it is positive but it will not be a panacea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 18, 2022, 05:42:39 PM",
      "body": "Quote from: Davidvictorson on November 18, 2022, 02:48:24 PMSportsbet, an Australian betting giant, has said that it will support any move to prohibit the use of credit cards for gambling. The operator said that this type of payment method promoted a “play now, pay later” culture which was detrimental to the well-being of players and consumers. They are very considerate to be willing to support the move to prohibit use of credit cards. very thoughtful as we will not find many betting platforms willing to be in support of such moves.Quote from: Davidvictorson on November 18, 2022, 02:48:24 PMThe problem:Gambling with credit cards is high-risk in nature and could have serious financial consequences.\"Play now, pay later\" culture  is a dangerous culture to cultivate, you will finish any money you are expecting before it even comes. What it means is that you will never be debt free if you let the culture become a part of you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "November 18, 2022, 05:43:44 PM",
      "body": "Quote from: Davidvictorson on November 18, 2022, 02:48:24 PMSportsbet, an Australian betting giant, has said that it will support any move to prohibit the use of credit cards for gambling.It sounds like they're waiting for regulation. What's stopping them from banning creditcards from their site by themselves?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "November 18, 2022, 05:48:00 PM",
      "body": "Quote from: electronicash on November 18, 2022, 03:04:12 PMQuote from: Davidvictorson on November 18, 2022, 02:48:24 PMWhat other solutions can you think of?Read the full news herecrypto. best way and something that can be deposited instantly with the minimum risk. coins are received without the need of 3rd party,credit card users are getting lesser. people are not paying their debts anymore. with so many companies laying off, the credit cards are abused to buy the supplies at least it saved the jobless. they need the supplies. I agree with the suggestion from @electronicash that crypto is a solution for gamblers to play gambling. And even though gamblers can still use a debit card system or transfer method, crypto is still the best because it doesn't work through banks and gamblers can control their spending on gambling.For lottery purchases, they can still use a debit card or transfer as I said before. So there won't be any significant problems for gamblers so they can still bet online. I also don't agree with using a credit card because if we don't have good self-control, we can have problems paying when it's due later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "November 18, 2022, 06:03:32 PM",
      "body": "Ban credit cards directly huh? Nice try but a band aid solution. These regular gamblers will still find a workaround for that. They can buy USDT on an exchange accepting credit cards and send it to a crypto gambling. It's a longer route but still bypasses the restriction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 18, 2022, 06:08:23 PM",
      "body": "Such a bold move by the platform. Usually, these giants are the ones who are always going to say no to any recommendations and/or regulations that might affect their operations and their profits. It's rare to see something as big as them supporting any move to help with the well-being of their players genuinely. Credit cards being accepted in gambling platforms is, IMO, a very negative move because it just promotes more borrowing and less paying for gamblers that are always chasing their losses. Imagine the number of problematic gamblers declining if credit cards are disallowed on such platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LUCKMCFLY",
      "created_time": "November 30, 2022, 05:51:12 PM",
      "body": "I really believe that a government should not get involved in this type of business, the solution that occurs to me is very daring, and quite fresh, but I do not know what the laws are like in Australia, but if that happened in a country like the one in alive, the people and owners of the casino or the platform must seek an audience with the government representative to speak, to negotiate, here a casino is known to be a very good business model, a good agreement can be reached with the government and regulatory entity to let them continue doing what they normally do and with the solution they sought so that everything continues ok, that is what would occur to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "November 30, 2022, 08:52:23 PM",
      "body": "Quote from: Poker Player on November 18, 2022, 05:38:00 PMI think it's a good idea. Anything that helps to curb people who get out of control with gambling and end up losing much more than they can afford, even if they are in debt, is a good thing. Although it seems to me that with the ease of credit today the effect will be small. Nowadays many people have a pre-conceded personal that with two clicks on their cell phone they get the money in their account. Or instead of spending the credit card you can spend all the money you have in the casino and then pay the month's expenses with the credit card. I have already said that I think it is positive but it will not be a panacea.  Not definitely the solution but it will contribute a lot to reducing gambling addiction and keeping them away from heavy debt that will make their finances totally broke. So I’m very optimistic on this proposed solution that it will be very effective in the long run. Using credit card is good when it comes to fund for emergency cases, but definitely not for gambling purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "November 30, 2022, 08:57:46 PM",
      "body": "Quote from: Russlenat on November 30, 2022, 08:52:23 PMQuote from: Poker Player on November 18, 2022, 05:38:00 PMI think it's a good idea. Anything that helps to curb people who get out of control with gambling and end up losing much more than they can afford, even if they are in debt, is a good thing. Although it seems to me that with the ease of credit today the effect will be small. Nowadays many people have a pre-conceded personal that with two clicks on their cell phone they get the money in their account. Or instead of spending the credit card you can spend all the money you have in the casino and then pay the month's expenses with the credit card. I have already said that I think it is positive but it will not be a panacea.  Not definitely the solution but it will contribute a lot to reducing gambling addiction and keeping them away from heavy debt that will make their finances totally broke. So I’m very optimistic on this proposed solution that it will be very effective in the long run. Using credit card is good when it comes to fund for emergency cases, but definitely not for gambling purposes.If credit card users are lots then pretty sure this one would really be having that significant effect since it could really decrease up those numbers of users but for those addicted ones then its not the absolute way for them to stop since there are other ways which they could still really be able to play without using those credit card.They would rather still apply for a loanor would really be making out some balance conversion out of their credit limits which is really that still possible.If they do find out that it is becoming a hugeproblem then why not totally ban out?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 30, 2022, 09:08:56 PM",
      "body": "Quote from: Yogee on November 18, 2022, 06:03:32 PMBan credit cards directly huh? Nice try but a band aid solution. These regular gamblers will still find a workaround for that. They can buy USDT on an exchange accepting credit cards and send it to a crypto gambling. It's a longer route but still bypasses the restriction.Probably this can only be applicable to physical casinos but if we are talking about online here, I agree on this one. Gamblers have to remember the risk of using credit card especially if you are going to use it for your gambling activities, borrowing money for gambling is not good at all. Even if you can pay it on time, you might still experience bigger problem with your credit card, the solution here is more about self-control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "November 30, 2022, 09:16:21 PM",
      "body": "Quote from: Poker Player on November 18, 2022, 05:38:00 PMI think it's a good idea. Anything that helps to curb people who get out of control with gambling and end up losing much more than they can afford, even if they are in debt, is a good thing. Although it seems to me that with the ease of credit today the effect will be small. Nowadays many people have a pre-conceded personal that with two clicks on their cell phone they get the money in their account. Or instead of spending the credit card you can spend all the money you have in the casino and then pay the month's expenses with the credit card. I have already said that I think it is positive but it will not be a panacea.  For me, it could be a good solution but the effect will only be little by little. Prohibiting the use of credit card is profitable not on the part of the gambling casino but on the gambler alone. A lot of gamblers right now are very confident to gamble even with small amount of pocket money because they don’t rely on their cash but more on their credit cards. So this just fit for all gamblers, only spend the amount you have onhand and never gamble relying on debt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "November 30, 2022, 09:22:50 PM",
      "body": "Gamblers will always find a way to get the funds and do gambling, did you know that credit card also have a feature of Cash Advance limit? So the gambler can easily cash out and use it for their gambling activities, this is how greed works. The best solution here is for a credit card company to monitor every transaction of their holders and never allow them to be used on any casinos, but I’m doubting they will do it simply because they are making a lot of money on every transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "November 30, 2022, 09:30:42 PM",
      "body": "Honestly, that's a good solution already to have it remove having like the edge of the sword the credit card users and at the same time gamblers. Having that interest to pay and a loss on them would be hitting them hard for sure. As they remove the credit cards as a payment gateway, they can just have the traditional method of cash or bank transfers plus having bitcoin to be supported by the casinos there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "November 30, 2022, 09:31:57 PM",
      "body": "Quote from: goaldigger on November 30, 2022, 09:08:56 PMQuote from: Yogee on November 18, 2022, 06:03:32 PMBan credit cards directly huh? Nice try but a band aid solution. These regular gamblers will still find a workaround for that. They can buy USDT on an exchange accepting credit cards and send it to a crypto gambling. It's a longer route but still bypasses the restriction.Probably this can only be applicable to physical casinos but if we are talking about online here, I agree on this one. Gamblers have to remember the risk of using credit card especially if you are going to use it for your gambling activities, borrowing money for gambling is not good at all. Even if you can pay it on time, you might still experience bigger problem with your credit card, the solution here is more about self-control. ^Not of all exchanges probably, wallet or exchange platforms are the same, especially if they are centralized exchanges, you are prohibited to link your exchange account or centralized wallet account to any gambling platform. I have done this in my local wallet, they are rejecting any of my transactions that come from the gambling casino. However, they are too many ways to fund your online gambling casino, unlike the off-shore casino. If you can purchase BTC anonymously, this will probably be the best solution ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "November 30, 2022, 09:32:14 PM",
      "body": "Quote from: Johnyz on November 30, 2022, 09:22:50 PMGamblers will always find a way to get the funds and do gambling, did you know that credit card also have a feature of Cash Advance limit? So the gambler can easily cash out and use it for their gambling activities, this is how greed works. The best solution here is for a credit card company to monitor every transaction of their holders and never allow them to be used on any casinos, but I’m doubting they will do it simply because they are making a lot of money on every transactions.Banks would never be considering on having those blockage or prohibitions because spending of your credit limit would always boils or falls down on someones decision which means that they do knowthe terms and conditions which whatever or whenever they do make use of their cards then its their responsibility to pay it up and if not then this is where interest would really be piling up and this is where they do indeed make money and they dont really care if you do spend it out on whatever things as long you do obliged yourself on paying it up.If not then you do really know the consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "November 30, 2022, 09:37:19 PM",
      "body": "Quote from: blockman on November 30, 2022, 09:30:42 PMHonestly, that's a good solution already to have it remove having like the edge of the sword the credit card users and at the same time gamblers. Having that interest to pay and a loss on them would be hitting them hard for sure. As they remove the credit cards as a payment gateway, they can just have the traditional method of cash or bank transfers plus having bitcoin to be supported by the casinos there.This initiative will limit a lot of gamblers that are relying on their credit cards to bet. Maybe, their government has been seeing a lot of problems owed to the usage of credit cards in gambling.Definitely, heavy debts from financial institutions and other related consequences owed to this situation.This will give the option to the gamblers to just use the money what they can afford to lose by using their cash or debit cards.Maybe these credit card companies are also having their hard time getting the payment even if they are getting the interests from these people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}