{
  "id": "topic_5433409",
  "title": "a1dan.lol",
  "author": "a1dan.lol",
  "created_time": "January 07, 2023, 10:47:53 PM",
  "content": "SRVEBTC Crypto Exchanging Made Open-Source BTC[No URL yet, see below] | GitHub | DiscordHow Exchanging WorksSRVE uses other (no KYC/instant/DEX) exchange's APIs (FixedFloat for now) to preform requests on your behalf for privacy or ease-of-use purposes. Here's how a transaction works!You go to SRVE and input an amount -> We return a recieve price for your pair -> You accept the offer -> We use FixedFloat's API (for now) to get a trade ready for you -> We display the amounts and addresses -> We keep you posted along the way about the status of your trade!And it's all baked into a clean UI free from distractions and ads! We're commission free (except for partner exchange fees), and (of course) totally free to use, with no sign up required!It's self-hostable!SRVE is self-hostable, hell yeah! Our GitHub has all the code published for free (and commercial use, though make sure to check exchange partner's guidelines to know if you're allowed to!Check our GitHub to learn how!Funding RequestSRVE is powered by donations since we don't take any fees, and put no ads on our website! Right now, we need funding for a domain!The Important StuffDomain: $0.00/$8.98 -> .exchange domain registration for one year ($0.00/$0.00) -> Hosting (our own hardware, so no donations needed!) Hosting: $0.00/$0.00 -> We have our own infrastructure to host SRVE!Non-essentials & TipsBuy me a coffee: $0.00/$?.?? -> Buy me a coffee! Pay whatever you like  (all coffee donations will go to the domain until everything is paid for)How to donate/tipBTC: bc1qt4ujf6ne52457ye3v7un4pu2y4t0pvx9gnj585ETH (ETH Network, ERC20): 0xD22f1D2Fd6fBd70F99eE70a5a244bF8D59c331EALTC: LMQT7hfRBzDWZWAwnh7anoD5Zt73jSnzm5 SOL: s6oVrxDWaa9oNeC5a7PHMyhdsZBKx2yrKB7GqSfKk79",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433409",
  "comments": [
    {
      "author": "a1dan.lol",
      "created_time": "January 08, 2023, 11:35:21 PM",
      "body": "This is a bump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}