{
  "id": "topic_5465768",
  "title": "Magic-Maker-40",
  "author": "Magic-Maker-40",
  "created_time": "September 05, 2023, 03:39:09 PM",
  "content": "Cryptocurrency: Cryptocurrency is a digital form of currency that not controlled by any government or any central authority.In crypto, there is a high rate of return as compared to the real-estate. Cryptocurrency is decentralized (not controlled by any authority or any government). In crypto, u can trade at any time according to the condition of the market you can trade for a long or short period of time. As you wish. But in crypto, the price can swing at any time because any good or bad news is able to change the game.Real-estate:Real estate investors are those who purchase property to make profit. They buy residential, commercial or invest through funds. They make money when the value of the money over time increases.  Real estate provides us with a physical asset that can provide us security and stability as compared to cryptocurrency. Real estate property has high potential as compared to crypto to increase its value after a period of time.Which one do you prefer?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465768",
  "comments": [
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "September 05, 2023, 03:55:46 PM",
      "body": "Quote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PMCryptocurrency: Cryptocurrency is a digital form of currency that not controlled by any government or any central authority.In crypto, there is a high rate of return as compared to the real-estate. Cryptocurrency is decentralized (not controlled by any authority or any government). In crypto, u can trade at any time according to the condition of the market you can trade for a long or short period of time. As you wish. But in crypto, the price can swing at any time because any good or bad news is able to change the game.Real-estate:Real estate investors are those who purchase property to make profit. They buy residential, commercial or invest through funds. They make money when the value of the money over time increases.  Real estate provides us with a physical asset that can provide us security and stability as compared to cryptocurrency. Real estate property has high potential as compared to crypto to increase its value after a period of time.Which one do you prefer? At the end of it all, your conclusion is to ask which one do we prefer between the two, i will choose bitcoin in cryptocurrency, secondly don't think that the two available option has one a the good and the other as the bad, they bare both profitable and just that their nature of being used are different, real estate is capital intensive while bitcoin is not capital intensive, real estate is also centralized while bitcoin in cryptocurrency is decentralized, but they have the similarity of being profitable with time and between the two, i will always go for bitcoin as long as the opportunity remains there to choose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 05, 2023, 03:58:06 PM",
      "body": "Well I do not not see anything wrong with real estate as it has proven to be a good investment opportunity. However, making this comparison in a Bitcoin forum actually seem out of place and shows lack of faith on your side. Nevertheless, if I am to give my opinion, I feel more comfortable with Bitcoin given the ease, comfort, little startup capital and huge profit potential it holds. In addition, the risk in Bitcoin is relatively low compared to real estate as one is completely in control of his investment without any interference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "September 05, 2023, 04:21:14 PM",
      "body": "Everyone will go for which one suit him or her the most, and what also is in line with their believe, so if are to talk about it base on comparisons I believe most people will choose crypto over real estate as crypto might appear to have a higher chances of given back profits than that of real estate, when it comes to security, and experience, I think one will make his choice base on the one he have the most common experience and interest on. Both form of investment are good, if am to make a choice I will choose that of crypto investment but this will have to be base on which crypto that have been presented to me to choose from, and the real estate if am to invest on real estate, I will consider such form investment as the type that I might enjoy my profit base on which time the land of the estate where it’s situated at is developed, because the more the area is developed the more people will want to get a property from their the higher the chances of you having a good profit will present it self. Quote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PMCryptocurrency is decentralized (not controlled by any authority or any government).Please be guided that it’s not all crypto currency that are decentralized, in fact more than 90% of 10,000 coins/tokens (according to coingecko) which we have is entirely centralized, most of them said they are decentralized but they are far from it as the developers and project owners have total control over them, Bitcoin is the only digital currency among few others which is decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 05, 2023, 04:36:36 PM",
      "body": "Quote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PM Real estate property has high potential as compared to crypto to increase its value after a period of time.Which one do you prefer?  You are right in mentioning that real estate has the potential to accrue over a long period of time as compared against Bitcoin which has a fixed number of 21million,  But remember that a land ceases to be yours after 99years and whether you like it or not, if a government of the day decides one morning that the land looks to be obstructing pedestrian way or they want to use that place for something else, it can be demolished the next day with little to sometimes nothing as compensation. Or, the land can be a swampy area. Everyone has his or her preference but if I were choose, I'd go for crypto investment. There's no business that's without risk, bit I'd rather have my privacy maintained when trying to conduct a transaction, than have myself be the puppet of the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 05, 2023, 04:38:57 PM",
      "body": "Personally, crypto simply before I am of a young age and I'm not ready to go a bit more 'safe' yet. But someday, of course I will need to allocate a good chunk of my portfolio into real estate to secure myself a bit. It doesn't make any sense for 90% of people to be all in on crypto if he/she already has a family to feed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 05, 2023, 04:41:08 PM",
      "body": "If you have $200, you can invest in bitcoin. Can you have $200 and invest on real estate? That is not possible. Bitcoin gives the opportunity to many people to invest, even with small amount of money.If you are comparing crypto (I am not referring to bitcoin), know that I will choose real estate instead because cryptos nowadays with the advent of ICOs have become a ponzi scheme, a place of scammers breeding with DeFi and other malicious ways. If I have huge amount of money, I will diversity and invest in just bitcoin and real estate and land. If I have small amount of money, I will go for only bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "September 05, 2023, 04:43:18 PM",
      "body": "Quote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PMWhich one do you prefer? Real Estate requires huge capital in able to acquire one and earn a decent profit through renting or flipping it. If I would have a capital that is sufficient to be involved in rel estate investment then I will go for it since it’s less volatile while the return is good.Considering my current finances makes me choose crypto over real estate since I can huge percentage out of my small capital with good crypto investment which I can do on real estate. Simply, crypto is for small to medium size investors that’s why common people will choose it like me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "September 05, 2023, 04:48:59 PM",
      "body": "Quote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PMWhich one do you prefer? In light of this comparison Although cryptocurrency is equally interested in the potential for profit, I will choose real estate over cryptocurrency because of its security and potential. Still, both have advantages and disadvantages. For example, with real estate, you cannot access your funds whenever you please because you might have to sell your home for a low price to raise cash quickly, whereas with cryptocurrency investments, you can do as you please with your money, though I warn you that by the time you need it, the market may have fallen and there will be no way for you to make up the difference. Given that both have gains and losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartgoat",
      "created_time": "September 05, 2023, 04:51:53 PM",
      "body": "Quote from: Aanuoluwatofunmi on September 05, 2023, 03:55:46 PMQuote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PMCryptocurrency: Cryptocurrency is a digital form of currency that not controlled by any government or any central authority.In crypto, there is a high rate of return as compared to the real-estate. Cryptocurrency is decentralized (not controlled by any authority or any government). In crypto, u can trade at any time according to the condition of the market you can trade for a long or short period of time. As you wish. But in crypto, the price can swing at any time because any good or bad news is able to change the game.Real-estate:Real estate investors are those who purchase property to make profit. They buy residential, commercial or invest through funds. They make money when the value of the money over time increases.  Real estate provides us with a physical asset that can provide us security and stability as compared to cryptocurrency. Real estate property has high potential as compared to crypto to increase its value after a period of time.Which one do you prefer? At the end of it all, your conclusion is to ask which one do we prefer between the two, i will choose bitcoin in cryptocurrency, secondly don't think that the two available option has one a the good and the other as the bad, they bare both profitable and just that their nature of being used are different, real estate is capital intensive while bitcoin is not capital intensive, real estate is also centralized while bitcoin in cryptocurrency is decentralized, but they have the similarity of being profitable with time and between the two, i will always go for bitcoin as long as the opportunity remains there to choose.  base on the comperisim, the both are very good if someone wants to invest in any of them. but for me, I will go for crypto that's have more sucure than real estate. cryptocurrency is more sucure than real estate, and also give hug profit too. I wouldn't want something that will give me much stressed. which I know real estate will do. As for me, I prefer crypto than real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magic-Maker-40",
      "created_time": "September 05, 2023, 04:56:07 PM",
      "body": "Quote from: Majestic-milf on September 05, 2023, 04:36:36 PMQuote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PM Real estate property has high potential as compared to crypto to increase its value after a period of time.Which one do you prefer?  You are right in mentioning that real estate has the potential to accrue over a long period of time as compared against Bitcoin which has a fixed number of 21million,  But remember that a land ceases to be yours after 99years and whether you like it or not, if a government of the day decides one morning that the land looks to be obstructing pedestrian way or they want to use that place for something else, it can be demolished the next day with little to sometimes nothing as compensation. Or, the land can be a swampy area. Everyone has his or her preference but if I were choose, I'd go for crypto investment. There's no business that's without risk, bit I'd rather have my privacy maintained when trying to conduct a transaction, than have myself be the puppet of the government.but on the other side that's also possible, The government banned cryptocurrency to remove corruption from the country because it's easy to store black money and no one knows about that. 99 years is a long time who cares about it because no one knows what will happen to him in future?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "September 05, 2023, 04:56:55 PM",
      "body": "Quote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PM~snipI think real estate is overpriced. It doesn't increase in value over time as much as crypto currencies (not all crypto currencies). Most often, real estate becomes more expensive in the national currency, and slightly more expensive in dollars. In fact, growth is not high. Real estate shows good growth only if you guess with the location in which the property is located, the infrastructure around which will be strongly developed, but it is more like a lottery if you don't have insider information in the city administration or the developer. About developers. They make the best money on real estate, not the so-called real estate investors who buy and resell it.Crypto has a much higher growth potential than real estate, not to mention other important nuances, such as high liquidity, mobility and compactness - autonomy (you will not move property to another country), and also, no one will know about the existence of crypto (if you don’t tell), which means it won’t be able to take it away, and local conflicts or natural disasters will not leave you poor after buying real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "September 05, 2023, 04:57:29 PM",
      "body": "If you are still young and just starting to invest for sure crypto would be suitable since it's connected to the technology and internet since almost the generation today are involved in using techs. And if you're old enough you would find investing at real state much better since owning a land would literally give you wide options for passive incomes or you can just sell it once it doubles the price since every year house and lot price increases. For me, I would choose crypto for now since it's helping me to get money sources by just investing here without the hassle of papers, bills and registration since its decentralized. But once I have the money, I would literally choose real estate cause owning a land is a big deal here in my country especially the big one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 05, 2023, 05:03:50 PM",
      "body": "Both have their own features and advantages. But if you ask me then, I would love to diversify my investments, hence if I have option, then I will choose both. If you ask me for one, then obviously Bitcoins over the Real Estate. Bitcoins allow us to control our finances completely and in Bitcoin investments, there is no interference of the government. Whereas for real estate investment, you have to follow certain rules, pay unnecessary taxes and the government will monitor you. This is the main reason why I would stick with crypto investments personally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magic-Maker-40",
      "created_time": "September 05, 2023, 05:05:08 PM",
      "body": "Quote from: m2017 on September 05, 2023, 04:56:55 PMQuote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PM~snipI think real estate is overpriced. It doesn't increase in value over time as much as crypto currencies (not all crypto currencies). Most often, real estate becomes more expensive in the national currency, and slightly more expensive in dollars. In fact, growth is not high. Real estate shows good growth only if you guess with the location in which the property is located, the infrastructure around which will be strongly developed, but it is more like a lottery if you don't have insider information in the city administration or the developer. About developers. They make the best money on real estate, not the so-called real estate investors who buy and resell it.Crypto has a much higher growth potential than real estate, not to mention other important nuances, such as high liquidity, mobility and compactness - autonomy (you will not move property to another country), and also, no one will know about the existence of crypto (if you don’t tell), which means it won’t be able to take it away, and local conflicts or natural disasters will not leave you poor after buying real estate.You are absolutely right sir We can't take it away But you can move to other countries after selling your property",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "September 05, 2023, 05:50:28 PM",
      "body": "What does one have to do with the other? These are two ENITRELY different things, and should be viewed as such.  A proper financial portfolio should be one that is diversified.  Real Estate can be good for making passive income, or simply buying a home to live in versus renting can be a way to build equity.  Bitcoin is a digital currency.  It's also inherently NOT an investment.Just like the \"gold vs bitcoin\" debate. Two entirely different things. Diversification is the name of the game. Period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "September 05, 2023, 06:25:40 PM",
      "body": "Both of them are important investment that one needs to diversify to. One of them is easy to start and needs little capital. Bitcoin is the most important of the two,because both rich and poor can invest in bitcoin and make profit from it when hodli. It has high volatile nature and this makes it to yield more profit compare to real estate within the same period of time.Real estate needs large capital to invest in and the location of the property is what will determine how profitable it will be. You will also keep maintaining the property,time to time,which will involve more expenses. Bitcoin don't need any maintenance but just DCA to accumulate more. I will prefer my bitcoin portfolio first and use my profit to invest in real estate after I have reached my bitcoin target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 05, 2023, 06:26:01 PM",
      "body": "Quote from: Magic-Maker-40 on September 05, 2023, 03:39:09 PMWhich one do you prefer? I'll choose real estate over any altcoin.But between real estate and BTC, if you have money you can diversify by buying the two of them, there is no reason to buy only one when you can split the money and buy the two of them. For me, i cannot afford real estate right now as it is expensive, but for BTC i can buy little amounts gradually whenever i want to. Real estate is a less risky investment compared to BTC, so if i had the money i'll split my investment 50/50 and have the both of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "September 05, 2023, 06:36:43 PM",
      "body": "If you have the money why not do both? Or diversify.Not everyone can afford this Real estate investment it takes a lot of money to do it while we are here at the middle to lower stage which means that only small investments can be made for example in bitcoin with you have only $10 you can have bitcoin.Who doesn't have goals with real estate in the future? I am still collecting a profit from bitcoin if it is right to get maybe as a profit will be moved to real estate of course I will not leave bitcoin as another investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "September 05, 2023, 06:50:21 PM",
      "body": "I love both because they are an asset class so wouldn't like to miss investment in any of the two Assets, If you have made a huge amount of money, real estate is an investment option to store some of your funds for future growth, while Bitcoin is an investment opportunity for everyone, both the rich and the poor, basically its \"inclusiveness\" is one distinctive thing about Bitcoin that also makes it attractive for investors. Too, when it comes to performance over time, Bitcoin beats real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}