{
  "id": "topic_5432996",
  "title": "Marykeller",
  "author": "Marykeller",
  "created_time": "January 04, 2023, 01:45:54 PM",
  "content": "After Nigeria independence in 1960, the first people wey rule Nigeria then na the youths between the age of 27-35years. That time the youths were they ones wey d in charge and na them d take decision and talk wetin go happen for the country then although na military regime that time. If una come check now, una go find out those people wey rule Nigeria that time in their 30's are still controlling and leading Nigeria till now. wey be sae dem no wan give the youths the mantle of leadership. wey be sae during their time na them d rule as youths and presently d wan d rule us wey be youths d go. Una see as the matter be so, as d wan continue to d do us shege d go.Presently now, the economy of the country don turn many of the youths to be unemployed, for them not to be able to provide for themselves even for their family join. you go see 40years old man not married and still dependent on his parents for survival. if you come manage the successful as a youths, government or society go tag u as yahoo boi, based on u no fit d successful as a youth for the country due to the know how d country hard reach for you to be successful as a youth.if to sae we d follow history we supposed know sae Obasanjo, Nnamdi Ezikiwe, Gowon, Ojukwu rule Nigeria at their youthful age at 30's. But in today realities youths are been used by old politicials to carry out their evil plans during election.This is a wake up call for Nigeria youths during this election. Make we vote for the right candidate wey get a youthful energy for em body. Make we all know sae our future go be better than whatever decision we make today if we kukuma work harder and put things for perspective for our future",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432996",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "January 04, 2023, 02:36:07 PM",
      "body": "Wetin u talk make sense, na d time wey youth suppose take d mantle of leadership. But 4 naija, e no go dey easy like that, even d so-called youth no dey serious, dem be a betrayal of themselves, if dem see moni like dis, their wahala don finish. D task go hard bcos Poverty don eat deep 4 Niaja, and e don born corruption among d youth, so fighting for ourselves go hard even if some try 4 beta intention.Youths wey won do am self no get d popularity, resources/money to do Naija politics, na make we dey look tins as e be like dis jare. Maybe if Obi fit enta, d political space go dey better, I no know. But d youth wey get moni and aluta spirit na dem fit reach there for high risk, how many of dem u don see?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "January 04, 2023, 04:43:24 PM",
      "body": "Quote from: Marykeller on January 04, 2023, 01:45:54 PMAfter Nigeria independence in 1960, the first people wey rule Nigeria then na the youths between the age of 27-35years. That time the youths were they ones wey d in charge and na them d take decision and talk wetin go happen for the country then although na military regime that time. If una come check now, una go find out those people wey rule Nigeria that time in their 30's are still controlling and leading Nigeria till now. wey be sae dem no wan give the youths the mantle of leadership. wey be sae during their time na them d rule as youths and presently d wan d rule us wey be youths d go. Una see as the matter be so, as d wan continue to d do us shege d go.Presently now, the economy of the country don turn many of the youths to be unemployed, for them not to be able to provide for themselves even for their family join. you go see 40years old man not married and still dependent on his parents for survival. if you come manage the successful as a youths, government or society go tag u as yahoo boi, based on u no fit d successful as a youth for the country due to the know how d country hard reach for you to be successful as a youth.if to sae we d follow history we supposed know sae Obasanjo, Nnamdi Ezikiwe, Gowon, Ojukwu rule Nigeria at their youthful age at 30's. But in today realities youths are been used by old politicials to carry out their evil plans during election.This is a wake up call for Nigeria youths during this election. Make we vote for the right candidate wey get a youthful energy for em body. Make we all know sae our future go be better than whatever decision we make today if we kukuma work harder and put things for perspective for our futureWell i wont say their is no sense in what you are trying to highlight because ever since our problems began as a  nation we have been ruled by this old men that have drag the our country into economic instability and crisis in all sectors of the government. But the nations current situation is not only crowned to the fact that our leaders are old, a young and vibrant leader like you said can also put the nation into more problems so far as the individual is having the wrong mindset towards the country and being a great leader also is determined by your cabinet members and  we all know even the man with good intentions is still painted black because of the corruptful mind of his cabinet. So everything and everyone in Nigeria currently needs to participate in terms of making things right in country and i pray that we all change from our corruptful ways and always think positive and straight towards making the country a better place for both the youths and even the adults and elderly. Nigeria currently now is on a crucial stage because any decisions made will determine the faith of the country either for good or for worse. So i would just urge very Nigerians to be very cautious of the future not today and vote the right person they feel can move the nation forward and not backwards. Forget about the money and yes the youth should wake up from their deep slumber and stop fighting and killing for those greedy politicians and think of how we can make Nigeria a better place for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "January 04, 2023, 05:33:31 PM",
      "body": "Op God will bless u for these thread I think these is the best time wey Nigerian youths go they wise and vote for better person because 70% of people wey no get job in this naija na youth then bii so make we they wise and choose good leader the country",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "January 04, 2023, 08:29:25 PM",
      "body": "Quote from: Marykeller on January 04, 2023, 01:45:54 PMAfter Nigeria independence in 1960, the first people wey rule Nigeria then na the youths between the age of 27-35years. That time the youths were they ones wey d in charge and na them d take decision and talk wetin go happen for the country then although na military regime that time. No be lie u talk. Sometime ago, I watch one documentary of d whole independence somtin nd e go shock u d ages way all these men bin dey wen dem come into power. Dem bin dey vry young nd d leadership was good not until, dem start to identify say, power get anode somtin way follo 4 bodi. As dem don taste am, dem no wan leave am again. E jst bad!We need taste youth leadership again 4 dis country. Some set of ppl nd age grade mo need dey hold dis tin 4 hand as though, na dem sabi pass, na there own or dem get a define line 4 certain understanding on leadership qualities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "January 04, 2023, 09:18:09 PM",
      "body": "Everything wey you yarn for here now dey correct my brother. Dis na wake up call for us and we gats stand on the mandate of making the country a resourceful place for us all. Much don happen and still dey happen, we no suppose still dey fold our hands dey watch dey go. Our activeness for dis election period go help us make things better, hope we get d best change dis time around for the prosperity of the nation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "January 05, 2023, 01:51:46 PM",
      "body": "I like the way the youths dey really take this things upon themselves but most times the major problem we dey get na with the security agencies wey just dey after taking instructions without considering the consequences trying to please their leader.This matter make me dey remember October 2020 when the shooting and killings was so open and uptill now nothing has been done about those killings and now those leaders are also coming out for some political positions and it seems we have forgotten about everything that happened then and now we are talking about another election, what a bloody country.One of the major reasons I feel say dey deprive tye your for coming out for political positions is fear of the unknown and finance.With this two reasons I think the youths are already crippled and only hopeful and most times we youth don't know how to use power and I could also remember a house of rep member who slapped a pregnant woman in a supermarket and I think we youths just have to be ready to be accountable for every actions and consequences of every action we take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "January 05, 2023, 05:10:06 PM",
      "body": "Thank you my brother you use sense talk better as nigeria youth wey you be and you also know your right for the country and base on the matter wey you talk now ehn we get you and we go show them shege say na we the youth get power for the country because no matter waiting go happen for the country now the youth must attend to issues, so as he stands now make we try to get pvc because na the Main thing be that because some of the youth base on say they don see shege dey no wan do pvc, abeg as youth wey we be make we try do pvc make we vote for better person wey go change our lifes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartCharpa",
      "created_time": "January 06, 2023, 03:41:47 PM",
      "body": "Waiting them dey think for this country politics na for an old age not for the youths that's why dem no want to give any youth to become a leader and make things easy mostly now  before you see any youth to become a leader him family member most be among the politics wey go do ojoro for am, we have to shine our eyes if we still not vote for the right person we are going to suffer for another good 8 years, na we go choose better person and make things better for this country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "January 07, 2023, 01:21:35 PM",
      "body": "Wetin I know be say Dem no dey tell person, person go learn lesson. As you rightly state, the first president of naija, Nnamdi Azikiwe was a youth and from the litter history we fit gather about am, na person wey try e best to not allow the Western ways, propaganda and manifestos sway am despite say nah their im do him education.  Sorry to say but at present, a naija youth dey more concerned about the financial benefits wey go dey attached if given opportunity to enter power and I feel say doz our fadas Dem wey dey seat no go wan give up easily as e be like say no serious tin fit come out. For radio today, I hear wan youth dey boldly say e go collect in exchange for im vote if one of dis old daddies wet im pocket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "January 07, 2023, 08:26:45 PM",
      "body": "if we settle down look this matter you get point, but nigeria of that time no be waiting we get now bwe that, the way this people they now It will be difficult for a youth to become president one election now ba thing of money how many people actually get money to buy the ticket talk more of the campaigning and the rest, it is going to be more difficult than you expected, with time we hope things can change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "January 07, 2023, 10:46:43 PM",
      "body": "Youths for Nigeria na dem don sell their right of leadership give these old men wey come turn am to their family right. After the Military Regime wey Obasanjo win na that time the youths suppose to start to ginger but fear say I no won die,I won enjoy life,I never marry,I never born pikin e.t.c make we look this old men turn this country upside down. Obi na the man wey go fit help this country small,so make we go vote am and counsel those political thugs on the leadership of youth government instead of them to dey gamble with their future. No be to buy form,people dey wey fit sponsor elections.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "January 08, 2023, 11:14:31 AM",
      "body": "Quote from: Marykeller on January 04, 2023, 01:45:54 PMThis is a wake up call for Nigeria youths during this election. Make we vote for the right candidate wey get a youthful energy for em body. Make we all know sae our future go be better than whatever decision we make today if we kukuma work harder and put things for perspective for our futureIf we really wan wake up the youth then we no suppose dey suggest Peter obi as candidate to them to vote. Peter obi isn't a youth, he's 61 years officially and who knows if that age has been faked or not as 90% of Nigerians no dey use their real age. The faking dey start from university days so dem go dey longer for government work wey Politics na also one of them. This election isn't about youthfulness because if na him none of the 3 top candidate qualified. We go fight for youth president later and make the youth start they put interest so we go get them plenty and get option to choice from instead of falling back to who we think is closest to a youth. That year wey this youths rule, nobody give them na dem stand up fight for am so if we want the same thing then make we stand up our own and fight for it .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 08, 2023, 10:06:22 PM",
      "body": "At this point of our country. Every youth gats wise up for this country because normally we done too suffer, These old politicians no they carry our matter for mind, them no reason us o, weda we dey suffer or not, they just dey after there personal interest, Now e no go be business as usual, wey we dey sit down for house watch movie on election Day, with the mindset say our votes no go count, This time we gats ready come out vote for the candidate wey we know say e go move our country forward, no sell your vote for peanuts, becos na another 8 years of suffering be that,  make we vote who fit move this our country forward so things go better for all of us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "January 09, 2023, 12:03:07 AM",
      "body": "For this naija I no sure say that line wey them say \"we are the leaders of tomorrow\" e still dy oh because if you check am well the youth dy even find am hard to see for chop self, after you manage escape school finish work self you no go see, tell me why some youth wey hungry and depression don scatter there brain-box no go accept to do dirsty job for politicians all in the name of to get the least #1500 make them take sustain?The matter wey we dy try discuss here no be come chop oh, we youth wey think say e go better tomorrow don give up that hope oh, I mean some youth. No matter how we youths wake up reach e still get some youth wey never ready to wake up because that bad side still dy itch them for head, for person to tell me say make I just go stand for one line say the least #500 go reach me for my own thumb printing too, ah, nah sell I sell myself if I try am oh. This contri difficult like video game wey them put for VERY HARD oh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "January 09, 2023, 08:52:24 AM",
      "body": "Op this matter you brought up really make me think tins plenty. Na a better tin to they see youth they rule ooo, and we need seriously to wake on top that matter to fight for the opportunity. but my question is that will that solve our problems in this country? The Youths of nowadays are not like  those youths that rule doing the military region, and infact na military region they were, where military control and do whatever they wish.many youth of nowadays are so eager to make it make it at once, so many of them have failed the opportunity given them from ground.Many youth have been given opportunity but they fuckup due to their selfishness.let make dimeji bankole for example he was given opportunity once to become speaker of house of representatives but last last he fuck up by involving in fraud. Many cases like this done happen for even my local government.they always miss uses the little opportunity they get from masses. The mean thing make just vote for the right person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "January 09, 2023, 07:25:19 PM",
      "body": "Quote from: CryptopreneurBrainboss on January 08, 2023, 11:14:31 AMQuote from: Marykeller on January 04, 2023, 01:45:54 PMThis is a wake up call for Nigeria youths during this election. Make we vote for the right candidate wey get a youthful energy for em body. Make we all know sae our future go be better than whatever decision we make today if we kukuma work harder and put things for perspective for our futureIf we really wan wake up the youth then we no suppose dey suggest Peter obi as candidate to them to vote. Peter obi isn't a youth, he's 61 years officially and who knows if that age has been faked or not as 90% of Nigerians no dey use their real age. The faking dey start from university days so dem go dey longer for government work wey Politics na also one of them. This election isn't about youthfulness because if na him none of the 3 top candidate qualified. We go fight for youth president later and make the youth start they put interest so we go get them plenty and get option to choice from instead of falling back to who we think is closest to a youth. That year wey this youths rule, nobody give them na dem stand up fight for am so if we want the same thing then make we stand up our own and fight for it . Boss sorry ooWe no dey support Obi because him be youth but we dey put for front because na him dey trusted and educated among those three old men, basically e get some things wey boiz dey want make him go, but wetin i noticed be say this old men no gree removed hands make youth take over why because dem believe say if we take over nothing for them again and some people take as in heritage, weda we like it or not dem must be president, oya think wetin this kind person dey talk and if e happened say him go now wetin you think say we go be for him eyes, and besides dem never really give us chance to rule for this we country rather na only one sets of people dey always rules abi we no follow this we country again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "January 09, 2023, 08:00:33 PM",
      "body": "Quote from: Marykeller on January 04, 2023, 01:45:54 PMThis is a wake up call for Nigeria youths during this election. Make we vote for the right candidate wey get a youthful energy for em body. Make we all know sae our future go be better than whatever decision we make today if we kukuma work harder and put things for perspective for our futureAs I read this thin, my bodi weak because we youths don too give dis old men time to de rule us anyhow.For School, dem de tell us we be leaders of tomorrow, but people wey dey since yesterday never leave space for people wey de today talk less of us we go de expect to lead tomorrow.We really need to wake up and make decisions ourselves, because the way d way technology don advanced, na we youths know how we go take move dis country go another level because all dose advance countries na youth de lead dem, so for we to move go were people de go na to follow who know road, therefore we need to wake up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 09, 2023, 09:31:08 PM",
      "body": "Due to the military regime as of then, there was even fear among the leaders of then, and they obeyed the laws because if they neglected the law, they would face penalties ASAP. For example, even Obasanjo was a prisoner before Leta became president after his sentence was completed.After the military regime, things were still much better, but as time went on, things changed, and up until now, corruption, looting of money, and killing are at high rates.One problem I see with Nigerian politicians is godfatherism, which makes the leaders misbehave most of the time. The problem of Nigeria triggered by the leaders mindset can equally affects the youths because if they possibly attain power, they are going to have their own selfish interests too.Pet Obi is going to have the majority of votes; I pray he wins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 10, 2023, 06:56:47 PM",
      "body": "We no supposed they fear for our rights o, this is our country and together we will take it back.Gone are the days the military ruled us and our rights were violated, now Wil are in a democratic government with a constitution to back up our rights and civil responsibilities.This is our father land it's for the youths, the children and adults not for a particular set of people that have been in power recycling themselves.This election is a different one and I know Nigeria youths will rise and make their votes count.Voting competence over party factor. Voting a man that can pilot the affairs of this country not minding his tribe or religion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}