{
  "id": "topic_5479281",
  "title": "ColdLava40",
  "author": "ColdLava40",
  "created_time": "December 26, 2023, 01:55:42 AM",
  "content": "Good day, distinguished crypto enthusiasts on this forum, and a Merry Christmas to those who celebrate.Recently, HODL has been running through my mind, and I definitely understand that most people consider it to be the way forward when planning on investing in Bitcoin. It is a method that can amount to good profit, especially when the period of holding is lengthy.As 2024 approaches, two major events awaits us: The Bitcoin spot ETF approval and Bitcoin halving, respectively. with the occurrence of these two events, there is certainty that the market would be affected in positive ways, thereby seeing impressive pumps. The situation might also go the other way where the unexpected might happen. Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.Thanks for your time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5479281",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "December 26, 2023, 02:23:32 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AMGood day, distinguished crypto enthusiasts on this forum, and a Merry Christmas to those who celebrate.Recently, HODL has been running through my mind, and I definitely understand that most people consider it to be the way forward when planning on investing in Bitcoin. It is a method that can amount to good profit, especially when the period of holding is lengthy.As 2024 approaches, two major events awaits us: The Bitcoin spot ETF approval and Bitcoin halving, respectively. with the occurrence of these two events, there is certainty that the market would be affected in positive ways, thereby seeing impressive pumps. The situation might also go the other way where the unexpected might happen. Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.Thanks for your time.interesting question.I think it depends on how long thy have hodled and at what price they got in.  Finally what do we go up to.Lets say you purchased 10 coins in 2017 at 10K around dec 1st of 2017.I think if EFT comes and we go to 200k those holders may dump 1 to 3 coinsbut if you grabbed 10 coins in 2021 at 65k  and we go to 200 k they would sell 4-5 coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "December 26, 2023, 02:25:02 AM",
      "body": "If you are a hodler, you will not mind too much about the coming decision announcement from SEC. for many Bitcoin Spot ETF applications.If you are a hodler, you will hold your bitcoin longer than 2024 halving and will not only hold it to take profit in 2025 bull run.Because as a vision of hodler, you know well about Bitcoin's Controlled supply and How is the 21 million Bitcoin cap defined and enforced?You know that you have big advantage with those knowledge than newbies who only join this market this year or next two years and even don't know about those things. The rest is practice to help you convert this advantage to profit.Can you do it by HODL?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 26, 2023, 02:33:04 AM",
      "body": "I don't know about the majority of the Bitcoin hodlers, but I might be cashing out some. I am actually in need of cash. I'm slowly drained of money. Most of my savings are in Bitcoin, and I can't just use it to support my needs. I'm a hodler. I've been holding on to my Bitcoin through the best in 2017 and the worst in 2018, the best in 2021 and the worst in 2022. I've, of course, made small conversions, but the biggest slice has always been kept for hodling. Of what point would my Bitcoin be if I can't enjoy it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "December 26, 2023, 02:38:58 AM",
      "body": "The talk about ETFs is really buzzing, but getting the green light from the SEC soon is no easy. I'm still pretty sure that getting approval for a BTC ETF won't be a piece of cake, which is why so many companies are trying to get the thumbs up. It's not going to trigger a bull run anytime soon. We might just see some price ups and downs because news about ETFs can swing both ways .... positive and negative. The market will quickly react to that, causing prices to change in a snap.Now, the halving is the most interesting part. Even though it's expected to happen in 2024, the bull run and ATH are likely to hit in 2025. That's based on the history of previous halvings. With this four-year BTC cycle looking like a template, a lot of folks don't want to miss out if the next halving sets a new ATH. No guarantees, but many believe.... Wait and see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "December 26, 2023, 02:48:07 AM",
      "body": "I am sure that once we can see Bitcoin's dollar equivalent can go beyond the previous ATH, there is always that temptation for holders to cash out and enjoy the fruits of the waiting game they pursued. Of course, there will be others who might think that there can be more growth for BTC - maybe even one day reaching more than a million dollar in price - so they continually hold on to their portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "December 26, 2023, 02:49:07 AM",
      "body": "Quote from: Darker45 on December 26, 2023, 02:33:04 AMI don't know about the majority of the Bitcoin hodlers, but I might be cashing out some. I am actually in need of cash. I'm slowly drained of money. Most of my savings are in Bitcoin, and I can't just use it to support my needs. I'm a hodler. I've been holding on to my Bitcoin through the best in 2017 and the worst in 2018, the best in 2021 and the worst in 2022. I've, of course, made small conversions, but the biggest slice has always been kept for hodling. Of what point would my Bitcoin be if I can't enjoy it?That's what you should do and I don't think it's wrong to ostracize or be weirded out when someone's trying to sell a part of their investment in bitcoin because that's what you should do anyway when you're investing into something, you enjoy it while still gathering profit out of hodling you bitcoins. You should prioritize solving your problems using bitcoin instead of just letting it sit all alone in your wallet somewhere waiting for the right time because that's never gonna arrive and in the end you'll regret not selling some when the prices are going up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "December 26, 2023, 02:56:21 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AM Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.Thanks for your time.This depends on each investor, no two people are the same because each person will have a different plan and goal. There will be some people who will be tempted to see a spike in bitcoin prices and sell early, but there will also be those who will stick to their original plan and will only sell when their goal is achieved. Personally, even though my investment is making a decent profit, my goal is to sell during the upcoming bull season, not now. So if bitcoin hits $50k that's not my goal either, so I'm not really interested in selling now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "December 26, 2023, 03:32:25 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AM Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.Thanks for your time.You will not get the same answer from all hodlers because every investor has their peculiar plans. Some have made a lot of profit and will want to cash out to take care of some needs, while others might want to keep the coin until another halving period. Me, I am new in the buy Bitcoin space and this is my first halving but I have read that the bull run will happen sometime in early 2025. Which means I have to wait for another year to make my decision. I have a dream of diversifying my sources of income by starting a business. Which entails that I might consider selling the little I have to invest in a business. I believe that Bitcoin price will keep going high, so I still have plans to buy Bitcoin with the profits I will make from my business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "December 26, 2023, 03:47:11 AM",
      "body": "Quote from: Smack That Ace on December 26, 2023, 02:56:21 AMPersonally, even though my investment is making a decent profit, my goal is to sell during the upcoming bull season, not now. So if bitcoin hits $50k that's not my goal either, so I'm not really interested in selling now.You should have a plan for when you let some go. Because I thought about releasing some BTC when ATH occurred. There's a price target I want to hit, and I'll let go of that much. The reason is because I will try to buy again when a deep correction occurs. Indeed, the temptation of price is always there. Mentality and discipline are the keys to success for a holder. So we have to know when to let go. Because I read a lot of traders who can buy low prices but don't have a selling target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "December 26, 2023, 03:49:49 AM",
      "body": "Ultimately I will spend if it reached my ATH prices target, I can't do anything else to enjoy it except exchange to cash(bitcoin is not allowed as a means of payment). At that point I probably would have said, \"fuck HODL, let me just start over next bear season\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "December 26, 2023, 05:40:20 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AM Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.If you check the price of bitcoin from the past, you will know that there are times that are just bear market. If there would be bear market that will override the bull market, that would be in 2026. That is the time many bitcoin holders will sell after making several profits. Although some holders will not sell all their coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 26, 2023, 05:42:48 AM",
      "body": "If you look at those charts which shows the amount of old UTXO you will see that during a strong bull market they usually sell very early. And during market panic they also seem to be active.I am talking about those that haven’t moved their coins in 2,5,10 years or so. They usually sell at the worst time. Hence best not to pay any attention to this indicator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 26, 2023, 05:49:52 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AM Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.It definitely depends on the holder’s goals most of us have invested with a certain profit in mind if those who think they have made enough good profit and they already need the money for something then they might pull their investment out already however me personally i would keep on holding and might even buy more in the future I might do the DCA method as i am not yet capable of buying huge amount of bitcoin all at once but i still want to buy more coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "December 26, 2023, 06:02:15 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AM Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.This honestly is a very challenging question, this is also one way of telling those who think hodling is an easy one when it's actually not really. I'm quite sure when bitcoin hits another ATH a lot of hodlers will get tempted into selling their bags most especially when bitcoin finally hits the six digit mark, that will make everyone crazy that it will make things hard to continue holding. I know there are still some who will continue their hodling journey until such time when they finally decide to retire from the job or the business that they're running, but I guess majority is resorting to sell at the ATH and buy back during the sharpest correction. As for me, If bitcoin reaches another height and doesn't satisfy me, then I'd continue holding as well as DCAing as I am aiming to harvest everything as a part of my retirement plan. That's the original plan, but when things gets too attractive, I wouldn't guarantee I'm still holding on to the original plan LOL!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "December 26, 2023, 07:18:17 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AM  Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.Thanks for your time.You've raised an excellent point and question, mate. Often, you hear a lot of Bitcoiners talking about \"hodl,\" which means holding onto your Bitcoins for a long time to make profits. I had the same question when I was a newbie, when is the right time to sell and not just keep holding?The answer is quite straightforward. the profits you make from Bitcoin depend on how much you've invested over the long run. that's why it's recommended to invest funds that you won't need for a while when dealing with smaller amounts. It's generally advised not to invest in Bitcoin if you rely on it as your main source of income. This helps prevent you from selling your holdings prematurely without maximizing your profits.So, when should you withdraw your profits? It all depends on how much and how significantly your initial investment has grown over the years. With the upcoming bull market, you might see many investors selling off their profits to meet their financial needs.Deciding whether to sell or hodl involves considering factors like your financial goals, how much risk you're comfortable with, and the overall mood of the market. It's also necessary to remember why you first invested in Bitcoin  whether it was for quick gains or a belief in its long-term value as a reliable asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ColdLava40",
      "created_time": "December 26, 2023, 07:24:37 AMLast edit: December 28, 2023, 04:58:41 AM by ColdLava40",
      "body": "Quote from: rat03gopoh on December 26, 2023, 03:49:49 AMUltimately I will spend if it reached my ATH prices target, I can't do anything else to enjoy it except exchange to cash(bitcoin is not allowed as a means of payment). At that point I probably would have said, \"fuck HODL, let me just start over next bear season\". Lol. @rat03gopoh, I really appreciate the sincerity and the joke part.Quote from: philipma1957 on December 26, 2023, 02:23:32 AMinteresting question.I think it depends on how long thy have hodled and at what price they got in.  Finally what do we go up to.Lets say you purchased 10 coins in 2017 at 10K around dec 1st of 2017.I think if EFT comes and we go to 200k those holders may dump 1 to 3 coinsbut if you grabbed 10 coins in 2021 at 65k  and we go to 200 k they would sell 4-5 coins.@philipma1957, Thanks for your reply. So, does this mean that the amount used to buy and the profit made are basically what determine the number of Bitcoin to sell?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "December 26, 2023, 09:09:50 AM",
      "body": "Buying Bitcoin for the long term and holding Bitcoin for the long term is a big decision for an investor to make and hold their investment. It is easy to invest but not so easy to hold the investment. You have some amount of money you can invest easily with some amount of money but you can't hold your investment for a long time if you want. Holding one's investment for a long period of time has many challenges and only those who can face all kinds of challenges can hold one's investment in the end. In order to hold the investment for a long time, one must first strengthen oneself mentally, when an investor can make himself mentally strong, he will go a long way in holding his investment for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "December 26, 2023, 09:13:15 AM",
      "body": "It depends on each investor's plans and what is happening with the market. If the price immediately increases high and makes a new ATH, many investors will sell their Bitcoin. But if the price declined sharply, many investors would still hold their Bitcoin.And if the rising Bitcoin price is investors' target selling price, they will sell it to take advantage. However, some investors still hold Bitcoin for the longer term, especially those with a lot of Bitcoin. They may sell some Bitcoins to enjoy the profits and hold the remaining Bitcoins for a longer term.And if it were me, if I saw the price hit, say $200k, I would sell most of the Bitcoin. After that, I will prepare some money to buy back the Bitcoin at a low price. You should make a plan to deal with all the possibilities that could happen later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Essential10",
      "created_time": "December 26, 2023, 09:25:29 AM",
      "body": "Quote from: ColdLava40 on December 26, 2023, 01:55:42 AM Question: With the coming of these two major events, assuming the price of Bitcoin turns out to be very impressive and massively different from today's current price, will the majority of Bitcoin holders keep(continue) holding?, or might price temptation just result in them selling to make a profit?.I don't think it will be a price lure since those who have invested in Bitcoin must have invested in Bitcoin for profit. If the value of Bitcoin rises in events like Bitcoin ETF and halving, then long-term holders of Bitcoins will have a personal decision whether to hold or not. But I guess some people might consider selling only a part of Bitcoin to meet the demand and holding the rest for long term. But as much as I hold my bitcoins, I plan to hold bitcoins for another two to three years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}