{
  "id": "topic_5434865",
  "title": "bitcoindusts",
  "author": "bitcoindusts",
  "created_time": "January 16, 2023, 12:58:51 AM",
  "content": "Quote from: Bob LoukasI believe a new Four Year Cycle has started.  But I do not have confirmation of it. And that's OK! In this video, I describe why that it is.  As investors, we're looking to gain allocation at the right times, and to reduce allocation at the right times. With the benefit of hindsight, I believe this will end up as one of those times.  The Model Portfolio ADDED to positions. Here is the model portfolio   https://bitcoin.live/4yearcycleThank you for being on this journey with me over Four Years! Here is to another Four!  All the best.Video Title: The NEW 4 year CycleVideo Link:  https://www.youtube.com/watch?v=ou9i-zfZVvkNote to remember:The video do not attempt to predict the bottom but rather talk about the new 4 year Bitcoin cycle.  Since the author thinks that we are now venturing in a new 4 year cycle.Sharing this video since it has been proven that people who were guided by the four year cycle discussed by Bob Loukas had ended in a positive gain.  It can be supported by the given reply on the video.  This is not a financial advice but rather gives concept on how Bitcoin behave and some insights of the author.I believe there are lots of learnings in this video and keeping it will be too greedy for me to hoard the information.My previous thread about the 4 year cycle discussed by Bob Loukas : The Birth of a Cycle (Current Bitcoin 4 year cycle is about to end)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434865",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "January 18, 2023, 08:43:16 AM",
      "body": "Does giving an overview of the market represented, for example, in the four-year cycle, need analysis from Bob Loukas or anyone else?I do not know, but what he is trying to say does not come out of formulating a generalization that has no meaning. If the four-year cycle is not used to predict the bottom or estimate the maximum rise, what is the benefit of it?The common denominator between all these analyzes is that we witness a new peak and a new bottom every four years, but the question is the price range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "January 18, 2023, 09:02:43 AM",
      "body": "The four year cycle comes from Bitcoin halvings that happen every four years after 210,000 blocks. Bitcoin block reward halving countdownIt maybe coincidence when Bitcoin halvings occur in a year of the USA President Election that possibly impact the USA and global economic and politics conditions. So halving combines with USA. President Election to create big effects of 4 year cycle.I could be wrong but I think in future, Bitcoin halvings will have less impacts when Bitcoin block rewards become smaller enough for miners. Maybe after a 7th halving in 2032 at block 1260000, Bitcoin block reward will be halved to only 0.78125 BTC every block. Halvings after that 7th time will have smaller impacts but after 2032 I think Bitcoin will have more effects from Bitcoin adoption.Controlled supply",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "January 18, 2023, 09:31:07 AM",
      "body": "We definitely don't need another 4-year cycle analysis, we all know about halving, and we all can see for ourselves how past cycles have behaved, and can come up with many different conclusions, and can all still be wrong with it. In fact, majority of analysis is still wrong despite having many cycles to look at already.I would say that we also need to examine the effect of global economy recession on this cycle. Which never happened before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "January 18, 2023, 02:07:10 PM",
      "body": "I haven't watch the video, but to give some perspective, during the last bull run, we have heard a lot of this analysis as well, saying that the cycle might change because the whole bitcoin narrative change as well. There are even predictions that maybe we will have 2 super cycles. However, I don't see it happening, we know that bitcoin halving happens every 4 years and that is the catalyst for a bull run. So it will holds true and I don't see any event that will change that in the future. So there is no coincidence or what, Satoshi designed it to be like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}