{
  "id": "topic_5420825",
  "title": "Don Pedro Dinero",
  "author": "Don Pedro Dinero",
  "created_time": "November 13, 2022, 07:11:56 AMLast edit: November 13, 2022, 09:46:35 AM by Don Pedro Dinero",
  "content": "Es solo un 1% de momento pero esa curva en pendiente hacia abajo no pinta bien.Edito pues acabo de ver en forocarros que hablan del token de Crypto.com en caída libre. Yo es que no uso tokens ni mierdas de esas. Gané 125USDT en el casino por unas tiradas gratis a la tragaperras online que me dieron de la campaña de firmas y tuve que descubrir que no me los podía gastar sin tener Eth primero.Vuelvo a editar para actualizar: según comentan en este hilo[URGENTE] Hilo oficial de la hecatombe exchangesAparte de FTX, crypto.com, Gate.io y Huobi están en problemas. Lo más relevante es que ayer tuvieron que demostrar su liquidez y se estuvieron haciendo transferencias de grandes cantidades, que en algún caso atribuyen a un error.Cita de un tweet: QuoteCZ hinting at Crypto,com and Gate,io not being safe after weird transactions taking place.➡️ I recommend taking your money out of these platforms. There is no reason whatsoever to keep your coins there, especially amidst all of this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420825",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "November 13, 2022, 02:24:11 PM",
      "body": "En esta ocasión, no duró tanto el pico de la bajada, y fue de tan solo 250$. Ahora, dada la situación, cualquier cosa nos pone a temblar las piernas. Por coger algo de perspectiva, si ponemos la gráfica del OP a 5 días vista, la bajada no representa ninguna anomalía. Quizás es más palpable en la gráfica de 1 día por ser la escala representada una franja bastante compacta, donde un movimiento un pelín brusco se ve con más peso de lo que tiene realmente.En lo relativo a los Exchanges citados, a buen seguro que hay cosas turbias y arriesgadas en muchos de ellos, con los consiguientes riesgos en momentos en los cuales se ponen a prueba, y más aún si basan gran parte de sus reservas en algún tipo de engendro de token autogenerado. Como decía ayer, aún me sorprende no ver retiros a mansalva; por lo menos en la blockchain de BTC no se observa aún un tráfico desmedido en los últimos días.En cuanto a CZ, el aviso tiene doble intencionalidad, y el juego es arriesgado. Ya puesto, la gente podría cuestionarse Binance por ser un Exchange, y asimilarlo mentalmente a otros como FTX en el ámbito potencial (independientemente de que presenten números para argumentar su solvencia y liquidez).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 13, 2022, 04:05:38 PM",
      "body": "Lo que pasa es que la gente consiguió capital respaldado por tokens los cuales demostraron no tener solvencia. Ese fue el punto de partida del problema. Y la bola de nieve creció y se fue armando un efecto dominó. El principal golpe fue el de FTX, pero después de eso se empezaron a sumar mas problemas. Hay una campaña para que la gente retire su dinero de las casas de cambio, lo cual es sano para los usuarios pero peligroso para los mercados.USD 3,000 millones en bitcoin salieron de los exchanges esta semana en medio de los temores al contagio de FTXhttps://es.cointelegraph.com/news/3-billion-in-bitcoin-left-exchanges-this-week-amid-ftx-contagion-fearsSiempre he dicho que para ver hacia donde se moverá el precio debemos ver el cambio en la capitalización de mercado, y en este momento es de $833.6B lo cual es una cifra baja si la comparamos con los $2T que estuvo hace varios meses. Así que podemos esperar una tendencia a la baja para esta semana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 13, 2022, 05:07:06 PM",
      "body": "Quote from: DdmrDdmr on November 13, 2022, 02:24:11 PM...En lo relativo a los Exchanges citados, a buen seguro que hay cosas turbias y arriesgadas en muchos de ellos, con los consiguientes riesgos en momentos en los cuales se ponen a prueba, y más aún si basan gran parte de sus reservas en algún tipo de engendro de token autogenerado....En cuanto a CZ, el aviso tiene doble intencionalidad, y el juego es arriesgado. Ya puesto, la gente podría cuestionarse Binance por ser un Exchange, y asimilarlo mentalmente a otros como FTX en el ámbito potencial (independientemente de que presenten números para argumentar su solvencia y liquidez).Yo apostaría a que ante el escenario de meses pasados en donde el precio de Bitcoin empezó a bajar para mantenerse solventes tomaron partes de sus reservas y las movieron a otros lugares en busca de generar ingresos, algo irónico considerando que así en como empezó mucho de todo este circo. La cuestión es donde pusieron en dinero y si todo esto les ha hecho tomar previsiones para tener su liquidez en mano, en pro de apaciguar el miedo de los usuarios.He visto personas en internet acusar a CZ de sembrar FUD de forma intencionada para posicionar su exchange sobre los demás, me inclino a por la opción de que CZ se sabe en una posición ventajosa de liquidez y aprovecha para practicar algo de \"marketing\" en Twitter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 13, 2022, 06:07:25 PM",
      "body": "Según comentarios recientes de CZ en Twitter, si hasta ahora tenía por política no comentar sobre la competencia, ahora parece que va a abrir la veda, y hacer comentarios directos sobre ellos. Si bien dice su intención es reducir el riesgo, aunque sea creando falsas alarmas (literalmente eso dice), espera que mida muy bien sus palabras. De hecho, la debacle actual tiene su origen en airear situaciones, que por un lado está bien, pero por otro lado crean un pánico que quizás podría gestionarse con bastante más discreción, sin tener que tirar el mercado abajo …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "November 13, 2022, 09:56:46 PM",
      "body": "Yo creo que ademas de todo lo que ya sabemos u hemos estado comentando hay cosas mucho mas gruesas detras.Sin ir mas lejos cuestiones politicas y geopoliticas muy grandes.Por ejemplo pueden mirar este TWT de Kim Dotcom el ex de mega que lo deja entrever y ya vi mas gente que lo habia dicho anteriormente y no se si el mismo Musk ahora se sumo.https://twitter.com/KimDotcom/status/1591846426514173952?cxt=HHwWgMDR1YL5r5csAAAAEntre otras cosas tambien no olvidar que podemos estar viendo una guerra entre exchanges occidentales y orientales.... Jamas sabremos la verdad ni los entretelones pero hay que resguardarse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 14, 2022, 04:26:07 AM",
      "body": "Quote from: DdmrDdmr on November 13, 2022, 02:24:11 PMEn esta ocasión, no duró tanto el pico de la bajada, y fue de tan solo 250$. Ahora, dada la situación, cualquier cosa nos pone a temblar las piernas. Pues sí, de momento es así, aunque yo sigo viendo presión bajista. Al mínimo estornudo nos vamos a 15.000 y más abajo.Quote from: Hispo on November 13, 2022, 05:07:06 PMYo apostaría a que ante el escenario de meses pasados en donde el precio de Bitcoin empezó a bajar para mantenerse solventes tomaron partes de sus reservas y las movieron a otros lugares en busca de generar ingresos, algo irónico considerando que así en como empezó mucho de todo este circo. La cuestión es donde pusieron en dinero y si todo esto les ha hecho tomar previsiones para tener su liquidez en mano, en pro de apaciguar el miedo de los usuarios.Algó así he leído entre las muchas informaciones que he visto del tema: los bitcoins una vez depositados pasan a ser parte de sus activos y aunque juren y perjuren que solo los custodian y no los van a mover, eso precisamente es lo que ha pasado.Quote from: darxiaomi on November 13, 2022, 09:56:46 PMYo creo que ademas de todo lo que ya sabemos u hemos estado comentando hay cosas mucho mas gruesas detras.Sin ir mas lejos cuestiones politicas y geopoliticas muy grandes.Por ejemplo pueden mirar este TWT de Kim Dotcom el ex de mega que lo deja entrever y ya vi mas gente que lo habia dicho anteriormente y no se si el mismo Musk ahora se sumo.https://twitter.com/KimDotcom/status/1591846426514173952?cxt=HHwWgMDR1YL5r5csAAAAEntre otras cosas tambien no olvidar que podemos estar viendo una guerra entre exchanges occidentales y orientales.... Jamas sabremos la verdad ni los entretelones pero hay que resguardarse.Esto por supuesto, sobre todo si tenemos en cuenta que FTX fue el segundo mayor donante del partido Demócrata.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 14, 2022, 08:12:03 AMLast edit: November 14, 2022, 05:56:07 PM by DdmrDdmr",
      "body": "Pues mirando la evolución del precio de BTC hace un par de horas, tenía pinta de irse hacia la zona media de los 15K $ sin problemas, y de golpe, ha subido en poco tiempo hasta los 16,9K $ sin más, en unas horas con Europa despertándose y EEUU/LATAM durmiendo (vale que el mercado está abierto 24/7).Es totalmente imprevisible, aunque por lógica, la mayor parte de la gente supongo que le ve bastantes posibilidades de realizar un descenso adicional, dadas las circunstancias y la carencia de fundamentales positivos directos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 14, 2022, 09:39:54 PM",
      "body": "Quote from: DdmrDdmr on November 14, 2022, 08:12:03 AMPues mirando la evolución del precio de BTC hace un par de horas, tenía pinta de irse hacia la zona media de los 15K $ sin problemas, y de golpe, ha subido en poco tiempo hasta los 16,9K $ sin más, en unas horas con Europa despertándose y EEUU/LATAM durmiendo (vale que el mercado está abierto 24/7).Es totalmente imprevisible, aunque por lógica, la mayor parte de la gente supongo que le ve bastantes posibilidades de realizar un descenso adicional, dadas las circunstancias y la carencia de fundamentales positivos directos.Estamos en niveles bastante volátiles luego de toda la avalancha de noticias que hemos visto. Me atrevo a decir que las expectativas de precios inferiores a estos niveles que estamos viendo responde a los traders esperando más noticias negativas del próximo dominó en caer por culpa de FTX.También tenemos la expectativas de la subasta de los BTC incautados por el gobierno de los EEUU y la retribución the Mt.Gox, hay pocas noticias o expectativas que eleven el precio. Pero aún así, para los inversionistas a largo plazo, es la hora del DCA hasta el año 2024 cuando veremos el siguiente halving. Quien sabe, quizá estoy pecando de optimista.  https://alternative.me/crypto/fear-and-greed-index/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "November 14, 2022, 11:03:36 PM",
      "body": "Pues no hay otra explicación para lo que esta pasando excepto que el FUD está moviéndose a todo lo que da, y aunque he estado siguiendo los acontecimientos de este desplome de los mercados no me había tomado el tiempo de ver las graficas y no se ven bien.Sobre todo, la del día de hoy, los Bulls atacaron fuertemente y se sobrepaso el nivel de 17k, pero al parecer los Bears han tomado control de la situación una vez más y hemos vuelto a mediados de 16k.Ahora bien, es probable que el precio no vaya a presentar otro desplome tan estrepitoso porque dudo mucho que haya demasiadas personas usando apalancamiento que puedan ser liquidadas al momento, lo cual limita la magnitud de una caída en el precio, sin embargo, no puede descartarse que esta ocurra y que nos lleve debajo de 15k durante los siguientes días.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 15, 2022, 05:42:24 AM",
      "body": "Quote from: Silberman on November 14, 2022, 11:03:36 PMSobre todo, la del día de hoy, los Bulls atacaron fuertemente y se sobrepaso el nivel de 17k, pero al parecer los Bears han tomado control de la situación una vez más y hemos vuelto a mediados de 16k.Yo, lo malo que le veo a esto, es que parece que nos hayamos asentado en la zona de los 17.000. Durante bastantes meses hemos estado rondando la zona de los 20.000, y me gustaría ser optimista, de hecho yo pensaba que por ahora estaríamos subiendo paulatinamente hacia los 30.000, pero hemos ido en la dirección contraria. Para no continuar cayendo no puede haber ningún problema más con exchanges ni algún otro problema mayor que afecte al mercado bitcoin, de lo contrario vamos a bajar fácilmente a los 15 y los 12.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 15, 2022, 08:26:20 AM",
      "body": "Mirando la gráfica de la Mempool durante la última semana, desde ayer por la tarde sí parece haberse creado un muro mayor de TXs respecto de periodos anteriores. Sin que me parezca tampoco una exageración no obstante, pero precisando aprox. 20 sats/vBytes como mínimo para poder entrar en bloques próximos.En este artículo que vi ayer, Coinglass apunta a unos 200K BTCs retirados de los exchanges a lo largo de los últimos 7 días. Algo natural, pero que puede tensar la situación al poner a prueba la liquidez de los Exchanges.Por cierto, que ya tenemos un recordatorio a modo de anuncio al respecto de los riesgos de mantener fondos en plataformas online tipo Exchanges y demás. Se puede acceder también, por ahora, desde el enlace de Noticias de la parte superior de la pantalla.Ver también: https://www.coinglass.com/Balance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 16, 2022, 02:20:11 PM",
      "body": "Si alguien se pregunta por qué está bajando el precio en picado hoy, ya tenemos la respuesta, otro más con problemas:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "November 16, 2022, 02:40:20 PM",
      "body": "Quote from: Don Pedro Dinero on November 16, 2022, 02:20:11 PMSi alguien se pregunta por qué está bajando el precio en picado hoy, ya tenemos la respuesta, otro más con problemas:Pues sí, me lo estaba preguntando. Una notificación me alerta de que acaba de caer otro diez y pico por ciento el CRO de Crypto.com, tras estabilizarse relativamente los últimos días. Cada vez que una gran empresa se ve afectada, salpica a todas las demás.En algunas noticias veo que esta de Gemini se trata de una medida preventiva, en otras que se trata de un efecto contagio, y la más reciente de hace tres cuartos de hora afirma que son \"retrasos\" debido a una pausa en los préstamos.Habrá que esperar unas horas y ver en retrospectiva qué narices está sucediendo. Pero ya cansa A este paso, va a ser más seguro apostar...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 16, 2022, 02:43:55 PM",
      "body": "Quote from: Don Pedro Dinero on November 16, 2022, 02:20:11 PM<…>A destacar de que se trata de Gemini Earn, y no de la operativa base del Exchange Gemini. La raíz del problema parece estar en su partner para el programa Earn, Genesis:https://decrypt.co/114778/genesis-suspending-client-withdrawals-lending-arm-citing-ftx-impactGenesis sí ha parado los retiros en su negocio base de préstamos, que es como me imagino enlaza con el programa Earn de Gemini (el cliente pone cripto en staking en Gemini Earn, y el partner lo presta a terceros para ganar margen).Ver además: https://www.gemini.com/blog/an-important-message-regarding-gemini-earn.https://twitter.com/Gemini/status/1592873279232278532 (son 6 Tweets al respecto).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 16, 2022, 04:19:54 PM",
      "body": "No se si se han percatado pero hay una campaña para animar a la gente a retirar su dinero de servicios como casas de cambio, incluso en las noticias del foro vemos el enlace con la siguiente leyenda:News: Reminder: do not keep your money in online accountsTraducción: Recordatorio, no dejes tu dinero en cuentas en línea.Y el enlace nos dirige a: https://bitcointalk.org/index.php?topic=5421039.0La cual es una publicación de Theymos en la cual nos indica que no importa si es un Bitcoin o un dolar, es de suma importancia no dejar nuestro dinero en dichas cuentas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 16, 2022, 04:47:59 PM",
      "body": "Quote from: seoincorporation on November 16, 2022, 04:19:54 PM<…>Esto me recuerda a los hilos relativos al Proof of Keys Day, que se celebra cada 03 de enero, incitando a todos a sacar sus monedas de los Exchanges y otros servicios de custodia por un día (cuanto menos).Cuando vi la iniciativa en su momento, pensé que mucha gente no sabría llevar a cabo una autocustodia, aunque fuese por un día, y que de llevarse a cabo en un hipotético caso al 100%, se convertiría en el día del año en el cual se perderían más bitcoins para siempre.En realidad, no hay que ser demasiado optimista acerca de cualquier posibilidad que pueda tener la iniciativa de atraer a un porcentaje siquiera notable de gente hacia a su práctica, y siendo algo perversos, el evento ha quedado obsoleto en vista de los acontecimientos desencadenados por FTX …Ver hilos:Primer día del evento.Segundo aniversario del evento.Tercer aniversario del evento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "November 17, 2022, 05:51:12 PM",
      "body": "Quote from: DdmrDdmr on November 16, 2022, 04:47:59 PMQuote from: seoincorporation on November 16, 2022, 04:19:54 PM<…>Esto me recuerda a los hilos relativos al Proof of Keys Day, que se celebra cada 03 de enero, incitando a todos a sacar sus monedas de los Exchanges y otros servicios de custodia por un día (cuanto menos).<...>No conocía este evento, y la verdad me parece bastante chulo. Llama la atención el hecho de que oeleo no le vea sentido a una práctica de este tipo, aunque lo argumente diciendo que si solo es un día no sirve de nada. En mi opinión, si puede constituir una mínima excusa para que durante al menos un día al año la gente se conciencie sobre los peligros de tener los fondos en exchanges centralizados, y con que solo a un bitcoiner le hubieran salvado los ahorros, la cita estaría más que justificada y habría que darle más bombo.El pizza day tiene su significado e incluso una razón práctica de ser (entre otras, sorprende en un tono amigable al no iniciado en Bitcoin y promueve la adopción y subida de precio); al proof of keys days también se la veo, aunque en este caso se beneficie principalmente al que empieza, y no al que ya lleva tiempo en el mundillo.Como ya no queda mucho, lo comentaremos de nuevo en la sección local cuando llegue la fecha: quién sabe a que lector principiante le puede venir bien la llamada de atención sobre el tema.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 17, 2022, 06:45:40 PM",
      "body": "Quote from: Porfirii on November 17, 2022, 05:51:12 PM<…>Bajo el punto de vista de realmente poner el Exchange a prueba, es cierto que sólo se hace durante un día en el mejor de los casos con el evento, y sabemos que, en la práctica, la cantidad de gente que practique la retirada de fondos va a ser mínima y apenas perceptible. Así pues, respecto de poner los Exchanges a prueba, la intuición dice que no se logrará de manera significativa, y por ende, el evento tiende a fracasar bajo este prisma.No obstante, bajo el punto de vista de concienciación de los usuarios, es un evento que, de ser mediático, da que pensar a la gente (aunque me da que FTX tiene mejor difusión en este sentido ahora mismo …), y alguna fracción de los usuarios pasará a realizar una autocustodia responsable como consecuencia de la concienciación.Por cierto, si todos hiciésemos un ejercicio análogo de retirar los fondos de la banca el día x de cada año, íbamos a provocarnos una cascada de problemas nosotros mismos (ya sabemos que sólo tienen una pequeña parte disponible como liquidez – tampoco es que se pueda de inmediato para según qué cantidades ya de por sí sin planificación previa con un agente de la sucursal).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "November 17, 2022, 09:49:03 PMLast edit: November 18, 2022, 10:13:21 PM by Porfirii",
      "body": "Quote from: DdmrDdmr on November 17, 2022, 06:45:40 PMQuote from: Porfirii on November 17, 2022, 05:51:12 PM<…><...>No obstante, bajo el punto de vista de concienciación de los usuarios, es un evento que, de ser mediático, da que pensar a la gente (aunque me da que FTX tiene mejor difusión en este sentido ahora mismo …), y alguna fracción de los usuarios pasará a realizar una autocustodia responsable como consecuencia de la concienciación.Sin lugar a dudas, si algo bueno tienen este tipo de catástrofes periódicas (desde MtGox, pasando por Cryptopia, y así por siempre jamás) es que, aunque sea por las malas, la gente aprende. La difusión que ha tenido lo de FTX incluso en los medios no especializados es digno de mención. La fracción existe, sin duda, la duda que queda es si merece la pena el coste del desprestigio de las criptomonedas por contagio.Quote from: DdmrDdmr on November 17, 2022, 06:45:40 PMPor cierto, si todos hiciésemos un ejercicio análogo de retirar los fondos de la banca el día x de cada año, íbamos a provocarnos una cascada de problemas nosotros mismos (ya sabemos que sólo tienen una pequeña parte disponible como liquidez – tampoco es que se pueda de inmediato para según qué cantidades ya de por sí sin planificación previa con un agente de la sucursal).Sí, algunos solo quieren ver el mundo arder. Soy de los que opinan que hay espacio para todos (bancos, CEX, casinos...) y que no hay que confundir el deseo de evitar sus abusos con el de querer acabar con todos ellos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}