{
  "id": "topic_5478992",
  "title": "Spaceman1000$",
  "author": "Spaceman1000$",
  "created_time": "December 22, 2023, 11:04:49 PMLast edit: December 22, 2023, 11:16:53 PM by Spaceman1000$",
  "content": "it has been a night of joy for bitcoiners in Nigeria as we heard the news of the central bank of Nigeria lifting the restrictions placed on cryptocurrency activities in Nigerian commercial bank some years back.Some of us have been praying and anticipating for this day to come, so that our activities can go on freely with commercial banks. Though the P2P system has really helped a lot of us here in Nigeria, but this ban been lifted will also enlarge the adoption of cryptocurrency  in Nigeria and Africa at large, Nigeria is one of the emerging economies in Africa and in the world with a high population of over 200 million people, so if there is a high adoption of cryptocurrency it will really help the crypto market positively, however we are really happy for this new development as it will boost our confidence in preaching the good gospel of bitcoin to our compatriot here.https://punchng.com/breaking-cbn-lifts-ban-on-cryptocurrency/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5478992",
  "comments": [
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 22, 2023, 11:31:18 PM",
      "body": "If this is real, then it's indeed a good thing that the ban has been lifted. Although I have one question, which is, when they placed the ban on crypto-related transactions in the Nigerian banks, did it actually stop Bitcoiners and crypto enthusiasts from investing in Bitcoin? Did the ban reduce the rate of Bitcoin adoption in the country?IMO, I think the answer to my question is no, but I may be wrong and still need someone to clarify it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "December 22, 2023, 11:38:46 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 22, 2023, 11:31:18 PMIf this is real, then it's indeed a good thing that the ban has been lifted. Although I have one question, which is, when they placed the ban on crypto-related transactions in the Nigerian banks, did it actually stop Bitcoiners and crypto enthusiasts from investing in Bitcoin? Did the ban reduce the rate of Bitcoin adoption in the country?IMO, I think the answer to my question is no, but I may be wrong and still need someone to clarify it.A government giving its affirmation and acceptability to an innovation gives that innovation a different aura, so in answering your question, the ban affected the psychology of those persons that don't really have an indepth knowledge of Bitcoin or cryptocurrency, those persons that are solely relying on government permission before they can go into adopting or investing in some certain business just so that they could see themselves falling in line with government activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "December 22, 2023, 11:48:19 PM",
      "body": "Quote from: Spaceman1000$ on December 22, 2023, 11:04:49 PMit has been a night of joy for bitcoiners in Nigeria as we heard the news of the central bank of Nigeria lifting the restrictions placed on cryptocurrency activities in Nigerian commercial bank some years back.If they don't lift the ban, Nigerians can find Non KYC exchanges to use for cryptocurrency to their fiat currency exchange. Nigerian commercial banks will have less chance to engage in such crypto-fiat exchange and can not ban their citizens as well as their bank accounts if they have no information about those trades.With Some world maps for Bitcoiners and Cryptocurrency Legality Map, I see Nigeria has an Alegal status, not Illegal. Its legality status is similar on two websites.https://newhedge.io/terminal/bitcoin/legality-maphttps://coin.dance/poli/legality",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "December 23, 2023, 03:41:32 AM",
      "body": "Quote from: Spaceman1000$ on December 22, 2023, 11:04:49 PMit has been a night of joy for bitcoiners in Nigeria as we heard the news of the central bank of Nigeria lifting the restrictions placed on cryptocurrency activities in Nigerian commercial bank some years back.Some of us have been praying and anticipating for this day to come, so that our activities can go on freely with commercial banks. Though the P2P system has really helped a lot of us here in Nigeria, but this ban been lifted will also enlarge the adoption of cryptocurrency  in Nigeria and Africa at large, Nigeria is one of the emerging economies in Africa and in the world with a high population of over 200 million people, so if there is a high adoption of cryptocurrency it will really help the crypto market positively, however we are really happy for this new development as it will boost our confidence in preaching the good gospel of bitcoin to our compatriot here.https://punchng.com/breaking-cbn-lifts-ban-on-cryptocurrency/This is not only a win of Nigerian people but also with the world of crypto because Nigeria is showing a big support and use of cryptocurrency and having this clear market now will bring more open support to the African countries and will have belief that sooner their country will be as popular as Nigerian being a crypto supporting country.can't wait what would be the reaction of the market in that continent anytime soon now .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "December 23, 2023, 04:09:47 AM",
      "body": "I understand that Nigerians are really interested with cryptocurrency and has been one of the few African countries where many people are holding and even trading cryptos. With the lifting of the ban, I am sure the market is going to be developed a lot. I am hoping that regulations the government will be imposing can encourage good players and can stop frauds and scams so people will never be victimized by bad players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "December 23, 2023, 04:41:19 AM",
      "body": "This is fantastic news for both cryptocurrency users and the country's development. Although the ban didn't impact crypto traders much due to the availability of peer-to-peer trading, it prevented banks and financial services from engaging in cryptocurrency transactions. This positive development is a great way for the Nigerian government to begin the new year, especially considering the economy has fallen below expectations. With this news, crypto exchanges and other self owned cryptocurrency platforms can resume operations, leading to increased profits and contributing to the improvement of Nigeria's economy. Congratulations, Nigerians.Quote from: Dr.Bitcoin_Strange on December 22, 2023, 11:31:18 PM Did the ban reduce the rate of Bitcoin adoption in the country?No, buddy. Since the time of restrictions until now, more Nigerians have started using cryptocurrencies. It didn't decrease their usage but introduced many Nigerians to the existence of cryptocurrency technology. Lots of Nigerians were stuck dealing with the banking system, and over time, they discovered new ways to save and protect their money from banks that often deducted unreasonable charges from customers' accounts. The ban of institutional crypto transactions, increased awareness of alternative ways to save or trade money, leading to potential profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bounceback",
      "created_time": "December 23, 2023, 05:22:45 AM",
      "body": "In Bitcointalk forum I found many user come from Nigerian and likely bitcoin or cryptocurrency have been popular there, I don't think problem when bank not allowed bitcoin transaction there because have many alternative way for withdrawing or purchasing cryptocurrency fund to be cash by selling trough P2P and the user want to make deposit can buy on P2P exchange. Its advantage with Nigerian have large bitcoin and cryptocurrency community because every day have much transaction volume for buying and selling cryptocurrency assets trough P2P and looking with your bitcoin forum local board what is majority exchange use there, Binance, Kucoin or Huobi as many user from Nigeria. Don't be afraid exactly for OP if government your country not allowed linked cryptocurrency market to your bank account because you can use third party as P2P for selling bitcoin or cryptocurrency assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 23, 2023, 05:39:50 AM",
      "body": "Quote from: Catenaccio on December 22, 2023, 11:48:19 PMIf they don't lift the ban, Nigerians can find Non KYC exchanges to use for cryptocurrency to their fiat currency exchange. Nigerian commercial banks will have less chance to engage in such crypto-fiat exchange and can not ban their citizens as well as their bank accounts if they have no information about those trades.I guess it was this, that they realized that they were losing much more than they could gain from the ban.Quote from: Hatchy on December 23, 2023, 04:41:19 AMNo, buddy. Since the time of restrictions until now, more Nigerians have started using cryptocurrencies. It didn't decrease their usage but introduced many Nigerians to the existence of cryptocurrency technology. Lots of Nigerians were stuck dealing with the banking system, and over time, they discovered new ways to save and protect their money from banks that often deducted unreasonable charges from customers' accounts. The ban of institutional crypto transactions, increased awareness of alternative ways to save or trade money, leading to potential profits.Interesting.  If people had become accustomed to making cryptocurrency transactions outside banks, I don't think they are all going to make them with banks now. We will have to see how things develop from now on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "December 23, 2023, 05:44:42 AM",
      "body": "Quote from: Spaceman1000$ on December 22, 2023, 11:04:49 PMit has been a night of joy for bitcoiners in Nigeria as we heard the news of the central bank of Nigeria lifting the restrictions placed on cryptocurrency activities in Nigerian commercial bank some years back.Some of us have been praying and anticipating for this day to come, so that our activities can go on freely with commercial banks. Though the P2P system has really helped a lot of us here in Nigeria, but this ban been lifted will also enlarge the adoption of cryptocurrency  in Nigeria and Africa at large, Nigeria is one of the emerging economies in Africa and in the world with a high population of over 200 million people, so if there is a high adoption of cryptocurrency it will really help the crypto market positively, however we are really happy for this new development as it will boost our confidence in preaching the good gospel of bitcoin to our compatriot here.https://punchng.com/breaking-cbn-lifts-ban-on-cryptocurrency/It seems that the central bank of Nigeria is simply tired can't fight this (there are no tools to control and limit foreign exchange crypto transactions). In any case, this is not for the benefit of 200 million African people. The Central Bank lifts the ban today, but can easily return it tomorrow. Still, you shouldn't relax. This seems to be positive news, but it still remains insignificant. Cryptocurrencies are designed in such a way that neither approval nor ban by the central bank is required. All transactions in cryptocurrencies can be carried out directly between all cryptomarket participants (p2p).Did you see in the bitcoin whitepaper, written by S. Nakamoto, that to use bitcoin you need permission from the central bank of Nigeria (or any other)? I didn't see it either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 23, 2023, 06:00:45 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 22, 2023, 11:31:18 PMIf this is real, then it's indeed a good thing that the ban has been lifted. Although I have one question, which is, when they placed the ban on crypto-related transactions in the Nigerian banks, did it actually stop Bitcoiners and crypto enthusiasts from investing in Bitcoin? Did the ban reduce the rate of Bitcoin adoption in the country?IMO, I think the answer to my question is no, but I may be wrong and still need someone to clarify it.I don't live in Nigeria but for sure there has been significant changes in the activities regarding cryptocurrency in the regionThose who have enough trust in cryptocurrency probably kept on using it but there would be some people who will rather not risk it and quietly stop doing activities regarding cryptocurrency additionally now there can be more acceptance from the general public upon the lifting of regulations set by the government itself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "December 23, 2023, 06:02:26 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 22, 2023, 11:31:18 PMIf this is real, then it's indeed a good thing that the ban has been lifted. Although I have one question, which is, when they placed the ban on crypto-related transactions in the Nigerian banks, did it actually stop Bitcoiners and crypto enthusiasts from investing in Bitcoin? Did the ban reduce the rate of Bitcoin adoption in the country?IMO, I think the answer to my question is no, but I may be wrong and still need someone to clarify it.Though the ban the government placed previously affected some bitcoiners in Nigeria because Nigeria is a country that it's citizens respect and regards government orders and lots of bitcoiners were afraid of losing their bitcoins and crypto investments should government finds out that they're still involved in crypto related activities but however, I commend the government because despite placing the ban initially, they weren't strict on Bitcoin hodlers and investors within the country because they know quite well that some well meaning Nigerians are still into cryptocurrencies. I also applaud those that were resilient and determined despite the government initial order on crypto currencies but yet they stood strong and were still very much active on crypto activities, I believe that government finally lifting the ban is a welcome development for Bitcoin Investors and hodlers within the country. I think this announcement deserves a toast by Nigerian Bitcointalk members in this great forum!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 23, 2023, 06:06:36 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 22, 2023, 11:31:18 PMIf this is real, then it's indeed a good thing that the ban has been lifted. Although I have one question, which is, when they placed the ban on crypto-related transactions in the Nigerian banks, did it actually stop Bitcoiners and crypto enthusiasts from investing in Bitcoin? Did the ban reduce the rate of Bitcoin adoption in the country?IMO, I think the answer to my question is no, but I may be wrong and still need someone to clarify it.The ban did not reduce the rate of bitcoin adoption in the country but more people kept investing in bitcoin but without the knowledge of the government since the exchanges, both KYC and Non-KYC are not regulated by the government. This is a good move by the Nigerian government but I still feel this lift of ban still has something to unfold more for us. They might be seeing more adoption and want to regulate its use by imposing capital tax on investment in them, we shall see how things unfold more in the soonest. But overall, this is a good step by the government as we await to see more people embracing the use of cryptocurrency in the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "December 23, 2023, 06:13:52 AM",
      "body": "Quote from: Catenaccio on December 22, 2023, 11:48:19 PMQuote from: Spaceman1000$ on December 22, 2023, 11:04:49 PMit has been a night of joy for bitcoiners in Nigeria as we heard the news of the central bank of Nigeria lifting the restrictions placed on cryptocurrency activities in Nigerian commercial bank some years back.If they don't lift the ban, Nigerians can find Non KYC exchanges to use for cryptocurrency to their fiat currency exchange. Nigerian commercial banks will have less chance to engage in such crypto-fiat exchange and can not ban their citizens as well as their bank accounts if they have no information about those trades.With Some world maps for Bitcoiners and Cryptocurrency Legality Map, I see Nigeria has an Alegal status, not Illegal. Its legality status is similar on two websites.https://newhedge.io/terminal/bitcoin/legality-maphttps://coin.dance/poli/legalityThat's the point mate because they think that banks will be left alone if they did not adopt that way so yeah better to take off the banned and yes to join the market specially in bull running season that they believe soon to come , and Nigerian is truly coming into crypto nowadays that made them come to this decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NewRanger",
      "created_time": "December 23, 2023, 06:29:18 AM",
      "body": "It's not only us who are paying close attention to developments in the crypto world, in this case BTC, even though it is not yet very clear, bankers are also diligently following the ups and downs and developments of this virtual currency, wherever they are.Well, regarding this news, I think it is good news because there is more space for cryptocurrency lovers in the country to have more freedom so that the growth of cryptocurrency adoption in Nigeria will accelerate. Buying bitcoins also has varying degrees of anonymity and is very similar to cash transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "December 23, 2023, 07:09:57 AM",
      "body": "It is a good new for the crypto community in Nigeria, as it has been the only African country that has been leading in crypto adoption. They have been leading a life of hiding with the ban placed earlier by the central bank. With the removal of this ban, new ventures and startup will come up, and it would create a lot of new opportunities and employment in this industry. I was once checking Google trends to see which countries search Bitcoin globally and to my surprise, Nigeria was leading in search volume globally, not sure whether they are still at the top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "December 23, 2023, 07:26:12 AM",
      "body": "Wow, congratulations to you guys didn't the Nigerian government in the past month has been on a crackdown against cryptocurrency and that there's only the hotel there that's accepting bitcoin payments, that's the thing that I know on the situation of crypto in the country and thankfully you guys there are getting the freedom you deserve although the ban didn't have any big dent on the bitcoin adoption there but it's still a welcome thing to happen, no more getting antsy if you're dealing with crypto because there's no ban to worry about anymore. Another win for cryptocurrency market!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 23, 2023, 08:04:09 AM",
      "body": "Quote from: Poker Player on December 23, 2023, 05:39:50 AMI guess it was this, that they realized that they were losing much more than they could gain from the ban.There has been changes in government. New president was elected some months ago. 10% capital gain tax was included in 2023 Financial Act for cryptocurrencies which the incumbent president signed. The CBN governor that banned bitcoin and other cryptocurrencies was removed and replaced by his assistant before the present CBN governor was put there. The former CBN governor is illiterate to cryptocurrencies in regards to how it handle cryptocurrencies. It is not about them seeing that they are losing but there is a change in government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 23, 2023, 08:23:31 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 22, 2023, 11:31:18 PMIf this is real, then it's indeed a good thing that the ban has been lifted. Although I have one question, which is, when they placed the ban on crypto-related transactions in the Nigerian banks, did it actually stop Bitcoiners and crypto enthusiasts from investing in Bitcoin? Did the ban reduce the rate of Bitcoin adoption in the country?IMO, I think the answer to my question is no, but I may be wrong and still need someone to clarify it.We all know that regardless of these restrictions, Bitcoin adoption kept increasing in Nigeria. But making the country more Bitcoin-friendly will increase the adoption because more people will be aware of the coin. Bitcoin services will now be advertised by banks and this will attract bank customers to invest in the sector. People will always think that anything approved by the Central Bank and offered by banks is legitimate. I have also heard of intimidation of Bitcoiners by law enforcement because the government was anti-bitcoin. Such illegal arrests and intimidation will be reduced or even end because of this great news from Nigeria. Quote from: Charles-Tim on December 23, 2023, 08:04:09 AMQuote from: Poker Player on December 23, 2023, 05:39:50 AMI guess it was this, that they realized that they were losing much more than they could gain from the ban.There has been changes in government. New president was elected some months ago. 10% capital gain tax was included in 2023 Financial Act for cryptocurrencies which the incumbent president signed. The CBN governor that banned bitcoin and other cryptocurrencies was removed and replaced by his assistant before the present CBN governor was put there. The former CBN governor is illiterate to cryptocurrencies in regards to how it handle cryptocurrencies. It is not about them seeing that they are losing but there is a change in government.I think the past government hired the services of archaic and rigid economists who knew little or nothing about global economic dynamism. The CBN governor and the finance minister came up with strange policies that nearly brought the nation to its knees. I am happy that the CBN governor who championed the fight against Bitcoin is now facing charges of corruption and economic sabotage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 23, 2023, 09:21:04 AM",
      "body": "I used to think that Bitcoin was not banned in Nigeria because of the high activity of members of the local council here. All this alarm and trying to convince people to invest, and Bitcoin is illegal in Nigeria. It seems that things would change if the authorities approved CEXs and gave them licenses so that it would be easy to deposit and withdraw to the bank account, even though I think it is better to invest in Bitcoin ONLY in the long term, but this step will reduce the fees paid to P2P brokers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}