{
  "id": "topic_5469264",
  "title": "Samlucky O",
  "author": "Samlucky O",
  "created_time": "October 05, 2023, 05:25:12 AM",
  "content": "My country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true. If you no work towards am you go still be poor man because Dem say faith without work is dead. many talents dey waist because of pospondment. Wetting you don sabi you go dey doll yourself, dey see yourself like you never mature for the job or time Still dey. When your mate don meet up, you go come  dey envy them say na juju or na yahoo then dey do, were as you get that opportunity.One na make I see result from people wey dey do am first before I go do. Na still time you dey waist.And another na to find Fault in people. This person no dey gree help person, him dey greedy upon all the Money him get him no fit help me. The country hard. 9ja na the survival of the fittest, so to make am you no need to do like your life depends on people. Work hard and you go see the results.One fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend. when dey see you Dem go dey hide because them no say na beg you wan come beg them. But if you dey hardworking, Dem go like to come close to you because They no say you no go beg them again.So make we no dey procrastinate or too much depend on people because time waits for nobodyThank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469264",
  "comments": [
    {
      "author": "Richbased",
      "created_time": "October 05, 2023, 05:50:14 AM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true. If you no work towards am you go still be poor man because Dem say faith without work is dead. many talents dey waist because of pospondment. Wetting you don sabi you go dey doll yourself, dey see yourself like you never mature for the job or time Still dey. When your mate don meet up, you go come  dey envy them say na juju or na yahoo then dey do, were as you get that opportunity.One na make I see result from people wey dey do am first before I go do. Na still time you dey waist.And another na to find Fault in people. This person no dey gree help person, him dey greedy upon all the Money him get him no fit help me. The country hard. 9ja na the survival of the fittest, so to make am you no need to do like your life depends on people. Work hard and you go see the results.One fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend. when dey see you Dem go dey hide because them no say na beg you wan come beg them. But if you dey hardworking, Dem go like to come close to you because They no say you no go beg them again.So make we no dey procrastinate or too much depend on people because time waits for nobodyThank you.Na very good topic your bring like this o e get one saying wey old people been the use say when person mates they mad make you follow them mad, this saying no really mean madness but it means say as people  they struggle to meet up life make we too struggle like them. One of the things wey dey also draw us back for life na fear of failure and na fear be the greatest enemy wey man get because some of us for don make am by now but because say we dey fear to lose or we dey fear say make we no enta problems come make some of us come dey stagnant.Another factor wey come make some of us dey lazy na to they use this word say everyone get set time: this saying don make many people fail for life as when some of us tries something and it fails us we go come dey afraid to try again then we come they talk say maybe say our own turn never reach.It is important for us not to lose focus even if we have been trying and failing as success is never achieved on a platter of gold but through hardwork, commitment and consistency. Even if we keep trying and in fail us make we also start something new and see how it will turn out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Salahmu",
      "created_time": "October 05, 2023, 06:34:51 AM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. OP I like the topic but I think I will disagree with you on this, when you said the skill but lack courage to work on it, if I may ask what kind of skills are you referring to?, is it self employ skills or industrial skills? If is self employ skills how can you put your skill to work when you are financially unstable because there are people whom the kind of skills they acquire can take up to a millions plus to set up the workshop so how do you expect someone who could barely have three square meal a day to get up to a million naira plus to start up a workshop and also when we talk about industrial skills we are Reffering to the skills that can only be put to work or practice in an industrial or construction company and we no how difficult it is on getting a job from oil companies and even if there is job advert that includes your skill they will  need five years of working experience so how could someone applied when they don't have such years of experience, so there are people who has different skills but we're not giving the opportunity to showcase there talent so can we blame such person for not trying?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "October 05, 2023, 06:42:41 AM",
      "body": "Quote from: Richbased on October 05, 2023, 05:50:14 AMQuote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true. If you no work towards am you go still be poor man because Dem say faith without work is dead. many talents dey waist because of pospondment. Wetting you don sabi you go dey doll yourself, dey see yourself like you never mature for the job or time Still dey. When your mate don meet up, you go come  dey envy them say na juju or na yahoo then dey do, were as you get that opportunity.One na make I see result from people wey dey do am first before I go do. Na still time you dey waist.And another na to find Fault in people. This person no dey gree help person, him dey greedy upon all the Money him get him no fit help me. The country hard. 9ja na the survival of the fittest, so to make am you no need to do like your life depends on people. Work hard and you go see the results.One fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend. when dey see you Dem go dey hide because them no say na beg you wan come beg them. But if you dey hardworking, Dem go like to come close to you because They no say you no go beg them again.So make we no dey procrastinate or too much depend on people because time waits for nobodyThank you.Na very good topic your bring like this o e get one saying wey old people been the use say when person mates they mad make you follow them mad, this saying no really mean madness but it means say as people  they struggle to meet up life make we too struggle like them. One of the things wey dey also draw us back for life na fear of failure and na fear be the greatest enemy wey man get because some of us for don make am by now but because say we dey fear to lose or we dey fear say make we no enta problems come make some of us come dey stagnant.Another factor wey come make some of us dey lazy na to they use this word say everyone get set time: this saying don make many people fail for life as when some of us tries something and it fails us we go come dey afraid to try again then we come they talk say maybe say our own turn never reach.It is important for us not to lose focus even if we have been trying and failing as success is never achieved on a platter of gold but through hardwork, commitment and consistency. Even if we keep trying and in fail us make we also start something new and see how it will turn out.Any boody wey dey fear because you don't fail before, you go end up being a total failure. Nelson Mandela say falling no be failure but when you refuse to rise again naim be falure. Dem come also say. \"down fall of a man is not the end of his life\" So make person no take because you do before and e no favour you come decide say you no go try again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "October 05, 2023, 06:52:13 AM",
      "body": "This one na better update you bring so o. Plenty people don cast their gifts and talent because them dey procrastinate. I know say better courage dey needed to start something big but make the fear pf failure no make us come dey jones when we suppose dey bold. One thing wey dey help me be say, I dey draw strength and courage from people them wey don accomplish wetin I wan do. As I just tell myself say person don do am before, the strength go come and I go start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "October 05, 2023, 07:26:55 AM",
      "body": "Quote from: Salahmu on October 05, 2023, 06:34:51 AMQuote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. OP I like the topic but I think I will disagree with you on this, when you said the skill but lack courage to work on it, if I may ask what kind of skills are you referring to?, is it self employ skills or industrial skills? If is self employ skills how can you put your skill to work when you are financially unstable because there are people whom the kind of skills they acquire can take up to a millions plus to set up the workshop so how do you expect someone who could barely have three square meal a day to get up to a million naira plus to start up a workshop and also when we talk about industrial skills we are Reffering to the skills that can only be put to work or practice in an industrial or construction company and we no how difficult it is on getting a job from oil companies and even if there is job advert that includes your skill they will  need five years of working experience so how could someone applied when they don't have such years of experience, so there are people who has different skills but we're not giving the opportunity to showcase there talent so can we blame such person for not trying?. Thank you I like your comment wether na self employment skills or industrial skill, it must no necessarily be a skill wey you go get millions before you start. Make we take for example say you learn barbing or electrical work or fashion and designing, no necessarily mean say you must open a shop wey go take you like #1m before you start you go need to go find were you go attach yourself sothat the little small small money wey you ft dey save you fit use am start small shop. From there you start to get customer from there people don dey sabi you. Gradualy your shop don dey full rather Dan expecting money from people before you start.Then as for the industrial work I no say to get the work day hard. especially when you get big skill. But if you get luck see one, try invest because company work no be your papa work. No be say you go just dey move from company to company dey say I be welder I be fitter or I be crane operator were you know say those company work no dey lastHuman being will always find a reason for excuses.in my local government there is a skill aquisition program/training after completion Dem go give them equipment to Star there own business, guest what? Dem sell the equipment cary d money do wetting Dem like. And the purpose of the skill became void.Example of skills and equipment given:Fashion and designing===sewing/embroiding machine and some other items were given to themInterior decorations and catering°=== dip freezer, blender, baking utensils,plastic chairs/table gas cylinder and four mouth electric cooker plus pay off.Welding and fabrication==welding/grinding machine, welding tounge, bench vice and all plus pay off. And many other skill unmentioned. What did dey do dey sold them and are still looking for another opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "October 05, 2023, 11:57:20 PM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true.OP I want make this proverb wey you give now sink inside the brain of our younger brothers and sisters o. Because the way wey boys dey para now dey scary. Some, I wonder who dey give them that prophecy say dem go rich for their young age, wey come dey influence them to go join bad things to make money. I dey tell plenty of my younger ones say, inasmuch as them get live, them still get plenty home. likewise, inasmuch as them get plenty hope, success go sure reach their doorstep. But them too must to learn how to stay true to their hustles. God no dey give squirrel groundnut make e hold because him longer throat no go make the squirrel allow make the groundnut grow naturally. There's more to live that meets the bare eyes.Thank you OP for this insightful one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 06, 2023, 01:17:13 AM",
      "body": "Make we clear ourselves for this matter, the true thing wey dey affect most people na their background, that is their upbringing. No wonder Dem say \"Quote no let your background put your back for groundMany children self esteem don dey destroyed due to bad parenting , so this children no get mind of their own even as Dem dey grow up. That kind child no go fit manifest in full potential until person give am mind. This same thing na ihn don cause serious casalar for naija. Many children wey dey influenced into bad gang today na poor parenting cause the whole problem. Every child wey grow from the home of love always get the confidence to push forward to succeed base on say ihn parent don build am dat way. We know say financial help dey for one side ooo, even in face of scarcity, picking wey self esteem dey intact go always seat down reason the way out and ihn go take giant step towards it. U see children wey grow from house wey be say father na johnsona and mother na Anthonin joshua and children come be referee and spectator, hmmm, those kind picking always dey face big mind problem until the problem redesign their mind to think wellSo the point be say, as you too start to bear children 1 or 1 dozen , lol, abeg allow love dominate make picking fit get better mind to begin learn good decisions wey fit make ihn life better.Op , as you don know say you get fear now, rise up and be up and doing, allow others laugh you now cause Dem go still laugh with you celebrate your success.QuoteOne fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend. when dey see you Dem go dey hide because them no say na beg you wan come beg them. But if you dey hardworking, Dem go like to come close to you because They no say you no go beg them again.Na better advice you give but no be all ready help others.e depend on the kind person.  Hustle save money , start business, take a low pay job , gather small money and start something small with big plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "October 06, 2023, 03:46:13 AM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true. If you no work towards am you go still be poor man because Dem say faith without work is dead. many talents dey waist because of pospondment. Wetting you don sabi you go dey doll yourself, dey see yourself like you never mature for the job or time Still dey. When your mate don meet up, you go come  dey envy them say na juju or na yahoo then dey do, were as you get that opportunity.Chairman I almost laughed out when I actually see this quote about concerning a prophesy and being the richest man in your family because this actually na true because most of us done take religious prophecy pass our hard work and seriousness sometimes na these prophecy dey make people think say all dey well with them say watin go be go be but na big lie because faith works with action and if action no dey then na just pure stupidity and most people in our country today have an outcome of this share stupidity. OMO like you talk am my brother time no dey so anyone way get this same mentality better just change am and follow up with something doing because e go bad well well when you find out the truth when time don already leave you run so make we try engage ourselves in something and let God bless the hand of your work because that na the only way for the prophecy to hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "October 07, 2023, 04:36:48 AM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true.If you no work towards am you go still be poor man because Dem say faith without work is dead. many talents dey waist because of pospondment.Even  bible talk am say faith without good works is futile, so even if your pastors vision dey correct, e no go come to pass if you no work hard towards am. The importance of hard work can never be overemphasized. Its what separates the rich from the poor, ability to take risks and work towards your goals. Poor man too dey far and those fears gradually developed into lazy habits. QuoteAnd another na to find Fault in people. This person no dey gree help person, him dey greedy upon all the Money him get him no fit help me. Although its good to help people, but if nobody wan help you, you no get option than to help yourself. One other thing that's a problem is mentality of entitlement. You're not entitled to anybody's money because you didn't give any money to then to hold for you. you've to be humble, with good sense of humor and everything will fall in placeQuoteOne fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend.Make I mention say, this days people no dey help who no dey hardworking cos its obvious say you go waste the money. If you dey ask person to support your business or endeavors with clear evidence and plan of success, your more likely to receive help cos every businessman or even ordinary men like seeing prospects before giving out money and they like seeing their money as investment into your life, than just dashing you money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 07, 2023, 09:31:16 AM",
      "body": "Time indeed waits for no one but at the same time too take things wayor wayor make you no go miss out on the little things. Sometimes,  I dey see parents they rush their children through school; you go see Pikin of 9 dey jss2( this is not a bad tin if the child is very brilliant and intelligent) but some dey do am because odas they do am and as such the pikin fit miss out on things him mates dey do all because the parents want am to grow up fast.The thing I dey try tok nah say even if time waits for nobody, understand say no be everybody sopoz do one thing and succeed at it, else there won't be room for diversity. Just because say you no wan dey labelled lazy no mean say you because your friend grow im riches through trade, you sef you go kee yasef their.. Know the areas you dey good at and nah the sky go be the starting point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "October 07, 2023, 03:23:43 PM",
      "body": "This is what actually affected most of my friends and brothers when I say lemme help them by bringing them up to follow the industry many of them said they are busy while some said they can't leave their family to learn this things we are doing here, naturally to belong here you need to be dedicated and devoted irrespective of all you do outside.But some people go just want to start wetin dem no sabi and expect to get results like their mentors or boss, the fact is you need to pay sacrifice to understand what your boss knows about any business you are doing today that is why people don't want to spend rather they would keep saying \"Oboy I no get that time oo\" okay, when do you think you would have the time to learn what would give you money.The truth is always bitter since I joined here my thinking changes and my way of reasoning changes as well because almost all my daily talking belong here, my social media chats is here I don't waste my precious time on facebook, twitter just to discuss with people that won't add any value to your life's. The best is take a bold step and start whatever skills you think would help you tomorrow as I know too well that what will keep you ontop is skills and not certificates, there are thousands of graduate out there today that are out there that is not making used of their certificate rather is their skills.Our brothers are so much fools of their selves especially, those people who happens to have oil companies in their State and communities, after graduation they solely rely to work on oil companies while a small boy of 20 years go learning a skill to become a programmer could just be at home earning six zeros why they still wait for those their so called oil companies to get them employed. Well lemme just cut whole story, we need not to wait till we see results from people by then it could be too late for you to start by then you would feels such people are hiding something from you without knowing is the time they invested to know what they knew.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "October 07, 2023, 05:03:23 PM",
      "body": "Na true talk o. Time waits for nobody. All the while I don know say if something dey for person mind, e go must find way to manifest in reality. I always use my story of Bitcoin and how I joined this forumtalk to encourage others to do so in their individual lives, and see how much change they will achieve. The message is to join the group or associate with the people you know would shape you into what you hope to become.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roseline492",
      "created_time": "October 07, 2023, 06:39:25 PM",
      "body": "True true time wait for no body ooh, so as we they young now make we try utilize the opportunity by working hard for better tomorrow because if we fail to hustle now, na tomorrow we go suffer am, they talk say person way fail to plan, plan to fail, na this kind of advice way one man been they advise me say make I hustle ooo, say the biggest mistake way him make was being reluctant when people been they hustle and he was depending on his parents money say when the parents died say na that time way him eye open and money no they again for them to start with and now he is old no more strength for work again and he is feeding from hand to mouth, so waiting him han me say make i try hustle as we still they Young so that tomorrow go better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "October 07, 2023, 10:59:42 PM",
      "body": "If to say time dey wait for person, many people for never reach were them dey and many people for done become big boys and big girls, well sha nah true way you talk so, time no dey wait for any fucking human beings, so any body way dey dicive em self say because pastors done tell am say em go become the richest man tomorrow and that person no dey do anything to help em self, nai be say they person dey so em self bad.e get some people way everytime dem get excuse and those set of people nah the kind of people way too dey lazy to hustle for life, as a good citizen of any county you have to work your self out and hope for God to bless the works of your hands, some people know know say the best advise for this life nah the one way dem dem give there self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 10, 2023, 04:55:45 PM",
      "body": "Quote from: Salahmu on October 05, 2023, 06:34:51 AMQuote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. OP I like the topic but I think I will disagree with you on this, when you said the skill but lack courage to work on it, if I may ask what kind of skills are you referring to?, is it self employ skills or industrial skills? If is self employ skills how can you put your skill to work when you are financially unstable because there are people whom the kind of skills they acquire can take up to a millions plus to set up the workshop so how do you expect someone who could barely have three square meal a day to get up to a million naira plus to start up a workshop and also when we talk about industrial skills we are Reffering to the skills that can only be put to work or practice in an industrial or construction company and we no how difficult it is on getting a job from oil companies and even if there is job advert that includes your skill they will  need five years of working experience so how could someone applied when they don't have such years of experience, so there are people who has different skills but we're not giving the opportunity to showcase there talent so can we blame such person for not trying?. You are very correct, just like me I studied surveying and most of the instruments used for survey jobs are very costly like theodolite, total station, Gps and lots more so it requires huge amount of money before you can buy this equipments so the best thing is just that people should be involved in lots of skill so that if your major skill doesn't assist you, others skills can help you at least to a direction that can make you get money to purchase instruments that would be requid to start developing your skills or set up your workshop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "October 11, 2023, 06:17:43 AM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMOne fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend. when dey see you Dem go dey hide because them no say na beg you wan come beg them. But if you dey hardworking, Dem go like to come close to you because They no say you no go beg them again.So make we no dey procrastinate or too much depend on people because time waits for nobodyThank you.Bro this your talk sweet me well well because no be even your uncle alone na everybody because they go dey assume say na money matter you dey bring so dey go dey hide for you. Person need to hustle because if you dey depends on person that one dey dangerous because any thing fit happen either the person go fire you or the person go die, then if any of this happen you Don go square zero be that.In this world wey we dey now we need to be honest to ourselves and must believe riches comes from God and no amount of hard work you do will make you rich but still don't relax stand and take a step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartCharpa",
      "created_time": "October 11, 2023, 07:49:11 AM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true. If you no work towards am you go still be poor man because Dem say faith without work is dead. many talents dey waist because of pospondment. Wetting you don sabi you go dey doll yourself, dey see yourself like you never mature for the job or time Still dey. When your mate don meet up, you go come  dey envy them say na juju or na yahoo then dey do, were as you get that opportunity.One na make I see result from people wey dey do am first before I go do. Na still time you dey waist.And another na to find Fault in people. This person no dey gree help person, him dey greedy upon all the Money him get him no fit help me. The country hard. 9ja na the survival of the fittest, so to make am you no need to do like your life depends on people. Work hard and you go see the results.One fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend. when dey see you Dem go dey hide because them no say na beg you wan come beg them. But if you dey hardworking, Dem go like to come close to you because They no say you no go beg them again.So make we no dey procrastinate or too much depend on people because time waits for nobodyThank you.Even if you dey do hard work like tomorrow no dey, no be everybody get mind to come close to you, your friends fit first you sabi way of making money them no go like give you money if you feel like say you are disturbing them they should show you way so that you can provide for yourself, that's when you will know the kind of friends or relatives you have because we can't just keep disturbing our friends or family about our problems. But it's better to show me how to catch fish better than how to eat fish, i know say one day it will tire him it's better for me to start making it myself.Many people are trying their best to become better person and bring the best out from them, but how this country still be you can't just have talent and be thinking you can use it and make money,maybe this country has been cursed I just don't understand, hard work and pray that is all we need to be doing for ourselves and survive this country things are still getting hard for the youths, you go just dey see everybody complaining and is all about money nothing else, as fuel prices first increase we be dey think say na better thing wan happen to our country and see wherever we are heading to this time around. Time really wait for nobody and we don't have to give up in whatever we are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "October 11, 2023, 08:18:50 AM",
      "body": "Quote from: Samlucky O on October 05, 2023, 05:25:12 AMMy country people! Really time wait for nobody. Many of us here get skills but Lack the courage to work towards am. Say man of God prophesy to you say you go be the richest man for your family no mean say d dream must come true. If you no work towards am you go still be poor man because Dem say faith without work is dead. many talents dey waist because of pospondment. Wetting you don sabi you go dey doll yourself, dey see yourself like you never mature for the job or time Still dey. When your mate don meet up, you go come  dey envy them say na juju or na yahoo then dey do, were as you get that opportunity.One na make I see result from people wey dey do am first before I go do. Na still time you dey waist.And another na to find Fault in people. This person no dey gree help person, him dey greedy upon all the Money him get him no fit help me. The country hard. 9ja na the survival of the fittest, so to make am you no need to do like your life depends on people. Work hard and you go see the results.One fact about rich people be say Dem no dey like lazy people. That's why some people no ft get help from there uncle or friend. when dey see you Dem go dey hide because them no say na beg you wan come beg them. But if you dey hardworking, Dem go like to come close to you because They no say you no go beg them again.So make we no dey procrastinate or too much depend on people because time waits for nobodyThank you.Op menhn the rate self at which i dey see people dey depend on people now adays just dey tire me, social media own na beg beg people full am now, just small lets say maybe your picture fine or lets say you post pictures menhn you go start to get beggers for dm if no be card na one thing one thing and some account now na guys dey use am beg, me go dey ask my self is it that this people no get two hands and leg the way others follow get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sotelorene",
      "created_time": "October 11, 2023, 11:37:43 AM",
      "body": "Truly time waits for nobody, life is like a journey and it doesn't matter how long we live but what matters is how well we are able to live our lives, so the early we start or begin to focus on how we can make our future conducive for us the better, we no the situation in the country right now is very difficult but that doesn't mean we will also dance to there tune, perhaps there are some good quality skills that could help someone attending to there daily needs while waiting for the right one to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}