{
  "id": "topic_5410267",
  "title": "pbies",
  "author": "pbies",
  "created_time": "August 17, 2022, 07:08:08 PM",
  "content": "1. Is bitcoind -daemon enough to run full-node?2. Is running bitcoind -daemon enough to verify transactions?3. Which wallet in this case will be selected to receive fee?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410267",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "August 17, 2022, 11:51:56 PM",
      "body": "No, if it's newly installed you need to wait after you send the command bitcoind -daemon it will start downloading the blockchain until it is fully synced before it becomes a full node.To verify if it's fully synced you need to send this command bitcoin-cli getblockcount and compared it on this https://blockchain.info/q/getblockcountFull node only full validates transactions and blocks. About your 3rd question, what do you mean to receive a fee? Does it seem that you want to run a full node to earn from the transaction fee? Running a full node is not like that you need an ASIC unit to be able to mine blocks and get rewarded by fees and block rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 18, 2022, 09:34:01 AM",
      "body": "Quote from: pbies on August 17, 2022, 07:08:08 PM1. Is bitcoind -daemon enough to run full-node?2. Is running bitcoind -daemon enough to verify transactions?(I will add to previous answer)Keep in mind that if you don't do port forwarding, your node will not be accessible from outside, will only connect to other nodes (will have outbound connections, but no inbound connections).While it still verify transactions even from this stance, some don't consider it proper full node.Quote from: pbies on August 17, 2022, 07:08:08 PM3. Which wallet in this case will be selected to receive fee?The transaction fee will be received by the miner (or mining pool) that's mining the block in which the transaction is included.----Please also consider moving this topic to beginners & help.Also maybe you ask more questions on the matter, you seem to have some sort of confusion (just a hunch), and if so, it would be better you clear everything up instead of assuming incorrectly this or that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}