{
  "id": "topic_5440642",
  "title": "saccoface",
  "author": "saccoface",
  "created_time": "February 21, 2023, 05:31:51 AM",
  "content": "New project that uses timestamping tech to verify PoS chain transactions on Bitcoin's network.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440642",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "February 21, 2023, 01:08:38 PM",
      "body": "Are you talking about this one[1]? Sounds more like an altcoin rather than a Bitcoin project. This is my first time hearing about it, and my impression of them is not really that good. They leverage Bitcoin security to secure other chains, which to some extent means that they don't believe other chains are secure. It makes you question why those networks were launched in the first place if they can't stand on their own and rely on other networks, which adds another point of failure (even if it is as secure as Bitcoin).From what they wrote in their technical paper, it seems like the main focus of the project is to reduce stake unbounding[2] to prevent some kind of attacks on the PoS ecosystem connected through Babylon. If you want a more technical review, maybe posting this on altcoin technical discussion or serious board would be better. At the end of the day, the launch of this project kinda amplify the beliefs that PoS is not as secure as PoW, and the tradeoff between security and scalability is still debatable in many ways. CWIIW. [1] https://www.babylonchain.io/technology[2] https://arxiv.org/pdf/2207.08392.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "February 22, 2023, 05:40:31 AM",
      "body": "Quote from: saccoface on February 21, 2023, 05:31:51 AMNew project that uses timestamping tech to verify PoS chain transactions on Bitcoin's network. I thinkthis has not been noisy in the cryptocurrency business industry, because when I looked at their YouTube video or blog, there were only a few viewers who looked and watched.It means that this was not liked by the majority of the community here in this forum and even on various social media platforms it was not noisy, in short it's not attractive for the investors anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 22, 2023, 02:18:23 PM",
      "body": "Quote from: gunhell16 on February 22, 2023, 05:40:31 AMI thinkthis has not been noisy in the cryptocurrency business industry, because when I looked at their YouTube video or blog, there were only a few viewers who looked and watched.Are Youtube and blogs good metrics to measure if a project is popular or not? As far as I can tell, they are not really that popular for marketing purposes. Most new projects seem to use Twitter to do their marketing. That being said, there are some popular Youtubers who make crypto content, but most of their viewers don't really want to find new projects to invest in, they want content related to news, drama, or investigations.Quote from: gunhell16 on February 22, 2023, 05:40:31 AMIt means that this was not liked by the majority of the community here in this forum and even on various social media platforms it was not noisy, in short it's not attractive for the investors anyway.Personally, I do agree that this project is not that interesting. At the very least, it is not useful for my interest in the crypto market. But the reason why they are not popular can be many things, including the lack of marketing. In fact, I never heard about them even though I use Twitter regularly. They have decent followers but it seems most of their tweets are never shared by others, so that's that. I don't think they are looking for investors anyway, just that there are no live products that use them right now. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EdgyK",
      "created_time": "February 24, 2023, 12:01:58 AM",
      "body": "It's great to see so much excitement around the potential for blockchain technology to transform various industries, including finance and gaming. While there is still much to be done in terms of widespread adoption and scaling, it's clear that blockchain has the potential to revolutionize the way we think about data storage and security.One interesting area where blockchain is already having an impact is in the world of gaming. By using blockchain-based tokens or assets, game developers can create unique in-game items or currency that can be bought, sold, and traded outside of the game environment. This has opened up new opportunities for gamers to earn real-world value from their time and effort spent in virtual worlds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 24, 2023, 04:16:30 AM",
      "body": "Quote from: joniboini on February 21, 2023, 01:08:38 PM.. At the end of the day, the launch of this project kinda amplify the beliefs that PoS is not as secure as PoW, and the tradeoff between security and scalability is still debatable in many ways. Yes, I agree with you on this point. Such ideas will not be very welcome in the Bitcoin community, the vast majority still believe that PoW is the best and most secure of all networks, despite the presence of some problems such as scalability and consuming more energy.As for the POS, it reduces energy consumption and reduces fees and time somewhat, but its main drawback is security, as it is moving towards more centralization, and this is what the Bitcoin community does not like at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saccoface",
      "created_time": "February 27, 2023, 03:48:44 PM",
      "body": "Quote from: yhiaali3 on February 24, 2023, 04:16:30 AMQuote from: joniboini on February 21, 2023, 01:08:38 PM.. At the end of the day, the launch of this project kinda amplify the beliefs that PoS is not as secure as PoW, and the tradeoff between security and scalability is still debatable in many ways. Yes, I agree with you on this point. Such ideas will not be very welcome in the Bitcoin community, the vast majority still believe that PoW is the best and most secure of all networks, despite the presence of some problems such as scalability and consuming more energy.As for the POS, it reduces energy consumption and reduces fees and time somewhat, but its main drawback is security, as it is moving towards more centralization, and this is what the Bitcoin community does not like at all.So if a POS chain has the ability to leverage POW/Bitcoin security, isn't that a huge advantage? Now PoS becomes more secure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 28, 2023, 01:48:26 PM",
      "body": "Quote from: saccoface on February 27, 2023, 03:48:44 PMSo if a POS chain has the ability to leverage POW/Bitcoin security, isn't that a huge advantage? Now PoS becomes more secure. Sure, but the question still remains. Why do you need to launch a PoS chain if, in the end, you need to rely on another chain to make sure your transactions are not reversible? You can simply launch a decentralized database without any crypto at all and then chain the hash to Bitcoin or something similar. While I do agree that fast transactions can be beneficial if you want to use them for payment activities, from a security perspective this means the chain by nature is unreliable since the beginning. At the very least, the proposal for this project that you shared is not that convincing as far as I can understand it. That being said, I can understand why some people like the idea of relying on Bitcoin when they can launch other coins and use PoS to get faster transactions. As long as they can make sure the attack does not happen before the timestamping on the BTC network is done, it might work for their purpose. The next question would then be how reliable it is. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}