{
  "id": "topic_5471945",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "October 27, 2023, 09:47:24 PM",
  "content": "The suspension for the listed trading pairs will start on November 30. The suspension will be in November and December.I suppose not to come with this on this forum but I know how many traders are trading USDT which I think would be a good reason to bring this to this forum. It is because of regulatory changes:Quote“In accordance with recent Canadian regulatory changes and following extensive consultation with the CSA and OSC, we today notified our clients that we will soon be suspending trading for USDT, DAI, WBTC, WETH, and WAXL.”https://cointelegraph.com/news/kraken-suspend-trading-usdt-dai-wbtc-weth-and-waxl-stablecoin-canada",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471945",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "October 27, 2023, 10:07:30 PM",
      "body": "It looks like the regulatory atmosphere in Canada is very hostile for crypto assets and crypto exchanges all together, so no surprise. Bybit and Binance have announced exiting the Canadian market.OmegaStarScream shared this a while backQuote from: OmegaStarScream on April 14, 2023, 10:33:07 AMSo with the new regulations regarding exchanges[1] in Canada, it looks like many platforms are shutting down their services in the country. To mention a few:- DyDx[1] (DEX)- OKX[2] (CEX)- Paxos[3] I've also seen mentions of Deribit and Blockchain.com in some other articles.What are your thoughts on this? Do you think this is actually necessary to avoid another FTX-scenario? [1] https://www.securities-administrators.ca/news/canadian-securities-regulators-strengthen-oversight-enhance-expectations-of-crypto-asset-trading-platforms-operating-in-canada/[2] https://www.cryptotimes.io/decentralized-exchange-dydx-pulls-out-of-canadian-market/[3] https://cointelegraph.com/news/okx-to-cease-operations-in-canada-by-june-22-2023[4] https://coingeek.com/paxos-exits-canada-amid-increasing-regulatory-crackdown/They are even going after exchanges that try to promote self-custody wallets. Those guys are just nuts  Regulator in Canada Warns Crypto Exchanges Not to Promote Self-Custodial Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}