{
  "id": "topic_5468479",
  "title": "@sriyan",
  "author": "@sriyan",
  "created_time": "September 28, 2023, 08:06:28 PM",
  "content": "What do you think about the starknet airdrop? What kind of scenarios will be checked at the snapshot? I will share my ones. Please share yours.1. Number of transactions(Number of months/weeks/days)2. Total Volume(Bridge/ swap)3. LP Value4. Wallet balance5. Number of contracts6. Starknet ID(Optional)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468479",
  "comments": [
    {
      "author": "tvplus006",
      "created_time": "September 28, 2023, 09:04:48 PM",
      "body": "Quote from: @sriyan on September 28, 2023, 08:06:28 PM...I will share my ones. Please share yours...You have listed all the criteria that were used by the Arbitrum team to distribute airdrop among early users of the network. All these multipliers will be taken as a basis by other projects that will also decide to distribute airdrop. As for the Starknet, you can also add the use of an official bridge https://starkgate.starknet.io.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 29, 2023, 12:01:55 AM",
      "body": "Quote from: @sriyan on September 28, 2023, 08:06:28 PM1. Number of transactions(Number of months/weeks/days)2. Total Volume(Bridge/ swap)3. LP Value4. Wallet balance5. Number of contracts6. Starknet ID(Optional)I am really hoping they will do what Arbitrum did, and also consider Sybil's addresses and this time they will become more strict or able to identify a lot of addresses that are just farming or abusing any airdrop just in case they have any.From what I can see now, airdrop on new chains seems very overrated already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "September 29, 2023, 03:24:17 PM",
      "body": "Quote from: GreatArkansas on September 29, 2023, 12:01:55 AMFrom what I can see now, airdrop on new chains seems very overrated already.Or, maybe we are gonna see the end.IMO, based on the tragedy from (SAI) all of these people who are hoping Airdrop makes some movement and the company has some damage because hashtag #SAISCAM trending on twitter. I really believe this is gonna to be one of reasons they're not doing some airdrop. Make the user speculation by themself have some airdrop, as always the user always make these assumtion. The reality developer are not gonna to give anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 29, 2023, 05:16:49 PM",
      "body": "Quote from: ryzaadit on September 29, 2023, 03:24:17 PMIMO, based on the tragedy from (SAI) all of these people who are hoping Airdrop makes some movement and the company has some damage because hashtag #SAISCAM trending on twitter...Despite the abundance of various coins, there are no SAI coins yet. I can assume that you are writing about SUI, whose team, instead of airdrop, gave an opportunity to those who registered with Discord to take part in the sale. Yes, it was really a big disappointment for those who created dozens of wallets hoping to get airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xxmodded",
      "created_time": "September 29, 2023, 07:38:07 PM",
      "body": "Don't be enthusiasm with airdrop model like this, you can join with using free money and worry will get the same cases like SEI airdrop project, need to spent much fees for qualifying with starknet airdrop but there are still fifty percentage for getting or this airdrop have allocated coins for airdrop participants. I don't interested yet with airdrop have spent fees actually not clear with roadmap until how long will launching mainnet coin. You can see many kinds or retroairdrop not tell specific with their road map and until how many long mainnet coin will open to public. If you have much fund spending for fees its not bad ideas make speculation with this airdrop model, have two option later they have an airdrop or will open public sell on market and there are not airdrop allocated for hunter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "October 01, 2023, 07:24:54 AM",
      "body": "Quote from: @sriyan on September 28, 2023, 08:06:28 PMWhat do you think about the starknet airdrop? What kind of scenarios will be checked at the snapshot? I will share my ones. Please share yours.1. Number of transactions(Number of months/weeks/days)2. Total Volume(Bridge/ swap)3. LP Value4. Wallet balance5. Number of contracts6. Starknet ID(Optional)I think continuous activity should always be the top priority for any new chain doing airdrop, which means maximizing these factors:Number of transactions(Number of months/weeks/days)Total Volume(Bridge/ swap)LP ValueNumber of contractsAlso, due to sybil concerns these days, make sure your wallet has activity on other/existing chains too. This will make your address less likely flagged as sybil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "October 01, 2023, 09:15:57 AM",
      "body": "Quote from: @sriyan on September 28, 2023, 08:06:28 PMWhat do you think about the starknet airdrop? I don't even know when this airdrop will come. The community of starknet makes me feel confuse. I talked with admin if the snapshoot has not yet taken by the community said in the discord if snapshoot already taken which was referring to the its whitepaper. It's confusing me which was the true story about this airdrop? The token already issued, but it's still remain uncertain. Quote from: @sriyan on September 28, 2023, 08:06:28 PMWhat kind of scenarios will be checked at the snapshot?The possible scenario if the snapshot has taken since last year and people who are working start from this team will receive nothing. Everything still remain unclear. Even the tokenomic was not also explaining so well about the distribution of starknet token. Quote from: @sriyan on September 28, 2023, 08:06:28 PM I will share my ones. Please share yours.1. Number of transactions(Number of months/weeks/days)2. Total Volume(Bridge/ swap)3. LP Value4. Wallet balance5. Number of contracts6. Starknet ID(Optional)Did you forget to put bridge as the most important thing to do first before competing another task?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 01, 2023, 09:48:55 AM",
      "body": "How come i never seen this project advertised here or even come to see them here could it be it I don't cover up wider range of the forum, maybe they might be active on twitter (X) because lots of the project today doesn't come to make their promotions here but they are being known, initially I was thinking any projects that has never been advertised here is not a trusted one this could be false because there could be some of them that did their marketing without even launching here.For the airdrop well I am not too certain what other modalities they will implore to measure their airdrops to its users except using the amount of percentage hold by user or the subtotal amount that are being traded and transacted within a given wallet address. I think I have to start paying attention to altcoin this time around to know many of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 01, 2023, 08:11:31 PM",
      "body": "Quote from: Adbitco on October 01, 2023, 09:48:55 AMHow come i never seen this project advertised here or even come to see them here could it be it I don't cover up wider range of the forum, maybe they might be active on twitter (X) because lots of the project today doesn't come to make their promotions here but they are being known, initially I was thinking any projects that has never been advertised here is not a trusted one this could be false because there could be some of them that did their marketing without even launching here...I am sure that not only have you not seen Starknet ads here, but also ads for other new blockchains, such as Optimism and Arbitrum, which have appeared over the past few years. It is obvious that now the teams promote their projects otherwise using Twitter and Discord and our forum is not included in their area of interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "October 02, 2023, 09:01:04 AM",
      "body": "QuoteI don't even know when this airdrop will come. The community of starknet makes me feel confuse. I talked with admin if the snapshoot has not yet taken by the community said in the discord if snapshoot already taken which was referring to the its whitepaper. It's confusing me which was the true story about this airdrop? The token already issued, but it's still remain uncertain. It was clearly mentioned in the tokenomics. it will be 9%. Yes. $STRK coin deployed in the ethereum blockchain for now. They have some new updates about gas fee to integrate to the starknet. After that they will move the STRK  from Ethereum to the starknet chain. If you check the contract, you can see the date nov 29 2023 is the first unlocked date.  I know the correct information about the snapshot. I think you are talking about the 2022 June-july snapshot right?   That is an example given by the starknet team to the public.QuoteDid you forget to put bridge as the most important thing to do first before competing another task? Already mentioned in the second tasks(Bridge and swap)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 02, 2023, 02:37:43 PM",
      "body": "Quote from: tvplus006 on October 01, 2023, 08:11:31 PMQuote from: Adbitco on October 01, 2023, 09:48:55 AMHow come i never seen this project advertised here or even come to see them here could it be it I don't cover up wider range of the forum, maybe they might be active on twitter (X) because lots of the project today doesn't come to make their promotions here but they are being known, initially I was thinking any projects that has never been advertised here is not a trusted one this could be false because there could be some of them that did their marketing without even launching here...I am sure that not only have you not seen Starknet ads here, but also ads for other new blockchains, such as Optimism and Arbitrum, which have appeared over the past few years. It is obvious that now the teams promote their projects otherwise using Twitter and Discord and our forum is not included in their area of interest.Maybe I can say no one refers them to this area of the forum.. Most times there are some collective ideas that comes from people over here and if they happens to have reputable user here in their midst i believe he would have ref them to make use of the forum to promote their projects. Most at times I am always shock to see new project coming up without even being link here that makes me started feeling as if they may likely scam people if eventually invested in those projects not listed here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaraherp91",
      "created_time": "October 02, 2023, 02:43:49 PM",
      "body": "Quote from: @sriyan on September 28, 2023, 08:06:28 PMWhat do you think about the starknet airdrop? What kind of scenarios will be checked at the snapshot? I will share my ones. Please share yours.1. Number of transactions(Number of months/weeks/days)2. Total Volume(Bridge/ swap)3. LP Value4. Wallet balance5. Number of contracts6. Starknet ID(Optional)No Drop Wasted time now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "October 03, 2023, 09:59:09 AM",
      "body": "Quote from: zaraherp91 on October 02, 2023, 02:43:49 PMQuote from: @sriyan on September 28, 2023, 08:06:28 PMWhat do you think about the starknet airdrop? What kind of scenarios will be checked at the snapshot? I will share my ones. Please share yours.1. Number of transactions(Number of months/weeks/days)2. Total Volume(Bridge/ swap)3. LP Value4. Wallet balance5. Number of contracts6. Starknet ID(Optional)No Drop Wasted time now    Airdrops receiving like market psychology chart. I think we are in the disbelief stage now. So the airdrop hunters not doing any transactions these days. Normally all the mainnet airdrops coming after the disbelief stage. Please keep an eye on 2024 April 15(New date of the STRK unlocked date).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 03, 2023, 08:24:36 PM",
      "body": "Quote from: @sriyan on October 03, 2023, 09:59:09 AM...So the airdrop hunters not doing any transactions these days. Normally all the mainnet airdrops coming after the disbelief stage. Please keep an eye on 2024 April 15(New date of the STRK unlocked date). Airdrop hunters will continue to create activity on the network until there is an official statement from the team that a snapshot has been made. So it is quite possible that on April 15 next year, the team will officially announce that the snapshot was made, for example, on September 1 or December 30, 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hamzaspy",
      "created_time": "October 06, 2023, 01:01:41 AM",
      "body": "There is already so much hype around layer 2 chains that its impossible for them to do well after launch because of so high mcap at start. I believe starknet airdrop will happen in first quarter of next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 06, 2023, 04:46:02 PM",
      "body": "Quote from: hamzaspy on October 06, 2023, 01:01:41 AM...I believe starknet airdrop will happen in first quarter of next year.The unlocking of tokens for early investors was postponed to April 15, 2024, which is confirmed by the data of this smart contract - https://etherscan.io/tx/0x3a7eb81afa9a01c43937a0dfa89062c9c53d45c1fb8fe50c84203958c2148092#eventlog It would be logical if there would be an airdrop on the same date, if the team makes such a decision. Therefore, you will not be able to become Cassandra))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "October 06, 2023, 06:04:59 PM",
      "body": "Quote from: tvplus006 on October 06, 2023, 04:46:02 PMQuote from: hamzaspy on October 06, 2023, 01:01:41 AM...I believe starknet airdrop will happen in first quarter of next year.The unlocking of tokens for early investors was postponed to April 15, 2024, which is confirmed by the data of this smart contract - https://etherscan.io/tx/0x3a7eb81afa9a01c43937a0dfa89062c9c53d45c1fb8fe50c84203958c2148092#eventlog It would be logical if there would be an airdrop on the same date, if the team makes such a decision. Therefore, you will not be able to become Cassandra))I read this news and very disappointed to hear that token has been postponed. We have to wait seven months more now. I was full ready for the airdrop because i am using Starknet network for many monthsa and completed many criteria for total number of transactions, increases volume, claimed NFTS and other condition. I hope there will be no strict requirements for airdrop.This news is good for those who have not started to use Starknet network yet and willing to use it. The more chances is that Starknet team has not taken snapshot of wallets and still have time for speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TakeItEasy",
      "created_time": "October 06, 2023, 07:34:41 PM",
      "body": "Quote from: @sriyan on September 28, 2023, 08:06:28 PMWhat do you think about the starknet airdrop? What kind of scenarios will be checked at the snapshot? I will share my ones. Please share yours.1. Number of transactions(Number of months/weeks/days)2. Total Volume(Bridge/ swap)3. LP Value4. Wallet balance5. Number of contracts6. Starknet ID(Optional)I have lost almost 1k dollars on Starknet Blockchain, doing the tasks that were a way to the Starknet Airdrop. Although I'm doing it now, and I think before the airdrop I will reach $3k. They have forwarded their Mainnet launch to 2024. I didn't think the first criteria ( Number of transactions) that would be included, as that is almost very easy, and most of the airdrops didn't put easy criteria for their airdrops. There can be Total Volume, because they are mostly focusing on volume now, on different exchanges, as one of their top exchange i.e. Jediswap, on which we did many swaps. The liquidity pool may be the criteria because I have seen many airdrops from different projects that gave token airdrops to the liquidity users, who added liquidity. If they do airdrop on all of these, I will be in between them I have tried all of them,   That will be a bigger surprise for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 06, 2023, 10:04:54 PM",
      "body": "Quote from: AnonBitCoiner on October 06, 2023, 06:04:59 PM...This news is good for those who have not started to use Starknet network yet and willing to use it. The more chances is that Starknet team has not taken snapshot of wallets and still have time for speculation. You cannot know whether a snapshot was taken or not, since this information cannot be disclosed before the publication of airdrop data. Anyone who decides to start being active in Starknet now should understand these risks, since, for example, the last airdrop from Celestia took a snapshot in January 2023, i.e. 9 months ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}