{
  "id": "topic_5403000",
  "title": "MARK21",
  "author": "MARK21",
  "created_time": "June 17, 2022, 05:37:10 PM",
  "content": "Me he econtrado una noticia algo curiosa, nos relata que un inversionista en Dogecoin (criptomoneda creada originalmente como una broma), pero cuyo valor aumentó y disminuyó a medida que la promovía Elon Musk ha caído un 93% .QuoteDogecoin perdió casi todo su valor tras el impulso de suba en las redes sociales.En su mejor momento, dogecoin consiguió una extrema suba de casi 1.100% en tan solo un mes hasta llegar a su máximo histórico. Todo esto se puede apreciar con la siguiente grafica: Dogecoin consiguió una extrema suba de casi 1.100% en Mayo 2021QuoteElon Musk enfrenta una demanda de USD 258 mil millones por inflar el precio de dogecoinEl demandante incluyó a Tesla, fabricante de automóviles eléctricos propiedad de Musk, ya que acepta al Dogecoin como pago por ciertos productos derivados. SpaceX también fue incluido por haber nombrado doge a uno de sus satélites. Johnson declaró que cree que Musk aumentó \"el precio, la capitalización de mercado y el volumen de negociación del Dogecoin\" a través de su promoción.Noticia de: https://www.criptonoticias.com/mercados/dogecoin-cayo-93-desde-maximo-elon-musk-demandado-inflar-precio/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403000",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "June 17, 2022, 09:09:51 PM",
      "body": "También vi esta noticia recientemente en Twitter y me pareció curiosa.Todos aquí sabemos de la manipulación de los mercados pos grandes actores den el mismo es algo que ocurre y que en muchas de las ocasiones es algo mal visto o ilegal.Creo que en este caso, Tesla como compañía puede aceptar cualquier criptomoneda que quiera por sus productos, en eso creo que no hay problema. Pero si los demandantes logran demostrar que el Señor Elon Musk realizó operaciones clave con Dogecoin antes del sus anuncios empresariales y después de estos en pro de hacerse con mucho dinero, entonces puede terminar mal para él.Se trataría de una táctica similar al front-running.En la cual un trader hace uso de información privilegiada que posee antes de los demás participantes del mercado para realizar movimientos que me garantizarían un buen profit.https://es.wikipedia.org/wiki/Front_running",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "June 18, 2022, 03:08:20 AM",
      "body": "Si alguien puede aguantar una demanda es El-On, si llegase a proceder cosa que no es imposible, pues los argumentos están ahí, pero en todo caso los \"arreglos\" extrajudiciales son màs económicos que ir a juicio, que supongo que es lo que busca el demandante, pero no olvidemos que hasta el mismo gobierno investigo a El-On y en Estados Unidos demandar es un negocio, a veces.Por otra parte esto de la perdida del +90% es algo a sacar con pinzas, creo que doge justo ahora a pesar de su precio $0.05637 es ganadora sigue siendo un boleto de lotería, el que siga sosteniendo Doge sigue sosteniendo un ticket ganador que no quiere cobrar.Ojo, la perdida es real, me explico, pero son esas cosas que hay que interpretar màs allá de lo que realmente sucede, la misma gráfica explica la situaciòn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "June 20, 2022, 03:54:58 PM",
      "body": "No quiero menospreciar a Dodgecoin.... Pero si alguien te dice que la mierda esta buena y tú no solo te lo crees, la pruebas, terminas el plato, sino que pides otro... pues ya hace tiempo que la culpa paso a ser por entero tuya.Elon lo mismo la cago al darle tanta publicidad, pero más por centrar la atención mediatica en una basura como Dodge, que ni antes ni ahora se entiende más allá que como la primera memecoin que aún con más fallos que aciertos tiene una comunidad activa, que como algo mínimamente serio o con algún futuro.Yo aún veo el precio de Dodge y no me lo explico... y puede bajar 10 veces más y seguiré sin explicármelo. Porque tendrá buena comunidad, y será muy usada, pero técnicamente, su emisión, características... es de lo peor que ha parido madre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "June 20, 2022, 05:36:08 PM",
      "body": "Vuelvo a coincidir plenamente con dominguero.Ademas no seria nada bueno que una demanda asi prosperase porque sentaria un precedente funesto de que casi cercenaria la libertad de expresion. Ademas Musk en redes es mas bien un troll.Y repito si alguien solo compra porque X lo dijo y porque si, porque tiene que subir, merece y es sano que se funda. Yo no estoy a favor de esa postura del siglo XXI de defender a los estupidos a toda costa. Una cosa es el abuso y otra cosa es tener que poner 587458455 instrucciones por culpa de unos estupidos vagos y egoistas que hacen cualquier cosa.Ojo entiendo lo que dice Hispo, pero a su vez como demostras eso? Porque tranquilamente Tesla te puede decir, yo si realmente aposte por eso fijate que acepto pagos con esa moneda. A su vez si no hay marco regulatorio sobre las crypto, con que vara juzgas?.Seria un caso mas practico hacerlo con lo que hizo con el BTC.-Lo acepto y creia en el (compran BTC por ende BTC sube)- La empresa despues señala de que puede generar calentamiento global y deciden cambiar de postura (Venden BTC - BTC baja de precio)Se queda con la ganancia de ese gap. Ahora bien  tranquilamente como empresa es justificable. Y aparte que por un solo jugador se derrumba el precio? No es que las cryptos son de la comunidad y son inviolables a eso?. Ahi entra otra enorme discusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "azhot",
      "created_time": "June 20, 2022, 07:06:00 PM",
      "body": "No se, es como si alguien fuese a demandar a Musk por lo que hizo con Tesla / Bitcoin, que prácticamente liquidó posiciones al poco de anunciar que había invertido. El problema con las cripto es que un tweet pueda generar tanto ánimo comprador. Cuando en una empresa que cotiza en bolsa sale una noticia similar puedes contrastar las fechas de las operaciones en la SEC. Y no faltan los Goldman y los Merryl de turno haciendo exactamente lo mismo que Elon Musk. Pero tienes información oficial contrastada por un organismo regulador para analizar la información, y eso es lo que a día de hoy le falta a las cripto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 20, 2022, 09:22:19 PM",
      "body": "Quote from: dominguero on June 20, 2022, 03:54:58 PM-snip-Quote from: darxiaomi on June 20, 2022, 05:36:08 PM-snip-Yo no soy nadie para decirle a la gente cuales monedas son shitcoins y cuales no lo son, pero yo personalmente veo a Dogecoin como lo que es: una moneda meme, su precio está completamente respaldado por el hype, FOMO y pasión de su comunidad (a falta de tope de emisión) y creo que debemos dar por lo menos un poco de credito a su comunidad por ser tan... activa(?) ...y poder mantener una moneda a fuerza de memes.Ahora bien, si ustedes creen que es injusto que Dogecoin ocupe un lugar en el top de capitalización de mercado que debería tener un proyecto más serio, entonces creo que podemos coincidir en ese punto. Lo queramos o no, la popularidad/casualidad no está ligada a las intenciones de avance:-Colon quería un camino nuevo a Asia y encontró América-Las galletas con chispas de chocolate fueron inventadas por accidente-Valve (los dueños de Steam) pensaron que Half-Life no vendería tanto Mientras que mañana un ingeniero consigue crear en papel un motor revolucionario luego de años de trabajo y le es difícil conseguir financiamiento para el prototipo, aunado que nunca sabremo de ello por los medios de comunicación.Sea injusto o no, esas cosas pasan, yo no sé porque pasan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "June 20, 2022, 09:38:11 PM",
      "body": "Quote from: Hispo on June 20, 2022, 09:22:19 PMLo queramos o no, la popularidad/casualidad no está ligada a las intenciones de avance:-Colon quería un camino nuevo a Asia y encontró América-Las galletas con chispas de chocolate fueron inventadas por accidente-Valve (los dueños de Steam) pensaron que Half-Life no vendería tanto Mientras que mañana un ingeniero consigue crear en papel un motor revolucionario luego de años de trabajo y le es difícil conseguir financiamiento para el prototipo, aunado que nunca sabremo de ello por los medios de comunicación.Sea injusto o no, esas cosas pasan, yo no sé porque pasan.Supongo que los ejemplos que mencionas pasaron en gran medida por cuestión de azar (yo no estaba allí y no soy testigo), pero lo que ocurre en los mercados de criptomonedas tiene un componente de emoción que es básico.Que la gente compre si Elon menciona equis shitcoin no es una casualidad, ni que esa misma moneda pierda prácticamente toda su plusvalía cuando los mercados entran a la baja en barrena. Entran en juego el FOMO y el Panic Sell, o dicho sin abusar de anglicismos ni neologismos, la codicia y el miedo de toda la vida.Siempre ha habido expertos en suscitar determinadas emociones en los demás, y parece que Musk ha encontrado el catalizador perfecto con Twitter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "June 20, 2022, 11:28:59 PM",
      "body": "Quote from: Hispo on June 20, 2022, 09:22:19 PMYo no soy nadie para decirle a la gente cuales monedas son shitcoins y cuales no lo son, pero yo personalmente veo a Dogecoin como lo que es: una moneda meme, su precio está completamente respaldado por el hype, FOMO y pasión de su comunidad (a falta de tope de emisión) y creo que debemos dar por lo menos un poco de credito a su comunidad por ser tan... activa(?) ...y poder mantener una moneda a fuerza de memes.Ahora bien, si ustedes creen que es injusto que Dogecoin ocupe un lugar en el top de capitalización de mercado que debería tener un proyecto más serio, entonces creo que podemos coincidir en ese punto. Lo queramos o no, la popularidad/casualidad no está ligada a las intenciones de avance:-Colon quería un camino nuevo a Asia y encontró América-Las galletas con chispas de chocolate fueron inventadas por accidente-Valve (los dueños de Steam) pensaron que Half-Life no vendería tanto Mientras que mañana un ingeniero consigue crear en papel un motor revolucionario luego de años de trabajo y le es difícil conseguir financiamiento para el prototipo, aunado que nunca sabremo de ello por los medios de comunicación.Sea injusto o no, esas cosas pasan, yo no sé porque pasan.Yo tampoco soy nadie, pero me gusta dar mi opinión y leer la de los demás.Y desgraciadamente siquiera creo que el puesto que ocupa dodgecoin sea injusto... por mi parte barrería todo lo que no tenga su propia blockchain. Por lo que una memecoin este en los primeros puestos, si me pongo a compararlo con los vecinos, lo veo incluso enternecedor. Al menos siempre tendrá un lugar como fenómeno social.Lo que critico de dodgecoin, es que en general, técnicamente hablando, como concepción, como usuario, viendo su emisión... es una chapuza tremenda; el fork mas mierdero de cryptonote le da mil patadas. Aparte sobrevive gracias al mergemining, lo que ya de por sí es algo que me plantea muchas dudas.Ahora... que no se me entienda mal, comparado con el resto de sus compañeros (exceptuando LTC, Monero, ETC...) es una maravilla. Aunque tengo que admitir que cuando vi el subidón que se metió, me entraron unas ganas locas de vender las cuatro shitcoins que había minado. Fue una locura totalmente irracional. Personalmente creo que el muy ceporro de Elon, siquiera supo prevenir las dimensiones de sus chorradas, lo mismo solo le hizo gracia un meme del chucho... y ahora viendo la que ha montado se le ha ocurrido lo de pillar twitter. Será un genio y el más rico del mundo, pero para mi que mayormente es un niño con demasiados juguetes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}