{
  "id": "topic_5444726",
  "title": "onko",
  "author": "onko",
  "created_time": "March 13, 2023, 02:15:56 PMLast edit: March 13, 2023, 02:28:52 PM by onko",
  "content": "Aztec Network yaptığı son duyuru ile birlikte, öyle tahmin ediyorum ki regülasyonlara dayanamayıp faaliyetlerini sona erdireceğini açıkladı.yakın zamanda 100m usd yatırım almış olması bile buna engel olamadı. ayrıca yaptıkları duyuruda, - http://zk.money üzerinde paranız varsa 21 Mart 2024'e kadar (bir yıl boyunca) ücretsiz çekebileceğiniz- 21 Mart 2023'te para yatırmanın kapanacağı- eğer topluluk forklayıp merkeziyetsiz sequencer çalıştıracak ise onları fonlayabileceklerigibi bilgilere de yer vermişler.https://twitter.com/aztecnetwork/status/1635211028727496705?s=20",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444726",
  "comments": [
    {
      "author": "MK-74",
      "created_time": "March 13, 2023, 10:25:36 PM",
      "body": "İlk konusunu ben açmıştım bu projenin, nereden nereye geldiler yazık oldu valla, Vitalik öyle her proje için twit atmaz ama bunun için atmıştı.Paranında her şeye engel olmadığını görmüş olduk bu proje ile.Açtığım başlık https://bitcointalk.org/index.php?topic=5303576.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yenerbatmaz",
      "created_time": "March 14, 2023, 12:02:54 AM",
      "body": "İşin adı kripto da olsa, biotech de olsa, uzay araştırmaları da olsa, insanların büyük çoğunluğu riskten ve maceradan uzak durmayı seven çekingen canlılardır, sosyal evrimin bir gerçeğidir bu.Konunun parayla falan zerre alakası yok, 1. dünyadaki kurulu düzenlerini değiştirip kanunların daha relax olduğu bir yere göç ederek anarko-kapitalistler gibi yaşamayı göze alamayanların kriptoculuk oynamalarından kaynaklı durumlar. Adam bütün dünya finans sistemini değiştirmeye yeltenen bir sektörün içine giriyor, ama yine her sabah Starbucks'tan lattesini içmek de istiyor (halbuki yerel çekilmiş kahve çok daha iyi  ), hala çocuğunun silahlı kitlesel saldırıların yaygın olduğu Amerikan okullarında okumasını istiyor vs vs, böyle insanları yerleşik sistem yüzyıllarca sömürmeye devam edecektir, en ufak bir yaptırım riskinde \"özür dileriz\"le başlayan mailların temeli budur...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "February 13, 2025, 05:44:35 PM",
      "body": "Bunlar foundation falan kurmuş ne alaka anlamadım.Link : https://x.com/aztecFND/status/1890050780331163768",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onko",
      "created_time": "February 14, 2025, 02:14:11 PM",
      "body": "aldıkları yatırımlar oldukça fazla ve SEC ile ilgili olan şirket kısmından Aztec'i ayırıp sanırım vakıf üzerinden faaliyetlerine devam edecekler.bir nevi kılıf değiştirip geri geldiler hocam, 28 senedir beklediğimiz $AZTEC yolda gibi gözüküyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "February 14, 2025, 02:49:44 PM",
      "body": "Quote from: yenerbatmaz on March 14, 2023, 12:02:54 AMİşin adı kripto da olsa, biotech de olsa, uzay araştırmaları da olsa, insanların büyük çoğunluğu riskten ve maceradan uzak durmayı seven çekingen canlılardır, sosyal evrimin bir gerçeğidir bu.Konunun parayla falan zerre alakası yok, 1. dünyadaki kurulu düzenlerini değiştirip kanunların daha relax olduğu bir yere göç ederek anarko-kapitalistler gibi yaşamayı göze alamayanların kriptoculuk oynamalarından kaynaklı durumlar. Adam bütün dünya finans sistemini değiştirmeye yeltenen bir sektörün içine giriyor, ama yine her sabah Starbucks'tan lattesini içmek de istiyor (halbuki yerel çekilmiş kahve çok daha iyi  ), hala çocuğunun silahlı kitlesel saldırıların yaygın olduğu Amerikan okullarında okumasını istiyor vs vs, böyle insanları yerleşik sistem yüzyıllarca sömürmeye devam edecektir, en ufak bir yaptırım riskinde \"özür dileriz\"le başlayan mailların temeli budur... Bana kalırsa efso bi özet. Karşı oldukları şeye karşı çıkamayacakları bi savaşın içindeler. Finansal boyutu ile harika bi yorum. Bunu yapabilecek cesaretleri yok. Buna da katılıyorum. Ama onlar gibi olan bir çok insan var. Ben de onlardan biriyim. Çünkü güvenli bi alanda kalmak evrimsel bi gereklilik. İçimizde olan bişi. Doğa ile savaşımızda merkezde kalan çoğunluklar kazandı. Bana göre hem sistemin içinde hem dışında olabiliriz. Sıfırdan bişiler yaratmaktansa sistemi hack'leyebiliriz. Starbucks'tan kahve içerken dünyayı hack'leyebiliriz. Bazı devrimler bi günde gerçekleşmez. Baya bi zamana ihtiyaç duyar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}