{
  "id": "topic_5451180",
  "title": "Sarah Azhari",
  "author": "Sarah Azhari",
  "created_time": "May 04, 2023, 02:26:38 AM",
  "content": "Kalau dulu aku ingat (pernah berpengalaman sebagai sales), strategi marketing itu banyak dilakukan secara face to face, sehingga interaksi antara pembeli dan penjual itu menjadi sangat kuat dan membentuk sebuah ikatan yang membuat pembeli akan datang lagi ke penjual yang sama. Beda dengan sekarang, dimana pembeli dan penjual hampir tidak pernah bertemu secara langsung, dan hanya bermodalkan trust atau rating bintang pada sebuah flatform Olshop. 1. Menurut kalian, apa dan bagaimana membuat strategi pemasaran yang bagus ditengah gempuran penjual baik secara global dan local (online)?.2. Apakah memasang iklan (misal crypto) di flatform seperti youtube dan signature (bitcointalk) masih cukup bagus diterapkan saat ini?3. coba kita membayangkan (sebagai costumer), jika melihat iklan youtube atau melihat endorsing signature yang dibawakan oleh sesama member di sini, adakah ketertarikan kalian untuk meng-klik?. atau membypass (lewati iklan) atau bahkan ada yng meng-hide signature dan avatar.Ini hanya sekedar survey pemikiran aku saja, misal seperti signature ini, tentu kalau tidak worth, pasti sudah tidak dipakai lagi sejak lama, tapi nyatanya sampai sekarang masih tetap ada, bahkan ada yang sampai bertahun-tahun.Namun, memang yang namanya marketing, pasti akan ada pasang surutnya, untuk itu aku mencoba berdiskusi dan bertukar pikiran tentang apa dan bagaimana cara marketing yang bagus di tengah pemasaran global saat ini.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451180",
  "comments": [
    {
      "author": "Renampun",
      "created_time": "May 04, 2023, 10:20:42 AM",
      "body": "Quote from: Sarah Azhari on May 04, 2023, 02:26:38 AMKalau dulu aku ingat (pernah berpengalaman sebagai sales), strategi marketing itu banyak dilakukan secara face to face, sehingga interaksi antara pembeli dan penjual itu menjadi sangat kuat dan membentuk sebuah ikatan yang membuat pembeli akan datang lagi ke penjual yang sama. Beda dengan sekarang, dimana pembeli dan penjual hampir tidak pernah bertemu secara langsung, dan hanya bermodalkan trust atau rating bintang pada sebuah flatform Olshop. 1. Menurut kalian, apa dan bagaimana membuat strategi pemasaran yang bagus ditengah gempuran penjual baik secara global dan local (online)?.2. Apakah memasang iklan (misal crypto) di flatform seperti youtube dan signature (bitcointalk) masih cukup bagus diterapkan saat ini?3. coba kita membayangkan (sebagai costumer), jika melihat iklan youtube atau melihat endorsing signature yang dibawakan oleh sesama member di sini, adakah ketertarikan kalian untuk meng-klik?. atau membypass (lewati iklan) atau bahkan ada yng meng-hide signature dan avatar.Ini hanya sekedar survey pemikiran aku saja, misal seperti signature ini, tentu kalau tidak worth, pasti sudah tidak dipakai lagi sejak lama, tapi nyatanya sampai sekarang masih tetap ada, bahkan ada yang sampai bertahun-tahun.Namun, memang yang namanya marketing, pasti akan ada pasang surutnya, untuk itu aku mencoba berdiskusi dan bertukar pikiran tentang apa dan bagaimana cara marketing yang bagus di tengah pemasaran global saat ini.sebenarnya pertanyaan seperti ini (mengenai efektifitas kampanye tanda tangan di forum ini) pernah terlintas di pikiran saya namun lama lama ada hal yang membuat saya yakin kenapa kampanye tanda tangan hingga sekarang ini masih dijalankan, itu adalah reputasi >> situs2 yang mengadakan kampanye tanda tangan di forum ini pasti memiliki perhatian yang lebih dan juga kepercayaan yang baik dari anggota forum ini apalagi reputasi forum ini sebagai tempatnya diskusi para bitcoiner sejak dulu sudah melekat. cmmiwmungkin dengan uang kampanye yang sudah di keluarkan oleh situs2 yang mengadakan kampanye tanda tangan di forum ini bisa menjangkau lebih banyak audiensi di google atau sosial media namun apakah reputasi yang bakal mereka dapatkan bakal sebagus jika di forum ini.#namun jika saya pribadi di tanya apakah akan mengadakan kampanye tanda tangan di forum ini seandainya memiliki platform mixer atau situs perjudian, jawaban saya tentu saja saya akan melakukan itu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "May 04, 2023, 12:11:57 PM",
      "body": "Quote from: Sarah Azhari on May 04, 2023, 02:26:38 AM2. Apakah memasang iklan (misal crypto) di flatform seperti youtube dan signature (bitcointalk) masih cukup bagus diterapkan saat ini?Ini hanya sekedar survey pemikiran aku saja, misal seperti signature ini, tentu kalau tidak worth, pasti sudah tidak dipakai lagi sejak lama, tapi nyatanya sampai sekarang masih tetap ada, bahkan ada yang sampai bertahun-tahun.Iklan di platform google atau youtube itu butuh due diligence yang lumayan ketat sehingga agak sulit untuk ngiklan di situ apalagi untuk kampanye juday. Iklan juday itu tidak bisa diputar di semua negara, karena banyak negara yang tidak memperbolehkan konten juday. Kemudian ada juga mixer, yang sudah tentu tidak diijinkan google. Kemudian proyek kripto itu tidak semua bisa lolos due diligence karena ada yang anon dan sebagainya, ada juga yang dananya mepet.Maka dari itu sudah tentu worth it kalau pasang iklan di signature kalau penyedia layanannya tidak bisa beriklan di media mainstream. Jadi ya tergantung produk agan. Kalau produk yang ditawarkan kek pasta gigi atau sabun cuci, pasang di Google/Youtube tentunya lebih worth it karena tidak ada kendala pembatasan dan tetek bengek lainnya.Selain itu ada alasan target traffic juga. Kalau di sini sudah terkenal tempat proyek-proyek kripto, mixer, dan juday berkumpul. Jadi semakin manis untuk penyedia layanan tsb ngiklan di sini daripada ngiklan di tempat lain yang belum tentu tertarget dan dibatasi ini itu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "May 05, 2023, 02:17:59 AM",
      "body": "Quote from: Renampun on May 04, 2023, 10:20:42 AMsebenarnya pertanyaan seperti ini (mengenai efektifitas kampanye tanda tangan di forum ini) pernah terlintas di pikiran saya namun lama lama ada hal yang membuat saya yakin kenapa kampanye tanda tangan hingga sekarang ini masih dijalankan, itu adalah reputasi >> situs2 yang mengadakan kampanye tanda tangan di forum ini pasti memiliki perhatian yang lebih dan juga kepercayaan yang baik dari anggota forum ini apalagi reputasi forum ini sebagai tempatnya diskusi para bitcoiner sejak dulu sudah melekat. cmmiwAku juga berpikir demikian, kalau bukan karena reputasi pasti campaign seperti ini tidak bertahan lama dan mungkin berakhir dalam beberapa minggu. Namun ada juga pertanyaanku yang hari ini masih mengganjal, tentu untuk user lama yang sudah legend tidak ada masalah, karena mereka melihat itu sebagai bentuk trust, bagaimana untuk user yang benar-benar baru?, apakah benar mereka yakin bahwa signature itu layak dicoba karena user baru kan tidak tahu kalau signature itu sudah lama berjalan, beda dengan user legend yang bertahun-tahun di sini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "May 05, 2023, 09:19:57 PM",
      "body": "Quote from: mu_enrico on May 04, 2023, 12:11:57 PMIklan di platform google atau youtube itu butuh due diligence yang lumayan ketat sehingga agak sulit untuk ngiklan di situ apalagi untuk kampanye juday. Iklan juday itu tidak bisa diputar di semua negara, karena banyak negara yang tidak memperbolehkan konten juday. Kemudian ada juga mixer, yang sudah tentu tidak diijinkan google. Kemudian proyek kripto itu tidak semua bisa lolos due diligence karena ada yang anon dan sebagainya, ada juga yang dananya mepet.Maka dari itu sudah tentu worth it kalau pasang iklan di signature kalau penyedia layanannya tidak bisa beriklan di media mainstream. Jadi ya tergantung produk agan. Kalau produk yang ditawarkan kek pasta gigi atau sabun cuci, pasang di Google/Youtube tentunya lebih worth it karena tidak ada kendala pembatasan dan tetek bengek lainnya.Selain itu ada alasan target traffic juga. Kalau di sini sudah terkenal tempat proyek-proyek kripto, mixer, dan juday berkumpul. Jadi semakin manis untuk penyedia layanan tsb ngiklan di sini daripada ngiklan di tempat lain yang belum tentu tertarget dan dibatasi ini itu.Kalau usaha cryptonya sudah mengantongi izin dari negara bersangkutan, Google nya engga bakal nolak selama masih sesuai dengan peraturan yang dibuat. Pernah beberapa kali ane lihat iklan Google Adsense yang nongol itu dari exchanger terkenal seperti Indodax, FTX, Binance, bahkan dulu banget waktu ane punya blog crypto, iklan dari Google soal ICO (Initial Coin Offering) masih muncul di blog ane. Ga tau sekarang sih, mungkin banyak yang berkurang karena regulasi dari Google paling sering updatenya.Kalo promosinya investasi bodong, juday slot pake crypto, mixer, jatuhnya seperti kucing-kucingan antara content creator vs satpam YouTube (misalkan promosi crypto-nya di YouTube). Content Creator atau YouTuber itu kan ga bisa milih secara spesifik siapa yang nonton videonya, jadi salah target iklan udah pasti terjadi. Dan untungnya buat pengiklan, kalau videonya naik atau viral, impresi nya makin tinggi. Sehingga makin banyak yang nonton iklannya.Soal promosi di forum ini, budgetnya harus tinggi kan ya? karena audiens nya udah on target. Promosi diforum ini semakin menarik lagi kalau ekosistem nya bertumbuh secara konstan, biar target audiens nya makin naik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "May 06, 2023, 06:11:38 AM",
      "body": "Quote from: bayu7adi on May 05, 2023, 09:19:57 PMSoal promosi di forum ini, budgetnya harus tinggi kan ya? karena audiens nya udah on target.Ya tergantung rank dan reputasi member yang ingin dipakai sih gan, itu di bounty signature juga seringkali zonk (dibayar janji palsu )Kalau dikurs USD juga masih tergolong murah untuk industri tertentu, misalnya dibandingin nyewa streamer yang udah punya nama.Quote from: bayu7adi on May 05, 2023, 09:19:57 PMPromosi diforum ini semakin menarik lagi kalau ekosistem nya bertumbuh secara konstan, biar target audiens nya makin naik. Bener ini kalau forum semakin ramai, nanti value signature space makin meningkat dengan catatan signature gak dihapus mimin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "May 09, 2023, 06:25:44 AM",
      "body": "Quote from: bayu7adi on May 05, 2023, 09:19:57 PMGa tau sekarang sih, mungkin banyak yang berkurang karena regulasi dari Google paling sering updatenya.Seingatku pada 2018 google melarang jenis iklan crypto nongol di berandanya, termasuk juga bitcoin, ico dan sejenisnya, Namun pada 2021 Google merevisi kembali aturannya dan mengizinkan crypto, dan exchange (kecuali ICO) untuk beriklan, tapi dengan banyak syarat tentunya, seperti harus terdaftar di FinCen, dsb.Quote from: bayu7adi on May 05, 2023, 09:19:57 PMContent Creator atau YouTuber itu kan ga bisa milih secara spesifik siapa yang nonton videonya, jadi salah target iklan udah pasti terjadi. Dan untungnya buat pengiklan, kalau videonya naik atau viral, impresi nya makin tinggi. Sehingga makin banyak yang nonton iklannya.Paling cuma milih ini cocok untuk anak dan bukan, selebihnya youtube hanya membatasi kepada siapa video ini layak ditonton. Kalau viral mendadak, sudah pasti penyedia konten akan banjir rezeki, namun sekarang ini sulit kalau bukan content yang benar-benar fresh, kebanyakan cuma cover atau ngikut yang sudah ada. Jadi ya musti bikin judul yang bombastis juga, misal : telah ditemukan hardisk berisi 100,000 bitcoin di tempat sampah dsb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "May 22, 2023, 11:34:54 AM",
      "body": "Quote from: Sarah Azhari on May 09, 2023, 06:25:44 AMKalau viral mendadak, sudah pasti penyedia konten akan banjir rezeki, namun sekarang ini sulit kalau bukan content yang benar-benar fresh, kebanyakan cuma cover atau ngikut yang sudah ada. Jadi ya musti bikin judul yang bombastis juga, misal : telah ditemukan hardisk berisi 100,000 bitcoin di tempat sampah dsb.Ada content creator YouTube nama kanalnya adalah Ryan Trahan. Dia influencer yang lumayan terkenal dan konten yang dia upload biasanya seputar vlog, eksperimen dan review. Tetapi dia pernah membuat video tentang Bitcoin dan mendapatkan view yang lumayan bombastis. Terakhir update hari ini, viewnya mencapai 11,5juta.Judul videonya di YouTube : I Survived 50 Hours on Only BitcoinLink video : https://www.youtube.com/watch?v=qzD4fcd-FBYSedikit ringkasan isi videonya adalah Ryan dan temannya ini punya 1 Bitcoin yang digunakan untuk membeli berbagai kebutuhan di Amerika. Tidak semua toko dan POM bensin di Amerika menerima pembayaran Bitcoin. Ada yang harus mengconvert terlebih dahulu pada ATM Bitcoin yang tersedia di dekat kasir tetapi ada juga yang langsung transaksi menggunakan Bitcoin untuk membeli barang meski transaksinya memakan waktu 1 jam.Ga tau ini termasuk soft selling atau hard selling untuk Bitcoin, tetapi konten seperti ini menurut ane sangat bagus buat promosi Bitcoin. Karena si Ryan ini setidaknya udah ngasih tau ke viewer tentang suka duka ketika memiliki Bitcoin untuk transaksi. Tapi anehnya, dia malah di endorse oleh NordVPN yang mana link affliasinya bisa ditemukan di bagian deskripsi. LOL. Andai saja yang endorse adalah exchanger cryptocurrency layaknya TokoCrypto, INDODAX, Binance, dll, mungkin agak sedikit match dengan model kontennya itu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "May 23, 2023, 02:40:23 AM",
      "body": "Quote from: bayu7adi on May 22, 2023, 11:34:54 AMTapi anehnya, dia malah di endorse oleh NordVPN yang mana link affliasinya bisa ditemukan di bagian deskripsi. LOL. Andai saja yang endorse adalah exchanger cryptocurrency layaknya TokoCrypto, INDODAX, Binance, dll, mungkin agak sedikit match dengan model kontennya itu.Apakah pernah ada content creator yang secara eksplisit disponsori oleh perusahaan kripto tertentu? Sejauh yang ane amati malah ada kecerendungan menjauhi perusahaan kripto karena kebanyakan dipandang sebagai pihak ketiga yang tidak bisa dipercaya sepenuhnya. Iklan kirpto justru banyak di Google atau tools seperti block explorer setahu ane. btw, perusahaan seperti NordVPN memang menjadikan Youtube sebagai salah satu platform marketing utamanya, jadi wajar kalau mereka ada di berbagai content creator. Kebanyakan mereka juga tidak mengatur isi video, kecuali bahasannya melibatkan produk VPN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "May 23, 2023, 10:00:20 AM",
      "body": "Quote from: joniboini on May 23, 2023, 02:40:23 AMApakah pernah ada content creator yang secara eksplisit disponsori oleh perusahaan kripto tertentu? Sejauh yang ane amati malah ada kecerendungan menjauhi perusahaan kripto karena kebanyakan dipandang sebagai pihak ketiga yang tidak bisa dipercaya sepenuhnya.Ane lebih banyak menjumpai yang secara implisit (shill), tapi ya tergantung \"perusahaan kripto\" itu lingkupnya seluas apa gan... Dulu ivanontech disponsori cukup lama sama Stake (casino) dan sekarang banyak ngiklan moralis. Tapi ya itu adalah content creator yang niche-nya ada di kripto.Kalau yang niche-nya bukan kripto, ane belum pernah ngeliat mereka disponsori platform kripto (kecuali niche juday -> sponsor crypto casino). Kebanyakan malah VPN, mungkin karena sangat mudah dan persenan tinggi affiliatenya. Service kek web hosting (hostinger), VPS, dan VPN masih menjadi mayoritas iklan/partnership di youtube.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "May 24, 2023, 04:24:49 AM",
      "body": "Quote from: bayu7adi on May 22, 2023, 11:34:54 AMGa tau ini termasuk soft selling atau hard selling untuk Bitcoin, tetapi konten seperti ini menurut ane sangat bagus buat promosi Bitcoin. Karena si Ryan ini setidaknya udah ngasih tau ke viewer tentang suka duka ketika memiliki Bitcoin untuk transaksi. Ku kira ini termasuk ke soft selling karena tidak secara langsung menyuruh penonton untuk membeli atau menyimpan bitcoin. Cara yang dia pakai ini memang cukup menarik dan banyak dipakai influencer lain sebagai segi marketing. Namun di sisi lain, ada juga penonton yang melihat dari sisi pengalaman si ryan ini. Mungkin beberapa menganggap ryan ini orangnya cukup sabar walau menghabiskan 1 jam bertransaksi.Quote from: bayu7adi on May 22, 2023, 11:34:54 AMTapi anehnya, dia malah di endorse oleh NordVPN yang mana link affliasinya bisa ditemukan di bagian deskripsi. Kalau aku melihatnya ada hubungan walau tidak secara langsung, yaitu privacy. Sebagaimana kita tahu Nord VPN adalah proxy yang meng-hide IP kita menjadi anonim, hal ini kukira sangat erat kaitannya dengan bitcoin sebagai salah satu pembayaran yang menjaga privacy pemilik.Quote from: joniboini on May 23, 2023, 02:40:23 AMQuote from: bayu7adi on May 22, 2023, 11:34:54 AMLOL. Andai saja yang endorse adalah exchanger cryptocurrency layaknya TokoCrypto, INDODAX, Binance, dll, mungkin agak sedikit match dengan model kontennya itu.Apakah pernah ada content creator yang secara eksplisit disponsori oleh perusahaan kripto tertentu? Sejauh yang ane amati malah ada kecerendungan menjauhi perusahaan kripto karena kebanyakan dipandang sebagai pihak ketiga yang tidak bisa dipercaya sepenuhnya. Perusahaan crypto kayak exchange yang disebutkan pak bayu (Indodax dan tokocrypto) hampir rata-rata sombong, kita lihat di sini (forum ini), tidak pernah sekalipun mereka menyapa kita atau setidaknya bikin ann thread untuk mengayomi publik Indonesia. Padahal, hasil yang kita dapat seperti btc/ minggu, selalu ditukar di exchange mereka. Padahal kalau mereka jeli, di sini itu sebagai tempat satoshi lahir dimana sering didatengi orang hanya untuk melihat sejarah.Quote from: mu_enrico on May 23, 2023, 10:00:20 AMKalau yang niche-nya bukan kripto, ane belum pernah ngeliat mereka disponsori platform kripto (kecuali niche juday -> sponsor crypto casino). Kebanyakan malah VPN, mungkin karena sangat mudah dan persenan tinggi affiliatenya. Service kek web hosting (hostinger), VPS, dan VPN masih menjadi mayoritas iklan/partnership di youtube.Mungkin nanti kedepan akan ada iklan partai dan calonnya, siapa tahu nanti tokoh sekelas Ridwan Kamil berjualan Golkar di orang yang niche-nya di crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "deepblue01",
      "created_time": "May 24, 2023, 02:06:06 PM",
      "body": "Quote from: Renampun on May 04, 2023, 10:20:42 AMsebenarnya pertanyaan seperti ini (mengenai efektifitas kampanye tanda tangan di forum ini) pernah terlintas di pikiran saya namun lama lama ada hal yang membuat saya yakin kenapa kampanye tanda tangan hingga sekarang ini masih dijalankan, itu adalah reputasi >> situs2 yang mengadakan kampanye tanda tangan di forum ini pasti memiliki perhatian yang lebih dan juga kepercayaan yang baik dari anggota forum ini apalagi reputasi forum ini sebagai tempatnya diskusi para bitcoiner sejak dulu sudah melekat. cmmiwmungkin dengan uang kampanye yang sudah di keluarkan oleh situs2 yang mengadakan kampanye tanda tangan di forum ini bisa menjangkau lebih banyak audiensi di google atau sosial media namun apakah reputasi yang bakal mereka dapatkan bakal sebagus jika di forum ini.#namun jika saya pribadi di tanya apakah akan mengadakan kampanye tanda tangan di forum ini seandainya memiliki platform mixer atau situs perjudian, jawaban saya tentu saja saya akan melakukan itu.menurutku efektif sekali, soalnya saya pernah nyobain gan   . saya rasa situs tersebut akan saya mainkan walau ga terlalu sering, karena mahal juga betnya.so memang bagus sekali mereka mengadakan kampanye disini, kebanyakan member mixer lebih suka menggunakan forum ini sebagai titik acuan. Quote from: Sarah Azhari on May 24, 2023, 04:24:49 AMPerusahaan crypto kayak exchange yang disebutkan pak bayu (Indodax dan tokocrypto) hampir rata-rata sombong, kita lihat di sini (forum ini), tidak pernah sekalipun mereka menyapa kita atau setidaknya bikin ann thread untuk mengayomi publik Indonesia. Padahal, hasil yang kita dapat seperti btc/ minggu, selalu ditukar di exchange mereka. Padahal kalau mereka jeli, di sini itu sebagai tempat satoshi lahir dimana sering didatengi orang hanya untuk melihat sejarah.setahuku mereka punya forum sendiri gan lagipula mereka juga punya kripto (TKO) yang dari tahun kemarin juga masih tenggelam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "May 26, 2023, 02:15:31 AM",
      "body": "Quote from: deepblue01 on May 24, 2023, 02:06:06 PMso memang bagus sekali mereka mengadakan kampanye disini, kebanyakan member mixer lebih suka menggunakan forum ini sebagai titik acuan. Ber-marketing di forum ini selain nyari pasar dan titik acuan, juga buat kemapanan sebuah situs itu sendiri. Kita tahu sendiri bagaimana popularitas chipmixer yang mampu terkenal di seluruh dunia walau hanya bercampaign di forum ini, karena banyak orang menganggap kalau forum ini adalah asal mula terciptanya bitcoin sehingga muncul sugesti kalau chipmixer juga bagian dari pada itu (padahal tidak), karena orang tahunya asal mulanya chipmixer dari bitcointalk.Quote from: deepblue01 on May 24, 2023, 02:06:06 PMQuote from: Sarah Azhari on May 24, 2023, 04:24:49 AMPerusahaan crypto kayak exchange yang disebutkan pak bayu (Indodax dan tokocrypto) hampir rata-rata sombong, kita lihat di sini (forum ini), tidak pernah sekalipun mereka menyapa kita atau setidaknya bikin ann thread untuk mengayomi publik Indonesia. Padahal, hasil yang kita dapat seperti btc/ minggu, selalu ditukar di exchange mereka. Padahal kalau mereka jeli, di sini itu sebagai tempat satoshi lahir dimana sering didatengi orang hanya untuk melihat sejarah.setahuku mereka punya forum sendiri gan lagipula mereka juga punya kripto (TKO) yang dari tahun kemarin juga masih tenggelam  yup aku tahu, dulu pernah juga aktif yang namanya bitcoin.co.id forum, namun karena tidak begitu menjanjikan dan sedikit peminat jadi aku lari ke sini. Lagi pula, token-token buatan exchange kayak Indodax (TEN) dan Tokocrypto (TKO) tidak begitu hype dari coin yang jadi top marketcap sehingga banyak yang nyuekin, lagian banyak yang trauma awal-awal munculnya TEN, akan sama pula nantinya jika berjudi dengan TKO. Lagi-lagi strategy marketing yang mereka pakai kurang afdol, mereka tanggung dalam ngeluarin modal buat marketing, padahal token atau coin itu, capaian berhasil atau tidak dari strategi atau cara penjualannya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tumanggor",
      "created_time": "May 29, 2023, 06:36:42 AM",
      "body": "Quote from: joniboini on May 23, 2023, 02:40:23 AMQuote from: bayu7adi on May 22, 2023, 11:34:54 AMTapi anehnya, dia malah di endorse oleh NordVPN yang mana link affliasinya bisa ditemukan di bagian deskripsi. LOL. Andai saja yang endorse adalah exchanger cryptocurrency layaknya TokoCrypto, INDODAX, Binance, dll, mungkin agak sedikit match dengan model kontennya itu.Apakah pernah ada content creator yang secara eksplisit disponsori oleh perusahaan kripto tertentu? Sejauh yang ane amati malah ada kecerendungan menjauhi perusahaan kripto karena kebanyakan dipandang sebagai pihak ketiga yang tidak bisa dipercaya sepenuhnya. Iklan kirpto justru banyak di Google atau tools seperti block explorer setahu ane. btw, perusahaan seperti NordVPN memang menjadikan Youtube sebagai salah satu platform marketing utamanya, jadi wajar kalau mereka ada di berbagai content creator. Kebanyakan mereka juga tidak mengatur isi video, kecuali bahasannya melibatkan produk VPN.saya juga masih belum menemukan conten creator yang di sponsori oleh platform kripto tertentu kabanyakan sih hanya nemui konten kreator yang nyebari link reffreral mereka pribadiperusahaan2 kripto sekarang ini sih sudah lebih menguatamakan membuat iklan di google atau sosial media karena memang target jangkauannya lebih tepat sasaran",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "May 31, 2023, 05:01:32 AM",
      "body": "Quote from: Tumanggor on May 29, 2023, 06:36:42 AMperusahaan2 kripto sekarang ini sih sudah lebih menguatamakan membuat iklan di google atau sosial media karena memang target jangkauannya lebih tepat sasaranKalau menurutku, beriklan di medsos dan google itu bukan nyari target yang tepat sasaran, tapi nyari pasar secara random. Kalau mau tepat sasaran pastinya mereka akan beriklan di forum atau medsos khusus ber-niche crypto. Sedangkan Google kan jangkauannya semua kalangan, tidak hanya yang mengerti crypto, bisa jadi mereka yang tidak tahu apa-apa soal crypto pun bakal ikut gabung, namun resikonya jelas lebih besar, misal masyarakat ikut bergabung dan tidak tahu menahu soal crypto, mereka jadi sasaran scammer atau investasi bodong crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "June 01, 2023, 12:16:34 PM",
      "body": "Quote from: Sarah Azhari on May 04, 2023, 02:26:38 AM 1. Menurut kalian, apa dan bagaimana membuat strategi pemasaran yang bagus ditengah gempuran penjual baik secara global dan local (online)?.2. Apakah memasang iklan (misal crypto) di flatform seperti youtube dan signature (bitcointalk) masih cukup bagus diterapkan saat ini?3. coba kita membayangkan (sebagai costumer), jika melihat iklan youtube atau melihat endorsing signature yang dibawakan oleh sesama member di sini, adakah ketertarikan kalian untuk meng-klik?. atau membypass (lewati iklan) atau bahkan ada yng meng-hide signature dan avatar.Dunia marketing itu ibarat dunia seni, perlu sentuhan-sentuhan khusus agar promosi bisa berjalan senatural mungkin, Karena banyak orang yang tidak suka di prospek. Jadi kalo bukan orang yang memiliki kecenderungan marketer maka pekerjaan marketing akan sangat berat dan membosankan.#1. Strategi termudah (bukan terbaik) adalah memasang iklan. Platfom pengiklanan digital/online sekarang cenderung \"murah\" jika dibandingkan iklan-iklan model konvensional (e.k.e Televisi, banner iklan, iklan koran). Selain itu, pengiklanan digital memiliki opsi yang mudah digunakan untuk menentukan target pasar, seperti Lokasi, Umur, Minat. dll, dibandingkan iklan konvesional yang random target pasar#2. Iklan diletakan dimanapun pada dasarnya bagus, tinggal target iklan itu untuk apa. Jika targetnya adalah penguna maka market yang tertarget yang paling pas. Seperti signature crypto di forum ini. Tapi ada iklan yang tetap di terbitkan meski tidak menarget pengguna, tetapi lebih agar brand produknya menjadi habitus. Seperti iklan facebook dan youtube, ya facebook dan yutube meskipun hampir semua orang sudah menggunakannya tetapi mereka tetap mengalokasikan anggaran untuk iklan, tujuannya agar menjad habitus dan kopentitor akan sangat sulit melawan/ menggeser posisinya sebagai yang terdepan.#3. Meskipun kita tidak meng-klik iklan atau produknya saat di iklan ditayangkan tetapi sedikit-demi sedikit rasa percaya kita terhadap brand  tersebut akan naik. Tanpa sadar jika suatu saat kita membutuhkan produk itu, kemungkinan besar kita akan membeli produk tersebut dari pada membeli produk lain yang tidak kita kenal sama sekali.Membesarkan sebuah brand bukan yang yang mudah, membutuhkan banyak tenaga, biaya, dan waktu. Pun sama seperti bitcoin yang awalnya banyak orang yang melihatnya sebelah mata, sekarang sudah menjadi primadona.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 07, 2023, 07:10:13 AM",
      "body": "Quote from: komisariatku on June 01, 2023, 12:16:34 PMDunia marketing itu ibarat dunia seni, perlu sentuhan-sentuhan khusus agar promosi bisa berjalan senatural mungkin, Karena banyak orang yang tidak suka di prospek. Jadi kalo bukan orang yang memiliki kecenderungan marketer maka pekerjaan marketing akan sangat berat dan membosankan.Betul sekali, selain seni, Divisi marketing di sebuah perusahaan itu mempunyai gaji yang paling gede dari pada divisi lain karena Pimpinan Perusahaan paham kalau ujung tombak produk mereka itu di penjualan. Jadi menurutku, belajar dari marketing saja sudah cukup untuk menghidupi sebuah keluarga kalau anak-anak muda itu mau belajar dari awal. Youtuber dan Instagramer sukses sekarang juga awalnya dari sales, dia jualan diri dia dulu sebelum direkrut sama perusahaan iklan di youtube. Quote from: komisariatku on June 01, 2023, 12:16:34 PM#3. Meskipun kita tidak meng-klik iklan atau produknya saat di iklan ditayangkan tetapi sedikit-demi sedikit rasa percaya kita terhadap brand  tersebut akan naik. Tanpa sadar jika suatu saat kita membutuhkan produk itu, kemungkinan besar kita akan membeli produk tersebut dari pada membeli produk lain yang tidak kita kenal sama sekali.Brand merupakan titik dasar untuk mencari pelanggan inti. Dari brand tersebut, Company dapat mencari pelanggan baru dari mulut pelanggan lama yang secara tidak langsung menjadi sales tanpa gaji. Oleh karena itu tidak salah beberapa signature yang tahunan berjualan di sini rela merogoh kocek sampai hari ini hanya untuk membentuk sebuah Brand yang trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "redwine49",
      "created_time": "June 07, 2023, 05:25:48 PM",
      "body": "1. menurut saya, pertama tama kita melihat dari konsumen lebih dahulu. siapakah konsumen yang akan kita pilih. misalkan sektornya cryptocurrency. tentu kebanyakan iklan yang muncul cenderung di situs yang berhubungan dengan cryptocurrency seperti forum ini yang sudah sejak awal dibuat pertama kali di industri kripto.2. masih layak untuk dipertaruhkan, walaupun trafiknya tidak seramai dulu, forum ini masih menjadi forum yang pertama kalinya yang dirujuk oleh pengguna crypto untuk mencari informasi3.kalo seandainya saya yang menjadi kostumer baru, saya biasanya mencari informasi tertentu misalkan memilih topik crypto wallet yang menjadi rujukan. Biasanya mereka akan bertanya di forum ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 10, 2023, 02:26:08 AM",
      "body": "Quote from: redwine49 on June 07, 2023, 05:25:48 PM1. menurut saya, pertama tama kita melihat dari konsumen lebih dahulu. siapakah konsumen yang akan kita pilih. misalkan sektornya cryptocurrency. tentu kebanyakan iklan yang muncul cenderung di situs yang berhubungan dengan cryptocurrency seperti forum ini yang sudah sejak awal dibuat pertama kali di industri kripto. Mencari konsumen spesifik itu sulit, apa lagi marketnya random kayak di pasar atau di sosmed. oleh karena itu kita melihat banyak yang menjual akun sosmed dengan group niche crypto karena marketnya jelas. Tapi untuk random market kita pun bisa berusaha menjual, tapi tentu dekat pendekatan yang lebih intens dan mempunyai pengetahuan yang mumpuni jika ada pertanyaan dari calon konsumen.Quote from: redwine49 on June 07, 2023, 05:25:48 PM3.kalo seandainya saya yang menjadi kostumer baru, saya biasanya mencari informasi tertentu misalkan memilih topik crypto wallet yang menjadi rujukan. Biasanya mereka akan bertanya di forum ini. Kalau pakai fitur itu tidak begitu spesific dapatnya, karena kita tidak bisa menyertakan poster dan date untuk mengetahui apa yang terbaru. Kalau aku memakai Ninjastic space, karena kita bisa mencari secara lengkap spesifik apa yang kita mau cari.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "redwine49",
      "created_time": "June 12, 2023, 11:17:06 PM",
      "body": "Quote from: Sarah Azhari on June 10, 2023, 02:26:08 AMMencari konsumen spesifik itu sulit, apa lagi marketnya random kayak di pasar atau di sosmed. oleh karena itu kita melihat banyak yang menjual akun sosmed dengan group niche crypto karena marketnya jelas. Tapi untuk random market kita pun bisa berusaha menjual, tapi tentu dekat pendekatan yang lebih intens dan mempunyai pengetahuan yang mumpuni jika ada pertanyaan dari calon konsumenIya benar, mencari konsumen secara spesifik itu sulit. namun di era digital saat ini sebenarnya lebih mudah untuk mereka facebook,youtube,twitter, ect.mampu melihat apa yang kita lihat dari iklannya berhubungan sekali dengan kehidupan kita. contohnya konten atau iklan di youtubemu ga akan sama persis dengan teman2 yang lain.itu akhirnya mereka mampu melihat peluang dan seseorang yg membeli iklan mereka akan merasa puas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}