{
  "id": "topic_5424899",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "November 30, 2022, 11:21:43 PM",
  "content": "QuoteElectric vehicle batteries are quickly becoming one of the most important commodities in the USA. Mineral processing operations are largely happening overseas, but one US company created by a Tesla founder and previous CTO is now delving into cathode and anode processing.Tesla co-founder JB Straubel is currently in the battery recycling business with his company Redwood Materials, which recycles old batteries to create lithium-ion batteries for cars. The company recently announced a partnership with Panasonic to supply billions of dollars in battery hardware, marking the first major processed cathode contract to come to the US.The cathode material makes up around a third of an EV battery pack, and Redwood Materials will supply a Panasonic factory in Kansas City, Kansas, with the processed mineral starting in 2025. Additionally, most of the Kansas City plant’s battery cells will be destined for US automaker Tesla — another major partner of Redwood’s.“Panasonic has been a partner for many years, but this is very significant,” Straubel said in an interview. “This is a large portion of their cathode supply. It’s such an impactful announcement for the U.S. supply chain in general — and of course for us as a company.”Straubel’s time at Tesla led him to recognize a growing need for the materials needed to make EV batteries. Not long after, Redwood became the largest lithium battery recycler in the US. From there, Redwood branched out into processing and producing anode and cathode materials, arguably an equally necessary process.Panasonic’s cathode material from Redwood will be produced using 100 percent recycled cobalt, and 25–30 percent recycled nickel and lithium. Straubel didn’t share where the rest of the plant’s materials will come from. Cobalt remains a pricey and controversial mineral for EV batteries, with the vast majority of the resource coming from the Democratic Republic of Congo, whose mining operations have been flagged for human rights violations.President Joe Biden’s Inflation Reduction Act also requires half of a battery’s minerals to be recycled in North America or mined from a free-trade agreement-friendly country — supporting domestic operations such as these at Redwood Materials.“We were already going at supersonic speeds,” Straubel said of the manufacturing provisions in Biden’s climate plan. He compared their accelerating qualities for the recycled materials industry to “what happens if you attach a rocket engine to supersonic airplane.”Cathode materials play a huge role in EV pricing too, and Redwood is planning to bring its cathode production up to around 100 gigawatt-hours per year by 2025 — or the equivalent of about one million EVs.The company has three recycling factories near Tesla’s Gigafactory in Nevada, and cathode and anode material processing are only set to become increasingly needed with rising EV popularity in the coming years.Anode and cathode materials are “just an incredibly high percentage of the cost of the car,” according to Straubel. “As the world is shifting to electrification, there’s going to be a bit of a new vocabulary and new list of components that everyone will get familiar with.”https://cleantechnica.com/2022/11/23/tesla-co-founders-processing-ev-battery-minerals/....Many claim lithium batteries are harmful to the environment and cannot be recycled. Here we have evidence to the contrary. Tesla co founder JB Straubel is currently recycling lithium batteries to make the industry cleaner and improve the efficiency of the manufacturing process. They are also apparently processing lithium domestically in the united states. Which could help to reduce strain on global lithium supply chains and make american EV manufacturers less dependent upon china.They mention the cobalt industry in congo being known for unsanitary and unsfe working conditions in addition to human rights violations. But the same could be said of most industries in africa. Whether its diamond mining, shipbreaking or cobalt mining. Those negative conditions are standard for the region.It is interesting to note that while many considered the american manufacturing industry dead and buried. We are seeing a resurgence in the sector with EVs. And now with lithium batteries.Could local production be the wave of the future if global supply chains can no longer be relied upon on a consistent basis.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424899",
  "comments": [
    {
      "author": "franky1",
      "created_time": "November 30, 2022, 11:28:36 PM",
      "body": "those enviro fears were circa 2010...tesla co founder JB Straubel has been in the recycling business a few years now. so kinda old news nowhere is a videoredwood batter recycling -JB Straubelhttps://www.youtube.com/watch?v=xLr0GStrnwQ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "November 30, 2022, 11:59:31 PM",
      "body": "Quote from: franky1 on November 30, 2022, 11:28:36 PMthose enviro fears were circa 2010...tesla co founder JB Straubel has been in the recycling business a few years now. so kinda old news nowI have seen many claim lithium battery recycling is impossible in 2022.For whatever reason. Maybe they meant to say lithium recycling is difficult and not as simple or clean as lead acid battery recycling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "December 01, 2022, 04:01:08 AM",
      "body": "Quote from: Hydrogen on November 30, 2022, 11:59:31 PMI have seen many claim lithium battery recycling is impossible in 2022.The article is very vague. It claims that 25% of the Lithium used in the battery production is recycled, while the remaining is mined. But even here there is a catch. They have not revealed the volume of batteries they are recycling. If they recycle 1,000 old batteries to produce 100 new ones, the recycling ratio is just 2.5% (i.e only 2.5% of the Lithium is being recycled). For me, it looks more like an attention grabbing spree ahead of fundraising. From what I understand, the technology still doesn't permit recycling of Lithium.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 01, 2022, 09:17:37 AM",
      "body": "compared to having to:dig through 100tonne of soil/gravel. to then extract 0.001 tonnes of mineral and then refining it into its basic elements and separating it outvshaving a battery where all those elements are already in one lump.(without the 100tonne mining soil/gravel part) makes it alot cheaper to 'mine' minerals, by just asking people to donate(i mean recycle) their old battery to a refineryextracting it is the same as grinding up a rock. you break it down to dust burn it at different melting points and extract the liquids(heated molten mineral) knowing that the melt at X temperature is going to be Y mineral(same process as refining)lithium can be 75% salvaged from an old battery..other materials are in the 90% areahowever if they need say 1000 batteries a hour for production. but they are only collecting 100 old batteries an hour. then they are only making 75 lithium batteries from recycling which is 7.5% recycling ratehowever if tesla needs 1000 batteries an hour. and it takes in batteries of all brands even from rival companies. and different devices/products. it can end up having more recycling coming in, than demand",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "December 02, 2022, 12:01:02 PM",
      "body": "Quote from: Hydrogen on November 30, 2022, 11:59:31 PMQuote from: franky1 on November 30, 2022, 11:28:36 PMthose enviro fears were circa 2010...tesla co founder JB Straubel has been in the recycling business a few years now. so kinda old news nowI have seen many claim lithium battery recycling is impossible in 2022.For whatever reason. Maybe they meant to say lithium recycling is difficult and not as simple or clean as lead acid battery recycling.Saying it is impossible is a factually wrong thing. Could you say it's expensive? Maybe, could you say it requires too much effort? Definitely. Could you say it requires a high entry barrier so not everyone can do it like regular waste management? For sure, guaranteed. However, saying it is impossible is idiotic. First of all, if you REALLY want to get rid of them, Tesla is also owned by the same guy that owns SpaceX, worst case scenario, he would just chuck them out to space if he ever wanted to, never to be seen again, and here you go, clean world. The problem is not about recycling, or getting rid of it, the only problem about this is how expensive it is, that's reasonable complaint about it, but that's it, expensive and impossible are not equals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}