{
  "id": "topic_5467350",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "September 19, 2023, 05:11:07 PM",
  "content": "See https://www.reddit.com/r/Bitcoin/comments/16mrsit/bitcoinorg_banned_from_posting_bitcoin_white/?utm_source=share&utm_medium=ios_app&utm_name=iossmfIt says the judge says that cobra must pay 500,000 pounds legal bill to our resident fraudster.The judge also said thatQuoteparticipating in the proceedings without revealing their identity would undermine the system of justice and he lost the case by defaultHow to make karma strike back CSW?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467350",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "September 19, 2023, 05:40:57 PMLast edit: September 19, 2023, 10:39:36 PM by albert0bsd",
      "body": "Quote from: NotATether on September 19, 2023, 05:11:07 PMHow to make karma strike back CSW?  It is a difficult topic, the news is also unbelieve to read. But I think that seeking for karma it's not a good way, i mean if karma would act, it should do that alone no?One option may be to locate friends or users there and encourage them to distribute the bitcoin wallpaper, but that may also have legal issues against them no?A way to win this should be made in a technical way, I don't know how, let's ask the real satoshi to sign a text message saying that CSW is a liar… o wait there is a message already signed by old miners no?bitcoin.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 19, 2023, 05:45:14 PM",
      "body": "It's really weird the UK legal system has no safeguard against such obvious abuse of resources. This entire case should have been dismissed as \"bullying\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 19, 2023, 07:01:22 PM",
      "body": "Quote from: NotATether on September 19, 2023, 05:11:07 PMHow to make karma strike back CSW?  I think so, in the comments  . Like really sadly it is a win for CW but how, I really can't understand the ruling by the judge as per one of my doubts is cleared.. by a common thereQuoteJudges have been undermining the principles of justice for generations now. This is nothing new.So Cobra won't show up, and CW is not gonna get the legal fees..This link works for those who do not know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 19, 2023, 07:56:35 PMLast edit: September 19, 2023, 08:11:50 PM by o_e_l_e_o",
      "body": "https://www.torproject.org/https://blockchair.com/bitcoin/whitepaperhttps://bitcoincore.org/en/download/I thought this had already happened, so looked in to a bit more. Turns it this was a judgement on costs, not the original banning of the whitepaper which indeed happened several years ago for UK users. Cobra is now on the hook for $640,000 in known fraudster CSW's legal costs, although given he remains anonymous good luck on collecting any of that I suppose?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "September 19, 2023, 08:12:11 PM",
      "body": "the moron can't even prove that he is Satoshi Nakamoto but somehow the UK high court accepted his copyright claim that he is the owner of Bitcoin white paper? I don't know why but somehow I feel like that Cobra refusing to reveal his Identity is what CSW is counting on when he filed this case(it's just an assumption though).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 20, 2023, 10:34:05 AM",
      "body": "Quote from: o_e_l_e_o on September 19, 2023, 07:56:35 PM~snip~Cobra is now on the hook for $640,000 in known fraudster CSW's legal costs, although given he remains anonymous good luck on collecting any of that I suppose?I wonder if Cobra can get away with paying this fine given that his identity is not known, but that the authorities can always go in the direction of trying to locate him by IP address, even if he is a person who cares about his privacy and uses methods to hide his online identity. Quote from: acroman08 on September 19, 2023, 08:12:11 PMthe moron can't even prove that he is Satoshi Nakamoto but somehow the UK high court accepted his copyright claim that he is the owner of Bitcoin white paper?I have never considered that the courts anywhere in the world are fair, and here the question of not only justice, but also elementary logic really arises. It's as if the court is saying that Faketoshi failed to prove that he is Satoshi, but also Cobra, with his failure to appear in court, did not prove that he has the right to use the whitepaper in a way to share it publicly. Quote from: acroman08 on September 19, 2023, 08:12:11 PMI don't know why but somehow I feel like that Cobra refusing to reveal his Identity is what CSW is counting on when he filed this case(it's just an assumption though).Of course, Faketoshi can win only if the person does not present an active defense, that is, he wants to keep his anonymity - which was definitely not the case with @hodlonaut's trial where he was literally destroyed - although it must be recognized that the courts in Norway have a slightly different standard, and that something like this would certainly not pass in their court.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "September 20, 2023, 11:15:25 AM",
      "body": "If Faketoshi couldn't prove that he is the creator of bitcoin,  why would the court entertain the case that he is the author of the Bitcoin Whitepaper? They want to force Cobra to reveal his identity which I am sure will never happen. The UK is becoming very hostile to bitcoin. A few months ago the government was closing many bitcoin ATMs in the UK and now a court is giving a controversial judgment. The bitcoin whitepaper will be always available on other channels so the fraudster will keep losing. Quote from: Lucius on September 20, 2023, 10:34:05 AMQuote from: o_e_l_e_o on September 19, 2023, 07:56:35 PM~snip~Cobra is now on the hook for $640,000 in known fraudster CSW's legal costs, although given he remains anonymous good luck on collecting any of that I suppose?I wonder if Cobra can get away with paying this fine given that his identity is not known, but that the authorities can always go in the direction of trying to locate him by IP address, even if he is a person who cares about his privacy and uses methods to hide his online identity. If Cobra fails to pay the legal cost UK government might consider attacking Bitcoin.org. The website might be made to pay the price for Cobra's refusal to comply with the court ruling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 20, 2023, 11:44:16 AM",
      "body": "The UK High Court ordered Cobra of Bitcoin.org to remove the Bitcoin whitepaper from the website. This decision was made as part of Craig Wright’s lawsuit against it. Wright claims to be the author of the whitepaper and does not authorize its publication.The court ruled in favor of Wright because Cobra chose to remain anonymous and did not defend himself. Cobra was also ordered to pay legal costs.Is this information from over two years ago? Please refer to the links below:https://finance.yahoo.com/news/uk-court-orders-bitcoin-org-071013826.htmlhttps://www.cryptopolitan.com/bitcoin-whitepaper-and-the-core-software-uk/https://www.financemagnates.com/cryptocurrency/news/court-favors-craig-wright-orders-bitcoin-org-to-remove-btc-whitepaper/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "September 20, 2023, 11:56:04 AM",
      "body": "Quote from: Text on September 20, 2023, 11:44:16 AMThe court ruled in favor of Wright because Cobra chose to remain anonymous and did not defend himself. Staying anonymous does not mean that person is not the real author of a document. Cobra does not need to prove he is the author of Bitcoin white paper to use it until Satoshi Nakamoto can claim it.Craig Wright appeared publicly and tried to claim he is Satoshi Nakamoto, failed to prove it but somehow he could win the lawsuit and claimed the Bitcoin Whitepaper belongs to him.The result of lawsuit, ruled in favor of Craig Wright is hilarious. It is like law means nothing even in a long developed country like the UK.After four years, something weird happened. US Copyright Office Says It Does Not ‘Recognize’ Craig Wright as Satoshi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 20, 2023, 12:50:02 PM",
      "body": "the other thing to note is if cobra is suppose to pay a huge fine and doesnt. the obvious next scheme would be for CSW to put a lien on the website property and take over the website as compensation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 20, 2023, 01:19:00 PM",
      "body": "Quote from: acroman08 on September 19, 2023, 08:12:11 PMthe moron can't even prove that he is Satoshi NakamotoOf course he can't, because he obviously isn't.Quote from: acroman08 on September 19, 2023, 08:12:11 PMI don't know why but somehow I feel like that Cobra refusing to reveal his Identity is what CSW is counting on when he filed this case(it's just an assumption though).You are absolutely right. CSW and his cult thrive off these frivolous lawsuits.Quote from: Text on September 20, 2023, 11:44:16 AMIs this information from over two years ago?As I explained above, the initial court hearing was indeed two years ago. This was a supplementary hearing on costs, which CSW won by default since Cobra (rightly) refused to compromise his anonymity to fight these obviously bullshit claims.Quote from: franky1 on September 20, 2023, 12:50:02 PMthe obvious next scheme would be for CSW to put a lien on the website property and take over the website as compensationYou are from the UK, right? What jurisdiction do UK courts have to take over a website which is neither registered nor operated from within the UK?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 20, 2023, 02:34:10 PM",
      "body": "Quote from: albert0bsd on September 19, 2023, 05:40:57 PMOne option may be to locate friends or users there and encourage them to distribute the bitcoin wallpaper, but that may also have legal issues against them no?A way to win this should be made in a technical way, I don't know how, let's ask the real satoshi to sign a text message saying that CSW is a liar… o wait there is a message already signed by old miners no?The problem is that the scammer is bullying different individuals while exploiting the legal system. These two points you made here are not going to change that because people could already use a VPN or a mirror to get the whitepaper or just never read it (who said you need to also read the whitepaper when adopting bitcoin?!). And also even if Satoshi signed a message and published it on the internet is not going to help at all. He has to come forward and go to the court to battle the scammer! That means revealing his identity (same for Cobra) and it is not going to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 20, 2023, 04:20:57 PM",
      "body": "Quote from: pooya87 on September 20, 2023, 02:34:10 PMThese two points you made here are not going to change that because people could already use a VPN or a mirror to get the whitepaper or just never read it (who said you need to also read the whitepaper when adopting bitcoin?!).Yes I agree with you those just were some vague thougts.Also i know that we don't need to read the paper to adopt bitcoin, but it is very interesting to read in any case (I strongly recomment read it)Something that bothers me is the white paper has the website in the header.It says clearly www.bitcoin.orgHow the F. a stupid judge can ignore that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "September 20, 2023, 04:47:44 PM",
      "body": "Quote from: NotATether on September 19, 2023, 05:11:07 PMSee https://www.reddit.com/r/Bitcoin/comments/16mrsit/bitcoinorg_banned_from_posting_bitcoin_white/?utm_source=share&utm_medium=ios_app&utm_name=iossmfIt says the judge says that cobra must pay 500,000 pounds legal bill to our resident fraudster.The judge also said thatQuoteparticipating in the proceedings without revealing their identity would undermine the system of justice and he lost the case by defaultHow to make karma strike back CSW?  Cobra should have fought from his natural habitat. If he had been strong in the ideals of Bitcoin he would have won naturally as the truth would have fought for him. He would have simply told the court that anonymity is part of the ideal of his natural habitat and he depends on it for his security. It's part of his right as a cobra. You can't tell a fish that he lost a case for not fighting outside the sea. That undermines the fish chance of survival as he's designed to spend most of his life in water. How could the fish use this as defense whereas he's known to mingle alot with land-dwellers & don't have problem with them ruling the sea?The best way to defeat anyone who claims to be satoshi is to defend and fight with the Bitcoin ideals which are the truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 20, 2023, 05:11:43 PM",
      "body": "Just leaving this here as a reminder: https://bitcointalk.org/bitcoin.pdfWe are all satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 20, 2023, 05:16:09 PM",
      "body": "Quote from: o_e_l_e_o on September 20, 2023, 01:19:00 PMQuote from: franky1 on September 20, 2023, 12:50:02 PMthe obvious next scheme would be for CSW to put a lien on the website property and take over the website as compensationYou are from the UK, right? What jurisdiction do UK courts have to take over a website which is neither registered nor operated from within the UK?Pretty much every democratic government only seizes domains if there is a criminal case, they do not interfere like that in civil cases like this one.Quote from: Ucy on September 20, 2023, 04:47:44 PMCobra should have fought from his natural habitat. If he had been strong in the ideals of Bitcoin he would have won naturally as the truth would have fought for him. He would have simply told the court that anonymity is part of the ideal of his natural habitat and he depends on it for his security. It's part of his right as a cobra. You can't tell a fish that he lost a case for not fighting outside the sea. That undermines the fish chance of survival as he's designed to spend most of his life in water. How could the fish use this as defense whereas he's known to mingle alot with land-dwellers & don't have problem with them ruling the sea?The best way to defeat anyone who claims to be satoshi is to defend and fight with the Bitcoin ideals which are the truth. If Cobra reveals his identity, then this will open another attack vector for CSW to inundate him with even more lawsuits, this time with his address and personal info, and also launch disinformation campaigns against him on X.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "September 20, 2023, 05:22:22 PM",
      "body": "This is really good news, this way people start to realize the  level of incompetency  that exist in governments and in their officials.UK has been the mother of injustice, exploitation and tyranny for more than 200 years. They have occupied, looted, murdered, raped, tortured, bullied and lied, stealing whitepaper copyright, compensating a case by taking money from others is an act of mercy IMO.Pity, their grand and greatest cunt died without a walk of shame.😂",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 20, 2023, 05:44:10 PM",
      "body": "Quote from: LoyceMobile on September 20, 2023, 05:11:43 PMWe are all satoshi.Except CSW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 20, 2023, 05:55:42 PMLast edit: September 20, 2023, 07:04:06 PM by franky1",
      "body": "Quote from: NotATether on September 20, 2023, 05:16:09 PMQuote from: o_e_l_e_o on September 20, 2023, 01:19:00 PMQuote from: franky1 on September 20, 2023, 12:50:02 PMthe obvious next scheme would be for CSW to put a lien on the website property and take over the website as compensationYou are from the UK, right? What jurisdiction do UK courts have to take over a website which is neither registered nor operated from within the UK?Pretty much every democratic government only seizes domains if there is a criminal case, they do not interfere like that in civil cases like this one.not true. there are many cases where private individuals can take over a businesses property under civil law.all im saying is there is a slippery slope of drama and further actions that can progress from thisCSW would have to jump through a few hoops through american court to gain jurisdiction to try this.. (much like [he failed] when he tried to push further in the hodlnaut saga in oslo) but it is possible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}