{
  "id": "topic_5452439",
  "title": "anonbtcnoob23",
  "author": "anonbtcnoob23",
  "created_time": "May 11, 2023, 11:37:46 PM",
  "content": "So, i have found 3 old jaxx wallets with files \"file_0.localstorage\"I am trying to use this guide to extract seed phrase:https://vxlabs.com/2017/06/10/extracting-the-jaxx-12-word-wallet-backup-phrase/I should be able to open file & type in command sqlite> select value from ItemTable where key=\"mnemonic\";The problem is I cannot open file_0.localstorage, not even with sqlitebrowserI'm getting error:Could not open database fileReason: file is not a databaseIs there any solution, how do I open these files?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452439",
  "comments": [
    {
      "author": "Sarah Azhari",
      "created_time": "May 12, 2023, 12:14:53 AM",
      "body": "Quote from: anonbtcnoob23 on May 11, 2023, 11:37:46 PMThe problem is I cannot open file_0.localstorage, not even with sqlitebrowserI'm getting error:Could not open database fileReason: file is not a databaseIs there any solution, how do I open these files?Have you tried Notepad++?Or try to download again jaxx liberty and moved your old jaxx folder to the new one in appdata",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 12, 2023, 05:57:16 AM",
      "body": "Quote from: anonbtcnoob23 on May 11, 2023, 11:37:46 PMSo, i have found 3 old jaxx wallets with files \"file_0.localstorage\"Could not open database fileReason: file is not a databaseIs there any solution, how do I open these files?This error indicates that the database you are trying to open has been overwritten. Does this error appear in the three files or one file?How did you find those files and are you sure that they have balance or you are trying your luck.If you do not restore these files, it is best to keep a copy of them and make sure that you have saved a copy of the extension, for example this Windows extension C:\\Users\\<name_here>\\AppData\\Roaming\\Jaxx\\Local Storage. Then tell us more details.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 12, 2023, 11:36:49 PM",
      "body": "Quote from: Sarah Azhari on May 12, 2023, 12:14:53 AMOr try to download again jaxx liberty and moved your old jaxx folder to the new one in appdataBut in order to access the account, he will have to enter the password to first unencrypt the file, which I think he doesn't remember or know. So he is using the tool to try and extract back-up phraseAlso, Jaxx liberty is being retired",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}