{
  "id": "topic_5479683",
  "title": "adaseb",
  "author": "adaseb",
  "created_time": "December 29, 2023, 05:02:51 PM",
  "content": "Basically for the last 24 hours, its impossible to get a transaction in. I click submit at exactly the top of the hour, to the second, sometimes a second early and a second later. As soon as I submit it, 5 seconds later it says all slots are full. And if you check the total amount of transactions accelerated it increased by 100.I think I tried like 6 times and each time the same result. I find it hard to believe that somehow 100 different people are submitting their transactions at that exact second. Anyone have any luck?Few weeks ago when fees were 250Sat/byte you could get a few transactions in every hour, now its near impossible.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5479683",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 29, 2023, 05:05:39 PM",
      "body": "This has been answered two day ago, which means you did not see it. Read this: Re: ViaBTC offers no more free TX acceleration?Bots are submitting transactions faster than humans. Most transactions are traced to be Ordinals transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 29, 2023, 05:08:07 PM",
      "body": "No luck many people use Viabtc accelerator they are waiting every hour and not only real users I do believe someone also uses a bot and bypasses the captcha to submit their unconfirmed transactions.We already discuss this check the thread below- https://bitcointalk.org/index.php?topic=5479485.0The link already posted above faster than mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yey09",
      "created_time": "December 29, 2023, 05:34:12 PM",
      "body": "Quote from: Charles-Tim on December 29, 2023, 05:05:39 PMThis has been answered two day ago, which means you did not see it. Read this: Re: ViaBTC offers no more free TX acceleration?Bots are submitting transactions faster than humans. Most transactions are traced to be Ordinals transactions.So, even here ordinals make things worse",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "December 29, 2023, 10:13:59 PM",
      "body": "Quote from: Yey09 on December 29, 2023, 05:34:12 PMQuote from: Charles-Tim on December 29, 2023, 05:05:39 PMThis has been answered two day ago, which means you did not see it. Read this: Re: ViaBTC offers no more free TX acceleration?Bots are submitting transactions faster than humans. Most transactions are traced to be Ordinals transactions.So, even here ordinals make things worse Literally all Ordinals really do best is making things bad for bitcoiners while others will argue and says it a way of freedom but to me its nothing of such, super annoying, almost entirely useless and a pain.@Op, you can try this thread https://bitcointalk.org/index.php?topic=5034315.msg45976734#msg45976734, a member is actually helping in accelerating transactions but I guess it do take time since I placed mine yesterday there have been no changes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 29, 2023, 10:33:47 PM",
      "body": "Quote from: Charles-Tim on December 29, 2023, 05:05:39 PMBots are submitting transactions faster than humans. Most transactions are traced to be Ordinals transactions.Yes, this hase been mentioned there on thread but i still doubt that bots are set to bypass the captcha on the submit form in viabtc. I'm still keen the idea that viabtc stopped their free tx service temporarily without announcing it. The small fees shown on the block they mine are those who uses their paid service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}