{
  "id": "topic_5424036",
  "title": "Starbox",
  "author": "Starbox",
  "created_time": "November 29, 2022, 06:39:37 AMLast edit: November 29, 2022, 06:49:57 AM by Starbox",
  "content": "Merhaba sevgili forum üyeleri. Öncelikle bu başlığı açma amacım LBANK borsasını tanıtmak değil. Bu borsa ile ilgili anlamadığım çok garip durumlar var  ve buradaki üstatlardan fikir almak istedim ki ben veya başka arkadaşlar da faydalansın bu bilgilerden. Biliyorsunuz coinmarketcap bir borsa sıralaması yayınlıyor ve Lbank an itibariyle 21 sırada ve “trust score”ı 5.7 ve 1 Milyar 400 milyon dolar civarı hacim gözüküyor borsada. https://coinmarketcap.com/rankings/exchanges/Yani hacmi Kucoin’in bile 3 katı gözüküyor eğer gerçek ise hacim. Lbankın tokenı LBK’nın piyasa değeri is tamamen seyreltilmiş olarak bile 20 milyon dolar civarı gözüküyor coinmarketcap’te. Bu hacimdeki bir borsa eğer hacimler gerçekse bu fiyatta olmamalı bence.https://coinmarketcap.com/currencies/lbk/Daha da ilginç olan ise coinin kendi sitesine  gidince ortaya çıkıyor.https://www.lbank.info/lbk.html#/cityToplamda gözüken 2,000,000,000 coinin 1,766,400,712 adedinin yani yüzde 88 oranında coininin yakıldığını görüyoruz ki bu da sitesinde de belirtildiği gibi 2,242,477 dolar olmasını sağlıyor dolaşımdaki coinlerin piyasa değerinin mevcut 227,017,385 coin ile.19 milyon bile bana mantıksız gelirken 2 küsür milyon dolarlık piyasa değeri bana inanılmaz geldi.Etherscan’a bakınca başka bir gariplik fark ettim. https://etherscan.io/token/0x9cb1aeafcc8a9406632c5b084246ea72f62d37b6#balancesHolders kısmına gelince yakıldı denilen tokenların 0xb8e52b05faf9490507a0f5e8ed0c286ef0c21ef6 adresine gönderildiği görülüyor ama benim bildiğim yakım adresleri Ox000000….. gibi oluyor normalde. Ayrıca sadece 200 küsür cüzdan adresi var. Bu bilgiler gerçek is hala daha coin yakımları devam ettiğinden coin bedava gibi geliyor. Bir yandan da “madem bunlar gerçek niye bir sürü bu işi bilen adam bu coini almıyor da senin gibi bir acemi alacak” diyorum kendi kendime. Bu konuda bilgisi olan ustaların görüşlerini alarak bu coine bir miktar para koymayı düşünüyorum eğer bu bilgiler gerçekse ve benim gözümden kaçan bir şey yoksa.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424036",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "November 29, 2022, 08:20:25 AM",
      "body": "Sahte hacimli (wash trading) borsa hocam kesinlikle bulaşmayın. Mevcut hacmi coinbase kadar görünüyor üzerindeki sahte hacimli borsaları saymazsanız 3. en büyük borsa görünüyor ama adını ilk defa duyuyoruz. 2020'de piyasa çıkmış \"gerçek kullanıcılara sahip\" borsa tokeninin 200 holder ile kısıtlı kalması mümkün değil. Coinmarketcap'tan diğer borsaların holder sayılarını incelerseniz adını dahi duymadığınız borsa tokenlerinin bile onbinlerce kişiye yayılmış olduğunu görebilirsiniz. Hacim sahte, yakım adresi sahte kısacası her şey sahte. Bulaşmayın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Starbox",
      "created_time": "November 29, 2022, 09:13:03 AM",
      "body": "Çok sağolun üstadım. İşkillenmişştim ama hem coinmarketcap hem de coingecko hacmi yüksek verince bir acaba demiştim. Daha yanına yaklaşmam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}