{
  "id": "topic_5445773",
  "title": "coinremitter",
  "author": "coinremitter",
  "created_time": "March 21, 2023, 10:21:34 AM",
  "content": "There are many payment getaways that charges high amount on transactions. It is directly effect on merchant's profit. But there are some payment getaways which are charging the lowest fees. so I think the best part of cryptocurrency payment getaways is their transaction fees because they charges minor amount on transaction so that merchants will earn more eventually. Do you think of another reason ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445773",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "March 21, 2023, 10:38:21 AM",
      "body": "Quote from: coinremitter on March 21, 2023, 10:21:34 AMDo you think of another reason ?An example of your statement might help to understand it clearly. I think BTC is only beneficial to big merchants who make big transactions. Because small transactions will cost them more let's say a minimum of 2$ on each transaction like it can maximum go to like 15$ or 20$, maybe. That's a great option for merchants. But that's not enough like btc allows them the following features too.1. Global access to customers need a payment system that needs no border limitations and a seamless flow of transactions. That is possible only with digital currency like BTC because it is above centralized authorities and has no border limitations. Anyone from anywhere in the world could use BTC for payments.2. Speed of transactions is also a factor big transactions take some time to be processed but Many of you have known how much a small to large BTC transaction takes time.3.  Volatility of BTC is also a great factor for both the buyers and merchants to use it for payment because BTC has a clear aim to go high as demand is increasing so I think 2000$ paid in BTC could become 2200$ if btc changes its price in an uptrend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "March 21, 2023, 10:43:18 AM",
      "body": "Quote from: coinremitter on March 21, 2023, 10:21:34 AMThere are many payment getaways that charges high amount on transactions. It is directly effect on merchant's profit. I don't think it will significantly affect the profit of the merchant because usually the fees from transactions will be borne by the customer, not the merchant. Merchants usually only pay for the payment service they use, not pay per transaction made by their customers, and I think that's pretty cheap per month.And the reason one makes payments using crypto payment gateways is because it is quite fast and one does not need to convert their assets to fiat or vice versa. Crypto payments are also anonymous and can be made anywhere with no cross-border fees, that's the reason why one chooses a crypto payment gateway in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rokok lokal",
      "created_time": "March 21, 2023, 10:54:39 AM",
      "body": "Quote from: coinremitter on March 21, 2023, 10:21:34 AMDo you think of another reason ?In my opinion this is why paying through a cryptocurrency payment gateway is the added layer of security and privacy they provide. When making transactions through traditional payment gateways, personal and financial information is often shared and stored on centralized servers, which are vulnerable to hacking and data breaches.Cryptocurrency payment gateways on the other hand, use decentralized blockchain technology to process transactions, which provides a higher level of security and privacy. Additionally, cryptocurrency transactions are often anonymous, which can protect users from potential fraud and identity theft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stedsm",
      "created_time": "March 21, 2023, 11:04:36 AM",
      "body": "You're correct that these payment gateways do charge high sometimes (but it depends on the price of that crypto at that specific time) and these are used by the merchants only in order to provide those with smooth on-the-go transactions who are not allowed to purchase on their site with cards or bank transfer due to limited availability in the customer's place of residence (country). It's not necessary for everyone to use it if you've got other better options available, however you can save your data being leaked to banks that you purchased something from somewhere because the crypto transaction is known only to you and the merchant till any of you provides the data elsewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 21, 2023, 12:12:14 PM",
      "body": "Quote from: rokok lokal on March 21, 2023, 10:54:39 AMCryptocurrency payment gateways on the other hand, use decentralized blockchain technology to process transactions, which provides a higher level of security and privacy. I'm not sure what makes you come to this conclusion. A payment gateway can still record users' data even if they use blockchain to process the transfer. For example, stuff like e-mail address, user address, volume/transaction history, etc. Do you think they also dump those data to the blockchain or something? Unless the seller is generous and uses an open-source gateway that automatically deletes buyers' info after a few days or something. Quote from: rokok lokal on March 21, 2023, 10:54:39 AMAdditionally, cryptocurrency transactions are often anonymous, which can protect users from potential fraud and identity theft.Unless you use some privacy coins, most crypto transactions provide you with pseudonymity at best. That's why services like mixer or coinjoin exist. This also doesn't solve the identity theft or fraud that you mentioned, at best it helps you get fewer phishing e-mails. If you are afraid of fraud or identity theft, the best thing that you can do is stop using a sketchy platform that asks you to KYC for everything you do. You might want to explain more if you really believe this is the case so that we can discuss it better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "March 21, 2023, 12:43:33 PM",
      "body": "I've read somewhere that those payment gateways really are charging a lot from those businesses. That's why many of them just prefer to do bank transfers and cash payments.Whilst for crypto, they can also accept payments from it directly without thinking that a company will benefit from the payment system because they only have to pay the transaction fee which is too little and goes forward to the miners if it's for bitcoin payments.And for the altcoin payments, they're not really much of a concern because they're not a lot and just a few cents to cover the transfers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelonmusk",
      "created_time": "April 22, 2023, 12:04:47 PM",
      "body": "I think you're right that one of the biggest advantages of using cryptocurrency payment gateways is their low transaction fees. This is because cryptocurrency transactions don't require third-party intermediaries like banks or credit card companies, which can significantly reduce transaction costs.In other hand, advantage of using cryptocurrency payment gateways is the speed of transactions. Cryptocurrency transactions are processed almost instantly, which can be a huge benefit for merchants who need to receive payments quickly. So, cryptocurrency transactions are often more secure than traditional payment methods because they use blockchain technology, which makes it almost impossible to commit fraud or manipulate transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}