{
  "id": "topic_5477559",
  "title": "EluguHcman",
  "author": "EluguHcman",
  "created_time": "December 12, 2023, 10:52:34 AM",
  "content": "Do you still play the game to make profits? Or you plays for fun?There was this professional checker (draughts) gambler in my area who then spent most of his times in the checkers gambling board but I don't know if he is one of the addicted or not. For over 12 years now he has been working with one of the biggest oil company in my country.In more than 5 years now, he has been setting up annual gaming competitions amongst his old time gambling colleagues including those who are recognized and regularly gambling in the same checkers gambling location with him.He has always scheduled the gambling competitions annually once in a year and usually during the Christmas holidays.He offers specific number of motorcycles, bicycles, bags of rice including livestock's (chickens) amongst the championship (winners) after screening, friendly rounds, knockout rounds til the final rounds and your winning position depends on what rewards was staked for it.He single handedly takes responsibilities to fund this annual games but at then, the system of the game is not recognized as gambling but game of fun. This is because he doesn't want it be that he is encouraging gambling instead been sighted \" a game of fun that connects people together.I learnt he usually has about $5K for this annual gaming festive. It is also interesting to know that even colleagues residing afar comes around to pertake on the activity including those whose net worth is beyond the mentioned staked (rewards) are also pertakers because the fun of it seems exceptional.All these are literally what passion for gambling could be but yeah, this said gambling festive organiser happens to be a retired gambler.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477559",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 12, 2023, 10:58:06 AM",
      "body": "Nice man and that is generosity. If you do not spend to compete, that is not gambling. But I can understand you. This is also a sign that some people can spend the amount of money that they can afford to lose on gambling. The reason some people gamble is not for the money but for the fun and entertainment.Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?I do not like or hate to lose, but I can afford to lose the amount I depend on gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "December 12, 2023, 11:14:43 AM",
      "body": "It’s not every time one gets to witness such a beautiful story, so the people of that community should cherish what the man is doing for the community and also to their local gambling community.In this scenario now I don’t think “addiction” will ever come to my mind… I would like to think of the whole thing as a gaming competition and not a gambling thing. Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?Even if I play for fun, and then I was lucky to win will I reject it? NO… but due to the fear of addiction and some other health problems I have positioned my kind to take it as a fun activity so that I can be prepared to let go of anything I’ll lose in the process and not chase after my losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 12, 2023, 11:19:22 AM",
      "body": "This is usual thing because since he is funding game and no one else is staking with their money rather coming for competition amongst all the neighboring community and the old gamblers, even though they aren't paying any dinm for the competition one thing I learn from this post is that the said \"Host\" is trying to bring Peace and Unity among the following communities as well as those who keeps playing that game to earn something to assist their families in this festive season. So, This is entirely for fun and not for addicts and whomever that qualifies for the game has some packages to go home with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 12, 2023, 11:41:35 AM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?-snipNo, I don’t play the game anymore to make profits when I already have a clear understanding and realization about gambling in general. Play for fun will make you safe.Thanks for sharing this unique story, it has found a way to keep the spirit alive in a more lighthearted and communal setting. It struck me for his approach to framing it as a game of fun rather than traditional gambling. This event brings pure enjoyment. This is the other side, the beautiful impact of gambling that many people are unaware of because what they know and remember is only the losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 12, 2023, 12:32:02 PM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AM~This man definitely played for fun. I highly doubt anyone playing for profits would host their own competitions for their friends and colleagues. And annually at that. Someone I aspire to be tbf, I reckon I'd still be gambling down the road even when I'm old. The question is whether I have some friends along the line who do the same or not. I used to play for profits I guess, first few months. Quickly stressed me out but I couldn't quit so I just started trying to transition to playing for fun instead. Took a couple of months but hey, here we are.On a side note, isn't this topic better on Gambling Discussion instead?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "December 12, 2023, 12:52:55 PM",
      "body": "Quote from: Wexnident on December 12, 2023, 12:32:02 PMQuote from: EluguHcman on December 12, 2023, 10:52:34 AM~This man definitely played for fun. I highly doubt anyone playing for profits would host their own competitions for their friends and colleagues. And annually at that. Someone I aspire to be tbf, I reckon I'd still be gambling down the road even when I'm old. The question is whether I have some friends along the line who do the same or not. I used to play for profits I guess, first few months. Quickly stressed me out but I couldn't quit so I just started trying to transition to playing for fun instead. Took a couple of months but hey, here we are.On a side note, isn't this topic better on Gambling Discussion instead? Yes, sometimes are really just that easy to judge up someone that they are addicted basing up on the things that they've been doing on which without even trying to look  and realize that this guyis really just doing things just for fun. If he had been addicted into it and spending up tons then he wont really be last up for a decade+ on playing up checkers. Now that he is having a stablejob and even after retirement on which he is really that still playing or even funding up a competition just for the sake of fun then this do really shows that there are really indeed people who would really be sticking into the things that they've been interested even if they are already retired or already old.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "December 12, 2023, 01:56:38 PM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?Sometimes for profit but most of the time for fun.Quote........................ I learnt he usually has about $5K for this annual gaming festive. It is also interesting to know that even colleagues residing afar comes around to partake on the activity including those whose net worth is beyond the mentioned staked (rewards) are also pertakers because the fun of it seems exceptional.All these are literally what passion for gambling could be but yeah, this said gambling festive organiser happens to be a retired gambler.He just missed the fun associated with gambling so he's doing this, it's hard to remain retired from gambling without missing the fun when you say you are retired from gambling, you have experienced everything in gambling, the rewards, the losses, and the fun and so he is being generous to make others feel how to play in a fun way, the checker is a good choice for competition because it's not a luck-based game it involves skills experience.Maybe in the future, when I retire from gambling I will have something like this for friends just to take out the boredom of retirement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "December 12, 2023, 02:11:30 PM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AM-This is not an addiction if he fund his game without inflicting damage to others such as family member. I will do the same if I’m on his shoe since that’s the only thing that entertains me. People at retirement stage usually don’t have much time to spare on other activities that’s why they just focus to do what they are doing for a long time that gives them joy.Addiction is when you are doing it  just to chase loss and doesn’t enjoy what you are doing. Most of the addict person usually don’t think about fun anymore but chasing something that is not for entertainment purposes already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "December 12, 2023, 02:17:55 PM",
      "body": "No fun for me, let's make profit ~XD.IMO, fun while you're actually gambling in real-life. That's mean, gambling on (Landbase) casino while you can play the game in real life. That's for me is fun because our body playing the game.Meanwhile for online casino, is not actually getting the fun due we only clicked and feel hype or addicted to our psycology mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "December 12, 2023, 02:48:22 PM",
      "body": "QuotePassionate gambler keeps the gambling boards rolling even after retirementsIf you talk about competition, in my opinion it is quite clear that the person is gambling and placing bets based on having fun, it can be seen from the competition they are having against their colleagues.I am very sure that this person has a goal in the gambling activities that he does, I think the goal is one, namely to beat his friends on the basis of competition, he will show that he is more powerful and superior in gambling.I'm sure that person wants the best for himself, in his soul there is a competitive nature to show which is the best among his friends and that person, in this case purely as a hobby and entertainment, not to make money, just to show he is the best at gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Youngkhngdiddy",
      "created_time": "December 12, 2023, 02:51:58 PM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?There was this professional checker (draughts) gambler in my area who then spent most of his times in the checkers gambling board but I don't know if he is one of the addicted or not. For over 12 years now he has been working with one of the biggest oil company in my country.In more than 5 years now, he has been setting up annual gaming competitions amongst his old time gambling colleagues including those who are recognized and regularly gambling in the same checkers gambling location with him.He has always scheduled the gambling competitions annually once in a year and usually during the Christmas holidays.He offers specific number of motorcycles, bicycles, bags of rice including livestock's (chickens) amongst the championship (winners) after screening, friendly rounds, knockout rounds til the final rounds and your winning position depends on what rewards was staked for it.He single handedly takes responsibilities to fund this annual games but at then, the system of the game is not recognized as gambling but game of fun. This is because he doesn't want it be that he is encouraging gambling instead been sighted \" a game of fun that connects people together.I learnt he usually has about $5K for this annual gaming festive. It is also interesting to know that even colleagues residing afar comes around to pertake on the activity including those whose net worth is beyond the mentioned staked (rewards) are also pertakers because the fun of it seems exceptional.All these are literally what passion for gambling could be but yeah, this said gambling festive organiser happens to be a retired gambler.    I feel like that’s the main reason why the game is being played, basically for the fun generally we gamble for the love of the game regardless of the outcome. Which is why those who gamble out of compulsion tend to gamble with emotions which lead them to having heart breaks. I commend on the effort of the man putting in the work for his community. Games like this brings the people together especially in this festive season. There will be lot of fun happening at the game I presume,  from the post the OP made, it an event happening for some years now and from the post people participate to the game which is  an event they love. If it wasn’t accepted and loved by the people it wouldn’t have been played yearly. So yeah I will see the event is a success and the people love it. They just have to keep up with the tradition.   I won’t he surprise if people starts investing into the event, one small gathering may turn out to be a nation wide event if managed properly. They are a lot to learn from the trend, ranging from the gambling being a fun couple with the unity it brings to the community. So yeah kudos to the organizers of the event and to the originator of the event really did a good thing for the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "December 12, 2023, 02:58:52 PM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?Even people that gamble for fun won’t reject their profit if they win, so I am sure everyone is gambling for fun and profits, but the people that are getting things wrong are the ones that gamble for profit alone and ignore the fun part. If you gamble for profit alone, those are the ones that easily get addicted to gambling because all they will be after is the money, which they will easily end up being addicted to gambling.Quote from: EluguHcman on December 12, 2023, 10:52:34 AMI learnt he usually has about $5K for this annual gaming festive. It is also interesting to know that even colleagues residing afar comes around to pertake on the activity including those whose net worth is beyond the mentioned staked (rewards) are also pertakers because the fun of it seems exceptional.All these are literally what passion for gambling could be but yeah, this said gambling festive organiser happens to be a retired gambler.Waw, this is really serious, and it’s the interesting part of gambling. If you think the man is addicted to gambling, that’s why he decides to spend that amount of money to organize an event like that. You are wrong, the man is just having fun. Organising events like this will connect even old friends together. You have fun, talk about the past, and that’s really a good memory to keep. The man I know about does organise a football competition among the youths, so there will be a specific amount to be won by the youths, and he will be the one to sponsor everything, even the price that will be won. He will be the one to pay for the gift and the amount to be given to the team that wins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "December 12, 2023, 03:11:13 PM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AMI learnt he usually has about $5K for this annual gaming festive. It is also interesting to know that even colleagues residing afar comes around to pertake on the activity including those whose net worth is beyond the mentioned staked (rewards) are also pertakers because the fun of it seems exceptional.All these are literally what passion for gambling could be but yeah, this said gambling festive organiser happens to be a retired gambler.It is a good story and very inspiring coming from a retired gambler, it's worth emulating when you retire from gambling, you know in gambling, there's a lot of risking money but there is fun associated with it, and when you retire you just want to remember the thrill and the fun, so you try to remember it by launching events like this, if you have the means why not, its foster goodwill and camaraderie.It's not the money involved here but the fun that everyone experienced by holding this event, retirement is hard and you need to do something meaningful just to keep the excitement you experienced in gambling but this time in a different way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "December 12, 2023, 03:43:23 PM",
      "body": "The man must be entertaining himself with the people that comes around for this competition that he oraganizes annually. As I was reading your write up, it makes me want to see myself in such competition, so that I can also enjoy the fun in the competition and the crowd that comes around for such event. He must be a generous man and has so much love on gambling.Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?Playing for fun is the best way one can enjoy gambling because you will be able to have self control and you will be discipline on your gambling activities. I gamble for fun and nothing more but at the same time, nobody will wish to lose his bet but if you lose then you can come back another day and you will be lucky to have a win. Gambling for profit will lead you to addiction and gambling will fustrate you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "December 12, 2023, 04:01:12 PM",
      "body": "Unless the guy know what he was doing.He still working, with a really long time + can manage him self by doing these. Not everyone can do these while the topic they're doing is aboug (Gambling) 90% of us will get addiction gambling.At least he really know to manage himself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 12, 2023, 04:04:30 PM",
      "body": "He isn't addicted or if he was, he got out and turned his life around. He found himself a job that he must have loved so he retires from gambling and just makes a fun annual competition at the same time a chance to see his old buddies. He probably misses the fun so he had this event to see old friends and check out how his old buddies' life has turned out over the years. Does he have sponsors? Events like this in the neighborhood attract sponsors for the prizes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "December 12, 2023, 04:30:23 PM",
      "body": "Laughing, reading this, remembering old days, playing drought games, and watching older folks enjoy the fun. Not sure any casino has such a game. It's quite common amongst the old folks. And they usually gamble with the game. Spectators can also stake games on their favorite player. However, I don't think anyone has ever been addicted to a drought game. Unless a playmate is constantly available, it's not enjoyed alone. So, the fact that one party gets tired and stops playing, helps the players not to get addicted. The man in the story, is indeed a pro, for optimizing the fun of the game with lots of monetary rewards. Inviting old hands like him only improves the charisma of the spectators, players, and the game. It's quite a calculative game and helps brain power, a close cousin to chess games. His ideas are great, because of the joy he puts on the faces of older men. This could be an innovative idea in the future. Lots of people are interested in the game, but I rarely see such activities in today's society. Now, that he's retired, he can schedule weekly games, receive regular fun, and reduce the reward. At least to save up money for his retirement plan. Quote from: ryzaadit on December 12, 2023, 04:01:12 PMUnless the guy know what he was doing.He still working, with a really long time + can manage him self by doing these. Not everyone can do these while the topic they're doing is aboug (Gambling) 90% of us will get addiction gambling.At least he really know to manage himself.The only painful aspect of the game is losing money, but the way it's done, like any other board game, the losers are evicted for another player to participate. Hence, it reduces the rate of addiction, unlike online casinos where we can play every minute or second. I've watched men play it, they don't get addicted. Because money is involved, they only have a long argument over a mistake or broken rule. The fun is quite on a big cap with the losses, and it helps the elderly men to have real fun and improves critical thinking in men's lives. So, the fact he controlled himself to old age without being addicted also has to do with the nature of the game. Hence in gambling the structure, rules, and regulation of the game, contribute to the rate of addiction of the player.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "indo1",
      "created_time": "December 12, 2023, 04:42:29 PM",
      "body": "pleasure or addiction depends on a person's economy, like if we have enough money, of course we play just for fun, but if our finances are still standard, of course we hope for luck, and we often meet with ruin if we don't control it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 12, 2023, 04:56:03 PM",
      "body": "Quote from: EluguHcman on December 12, 2023, 10:52:34 AMDo you still play the game to make profits? Or you plays for fun?All these are literally what passion for gambling could be but yeah, this said gambling festive organiser happens to be a retired gambler.Play the game to make profits and have fun as well, you can do both while enjoying the thrill of a game. I think this man do really love camaraderie in my opinion considering he has been doing it for years now then he must love this activity that much. The main focus probably right here is to enjoy considering it's just once a year celebration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}