{
  "id": "topic_5468945",
  "title": "alexrossi",
  "author": "alexrossi",
  "created_time": "October 02, 2023, 08:22:56 PM",
  "content": "Prendendo in considerazione questo tool: https://mempool.jhoenicke.de/#BTC,1y,weightSi può vedere come da circa 6 mesi (anche di più se non prendiamo la piccola interruzione prima dei 6 mesi ultimi) c'è stato un sostanziale utilizzo della mempool che, nonostante non abbia mai raggiunto livelli critici di fee alte, ha comunque avuto picchi prolungati a 10-15 sat per byte.Quello che mi stupisce è la caduta repentina dell'ultima settimana, praticamente è come se negli ultimi giorni i movimenti si fossero ridotti in maniera controllata (e idem, a questo punto, per il mantenimento dell'intasamento durante la fase di \"piena\").Sorgono alcune domande, in primis:1) Se parliamo di un attacco ben foraggiato ma non andato a buon fine (mia ipotesi), per es. per screditare il blocco piccolo a tutti i costi. In particolare per le fasce ben delineate visibili nel grafico, come se da qualche parte venissero broadcastate in rete 40-50 mega di transazioni tutte alla stessa fee per rendere necessario il pagare sopra la soglia e quindi causare fastidio.2) Se tutto ciò deriva da ordinals, cosa secondo me poco plausibile perché non c'è stato l'hype per es. degli NFT dove c'era un interesse economico di compravenditaNB: anche su eth si è verificato un calo delle tx, questo potrebbe favorire la teoria di un semplice calo di utilizzo della rete",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468945",
  "comments": [
    {
      "author": "fillippone",
      "created_time": "October 02, 2023, 09:42:12 PM",
      "body": "Quote from: alexrossi on October 02, 2023, 08:22:56 PMPrendendo in considerazione questo tool: https://mempool.jhoenicke.de/#BTC,1y,weightSi può vedere come da circa 6 mesi (anche di più se non prendiamo la piccola interruzione prima dei 6 mesi ultimi) c'è stato un sostanziale utilizzo della mempool che, nonostante non abbia mai raggiunto livelli critici di fee alte, ha comunque avuto picchi prolungati a 10-15 sat per byte.Quello che mi stupisce è la caduta repentina dell'ultima settimana, praticamente è come se negli ultimi giorni i movimenti si fossero ridotti in maniera controllata (e idem, a questo punto, per il mantenimento dell'intasamento durante la fase di \"piena\").Sorgono alcune domande, in primis:1) Se parliamo di un attacco ben foraggiato ma non andato a buon fine (mia ipotesi), per es. per screditare il blocco piccolo a tutti i costi. In particolare per le fasce ben delineate visibili nel grafico, come se da qualche parte venissero broadcastate in rete 40-50 mega di transazioni tutte alla stessa fee per rendere necessario il pagare sopra la soglia e quindi causare fastidio.2) Se tutto ciò deriva da ordinals, cosa secondo me poco plausibile perché non c'è stato l'hype per es. degli NFT dove c'era un interesse economico di compravenditaNB: anche su eth si è verificato un calo delle tx, questo potrebbe favorire la teoria di un semplice calo di utilizzo della reteOvviamente ho notato anche io lo svuotamento della mempool, e la cosa che mi ha stupito parecchio è che non mi spiegavo come fosse possibile senza un'aumento dell'hashrate, che invece è rimasto piuttosto costante (è previsto un calo minomo dell'hash rate al prossimo aggiustamento della difficoltà.Possibile che siano calate le transazioni di ordinals nella rete? O più precisamente siano calate le transazioni relative ad Ordinals nella mempool?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "October 05, 2023, 06:05:34 AM",
      "body": "Ordinals ha avuto un crollo improvviso delle inscriptions giornaliere e questa è sicuramente la causa principale. C'è stato però anche un aumento altrettanto improvviso dei btc depositati su LN. Forse qualche grosso exchange (Binance?) ha iniziato a usare pesantemente il layer 2 e questo ha contribuito al calo delle txDa notare che l'anomalia c'era prima perchè le tx sono tornate adesso in linea con il trend di lungo periodo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gbianchi",
      "created_time": "October 05, 2023, 07:24:23 AM",
      "body": "Come dicevo in un altro thread, contemporaneamente e' successa un'altra cosa strana (coincidenza?)anche i nodi LN sono calati repentinamente, anche se i BTC depositati su LN sono aumentati, mentre i nodi Bitcoin non hanno subito nessuno scossone:2023-09-25           175492023-09-26           174882023-09-27           169862023-09-28           169472023-09-29           169152023-09-30           168842023-10-01           165882023-10-02           165652023-10-03           16530",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "October 05, 2023, 10:23:02 PM",
      "body": "Quote from: Plutosky on October 05, 2023, 06:05:34 AMC'è stato però anche un aumento altrettanto improvviso dei btc depositati su LN. Forse qualche grosso exchange (Binance?) ha iniziato a usare pesantemente il layer 2 e questo ha contribuito al calo delle txL'aumento recente dei BTC messi su LN però non è altro che il riflesso del calo degli ultimi mesi, mi pare. Tra l'altro mi sfugge il perchè del calo della capacity di LN: in teoria in un momento di alte fees si dovrebbe usare di più LM, quindi un aumento della capacity mi parrebbe naturale in tale environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "October 06, 2023, 07:20:15 AM",
      "body": "Quote from: fillippone on October 05, 2023, 10:23:02 PMQuote from: Plutosky on October 05, 2023, 06:05:34 AMC'è stato però anche un aumento altrettanto improvviso dei btc depositati su LN. Forse qualche grosso exchange (Binance?) ha iniziato a usare pesantemente il layer 2 e questo ha contribuito al calo delle txL'aumento recente dei BTC messi su LN però non è altro che il riflesso del calo degli ultimi mesi, mi pare. Tra l'altro mi sfugge il perchè del calo della capacity di LN: in teoria in un momento di alte fees si dovrebbe usare di più LM, quindi un aumento della capacity mi parrebbe naturale in tale environment. anche io mi aspettavo un aumento nella fase di fee alte, non riesco a spiegarme e a quanto. pare non sono l'unicomi sentivo un deficiente, babo che che ca$$o pensi, sara cosi e sei tu che non capisciinvece no, perche calano benche le fee siano alte? forse sta diventando piu difficile tenere un nodo? forse rappresenta una sfida tecnica maggiore?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "October 06, 2023, 10:44:54 AM",
      "body": "Quote from: babo on October 06, 2023, 07:20:15 AMQuote from: fillippone on October 05, 2023, 10:23:02 PMQuote from: Plutosky on October 05, 2023, 06:05:34 AMC'è stato però anche un aumento altrettanto improvviso dei btc depositati su LN. Forse qualche grosso exchange (Binance?) ha iniziato a usare pesantemente il layer 2 e questo ha contribuito al calo delle txL'aumento recente dei BTC messi su LN però non è altro che il riflesso del calo degli ultimi mesi, mi pare. Tra l'altro mi sfugge il perchè del calo della capacity di LN: in teoria in un momento di alte fees si dovrebbe usare di più LM, quindi un aumento della capacity mi parrebbe naturale in tale environment. anche io mi aspettavo un aumento nella fase di fee alte, non riesco a spiegarme e a quanto. pare non sono l'unicomi sentivo un deficiente, babo che che ca$$o pensi, sara cosi e sei tu che non capisciinvece no, perche calano benche le fee siano alte? forse sta diventando piu difficile tenere un nodo? forse rappresenta una sfida tecnica maggiore?In teoria Lightning network avrebbe dovuto essere usatissimo in un periodo di rete congestionata, e soprattutto quando si crede che questa congestione sia stabile, e non temporanea.Ovviamente tutti sappiamo che Ordinals siano un puro gambling, ma proprio per quello anche credo che rimarrà una lunga “pressione” nelle transazioni.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "October 06, 2023, 07:28:18 PM",
      "body": "QuoteL'aumento recente dei BTC messi su LN però non è altro che il riflesso del calo degli ultimi mesi, mi pare. Tra l'altro mi sfugge il perchè del calo della capacity di LN: in teoria in un momento di alte fees si dovrebbe usare di più LM, quindi un aumento della capacity mi parrebbe naturale in tale environment. QuoteIn teoria Lightning network avrebbe dovuto essere usatissimo in un periodo di rete congestionata, e soprattutto quando si crede che questa congestione sia stabile, e non temporanea.Ovviamente tutti sappiamo che Ordinals siano un puro gambling, ma proprio per quello anche credo che rimarrà una lunga “pressione” nelle transazioni. Non direi che la rete era \"congestionata\": il numero di tx era a livello record ma le fees si sono mantenute abbastanza basse.La capacità di LN è influenzata dai grandi nodi, basta che uno di essi stacchi qualche grosso canale e i btc depositati possono variare significativamente.Il recente aumento della capacity, abbinata ad un calo del numero di nodi su LN, fa pensare che qualche grosso nodo abbia aumentato la sua disponibilità  in un quadro generale però di temporaneo minore utilizzo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "October 11, 2023, 05:24:42 PM",
      "body": "Beh, allargando un po’ l’orizzonte per fare un confronto con la situazione prima di ordinals (che è esploso all’inizio di quest’anno), direi che le fees (qui si considera la media mobile a 14 giorni) erano nettamente più alte:Comunque la tua spiegazione può starci, ma la legherei più ad una ottimizzazione del capitale dedicato al modo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "October 19, 2023, 03:41:43 PM",
      "body": "stavo riflettendo su questo, mi sono fatto anche un piccolo widget nella mia home page di inizio personalemi sono fatto anche una board grafana, questo perche quando invio le tx vorrei usare il minimo possibile di feemi sono accorto che da molti giorni sono bassissime, sui 2/3 satoshi.. beh tanta roba",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "October 20, 2023, 06:52:05 AM",
      "body": "Siamo sicuri che stiamo sui 2-3sat/b? Perché da alcuni wallet mi spunta da 30 a 52sat/b o state parlando di Lightning network?Invece sui vari fee calculator mi compare una media di 12 con max a 22sat/bInsomma 2-3sat/b è veramente tanta roba ma da quali fonti prendi questi dati? Più che altro per informazione personale",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "October 20, 2023, 07:54:40 AM",
      "body": "Quote from: Lillominato89 on October 20, 2023, 06:52:05 AMSiamo sicuri che stiamo sui 2-3sat/b? Perché da alcuni wallet mi spunta da 30 a 52sat/b o state parlando di Lightning network?Invece sui vari fee calculator mi compare una media di 12 con max a 22sat/bInsomma 2-3sat/b è veramente tanta roba ma da quali fonti prendi questi dati? Più che altro per informazione personale Li prendo direttamente dalla mempool come avrai visto dallo screenshot ho pure il lastblock, oltre alla fee mediana del momento. Quindi la mia fonte di dati e' la fonte per eccellenza, bitcoin stesso.Spesso devo fare delle tx e mi scoccia lasciare piu fee del dovuto, non so come i wallet fanno sto conto, ma lo fanno sbagliato.Quindi mi sono attrezzato.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "October 20, 2023, 02:50:09 PMLast edit: October 21, 2023, 03:19:59 PM by bastisisca",
      "body": "Quote from: Plutosky on October 06, 2023, 07:28:18 PMNon direi che la rete era \"congestionata\": il numero di tx era a livello record ma le fees si sono mantenute abbastanza basse.Insomma, mi sento ti dissentire. Qualche mese fa ho dovuto fare qualche transazione su rete bitcoin e le fee che ho pagato erano decisamente anormali, anche 50-60 satoshi, non mi pare mica una fee bassa questa.Ora tutto sembra tornato normale, tuttavia il periodo passato era veramente un bagno di sangue, sembrava di transare su rete ethereum, brrrrr.Riguardo al numero di transazioni per secondo come stiamo messi? Per sapere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "October 21, 2023, 07:12:31 PM",
      "body": "Quote from: bastisisca on October 20, 2023, 02:50:09 PMRiguardo al numero di transazioni per secondo come stiamo messi? Per sapere.La dashboard migliore al momento è questa: https://mempool.space/it/Nella homepage c'è un grafico sul numero di transazioni che entrano nella mempool (il numero di transazioni al secondo processate dal network è invece pressocè sempre stabile).A livello di transazioni nella mempool invece non siamo messi malissimo: Un numero parecchio basso, che ho controlalto anche con Glassnode.Su mempool.space c'è un numero praticamente doppio. Si sa che ogni mempool è diversa, ma la differenza mi sembra tanta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "October 22, 2023, 02:50:10 PM",
      "body": "Quote from: fillippone on October 21, 2023, 07:12:31 PMQuote from: bastisisca on October 20, 2023, 02:50:09 PMRiguardo al numero di transazioni per secondo come stiamo messi? Per sapere.La dashboard migliore al momento è questa: https://mempool.space/it/Nella homepage c'è un grafico sul numero di transazioni che entrano nella mempool (il numero di transazioni al secondo processate dal network è invece pressocè sempre stabile).A livello di transazioni nella mempool invece non siamo messi malissimo: Un numero parecchio basso, che ho controlalto anche con Glassnode.Su mempool.space c'è un numero praticamente doppio. Si sa che ogni mempool è diversa, ma la differenza mi sembra tanta. Grazie per le risorse e per la tua reale interpretazione. Ora ti spiego il motivo della mia richiesta. Bitcoin deve competere con alcuni metodi di pagamento, se vogliamo e quindi come possiamo valutare la sua efficacia tecnicamente.Allora avevo pensato, se il numero di transazioni per secondo di bitcoin supera il numero di transazioni per secondo di Visa, allora bitcoin fa meglio!Non so se sbaglio a fare questa considerazione.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "October 22, 2023, 03:18:07 PM",
      "body": "Quote from: bastisisca on October 22, 2023, 02:50:10 PMNon so se sbaglio a fare questa considerazione.Direi proprio di sì.Bitcoin non nasce come moneta transazionale, per pagare il caffè per capirci, ma serve come settlement layer di transazioni finanziarie. Bitcoin quindi non deve essere equiparato a VISA, ma al sistema TARGET, ovvero il layer di settlement tra le banche.  Se vogliamo avere qualcosa che si equipari più direttamente a VISA, sia logicamente che come throughput, allora dobbiamo guardare a Lightnin network, o equivalenti soluzioni L2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "October 23, 2023, 12:16:06 PM",
      "body": "Quote from: fillippone on October 22, 2023, 03:18:07 PMQuote from: bastisisca on October 22, 2023, 02:50:10 PMNon so se sbaglio a fare questa considerazione.Direi proprio di sì.Bitcoin non nasce come moneta transazionale, per pagare il caffè per capirci, ma serve come settlement layer di transazioni finanziarie. Bitcoin quindi non deve essere equiparato a VISA, ma al sistema TARGET, ovvero il layer di settlement tra le banche.  Se vogliamo avere qualcosa che si equipari più direttamente a VISA, sia logicamente che come throughput, allora dobbiamo guardare a Lightnin network, o equivalenti soluzioni L2.Ah vero, hai assolutamente ragione chiedo venia e mi cospargo il capo di cenere. Quello che stai asserendo sicuramente ha un senso logico, ero io in errore dato che pensavo bitcoin come una moneta transazionale. Rispetto al sistema TARGET come si comporta quindi? Direi a occhio e croce meglio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "October 24, 2023, 03:12:22 AM",
      "body": "Quote from: bastisisca on October 23, 2023, 12:16:06 PMQuote from: fillippone on October 22, 2023, 03:18:07 PMQuote from: bastisisca on October 22, 2023, 02:50:10 PMNon so se sbaglio a fare questa considerazione.Direi proprio di sì.Bitcoin non nasce come moneta transazionale, per pagare il caffè per capirci, ma serve come settlement layer di transazioni finanziarie. Bitcoin quindi non deve essere equiparato a VISA, ma al sistema TARGET, ovvero il layer di settlement tra le banche.  Se vogliamo avere qualcosa che si equipari più direttamente a VISA, sia logicamente che come throughput, allora dobbiamo guardare a Lightnin network, o equivalenti soluzioni L2.Ah vero, hai assolutamente ragione chiedo venia e mi cospargo il capo di cenere. Quello che stai asserendo sicuramente ha un senso logico, ero io in errore dato che pensavo bitcoin come una moneta transazionale. Rispetto al sistema TARGET come si comporta quindi? Direi a occhio e croce meglio.Beh, meglio o peggio non lo so, ma ti porto due esempi.Da quando esiste Bitcoin sono successe due cose al sistema “TARGET”, messo tra virgolette perché in questa analisi includo anche il'analogo sistema della FED:Il sistema si è evoluto per consentire un regolamento più veloce dei settlement interbancari (FEDnow, e bonifici istantanei)Si fa un gran parlare di efficientare il sistema con buzzword tipo \"blockchain\" e \"trasparenza ed efficienza\", cose impensabili finì a qualche tempo fa in un sistema monopolisticoQuesto solo grazie alla presunta, ripeto presunta, per fare contento @Paolo.Demidov, concorrenza di Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "October 24, 2023, 06:12:08 PM",
      "body": "Quote from: fillippone on October 24, 2023, 03:12:22 AMBeh, meglio o peggio non lo so, ma ti porto due esempi.Da quando esiste Bitcoin sono successe due cose al sistema ?TARGET?, messo tra virgolette perché in questa analisi includo anche il'analogo sistema della FED:Il sistema si è evoluto per consentire un regolamento più veloce dei settlement interbancari (FEDnow, e bonifici istantanei)Si fa un gran parlare di efficientare il sistema con buzzword tipo \"blockchain\" e \"trasparenza ed efficienza\", cose impensabili finì a qualche tempo fa in un sistema monopolisticoQuesto solo grazie alla presunta, ripeto presunta, per fare contento @Paolo.Demidov, concorrenza di Bitcoin.Grazie per lo spiegone, questi sono appunto gli effetti benefici della concorrenza. La concorrenza spinge a una evoluzione ulteriore per appunto primeggiare o quanto meno non restrare indietro. Darwin ha spiegato molto bene come funziona e ignorarlo anche per queste cose non mi pare molto furba come cose.Io lo dico senza dire presunta, questi sono gli effetti della concorrenza e ben venga per tutti. Vuol dire che ci si evolve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "October 25, 2023, 06:44:15 AM",
      "body": "Io penso con onesta e sincerita che se se non avevamo l'avvento delle crypto e nella fattispecie bitcoin, col cavolo che avevamo i bonifici istantanei.La concorrenza da che mondo e mondo serve proprio a quello a dare una spinta potente all'innovazione, la concorrenza e' uno dei motori del capitalismo che QUANDO NON CONVIENE non viene citato.Grazie alla concorrenza di Iliad in italia ora abbiamo prezzi \"onesti\" per la connessione mobile dati. Prima era un costo esagerato.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}