{
  "id": "topic_5437113",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "January 28, 2023, 02:23:32 PMLast edit: February 01, 2023, 04:45:47 PM by Fivestar4everMVP",
  "content": "This Na Area Yearn - I want us to use this thread to dey update ourselves wetin dey happen For our Area, Most especially, now wey election don dey close..MY AREA-As e be now eeh, mata don pass sit down dey wait, For (edited)  here wey be my ogbe, kasala full ground, i go go through this kasala one after the other.1. No Light.For Almost One month now, we never see light we stable more than five minutes before they take am, and they no dey bring am pass two or three times in a day, the matter now don make water scarce for here, those wey get water and no generator no fit pump water, those wey get water and generator no see fuel buy, so that they go fit pump water, they ones wey manage pump water no gree sale, the ones wey dey manage sale don hike the price of 1 gallon(25 liter) from #10 wey we dey buy am before to #50 now, some dey even sale #70,#100 for 25 liter of water.2. No Water. I don explain as e take be for my area concerning water, together with light matter above, make this post no too long, i no go go further on this one again.3. No Money.CBN announce say deadline for old currency na 31st of January, and as e be right now for my area here, my people for here no dey gree collect the old note again ooh, and the worst part be say we no see the new note collect from bank, ATMs wey dey this ogbe na old currency all of them dey pay, and the banks no send, if you enter their domain do any how, police go knack you kpako for head, bundle you troway for outside, this na if they no arrest you.Doing business now is really difficult for our older forks wey no sabi wetin be \"i want to do transfer\", yahoo boys dey even use this opportunity to chop many people as most of them don start to dey send fake alert.People wey dey sell no won collect old note, those wey won buy no see new note to take pay for wetin dey won buy -- wetin man pikin go do like this???.4. No Fuel. If to say as light no dey, fuel dey, maybe people for not too complain, but as it is now, a liter of fuel here na #500 and black market dey sell #700, but even as e cost so, To see am buy na still a big wahala.No light, and no fuel, businesses dey suffer as they no see fuel to run their business, barbers, dry cleaners, tailors, bet9ja shops, saloon, gym houses, phone and computer repair shops -this na just to name a few, what about okada people, tricyclist them, public/commercial transporters.. Water a scarcity biting really hard in my area now due to no light and no fuel , things are getting out of hand over here..How things be for your area? let us know make we know which side we go dey relocate dey go abeg ...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437113",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "January 28, 2023, 04:23:27 PM",
      "body": "Naija tire persin, dis APC time na multiple wahala, and I still dey hear say some people won vote for them. That na why I dey pity Naija people less now, make dem get am wrong again, I go just dey laugh, bcos wetin pass persin power na laugh dem dey take am laugh.For d situation 4 my area, well, water no be issue, I dey decent areas so borehole water dey always run as gen dey as alternative to pump. But light na issue 4 dis January oo, d 6 hours wey we dey manage b4 don turn to 0 hours, e tire persin. Even to collect moni 4 ATM na wahala today, I just turn back as I see huge queue 4 three banks. But I hear say na cooperative people pay moni or salary time for civil servants, so e fit no be government wahala.Finally, fuel na gbege 4 here oo, I just dey manage d one I get. Na either black-market or u queue 4 whole day or more. I no fit dey stress myself like that, na black-market most time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "January 28, 2023, 08:28:25 PM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PMThis Na Area Yearn - I want us to use this thread to dey update ourselves wetin dey happen For our Area, Most especially, now wey election don dey close..MY AREA-As e be now eeh, mata don pass sit down dey wait, For Ibusa, Asaba here wey be my ogbe, kasala full ground, i go go through this kasala one after the other.1. No Light.For Almost One month now, we never see light we stable more than five minutes before they take am, and they no dey bring am pass two or three times in a day, the matter now don make water scarce for here, those wey get water and no generator no fit pump water, those wey get water and generator no see fuel buy, so that they go fit pump water, they ones wey manage pump water no gree sale, the ones wey dey manage sale don hike the price of 1 gallon(25 liter) from #10 wey we dey buy am before to #50 now, some dey even sale #70,#100 for 25 liter of water.2. No Water. I don explain as e take be for my area concerning water, together with light matter above, make this post no too long, i no go go further on this one again.Light no be issue for my Area, as we get steady light since and we no dey too stay off light like that as my area dey use the same gride cable with the I International Airport, so power supply na oboge 4 we area, and talk of water we still get enough light to pump water at will and even though the light no stable on the 24/7 basis but isha dey to use when available. But the issue of the new naira note na the one were affect everybody be that because for my area only few people have access to the new note and the few POS that have the new denomination are selling it because you will have to pay 1500+ fees on #10,000 withdrawal as the matter be everybody turn turn to transfer for transaction to go on. The few thing I will like us to prepare for in the coming days as election draw close is in the area of security, this currency swap will trigger a lot of issues beyond what we can imagine and a lot of damages may be done before Nigerians get used to this new systems. We should also be clear on some facts that we may face in the coming days which are. -scarcity of the naira note, make we no expect the new naira notes to be excess in circulation just like the old notes since thos new policy includes limites on individual cash withdrawal which is aim as moving out naira notes from circulation and adding cashless policy. So let us take upon ourselves to enlighten and educate the general public on the effective and secured ways to confirming e transaction to eliminate the activities of yahoo boiz who will want to take advantage of the current situation by sending fake alerts. God bless Nigeria 🇳🇬",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dewchim",
      "created_time": "January 29, 2023, 04:37:34 AM",
      "body": "For past one week no electricity, just last Friday the electricity company came for their bill payment, My bro this country is closer to Hell 🔥",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "January 29, 2023, 05:30:19 AM",
      "body": "My area bad I swear and the most challenging wey we dey face now na about the new note current,that one na very funny matter, could you imagine they paid a bride with old note money and the bride family refused to collect it, and even for market na some of the shop's they collect old note currency, seriously the matter choke me for neck na only UBA bank dey my area some people like to travel to another places to deposit their money because people too much for bank and bank dey charge them and concentrate on people wey go give them something for help, even pos charges too much again, my brothers everywhere chock for this new note currency for my side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "January 29, 2023, 11:27:33 PM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM2. No Water. I don explain as e take be for my area concerning water, together with light matter above, make this post no too long, i no go go further on this one again.Wth evri evri way u lost dere eh, water na d least tin 2 worry about 4 we naija. No b 2day way persn start 2 buy water na. Nigerians don dey buy water since 1960. Wen u enter villa cef, na straight up stream abi dis tap way dem dey pump wth hand. I no knw watin dem dey call am shah bt, wen e cum 4 township life, if u no get water 4 ur compound, u go buy as usual jst dat, I dey hear say 1 20litre rubber now na #20 naira 2 meet up wth fuel price. Some gud citizens still dey giv water free on a routine shah.4 light matter, na area by area o. My area, dem dey try shah but, dem no fit try finish na, u go stil nid buy fuel some kind tyms mak we 4 dey alryt. No mata hw e be, we dey survive nd go stil dey push 4 beta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "January 30, 2023, 08:17:13 AM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM1. No Light. For my area of pitakwa, dis NEPA guys dey give light as e dey Dem for body and I fit count for hand how many times we don geh light after the last bill we pay. E no be today wey we start to see shege for dem hand and before I bin dey blame them, until I com see say dem sef folo dey use generator as sub wen light no dey! E shock you?!  Sometimes I no get anybody else to blame but the govt of we contri. E sopoz shame us say when we bin dey supply light give Ghana, we no hear of power outage for dia side uptil now. But we? Nah to carry substandard tins dey full d contri so dem fit use collect more money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "January 30, 2023, 05:19:28 PM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM3. No Money.CBN announce say deadline for old currency na 31st of January, and as e be right now for my area here, my people for here no dey gree collect the old note again ooh, and the worst part be say we no see the new note collect from bank, ATMs wey dey this ogbe na old currency all of them dey pay, and the banks no send, if you enter their domain do any how, police go knack you kpako for head, bundle you troway for outside, this na if they no arrest you.Doing business now is really difficult for our older forks wey no sabi wetin be \"i want to do transfer\", yahoo boys dey even use this opportunity to chop many people as most of them don start to dey send fake alert.People wey dey sell no won collect old note, those wey won buy no see new note to take pay for wetin dey won buy -- wetin man pikin go do like this???.How things be for your area? let us know make we know which side we go dey relocate dey go abeg ...  My own na say no money. Now wey dem talk say make we swap our old notes for new one we dey shege banza. E nor easy, if I talk say e easy eh na lie wey I dey lie. Wetin pain me pass be say the new notes Dem dey manipulate the availability. I just hope say this suffering go end soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "February 01, 2023, 12:41:59 PM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PMThis Na Area Yearn - I want us to use this thread to dey update ourselves wetin dey happen For our Area, Most especially, now wey election don dey close..MY AREA-As e be now eeh, mata don pass sit down dey wait, For Ibusa, Asaba here wey be my ogbe, kasala full ground, i go go through this kasala one after the other.1. No Light.This one tie wrapper for my area. Na as e be nepa na so dem dey remember us o. When month end them bring bill come make we pay for the light wey we no use. Not just to pay bill but estimated bill wey dem no dey come take meter readings at all, person go dey for him office at him convenient write bill come give us month end say na wetin we go pay. My brother de matter dey provoke me any time i think of am and the money i dey burn for fuel everyday too, e dey provoke me. After dem go come cut person wire drop and sometimes dem dey  carry the wire dem go.2. No Water. Water no b issue sha as long as generator dey on, I dey  pump water for my house and water na wetin i no dey take play for house o because water fit ground activities for house o. You see water, it is very important.3. No Money.CBN and Emefiele are confused sets of entity. These categories of entity are just making things difficult for Nigerians and they are up there comfortable with it. New notes are not much in circulation and they want people to swap the old note encouraging digital cashless policy when the economy of the nation is not ripe yet for that stage.  1. No Fuel. This one is a ticking time bomb waiting to explode. How can we be producing crude oil and claiming to be the largest refinery in Africa yet we are experiencing fuel scarcity, hike in fuel pump price. This is very ridiculous men. Too many questions our leaders are yet to answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "February 01, 2023, 01:19:30 PM",
      "body": "Bros I no understand wetin dey happen for the country with the present state wey we dey now. To collect your own money bank go give you limit of withdrawal, for my place e son reach one week wey we see light for eye till today.1. Light na season film for here wey idey BY e be like say the leaders for these major fields don put their head together to strike us bad belle.2. If no light to get water go be big problems so na Gen we dey use pump water.3. Fuel scarcity na dis one dey burst my head,yesterday wey I go buy fuel,if you see the queue for filling station upon say one litre na 420 naira. I no come understand wetin APC government get to tell us for this one.4. Money na e be man backbone of a man, to get full access to your own cash again na problem because one one nonsense selfish interest of some persons for the government, the come use am dey choke the masses. Fuck CBN and their new naria note wey dey put confusion and dey destabilize people financial life presently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "February 01, 2023, 02:30:59 PM",
      "body": "These na hard time for almost every person wey dey stay Naija and nor get level or money. Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM1. No Light.Light dey my side, we dey get light well well at least dey take dey hold body.Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM2. No Water. As e be say we dey get light, clean water dey run well.Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM3. No Money.Luckily for me, e get POS person wey be my padi, I know say withdrawal rate dun triple as dem dey hoard the money to increase the value and people nor still too mind, but them nor dey see the money to withdraw for some places, my POS person just dey deliver me with cash and the rate wey I dey pay na still regular rate I dey pay since.Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM4. No Fuel. I know scarcity dey some kind side and people nor dey see the fuel to buy, but for my side, e get one fueling station wey dey inside street, dem dey always get fuel since, na just say the fuel dem dey sell am at N350 as at the last time I been buy. I know say the situation nor dey the same for everybody and some people dey see shege Banza for their side unto all this matter. Make we carry all this annoyance especially the fuel scarcity own wey dun be problem since Buhari enter take go vote.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "February 01, 2023, 04:27:23 PM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PMHow things be for your area? let us know make we know which side we go dey relocate dey go abeg ...  As una dey discuss make una still dey take una privacy very seriously, no go dey disclose without sense your exact location make person wey get you for mind no go track you down, do you something wey no good or arrange people for you. I know say we be our brothers keepers for here but no go dey over trust anybody, we no know ourselves and other sides of each other. Always make your privacy a priority as things dey happen for street.For my side every good, I no go say for my area since I no know wetin dey happen around as my na indoors o dey dey 24/7. NEPA no dey try but dem dey give us light for night on a steady and with that light I dey fit charge all the necessary things and if I need light for afternoon I dey on generator. The fuel scares but nobi say e no dey to buy.Water dey dey my compound 24/7, this na one reason I like my area and e go hard me to move. I no even get drum for house to hold water as e dey rush steadily. As e finish our gateman dun run am sharply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martyns",
      "created_time": "February 02, 2023, 02:36:17 PM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PMThis Na Area Yearn - I want us to use this thread to dey update ourselves wetin dey happen For our Area, Most especially, now wey election don dey close..MY AREA-As e be now eeh, mata don pass sit down dey wait, For (edited)  here wey be my ogbe, kasala full ground, i go go through this kasala one after the other.1. No Light.For Almost One month now, we never see light we stable more than five minutes before they take am, and they no dey bring am pass two or three times in a day, the matter now don make water scarce for here, those wey get water and no generator no fit pump water, those wey get water and generator no see fuel buy, so that they go fit pump water, they ones wey manage pump water no gree sale, the ones wey dey manage sale don hike the price of 1 gallon(25 liter) from #10 wey we dey buy am before to #50 now, some dey even sale #70,#100 for 25 liter of water.2. No Water. I don explain as e take be for my area concerning water, together with light matter above, make this post no too long, i no go go further on this one again.3. No Money.CBN announce say deadline for old currency na 31st of January, and as e be right now for my area here, my people for here no dey gree collect the old note again ooh, and the worst part be say we no see the new note collect from bank, ATMs wey dey this ogbe na old currency all of them dey pay, and the banks no send, if you enter their domain do any how, police go knack you kpako for head, bundle you troway for outside, this na if they no arrest you.Doing business now is really difficult for our older forks wey no sabi wetin be \"i want to do transfer\", yahoo boys dey even use this opportunity to chop many people as most of them don start to dey send fake alert.People wey dey sell no won collect old note, those wey won buy no see new note to take pay for wetin dey won buy -- wetin man pikin go do like this???.4. No Fuel. If to say as light no dey, fuel dey, maybe people for not too complain, but as it is now, a liter of fuel here na #500 and black market dey sell #700, but even as e cost so, To see am buy na still a big wahala.No light, and no fuel, businesses dey suffer as they no see fuel to run their business, barbers, dry cleaners, tailors, bet9ja shops, saloon, gym houses, phone and computer repair shops -this na just to name a few, what about okada people, tricyclist them, public/commercial transporters.. Water a scarcity biting really hard in my area now due to no light and no fuel , things are getting out of hand over here..How things be for your area? let us know make we know which side we go dey relocate dey go abeg ...  My area cast,water no dey alright,fuel no dey,light no dey,and the worst one don join wey be money,,Money no dey again.Sometimes I dey sit-down reason weda other countries dey like the way Naija dey or e dey different because wetin we dey see for Naija no be small tin oh.My area really worst,everything just dey irritate person,we no fit witdraw money again,money no dey the banks wey dey my area,and the one wey wan make the whole Matta worst be say,gas don finish for filling station ,now na hunger go kill us as e be like this.Bori my area don cast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "February 02, 2023, 07:22:10 PM",
      "body": "Quote from: CryptopreneurBrainboss on February 01, 2023, 04:27:23 PMQuote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PMHow things be for your area? let us know make we know which side we go dey relocate dey go abeg ...  As una dey discuss make una still dey take una privacy very seriously, no go dey disclose without sense your exact location make person wey get you for mind no go track you down, do you something wey no good or arrange people for you. I know say we be our brothers keepers for here but no go dey over trust anybody, we no know ourselves and other sides of each other. Always make your privacy a priority as things dey happen for street.Thank you very much for this idea wey you share with me, i really appreciate am, na just say me na a very free person, i no dey find person trouble both online and offline, so i think of how possible e go dey make person from online begin trace me for bad intention and not for good, but anyways, i understand perfectly wetin you mean, like we know say the heart of man is desperately wicked, person fit wake up one morning, think of one thing say you do am, then begin find you, so i understand, and i really appreciate the advice. QuoteFor my side every good, I no go say for my area since I no know wetin dey happen around as my na indoors o dey dey 24/7. NEPA no dey try but dem dey give us light for night on a steady and with that light I dey fit charge all the necessary things and if I need light for afternoon I dey on generator. The fuel scares but nobi say e no dey to buy.Water dey dey my compound 24/7, this na one reason I like my area and e go hard me to move. I no even get drum for house to hold water as e dey rush steadily. As e finish our gateman dun run am sharply. You na oga on top na, me never reach that level wey i go just dey relax for inside my room make gate man the run things for us, even the compound wey i dey stay now, na mouth my landlord take dey open borehole for us until he die last year on the 31st of december, now, no hope for water for the compound again except the son decide to run an for us.And that aside, me self dey plan to move into a better place soon sha, infact, i for don pay for another apartment wey everything complete, water, electricity, standby generator, but i just decide to wait make we finish with election first, because i no won go spend too much money now wey i never know wetin go be the outcome of the coming election.Quote from: martyns on February 02, 2023, 02:36:17 PMQuote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PM~snip~My area cast,water no dey alright,fuel no dey,light no dey,and the worst one don join wey be money,,Money no dey again.Sometimes I dey sit-down reason weda other countries dey like the way Naija dey or e dey different because wetin we dey see for Naija no be small tin oh.My area really worst,everything just dey irritate person,we no fit witdraw money again,money no dey the banks wey dey my area,and the one wey wan make the whole Matta worst be say,gas don finish for filling station ,now na hunger go kill us as e be like this.Bori my area don cast.My brother, the issue of money don start for my own area tey tey, imagine now 1000 naira we dey take withdraw 5000 naira from POS operators, 10,000 naira na 2000 naira fee, this na if you even see the POS wey gree say they get cash, matta don pass mathayas, e don pass sit don dey look, na God we dey beg now make He please intervene before man pikin go commit ooh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "February 02, 2023, 09:46:14 PM",
      "body": "Which one will I talk and leave the other. Omo as em d for my side, level no gbam at all. Na different katata wey peso d see for the area wey em d live so. 1. Light: If you come for light, Nepa d use us the play, them dey bring light anytime wey d feel like. If the manage bring am, nah low current you go see so. Wey go result you to make use of your generator to pump water and freeze your cooked foods 2. Money: I no wan reason money mata cos I d vex. How peso go get money for bank, me no go fit withdraw am for ATM, if manage wan do POS, POS go charge you like wetin I know. Check out 2k na 400naira, 5k na 1k, 10k na 2k. The charge na for both the old and new naira notes. You know for this our country, we be our own problem. People d like use any bad thing wey happen for the country as an advantage to cash out and suffer other people. We dey pray for a better Nigeria but the mind of people wey d inside am no d smile when things get soar for money matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "February 02, 2023, 10:30:03 PM",
      "body": "1. Light: I nor dey use eye see this one both for house and store. Na 24/7 we dey patronize Atiku, fuel sef still scarce here no be small embarrassment fuel station dey give their customers here for person money again. Them lock us outside for almost 1 hour, even mount mopol for the entrance, na so aboki dey flog customers way won try enter to buy fuel. I just vex go house. 2. Money: The scarcity of new and old notes don too much. POS just dey take advantage of person, the painful part na say bank atm go dey 100 naira note with 5k limit, the one I go today na 3k be the limit. The thing don too much for my area so tay market women come block bank this morning say bankers nor go enter inside o na so manager call DPO, still the women stand attention dey protest. Na beg police come dey beg, them promise us say tomorrow money go dey the bank for us to withdraw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "February 02, 2023, 11:01:08 PM",
      "body": "Quote from: SatoPrincess on February 02, 2023, 10:30:03 PM1. Light: I nor dey use eye see this one both for house and store. Na 24/7 we dey patronize Atiku, fuel sef still scarce here no be small embarrassment fuel station dey give their customers here for person money again. Them lock us outside for almost 1 hour, even mount mopol for the entrance, na so aboki dey flog customers way won try enter to buy fuel. I just vex go house. 2. Money: The scarcity of new and old notes don too much. POS just dey take advantage of person, the painful part na say bank atm go dey 100 naira note with 5k limit, the one I go today na 3k be the limit. The thing don too much for my area so tay market women come block bank this morning say bankers nor go enter inside o na so manager call DPO, still the women stand attention dey protest. Na beg police come dey beg, them promise us to say tomorrow money go dey the bank for us to withdraw. This whole thing is beginning to turn into a big mess, the only challenge I am facing from this new policy na poor network because today alone I don make 3 transactions where the receiver no get the money and it has been debited from my account even as I show the man the receipt of the transaction him no free release the goods for me, na so I waka go my house jeje because I no fit fight, I tell the man when he sees the money make him call me. *on the issue of light, I must say we dey flex light well for this side, and since about 3 days now I no sure say the light did go off. *And fuel don dey now, I was able to fill my tank today and no cue at all a just drive in buy and go unlike last we where one needs to spend up to 4 hours on fuel cueing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "February 03, 2023, 05:38:50 AM",
      "body": "My area bad well, no money 4 bank,no money 4 POS and Even though you succeed to get money from POS is 50 50, for u to no say na my area bad pass for dis country. If want I saw yesterday continue next week, I guess some terrible will occur in some part of this country because, men are not smiling again. If our leaders no what is good for them , dey should take a good steps to make dis money in circulation today or tomorrow because people are suffering badly in the land.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "February 05, 2023, 10:22:39 AM",
      "body": "My area eh NEPA na hot cake oo, we no dey see light oo, but wetin dey annoy us be say when month go end, NEPA officials go still come to collect money oo, and if you no pay Dem go disconnect your light,if you no try to drag with them, police go arrest you,the NEPA matter dey bring issues regularly..As for water, water no really be problem for my area oo, because almost every compound get bole hole now, so water full everywhere..Money matter na the most annoying of them all, you go get money for bank but you no go fit access your money, all just because CBN dey try change currency, so we must suffer, go bank go see queue wey full, you go see as people dey suffer to collect their own money, now POS people come use the matter as a channel to use enrich themselves, the charges too high, POS charge even big pass church tithe, to collect ,5k you go pay 1k, automatically now we dey use money dey buy money, make God help us oo..Fuel matter now na another problem, not just my area but to the entire country, government no dey gree tackle subsidy and e dey really affect us, the current price of fuel now is 500 naira per litre,and once the price of fuel increase e dey affect all commodities, go market go hear the way things dey cost, and e dey really Pain me say e no dey affect this government officials, now only we wey be citizens nai e dey affect....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Philpsticks",
      "created_time": "April 15, 2023, 05:50:16 PM",
      "body": "Quote from: Fivestar4everMVP on January 28, 2023, 02:23:32 PMThis Na Area Yearn - I want us to use this thread to dey update ourselves wetin dey happen For our Area, Most especially, now wey election don dey close..MY AREA-As e be now eeh, mata don pass sit down dey wait, For (edited)  here wey be my ogbe, kasala full ground, i go go through this kasala one after the other.1. No Light.For Almost One month now, we never see light we stable more than five minutes before they take am, and they no dey bring am pass two or three times in a day, the matter now don make water scarce for here, those wey get water and no generator no fit pump water, those wey get water and generator no see fuel buy, so that they go fit pump water, they ones wey manage pump water no gree sale, the ones wey dey manage sale don hike the price of 1 gallon(25 liter) from #10 wey we dey buy am before to #50 now, some dey even sale #70,#100 for 25 liter of water.2. No Water. I don explain as e take be for my area concerning water, together with light matter above, make this post no too long, i no go go further on this one again.3. No Money.CBN announce say deadline for old currency na 31st of January, and as e be right now for my area here, my people for here no dey gree collect the old note again ooh, and the worst part be say we no see the new note collect from bank, ATMs wey dey this ogbe na old currency all of them dey pay, and the banks no send, if you enter their domain do any how, police go knack you kpako for head, bundle you troway for outside, this na if they no arrest you.Doing business now is really difficult for our older forks wey no sabi wetin be \"i want to do transfer\", yahoo boys dey even use this opportunity to chop many people as most of them don start to dey send fake alert.People wey dey sell no won collect old note, those wey won buy no see new note to take pay for wetin dey won buy -- wetin man pikin go do like this???.4. No Fuel. If to say as light no dey, fuel dey, maybe people for not too complain, but as it is now, a liter of fuel here na #500 and black market dey sell #700, but even as e cost so, To see am buy na still a big wahala.No light, and no fuel, businesses dey suffer as they no see fuel to run their business, barbers, dry cleaners, tailors, bet9ja shops, saloon, gym houses, phone and computer repair shops -this na just to name a few, what about okada people, tricyclist them, public/commercial transporters.. Water a scarcity biting really hard in my area now due to no light and no fuel , things are getting out of hand over here..How things be for your area? let us know make we know which side we go dey relocate dey go abeg ...  This light issue pain me pass anything because na we they supplie Abroad with light in-fact Niger state na power state but we lack light very well for here we can’t have light for 12hrs the mats tired me slf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}