{
  "id": "topic_5456056",
  "title": "Mahdirakib",
  "author": "Mahdirakib",
  "created_time": "June 11, 2023, 02:24:02 PM",
  "content": "Most of the active members of Meta and Reputation board are aware of the drama of 'naim027' and his alt accounts. You can check it here if you don't know about it.Ban Appeal For naim027. (SOLVED)Hello World || Welcome back again!In brief, Naim027 was banned for plagiarism on 18th or 19th May 2022. His account was unbanned on the 12th October 2022. Then he was caught with his alt accounts within a day, and received negative feedback from some forum members.Coincidence: 'John Abraham' was inactive in the forum since 2nd January of 2021. He woke up on the 26th June 2022 (while naim027 account was banned), then started making post from 18th October after changing account password. In the meantime, 'naim027' was receiving negative feedback and disappeared from the forum slowly.Connection: John Abraham had participated in 'Yo!Mix' signature campaign for the first time as a full member. He sent his first 3 weeks payment to \"naim027\" address on 28th January (transaction link). He made another transaction to 'naim027' on 17th February (transaction link).Quote from: John Abraham on January 11, 2023, 07:53:41 AMbech32 address: bc1q3652jcryqgy0l38unay7tx69h56a865z6t8ndxQuote from: naim027 on April 28, 2022, 10:10:03 PMBTC SegWit Address: bc1q9t788wr0adc4v3t3k8yv02dapn8942qxagrsaaPossible Connection: John Abraham is a participant of whirlwind.money signature campaign now. whirlwind.money team and campaign manager have decided to pay the user on the site through note (and public address) from the 6th round. Surprisingly, 'naim027' started receiving BTC from whirlwind.money reserve address after each weekly payment since then (check his Bitcoin address). While the address of 'John Abraham' hasn't received any transaction after that.Quote from: whirlwindmoney on April 01, 2023, 12:54:06 AMThe reserve can always be verified here: https://blockchair.com/bitcoin/address/bc1qf8h5k6sash8007vpesymxkw2xsg5d0r3j4l5vmcrwpz2pqu66fjstzgd3rEventually, don't forget:Quote from: naim027 on April 10, 2023, 08:38:44 PMDCA is the best method to accumulate Bitcoin for holding.Quote from: John Abraham on May 11, 2023, 11:25:17 AMDCA is the best method ever to accumulate your BTC.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456056",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "June 11, 2023, 04:39:45 PM",
      "body": "In my opinion, it would be reasonable to assume naim027 is still around here with some of his multiple accounts which we do not know about. On the other hand, there is a reasonable possibilty those transactions are just the results of a out-of-forum dealings. Either way, I would not speculate further until I have seen more evidence and heard on the version of the accused. It is also worth of attention naim027 has shown to have writing patterns which have been used before to link his other former accounts, let us see what happens...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 11, 2023, 06:15:05 PM",
      "body": "I am pretty sure it is him, even if the evidence is not 100% conclusive because he can always claim to have made a transaction with someone else. But I'm not going to waste a lot of energy on this, seeing that he was not banned again from the forum and that he will have to have at least half a dozen negative feedbacks to be kicked out of the signature campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 11, 2023, 06:55:59 PM",
      "body": "I expected Naim027 to still have a bunch of accounts active in the forum, I could tell from his previous actions that  he would not let a ban stop him from creating new accounts. I don’t doubt the John Abraham account could be controlled by Naim027 but we will need more concrete evidence to tag the account. It’s a shame how Naim027 turned out, he was doing pretty well before he got caught.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 11, 2023, 07:08:23 PM",
      "body": "Quote from: Poker Player on June 11, 2023, 06:15:05 PMI am pretty sure it is him, even if the evidence is not 100% conclusive because he can always claim to have made a transaction with someone else. I am also pretty sure it is him.But then since he was unbanned @naim027, he is not guilty of ban evasion. I am not going to tag him either, but others could find a reason to transfer the sins of naim027 to other of  his alts.One thing I admire about naim027 is his ability to build up accounts very fast and attract as many as possible merits within a short time.  I was sincerely pained when he damaged one of his alts that grew very fast - @AnotherAlt.He has the super power to build accounts very fast because of his considerable good writing skills, and he is also talented at damaging the pretty good accounts within a short period of time.My fear and worry is not naim027 being able to earn with his alts, but him getting into DT will be worrisome. Both naim027 and Anotheralt were at the verge of getting into DT before he was bursted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 11, 2023, 07:13:49 PM",
      "body": "Quote from: KingsDen on June 11, 2023, 07:08:23 PMBut then since he was unbanned @naim027, he is not guilty of ban evasion. He is, he was ban evading with his alts AnotherAlt and Crypt0S0ul while he was banned while the rules only allowed him to create a thread to appeal his ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 11, 2023, 07:25:57 PM",
      "body": "Quote from: Poker Player on June 11, 2023, 07:13:49 PMQuote from: KingsDen on June 11, 2023, 07:08:23 PMBut then since he was unbanned @naim027, he is not guilty of ban evasion. He is, he was ban evading with his alts AnotherAlt and Crypt0S0ul while he was banned while the rules only allowed him to create a thread to appeal his ban. I don’t understand why his main account wasn’t banned even after there was enough proof to show that AnotherAlt and Crypt0S0ul were both controlled by him. Apparently the moderators do not agree, the case has been left unhandled for too long. And by that narrative, it could be said that the mods do not think Naim027 was/is evading ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 11, 2023, 07:43:13 PM",
      "body": "Quote from: SatoPrincess on June 11, 2023, 07:25:57 PMI don’t understand why his main account wasn’t banned even after there was enough proof to show that AnotherAlt and Crypt0S0ul were both controlled by him. Apparently the moderators do not agree, the case has been left unhandled for too long. And by that narrative, it could be said that the mods do not think Naim027 was/is evading ban. So, you mean the moderators don't agree with him confessing?https://bitcointalk.org/index.php?topic=5416864.msg61116237#msg61116237I see you both are very clueless on the subject.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "June 11, 2023, 08:26:57 PM",
      "body": "@Mahdirakib that's a good catch. I've detected that @John Abraham sent some bitcoin to @naim027's wallet in the last month, but I'm not sure about making a thread about this one. I believe it's the alt account @naim027 which has been inactive for the last few months, but I just wouldn't swear it was @naim027.I'll be waiting for @John Abraham to clarify on that - I see him very active on the reputation board and I hope he has some good reasons for us to hear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "June 11, 2023, 08:43:27 PM",
      "body": "Quote from: Out of mind on June 11, 2023, 03:55:10 PM But it could also be that @John Abraham sold the bitcoins he got to @naim027. This evidence is indeed not enough, but with this transaction, I think it opens up a greater chance that the two accounts are indeed controlled by the same person.especially after the @naim027 account was banned. he no longer derives a source of income from the signature campaign. and he's trying other accounts to participate in the signature campaign.proof of transaction can be rejected. but let's see how @John Abraham responds. I'm sure he won't miss this one and provide clarification on the transaction made.OP, you sent @John Abraham a pm to this thread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "June 11, 2023, 09:16:45 PM",
      "body": "I am in no doubt about naim027 having more alt-account and not only are some them active some are probably enrolled on to campaigns with a particular campaign manager  Naim027 was not doing that well, when he mentioned he did not need signature campaign income as he was already working multiple job I knew immediately he was a compulsive liar but even before that I wrote him off as such. Let us not forget one of his alt-accounts was even exposing other members who had alt-accounts enrolled on campaigns or participating in bounties.I would not be surprised if in the coming weeks and months more alt-accounts are connected in one way or another.Quote from: SatoPrincess on June 11, 2023, 06:55:59 PMI expected Naim027 to still have a bunch of accounts active in the forum, I could tell from his previous actions that  he would not let a ban stop him from creating new accounts. I don’t doubt the John Abraham account could be controlled by Naim027 but we will need more concrete evidence to tag the account. It’s a shame how Naim027 turned out, he was doing pretty well before he got caught.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 12, 2023, 02:39:37 AM",
      "body": "Quote from: JollyGood on June 11, 2023, 09:16:45 PMI am in no doubt about naim027 having more alt-account and not only are some them active some are probably enrolled on to campaigns with a particular campaign manager  I don't know why you're talking about a particular manager when John Abraham works on the same campaign as you do for the same manager, and I'm sure you're not thinking of him. naim027, as KingsDen said, he has a great ability to build up accounts fast and earn a lot of merits. If he didn't get to make the asshole he could have had all the alts he could handle working on campaigns legally. With that ability and no proof that he is a ban evader, that he plagiarized and that he sent himself merits on his alts, any manager will hire him. The proof is that he is in the highest paying campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "June 12, 2023, 04:04:53 AM",
      "body": "I feel dumb for having given this John Abraham account any merits now. Looking at the transactions, it absolutely appears to be an alt account. Even if it wasn't, I don't trust any account that has any kind of association to naim027. Never giving another merit to a low-ranking account for posts in the WO thread again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "June 12, 2023, 04:25:41 AM",
      "body": "Quote from: nutildah on June 12, 2023, 04:04:53 AMNever giving another merit to a low-ranking account for posts in the WO thread again.That seems to be his modus operandi, I've read that with other alts he had already gone to the WO thread at the beginning to get merits there. I checked AnotherAlt with bpip.org, https://bpip.org/smerit.aspx?to=AnotherAlt and I see that this is indeed the case. I think this adds more plausibility to the hypothesis that John Abraham is another alt of this guy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "June 12, 2023, 08:46:34 AM",
      "body": "Naim027 and I worked together for a long time, from 2020 to mid-2021, for a casino. I know him as Sil3ntS0ul. From our long working period together, we have had a good relationship with each other. The transactions you are seeing are nothing but selling my Bitcoin to him for USD. I never thought that would make me his alternative account, LOL.Quote from: _BlackStar on June 11, 2023, 08:26:57 PMI'll be waiting for @John Abraham to clarify on that - I see him very active on the reputation board and I hope he has some good reasons for us to hear.It's very interesting and made me think how easy to misunderstand a user on bitcointalk.Quote from: Mahdirakib on June 11, 2023, 02:24:02 PMEventually, don't forget:Quote from: naim027 on April 10, 2023, 08:38:44 PMDCA is the best method to accumulate Bitcoin for holding.Quote from: John Abraham on May 11, 2023, 11:25:17 AMDCA is the best method ever to accumulate your BTC.If you wrote about DCA a few times then I think you will also find a similar style of telling others about the same suggestion/advice. I don't think this should be a reference to find alternative accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "June 12, 2023, 09:40:57 AM",
      "body": "Quote from: John Abraham on June 12, 2023, 08:46:34 AMThe transactions you are seeing are nothing but selling my Bitcoin to him for USD. I never thought that would make me his alternative account, LOL.You have nothing else to say except this. Do you live in the same country of 'naim027'? How 'naim027' sent you the USD? Can you show the proof of your conversation regarding those transactions? Why are you sending BTC to 'naim027' address from the whirlwind.money mixer after the 6th round payment?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "June 12, 2023, 09:41:33 AMLast edit: June 12, 2023, 12:05:52 PM by JollyGood",
      "body": "Quote from: John Abraham on June 12, 2023, 08:46:34 AMNaim027 and I worked together for a long time, from 2020 to mid-2021, for a casino. I know him as Sil3ntS0ul. From our long working period together, we have had a good relationship with each other. What evidence will you submit to back up this claim?Were you working online only and never met in person?Were you working in a physical casino establishment somewhere in Bangladesh as physical colleagues?Quote from: John Abraham on June 12, 2023, 08:46:34 AMThe transactions you are seeing are nothing but selling my Bitcoin to him for USD. I never thought that would make me his alternative account, LOL.Quite clearly yes you never thought you would have the two addresses linked otherwise you would have avoided the whole drama and tried to stay under the radar without having another account exposed.I will tag your account because if your story is true you deserve a neutral tag but if as suspected another naim027 has just been exposed you deserve another red tag. Having said that I will allow you the opportunity to reply to this post and will take your reply in to consideration beforehand. I am looking forward to reading what you have to say.In your reply do not forget to explain exactly your response to the following:1- Why the first 3 weeks full payment from your YoMix signature campaign plus an extra payment 6 days later went to a known naim027 Bitcoin address.2- Why is a known naim027 Bitcoin address receiving funds every week from Whirlwind (via Notes) after your John Abraham account starting receiving Note payments for the Whirlwind signature campaign yet your own registered John Abraham known Bitcoin address stopped receiving funds from Whirlwind even though you are enrolled on their signature campaign?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 12, 2023, 09:58:20 AM",
      "body": "If John Abraham turns out to be really Naim027, then we are in for an exciting show. This guy is dodgy as a snake. I also noticed some of John Abraham's abrupt appearances in the meta and the way he communicates, but I thought I was getting shamelessly suspicious.Mahdirakib, I've seen your previous posts related to Naim027's exposure. I respect that you keep catching him; maybe you have better reasons for spying on him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "June 12, 2023, 01:19:35 PM",
      "body": "The proofs provided by @Mahdirakib are enough for the named member to get banned from the forum again. If not then again this member would come out with an alt account. My understanding is that a banned member is not supposed to open up a new account.Quote from: John Abraham on June 12, 2023, 08:46:34 AMNaim027 and I worked together for a long time, from 2020 to mid-2021, for a casino. I know him as Sil3ntS0ul. From our long working period together, we have had a good relationship with each other. The transactions you are seeing are nothing but selling my Bitcoin to him for USD. I never thought that would make me his alternative account, LOL.Prove it! None of us here would be satisfied with your shitty replies. Prove that you knew the banned account member and then prove those USDT were transferred back to your wallet according to those dates. Do not come up with fake images as you will be again caught.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saheedu",
      "created_time": "June 12, 2023, 01:29:48 PM",
      "body": "I never wanted to get involved in this issue, but after reading the previous thread in which he (naim07) was exposed, I realized that we are dealing with an expert when it comes to lying and deceiving others, and I am confident that the same thing will happen in this thread.He's already made the BUY/SOLD logic, expecting that if no one else comes up with more evidence, the thread and accusation will be buried and forgotten.I'm not very adept at data analysis, but I discovered some questionable posts of his.Quote from: John Abraham on June 12, 2023, 08:46:34 AMNaim027 and I worked together for a long time, from 2020 to mid-2021, for a casino. I know him as Sil3ntS0ul. From our long working period together, we have had a good relationship with each other. I recall one of your posts that I came across while reading through your post history to check if there was any connection between both accounts.Quote from: John Abraham on January 26, 2023, 01:16:38 PMI know Zero. xD. I know many people here who use weird names as their usernames. I never asked them their real name because I love respecting their privacy. I did not build a good relation with anyone yet. So, It's weird to ask someone's real name when I didn't even talk with him. I won't say whether my username is my real name or not. I believe everyone loves to be anonymous on the internet forum. How then do you prove that you truly Naim027 or should I say your alt account? does not belong to you.QuoteThe transactions you are seeing are nothing but selling my Bitcoin to him for USD. I never thought that would make me his alternative account, LOL.Wait, are you saying that your alt Naim027 paid for a coin that you didn't receive? since, according to the information on blockchair, you received your third payment on Jan 28, 2023, 12:51 PM I understand it took some time to get confirmed, and you then proceeded to sell (according to you) at  Jan 28, 2023, 3:10 PM. Before you received your weekly paymetn you sold it out,right? What are your comments on this? And where did you two meet to discuss the buying and selling nonsense you devised?I saw this and guess what I found?Quote from: Ratimov on October 13, 2022, 02:15:16 AMCrypt0S0ulQuote from: Crypt0S0ul on October 11, 2022, 11:35:10 PMHehehe. Savage BunnyQuote from: Crypt0S0ul on September 24, 2022, 05:11:38 AMSavage Gachapin!Quote from: Crypt0S0ul on September 23, 2022, 04:02:57 AMHehehe... Savage Gachapin.Quote from: Crypt0S0ul on August 23, 2022, 04:40:34 PMHe he he. Savage Poker Player!Quote from: Crypt0S0ul on August 18, 2022, 10:47:24 AMHehe, Savage yahoo!naim027Quote from: naim027 on May 01, 2022, 03:33:00 PMHahaha, That's Savage.Quote from: naim027 on March 06, 2022, 01:31:17 PMHehehe. Savage.Quote from: naim027 on November 27, 2021, 09:08:21 PMSavage CoinmarketCapQuote from: John Abraham on April 01, 2023, 02:27:13 AMWhy are you guys so savage? Quote from: John Abraham on February 27, 2023, 04:04:44 AMWhy so savage?Do these sound familiar to you?If you take a look at the time Naim027 addresses receives the coins from whirlwind reserve address it's only few hours from the time Hhampuz, the campaign manager makes his payment announcement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}