{
  "id": "topic_5462408",
  "title": "Kelward",
  "author": "Kelward",
  "created_time": "August 07, 2023, 08:09:44 PM",
  "content": "I believe that most business owners will prefer to transact money transfers with their customers directly without using an exchange, that will be a third party, and you'll have to pay this third party or middle man money for his services, whether you like it or not. I also believe that nothing beats transacting money directly with your clients or customers, no third party whatsoever. One of the reasons why I like bitcoin is that it's decentralized, and you can do a P2P transaction with another bitcoin holder without any exchange being involved. But for convenience, transparency and scams that are associated with P2P, you don't have much choice but to patronize the services of these exchanges.You can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462408",
  "comments": [
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "August 07, 2023, 08:49:35 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMI believe that most business owners will prefer to transact money transfers with their customers directly without using an exchange, that will be a third party, and you'll have to pay this third party or middle man money for his services, whether you like it or not.In cryptocurrency, we have many ways to safely resist ay third party influence in what we do as long as we have the knowledge on how to go about it, bitcoin is not what we can just assume to be thesame as the way we treat other cryptocurrencies which are centralized, using bitcoin privately begin with the kind of wallet we use, many people will create a crypto account and take that as wallet from the exchanges they use, while some will rely on other people in helping them through what they would have learnt to know by themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "August 07, 2023, 09:19:21 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMI believe that most business owners will prefer to transact money transfers with their customers directly without using an exchange, that will be a third party, and you'll have to pay this third party or middle man money for his services, whether you like it or not. I also believe that nothing beats transacting money directly with your clients or customers, no third party whatsoever. One of the reasons why I like bitcoin is that it's decentralized, and you can do a P2P transaction with another bitcoin holder without any exchange being involved. But for convenience, transparency and scams that are associated with P2P, you don't have much choice but to patronize the services of these exchanges.You can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. Its a matter of choice on which one you would really be making use of on which its true that due to some features on which these platforms been offering then we cant really be able to resist on using them and example of this one is on having that kind of function that you could be able to file up some dispute if ever the other party didnt able to process out the money which you had already done your part but the other sidedidnt take such act or simply scam you. Also, these third party isnt really that charging any fees or reduction when it comes to p2p transactions unless if you do make out some trades inside the platform then expect that there would be fees butbasing up on real experience which p2p would remain p2p and having no deductions. Whether we do like it or not to say on which using up these platforms do really give out that kind of convenience and assurance on who would really be gonna dealing up. You could always check about other persons reputation if you are tending on selling or buying your coin on which you could be able to seeif its reputable or something new which you should be careful. You could really be able to distinguish in between.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 07, 2023, 11:20:21 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. No, I really don't think they have come to stay because this is still early days for Bitcoin and cryptocurrency technology. By the time Bitcoin has really dominated across a whole lot of countries in the world, and if by then a great deal of people in the world are using Bitcoin, then you can even easily sell or buy Bitcoin on the street. You know that fiat currencies have really been in existence for quite a long time now compared to Bitcoin that is just 14 years, so by the time Bitcoin has been around for a very long time too and has been adopted by many people, it will be easy, and most of the exchanges you are talking about will even go out of business because people will not really be dependent on them unless for just future trading and other sorts of trading features. Even by then, there might also have been a real P2P DEX where there would be great liquidity and every transaction would go smoothly.Now, you can easily meet someone and ask the person, \"Please, do you have some cash at hand? Let me just do a bank transfer to you and get the cash.\" So, if by the time Bitcoin dominance also becomes fully known and utilized, it will really be like you can just ask your friend to give you some fiat while you just send them Bitcoin as payment. It's just an opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slapper",
      "created_time": "August 08, 2023, 06:01:15 AM",
      "body": "Bitcoin and other decentralized cryptocurrencies help us to engage in direct transactions without the need for an intermediary, but large exchanges exist and profit by acting as this unavoidable middleman. Why then is it thus?Using exchanges adds a layer of convenience, and there are hazards with P2P, but wasn't Bitcoin designed to eliminate the middleman? You assert that you cannot eliminate the middleman, but isn't that the purpose of cryptography? However, major players such as Binance are already profiting. I prefer straightforward transactions, but the exchanges are aggressive, as if they own the place.However, why not be straightforward? Why not use money in the typical way? However, there are costs involved. Isn't everything circular and pointless?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "August 08, 2023, 07:55:53 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMI believe that most business owners will prefer to transact money transfers with their customers directly without using an exchange, that will be a third party, and you'll have to pay this third party or middle man money for his services, whether you like it or not. I also believe that nothing beats transacting money directly with your clients or customers, no third party whatsoever. One of the reasons why I like bitcoin is that it's decentralized, and you can do a P2P transaction with another bitcoin holder without any exchange being involved. But for convenience, transparency and scams that are associated with P2P, you don't have much choice but to patronize the services of these exchanges.You can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. The difference is that now you have a choice, with the fiat system this is not the case with the exception of cash, which also allows peer to peer payments, but with the huge problem that now you can only buy the products you want from a place close to you, bitcoin allows you to have the same advantages of cash but all over the world, now if you do not feel safe using bitcoin in this manner you can use exchanges or other third parties if you want, but make no mistake, this was your choice and no one else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "August 08, 2023, 08:29:14 PM",
      "body": "I feel like this isn't as bad as people make it out to be. First of all I could definitely do p2p if I want to, secondly the most important part is that you do not need exchanges when you are transacting with each other as well. Lets say that you are selling some apples, I pay you bitcoin and you give me apples and we go our separate ways, there was nobody in the middle. But if we are using fiat, in that case if we are doing credit card then there is tax and also banks that get a share, if we are using cash, we can still pay taxes, so in the end there is always a risk of someone else being in the middle, any credit card payment (which is almost all payments) go through banks, we rarely do not use banks, but with crypto we can at least not use middleman during transactions between each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "August 08, 2023, 11:31:13 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. I don't know where you get the idea of middle men or in this case, exchanges not being eliminated but all that is possible. There are just few reasons that might have made this difficult at the time and two of those are;1. The time frame it takes for transactions to be sent and confirmed on the blockchain,2. The issuebof trust between merchant and customers.These are some basic factors that contributes to the delay in the system being any perfect or close to perfection.Still, most of these works with bitcoin as altcoins haven't got much adoption as bitcoin and it's chain isn't as congested hence, the confirmation on them is easy buy still not a best choice. Your always better with bitcoin and should you he able to find a merchant to do a direct p2p way, your good otherwise,  the services of escrow is what you've got to ensure some trust and credibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 09, 2023, 01:14:01 AM",
      "body": "Well, trust is difficult to earn. And it's often advised not to give it to anybody. We don't easily trust. But does an exchange offer a solution to this? From a certain viewpoint, it actually is making it more problematic. It adds another layer of trust. Not only are we required to trust the person we're trading with, we're now also required to trust the exchange itself. So far, it is proven with sufficient evidence that exchanges cannot be trusted however huge they are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "August 09, 2023, 01:25:10 AM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. You can use smart contract escrow as middle man so that you will not rely on a centralized service to intermediate on your transactions. As you mention, trust is the issue why a real P2P will not gonna work especially on a person that you didn’t know. P2P is only possible if you will send Bitcoin to a person that you knew personally.In terms of fee, Exchange is not bad at all. Assuming without the risk of them running away, I think their fee decent for a platform that let you transact with other user funds without the risk of being scam. Crypto exchange is much more better than the traditional broker that has a cut-off time and huge fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "August 09, 2023, 03:52:40 AM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. That is true, but we actually have the option not to go through them, unlike the fiat currency that It really should go through them when you transfer a money from a far away place or overseas (plus a conversion fee which most likely gonna cost you per hundred dollar?). What we are paying with an exchange like Binance is the convenience and safety, while we pay the middle man when we transact fiat currency to deliver them to the other person. That's really a huge difference, especially when you're transacting with a family member using bitcoin, it absolutely does not need to go through an exchange, you can directly send it p2p using your non custodial wallet or hard wallets. Unlike fiat, there's no other way to transfer them without going through a remittance center or a bank.Therefor, in crypto you have the choice to avoid the middle man, while in fiat, there's no way you can avoid them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "August 09, 2023, 06:38:36 AM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. Exactly  mate I agree absolutely  with you and no matter how we paint it, the middle men which are the exchanges are in one way or the other inevitable and I've always seen several threads preaching against exchanges and after closer observations, I noticed that what they reay preach against is storing on those exchanges and not trading on them.Over the years, exchanges have made transacting with bitcoin and cryptocurrencies in general much more easier and even more secure through their escrow services and at the end, crypto is traded for fiat in cases where bitcoin  isn't accepted and one of the safest way to do this is through P2P on exchanges.Quote from: Aanuoluwatofunmi on August 07, 2023, 08:49:35 PMIn cryptocurrency, we have many ways to safely resist ay third party influence in what we do as long as we have the knowledge on how to go about it, bitcoin is not what we can just assume to be thesame as the way we treat other cryptocurrencies which are centralized, using bitcoin privately begin with the kind of wallet we use, many people will create a crypto account and take that as wallet from the exchanges they use, while some will rely on other people in helping them through what they would have learnt to know by themselves.Well whatever the case be, I think the exchanges are inevitable except in cases where the transaction  is to be made directly in cryptocurrency or bitcoin  as the preference maybe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 09, 2023, 06:56:12 AM",
      "body": "Quote from: Captain Corporate on August 08, 2023, 08:29:14 PMI feel like this isn't as bad as people make it out to be. First of all I could definitely do p2p if I want to, secondly the most important part is that you do not need exchanges when you are transacting with each other as well. Lets say that you are selling some apples, I pay you bitcoin and you give me apples and we go our separate ways, there was nobody in the middle. But if we are using fiat, in that case if we are doing credit card then there is tax and also banks that get a share, if we are using cash, we can still pay taxes, so in the end there is always a risk of someone else being in the middle, any credit card payment (which is almost all payments) go through banks, we rarely do not use banks, but with crypto we can at least not use middleman during transactions between each other.After selling all the apples, how will the seller buy another apple? The apple producer might not accept cryptocurrency for payments. So the apple seller will have to exchange the crypto for fiat in exchange to make payments. Some business owners will argue that using exchanges is convenient because it has high liquidity. Most of these businesses need to convert cryptocurrencies to fiat immediately to make purchases so exchanges will always be the best option. Middlemen can be reduced to a large extent if all parties in a transaction accept cryptocurrency. But we should also consider the risk associated with using them. My only advice is not to keep large sums in exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "August 09, 2023, 07:59:18 AM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMI believe that most business owners will prefer to transact money transfers with their customers directly without using an exchange, that will be a third party, and you'll have to pay this third party or middle man money for his services, whether you like it or not.There's a regulation where the business owners are forced to transfer the wages via bank, it's mean you don't have any choice regardless you like it or not. There's no charge if the business owner and the employee are using a same bank, usually the employee get asked to create a bank account that the business is use too.Actually, when you send your Bitcoin to other address you need to pay the fee to be included on the block, it's mean the reality is completely opposite with your imagination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "August 09, 2023, 11:40:45 AM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. Yes, you can eliminate the middleman because they are not really necessary unless you don't believe the other part completely. But cryptocurrencies also came up with the idea of how to eliminate those middlemen that are centralized with the idea of bringing smart contracts into the play.If you are not aware of what the smart contract is then it is a self-executing contract based on the terms you agreed to trade so when the conditions are met the trades will be executed which means no middlemen and your argument of middlemen is necessary whether it is centralized or decentralized.But, if we take this into consideration how it will work if we replace it with an entire traditional banking system cause it is yet to be explored while I am presenting you with the facts it is possible,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "August 09, 2023, 12:18:04 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMI believe that most business owners will prefer to transact money transfers with their customers directly without using an exchange, that will be a third party, and you'll have to pay this third party or middle man money for his services, whether you like it or not. Yup, this is true and that's why many business owners are cutting their ties with their third parties that process their payments which mostly are the banks or credit card companies. Because the fees that they charge to the customers and mostly to the business owners are outrageous.Quote from: Kelward on August 07, 2023, 08:09:44 PMI also believe that nothing beats transacting money directly with your clients or customers, no third party whatsoever. One of the reasons why I like bitcoin is that it's decentralized, and you can do a P2P transaction with another bitcoin holder without any exchange being involved. But for convenience, transparency and scams that are associated with P2P, you don't have much choice but to patronize the services of these exchanges.You can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. That's true because even if you remove those third parties and you want to accept bitcoin for payments. You'll still need to exchange that somewhere and it could be on exchanges, another third party company like Bitpay and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "August 09, 2023, 12:34:02 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. I score very low on my level of trust for people generally but in business or any type of financial transactions best believe I don't trust the other party even if the person were my sibling. This level of mistrust for others came about as a result of a bad experience. I like that big exchanges like Binance and Kucoin are involved as middleman in the peer to peer transactions that take place on their platforms. I have had so many issues with other traders and transactions resolved quickly which otherwise would not have if there were no middleman. In other non crypto businesses, some encourage middlemen because they are one of the fastest and best ways to market and sell your products or attract clients who require your services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 09, 2023, 12:42:50 PM",
      "body": "Quote from: Kelward on August 07, 2023, 08:09:44 PMBut for convenience, transparency and scams that are associated with P2P, you don't have much choice but to patronize the services of these exchanges.Well, by using a self-hosted payment processor businesses rather able to gain more complete transparency, not the contrary. In terms of scams, I don't know what you truly mean by that, but I'm pretty there is nothing to worry about by not using third-party payment processors.Quote from: Kelward on August 07, 2023, 08:09:44 PMYou can not eliminate the middle man in businesses, especially in this digital age, be it fiat or cryptocurrencies, because they have come to stay. Big exchanges like Binance, are cashing in on being the middle man in businesses, an unavoidable indirect business associates, in your face, waiting for you to go through them. I'm sure you are completely wrong since it does avoidable. If businesses want to accept the Bitcoin payment option, they can use BTCPay Server and any related self-hostable payment processor for other cryptocurrencies. It truly depends on the business choices, and certainly those centralized exchanges or third-party is not a gatekeeper for a business to forcingly require them to use their services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "August 09, 2023, 01:15:37 PM",
      "body": "I think you get it wrong, if a customer want to transfer bitcoin or any crypto to the service provider they don't need a middle-man they can directly transfer it from personal wallet to other personal wallet. The thing that needs an exchange is when the service provider need to cash out their exchange onto a fiat money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 09, 2023, 01:42:36 PM",
      "body": "I think that exchanges simply play a different role and thus are very likely to stay. A person can send BTC from one address to another, and there's zero need for an exchange in that situation. But if you're a trader, you need an exchange, and centralized exchanges might be convenient for that. If you want to buy or sell BTC for fiat, that also often requires an exchange, although it doesn't have to be a place like Binance where they store your money. I, for one, usually use local exchanges where you, for example, send BTC to a certain address from your wallet and get a transfer onto a bank account, so nobody is storing anyone else's funds in this situation.Also, if we're talking about active use of Bitcoin for payments, a custodial wallet can be more convenient if it's widely used because that allows 'instant payments' and very low fees.I think it should just be accepted that there are some use cases for intermediaries, and that they are not going to disappear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}