{
  "id": "topic_5458277",
  "title": "paxmao",
  "author": "paxmao",
  "created_time": "July 01, 2023, 11:33:31 PM",
  "content": "Not that long ago, early learning maths were about learning the tables, being quick at multiplying and understanding some basic problems. I feel that today that is not going to be enough and is not either the best use of the pupils time for teachers and schools. What do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458277",
  "comments": [
    {
      "author": "Gozie51",
      "created_time": "July 02, 2023, 10:12:37 PM",
      "body": "Natural intelligence is being replaced by Al. This is the situation of things with the way all is going. The pursuit for the creation of wealth has led to growth in technology and job loss. When you build hotel in space, how many humans do you expect to work there as hotel attendance? Of course you need bots to do most of the jobs   There is positive in negative, advantage and disadvantage, they all make the world a better place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 03, 2023, 09:36:08 AM",
      "body": "Quote from: paxmao on July 01, 2023, 11:33:31 PMNot that long ago, early learning maths were about learning the tables, being quick at multiplying and understanding some basic problems. I feel that today that is not going to be enough and is not either the best use of the pupils time for teachers and schools. What do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?I think that the way we teach today has completely changed in the sense that we learn much more complex topics than those presented here,we use online tools,online exams,we learn a lot about network,servers and all the related IT staff beside basic programming which needs a lot of logic applied that we get from math.I know that AI is becoming more and more popular but I highly doubt that to put at risk our jobs or to hinder our advance in technology when in fact it should be the complete opposite,AI should help us move further faster.Therefore we have not that much to improve in teaching,what we have to improve is to provide this education to a whole lot more people than we are providing it right now and that can make a change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "July 03, 2023, 11:22:56 AM",
      "body": "Quote from: paxmao on July 01, 2023, 11:33:31 PMNot that long ago, early learning maths were about learning the tables, being quick at multiplying and understanding some basic problems. I feel that today that is not going to be enough and is not either the best use of the pupils time for teachers and schools. What do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?Those days we went to school, we would have to go to school with books and pens to copy notes from the blackboard. We have to spend so much time learning multiplication tables and some mathematical formulas. Using the same strategy in this dispensation will be a total waste of time. Children now shouldn't even go to school with books and pencils because all they need is a tablet or laptop. Installing certain computer application and some AI tools in the computer will be all the child need to connect to the 21st century learning tool that will transfer the current learning experience needed to contribute to society. But the problem we have in my location is a lack of quality teachers. Most teachers are not exposed to technology which limits their ability to guide pupils. Poverty and lack of computer facilities are other major challenges. So many families cannot afford some of these technological tools making their children backward in the current educational environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "July 03, 2023, 02:24:55 PM",
      "body": "Quote from: paxmao on July 01, 2023, 11:33:31 PMWhat do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?There need to be a review in the educational sector of every country, teaching curriculum should change as well, there were some things that are still being taught in schools that were important before but not that relevant these days and should be replaced with more important information that is relevant to the future. People in school need to at an early age be introduced to machine learning and AI tech from the least sophisticated machines and AI knowledge and as they develop more and progress in school, more complex machine learning and AI tech will be taught.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 03, 2023, 05:12:10 PM",
      "body": "Quote from: Queentoshi on July 03, 2023, 02:24:55 PMPeople in school need to at an early age be introduced to machine learning and AI tech from the least sophisticated machines and AI knowledge and as they develop more and progress in school, more complex machine learning and AI tech will be taught. This is more of my earlier response. In the past it was a pride that a little boy or girl in a family has started going out in the morning to school but because of some failure in education system of some countries, that zeal for learning is falling. Most homes don't have that push to go to school because they expect employment to be the end result unfortunately that is not happening as Al techniques are taking over the job space. The class of parents that are committed to still see their children to school are those who are educated themselves because they know education is an asset. The government has to fund education more and restrategize on the curriculum where it will capture sound teaching techniques and practicals because practical is fast disappearing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "July 03, 2023, 07:23:01 PM",
      "body": "Quote from: Gozie51 on July 02, 2023, 10:12:37 PMNatural intelligence is being replaced by Al. This is the situation of things with the way all is going. The pursuit for the creation of wealth has led to growth in technology and job loss. I agree, I dont think that going forward humans can compete with the speed AI willbe able to solve complex problems.Quote from: paxmao on July 01, 2023, 11:33:31 PMNot that long ago, early learning maths were about learning the tables, being quick at multiplying and understanding some basic problems. I feel that today that is not going to be enough and is not either the best use of the pupils time for teachers and schools. What do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?and I'm not sure a different approach in teaching will bridge the gap needed tostay in touch with the pace that AI can learn.Learning tables has to be the foundation to every math problem. The only alternativecould only be starting kids of with their tables at age 1 or 2 instead of 4 but realisticallyhow much benefit could a child earn from starting 2 seasons sooner when the potentially reach the limit 2 seasons earlier.The human brain can only compute so much right?https://www.popularmechanics.com/science/math/a28943849/unsolvable-math-problem/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "July 03, 2023, 08:52:19 PM",
      "body": "Going to school with books seems boring to the students these days,because the students are use to technologies that they use at home and when the teacher is teaching,you will see a student sleeping in the classroom but if you use laptops and tablet to teach them,you will see how happy and eager that they are to learn. AI has brought laziness to pupils and students to learn and solve their simple arithmetic on their own. I think that the education system should be rebranded to make students pick interest in learning. We have seen how AI has stolen a lot of jobs from people this makes people see that we AI anything can be done easily and they no longer value education.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "July 03, 2023, 10:43:09 PM",
      "body": "Quote from: Queentoshi on July 03, 2023, 02:24:55 PMQuote from: paxmao on July 01, 2023, 11:33:31 PMWhat do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?There need to be a review in the educational sector of every country, teaching curriculum should change as well, there were some things that are still being taught in schools that were important before but not that relevant these days and should be replaced with more important information that is relevant to the future. People in school need to at an early age be introduced to machine learning and AI tech from the least sophisticated machines and AI knowledge and as they develop more and progress in school, more complex machine learning and AI tech will be taught. At what level of education should machine learning and AI be introduced? I believe the teaching curriculum should be improved and I feel it has been improved to an extent, the problem is some countries have refused to develop (no offense).Forcing little kids to learn complex AI text is not the way forward, besides not everybody has an interest in things like that. I don't believe the world has gotten to a stage where you can't live without advanced tech, it would definitely get there, but it's not there yet. So what should happen from my point is view is giving young kids kind of an introduction. Keep their minds open and let them choose when they get older.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 04, 2023, 04:51:11 AM",
      "body": "These old ways don't mean anything these days, now students don't bother with math as long as they have computers, calculators or mobile phones.Life is evolving and artificial intelligence is taking over little by little, so it is better to teach our children about artificial intelligence and how to control it before the day comes when robots control them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "July 04, 2023, 06:02:12 AM",
      "body": "Quote from: yhiaali3 on July 04, 2023, 04:51:11 AMThese old ways don't mean anything these days, now students don't bother with math as long as they have computers, calculators or mobile phones.Life is evolving and artificial intelligence is taking over little by little, so it is better to teach our children about artificial intelligence and how to control it before the day comes when robots control them.It is not as if teaching children mathematics is now a waste, they still need this knowledge. The machines we have today was done  by the application of mathematics knowledge,  people needs to have proper understanding in mathematics before thinking of making use of the machines.  Impacting young people with knowledge still matters alot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "July 04, 2023, 06:38:50 AM",
      "body": "Quote from: paxmao on July 01, 2023, 11:33:31 PMNot that long ago, early learning maths were about learning the tables, being quick at multiplying and understanding some basic problems. I feel that today that is not going to be enough and is not either the best use of the pupils time for teachers and schools. What do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?Progress in the development of artificial intelligence technologies requires adjustments in teaching methods, at least in the part that focuses on the fact that students will do their homework on their own (because this assumption is often false). However, the value of traditional classical education in itself does not decrease with the development of artificial intelligence, but rather increases. And in many ways, it is the care and responsibility of parents to ensure that their children make efforts to master the curriculum on their own, and do not resort to digital assistants for help. Because along with the problem of \"digital inequality\", which is often talked about a lot, there is also the problem of \"digital dementia\", which is less well-known, but no less acute and relevant. The bottom line is that by relying too much on digital assistants, children don't give their brains enough work and become dumber as a result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "July 04, 2023, 08:13:27 AM",
      "body": "Quote from: paxmao on July 01, 2023, 11:33:31 PMNot that long ago, early learning maths were about learning the tables, being quick at multiplying and understanding some basic problems. I feel that today that is not going to be enough and is not either the best use of the pupils time for teachers and schools. What do we humans have to change about teaching to face a future with much more powerful machines and sophisticated AI?This question should raise a serious concern. Humanity really need to change the way they teach and learn, not necessarily to contest with AI but for advancement. AI isn't a threat to humanity because AI is also a creation of humanity. Teaching should be divided into two;1. Learning of bits on 000 and 111 001101002. Learning of other things of lifeWith this, we could produce more people that knows about digits and will comfortably suit the evolving world of tech.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victan22",
      "created_time": "July 04, 2023, 09:39:22 AM",
      "body": "Nothing  can be in existence today if there's no past. The past itself is a ground of inspiration upon which aspirations were made to enhance what has been in existence before.   Many may see learning of before as a  waste of Time but I will take an exception to that because evolution of several means and patterns of learning today is as a result of what has existed before. If there was nothing in existence then obviously there will be nothing to improve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}