{
  "id": "topic_5464430",
  "title": "Altcoin-Discussion-",
  "author": "Altcoin-Discussion-",
  "created_time": "August 24, 2023, 02:05:47 PMLast edit: August 25, 2023, 08:01:45 AM by Altcoin-Discussion-",
  "content": "Investing in cryptocurrencies can be risky, especially in the volatile Market of Dogecoin. One investor, Glauber Contessoto, experienced a significant loss in his Dogecoin holdings, going from almost $3 million to $50,000. Despite this setback, Contessoto remains optimistic about the future of Dogecoin and believes it has staying power.The rise of 'Dogecoin in 2021 resulted in early investors becoming millionaires. DOGE’s market cap skyrocketed from $1.2 billion to $75.26 billion in less than five months, reaching an all-time high of $0.74. Glauber Contessoto was one of these overnight millionaires, with his holdings reaching $2.9 million.However, the value of Dogecoin has since declined, and it is currently Trading at $0.06378. This sizable drop in value has diminished Contessoto’s holdings to approximately $50,000. Despite this loss, Contessoto maintains his trust in Dogecoin and believes that dog-themed meme coins have a better chance of spiking in value compared to other meme coins. He points to the success of frog-themed crypto PEPE as an example.Contessoto is not the only investor who has experienced a significant decrease in the value of Dogecoin holdings. Keith Johnson, another investor, suffered losses and even filed a $258 billion lawsuit against Elon Musk, known as the “Dogefather” for his support of Dogecoin. Musk’s tweets about the cryptocurrency often result in price spikes.Source: https://btc.gripe/threads/dogecoin-millionaire-remains-optimistic-about-doge-despite-significant-losses.9127/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464430",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "August 24, 2023, 02:27:45 PM",
      "body": "Quote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMOne investor, Glauber Contessoto, experienced a significant loss in his Dogecoin holdings, going from almost $3 million to $50,000.This is a huge feat. Surely he is down a lot and probably thinking of filing suit. But then again, its his money and choice to buy dogecoin during the time it is worth $3m. Im not sure how this could be remedy, maybe in time if another bull season resurfaced. But thats not a guarantee even dogecoin has a potential. Market is volatile and we cant predict hows this gonna happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "August 24, 2023, 02:42:51 PM",
      "body": "You can never rule out for a popular coin to bounce above its last time high. Specially when it's a favourite meme coin for one of the most rich and innovative person in the world. With its constant appearance in media and buzz on the social media Dogecoin has been a widely know coin for general public on par with Ethereum. It would not require any large reason to spur a buying trend among the non crypto savy investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 24, 2023, 02:55:32 PM",
      "body": "Doge is a good coin, but I do not guarantee altcoin ATH, but it can happen. I will be guessing/gambling that doge may reach $1 in the next bull run. I am only guessing, do not take my word to be valid because it is under probability. The coin that I am certain about that would increased and reach ATH is still bitcoin.I will advice anyone that wants to invest in doge to be careful, they can invest but when it increased very significanly, they should know that bear market time would come and they should not think two times before they should sell it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "August 24, 2023, 03:14:05 PM",
      "body": "Quote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMHowever, the value of Dogecoin has since declined, and it is currently Trading at $0.06378. This sizable drop in value has diminished Contessoto’s holdings to approximately $50,000. Despite this loss, Contessoto maintains his trust in Dogecoin and believes that dog-themed meme coins have a better chance of spiking in value compared to other meme coins. He points to the success of frog-themed crypto PEPE as an example.He has no choice but to believe that there will be new round for his holding to reach for millions again. But I believe that he regret his decision by continue to hold it since if he sold it he would provably enjoy the money he earned from doge. But greed eats him and I guess he is now holding back waiting for another chance in life to earn millions.We can learn a lesson from his story and we should avoid his mistake made so that we will not lose a fortune on bad decision we possibly take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "August 24, 2023, 03:42:14 PM",
      "body": "Quote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMInvesting in cryptocurrencies can be risky, especially in the volatile Market of Dogecoin. One investor, Glauber Contessoto, experienced a significant loss in his Dogecoin holdings, going from almost $3 million to $50,000. Despite this setback, Contessoto remains optimistic about the future of Dogecoin and believes it has staying power.He is gambling again with Dogecoin into the next future because this is just relying on a boom that never knows when it will happen, one can believe in this dogecoin boom even some say if Elon Musk blindly makes influence again on his twitter then it will happen another boom on dogecoin but I rule it out.From $3 million to $50,000 with significant losses it is clear that it is better to survive than to sell it, my prediction is that dogecoin still has the potential to rise at least to the price of $0.5 but everyone knows that this is a memecoin that has no usecase so it only relies on the community or someone who can move its price, for example like Elon Musk who is fanatical about Doge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yudhisthir",
      "created_time": "August 24, 2023, 03:43:05 PM",
      "body": "Quote from: Taskford on August 24, 2023, 03:14:05 PMQuote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMHowever, the value of Dogecoin has since declined, and it is currently Trading at $0.06378. This sizable drop in value has diminished Contessoto’s holdings to approximately $50,000. Despite this loss, Contessoto maintains his trust in Dogecoin and believes that dog-themed meme coins have a better chance of spiking in value compared to other meme coins. He points to the success of frog-themed crypto PEPE as an example.He has no choice but to believe that there will be new round for his holding to reach for millions again. But I believe that he regret his decision by continue to hold it since if he sold it he would provably enjoy the money he earned from doge. But greed eats him and I guess he is now holding back waiting for another chance in life to earn millions.We can learn a lesson from his story and we should avoid his mistake made so that we will not lose a fortune on bad decision we possibly take.Yes selling is a part of investing. You should know when to buy, when to average and when to sell. If you missed the selling period you should hold or average. If you are much lower from the expected stop loss and if you believe in the coin you are holding, it's better to keep them as there are higher chances that it would break its own price record on a subsequent bull run. Dogecoin being a popular coin would be here for long and would probably go through multiple bulls in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "August 24, 2023, 04:15:34 PM",
      "body": "Quote from: cryptoaddictchie on August 24, 2023, 02:27:45 PMQuote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMOne investor, Glauber Contessoto, experienced a significant loss in his Dogecoin holdings, going from almost $3 million to $50,000.This is a huge feat. Surely he is down a lot and probably thinking of filing suit. But then again, its his money and choice to buy dogecoin during the time it is worth $3m. Im not sure how this could be remedy, maybe in time if another bull season resurfaced. But thats not a guarantee even dogecoin has a potential. Market is volatile and we cant predict hows this gonna happened. Who did he want to sue? I do laugh at this kind of people, just like those who filed court charges against Elon Musk, it's very ridiculous. As an adult, you are entitled to your decisions, let no one make you do what you do not want to do, and if you agree to it, then it's your burden. Investment is everywhere and both losses and winning are everywhere hanging around it, it's a risk we are all taking. If your risk has cost you loss, why blame others? Even financial advisers who have speculated wrongly to make individuals and companies suffer huge losses have not been sanctioned or sentenced talkless of someone who might not even know you exist? You think before you sink, our destinies are in our hands and no one should take the fall for our decision/agreement.As for Dogecoin, the guy still has hope, I am certain that Dogecoin will pump in the next 1.5 years and might surpass its ATH. It's time for him to buy more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 24, 2023, 04:31:14 PM",
      "body": "He was given council by Graham Stephan his fellow investors back when the value was still very high and his money was up to $3M but he was too hopeful that the bull run would continue. He is right about it though but it seems like this is his first bear market experience in crypto so he wasn't expecting a $3M could dive down to $50K. The bull run is coming though, all he just has to hope is that BTC halving could also make the doge price go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 24, 2023, 04:31:34 PM",
      "body": "Quote from: EarnOnVictor on August 24, 2023, 04:15:34 PMWho did he want to sue? I do laugh at this kind of people, just like those who filed court charges against Elon Musk, it's very ridiculous. As an adult, you are entitled to your decisions, let no one make you do what you do not want to do, and if you agree to it, then it's your burden. Yeah probably Elon  thats what other people do. This is an investment that no one forces them to go forth then if they got crash they are doing things like that. There is a disclaimer always that investment is not for positive gains only. You could also lose money in the process. The only way for him to recover and possibly gain is buy the dip now if he thinks there is a bright future for doge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "August 24, 2023, 05:25:54 PM",
      "body": "Why is this a newsworthy thing? I mean there has been a lot of people who lost money on Luna as well, should be interview all of them and ask them what they are thinking? I think it is obvious that we are not going to end up getting anything back again, doge is not going to be that big, and even if it does, other coins will get even bigger so while doge goes up in price, it will get lower in rank.So, we should not really be listening to some guy who got lucky once and wasn't smart enough to take profit. The difference between 3 million dollars and 50k dollars is about 3 million dollars, that's the level we are talking about. The difference provides point that this dude wasn't worthy enough to make a news about him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khiholangkang",
      "created_time": "August 24, 2023, 05:35:04 PM",
      "body": "Even though from Elon Musk's point of view it was wrong because he was promoting Doge, and often raising Doge on his social media which made Doge very attractive to investors, investors who bought them were still wrong because they were carried away by this scheme. so it's not worth it for him to blame other people, because he has that decision before making a purchase.And maybe we're just waiting for the bullrun to arrive, everything will return to their respective positions, and the loss won't be in vain if we keep holding on to it, or maybe it will also disappear into dust.Invest with money you are prepared to lose, especially in meme coins. LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 24, 2023, 08:40:34 PM",
      "body": "Quote from: _act_ on August 24, 2023, 02:55:32 PMDoge is a good coin, but I do not guarantee altcoin ATH, but it can happen. I will be guessing/gambling that doge may reach $1 in the next bull run. I am only guessing, do not take my word to be valid because it is under probability. The coin that I am certain about that would increased and reach ATH is still bitcoin.I will advice anyone that wants to invest in doge to be careful, they can invest but when it increased very significanly, they should know that bear market time would come and they should not think two times before they should sell it.Your guess may be right, because you are not alone in this, i have read alot of other cryptocurrency market speculators making same price prediction of $1 for dogecoin in the next bull run, even though there is no guarantee to that coming to pass but the posibilities of that coming to pass is high, because dogecoin happens to be one of the meme coins that have alot of active community armies that can help by acting i a similar manners that can trigger the value of the coin i the next bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "August 24, 2023, 08:57:47 PM",
      "body": "Quote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMInvesting in cryptocurrencies can be risky, especially in the volatile Market of Dogecoin. One investor, Glauber Contessoto, experienced a significant loss in his Dogecoin holdings, going from almost $3 million to $50,000. Despite this setback, Contessoto remains optimistic about the future of Dogecoin and believes it has staying power.This is the problem of early adopter with DOGE and just following the hype, many are trap and they can't do anything aside from being optimistic.Losing such kind of money is frustrating but there might still be the chance for them to recover their losses and we might see that in the next bull run. This is a reminder that you should always have your cut loss price to avoid being trap at the peak, imagine holding this for years and yet there's no progress at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "August 24, 2023, 09:08:35 PM",
      "body": "Quote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMInvesting in cryptocurrencies can be risky, especially in the volatile Market of Dogecoin. One investor, Glauber Contessoto, experienced a significant loss in his Dogecoin holdings, going from almost $3 million to $50,000. Despite this setback, Contessoto remains optimistic about the future of Dogecoin and believes it has staying power.The rise of Dogecoin in 2021 resulted in early investors becoming millionaires. DOGE’s market cap skyrocketed from $1.2 billion to $75.26 billion in less than five months, reaching an all-time high of $0.74. Glauber Contessoto was one of these overnight millionaires, with his holdings reaching $2.9 million.However, the value of Dogecoin has since declined, and it is currently Trading at $0.06378. This sizable drop in value has diminished Contessoto’s holdings to approximately $50,000. Despite this loss, Contessoto maintains his trust in Dogecoin and believes that dog-themed meme coins have a better chance of spiking in value compared to other meme coins. He points to the success of frog-themed crypto PEPE as an example.Contessoto is not the only investor who has experienced a significant decrease in the value of Dogecoin holdings. Keith Johnson, another investor, suffered losses and even filed a $258 billion lawsuit against Elon Musk, known as the “Dogefather” for his support of Dogecoin. Musk’s tweets about the cryptocurrency often result in price spikes.This guy doesn't know the first thing about trading crypto.  He landed on a lucky run and obviously didn't know how crypto goes, he landed right back where he started.  I wouldn't take anything he says seriously.  He promotes scam coin after scam coin and has probably lost people tons of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 24, 2023, 09:35:12 PM",
      "body": "Quote from: Altcoin-Discussion- on August 24, 2023, 02:05:47 PMInvesting in cryptocurrencies can be risky, especially in the volatile Market of Dogecoin. One investor, Glauber Contessoto, experienced a significant loss in his Dogecoin holdings, going from almost $3 million to $50,000. Despite this setback, Contessoto remains optimistic about the future of Dogecoin and believes it has staying power.The rise of Dogecoin in 2021 resulted in early investors becoming millionaires. DOGE’s market cap skyrocketed from $1.2 billion to $75.26 billion in less than five months, reaching an all-time high of $0.74. Glauber Contessoto was one of these overnight millionaires, with his holdings reaching $2.9 million.However, the value of Dogecoin has since declined, and it is currently Trading at $0.06378. This sizable drop in value has diminished Contessoto’s holdings to approximately $50,000. Despite this loss, Contessoto maintains his trust in Dogecoin and believes that dog-themed meme coins have a better chance of spiking in value compared to other meme coins. He points to the success of frog-themed crypto PEPE as an example.Contessoto is not the only investor who has experienced a significant decrease in the value of Dogecoin holdings. Keith Johnson, another investor, suffered losses and even filed a $258 billion lawsuit against Elon Musk, known as the “Dogefather” for his support of Dogecoin. Musk’s tweets about the cryptocurrency often result in price spikes.In the bullrun these investors were called smart people, even geniuses, but all it takes is a bear to see how smart they really are. Turns out, that if we are being honest, it was mostly luck like it often is, luck and persistence, greed and bad choices made because of denialism. Obviously he is optimistic, that's all he has. otherwise he would need to look at the mirror and call it as it is: denialism. But he and other people rather call it optimism, because people want to believe he will come up as a winner somehow. Because that means we all can come up with winners and we don't need to own our mistakes.But now he is only a random dude with 50k worth of doge. Soon it might be 2k of doge. So i totally understand the need for optimism.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "August 24, 2023, 09:55:21 PM",
      "body": "Perhaps, that was a spirit from a real investor who still have the faith and trust of his investment. Even though he is in terrible losses but still he is still optimistic and never loses hope. Of course, we could think why he was too optimistic with Doge knowing that was a meme coin. But we also have to know that while Elon Musk is still with Dogecoin, you can't just think that it never pump again because it was several times that he did it and many investors became rich. This person that OP had mentioned really has the trust that most of us don't have which is why we are negatively talking about Dogecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 24, 2023, 11:40:27 PM",
      "body": "Didn't he took any profits from that $3M value during the peak? I bet that he has felt greed during that time and think that there's more to come. Being down a lot from $3M to $50k, I don't know what will happen to me if it's me. But I am going to take profits little by little when I've seen my portfolio earns that much. It's a different thing and I understand him having this major share of his portfolio and that's why he don't want to dump it too quickly and easy. No one knows if it will still recover for the next bull runs but maybe it won't anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "August 25, 2023, 06:10:07 AM",
      "body": "I am not bullish on Memecoins for now until the landscape changes, coupled with what Pepecoin multisig guys did this morning, I expect most of these Memecoins to continue to bleed, especially the large cap coins. The shill from Elon Musk is not moving the price of Dogecoin again and there is no significant developments on their road to think in the short period of time the price will be bullish. My advice to anyone holding them for now is to derisk and wait and see how things pan out in the real economy till the free money starts flowing into Crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "August 25, 2023, 06:15:33 AM",
      "body": "Probably there are dozens of doge millionaires that can share the same tale  ... Thats why memecoins are the element that directly connects the crypto sector with the online gambling and casino experience in general, these coins have the advantage of spreading a culture linked to the blockchain (and therefore free marketing for btc), but at the same time they expose investors to unnecessary risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}