{
  "id": "topic_5423154",
  "title": "tread93",
  "author": "tread93",
  "created_time": "November 25, 2022, 09:09:10 PMLast edit: December 03, 2022, 04:19:45 AM by tread93",
  "content": "AUCTION TERMS 10th Anniversary Edition of Bitcoin Magazine *RARE* Bid Format:  BTCStarting Bid: 0.01 BTCMinimum Bid Increment: 0.001 BTCAuction End Time: Friday December 2nd at 3:30pm EST countdown clock...https://www.timeanddate.com/countdown/launch?iso=20221202T1630&p0=156&msg=10th+Anniversary+Bitcoin+Magazine&font=cursiveSniping:  No sniping. 10 minute standard sniping rule. All lots extended with any bid to any lot...https://bitcointalk.org/index.php?topic=5277761.0Shipping: Paid for by buyer. Ships from USA. Buyer responsible for any and all customs/dutiesPayment Address: Bitcoin address goes here, unless using escrow.  Payment Due: Within 24 hoursEscrow: Available at cost of buyer",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423154",
  "comments": [
    {
      "author": "owlcatz",
      "created_time": "November 26, 2022, 03:15:50 AM",
      "body": "Just my opinion ofc, but you should lower the starting bid - Or just try and sell it for what you want for it...  Then again, I start all my auctions at 0 BTC, just for the fun...   Everyone is different tho!  Edit - IIRC, the shipping on these mags was pretty sub-par, so the quality of the corners and such now matter, at least to me.  GL either way mate!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "November 28, 2022, 09:37:07 PM",
      "body": "Quote from: owlcatz on November 26, 2022, 03:15:50 AMJust my opinion ofc, but you should lower the starting bid - Or just try and sell it for what you want for it...  Then again, I start all my auctions at 0 BTC, just for the fun...   Everyone is different tho!  Edit - IIRC, the shipping on these mags was pretty sub-par, so the quality of the corners and such now matter, at least to me.  GL either way mate! Thanks for the input! I lowered the starting bit to .0013 BTC. I would also consider an outright trade for a 1k BTCC chip  If nobody bites on this i'm just going to post up for trade or fixed sale price like you suggested!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "November 29, 2022, 02:11:51 PM",
      "body": "Updated once more starting bit is now 0.01 BTC!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}