{
  "id": "topic_5401379",
  "title": "LokyDAO",
  "author": "LokyDAO",
  "created_time": "June 04, 2022, 06:49:47 PM",
  "content": "👑 LokyDAO👑What Are LokyDAO?- “Loky”, homonym to Loki, is a god in Norse Mythology known for his intellect and ability in shape shifting. Inspired by this god, LokyDAO becomes the NFT project in which you will see a young, passionate Asian model that is versatile and opened to possibilities.-The collection “Never Lose Hope” comes with 999 art pieces. Each art piece is a uniquely produced studio image like portraits of a young, passionate girl who had never stops pursuing her dream in modeling. Unlike any seductive shoot you see everywhere, LokyDAO is consisted of fine photographs focusing on female body as it is an unveiling the model’s confidence in her own body, just as she is confident in her own attitudes and personalities.Utility:Making a dream comes true for another human being, in physical. Our revenue will goes into training and supporting future modeling activities for Loky.We are still in the Early-stage.Join us to build an awesome community together and get hyped for this project. 🔥Twitter: https://twitter.com/LokyDaoDiscord: https://discord.gg/tbJfCc7zXe",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401379",
  "comments": [
    {
      "author": "prediactor",
      "created_time": "June 05, 2022, 01:02:32 AM",
      "body": "That seems great",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bmwister",
      "created_time": "June 08, 2022, 03:04:36 PM",
      "body": "It's curious",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mask00",
      "created_time": "June 11, 2022, 03:34:22 PM",
      "body": "Hey I am See your Create new Topic.What is This Can You Start Your Own New Project !! What is Future !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 15, 2022, 05:44:57 PMLast edit: June 15, 2022, 06:12:23 PM by CryptoHeadlineNews",
      "body": "Nft collections has gone beyond the mere arts you normally see before. With the kinds of Bore Ape, the world of NFTs is actually booming",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}