{
  "id": "topic_5415404",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "September 29, 2022, 07:47:40 PM",
  "content": "Yurt dışına çıkmak için fırsat arayan üniversite öğrencisi kişiler için Türkiye Cumhuriyet tarihinin en iyi bursu olan YLSY bursunu maalesef çok az genç biliyor. Ben de bildiklerimi buradan paylaşmak istedim. Nam-ı değer \"yurt dışı lisansüstü öğrenim bursluluk programı\" (YLSY). Üniversiteler ile kamu kurum ve kuruluşlarının yetişmiş insan kaynağı ihtiyacının karşılanması amacıyla mecburi hizmet karşılığında Milli Eğitim Bakanlığı tarafından yürütülen burs.Bu bursa ALES puanı ve lisans mezuniyet ortalaması 4 üzerinden 2,50 olan kişiler başvuruyor ve listeleniyor. (Her hangi bir dil puanı şartı aramaz, burası çokomellidir.) Açılan kontenjana göre Ankara'da yapılan mülakata katılabiliyorlar. Sözlü sınavda alan bilgisine hakim olan, iletişim becerileri güçlü olan, bilimsel gelişmelere açık ve akademik çalışmalara yatkın olan adaylar komisyon tarafından değerlendirilir. Komisyonda üç jüri olur. İkisi alanda bir kişi ise MEB'den. Sözlü mülakattan sonra adaylar, sözlü sınav puanı ve ALES puanının %40’ı ile mezuniyet not ortalamalarının geri kalan %20’si ile hesaplanan toplam YLSY puanı 70 ve üzeri olduğunda ÖSYM sistemi üzerinden yurtdışında eğitim alacakları en fazla 30 kurum tercihinde bulunabilirler.Peki bu burs içinde neler var?Yurt dışındaki okul ücretlerinizin tamamıYurt içi ve yurt dışı ulaşım giderlerinizYurt içi ve yurt dışı sağlık masraflarınızSınav ücretlerinizÜlke içinde bir yıl, şartlı kabul aldıktan sonra yurt dışında 6 ay dil kursunuzAylık burs ödemesi ( ülkeden ülkeye değişmekle beraber 2000 Euro civarı aylık burs)Burs geri ödemeli mi? Bursu kazandığınız zaman bir kuruma atanıyorsunuz. Yurt dışında örneğin 4 yıl boyunca doktora yaptınız, ülkenize döndünüz. 8 yıl boyunca bursu kazandığınız zaman ki kurumda (Örneğin Sakarya Üniversitesindeki öğretim görevlisi kadrosunda işe başlıyorsunuz.) işe başlıyorsunuz. Bu arada devlet siz yurt dışında siz doktora yaparken örneğin Sakarya üniversitesinde öğretim görevlisi olarak çalışıyormuşsunuz gibi sigortanızı yatırıyor emeklilik yaşınız ve priminiz işliyor. Bursun geri ödemesi bursu aldığının iki katı süresi olarak hizmet vermek yada atanan yerde alınan bursu geri ödemek.YLSY bursu ile ilgili aklıma gelen bilgiler. Merak eden arkadaşlar konu başlığı altında sorabilirler bildiklerimi cevaplamaya çalışırım. Ama Yurt dışına gitmek, yerleşmek veya sadece orada eğitim görmek için bile çok bir burs programı.Lakin son yıllardaki ülkedeki liyakatsizlik ve torpilden bu burs programı da etkilenmiş durumda. Ne kadar başarılı olsanız da mülakatta sizleri eleyebiliyorlar. İki yıl üst üste elenen bir kişi olarak size başımdan geçen mülakatı da yazayım. Ortalama mülakatlar 10-15 dk. kadar sürüyor. Benim ise mülakatım ortalama 30-35 dk. sürdü. Onlar soruyor ben cevaplıyorum. Artık jürinin soracak sorusu kalmadı. Alandan olmayan MEB'den olan jüri ile şöyle bir diyaloğum oldu.Jüri: Nereden geliyorsun?Ben: X şehrinden geliyorum.Jüri: X şehrinde limonun kilosu kaç lira?Ve bu diyaloğun akabinde benim de mülakatım bitti ve bekleme alanına geçtim. Benden önce giren kişiler (hepsi nerede ise ben asistan iken derslerine girdiğim kişiler, çoğu sınavdan çıktıkları zaman böyle bir soru sordular cevabı neydi diye bana sormuşlardı) bekliyordu. Hepsi bir ağızdan içerde çok fazla kaldın sen kesin kazandın abi sen muhabbeti olmuştu ama elenen ben oldum kazananlar ise ne tesadüf siyasi olarak belli bir kesimdendi. Hangi kesim olduğunu açıklayan ve YLSY gruplarında dönen şu tweeti de bırakayım.Kaynak: https://twitter.com/gdamlakaya/status/1478520724381913093?s=21",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415404",
  "comments": [
    {
      "author": "kriminall",
      "created_time": "September 29, 2022, 08:04:12 PM",
      "body": "Bıraktığını twite bakınca insan kimlerin bu burstan faydalandığını anlıyor, daha önce hiç duymadığım bir burs ama karakter analizi önemli tabi ! Nasıl oluyorsa demek ki elenen kişiler karaktersiz oluyorlar, lafım size değil o twiti bir de utanmadan yazan o kişiye hocam, daha önce duymamıştım bu bursu, bu ülkeden ne imkanları kullanarak kaçıyorlar, şaşırıyorum,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "September 29, 2022, 08:41:56 PM",
      "body": "Quote from: kriminall on September 29, 2022, 08:04:12 PMBıraktığını twite bakınca insan kimlerin bu burstan faydalandığını anlıyor, daha önce hiç duymadığım bir burs ama karakter analizi önemli tabi ! Nasıl oluyorsa demek ki elenen kişiler karaktersiz oluyorlar, lafım size değil o twiti bir de utanmadan yazan o kişiye hocam, daha önce duymamıştım bu bursu, bu ülkeden ne imkanları kullanarak kaçıyorlar, şaşırıyorum, Maalesef insanların kurumlara inancı sömürüldüğü için bu tarz burslar artık eskisi kadar ilgi çekmiyor ve bilinmiyor.Herhangi bir torpili olmayan bir kişinin ben bu bursu alabileceğine şahsen ihtimal vermiyorum ülkemizde maalesef içinde mülakat olan her şey benim gözümde şaibeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "September 30, 2022, 06:18:26 PM",
      "body": "Quote from: kriminall on September 29, 2022, 08:04:12 PMBıraktığını twite bakınca insan kimlerin bu burstan faydalandığını anlıyor, daha önce hiç duymadığım bir burs ama karakter analizi önemli tabi ! Nasıl oluyorsa demek ki elenen kişiler karaktersiz oluyorlar, lafım size değil o twiti bir de utanmadan yazan o kişiye hocam, daha önce duymamıştım bu bursu, bu ülkeden ne imkanları kullanarak kaçıyorlar, şaşırıyorum, Maalesef hem ülkenin kaymağını yiyorlar hem de fakir ve zeki gençler için olan şu güzel bursu da kullanıp kaçıyorlar. Ama yine de yurt dışında yaşamak isteyen yada çalışmak isteyen kişiler yine de şanslarını deneyebilirler çünkü bir ihtimal bu burs çıkarsa çok rahat ederler.Quote from: judas on September 29, 2022, 08:41:56 PMMaalesef insanların kurumlara inancı sömürüldüğü için bu tarz burslar artık eskisi kadar ilgi çekmiyor ve bilinmiyor.Herhangi bir torpili olmayan bir kişinin ben bu bursu alabileceğine şahsen ihtimal vermiyorum ülkemizde maalesef içinde mülakat olan her şey benim gözümde şaibeli.[/quote]Kurumlara ve hayata olan inancımızı sömürdüler şu genç yaşta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "September 30, 2022, 07:30:55 PM",
      "body": "Dün gördüm ancak üzerinde bugün yazabilme imkanım oldu. Gerçekten de böyle bir burs fırsat arayan ancak imkanı olmayanlar için çok iyi. Ancak biraz geniş bir yelpazeden bakıldığında ise 4 senelik eğitimle Türkiye'nin şuanki şartlarına bağlı kalmak şey gibi cenneti görüp cehenneme gönderilmek gibi. Yukarıda birçok arkadaşımız bahsetmiş bu bursu alan kişiler üç aşağı beş yukarı belli diye. Evet bana kalırsa da çoğunluğu böyle çünkü bu bursu alıp gelen kişilerin sülalesinde en azından bir iki kişi 4-5 farklı kurumdan maaş alan kişiler oluyor ki bu ülkenin kaymağını yiyebilme fırsatıyla ülkeye dönüyor. Yurtdışını gözümüzde fazla büyütmemek gerekiyor. 3-4 aylık bizi kotaracak bir meblayı hazır eden kişi gözü kapalı gitsin yeter ki çalışması gerektiği yerde çalışsın, gezmesi tozması eğlenmesi gerektiği yerde bunları yapsın illa ki tutunur. Böyle bir imkanı kotaramayacak kişiler şansını deneyebilir bana göre",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "September 30, 2022, 08:57:25 PM",
      "body": "Yakın arkadaşım korona döneminde erteledikleri erasmus için yakın zamanda koordinatörlük tarafından arandı. Hakkının olduğunu ve gidebileceği söylendi. Not olarak da artık üniversitenin ödeneğinin büyük bir yüzdesini kestiğini de belirttiler. Bırakın mülakatlarda kendi adamları dışında birini seçmeyi, basit bir erasmus desteğini bile kesecek kadar eğitime karşılar. O yüzden sonunda mülakat olan her şey şaibeli. Bu bursu biliyorum söylediğimiz sebeplerden dolayı da genelin bilmemesi çok normal. Desteği güzel ama desteği hak etmek için desteklenmen lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}