{
  "id": "topic_5445225",
  "title": "balotelli",
  "author": "balotelli",
  "created_time": "March 17, 2023, 05:15:52 AMLast edit: March 17, 2023, 10:03:04 AM by balotelli",
  "content": "Asia pushes to become the next big thing in the crypto world.Good morning. Here’s what’s happening:Prices: Bitcoin is pushing past 25K and its correlation with stocks is decreasing.Insights: Plagiarism, fork or simple mistake? the Shiba Inu community is debating the origin story of the Shibarium blockchain.Asia is seeing a rise in blockchain and cryptocurrency adoption as governments and businesses look to modernize their systems. In Singapore, the Monetary Authority of Singapore has given approval for a blockchain-based trading platform for tokenized securities. In China, blockchain technology is being used for tracking pork supply chains. South Korea is also seeing a rise in blockchain-based projects, with the government investing in blockchain startups and exploring the technology for voting systems. India has also recently lifted its cryptocurrency ban, leading to increased interest and investment in the industry. Overall, Asia is quickly becoming a hub for blockchain and cryptocurrency innovation and development.Summary: Asia is embracing blockchain and cryptocurrency, with Singapore approving a blockchain-based trading platform, China using blockchain for supply chain tracking, South Korea investing in blockchain startups, and India lifting its cryptocurrency ban. This is making Asia a hub for blockchain and cryptocurrency development.Source.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445225",
  "comments": [
    {
      "author": "crwth",
      "created_time": "March 17, 2023, 05:22:36 AM",
      "body": "Generally, Asia is more accepting of Bitcoin. In general, I could think of a couple of things why.Asia has been technologically advanced in recent yearsLack of trust in BanksTransferring money has become easierThat is the current trend in the world, and Asia is at the front of it. I think it will continue in the next decade and hope it will rise in price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "March 17, 2023, 05:44:47 AM",
      "body": "I think this because the US and EU are pushing away the cryptocurrency industry. Blockchain-based companies are moving to a safer haven where governments are setting up a particular venue for them. Asia is the place to be even China which still rejects crypto, is allowing Hongkong.But I wonder what sorts of projects they welcome besides BTC. I don't think its Asia that causes the price to go $25k, but this must be because of the bank runs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cvetik56",
      "created_time": "March 17, 2023, 06:22:57 AM",
      "body": "That's funny, last year Asia brought BTC down, and now they are doing the opposite. But I'm glad to see it anyway and I wonder if it will hold $25K now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 17, 2023, 06:48:28 AM",
      "body": "the US bank run is over and done with for Us its now business as usualUK bank of SVB got bought up by HSBC so it appears there is money flows on the asia side (HSBC is asian)whe we will see is more people wanting to hold crypto rather than stable coins. and thats what we are seeing now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "March 17, 2023, 06:48:43 AM",
      "body": "When we say that Asia is the force that is pushing Bitcoin higher and higher past $25K, I am assuming that more and more individual and institutional buyers based in Asia are getting in love with this digital asset as the world is now closely watching the banking crisis that started in USA and is now spreading to Europe. Well, this is quite possible but I need a reference to confirm this fact. Anyway, I am happy that at this time Bitcoin is detaching itself from stocks and is now standing the way it should be: one of the best safe haven assets alongside gold and silver which are also rising these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "March 17, 2023, 06:50:43 AM",
      "body": "I remember several years ago, when Japan and South Korea were considered to be extremely Bitcoin/crypto friendly. This changed and the governments of both countries imposed heavy regulations over the crypto industry. China was also Bitcoin/crypto friendly, until 2016 or 2017, if I remember this correctly. Russia was hostile towards crypto years ago, but now it's kinda difficult to determine where the Russian government wants to go in terms of crypto adoption. In summary, most Asian countries are unpredictable, and you never know when they will change their policies in regards to Bitcoin/crypto. I think that the current crypto price pump has little to do with Asia and something to do with the negative news about some American and European banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "March 17, 2023, 06:51:10 AM",
      "body": "Quote from: DapanasFruit on March 17, 2023, 06:48:43 AMWhen we say that Asia is the force that is pushing Bitcoin higher and higher past $25K, I am assuming that more and more individual and institutional buyers based in Asia are getting in love with the digital asset as the world is now closely watching the banking crisis that started in USA and is now spreading to Europe.It's not important.Bitcoin has to rise after months diving at bottom. Do you know the Xi pump in 2019? Now in another bear market, 4 year later we got another pump from the East, from Asia?I don't know Asia countries changed or contribute to blockchain and cryptocurrency a lot in 2020 to 2021 bull run or not. You judge it yourself. The current pump is manipulated with news from Asia but it's not because of Asia.In 2019, Bitcoin Jumps 12% as China's Xi Embraces Blockchain, Boosting Crypto Sentiment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StormHawk",
      "created_time": "March 17, 2023, 07:24:12 AM",
      "body": "Quote from: franky1 on March 17, 2023, 06:48:28 AMthe US bank run is over and done with for Us its now business as usualUK bank of SVB got bought up by HSBC so it appears there is money flows on the asia side (HSBC is asian)whe we will see is more people wanting to hold crypto rather than stable coins. and thats what we are seeing nowFinally, this could be a good reason why Bitcoin will surge pass 100k in 2025, but I am still feeling concerned about the battle on Crypto from the US government, I just feel like the wipe-off isn't over yet, what will open door for the retailers to enter the market again? Only a massive dip will look attractive to retailers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "March 17, 2023, 08:16:56 AM",
      "body": "Quote from: crwth on March 17, 2023, 05:22:36 AMGenerally, Asia is more accepting of Bitcoin. In general, I could think of a couple of things why.Asia has been technologically advanced in recent yearsLack of trust in BanksTransferring money has become easierTwo of your 3 reasons seem to be the facts why Asia is considering accepting cryptocurrencies. While I somewhat disagree that most Asians have lost faith in banks.The advancement of digital technology in Asia has really encouraged many developers to contribute to the crypto industry. I've found my country's government friendly to crypto even if they don't approve of it being used as legal tender. That's not a problem, but the point is that Asia is increasingly able to regard these cryptocurrencies as a form of digital development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "March 17, 2023, 08:35:52 AM",
      "body": "Quote from: balotelli on March 17, 2023, 05:15:52 AMAsia pushes to become the next big thing in the crypto world.The basic question is Why is Asia quickly becoming a major player in the world of blockchain and cryptocurrency. The main reason is that thanks to its large population, thriving economy, and advances in technology, Asia is well-positioned to take the lead in the development and adoption of blockchain and cryptocurrency technologies.Take Singapore and China, for example, which have been at the forefront of blockchain development, with their governments investing heavily in blockchain startups and approving blockchain-based trading platforms. also making strides in the blockchain space, using technology for supply chain tracking and exploring the use of digital yuan thereby making the region a hub for blockchain development and adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "March 17, 2023, 08:42:16 AM",
      "body": "Quote from: balotelli on March 17, 2023, 05:15:52 AMGood morning. Here’s what’s happening:Um, just one question here:  did you do the tedious dictation work necessary to transcribe a news broadcast into a forum post?  I'm not going so far as to accuse you of anything, but that tagline \"good morning, here's what's happening\" is a Bloomberg thing if I'm not mistaken, and it looks like Coindesk has also adopted it.  If that's not the case, may I suggest not ripping off mainstream media shit?  It's tacky.And I still have suspicions about the wording in your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "March 17, 2023, 09:29:41 AM",
      "body": "Asia's potential in terms of crypto has been quite positive since the end of the 2019 disease. From some news sources from local sites that I read, Asia is supporting prices to continue strengthening from $20K to a chance to reach $28K although I dare not say that it is true for sure.There is an assumption that some analysts think that it is due to US regulations and also has to do with macro concerns and is inseparable from continuing developments in Asia.In fact, Asia's positive potential has been seen since 2022 with data illustrated in a graph of Ownership of Cryptocurrency that I found on the We Are Social website.Source:[1]. https://investor.id/market-and-corporate/322398/sentimen-positif-dari-asia-jadi-penopang-bitcoin-bakal-melaju-ke-us-28-ribu[2]. https://wearesocial.com/uk/blog/2022/07/the-global-state-of-digital-in-july-2022/Quote from: balotelli on March 17, 2023, 05:15:52 AMAsia pushes to become the next big thing in the crypto world.Good morning. Here’s what’s happening:Prices: Bitcoin is pushing past 25K and its correlation with stocks is decreasing.Insights: Plagiarism, fork or simple mistake? the Shiba Inu community is debating the origin story of the Shibarium blockchain.[snipBut your post is similar to the one published by coindesk today;https://www.coindesk.com/markets/2023/03/17/first-mover-asia-asia-pushes-bitcoin-past-25k/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "March 17, 2023, 09:32:58 AM",
      "body": "Perhaps Asian knows a thing or two on where to hedge their wealth because of the ongoing crisis around the world. And it just make sense though, even if you are not from Asia, crypto is one of the best assets that we can invest right now.We will see how long they are going to push it, right now we just past $26k. But the thing right now is that Asia market might be close or stop trading since it's nigh time now. And it's time for the other side to sell bringing the price down, or continue to do so to be able to get into $27k'ish range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 17, 2023, 11:56:58 AM",
      "body": "Then bitcoin fans pay attention to Asia. If things are going so well there and btc adoption is at the forefront, then it could be a good place for blockchain technology professions as well. Most likely, we will observe some outflow of specialists in this field to those countries.Well, what more can I say about this. Countries that see the benefits of blockchain technology will develop faster and leave others behind. It makes sense to join the leaders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "March 17, 2023, 12:17:43 PM",
      "body": "High possibility of partaking in the new goals of the financial system. They might wanna break the western world bond in terms of rules, and regulations, and also heavy charges are always incurred in the USD. Asia is one of the continents that's highly advancing and is better at doing it as compared to the US. I mean the US is all gone into too much hype and recent debts are even more than what they had last year and so on. I am not sure if Asia is the reason Bitcoin is moving towards newer prices but it does have lion's share in all of these. The use case mentioned in the OP is something that denotes progress in the crypto space and the contribution of Asian countries. Let us embrace the power of developing nations and many of them are really above developing, to be honest but it's the western media that shows only the poor side of it. Anyways some of the westerners could not digest that. Let us hope the quest of embedding the blockchain and bitcoin into the system keeps rolling like this all the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "balotelli",
      "created_time": "March 17, 2023, 12:50:57 PM",
      "body": "Quote from: m2017 on March 17, 2023, 11:56:58 AMThen bitcoin fans pay attention to Asia. If things are going so well there and btc adoption is at the forefront, then it could be a good place for blockchain technology professions as well. Most likely, we will observe some outflow of specialists in this field to those countries.Well, what more can I say about this. Countries that see the benefits of blockchain technology will develop faster and leave others behind. It makes sense to join the leaders.I agree with you 100 percent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 17, 2023, 05:59:45 PM",
      "body": "Yes, Asia, and specifically the Middle East region, may be the next Bull Run, as the CEO of Binance said. The Gulf countries, especially the Arab Emirates, have witnessed a great openness to crypto in the recent period, which made many crypto companies go there.With the clear tightening from the US and Europe towards cryptocurrencies and the more open policy from Asia, we are sure to see most crypto-related companies and services move to Asia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "March 18, 2023, 04:52:32 PM",
      "body": "Quote from: Yaunfitda on March 17, 2023, 09:32:58 AMPerhaps Asian knows a thing or two on where to hedge their wealth because of the ongoing crisis around the world. And it just make sense though, even if you are not from Asia, crypto is one of the best assets that we can invest right now.We will see how long they are going to push it, right now we just past $26k. But the thing right now is that Asia market might be close or stop trading since it's nigh time now. And it's time for the other side to sell bringing the price down, or continue to do so to be able to get into $27k'ish range.I wouldn't be shocked that they are a lot more disciplined about these type of things, even if it is something as wild as bitcoin, they probably got themselves ready for something like this so that they would be making a good profit about it. It is not going to be as simple because bitcoin is volatile and it will always end up with a bit of a waiting time and that is why it's hard to handle it all, but that doesn't change the fact that \"if something bad is going on with the fiat world, turn it into bitcoin\" type of thing, it definitely makes sense and feels like something Asians could do. Specially people from japan, they always been strict about finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "March 19, 2023, 05:04:52 AM",
      "body": "Quote from: BITCOIN4X on March 17, 2023, 08:16:56 AMTwo of your 3 reasons seem to be the facts why Asia is considering accepting cryptocurrencies. While I somewhat disagree that most Asians have lost faith in banks.The advancement of digital technology in Asia has really encouraged many developers to contribute to the crypto industry. I've found my country's government friendly to crypto even if they don't approve of it being used as legal tender. That's not a problem, but the point is that Asia is increasingly able to regard these cryptocurrencies as a form of digital development.Maybe if I can be more specific with the lost faith in banks, maybe with middlemen? Upon analyzing the situation here in my country, there are digital banks that support crypto and you can even buy from them which is a good thing right? What I'm trying to say here is about the traditional and modern ways of banking. I do like some modern banks that you can be flexible with savings and using it as a wallet etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}