{
  "id": "topic_5426572",
  "title": "darxiaomi",
  "author": "darxiaomi",
  "created_time": "December 07, 2022, 04:45:52 PM",
  "content": "Bueno como siempre aclaro el titulo ya de por si es bien explicito, pero porque pongo Blockchain y no BTC, etc?, porque realmente es para la parte mas aplicada a la produccion/servicio que puede aportar como tecnologia la blockchain en general no importa cual sea, y no hablamos de nada monetario.Sin mas dejo la nota que ademas adjunta el boletin oficial del dia de hoy.https://www.infobae.com/economia/2022/12/07/el-gobierno-creo-un-comite-nacional-de-blockchain-cual-sera-sus-objetivo/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426572",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "December 08, 2022, 02:38:01 PM",
      "body": "La idea del Comité es la de no perder la oportunidad de utilizar la tecnología blockchain como soporte a los procesos y tareas de la administración del estado, donde algunos de los aspectos que me parecerían de mayor encaje son los tocantes a la transparencia de información (sin adulteración posterior), las elecciones, y las certificaciones notariales.Es curiosos que estos día he leído algún que otro artículo que citaba, en términos globales, el exceso de recursos invertidos en los desarrollos blockchain para la poca cancha de resultados que ha tenido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "December 08, 2022, 07:47:12 PM",
      "body": "Mira lo que pasa aca por lo menos y creo que en todos lados del mundo en mayor o menor medida se replica es que despues de desarrollado algo aparecen lobys que se oponen porque pierden demasiado o pierden \"tener la vaca atada\".Ejemplo claro de aca son los escribanos y demas cuestiones notariales, los cuales desde los colegios frenan avances porque un poco saben que se les terminan ciertos curros y otro por mera ignorancia y no querer aggiornarse a la actualidad.Igual muy por debajo debo reconocer que se estan haciendo cosas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "December 11, 2022, 10:09:10 PM",
      "body": "No les gusta Bitcoin porque no lo pueden manipular a su antojo, eso es todo. Por eso se pusieron de moda las \"CBDC\", que les ahorra el gasto del papel y la tinta cuando van a imprimir mas y mas.Y de ahí que hablan de blockchain y no de Bitcoin. Pudiese usarse para algunas cosas, pero ¿será transparente? ¿Robusto? ¿Descentralizado? Todo eso va contra las expectativas del político promedio.Imagina que la economía circular no depende ni de bancos ni de exchanges, ¿para que Banco central? Etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darbitmobilerecovery",
      "created_time": "November 15, 2023, 02:30:19 AM",
      "body": "Me siento Ddrm utilizando correctamente el foro y en vez de crear un hilo nuevo reflotar uno ya existente que es de la temática.Bueno vamos con un par de nuevas noticias referidas al tema en cuestión.Se dice que se dejaran de emitir los certificados de estudios (titulos) en formato papel y se pasara todo al digital y que a su vez se podran validar contra una web que estaria soportada por una blockchain. Aca dejo la  nota Y esta es la supuesta paginaDespues tambien el candidato a presidente por la fuerza gobernante tambien hoy, dice que su gobierno si es electo implementara mas cuestiones con blockchain. Algo asi como trazabilidad de las cuentas del estado, algo que medio ya existe con otro sistema de licitaciones publicas y demas pero no en la blockchain. El dato de color es como lo dice, \" que cada argentino tenga su blockchain\"  viendo que demasiado no sabe del tema.  Aca la fuente",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 15, 2023, 10:04:05 AM",
      "body": "Quote from: darbitmobilerecovery on November 15, 2023, 02:30:19 AMMe siento Ddrm utilizando correctamente el foro y en vez de crear un hilo nuevo reflotar uno ya existente que es de la temática.Bueno vamos con un par de nuevas noticias referidas al tema en cuestión.Se dice que se dejaran de emitir los certificados de estudios (titulos) en formato papel y se pasara todo al digital y que a su vez se podran validar contra una web que estaria soportada por una blockchain. Aca dejo la  nota Y esta es la supuesta paginaDespues tambien el candidato a presidente por la fuerza gobernante tambien hoy, dice que su gobierno si es electo implementara mas cuestiones con blockchain. Algo asi como trazabilidad de las cuentas del estado, algo que medio ya existe con otro sistema de licitaciones publicas y demas pero no en la blockchain. El dato de color es como lo dice, \" que cada argentino tenga su blockchain\"  viendo que demasiado no sabe del tema.  Aca la fuenteQue cada argentino tenga su set the llaves privadas, supongo que es lo que quiso decir. Aunque para ser realistas, en los pocos documentos con protección criptografica que he visto por aquí en mi país, solo se limitan a tener una firma, de acuerdo al contenido que el documento tenga, más que todo para que no pueda refutarse el origen del documento, no tampoco alterarse su contenido, sin invalidar la firma en el proceso. El problema de la implementación de un sistema decentralizado de documentación en los que los propios ciudadanos tengan el control de sus claves privadas, es que el punto de fallo para el robo de la identidad es uno solo, y sería el mismo que vemos con Bitcoin, solo basta que alguien cometa el error de exponerla y todo se iría por el desagüe. Algo mi probable, considerando el nivel de educación y manejo de ese tipo de herramientas que la persona de a pie y nueva tiene. Si ya de por sí el posible sacarles las xpriv a alguien que tiene relativo tiempo por aquí, imaginemos que pasará con una población entera que recién se inicia en este campo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}