{
  "id": "topic_5470428",
  "title": "Joeyp",
  "author": "Joeyp",
  "created_time": "October 15, 2023, 02:47:09 PMLast edit: October 15, 2023, 07:16:49 PM by Joeyp",
  "content": "Before Israel - Palestine conflict, I did not even consider such a possibilities ( USA is sending a second aircraft carrier to the eastern Mediterranean ).What if USA will be in the war in future or any international conflict that can lead to the war - USA government can confiscate Bitcoins with USA based blockchain nodes + exchanges + online wallets for war expenses. There are already 19 millions mined BTC worldwide, so this can be real war budget booster for weapons and other expenses. USA currently also has $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table. Washington already owns more than $5 billion worth of seized bitcoin - https://www.forbes.com/sites/michaeldelcastillo/2023/06/16/us-government-owns-way-more-bitcoin-than-any-other-countryso-why-arent-they-selling-it/?sh=d18b8d81f32aList of wars involving the United States - https://en.wikipedia.org/wiki/List_of_wars_involving_the_United_StatesLook also here: - The economics of war. How does this affect us all especially us in crypto?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470428",
  "comments": [
    {
      "author": "Huppercase",
      "created_time": "October 15, 2023, 03:00:38 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMIf USA will be in the war in future or any international conflict that can lead to the war - the USA government can confiscate all Bitcoins for war expenses. There are already 21 millions mined BTC, so this can be real war budget booster for weapons and other expenses. USA currently has also $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table.    War with who in particular? You can't be in a war and just want to ban use of something when it is not affecting you. If USA should be in a war, they might want to sanction the countries that become their enemy and if they want to make payment through the bitcoin, then that's the only when it becomes an eye soar for them to confisticate any bitcoin transactions they found illicit(in their dictionary), which everyone will understand because it is personal but they can confisticate all the bitcoin, they don't have the power to do that.Furthermore, Bitcoin miners are not situated in a single location which bitcoin decentralized and decentralized means power shared across diffrent areas. If today USA want to stop bitcoin, they can only ban it in USA but they don't have the power to it globally, the world doesn't only revolve around US, other countries have bitcoin in possession but they don't speak about it and if US don't like it, what US feel don't affect them. It might affect the price but it will get stronger with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 15, 2023, 03:11:01 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMIf USA will be in the war in future or any international conflict that can lead to the war - the USA government can confiscate all Bitcoins with whole blockchain for war expenses. There are already 19 millions mined BTC, so this can be real war budget booster for weapons and other expenses. USA currently has also $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table.    Bro change your dealer, he is selling you expired ice.    I mean, really! Do you think 19 million has been mined and all of that BTC exists or is owned by US citizens only? Ok let's agree on the fact that they can confiscate our BTC, but you are saying they will confiscate 19 million and that would be a budget booster for the whole US market. Dear, please think before making a topic, you are aware of the fact that BTC is not totally owned by US citizens or nor under the control of US government.And the fact on which I agreed before, <-- for that I have only one thing to say is, they cannot confiscate our BTC because they don't own shit out of it, we can send it anywhere in the world without asking them, even if they try to make a warning to US citizens that you have to assist with us and not make any TXs out of the country, they can not stop that, US citizens can easily send or receive BTC from there non-custodial wallets, yeah they might confiscate the BTC exists in custodial wallets (like of CEXs). Or they might shut down the internet in overall country to stop people from sending money. Well, I don't know why I am thinking of it at the first place, I think I should also change my dealer hehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "October 15, 2023, 03:15:59 PMLast edit: October 15, 2023, 03:38:57 PM by Joeyp",
      "body": "Quote from: Faisal2202 on October 15, 2023, 03:11:01 PMQuote from: Joeyp on October 15, 2023, 02:47:09 PMIf USA will be in the war in future or any international conflict that can lead to the war - the USA government can confiscate all Bitcoins with whole blockchain for war expenses. There are already 19 millions mined BTC, so this can be real war budget booster for weapons and other expenses. USA currently has also $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table.    Bro change your dealer, he is selling you expired ice.    I mean, really! Do you think 19 million has been mined and all of that BTC exists or is owned by US citizens only? Ok let's agree on the fact that they can confiscate our BTC, but you are saying they will confiscate 19 million and that would be a budget booster for the whole US market. Dear, please think before making a topic, you are aware of the fact that BTC is not totally owned by US citizens or nor under the control of US government.And the fact on which I agreed before, <-- for that I have only one thing to say is, they cannot confiscate our BTC because they don't own shit out of it, we can send it anywhere in the world without asking them, even if they try to make a warning to US citizens that you have to assist with us and not make any TXs out of the country, they can not stop that, US citizens can easily send or receive BTC from there non-custodial wallets, yeah they might confiscate the BTC exists in custodial wallets (like of CEXs). Or they might shut down the internet in overall country to stop people from sending money. Well, I don't know why I am thinking of it at the first place, I think I should also change my dealer hehe. If the whole Bitcoin blockchain with main nodes in seized, you probably can not make transfer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 15, 2023, 04:21:26 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMUSA government can confiscate Bitcoins with USA based blockchain nodes + exchanges for war expenses. The first part is not how bitcoin works, you can't confiscate other people's bitcoins using nodes. The US regime has to kick down people's doors and physically take their bitcoins/keys. Or just make an announcement that people should hand over their bitcoins to the government and receive an IOU, they have actually done something similar to this in the world war times with gold!The second part on the other hand, can happen at any time which is why people should not keep their coins in other entities custody such as the centralized exchanges. It can easily be frozen and confiscated.But here's the thing, there isn't that much bitcoin stored on exchanges to be able to fund a war for US that needs trillions for days to enter any wars. The entire bitcoin's value is $500 billion!Quote from: Joeyp on October 15, 2023, 03:15:59 PMIf the whole Bitcoin blockchain with main nodes in seized, you probably can not make transfer.Only a portion of the entire global nodes (and also hashrate) is located inside US jurisdiction. By seizing all of them and not relaying transactions, there still are other nodes in the rest of the world (99% of the population!) that will relay it.That is the power of decentralization...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 15, 2023, 04:25:35 PM",
      "body": "The USA is going to length to ensure that it's not considered a country that's at war with any other country, and that position has been clear well before the Israel-Hamas war, namely in the Russian invasion of Ukraine. Also, realistically, very few countries would want to go to war with the USA, considering how strong this country is economically, politically, militarily, and how it's a part of NATO. If it's a relatively small war (by small I mean something like in Afghanistan), it surely won't need to confiscate anything. If it's a huge war, I still don't think the US would want to lower the popular support that much. I mean, even much smaller countries with a much higher need for resources for the army (like Ukraine) don't do that because this is not the way.  Not to mention that it'll be hard to perform such a confiscation of a digital, decentralized asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 15, 2023, 05:27:13 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMBefore Israel - Palestine conflict, I did not even consider such a possibilities ( USA is sending a second aircraft carrier to the eastern Mediterranean ).What if USA will be in the war in future or any international conflict that can lead to the war - USA government can confiscate Bitcoins with USA based blockchain nodes + exchanges for war expenses. There are already 19 millions mined BTC worldwide, so this can be real war budget booster for weapons and other expenses. USA currently also has $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table. List of wars involving the United States - https://en.wikipedia.org/wiki/List_of_wars_involving_the_United_StatesLook also here - The economics of war. How does this affect us all especially us in crypto?Your provided link at the bottom does not back up your statements, which I think are totally wrong. Because USA does have big impact on the price of BTC but they don't have full control over the BTC blockchain. Because miners are distributed all over the world, and they all are not locals of the US. And that's why they don't have to follow the orders if any given by the US to confiscate the BTC. But in reality, it can not happen, because BTC is decentralized, which means it is distributed all over the world and blockchain technology also, which means, that even if they confiscate BTC in the US, the blockchain and the BTC will work properly at that time too. Because other miners are sitting at different places around the glove to validate the transactions. Just to help you understand 19 million BTCs that are in circulation are not owned by the US only, I own BTC, and I can make TX as I am not from the US. This means, that it is not necessary for the BTC to be shut down if the US wants to confiscate  BTC trading etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "October 15, 2023, 06:10:37 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMBefore Israel - Palestine conflict, I did not even consider such a possibilities ( USA is sending a second aircraft carrier to the eastern Mediterranean ).What if USA will be in the war in future or any international conflict that can lead to the war - USA government can confiscate Bitcoins with USA based blockchain nodes + exchanges for war expenses. There are already 19 millions mined BTC worldwide, so this can be real war budget booster for weapons and other expenses. USA currently also has $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table. List of wars involving the United States - https://en.wikipedia.org/wiki/List_of_wars_involving_the_United_StatesLook also here - The economics of war. How does this affect us all especially us in crypto?The total current worth of bitcoin in circulation is about $526,896,225,000 which is a substantial amount to finance its war expenses. But the question now is how will the US government confiscate a decentralized currency. They can achieve this if all the Bitcoin is kept in centralized exchanges located on the US which is not the case. The US doesn't need to seize Bitcoin to finance war while they can easily turn to the printing press and mint more dollars. Quote from: kryptqnick on October 15, 2023, 04:25:35 PMThe USA is going to length to ensure that it's not considered a country that's at war with any other country, and that position has been clear well before the Israel-Hamas war, namely in the Russian invasion of Ukraine. Also, realistically, very few countries would want to go to war with the USA, considering how strong this country is economically, politically, militarily, and how it's a part of NATO. If it's a relatively small war (by small I mean something like in Afghanistan), it surely won't need to confiscate anything. If it's a huge war, I still don't think the US would want to lower the popular support that much. I mean, even much smaller countries with a much higher need for resources for the army (like Ukraine) don't do that because this is not the way.  Not to mention that it'll be hard to perform such a confiscation of a digital, decentralized asset.It is small conflict that escalates to become a big wars. This conflict between Israel and Hamas has the potential to become a protracted war. A war that cost the US government over $2.3 trillion the loss of 2,400 US servicemen and the death of over 42,000 civilians is not small. The US had to withdraw from Afghanistan when it became clear that they could not achieve their projected goals fighting a war that costs $300 million daily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "October 15, 2023, 06:49:05 PM",
      "body": "I'm not tracking lol.  The exact reason crypto was created was to have 100% control of your money.  If you own your keys no one e can \"take\" your money.  I don't think you quite understand how bitcoin works and need to read up a little more.  And further the US won't just take everyone's money to fund the war, those in.power would just get voted out it's not a dictatorship",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "October 15, 2023, 06:56:11 PM",
      "body": "Lol, you need to be very very very unaware of the chain if you really think that USA could take peoples bitcoin  ı mean this is so much ignorance that requires for anyone to be able to even think about a possibility let alone actually being able to do it. That ain't happening mate, the chain wasn't build like that, jus because you know the word \"node\" doesn't mean that you know how it works, you could literally move the chain away as you want, governments can't do anything about it, you can move it a million times if you want, easily, no pressure at all. Obviously government could just ban it, or just say give it to me, with KYC they could force you, but not take it by force, that ain't happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 15, 2023, 06:58:51 PM",
      "body": "Quote from: wheelz1200 on October 15, 2023, 06:49:05 PMI'm not tracking lol.  The exact reason crypto was created was to have 100% control of your money.  If you own your keys no one e can \"take\" your money.  I don't think you quite understand how bitcoin works and need to read up a little more.  And further the US won't just take everyone's money to fund the war, those in.power would just get voted out it's not a dictatorshipExactly, no government can just take my bitcoin. This is why we self custody, we have full ownership over our coins. Besides if we are ever questioned about our bitcoin ownership we can simply say we forgot the passphrase or seed or even that we had a boating accident & lost them all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Argoo",
      "created_time": "October 15, 2023, 07:15:54 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMBefore Israel - Palestine conflict, I did not even consider such a possibilities ( USA is sending a second aircraft carrier to the eastern Mediterranean ).What if USA will be in the war in future or any international conflict that can lead to the war - USA government can confiscate Bitcoins with USA based blockchain nodes + exchanges + online wallets for war expenses. .The US could enter the war on Israel's side if Iran openly supports Hamas and its allies in the war. This scenario is quite possible. The fact that Hamas launched more than 5,000 rockets into Israel in the first days suggests with a high degree of probability that these rockets were provided by Iran. Iran is already warning Israel against sending its troops into the Gaza Strip and threatens to side with Hamas in this case. Given the threats to Israel and from other Arab states, World War III may soon begin. Although some argue that it has already begun.As for bitcoins, it is unlikely that the US government will ever want to confiscate them even from its citizens for war needs. As long as the dollar is the world's reserve currency, the United States can simply print dollars as much as it needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 16, 2023, 06:06:02 AM",
      "body": "The problem seems to go beyond a localized conflict.\"U.S. President says Hamas must be completely destroyed\". Given that Hamas is a \"maintainer\" of Iran and some other anti-human regimes, dealing with Hamas will lead to the involvement of those regimes/countries as well, against the coalition of Israel and the developed west. Yes, it won't be easy, but hopefully the result will be peace and stabilization, as was the case after WWII, which cost the world a huge price, but in the end, before the rise of Rashism, the world lived more or less stable. Yes, I understand Russia is one of the key beneficiaries and scriptwriters of this massacre in Israel. I hope soon, the world will know who helped to organize, directed, financed Hamas terrorists (by the way - including with the help of cryptocurrency, which has already \"surfaced\"), and in fact since the 60s of the last century is the ideologist of the concept of world terrorism. This is not my personal dislike for Russia (quite reasoned), it is a historical fact - you can read the concept of controlled terrorism developed back in the USSR, about methods of terror and destabilization. Regarding the confiscation of bitcoins - technologically it is difficult to do it without getting the wallet and access to it. Probably the best solution is to destroy the carrier and data carriers of the wallets of the sponsors of terrorism, which will solve the problem and have a positive impact on the crypto market. The second way is to tighten and introduce new regulators in the crypto market, which is not very good and will further undermine confidence in cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "October 16, 2023, 11:17:16 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMBefore Israel - Palestine conflict, I did not even consider such a possibilities ( USA is sending a second aircraft carrier to the eastern Mediterranean ).What if USA will be in the war in future or any international conflict that can lead to the war - USA government can confiscate Bitcoins with USA based blockchain nodes + exchanges + online wallets for war expenses. There are already 19 millions mined BTC worldwide, so this can be real war budget booster for weapons and other expenses. USA currently also has $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table. Washington already owns more than $5 billion worth of seized bitcoin - https://www.forbes.com/sites/michaeldelcastillo/2023/06/16/us-government-owns-way-more-bitcoin-than-any-other-countryso-why-arent-they-selling-it/?sh=d18b8d81f32aList of wars involving the United States - https://en.wikipedia.org/wiki/List_of_wars_involving_the_United_StatesLook also here: - The economics of war. How does this affect us all especially us in crypto?Just from the title, I seem to see something wrong. It made me think when I read the title, to be honest, and a question came to my mind, and it was \"Is Blockchain Stealing?\" As far as I know, Bitcoin can only be stolen if the thief knows the access to it, such as the seed, private key, and password. Unless someone in the know gives what a Bitcoin thief should know,That means it is true what others say: that it is good to hide Bitcoin, especially in times when there is ever a war. You can hide your crypto assets or Bitcoin even if they are in a hardware wallet, a cold wallet, and others. As long as you have all the important files for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 17, 2023, 01:18:44 AM",
      "body": "Quote from: Joeyp on October 15, 2023, 03:15:59 PMQuote from: Faisal2202 on October 15, 2023, 03:11:01 PMQuote from: Joeyp on October 15, 2023, 02:47:09 PMIf USA will be in the war in future or any international conflict that can lead to the war - the USA government can confiscate all Bitcoins with whole blockchain for war expenses. There are already 19 millions mined BTC, so this can be real war budget booster for weapons and other expenses. USA currently has also $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table.    Bro change your dealer, he is selling you expired ice.    I mean, really! Do you think 19 million has been mined and all of that BTC exists or is owned by US citizens only? Ok let's agree on the fact that they can confiscate our BTC, but you are saying they will confiscate 19 million and that would be a budget booster for the whole US market. Dear, please think before making a topic, you are aware of the fact that BTC is not totally owned by US citizens or nor under the control of US government.And the fact on which I agreed before, <-- for that I have only one thing to say is, they cannot confiscate our BTC because they don't own shit out of it, we can send it anywhere in the world without asking them, even if they try to make a warning to US citizens that you have to assist with us and not make any TXs out of the country, they can not stop that, US citizens can easily send or receive BTC from there non-custodial wallets, yeah they might confiscate the BTC exists in custodial wallets (like of CEXs). Or they might shut down the internet in overall country to stop people from sending money. Well, I don't know why I am thinking of it at the first place, I think I should also change my dealer hehe. If the whole Bitcoin blockchain with main nodes in seized, you probably can not make transfer.Not happening. too many scattered nodes all over the world.Any country in the world can say All crypto is too easy to get money into terrorist hands.That country can then make endless kyc rules.and bust you if you do not comply.The threat of war and terrorist can be used to justify tough laws by a country.So instead of picking any one country the reality is a lot of countries may do this kyc kyc kyc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 17, 2023, 12:15:01 PM",
      "body": "To remove the question, you just have to understand what is funding illegal formations/regimes. If anyone thinks that it looks like this: here you have 1,000,000 dollars, and there they will sell you 10,000 machines for it, you are mistaken. No, that's not how it works. Someone who is at the top or in control of some process gets the money. Whether it's dollars, euros, rubles, bitcoins.... Then. Yes, yes - part of the money settles in his (or a group of people's) pockets, and the hundredth of the money is used to buy those \"10,000 machines\" and given to those who will be the direct perpetrators of terrorist attacks, murders, etc. Yes, part of the money is used to pay consultants, open accounts.... But the key nuance is those who live off the money - the top brass. And as you understand - they are not going to blow themselves up at a roadblock, or break in and kill civilians, or commit other crimes. NO. He has money and he wants to live beautifully. Death and all this stuff is not for him. He is above these mortal and worthless performers who are fooled by propaganda. And here comes the most subtle nuance - the number of goods and services sold for bitcoins is not so wide to satisfy the demands for a beautiful life of another \"fighter against capitalism\". He wants a villa, a yacht, pretty girls, and cars... And for that you need money. And here is the most delicate place - to convert illegal cryptocurrency into legal fiat money. That's where the biggest control point will be. From KYC to blocking funds to seizing them from exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 18, 2023, 09:01:52 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 03:15:59 PMIf the whole Bitcoin blockchain with main nodes in seized, you probably can not make transfer.Well, there are 46392 NODES main nodes scattered all over the world. The numbers are obviously not too large, but not exist only in US, which means, the US can seize the nodes running in their country, by any means, first, they have to find their locations and the real owners and other paperwork, but let's just forget those protocols, and agree that they seize those nods, then what. How many nodes are there in the US? Can you tell, according to this website, the US has 10191 nodes running in their country. If that's true then my friend, it will not matter shit to the BTC blockchain other than some congestion on the network and huge losses to the US economy. I hope now you understand. The website I am talking about. Bitnodes estimates the relative size of the Bitcoin peer-to-peer network by finding all of its reachable nodes.Quote from: philipma1957 on October 17, 2023, 01:18:44 AMNot happening. too many scattered nodes all over the world.Agreed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "October 18, 2023, 09:54:47 PM",
      "body": "Quote from: Joeyp on October 15, 2023, 02:47:09 PMBefore Israel - Palestine conflict, I did not even consider such a possibilities ( USA is sending a second aircraft carrier to the eastern Mediterranean ).What if USA will be in the war in future or any international conflict that can lead to the war - USA government can confiscate Bitcoins with USA based blockchain nodes + exchanges + online wallets for war expenses. There are already 19 millions mined BTC worldwide, so this can be real war budget booster for weapons and other expenses. USA currently also has $33.54 trillion in federal debt, so if there are such international conflict, mined Bitcoins seizing for war budget can be really on the White House decision table. Washington already owns more than $5 billion worth of seized bitcoin - https://www.forbes.com/sites/michaeldelcastillo/2023/06/16/us-government-owns-way-more-bitcoin-than-any-other-countryso-why-arent-they-selling-it/?sh=d18b8d81f32aList of wars involving the United States - https://en.wikipedia.org/wiki/List_of_wars_involving_the_United_StatesLook also here: - The economics of war. How does this affect us all especially us in crypto?I agree that the US can probably do that theoretically but it's very unlikely they're actually going to do that. Blockchain cannot be seized and confiscated but confiscating Bitcoins will lead to a huge dump, which most probably will lead to their own BTC reserves losing value and investors leaving Bitcoin due to a massive loss of trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "October 18, 2023, 10:00:17 PM",
      "body": "This applies to every government in the world. Every country might go to war at some point in the future and might attempt to start seizing coins if things will get dire for the war economy. If people will voluntarily or involuntarily let their government know how many coins they own, the government might come to them to confiscate the coins, and even if they attempt to hide the coins, the coins or the liquidated funds will become harder to use legally. So it's not like crypto is a perfect loophole for avoiding funds seizure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 18, 2023, 10:35:07 PM",
      "body": "Quote from: hatshepsut93 on October 18, 2023, 10:00:17 PMThis applies to every government in the world. Every country might go to war at some point in the future and might attempt to start seizing coins if things will get dire for the war economy. If people will voluntarily or involuntarily let their government know how many coins they own, the government might come to them to confiscate the coins, and even if they attempt to hide the coins, the coins or the liquidated funds will become harder to use legally. So it's not like crypto is a perfect loophole for avoiding funds seizure.I agree, that's what they will do if they're in the dire need for more funds. Every citizen will be pushed with money that they've got and will be confiscated and if it's still not enough, all they need to do is to secure and be more strict with where Bitcoins can be exchanged into fiat. They'll go with these exchanges and have the information of any registered user on them and that's how they're going to get their intel, and in no time they'll be at the door steps knocking it and you'll have no way of denying it that you still own some.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}