{
  "id": "topic_5450343",
  "title": "Squaremile777",
  "author": "Squaremile777",
  "created_time": "April 27, 2023, 09:07:48 AM",
  "content": "Staking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450343",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 27, 2023, 10:42:21 AM",
      "body": "This board is about trading, not about staking. You can move this thread to altcoin board, or maybe service discussion if you know you are staking or earning from exchange staking. You should know that not all earnings on exchanges are staking. Earning can be gotten from the leverage given to traders too and some other things. But the main thing is that you should earn by staking on noncustodial wallet or using a decentralized exchange if you like the coin and see the potential that the coin will rise after a significant fall or bear market. Know that altcoins are gambling, be careful and do not use more than what you can afford.Very important to know that staking on an exchange means you have no complete control and it means anything can happen to your coins if you give it out as you give it to the exchanges to do it for you. Better to use a noncustodial wallet or connect to a decentralized exchange to stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 27, 2023, 11:00:56 AM",
      "body": "Staking is surely a way to earn some coins in profit when you finally sell off it but you have to know that the margin of profit you can get while staking your coin is very minimal if you have to trade it. Although trading is difficult and scary   A good decisive trade can give you more than 100% - 200% turn over to your initial value of coin in just a month (30days of staking) and that calculated over 120 days (3 months) but if you stake in a month you can only have less than 12%-16% and more less percentage in staking profit for 60 days or 120 days because in staking the higher the durational time of keeping your coins in hodl on the exchange, the lower your profit or earning staking bonus vice versa. This is what you need to consider in staking. Another thing is the staking earning percentage is not at random for every coin. Example, the percentage you will have for staking differs in different exchanges and also depending on the coins usability and demand. In binance for example, I have noticed the available time for staking differs in different coins, Shiba has longer time for staking up to 120 days with higher percentage in earning but ctsi is more shortened with lower earning percentage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "April 27, 2023, 11:22:57 AM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.Never think that staking will give you a decent profit while holding and besides, this is too risky on your part. I'm not going to stop you but I like to help you out from thinking that this is a good solution to earn more without doing anything because the reality is that, it is just only a penny. Trading is way better but I don't ask you to do that if you are not knowledgeable about this otherwise, you are just throwing your money into the other hands. For any of these strategies and ways of earning, you must have to choose reputable exchanges, most especially if you are staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "April 27, 2023, 11:25:35 AM",
      "body": "Staking is indeed a great way to earn some extra money, but I honestly do not advice it be done on centralized exchanges, though centralized exchanges offer a better, much higher APR, but they staking on your non-custodial wallet is much safer.Some weeks back, Renec Blockchain ran a staking program on Lbank, I staked about $500, the program lasted for about 2 weeks, and in the end, I earned close to $20, this is incredible, but what I must confess to you is that, through out the staking period, my mind was not at rest, this is for the known fact that it is really risky to hold coins you are not ready to sell on centralized exchanges, they are prone to hack at anytime, your coins are better safe with you than with centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "April 27, 2023, 12:22:32 PM",
      "body": "Don't think about staking is running well and you earn profit on every days until end period of your coins staking, learned from many coins support staking and have been listed on bigger exchange like Binance can't guarantee with stable price until ended of staking period. You can research with AXS and Solana because both coins give higher reward staking and have been listed on Binance.But without one year or staking period ended both coins drop drastically and almost loss 80% if some one staked on all time higher price, don't have in your minds about staking is best thing for earn passive income from cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "April 27, 2023, 12:29:50 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.Staking coin is very good especially if the price of the coin is low, when you stake some coins, you get reward for staking the coin which means that you will get additional coin to be added to your own, so instead of holding the coin, staking it will be better so that you can gain more coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "April 27, 2023, 01:41:36 PM",
      "body": "Staking comes with risks, however they are reduced significantly by coins you stake and services you stake with. Sticking to native solution is always better, or at most a non-custodial one. Several cexes also offer staking services today, however don't trust them with large amount of funds. Suppose, you have 5 BTC then don't get lured by staking interest from CEX as you are taking significantly more risk putting your funds than whatever rewards you may earn there. Here is useful site to know about various staking coins and staking platforms: https://www.stakingrewards.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "April 27, 2023, 02:03:05 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.What do you mean by staking? Is it lending your balance to platform and wait for certain return on set timeline?Or just let it been hold on your wallet? If you talk about first well that's real staking and aside waiting for returns you can earn if market pump. But the risk to lose money is there especially if the platform you use to stake your crypto is a scam site for sure with that you lose everything you hold.But for holding it on your wallet well the risk is low since the only thing you need to watch is the volatility of the market. Your patience is needed in this option because if you didn't have that you might lose your money on bad market movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "April 27, 2023, 02:44:26 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.I think the better staking option is staking in the wallet rather than transferring to a third-party pool. because every third-party pool is not decentralized and lacks security as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 27, 2023, 02:59:29 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.Yes, they're one of the best ways to earn these days but there's still a risk with it. If an unfortunate moment comes and they've been hacked, they can just say that everything that's staked has been compromised and there's no way for them to have a refund.This scenario can be real and that's why don't be too overwhelmed with these earn features even if you find it convenient. It's still best to stake into those wallets where you also hold the private keys. You have it better and secured and you've got more peace of mind and you can sleep better than it is with the exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "merekamo",
      "created_time": "April 29, 2023, 12:48:30 PM",
      "body": "So, you're asking about staking and how it can be a good way to earn income, even when the price falls. In my opinion, staking is a great way to earn passive income while still holding onto your assets.Important thing is you just need to make sure you're staking with a reputable platform that has a good track record. I think the new feature on exchanges where you can earn interest on your assets is a great development. It's a low-risk way to earn some extra income, especially since some platforms have little to no lock-up periods. And with no liquidation risk, you can sleep soundly knowing your assets are secure.Instead of trading, staking may be a more newbie-friendly method of earning income. Of course, if you know what you're doing, trading can also be a good way to earn money. But staking is definitely a great option for those who want to take a more hands-off approach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "April 30, 2023, 05:47:09 AM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.Staking here in cryptocurrency is a good method to use if you are a long-term investor in altcoins. And one of the staking platforms I use is swap and binance, a centralized and decentralized platform.The others I am currently studying and observing such as zysynx, arb and defillama. I only put in small amounts and if I see that the development is good, then maybe I will increase the amount that I put in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitgolden",
      "created_time": "April 30, 2023, 06:44:01 PM",
      "body": "Quote from: blockman on April 27, 2023, 02:59:29 PMQuote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.Yes, they're one of the best ways to earn these days but there's still a risk with it. If an unfortunate moment comes and they've been hacked, they can just say that everything that's staked has been compromised and there's no way for them to have a refund.This scenario can be real and that's why don't be too overwhelmed with these earn features even if you find it convenient. It's still best to stake into those wallets where you also hold the private keys. You have it better and secured and you've got more peace of mind and you can sleep better than it is with the exchanges.Depends on where you are staking though. Like for example ETH staking could be done in a place where you won't be hacked, or you could just go to Binance which I highly doubt will get hacked and then you can stake there as well. Only places that you could get hacked or the places can get hacked is defi places, and in those places it might happen but I still think that it depends on the level of it.Like I doubt staking at pancakeswap would equal to losing all your money, it may happen, or maybe it won't happen, or uniswap with the same logic as well. So do your best to protect your money as well as you can, but also check some other places that may end up being something proper, it will allow you to make a good return without a doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "April 30, 2023, 07:06:59 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMThe new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.what percentage of profit will you get from staking for at least 14 days? maybe those who haven't mastered trading will be interested in trying it with words like you said. but if they already have skills in trading, it would be better to make a profit trading than staking.most of the platforms that give a large percentage are new platforms. and that's part of the promotion. not necessarily the reputation for us staking our assets there. while for the old platform. most of the bids are not that big. if you are with small capital, you will only be wasting your time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "April 30, 2023, 07:24:23 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.I think staking is good only if you are able to do it at the right time. Eventually staking can give a good return only if you staked at a low price and eventually the price of the coin rises and you now get amplified returns. In case of no lock-ins obviously the returns will be less as well. But yes it's slightly less risky as well. But in drowning markets or especially all time high markets it can be very risky. Because you have staked at a higher price and are now getting peanuts for your returns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotHatinJustTrollin",
      "created_time": "April 30, 2023, 07:26:50 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.Staking offers a great way to earn passive income in the cryptocurrency market. Staking allows users to participate in the network's consensus mechanism and earn rewards for validating transactions. Even in times of market volatility or price decline, stakers can continue earning rewards by adding more coins to their staking pool.Additionally, the new EARN feature on exchanges provides an even easier way for users to earn income through staking without the need to set up a separate staking wallet or deal with network requirements. This makes staking more accessible to newcomers and helps diversify investment portfolios.Staking also offers advantages over other methods of passive income, such as mining, which requires expensive equipment and consumes significant energy costs. Unlike mining, staking requires minimal equipment and energy consumption, making it a more environmentally friendly option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "April 30, 2023, 07:42:53 PM",
      "body": "Quote from: NotHatinJustTrollin on April 30, 2023, 07:26:50 PMStaking offers a great way to earn passive income in the cryptocurrency market. Staking allows users to participate in the network's consensus mechanism and earn rewards for validating transactions. Even in times of market volatility or price decline, stakers can continue earning rewards by adding more coins to their staking pool.Additionally, the new EARN feature on exchanges provides an even easier way for users to earn income through staking without the need to set up a separate staking wallet or deal with network requirements. This makes staking more accessible to newcomers and helps diversify investment portfolios.Staking also offers advantages over other methods of passive income, such as mining, which requires expensive equipment and consumes significant energy costs. Unlike mining, staking requires minimal equipment and energy consumption, making it a more environmentally friendly option.Really? This reads like a one of these paid promo articles for Coinbase or some other shitty exchange. Show me the numbers then if you think staking is really worth it. IMO the risk outweighs the potential profit. I wouldn't recommend staking to anyone, especially staking through an exchange. This means you have to hold money on exchange for long periods of time, risking it all to get 0.5% each month. To stake ETH you need 32 coins locked in staking. If you do that via an exchange that's 60k USD locked there, being risked every day. Imagine if you had all those money on one of the bankrupt exchanges before the collapse like on FTX. Suddenly earning a few bucks a month wouldn't look so appealing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "April 30, 2023, 11:01:43 PM",
      "body": "Quote from: teosanru on April 30, 2023, 07:24:23 PMQuote from: Squaremile777 on April 27, 2023, 09:07:48 AMStaking when price fall you just buy more and put in to staking once price goes up you don't need to sell it you continue to staking so after u earn more.The new feature on exchangers the EARN could be one of the best ways to earn income some of them Even no lock up or little as 14 days.No liquitation risk and you sleep well newbie friendly method..instead of trading off course If you know what you doing trading good Also but staking Are great one.I think staking is good only if you are able to do it at the right time. Eventually staking can give a good return only if you staked at a low price and eventually the price of the coin rises and you now get amplified returns. In case of no lock-ins obviously the returns will be less as well. But yes it's slightly less risky as well. But in drowning markets or especially all time high markets it can be very risky. Because you have staked at a higher price and are now getting peanuts for your returns.and it is entirely dependent on the coin itself. you may be getting good returns from staking, but their market price is declining. so what's your profit on this? this is true for most alts. i've tried a lot of times staking some coins. but what i learned from this experience is sell while it has still good value in the market. don't wait too long, or you will be holding a lot of trash coins.be updated also with their socmed channels, you will get hint if they are about to abandon their project. no replies/response. time to pack up and sell your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 01, 2023, 02:16:31 AM",
      "body": "When you say staking, this indicates two things, that the currency works on the principle of proof of stake, or that there is a service that gives you a return from the deposit.POS coins lose their value in the long run. It is true that money increases by a certain percentage, but its value after the increase is less than its real value, and therefore you lose the value of your money.The services that give you a return from the deposit are good, but they are central and you need to trust them, as it is possible and in an instant to lose your capital without compensation.If you are looking for value, you will definitely stay away from all staking coins and services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}