{
  "id": "topic_5464767",
  "title": "Hatchy",
  "author": "Hatchy",
  "created_time": "August 27, 2023, 10:52:36 PM",
  "content": "Hey my Naija people, how una dey? I just remember one topic wey I comment on recentlyAfter Making Money In Bitcoin, How is Black Tax Affecting You Economically? and e come dey my mind say e go make sense to carry the matter come our local board because I know say many of us dey face this issue for nija now wey thing just dey hard die. the matter in question here na about this issue wey Dem dey call black tax. this wan na e be the responsibility wey most of us dey carry for our shoulder as heads of our families, brothers or sisters and the roles wey we dey expected to play to our loved ones financially.For our country where things just dey hard Wella, plenty of us dey shoulder heavy responsibility to put food for our family table. Sometimes e dey tire person as e dey seem say we dey empty pocket just to make sure say dem dey alright and  no dey sweet us for body like that. E no easy at all to carry people matter for head plus our own. As men or women or head of family, we dey think plenty things but we no dey quick talk am because we dey try dey strong.I know say God don bless many of our people through signature campaigns for Bitcointalk and Bitcoin investments, but money no still dey like that and e no dey reach. Money dey come like spirit once you hold am e don vanish. To cut the long Tori short, my question now be say, how una dey manage all these responsibilities make e no affect una personal life and Bitcoin/crypto investments? Watin una think about this matter and how many of una even know say una don dey pay black tax ever since.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464767",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "August 28, 2023, 08:07:46 AM",
      "body": "I like how investopedia explained it:QuoteThe Black tax, a term that originated in South Africa, is the financial responsibility placed on family members who experience upward mobility to help out their relatives who are less fortunate. Often, the successful person is the first one in a poor family who graduates from college or attains a high-paying job.My parent sent all of us in my family to school, up to university level. And my father always said if anyone is ready for MSc and PHD, that he is ready to pay for it.The money that I give them is not a black tax for me and they are worth it. Not that the depend on it.For a poor family that sent their first born to school, I expect the person to help his siblings. But the state Nigeria has been for a long time, unemployment and underemployment has increased which can make this not to be possible in Nigeria because a graduate that is not able to cater for himself and his wife, will not be able or find it hard to help his family members like siblings and other relatives.About siblings, it is better parents help them in a way one will not depend on the other. At least, they should all go to school which may help even if they are unemployed or underemployed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 28, 2023, 09:07:42 AM",
      "body": "It will be a burden for you if you don't have anything doing and your family depend on you. If you have a good income, you wouldn't see it as anything only if you are the self-centered type. Signature campaign don really help many of us and me I dey use my own dey help my family small, small but not all the time because other personal expenses follow. This na e make if you get another means of income,like open small business wey go dey give you daily pay so that you go use am add. And if you be the one wey get wife,gather money rent shop for her make she dey do business,so that small thing go dey come out from there. This country no need to depend on one source or government if not you go die well.Quote from: Charles-Tim on August 28, 2023, 08:07:46 AMAbout siblings, it is better parents help them in a way one will not depend on the other. At least, they should all go to school which may help even if they are unemployed or underemployed. If Parents don't have money to send them to school, maybe for some reasons,parent can send them to learn a skill,so that they will use it to  carter for themselves when they are done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "August 28, 2023, 12:57:07 PM",
      "body": "I’m not sure I have come across a word black tax before until now, but I can fully understand what it is all about. Paying black tax is something I feel it is already ingrained into us as Nigerians because many households and culture believes in them that if you’re the successful one and didn’t give back to your siblings and less fortunate ones you’ll be termed wicked and evil. They expect you to give back even more. This shouldn’t be viewed as a responsibility of the eldest or successful one but should be something of choice. We all know that it is good to help and support those that are not up to you and can’t afford everything without that help, but shouldn’t be made compulsory on them, it is a choice, let them do what they want with their money and let God judge them for their actions. It will be a different case again when it was an agreement that one will be sent to school and after graduation and getting a job, they should give and support the younger ones. In this case, if the successful transgress, he can be termed wicked. But with the country situation now, even to get a job is hard for the graduates. Black tax shouldn’t be viewed as compulsory but optional for the one that wish to, but it is indeed good to help those that needs it the most (siblings) and less privileged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "August 29, 2023, 07:58:09 AM",
      "body": "Wetin I reason about this one na say this black tax now nor dey as strong as e bin dey before. Make I explain. As we Africans dey adopt western lifestyle, we also dey adopt their culture. We sabi say Westerners their own culture na individuality while for us Africans, our own culture na communal life. But this one nor dey happen again. Before you fit call person from your villa you broda but now not anymore. Na individualism we dey practice now. And for some pipo wey dey do am out of moral obligation, e nor easy. One thing wey I don learn be say, I nor fit help everybody. And if you help your family members come go broke, dem go laugh you say you nor get sense. So, I do the one wey I fit do and allow them use their head to sort out the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}