{
  "id": "topic_5519230",
  "title": "legiteum",
  "author": "legiteum",
  "created_time": "November 14, 2024, 04:46:04 PM",
  "content": "Warren Buffett is selling off stocks this year and hoarding USD. Why? He clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy. Clearly the majority in the US feels these changes will be good for them. But Mr. Buffett clearly doesn't. Maybe he's right, or maybe he's wrong. We'll see. The question is, if he's right, what will a recession do to the price of Bitcoin?My own assumption is that it will be very negative for the price. Millions of individual Bitcoin/crypto investors will need to liquidate their holdings if they lose their jobs, or are afraid of losing their jobs. If inflation spikes, then interest rates will also spike, which will diminish economic growth, leading to mass layoffs--and everything Trump has promised will inevitably spike inflation (it remains to be seen if he will really do any of this though).Is there a bull case for digital currencies during a US economic downturn though? What do you all think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5519230",
  "comments": [
    {
      "author": "AVE5",
      "created_time": "November 14, 2024, 05:34:45 PM",
      "body": "Quote from: legiteum on November 14, 2024, 04:46:04 PMWarren Buffett is selling off stocks this year and hoarding USD. Why? He clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy. Clearly the majority in the US feels these changes will be good for them. But Mr. Buffett clearly doesn't. Trump regime would be a new administration which calls for restructuring of economy infrastructures so at this time we may not be expecting a normalized economy flow not until the tampered system aim is achieved for stability. This shouldn't be a call of Fomo unless Warren Buffett was an anti-Donald Trump then he has to take early concious move to secure his values before he begin to reap what he sow. Quote from: legiteum on November 14, 2024, 04:46:04 PMMaybe he's right, or maybe he's wrong. We'll see. The question is, if he's right, what will a recession do to the price of Bitcoin?My own assumption is that it will be very negative for the price. Millions of individual Bitcoin/crypto investors will need to liquidate their holdings if they lose their jobs, or are afraid of losing their jobs. If inflation spikes, then interest rates will also spike, which will diminish economic growth, leading to mass layoffs--and everything Trump has promised will inevitably spike inflation (it remains to be seen if he will really do any of this though).Is there a bull case for digital currencies during a US economic downturn though? What do you all think?If the recession happens then we'll be seeing massive bitcoin adoptors which definitely would lead to increments of bitcoin price Recall that bitcoin already is potential to store values during an economy downtime as that so I don't see bitcoin diminishing either does it have a potential set back of commodities and economy system.Imagine a government as El Salvador adopted bitcoin on what important role bitcoin would play to the improvement of their economy when commodities are faded due to economy infrastructures.So I think governments that would be awaken to adopt bitcoin would be safe if really the recession happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "November 14, 2024, 06:18:03 PM",
      "body": "Quote from: AVE5 on November 14, 2024, 05:34:45 PMQuote from: legiteum on November 14, 2024, 04:46:04 PMWarren Buffett is selling off stocks this year and hoarding USD. Why? He clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy. Clearly the majority in the US feels these changes will be good for them. But Mr. Buffett clearly doesn't. Trump regime would be a new administration which calls for restructuring of economy infrastructures so at this time we may not be expecting a normalized economy flow not until the tampered system aim is achieved for stability. This shouldn't be a call of Fomo unless Warren Buffett was an anti-Donald Trump then he has to take early concious move to secure his values before he begin to reap what he sow. I don't think Buffet is \"anti-Donald\" and I doubt he even cares about Trump either way. He is just looking at the markets and making a judgement. QuoteIf the recession happens then we'll be seeing massive bitcoin adoptors which definitely would lead to increments of bitcoin price Recall that bitcoin already is potential to store values during an economy downtime as that so I don't see bitcoin diminishing either does it have a potential set back of commodities and economy system.If that's the case, how do you explain the fact that Bitcoin has roughly tracked overall market momentum over the last few years? When stocks go down, Bitcoin goes down. Today stocks are at ATH, as is Bitcoin.QuoteSo I think governments that would be awaken to adopt bitcoin would be safe if really the recession happens.If Bitcoin dropped significantly in the market then El Salvador would be bankrupt, the president would be overthrown, and... I really doubt any other country would ever try something like that ever again .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 15, 2024, 06:54:36 AM",
      "body": "QuoteHe clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy.I don't think that the US economy is really dependent on import. Reducing the import of cheap goods, that are produced in China would most likely lead to inflation rather than recession. The illegal immigrants provide cheap labor, but I also don't think that they are really important for the US economy. I expect a new Bitcoin ATH in the first quarter of 2025, followed by a bear market that will continue for a long time frame. Inflation is good for BTC, recession is bad, but I don't expect any major recession in the USA during the Trump administration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "November 15, 2024, 08:03:15 AM",
      "body": "Quote from: legiteum on November 14, 2024, 04:46:04 PMWarren Buffett is selling off stocks this year and hoarding USD. Not exactly true... He's doing some restructuring and could be piling cash to make a major investment. He sold some Apple and bought Domino's and Pool (whatever that is).Quote from: legiteum on November 14, 2024, 04:46:04 PMWhy? He clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy. Clearly the majority in the US feels these changes will be good for them. But Mr. Buffett clearly doesn't.All of the selling happened before the election. He's taking some massive profits, which is what good investors do. And yeah, the S&P looks crazy overvalued after a giant multi-year run-up.Quote from: legiteum on November 14, 2024, 04:46:04 PMThe question is, if he's right, what will a recession do to the price of Bitcoin?Well, that is the question, and the answer is nobody knows for sure because Bitcoin has only existed in a bull market (minus the whole covid fiasco which America printed its way out of pretty quickly).Quote from: legiteum on November 14, 2024, 04:46:04 PMMy own assumption is that it will be very negative for the price. Millions of individual Bitcoin/crypto investors will need to liquidate their holdings if they lose their jobs, or are afraid of losing their jobs. If inflation spikes, then interest rates will also spike, which will diminish economic growth, leading to mass layoffs--and everything Trump has promised will inevitably spike inflation (it remains to be seen if he will really do any of this though).Is there a bull case for digital currencies during a US economic downturn though? What do you all think?Bitcoin is pretty much a toy for the rich, and Wall Street sees it as having the highest risk of all high risk investments. So in a sudden economic downturn the price would indubitably drop due to its eccentricity as an investment class. However, if economic problems are caused by a devaluing dollar, then we could actually see a \"flight to bitcoin\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "November 15, 2024, 08:11:04 AM",
      "body": "Quote from: AVE5 on November 14, 2024, 05:34:45 PMIf the recession happens then we'll be seeing massive bitcoin adoptors which definitely would lead to increments of bitcoin price Recall that bitcoin already is potential to store values during an economy downtime as that so I don't see bitcoin diminishing either does it have a potential set back of commodities and economy system.Bitcoin has potential and can be used as a store of value but I don't see it reaching that stage yet . I mean, with the current volatility , it's still not a perfect store of value and if we accept the reality , most people are just using it as a speculative asset.Remember the 2022 inflation period 1 year ago ? Bitcoin dumped when inflation peaked , showing it's not the store of value we once thought it was.Bitcoin is only used as an investment these days so a recession won't be good for it, I think bitcoin will get dumped if recession happens.The opposite could also happen if the new US administration turns it into a national reserve, but as we all know ,  Trump's idea is not easy to implement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "November 15, 2024, 08:22:27 AM",
      "body": "Quote from: legiteum on November 14, 2024, 04:46:04 PMWarren Buffett is selling off stocks this year and hoarding USD. Why? He clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy. Clearly the majority in the US feels these changes will be good for them. But Mr. Buffett clearly doesn't. Maybe he's right, or maybe he's wrong. We'll see. That is the thing, he could be right or wrong, we will never know what is going to happen, so he is betting on himself, so be it.Quote from: legiteum on November 14, 2024, 04:46:04 PMThe question is, if he's right, what will a recession do to the price of Bitcoin?We have seen it all, and yet Bitcoin holds it's own against this recession buy having it's bull run no matter what.Quote from: legiteum on November 14, 2024, 04:46:04 PMMy own assumption is that it will be very negative for the price. Millions of individual Bitcoin/crypto investors will need to liquidate their holdings if they lose their jobs, or are afraid of losing their jobs. If inflation spikes, then interest rates will also spike, which will diminish economic growth, leading to mass layoffs--and everything Trump has promised will inevitably spike inflation (it remains to be seen if he will really do any of this though).Is there a bull case for digital currencies during a US economic downturn though? What do you all think?Just suck it in, right now we are in the bull run, till next year. But after that, in 2026, Bitcoin will have to rest and start all over again, meaning we will be in the bear market. So the price is going down, very hard, so most likely there will be investors who will shift to stocks and any other assets. But it doesn't mean that it will cause the downfall of the US economic other Trump, that's how Bitcoin works, we have a 4 year cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "November 15, 2024, 08:26:25 AM",
      "body": "Buffett's stock sales this year, including huge sales of Apple and Bank of America, would appear more related to caution and grasping future opportunities rather than outright panic. Currently, he has loads of money in his pocket, which he could use when the prices go down during economic turmoil. Some have painted that as a warning sign of recession, but certainly not a promise of recession, it is complicated and associated with a number of factors that influence the markets.The impact of this recession on Bitcoin could happen in some very odd ways, of course, out of work people may liquidate a portion of their assets, including Bitcoin, which could drive down the price of the cryptocurrency in the coming months. However, Bitcoin is increasingly being framed as a hedge against inflation and a financial meltdown. If there is less confidence in traditional markets, demand for decentralized assets could grow. The relation between crypto and economic downturns isn't directly proportional, instead, it's an idea of safety during turmoil. This is to say that while moves from Buffett and economic shifts will not go unnoticed, Bitcoin might actually be resilient or thrive in the face of global sentiment and adoption trends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "November 15, 2024, 09:10:33 AM",
      "body": "Quote from: legiteum on November 14, 2024, 04:46:04 PMWarren Buffett is selling off stocks this year and hoarding USD. Why? He clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy. Clearly the majority in the US feels these changes will be good for them. But Mr. Buffett clearly doesn't. For an average American citizen, massive deportations will be good in terms that they'll have higher pay rate, better working conditions and more available jobs because migrants work like slaves but at the same time, there is a high chance that their deportation will increase the price on everything, so maybe the life of an average American citizen won't change for better but it's debatable.Quote from: legiteum on November 14, 2024, 04:46:04 PMMy own assumption is that it will be very negative for the price. Millions of individual Bitcoin/crypto investors will need to liquidate their holdings if they lose their jobs, or are afraid of losing their jobs. If inflation spikes, then interest rates will also spike, which will diminish economic growth, leading to mass layoffs--and everything Trump has promised will inevitably spike inflation (it remains to be seen if he will really do any of this though).Is there a bull case for digital currencies during a US economic downturn though? What do you all think?That's true, if millions of people lose their jobs, they'll be forced to sell their Bitcoin and altcoins because they need to eat something and if they don't have cash, then they need to convert their assets. Btw during bull run, even if you lose job, it's still hard to sell coins when you see how your asset's value increases. I think that whales will play a major role in Bitcoin's price again because from my understanding, average person would live a poor style instead of selling an asset that they see how it grows every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "November 15, 2024, 02:21:05 PM",
      "body": "Quote from: davis196 on November 15, 2024, 06:54:36 AMFor an average American citizen, massive deportations will be good in terms that they'll have higher pay rate, [...]It will only help your pay rate if you work in very specific industries, doing very specific things, like lower-end construction workers. Construction companies, as a whole, will do much worse since they will have to drastically raise prices, which will reduce demand, meaning they will sell fewer new homes.And fewer new homes means less sales of all kind of other goods that come with new home formation, etc. etc.And immigrant labor in the US also deeply affects the food industry, so grocery store prices will rise, and the hospitality industry, so restaurants and hotels will rise in price, which will affect the travel industry.In the longer run, the US will be a less friendly place to do business since our labor costs will be much higher. In short, like any government protectionism movement, this will be a positive thing for a small number of workers for a short period of time, but it will hurt everybody else immediately and weaken our economy in the long run.QuoteThat's true, if millions of people lose their jobs, they'll be forced to sell their Bitcoin and altcoins because they need to eat something and if they don't have cash, then they need to convert their assets. Btw during bull run, even if you lose job, it's still hard to sell coins when you see how your asset's value increases. I think that whales will play a major role in Bitcoin's price again because from my understanding, average person would live a poor style instead of selling an asset that they see how it grows every day.Um, the whales will get out long before ordinary people do  . Unlike ordinary people, they have a staff of economists to help them time the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 15, 2024, 03:18:56 PM",
      "body": "If Trump choose to deport immigrants, America is no longer America that people know.I've heard something like this, if non Europe live in Europe, you're an immigrant, but if non American live in America, you're an American.Quote from: legiteum on November 14, 2024, 04:46:04 PMIs there a bull case for digital currencies during a US economic downturn though? What do you all think?The crisis happened in 2007-2009 and 2019-2020, in early days, there's no way to know if US recession affect Bitcoin price, but in 2019-2020, corona virus did affect Bitcoin price, but it was happened not in bull run season, if covid happened in 2021, we can draw the conclusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 15, 2024, 03:26:23 PM",
      "body": "Quote from: Plaguedeath on November 15, 2024, 03:18:56 PMIf Trump choose to deport immigrants, America is no longer America that people know.As far as I know, Trump never claimed that he will get rid off immigrants, and instead illegal immigrants and there's a huge difference between those two. Quote from: Plaguedeath on November 15, 2024, 03:18:56 PMI've heard something like this, if non Europe live in Europe, you're an immigrant, but if non American live in America, you're an American.Never heard that one, but big difference between Europe and US is that if for example you are born in Europe by illegal immigrant parents, you don't automatically get citizenship (many never get it), while in US you will automatically get it once you are born there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "November 15, 2024, 03:39:44 PM",
      "body": "Quote from: legiteum on November 14, 2024, 04:46:04 PMWarren Buffett is selling off stocks this year and hoarding USD. Why? He clearly is expecting an economic downturn from Trump's tariffs and mass deportations. Americans have voted for massive changes to the US economy. Clearly the majority in the US feels these changes will be good for them. But Mr. Buffett clearly doesn't. Maybe he's right, or maybe he's wrong. We'll see. The question is, if he's right, what will a recession do to the price of Bitcoin?My own assumption is that it will be very negative for the price. Millions of individual Bitcoin/crypto investors will need to liquidate their holdings if they lose their jobs, or are afraid of losing their jobs. If inflation spikes, then interest rates will also spike, which will diminish economic growth, leading to mass layoffs--and everything Trump has promised will inevitably spike inflation (it remains to be seen if he will really do any of this though).Is there a bull case for digital currencies during a US economic downturn though? What do you all think?Am happy Trump won to begin with and if it is going to affect the prices of things or cause a recession, it remains to be seen. The Russia- Ukraine war and the Israel -Hamas war ceased upon his winning and that's a good sign that shows that the economy may get better with time. There's of course a bull run for cryptocurrencies because Trump's son also has a coin he is to launch with the support of his repentant father who now has renewed hope for Bitcoin and cryptocurrencies in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "November 15, 2024, 03:59:18 PM",
      "body": "Well, that’s how Warren Buffet point of view about having US recession and for me, everyone’s point of view is reasonable. But I believe seeing bitcoin’s high volatility, one thing is certain, bitcoin will definitely undergo price fluctuations based on its macroeconomic conditions or let’s say even the condition of the asset itself. It could go on an upward or downward position, but rest assured the effect will only be temporary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "November 15, 2024, 04:07:36 PM",
      "body": "QuoteMy own assumption is that it will be very negative for the price. Millions of individual Bitcoin/crypto investors will need to liquidate their holdings if they lose their jobs, or are afraid of losing their jobs. If inflation spikes, then interest rates will also spike, which will diminish economic growth, leading to mass layoffs--and everything Trump has promised will inevitably spike inflation (it remains to be seen if he will really do any of this though).The opposite might happen seeing Bitcoin as their source of income.  People losing jobs may redirect them to trading, and get more engaged with Bitcoin activities.  Rich people might find Bitcoin as safe haven for their declining US dollar purchasing power and might put their funds into Bitcoin just to preserve their wealth.Since the dollar purchasing power is declining, Bitcoin price might reach its new height since it will become more expensive as the dollars weaken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "November 15, 2024, 05:31:51 PM",
      "body": "In my opinion, you have formulated a very important question. It is very difficult to give a clear answer to this question. If the US recession is in 2025, when exactly will it start? In the middle of the year? Somewhere in May 2025? What will the price of Bitcoin be at that time? There are still six months until May 2025. During this time, the price of Bitcoin can double. From these levels, there can theoretically be a correction. At the same time, we cannot clearly answer whether a recession in the US will lead to an increase in the price of Bitcoin or to its fall. A recession in the US will definitely lead to a fall in oil prices and an economic catastrophe in countries such as Russia and other peripheral countries. The US will most likely suffer less than others. At the same time, the price of Bitcoin, as a rule, has an inverse correlation with the price of oil. Therefore, in the medium term, it may even grow (although short-term panic falls in the price of the first cryptocurrency are also possible).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 15, 2024, 06:45:33 PM",
      "body": "He is often right, but whatever he chooses to do is his choice. It was said he had already cashed out his stock holdings, but I don't think he has piles of cash at home or in his home vault. For someone who has been making money in trading, I think he already is into Bitcoin he can't just make it public.A rich guy like him would probably fly somewhere else if the recession comes, maybe he would turn his money to gold or invest in China stocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "November 16, 2024, 05:27:38 AMLast edit: November 16, 2024, 06:00:12 AM by asriloni",
      "body": "Warren is fearful when others are greedy, and he is greedy when others are fearful. Simple as that.Warren's just following his old philosophy when many are still euphoric after Trump's winner in US election, then he took advantage to sell his asset at peak. As for the recession impact to the Bitcoin, the recession will cause bitcoin's price to slip. It's obvious. I meant, during a recession, people will do anything for money. The best way is to sell bitcoin, their most liquid asset. It took a few seconds to exchange your bitcoin to cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 16, 2024, 06:20:06 AM",
      "body": "It's not a speculation anymore though, US has been experiencing recession for a couple of years now and in that duration we saw that it creates sell pressure on bitcoin preventing its rise. But that was not just US in recession, but most of the world was also in recession which meant the sell pressure was global and it caused the drops which is why bitcoin is still below $100k after all this time.In the future, more recession which they only would battle by increasing interest rates in the US, would similarly cause sell pressure and can affect the bull run.The only two other things to consider are:1) Will it be global? In your arguments, the recession is in US only and as long as it remains that way the impact on bitcoin is not going to be as big as it was before.2) Will there be inflation as well? All the deportation (firing bulk of US workforce) and the tariff war would create much higher inflation compared to the past couple of years in the US. We already know inflation positively affects bitcoin by increasing its price.On top of that we have dedollarisation going on and with Trump and his wars against their world (specially now that we have seen some of his cabinet members who are the biggest warmongers in America) we can be sure that dedollarisation will speed up which can lead to US dollar tanking hard.Obviously that means bitcoin price shooting up automatically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 16, 2024, 07:33:35 AM",
      "body": "Quote from: asriloni on November 16, 2024, 05:27:38 AMWarren's just following his old philosophy when many are still euphoric after Trump's winner in US election, then he took advantage to sell his asset at peak. Honestly, now is the wrong time to buy Bitcoin. Anyone who is buying now should've bought a month ago.Although, if you are looking to sell off some of your holdings to get some cash, now is a good time. I just sold about $500 worth of BTC. Zero regrets whatsoever. (And I still have a huge stash.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}