{
  "id": "topic_5429868",
  "title": "ncentrepreneur.investor",
  "author": "ncentrepreneur.investor",
  "created_time": "December 18, 2022, 01:59:49 AM",
  "content": "Can anyone tell me what the difference is between the cold card and other air gapped devices. I dont really get it. It has a secure element just like some others. I have currently a trezor and a ledger where I am considering a cold card, but dont understand why owning one is better than the other two. Secondly, When you go to the coinkite store to purchase 1 cold card, does it come with the cable, power adapter, and SD card? Or do you have to purchase those separately? The site is not clear. Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429868",
  "comments": [
    {
      "author": "Mbitr",
      "created_time": "December 18, 2022, 07:57:42 AM",
      "body": "Forum Member DireWolfM14 has done a very good review on the Mk4 ColdCard. If you have a look through the OP and some of the discussion, you should get most of your answers. Personally I’ve never used one , but good luck . Hope this helps  https://bitcointalk.org/index.php?topic=5405919.20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoinsFTW9",
      "created_time": "December 18, 2022, 08:10:11 AM",
      "body": "A cold card is a type of hardware wallet, which is a device that stores cryptocurrency keys offline in a secure manner. Like other hardware wallets, a cold card provides an additional layer of security for your cryptocurrency holdings by keeping the keys that control access to your coins in a physically separate and secure device.One key difference between the cold card and other hardware wallets is that it is designed to be an \"air-gapped\" device, which means it is physically isolated from the internet and other devices. This makes it more resistant to hacking attempts, as an attacker would need to physically access the device in order to compromise it.As for your question about purchasing a cold card from Coinkite, it appears that the cold card package includes the device, a micro-USB cable, a power adapter, and a microSD card. You can find this information on the Coinkite website by clicking on the \"In the Box\" tab on the product page for the cold card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "December 18, 2022, 02:24:20 PM",
      "body": "Quote from: Mbitr on December 18, 2022, 07:57:42 AMForum Member DireWolfM14 has done a very good review on the Mk4 ColdCard. If you have a look through the OP and some of the discussion, you should get most of your answers. Personally I’ve never used one , but good luck . Hope this helps  https://bitcointalk.org/index.php?topic=5405919.20Thanks so much. Helped a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "December 18, 2022, 04:39:47 PM",
      "body": "Quote from: ncentrepreneur.investor on December 18, 2022, 01:59:49 AMCan anyone tell me what the difference is between the cold card and other air gapped devices. I dont really get it. It has a secure element just like some others. I have currently a trezor and a ledger where I am considering a cold card, but dont understand why owning one is better than the other two. Secondly, When you go to the coinkite store to purchase 1 cold card, does it come with the cable, power adapter, and SD card? Or do you have to purchase those separately? The site is not clear. Thankscold cards are a form of hardware wallet that secures your coins for you. It us distinct from other wallets in a sense that these are supposed to be air-gapped, which means they are completely shut off the internet and would require to be physically present and active to even be accessed, unlik most cold wallets of today. Of course. This is a double-edged sword in a sense that it completely prevents remote hacking and secures your coins, but also means that if you lose it. You'd have to say goodbye to your coins. AFAIK most Cold Cards are bought along with its peripherals, so you should be good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 19, 2022, 08:10:37 AM",
      "body": "The device is called a COLDCARD, not a Cold Card.The homepage explains many things you need to know about this hardware wallet and contains links to other sources if you want to keep reading. If you want to buy this particular hw, you can use the promo code \"CKBTC\" to get a 5% discount if you pay with bitcoin. There might be other promo codes but this one pops up on the official site. Judging by https://store.coinkite.com/store/coldcard, the USB cable is not part of the package if you purchase the 1st option that just includes the COLDCARD Mk4 for $147. I find that very weird to be honest. I guess you have to buy it separately. They do have a Power-Only USB-C Cable for $17. I suggest you contact the support and ask them what the precise content of the shipped package is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 19, 2022, 06:29:21 PM",
      "body": "Quote from: Pmalek on December 19, 2022, 08:10:37 AMJudging by https://store.coinkite.com/store/coldcard, the USB cable is not part of the package if you purchase the 1st option that just includes the COLDCARD Mk4 for $147. I find that very weird to be honest. I guess you have to buy it separately. They do have a Power-Only USB-C Cable for $17. I suggest you contact the support and ask them what the precise content of the shipped package is.To be honest the power only cable is just a gimmick. You can simply connect your coldcard to any phone charger that is plugged in the wall. This will not make it possible for any virus to get on the coldcard and makes this power only cable useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 20, 2022, 07:59:57 AM",
      "body": "Quote from: hZti on December 19, 2022, 06:29:21 PMTo be honest the power only cable is just a gimmick. You can simply connect your coldcard to any phone charger that is plugged in the wall. The cables that get shipped together with mobile phones and are part of the package allow you to charge your phone and also to transfer data to/from it. So, they aren't usually charge-only type of cables. The power-only cables don't have the necessary pins to transfer data, and that's the type of cable that Coinkite sells. Your phone's cable most probably does. Someone paranoid about their security would prefer a cable that doesn't have data transfer pins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 21, 2022, 04:06:56 PM",
      "body": "Quote from: Pmalek on December 20, 2022, 07:59:57 AMThe cables that get shipped together with mobile phones and are part of the package allow you to charge your phone and also to transfer data to/from it. So, they aren't usually charge-only type of cables. The power-only cables don't have the necessary pins to transfer data, and that's the type of cable that Coinkite sells. Your phone's cable most probably does. Someone paranoid about their security would prefer a cable that doesn't have data transfer pins.   Yes, but my point is that you can just use a phone charger or a power bank to power the coldcard. There is no need to ever plug in the coldcard into your computer. Still it is nice that they offer this kind of cable for sale, as some users may have a use case for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "December 25, 2022, 01:06:23 AM",
      "body": "Quote from: ncentrepreneur.investor on December 18, 2022, 01:59:49 AMCan anyone tell me what the difference is between the cold card and other air gapped devices [emphasis mine].Besides the fact that indeed, hardware wallets all have the same basic purpose and solve it in a mostly equal way, there are a few differences like price, open source code, open hardware, codebase, secure chip, overall physical form factor and features, coin selection and - finally - air-gap.I would like to point out that the devices you already own are not airgapped by the typical definition. Since they connect (for power and communication) to your PC's USB port, there is a slight potential attack surface through that interface.Meanwhile, an airgapped hardware wallet can use a memory card (like in ColdCard) or a QR code (like in Passport) to communicate without a potentially compromised wired link. In my personal opinion, an airgap is quite valid to have, since the very purpose of a hardware wallet is to guard your coins from a potentially infected computer. With this risk assessment though, you should also assume the malware could access USB and mess with that.Quote from: Pmalek on December 19, 2022, 08:10:37 AMThey do have a Power-Only USB-C Cable for $17. That's funny; because the very, very, absolute freaking cheapest USB cables I own (that come with cheap electronics like mobile speakers) are power-only (thus root of frustration from time to time). You can get them from China starting from $0.07 USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "December 25, 2022, 03:38:51 AM",
      "body": "Quote from: hZti on December 21, 2022, 04:06:56 PMQuote from: Pmalek on December 20, 2022, 07:59:57 AMThe cables that get shipped together with mobile phones and are part of the package allow you to charge your phone and also to transfer data to/from it. So, they aren't usually charge-only type of cables. The power-only cables don't have the necessary pins to transfer data, and that's the type of cable that Coinkite sells. Your phone's cable most probably does. Someone paranoid about their security would prefer a cable that doesn't have data transfer pins.   Yes, but my point is that you can just use a phone charger or a power bank to power the coldcard. There is no need to ever plug in the coldcard into your computer. Still it is nice that they offer this kind of cable for sale, as some users may have a use case for it.Cool. If that’s all I need to power it than I should be good. We will just trial and error with cables I guess. Just trying to justify why I need one. I hear crap talked about ledger and a WHOLE bunch crap talked about trezor. I know that cold card is very advanced bitcoin only device. I just don’t know how it’s advanced or better. As far as what the $147 comes with so I just emailed coinkite to make sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 25, 2022, 07:41:21 PM",
      "body": "Quote from: ncentrepreneur.investor on December 25, 2022, 03:38:51 AM I know that cold card is very advanced bitcoin only device. I just don’t know how it’s advanced or better. The coldcard has a very basic but therefore well done code. This makes it very hard to exploit, but also there is no support for many features that other wallets may have. Especially it is missing the altcoin support and it is just a simple OLED display. Still it gets the job done very well which is the most important feature to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "December 25, 2022, 11:49:55 PM",
      "body": "Quote from: hZti on December 25, 2022, 07:41:21 PMQuote from: ncentrepreneur.investor on December 25, 2022, 03:38:51 AM I know that cold card is very advanced bitcoin only device. I just don’t know how it’s advanced or better. The coldcard has a very basic but therefore well done code. This makes it very hard to exploit, but also there is no support for many features that other wallets may have. Especially it is missing the altcoin support and it is just a simple OLED display. Still it gets the job done very well which is the most important feature to me.I have a response from coinkite. They said: Hi Danny,Happy to help! The Mk4 comes as a stand alone unit. You can purchase the power-only usb-c cable, micro SD, and 9V batter adapter from our website but they are all sold separately. If you have any further questions, feel free to ask.​Best regards,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "December 26, 2022, 02:50:43 PM",
      "body": "Quote from: ncentrepreneur.investor on December 25, 2022, 03:38:51 AMCool. If that’s all I need to power it than I should be good. We will just trial and error with cables I guess. Just trying to justify why I need one. I hear crap talked about ledger and a WHOLE bunch crap talked about trezor. I know that cold card is very advanced bitcoin only device. I just don’t know how it’s advanced or better. As far as what the $147 comes with so I just emailed coinkite to make sure. You shouldn't decide based on 'amount of crap told online'; read what people are actually criticizing and make a judgement, whether they are honest, truthful, justified.No one device is perfect; ColdCard isn't, either. For example, they pulled out of the open-source community, so nobody is legally allowed to use their code anymore, and some features are unnecessary attack surfaces (NFC, and the ability to enable USB data transfer), as well as lacking a camera that would allow you to securely use it with a phone.I do find Trezor Model One good value and quality for its price, and on the upper part of the price bracket I like my Passports. But please read actual reviews and don't base your opinion on 'crap talked'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "December 26, 2022, 03:15:51 PMLast edit: December 26, 2022, 10:16:37 PM by Mr. Big",
      "body": "Quote from: n0nce on December 26, 2022, 02:50:43 PMQuote from: ncentrepreneur.investor on December 25, 2022, 03:38:51 AMCool. If that’s all I need to power it than I should be good. We will just trial and error with cables I guess. Just trying to justify why I need one. I hear crap talked about ledger and a WHOLE bunch crap talked about trezor. I know that cold card is very advanced bitcoin only device. I just don’t know how it’s advanced or better. As far as what the $147 comes with so I just emailed coinkite to make sure. You shouldn't decide based on 'amount of crap told online'; read what people are actually criticizing and make a judgement, whether they are honest, truthful, justified.No one device is perfect; ColdCard isn't, either. For example, they pulled out of the open-source community, so nobody is legally allowed to use their code anymore, and some features are unnecessary attack surfaces (NFC, and the ability to enable USB data transfer), as well as lacking a camera that would allow you to securely use it with a phone.I do find Trezor Model One good value and quality for its price, and on the upper part of the price bracket I like my Passports. But please read actual reviews and don't base your opinion on 'crap talked'.I actually havent made a decision and the reason I am asking here. I am actually leaning against getting one. Im not solely relying on this forum and what people say on youtube. I'm asking for OPINIONS and differences here.As far as crap talked, I already own a ledger and trezor, so that point is mute. I just asked for opinions about the cold card and what could be better or worse than the two I already own. What makes it better or worse in your opinion? I am also researching other areas etc. I am familiar with what I SHOULDNT DO.Thanks all for your insight. Im going to just move on and stick with what I have already. There does not seem to be such a huge benefit to owning one vs the headache and price point. I may or may not revisit it later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "December 27, 2022, 06:47:53 PM",
      "body": "Quote from: ncentrepreneur.investor on December 26, 2022, 03:15:51 PMWhat makes it better or worse in your opinion?I already answered that above:Quote from: n0nce on December 25, 2022, 01:06:23 AMQuote from: ncentrepreneur.investor on December 18, 2022, 01:59:49 AMCan anyone tell me what the difference is between the cold card and other air gapped devices [emphasis mine].Besides the fact that indeed, hardware wallets all have the same basic purpose and solve it in a mostly equal way, there are a few differences like price, open source code, open hardware, codebase, secure chip, overall physical form factor and features, coin selection and - finally - air-gap.I would like to point out that the devices you already own are not airgapped by the typical definition. Since they connect (for power and communication) to your PC's USB port, there is a slight potential attack surface through that interface.Meanwhile, an airgapped hardware wallet can use a memory card (like in ColdCard) or a QR code (like in Passport) to communicate without a potentially compromised wired link. In my personal opinion, an airgap is quite valid to have, since the very purpose of a hardware wallet is to guard your coins from a potentially infected computer. With this risk assessment though, you should also assume the malware could access USB and mess with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "December 28, 2022, 04:00:41 AM",
      "body": "Quote from: ncentrepreneur.investor on December 26, 2022, 03:15:51 PMI actually havent made a decision and the reason I am asking here. I am actually leaning against getting one. Im not solely relying on this forum and what people say on youtube. I'm asking for OPINIONS and differences here.As far as crap talked, I already own a ledger and trezor, so that point is mute. I just asked for opinions about the cold card and what could be better or worse than the two I already own. What makes it better or worse in your opinion? I am also researching other areas etc. I am familiar with what I SHOULDNT DO.I've been enjoying the ColdCard, and I wouldn't hesitate to recommend one.  The price being roughly twice that of a Trezor One requires an assessment of the ColdCards additional features, and determining if they're worth the value.  That's really a personal decision.  As for an air-gapped hardware wallet, it's been working great for me and I've gotten some use out of the additional seed and private key features.  It's really quite a sophisticated device, despite having some real world flaws.And you should take the debate about the licensing with a grain of salt as well.  The source code is transparent and available for review, but the licensing prohibits others from profiting from it or using it in a competing device, hence \"not open-source.\"I've used a few brands of hardware wallets, including both models offered by Trezor, and so far I have to say the ColdCard is my favorite.  I did receive a Foundation Passport a few days ago, but I haven't fired it up yet.  I wouldn't be surprised if the Passport becomes my new favorite, but again one needs to evaluate the value of any wallet he chooses.  My problem is that I have the \"collecting\" bug, so the more the merrier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "December 28, 2022, 04:11:52 AM",
      "body": "Quote from: DireWolfM14 on December 28, 2022, 04:00:41 AMQuote from: ncentrepreneur.investor on December 26, 2022, 03:15:51 PMI actually havent made a decision and the reason I am asking here. I am actually leaning against getting one. Im not solely relying on this forum and what people say on youtube. I'm asking for OPINIONS and differences here.As far as crap talked, I already own a ledger and trezor, so that point is mute. I just asked for opinions about the cold card and what could be better or worse than the two I already own. What makes it better or worse in your opinion? I am also researching other areas etc. I am familiar with what I SHOULDNT DO.I've been enjoying the ColdCard, and I wouldn't hesitate to recommend one.  The price being roughly twice that of a Trezor One requires an assessment of the ColdCards additional features, and determining if they're worth the value.  That's really a personal decision.  As for an air-gapped hardware wallet, it's been working great for me and I've gotten some use out of the additional seed and private key features.  It's really quite a sophisticated device, despite having some real world flaws.And you should take the debate about the licensing with a grain of salt as well.  The source code is transparent and available for review, but the licensing prohibits others from profiting from it or using it in a competing device, hence \"not open-source.\"I've used a few brands of hardware wallets, including both models offered by Trezor, and so far I have to say the ColdCard is my favorite.  I did receive a Foundation Passport a few days ago, but I haven't fired it up yet.  I wouldn't be surprised if the Passport becomes my new favorite, but again one needs to evaluate the value of any wallet he chooses.  My problem is that I have the \"collecting\" bug, so the more the merrier.  Thanks a bunch",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}