{
  "id": "topic_5472504",
  "title": "Hewlet",
  "author": "Hewlet",
  "created_time": "November 01, 2023, 09:46:56 PM",
  "content": "When I look at the concept of buying a crypto asset at the time its value is low and holding on to it till the time its value appreciates, I try to relate it to the business structure in our country and look at applicability in making a huge profit from some of our materials and resource that experience a serious increase in price at a certain time of the year and later experience a dramatic drop in price at other seasons of the year.If you look at red oil for instance, around February, most of the palm fruits will become ripe and this will result in excess oil in the market and will lead to a sharp drop in the price of red oil in the market. After that period, there is always a dramatic and sharp increase in the price of red oil, and within some weeks you will experience some sort of scarcity.  If you understand the applicability of Dip in this context, and you make the wise decision of buying a lot of the red oil at a price drop; during the period of scarcity, you should be able to sell it for twice the amount you bought it which is a great investment strategy.This applies to so many businesses that experience change in prices like 1. Stocking up your shop with jeans and sneakers before xmass so when the price of these items goes up, you can make a great profit from then2. Almost every December the price of fuel goes up very much, we can study the change in these prices and know when to buy and hold those items to make a profit at a later time.There are so many other local items and assets that experience such change at price at different times of the yearThe purpose of this thread is to identify and analyze those items and assets we can buy at the point of it decrease in price and hodl them till they experience a price increase and then we can sell them so that way, our knowledge on holding bitcoin becomes also very useful in another area of our daily lives. I Will appreciate your input on this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472504",
  "comments": [
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 01, 2023, 10:50:38 PM",
      "body": "OP, why are you so convinced that this is a strategy that is not already in place? The thing is just that most of those traders, market men and women, are already using this strategy, but they might not know what they are doing is simply buying the dip and hoarding. There are also some educated businessmen and women who also know what it really is. For example, we have some seasonal traders, who might not really be full-time traders; they only trade during periods when the products they are selling become so scarce and in high demand that they will begin to bring those products from their storehouse, which they have been hoarding for months. OP, this strategy is already on the open market. Rice is one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "November 01, 2023, 11:10:19 PM",
      "body": "We have some women area my resident who always come to me for financial advice,  most of them are into gold business,  that is they buy jewelries and at some point sell it off when the price of the gold juweries increase on decrease,  depending. What I discovered about those women is that,  while they are thinking and planning to sell off all the golds one day and start up a business,  it never occurred to them that what they were doing was already a lucrative business,  that tended to withstand inflation and most secured form of business in this part of the world,  so what I did for them is to educate them on the importance of long term hiding of those gold case,  since it doesn't expire or perished just like other goods in the market. You will see this woman always checking the price of gold each day and they rush to buy at a discount price whenever the market crashes which doesn't take long before it recovers back again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 02, 2023, 01:21:13 AM",
      "body": "Buying of goods and holding is not for any kind of business. This strategy is not good for perishable goods or goods that has expiry date. Most of our shops in Nigeria has tons of expire product which increase on daily basis. And is harmful and poisonous to health. Apart from Bitcoin what else I see that has the function is Gold/juweries just like @wiwo said Although its not that I don't buy the idea. but not all goods can be preserve for so long if not you run out if shortage because materials things depreciate in value. Let's take for example in Nigeria we believe in new trending thing, now you bought clothes earlier before December and a new trending clothe pops up every body start going for the new one, you will definitely run at lost because they will price down on your goods and you will have no option than to sell it. So in considering buying dip and hold consider this factor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 02, 2023, 05:46:26 AM",
      "body": "Op thank you very much to carry this kind matter come board, this thing wey you talk na wattin dey play almost every day for area, for I dey stay  we get enough ogbolor trees and within the period of April, may,june and july na so you go see plenty people wey dey go find the one wey don fall for ground around 5:00am after dem don do everything dem go dry am, den store am for the rainy season and dry season till e go reach those month of harvest again, and once e don pass e season markter don add price on top to show scarcity, another one wey dey and I for like make person wey get money go into na buying of land, land na of the natural asset wey I no say if you buy am today sell am tomorrow the price no be thesame, the more developed the place dey na the more the land dey cost, person wey buy land for bush and after 3 years when development don reach that side the price of that land fit give you x2 of watin you take buy am sef.But I go like advise say any product wey get too many competition and wey dey likely to get frequent update for market nor follow oo, nor too reason dem because dem their price dey always tend to go down rather than to go up example na phone, car, TV, etc. If the country nor dey suffer better inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "November 02, 2023, 09:03:23 AM",
      "body": "Maybe you should know this first that when talking about the strategy of buying the dip and holding it, it may not applies to using fiat currency because it does not appreciate when you hold it, especially considering the naira currency that is depreciating daily over USD, we are talking about bitcoin in this content, whereby you made an investment in cryptocurrency and you target buying the dip and holding till when you realized a surge in the market before releasing, when we are adopting such with the way we run our normal business and local commodities now then nothing will comes out of it than loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "November 02, 2023, 10:38:17 AM",
      "body": "Op the idea you isn't a bad one only that there are traders that are before now using this business strategy to gain profit, in fact there are people that specialized in this form of business buying at a lower price when the demand is low, hoarding it waiting for the period when the demand is high and the product are scarce to start selling in exorbitant prices, and one of such commodities I know of is the palm oil op mentioned.But on my own thought I want to narrow this op idea to the festive season (Christmas) we are about to enter weeks from now, at that period from 2nd week of December we usually experience high prices of goods and services the increment are almost x2. Hence, if anyone right now has the money available they can start preparing ahead of that time buy now that the prices are still minimal in the increment. You can buy and stock ahead commodities like palm/groundnut oil, packets of maggi, spices, and a bag of rice now around 48k so imagine how much it will be sold by Christmas period. Moreso you can meet poultry farming owners around your area and pay for a live chicken now ahead of the Christmas period and by Christmas you can go get your live chicken with a very significant difference in with the December price and that of this period. All of these are part of the strategy of buying the dip in our everyday life plan it not only patterns to bitcoin alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 02, 2023, 03:19:55 PM",
      "body": "Quote from: Doan9269 on November 02, 2023, 09:03:23 AMwhen we are adopting such with the way we run our normal business and local commodities now then nothing will comes out of it than loss. If you are equating bitcoin hodling to other local goods, I think bitcoin dip is more profitable. The profit margin of bitcoin is not going to be the same with local goods because inflation will not affect bitcoin but when dealing with fiate, you are most likely to encounter reduced value in your purchasing power. Moreover, hodling bitcoin has a long time benefit.Well more seriously about the local product dip that op raised, I think economically it is not helping the system. Price control board should be rejuvenated to put some action in mitigating on price increase in off and on season because you see that causing hyperinflation in the economy after every year. Government also need to do something to create preservative mechanism so that even perishable goods can be helped to sustain to atleast 6 months after an on season. I believe this is why food is not a major need in foreign country because they are preserved either by blending and packaging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 02, 2023, 05:52:31 PM",
      "body": "Quote from: Hewlet on November 01, 2023, 09:46:56 PMThe purpose of this thread is to identify and analyze those items and assets we can buy at the point of it decrease in price and hodl them till they experience a price increase and then we can sell them so that way, our knowledge on holding bitcoin becomes also very useful in another area of our daily lives. I Will appreciate your input on this.Op bitcoin has nothing to do the topic and this is purely for economic thread. And what you said is very far from bitcoin buying and hodling. Okay look at it now, has a palm oil sell you can't buy palm oil and store in your house until the price appreciate definitely the Palm Oil will have issue so you have to sell it within days and weeks. The same thing with fuel. If you buy fuel now where will you keep it as a retailer and knowing well that people will steal it if not properly kept.Buying jeans trousers and sneakers and store them in your shop and only sell them at the time of high price is not a business man. And that is why before you go into those business you have to calculate the risk involved. In those business whenever you come and environmental met you, you must pay their levy or due and they are many on the street so how much will you gain? So in such businesses you don't have to hodle your goods like that. Bitcoin investment is very much far from what you are trying to say. I know that you are trying to narrow your story to bitcoin but they are of different categories. You hodle bitcoin in a secure place (wallet) where the fear of fire outbreak, arm robbering and the fear of the unknown is not found. Those business men use the profit from the business to buy food stuff and eat so if they hodle for a long time, their survival is at stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 02, 2023, 08:00:52 PM",
      "body": "Quote from: Mate2237 on November 02, 2023, 05:52:31 PMQuote from: Hewlet on November 01, 2023, 09:46:56 PMThe purpose of this thread is to identify and analyze those items and assets we can buy at the point of it decrease in price and hodl them till they experience a price increase and then we can sell them so that way, our knowledge on holding bitcoin becomes also very useful in another area of our daily lives. I Will appreciate your input on this.Op bitcoin has nothing to do the topic and this is purely for economic thread. And what you said is very far from bitcoin buying and hodling. Okay look at it now, has a palm oil sell you can't buy palm oil and store in your house until the price appreciate definitely the Palm Oil will have issue so you have to sell it within days and weeks. The same thing with fuel. If you buy fuel now where will you keep it as a retailer and knowing well that people will steal it if not properly kept.Buying jeans trousers and sneakers and store them in your shop and only sell them at the time of high price is not a business man. And that is why before you go into those business you have to calculate the risk involved. In those business whenever you come and environmental met you, you must pay their levy or due and they are many on the street so how much will you gain? So in such businesses you don't have to hodle your goods like that. Bitcoin investment is very much far from what you are trying to say. I know that you are trying to narrow your story to bitcoin but they are of different categories. You hodle bitcoin in a secure place (wallet) where the fear of fire outbreak, arm robbering and the fear of the unknown is not found. Those business men use the profit from the business to buy food stuff and eat so if they hodle for a long time, their survival is at stake. i know that the concept of buying our local goods and resource at the point when it price is low and reselling it when it price goes up doesn't necessarily work exactly the same way as buying a crypto asset and holding on to it. They all have differences and limitations as you rightly pointed out. What I'm trying to say is that with the knowledge of how effective holding on to crypto assets can be, if you apply it rightly in the context I analyzed in my post, it will bring profit. And the reason I brought the topic to the local board is that the goods I mentioned are goods that are peculiar to us and since we don't have the section of economy in our local board yet, it's best I share it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "November 03, 2023, 02:52:21 PM",
      "body": "Quote from: Hewlet on November 01, 2023, 09:46:56 PMThere are so many other local items and assets that experience such change at price at different times of the yearThe purpose of this thread is to identify and analyze those items and assets we can buy at the point of it decrease in price and hodl them till they experience a price increase and then we can sell them so that way, our knowledge on holding bitcoin becomes also very useful in another area of our daily lives.Nobi here you go get that information well as most of us no get that information but na to enter market and find those wey dey into those businesses and dem go show you way. There are alot of things that are profitable to buy when it isn't the festival period yet and when December come you go begin sell them for better profits. One of those things na to sell festive decorations that are use for Christmas and New year but you need dey sure by doing your research properly so you no go buy design wey dun dey outdated although e get some designa wey be say no matter which new design come dey always be part of the Christmas design so you go buy dem when dem no cost and sell dem costly doing the Christmas period.You fit also buy rice or fowl and train dem for the Christmas. When no be Christmas dis things no dey cost like dat but immediately Christmas reach dem go begin cost due to their high demand. Anything though wey you wan use the Hodling strategy take run, make sure you dun do research wella because na one of the things wey dey make business dey successful be dat (correct research).Quote from: Mate2237 on November 02, 2023, 05:52:31 PMBitcoin investment is very much far from what you are trying to say. I know that you are trying to narrow your story to bitcoin but they are of different categories. You hodle bitcoin in a secure place (wallet) where the fear of fire outbreak, arm robbering and the fear of the unknown is not found. Those business men use the profit from the business to buy food stuff and eat so if they hodle for a long time, their survival is at stake.They're not entirely different, the concept of Hodling can be applied the same to all businesses dat it favors or assets. When you hold your Bitcoin, you have to protect it securely and you fit still do the same to the goods wey you buy and obviously oil no be perishable goods wey go spoil and bring you loses. Clothes too no be perishable goods but the disadvantages wey dey here na say you fit buy clothes earlier but by December dem dun go out of style and those na the risk you have to consider before trying to hodl cloths. When you HODL you need get other sources of business wey go sustain you and same apply for Bitcoin and other business or assets wey you fit hodl to make profits. This topic isn't a bad one, because I sabi people wey dey do this holding business things and making it but it mostly works for things wey no dey perishable and can't go out of style.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "November 03, 2023, 05:53:05 PM",
      "body": "Wetin you talk na true, this Bitcoin market approach of buying the dip and hodl na something wey also dey applicable for our businesses. Market dey come in seasons and a good businessman or business woman dey use the opportunity when goods dey surplus and cheap to buy and stock for their shops, because them know say e get the time when e go dey scare and because them been buy am very cheap them go make better profit. The setback wey dey for this method be say sometimes people no dey get money to buy and stock goods for their shops. Also you no go fit apply this method for business wey involve perishable goods because no matter how you try to preserve am e go spoil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 03, 2023, 07:57:30 PM",
      "body": "OP. You get good point but this you points nah for business men and women, the be say, as a business pipo way them be, them self dey apply those strategies for their businesses. The important thing be say, if anybody won stock any product for long time, nah for the person to find any products way no go quick expire or make I say products way go quick spoil because if any of those things way the business man or woman stock con spoil, the person go run at big lose, sha all those ones follow for the business risk way them dey talk about. Now, talking about wears as you mentioned, as days passes by, new things are been produced, some of the cloths that the seller might keep to sell in months time might get old or older and buyers will likely to buy new product and also, no body will buy the old stock unless it is only average ones that can just buy them or you might sell them at a low price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}