{
  "id": "topic_5436173",
  "title": "MCL.io",
  "author": "MCL.io",
  "created_time": "January 20, 2023, 08:40:24 PM",
  "content": "Hello everyone your feedback is highly helpful.Let me first explain why I chose the way of casinos to operate this project.Let's look at some products in MCL .   LicenseIf an operator of an online casino or sportsbook wants to do everything legally and “by the book,” then they must get licensed. Licensing allows casinos to operate legally and under regulation from a regulatory body of the jurisdiction they are registered at. While regulations place many burdens on operators, in the end, the benefits of being legal and legit far outweigh both the costs and the legal limitations imposed. That’s why our casino is different from  other casinos.you can join us for more  https://www.mcl-token.io/ https://discord.gg/kd4cM5xF https://t.me/macaucasinolisboa",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436173",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "January 20, 2023, 11:30:10 PMLast edit: January 21, 2023, 02:19:54 PM by coin-investor",
      "body": "Quote from: MCL.io on January 20, 2023, 08:40:24 PMHello everyone your feedback is highly helpful.Let me first explain why I chose the way of casinos to operate this project.Let's look at some products in MCL .   LicenseIf an operator of an online casino or sportsbook wants to do everything legally and “by the book,” then they must get licensed. Licensing allows casinos to operate legally and under regulation from a regulatory body of the jurisdiction they are registered at. While regulations place many burdens on operators, in the end, the benefits of being legal and legit far outweigh both the costs and the legal limitations imposed. That’s why our casino is different from  other casinos.you can join us for more  https://www.mcl-token.io/ https://discord.gg/kd4cM5xF https://t.me/macaucasinolisboaI would like to correct some of the things that are on your thread, your website link is not working you did not use the right code to open the link correctly, second, your casino has no advantage over all the other casinos just because you have a license, your license only proved that you are compliant but when it comes to reputation and features you have no advantage in fact yours is inferior from all the top casinos in the industry.And the way you present your casino to us is not even professional it lacks some of the most important points, you only mentioned license other than that, nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 21, 2023, 01:34:05 AM",
      "body": "So is this a promotional thread from what I can see. In that case, I believe you need a bit more attention to details to catch the attention of people here, OP.Also, why would you even mention the licensing as special feature of the casino you are promoting?There are already many reputable casinos which people gamble on, which are properly registered. So does not make sense.Or am I missing something?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "January 21, 2023, 02:19:15 AM",
      "body": "If this is an ANN thread for your casino, you should be able to manage it properly and not just leave it after creating a thread.How about KYC? Are there certain requirements for a gambler, be it a small or big gambler?It may be true that you should provide more information for your site so we can understand it better.Maybe you need to improve your site because I noticed that there are scrolls that you don't need to show.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "January 21, 2023, 04:48:24 AM",
      "body": "Quote from: coin-investor on January 20, 2023, 11:30:10 PMQuote from: MCL.io on January 20, 2023, 08:40:24 PMHello everyone your feedback is highly helpful.Let me first explain why I chose the way of casinos to operate this project.Let's look at some products in MCL .   LicenseIf an operator of an online casino or sportsbook wants to do everything legally and “by the book,” then they must get licensed. Licensing allows casinos to operate legally and under regulation from a regulatory body of the jurisdiction they are registered at. While regulations place many burdens on operators, in the end, the benefits of being legal and legit far outweigh both the costs and the legal limitations imposed. That’s why our casino is different from  other casinos.you can join us for more  https://www.mcl-token.io/ https://discord.gg/kd4cM5xF https://t.me/macaucasinolisboaI would like to correct some of the things that are on your thread, your website link is not working you did not use the right code to open the link correctly, second, your casino has no advantage over all the other casinos just because you have a license, your license only proved that you are compliant but when it comes to reputation and features you have no advantage in fact yours is inferior from all the top casinos in the industry.And the way you present your casino to us is not even professional it lacks some of the most important points, you only mentioned license other than that, nothing. @coin-investor looks like you also misplaced your \"quote\". me too when I click on the link above it doesn't work and when I see it turns out the OP is using the \"ftp\" code I don't know what code it ismaybe he meant something like this :https://www.mcl-token.io/https://discord.gg/kd4cM5xFhttps://t.me/macaucasinolisboafor OP, if indeed this is an ANN thread that will become a promotion at a later date, it would be better if you stay active and manage your thread and answer all the questions that arise.and it seems like you don't need to mention about the license without clearer details that everyone here can easily understand.I hope you can update after reading some of the other members' suggestions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "January 21, 2023, 06:47:24 AM",
      "body": "I've read this thread several times and I was actually trying to find what was really spectacular about your casino bit nothing other than a license which almost every other legit casino posses because it's a necessity.Judging from all you've said, it seem that your post is more of a promotion and I would advice that you get a copper membership and a better graphics designer to help get you guys a nice design and Ann thread as well and I also want to remind you which I'm sure you already know that the gambling industry is a very competitive one and there are other very reputable casinos out that and a claim of superiority with just a license isn't fair. Just bursting balls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "January 21, 2023, 10:07:51 AMLast edit: January 21, 2023, 10:27:39 AM by Daltonik",
      "body": "Quote from: MCL.io on January 20, 2023, 08:40:24 PMHello everyone your feedback is highly helpful.Let me first explain why I chose the way of casinos to operate this project.Let's look at some products in MCL .   LicenseIf an operator of an online casino or sportsbook wants to do everything legally and “by the book,” then they must get licensed. Licensing allows casinos to operate legally and under regulation from a regulatory body of the jurisdiction they are registered at. While regulations place many burdens on operators, in the end, the benefits of being legal and legit far outweigh both the costs and the legal limitations imposed. That’s why our casino is different from  other casinos.you can join us for more  https://www.mcl-token.io/ https://discord.gg/kd4cM5xF https://t.me/macaucasinolisboaWelcome to the forum. The registration bonus of 100 credits is good for trying to play. But it seems to me that your online casino has a complete look, otherwise how can you explain such a non-friendly interface, the interface language selection column is not conveniently located, it would be better to make it pop-up and the overall background of the site is too bright.upd: In addition, it is difficult to exit at least some slots, it is not possible to return to the main page from \"All lucky clovers 100\", the registration bonus is 1000 credit , I apologize for the mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "January 21, 2023, 11:20:58 AM",
      "body": "Haven't signed up so far due to some doubts. The orientation of the site is not very clear to me, I think it's not just a casino service.- domain name selection, I thought at first it just belonged to an altcoin project that was raising funds- provide links to own token trading in third party apps as main menu.- provides a menu to a blockchain network that looks foreign.- can you provide some links to the partner sites on the list (other than game providers) that they are partnering with your company?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "January 21, 2023, 01:59:17 PM",
      "body": "If you're trying to introduce a new site here, better to do it the proper way and seek for some advices when it comes to promotions. I thought this is a physical casino located in Macau, but it turns out this is a gambling site.I agree with getting the license but it can't guarantee a good site, so better to give more details here especially with the highlights of that platform and what's unique about that platform aside from its license since most of the crypto casinos have it already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "January 21, 2023, 02:33:03 PM",
      "body": "Hopefully, @OP can come back here and answer all our questions. I haven't tried registering yet and am waiting for @OP to come back and explain more.And after I visited the casino, I saw that some designs still needed to be fixed and maybe rearranged to make them look neater and nicer. This is important to show that the casino is ready to provide services to its users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "January 21, 2023, 02:44:31 PM",
      "body": "When you opened an announcement for your casino and you are overwhelmed with questions, suggestions, and feedback and you prefer not to answer even though you log in, this will make the casino look back and not worth looking at, OP should keep up and be active here even if the feedbacks are not positive, the feedbacks are meant to correct those bugs, issues so you can run a good campaign here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "January 21, 2023, 03:31:05 PM",
      "body": "You barely gave us anything to work with in terms of why we should choose your platform, let alone a reason why we should switch with the ones we have already got accustomed with. Licensing? really? we literally have a lot of reputable casinos out here with licenses that could vouch for themselves, I don't think having a license sets you apart from the main competitors in the market. I do think you need a lot when it comes to promotions, as well as setting people's expectations because just posting something like that here won't do, it even makes your site suspicious if I do say so myself. A lot of good peeps here can put you up with a campaign organizer that could help you promote your project, you should try that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "January 21, 2023, 03:38:29 PM",
      "body": "Quiet confused if OP is a review site or they operate this platform.Let's just wait for OP to comeback here and update us with our queries which I agree on most of the concern here.Having you license is a good start and highlighting it can consider as one of the reason on choosing a good gambling site, the next questions will matter on their platform itself and their terms and regulations. As we know, if there's a license most probably that site will ask for KYC so better to confirm this one as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "January 21, 2023, 03:39:30 PM",
      "body": "Quote from: MCL.io on January 20, 2023, 08:40:24 PMHello everyone your feedback is highly helpful.Let me first explain why I chose the way of casinos to operate this project.Let's look at some products in MCL .   LicenseIf an operator of an online casino or sportsbook wants to do everything legally and “by the book,” then they must get licensed. Licensing allows casinos to operate legally and under regulation from a regulatory body of the jurisdiction they are registered at. While regulations place many burdens on operators, in the end, the benefits of being legal and legit far outweigh both the costs and the legal limitations imposed. That’s why our casino is different from  other casinos.you can join us for more  https://www.mcl-token.io/ https://discord.gg/kd4cM5xF https://t.me/macaucasinolisboawelcome to this forum. your post seems promotional post. so you should muve your topic to Gambling  Gambling discussion is not right section for promoting any site. Here only different types of gambling and sports are discussed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 21, 2023, 04:53:16 PM",
      "body": "Quote from: MCL.io on January 20, 2023, 08:40:24 PMHello everyone your feedback is highly helpful.Let me first explain why I chose the way of casinos to operate this project.Let's look at some products in MCL .   LicenseIf an operator of an online casino or sportsbook wants to do everything legally and “by the book,” then they must get licensed. Licensing allows casinos to operate legally and under regulation from a regulatory body of the jurisdiction they are registered at. While regulations place many burdens on operators, in the end, the benefits of being legal and legit far outweigh both the costs and the legal limitations imposed. That’s why our casino is different from  other casinos.you can join us for more  https://www.mcl-token.io/ https://discord.gg/kd4cM5xF https://t.me/macaucasinolisboaIt is advisable for you to first learn how to be able to promote a casino site before you do a promotion but it is not in accordance with promotions in general.If the promotion you are doing is like this instead of other members who are interested in joining but instead they will bully you because your review in doing the promotion is not right.My advice is that it is better for you to employ forum members who already know and understand in promoting a casino site and I'm sure there will be many forum users who want to do this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darewaller",
      "created_time": "January 22, 2023, 05:58:56 PM",
      "body": "Quote from: traderethereum on January 21, 2023, 02:19:15 AMIf this is an ANN thread for your casino, you should be able to manage it properly and not just leave it after creating a thread.How about KYC? Are there certain requirements for a gambler, be it a small or big gambler?It may be true that you should provide more information for your site so we can understand it better.Maybe you need to improve your site because I noticed that there are scrolls that you don't need to show.You're right it looks like an ann thread so this should fit better on this> https://bitcointalk.org/index.php?board=56.0 board. He shouldn't worry as it is still related to gambling but he will only get more exposure there and proper replies. And as you said, he might also need to add more details and then he needs to attach some pictures for it to look appealing.Casino owners shouldn't underestimate these things because this is where it all starts. A bad impression about these can lead for a loss of client. Even though the OP didn't mention anything yet about the KYC, I think it's clear that the casino requires it because he said it was regulated and then it was also licensed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "January 22, 2023, 06:15:51 PM",
      "body": "Well, the mods can actually just close this thread... because it was actually just created for extra exposure and not to discuss the advantages of licensing a casino.    OP, just created this thread to draw some attention to their casino and not to interact with the gambling community to discuss this issue. (He created 2 posts and never responded to any of them) I actually do not care if a casino are regulated or not.... because the licenses do not offer assistance and protection to gamblers, if they have issues with those casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}