{
  "id": "topic_5451290",
  "title": "Onyeeze",
  "author": "Onyeeze",
  "created_time": "May 05, 2023, 08:06:26 AM",
  "content": "Every day I think almost twice a day and I began to ask myself if imagination can be real? At first I will be having the mindset of positive thinking and sometimes I see those thoughts as negative one, one day I seat alone and began to ask myself that what is the way people who made money and who are firm started their life and what role did this people play before they make money, if I should follow the method some people can I arrive to same point with them, and after sometime my instinct derive me to another point by saying not everyone will scale true through one root, do you know that I'm devastated concerning investing sufficiently in cryptocurrency or using fiat currency to invest in something that will continue to give me fiat. Already I have other investment's but I'm pushing in a direction that will give me more fund's so that I will not deviate to get what I want. Can imagination of thinking big come pass. Theirs one edge we use in my area, cut your Coat according to your size. meaning, do things in a way it will not affect you or bother you.If here is not the rightful place to post this, mod can help to place it to the appropriate place.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451290",
  "comments": [
    {
      "author": "Rupok",
      "created_time": "May 05, 2023, 08:52:47 AM",
      "body": "Dreams seen in sleep cannot be realized but imaginations can be made real. But to realize the imagination, you have to make yourself that way. Every person imagines how people earn money.But it will not happen if you just stay with imagination. He has to work hard to realize his vision with determination. Many people are making money by investing in cryptocurrencies. After all, no imagination can be realized without money.If someone thinks that his imagination will come true then he can invest in Bitcoin, because many people have realized their  imagination in Bitcoin investment. Most depressed people love to imagination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "May 05, 2023, 10:14:08 AM",
      "body": "Quote from: Onyeeze on May 05, 2023, 08:06:26 AMEvery day I think almost twice a day and I began to ask myself if imagination can be real? At first I will be having the mindset of positive thinking and sometimes I see those thoughts as negative one, one day I seat alone and began to ask myself that what is the way people who made money and who are firm started their life and what role did this people play before they make money, if I should follow the method some people can I arrive to same point with them, and after sometime my instinct derive me to another point by saying not everyone will scale true through one root, do you know that I'm devastated concerning investing sufficiently in cryptocurrency or using fiat currency to invest in something that will continue to give me fiat. Already I have other investment's but I'm pushing in a direction that will give me more fund's so that I will not deviate to get what I want. Can imagination of thinking big come pass. Theirs one edge we use in my area, cut your Coat according to your size. meaning, do things in a way it will not affect you or bother you.If here is not the rightful place to post this, mod can help to place it to the appropriate place.What you focus on you will get. Once you know the power of your words, you will not just say anything. If you know the power of your presence, you will not go just anywhere. I also believe in the same thing, if you are persistent enough to do what you know you should be doing while maintaining your faith that if you do it long enough, you will get what you want in life.I would say not to get discouraged by momentary failure. You might get devastated concerning investing sufficiently but if you continue implementing your system consistently, you will get what you want.Be patient enough for the right opportunity to show up. Don't compare yourself to those whose already successful because you have different timelines and opportunities ahead.Just continue to do things in a way it will not affect you or bother you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gaston castano",
      "created_time": "May 05, 2023, 10:30:56 AM",
      "body": "In terms of following the methods of successful people, it can be helpful to learn from their strategies and experiences, but it's essential to recognize that everyone's journey is unique. What works for one person may not work for another, so it's important to find your own path and approach that aligns with your values and goals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "May 05, 2023, 10:50:20 AM",
      "body": "There are some things have seen in my dreams that became reality and there are some imagination that I had and it became a reality, some times you have to dream or imagine something before you can bring them to reality, if you can imagine something you can make a reality out of your imagination, this is the power of humans but people underestimate the power involved in imagination. A dream is just a dream though if you don't do anything about it, most times when we are on the right path we will see ourselves doing many great things in dreams and later it becomes a reality, that's why we always need to pursue our dreams.Do not be a dreamer who only knows how to dream.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 05, 2023, 11:20:47 AM",
      "body": "Quote from: Onyeeze on May 05, 2023, 08:06:26 AMEvery day I think almost twice a day and I began to ask myself if imagination can be real? At first I will be having the mindset of positive thinking and sometimes I see those thoughts as negative one, one day I seat alone and began to ask myself that what is the way people who made money and who are firm started their life and what role did this people play before they make money, if I should follow the method some people can I arrive to same point with them, and after sometime my instinct derive me to another point by saying not everyone will scale true through one root, do you know that I'm devastated concerning investing sufficiently in cryptocurrency or using fiat currency to invest in something that will continue to give me fiat. Already I have other investment's but I'm pushing in a direction that will give me more fund's so that I will not deviate to get what I want. Can imagination of thinking big come pass. Theirs one edge we use in my area, cut your Coat according to your size. meaning, do things in a way it will not affect you or bother you.If here is not the rightful place to post this, mod can help to place it to the appropriate place.The expectations and the reality are always two different things, thats why most investments are not satisfactory. The way people see themselves in the future often have negative effect when reality appears to be totally different... The main thing which is valuable is not to be exposed to stress due to ruined expectations, and the fundamental scale in economy is not money, but the tendency to avoid such stressful events. Money amounts is a fictional scale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "May 05, 2023, 11:28:11 AM",
      "body": "Just like everyone of us, we normally make big dreams and sometimes the dream is just within us if we don't work towards it in a way that is going to become reality. Dreaming is one thing and making it to materialize is another thing. It just like when I was a kid, I normally have this dream of becoming a pilot but with one thing leading to another, I could not bring it to reality because of life circumstances. We need 59btry as much to always make sure that our dream is something we can achieve within the space of time because dreaming big dream with having the right tools to make it comes to reality is wasting of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "May 05, 2023, 12:10:02 PM",
      "body": "Quote from: gaston castano on May 05, 2023, 10:30:56 AMIn terms of following the methods of successful people, it can be helpful to learn from their strategies and experiences, but it's essential to recognize that everyone's journey is unique. What works for one person may not work for another, so it's important to find your own path and approach that aligns with your values and goals.Everyone's starting line is different, everyone's behavior and circumstances are completely different. Therefore, I am also completely against applying other people's methods to myself. It may work for them, helping them achieve success, but that doesn't mean that when we apply what they did, we will be as successful as them. There is no specific formula for success, everyone has their own way to be successful. Like many people think that billionaires do not need to go to college to be successful and rich, but they don't know that these billionaires were born at the finish line, rich families while we have nothing to offer rely on. That's the funniest thought I've ever seen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mm2543363580",
      "created_time": "May 05, 2023, 12:18:13 PM",
      "body": "Imagination can be converted into reality through hard work and proper planning but day dreaming is not good just remember this,  if you want to achieve something big in your life first of all you should have a proper strategy and plan secondly you should be patient as success don't come over night .You have to be consistent and determined in your plans and if you fail in your first attempt don't give up . Your grid is everything , your attitude defines you and your future so make sure you work on that first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "May 05, 2023, 12:26:58 PM",
      "body": "There is nothing wrong to imagine. In fact it is good to imagine because it places you on the artificial stand you want based on what you are imagining and you need to work towards it to make the artificial become real, this is to the saying that faith without work is dead. Quote from: Onyeeze on May 05, 2023, 08:06:26 AMone day I seat alone and began to ask myself that what is the way people who made money and who are firm started their life and what role did this people play before they make money, They all went through the puzzle you are going through before taking the step on their imagination. In the past, someone sold his bitcoin for pizza while some hodl back with the imagination that the price will improve and it became a reality that the price of bitcoin actually appreciated from less than a dollar to $64k. If you don't take a step on your imagination then it will only remain as imagination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 05, 2023, 12:31:16 PM",
      "body": "First you most stop thinking in that line of idea and it is possible for you to follow others steps to make money most especially when it comes to investments because of you have a friend who has invested in the real estate sector and waited for the investment to start yielding profits and you think you can pay the same price paid by your friend you will also arrive at the same level of the financial state within the same estimated time. And when it comes to cryptocurrency investment I can only suggest Bitcoin as the only asset in the cryptocurrency market that give you some relief and peace of mind to wait for it to gain profits in the future because all the other altcoins are high risk and can go from 100 to 0 within seconds, so it is important to build a good knowledge of the risk involved before risking your capital to invest in any of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 05, 2023, 12:34:29 PM",
      "body": "When we try to concentrate on the word imagination it's indicating something that you inspired to acquire or a conditions that you many likely be like or not, realities is realities and imagination is your expectations neither negatively or positively, but I would want op to understand that before a dream return to reality, you most have draft out your ways of understanding the procedures that will lead you to it's achievements,  sometimes imagination is a picture of things that you are destined to achieve, but the barriers that's attached to it or hinders us not to achieve it is lack of seriousness and laziness.Quote from: gaston castano on May 05, 2023, 10:30:56 AMIn terms of following the methods of successful people, it can be helpful to learn from their strategies and experiences, but it's essential to recognize that everyone's journey is unique. What works for one person may not work for another, so it's important to find your own path and approach that aligns with your values and goals.Success have different variables and varieties to be followed, you are right \" because I believe that for someone to be successful you have to follow a different measure in which another one have not followed before, because its very obvious that everyone person will not be favourable using one particular method or style, you have to be innovative in different dimensions and make out your own ways, but I'm not condemning the fact of using another person ideas to achieve your objectives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YinShuiSiYuan",
      "created_time": "May 05, 2023, 01:03:05 PM",
      "body": "Imagination adds colors to your life it gives meaning and purpose to your life so imagination is good and productive.  You can turn your imagination in reality by working in it , dreams do come true but you have to work hard for that . Fantasy world don't work here in this world here you have to give your 100% to gain anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uche6215",
      "created_time": "May 05, 2023, 01:12:44 PM",
      "body": "You have said well and I do believe that almost every human on earth 🌐 including animals dreams big sometimes because we do not want to be impoverished, why I mentioned animals because I believe that even the animals in the jungles want to become the king 👑.On my own, I don't like to follow in people's footsteps because I believe that everyone has their way of life, it is very to imagine but it is demanding to achieve without any hard work, learn from others and build you but don't follow their ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demonica",
      "created_time": "May 05, 2023, 01:14:00 PM",
      "body": "It's fine to think positively. Your dreams to become something and your imaginations can be your inspiration for the actions you will make in the reality that will decide your destination in the future. It's fine to imagine things like being successful one day cause it'll motivate you to be one. About the one you mentioned about following the methods of successful people, I can't guarantee that it'll work with you as well. You can view them as an inspiration but of course you, and those other people have different opportunities. All those successful people have their own story how they become successful. And since I've mentioned that we all have different opportunities, you can create your own story being successful as well",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "May 05, 2023, 02:17:51 PM",
      "body": "I think whatever it is, especially when it comes to investing, it's important to approach it with a balanced perspective and not let emotions or hype cloud our judgment. If we correlate it with the world of money market, an imagination crypto trader can help in developing strategies and planning future investments. However, it is also important to stick to the facts and facts, and consider the risks involved in the investment. Sometimes, excessive imagination can lead a person into harmful speculative actions. Therefore it is important to combine creative imagination with realistic and accurate judgments in making investment decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "May 05, 2023, 09:13:54 PM",
      "body": "Quote from: YinShuiSiYuan on May 05, 2023, 01:03:05 PMImagination adds colors to your life it gives meaning and purpose to your life so imagination is good and productive.  You can turn your imagination in reality by working in it , dreams do come true but you have to work hard for that . Fantasy world don't work here in this world here you have to give your 100% to gain anything. Imagination is very necessary in life to motivate yourself to work harder to be able to realize what you want to achieve in the long term, so if we have a basic knowledge of trading and investing in kirpto then we must take advantage of these opportunities to get profits until we reach the final target to buy what what you dream before you succeed. I define imagination as motivation, everyone has imagination if they are successful but not everyone succeeds because they are not motivated to work hard but they just imagine it without taking any action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 05, 2023, 09:55:10 PM",
      "body": "As long as it's achievable and you not wanting to have a unicorn, it can be achieved. There is a story of a commoner who becomes an emperor which he himself had not even dreamed of until he achieved something and then want more. If your ambitions are unlocked after achieving a simple dream, you can be whatever you may want to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "umbara ardian",
      "created_time": "May 05, 2023, 10:19:22 PM",
      "body": "The power of our thoughts, words, and actions is immense, and what we focus on tends to expand in our lives. It's important to be intentional about where we direct our energy and attention.At the same time, it's also important to stay persistent and committed to our goals, even in the face of setbacks and temporary failures. It's easy to get discouraged when things don't go as planned, but if we continue to take consistent action towards our goals, we will eventually achieve them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odunybiz",
      "created_time": "May 05, 2023, 10:36:56 PM",
      "body": "Quote from: Onyeeze on May 05, 2023, 08:06:26 AMEvery day I think almost twice a day and I began to ask myself if imagination can be real? At first I will be having the mindset of positive thinking and sometimes I see those thoughts as negative one, one day I seat alone and began to ask myself that what is the way people who made money and who are firm started their life and what role did this people play before they make money, if I should follow the method some people can I arrive to same point with them, and after sometime my instinct derive me to another point by saying not everyone will scale true through one root.Not everyone will pass through thesame pattern to achieve success just has you said. One can just learn from them but derive his/ her own way to success using what is available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}