{
  "id": "topic_5448177",
  "title": "CryptSafe",
  "author": "CryptSafe",
  "created_time": "April 09, 2023, 06:43:42 PM",
  "content": "My country people, I hail una. Una don hear say \"CBN Set to Close Millions of Bank Accounts in GTB, Access, Zenith, First Bank, and Others\" for your information, Dem say na people wey never link their account with their bvn naim this policy go affect because CBN feel say them no want to go by the law so anytime from now say make Nigerians wey never Link their account to their bvn dey ready because them go close the accounts them.Another reason wey then cite be say those accounts holders them wey no want to link their accounts fit dey use am do fraud wey dey make government agencies no dey fit trace them so e go dey very difficult for them to catch them so to avoid that saga CBN Dem say those accounts them go close am.So my people if una get any of una family members or friends wey never link their account based on say Dem forget abeg make una tell Dem to go do the needful make those CBN niggas no collect their bar o dey Yan opata o. These period no be wetin person go dey hear story for him money and account.I say make drop this information here make we for know. Una weldone.https://goldennewsng.com/cbn-set-to-close-millions-of-bank-accounts-in-gtb-access-zenith-first-bank-and-others-see-reasons/amp/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448177",
  "comments": [
    {
      "author": "Coyster",
      "created_time": "April 10, 2023, 01:23:06 PM",
      "body": "I think say CBN don close bank accounts wey no they linked to any BVN tay tay oh, i they surprised say na now them wan do am, i know see any reason why person no go wan get BVN and link it to their bank account, except na because of ignorance, but if no be that one e fit be say the person they use the account for fraud and money laundering, na BVN they help the CBN to curb fraud somewhat easily in the banking sector, so for people wey never do this, make them go link their BVN to their bank account before CBN close am down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "April 10, 2023, 03:09:11 PM",
      "body": "I no understand this kind thing. I think sae the BVN connecting to bank mata don pass far tey. Every peso wey get existing bank account must get a BVN and without BVN, you no fit make use of your bank account. Na mandatory sae, opening a new bank account must require a BVN to do so. For this our country, I no sae there is nothing wey d impossible to happen. Em get some people wey go manage to maneuver the process of BVN link with their bank account. Anyway, I no d surprise for this kind thing to happen sha. As for those wey never link their bank account to BVN, make d hurry do am sha. As for me and my household our BVN is link with our bank account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 10, 2023, 03:20:52 PM",
      "body": "This people matta even tire person self, since how many years wey them dey yan about BVN so them never still close people account? Haa!I remember since 2016 something like that wey them bin dey yan of close people account, this one come make us dey queue for line to make our BVN so that our account no go dey close down, the matta even surprised me say Government never still close those people account wey never link till today, then why all those pressure since 2016 dey panic like say e go just end within 30 days wey dem give us to submit our BVN. Na so e dy for the time of NIN every body dey run heter scatter in the name of say government wan ban all our line and make we also submit am to our bank as well but them no dey serious, i still believe say e get some people wey never even do their NIN, BVN. Oya look this our new money self, na so e happen kitikiti till today e come be say them don extend the money wahala. Why our government dey like to dey frustrate people like that? Omo their matta tire me abeg, make dem shift enter one corner make we rest focused on our blockchain matta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 10, 2023, 03:45:52 PM",
      "body": "Some of these banks na him be our biggest problem for the nation because dem get some banks wey dey actually create account for people without asking them for their BVN and na the first thing be that for this issue. Once person wan open account dem suppose request for am or create another one for the person. Another thing wey dey affect this BVN thing na some fintechs wey dem create accounts and also operate without asking for BVN, this come be another place wey criminals Dey hide funds if there BVN also get issue. Central bank suppose find way stop this one’s from operating in the country.Quote from: Adbitco on April 10, 2023, 03:20:52 PMNa so e dy for the time of NIN every body dey run heter scatter in the name of say government wan ban all our line and make we also submit am to our bank as well but them no dey serious, i still believe say e get some people wey never even do their NIN, BVN. Oya look this our new money self, na so e happen kitikiti till today e come be say them don extend the money wahala. Why our government dey like to dey frustrate people like that? Omo their matta tire me abeg, make dem shift enter one corner make we rest focused on our blockchain matta.Na the major problem wey we Dey face for naija be this lack of proper implementation or follow up. This government will bring a policy that seems like a good one and when people don suffer finish you go come see say them just abandon the thing. This thing no be only policy e affects even infrastructural developments wey dem go start with huge money you go just come later see say them just abandon am and he go later dilapidate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "April 10, 2023, 04:25:59 PM",
      "body": "Dis Mata just be as it bi ooo, I no dey understand the way dis naija government dey handle some issue ooo.my thinking be sai they done handle dis linking if bvn to account finish kparakpata, if no bi now I dey see d news again. At first time gain, why banks go they allowed pipo when never Link their bvn with their accounts they operate am? I think sai person no fit operate account whenever Link with bvn before, bcus time wen I no Link my account with bvn I no fit operate am. all I notice with naija government be sai dey no dey handle some laws the way they suppose to handle in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 10, 2023, 05:08:32 PM",
      "body": "Quote from: Zaguru12 on April 10, 2023, 03:45:52 PM.Quote from: Adbitco on April 10, 2023, 03:20:52 PMNa so e dy for the time of NIN every body dey run heter scatter in the name of say government wan ban all our line and make we also submit am to our bank as well but them no dey serious, i still believe say e get some people wey never even do their NIN, BVN. Oya look this our new money self, na so e happen kitikiti till today e come be say them don extend the money wahala. Why our government dey like to dey frustrate people like that? Omo their matta tire me abeg, make dem shift enter one corner make we rest focused on our blockchain matta.Na the major problem wey we Dey face for naija be this lack of proper implementation or follow up. This government will bring a policy that seems like a good one and when people don suffer finish you go come see say them just abandon the thing. This thing no be only policy e affects even infrastructural developments wey dem go start with huge money you go just come later see say them just abandon am and he go later dilapidate I think na one permanent disease wey dey we people body most especially government for that matta, them no dey ever take something serious for life and like this e dey really affect we country badly. Anytime new thing come out, the first thing you go hear be say \" Leave that thing we government no dey ever serious for something or even stands on their words\" and like this e come be like say we no dey abide to the laws we govern us for the country. But anyhow e be Our God pass them sha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "April 10, 2023, 07:45:23 PM",
      "body": "If na policy wey get political why now dem go run give only one month and begin give deadline like naira redesign wey we all see as e happen and confirm say ns political reason because na the old notes only we dey see plenty. Just like men still dey surprise say dem never pass that level of bvn linkage to bank accounts, me too follow dey surprise. This country politics get k leg and e no dey move the country forward. Other countries dey do politics but na masses dey enjoy, naija na masses dey suffer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "April 10, 2023, 09:52:43 PM",
      "body": "Me I no understand again oo, dem Neva settle this bvn matter for bank finish and by the way I think say you no go fit actually create bank account wen you no get bvn. Because to open account these days the procedure dey always involved input of your bvn except na mobile wallet account you wan open or all the internet banks like opay,palmpal and all the other one even that one sef for some reason dem go need you to put your bvn so which one cum be say dem close banks again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "April 11, 2023, 04:00:21 AM",
      "body": "Now who dey confuse us with this issue on ground. Na CBN or bank because I fit remember say way back when this BVN matter arise,say if you no get BVN or fail to one to your account. Bank no go give you access to your funds for bank and because of this,I just abandon my account for GTB because of the stress that year since I get alt bank wey i register my BVN na just to link am. This make my funds for GTB almost impossible to collect. I still know say anybody wey one open bank acct,na BVN be first question wey customer care go ask you if you get before them ho give you form fill,and if you no get na BVN dem go do for you first. I no come understand this one way Emefiele dey come up with again when everybody wey e account dey active get BVN. Abi na the dormant account them CBN dey refer to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "April 11, 2023, 05:16:47 AM",
      "body": "Quote from: Marykeller on April 10, 2023, 03:09:11 PMI no understand this kind thing. I think sae the BVN connecting to bank mata don pass far tey. Every peso wey get existing bank account must get a BVN and without BVN, you no fit make use of your bank account. Na mandatory sae, opening a new bank account must require a BVN to do so. For this our country, I no sae there is nothing wey d impossible to happen. Em get some people wey go manage to maneuver the process of BVN link with their bank account. Anyway, I no d surprise for this kind thing to happen sha. As for those wey never link their bank account to BVN, make d hurry do am sha. As for me and my household our BVN is link with our bank account. No be all accounts dey linked to BVN, some of those accounts na account wey de owners use for fraud while some, the owners fit don die and de family members fit no dey aware of de account and the funds wey dey inside. As u expect dose account dey dormant because of months/years of inactivity but u no go expect CBN to just erase dose accounts like that because of the money wey dey inside, so na im make dem give this ultimatum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "April 11, 2023, 08:49:29 AM",
      "body": "When I read the news sometime last week I was surprised to hear that there are still accounts that are operating in the Nigeria financial system without the BVN, isn't a BVN prerequisite to owning and operating an account?Reason why I like decentralized finance such as bitcoin and other altcoins that made up the cryptocurrency space since there is no third party like the bank its operation will be free and limited to proof of trust and stake, there is no limitation.But having to operate an account without a bank verification in a centralized financial institution will give room to a lot of criminality and fraud, reason why our banking systems are the pipeline to all the financial fraud in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "April 11, 2023, 09:01:22 AM",
      "body": "I never know say this people still dey talk about this matter oo, but wait o, why dem still bring this matter come up again?them for leave this matter make people rest na since e be say everywhere don cool down like this, our country something no dey finished at all people wey dey really carry our money them no dey visit them or even block their account na just innocent poor citizens them go face they worry like say tomorrow no dey. Make we just reason our old mama them for village wea no fit move to go do the BVN how don wan carry do am.See ehh, if i be government officials i go like them to carry the BVN machine waka door to door for every village so that those people wey no fit meet up come go do am for their house, just the wey dem dey do census counting. if them begin to do things like that e go pure for people wey no fit go out or for those old people for we villages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "April 11, 2023, 05:04:58 PM",
      "body": "Quote from: CryptSafe on April 09, 2023, 06:43:42 PMMy country people, I hail una. Una don hear say \"CBN Set to Close Millions of Bank Accounts in GTB, Access, Zenith, First Bank, and Others\" for your information, Dem say na people wey never link their account with their bvn naim this policy go affect because CBN feel say them no want to go by the law so anytime from now say make Nigerians wey never Link their account to their bvn dey ready because them go close the accounts them.Another reason wey then cite be say those accounts holders them wey no want to link their accounts fit dey use am do fraud wey dey make government agencies no dey fit trace them so e go dey very difficult for them to catch them so to avoid that saga CBN Dem say those accounts them go close am.So my people if una get any of una family members or friends wey never link their account based on say Dem forget abeg make una tell Dem to go do the needful make those CBN niggas no collect their bar o dey Yan opata o. These period no be wetin person go dey hear the story for his money and account.I say make drop this information here makes we for know. Una well done.https://goldennewsng.com/cbn-set-to-close-millions-of-bank-accounts-in-gtb-access-zenith-first-bank-and-others-see-reasons/amp/This is to show how manipulative are banking system is because over five years ago bank verification number was implemented and citizens with banks accounts were told to get the bank verification number (BVN) to operate their bank account but seeing this latest new development to the point of the central bank issuing another threat makes me wonder why those accounts can still operate without BVN for so long and what are the extent of transactions that have been done through this accounts.This and many more are the questions that are demanding answers if we must have an accountable central bank, no wonder some segments of people are calling for the central bank governor's arrest because there have been so many financial crises and frauds under his administration. This could be the reason why there have been a high rates of terrorism financing and the rest of all the other increasing financial crimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "April 11, 2023, 05:31:53 PM",
      "body": "Quote from: Coyster on April 10, 2023, 01:23:06 PMI think say CBN don close bank accounts wey no they linked to any BVN tay tay oh, i they surprised say na now them wan do am, i know see any reason why person no go wan get BVN and link it to their bank account, except na because of ignorance, but if no be that one e fit be say the person they use the account for fraud and money laundering, na BVN they help the CBN to curb fraud somewhat easily in the banking sector, so for people wey never do this, make them go link their BVN to their bank account before CBN close am down.See eh, I come dey wonder why e be say na now Dem come remember bvn matter wey e be say na how many days to swearing in of a new government. Dem too want to tell us say Dem no see or know say people still never link up their bvn since. Na dis one Dem want to use cover up their wuru wuru Dem do for office and also to lock people money put too if not wetin go make CBN pay deaf ear to this particular matter since him dey for office na now wey government wan change hands naim Dem want do d needful.Na innocent Nigerians I dey pitty  because na Dem go be the scape goat wey go fall victim of this policy.Meanwhile the new naira note wey Dem dey talk about no dey in circulation again. I no know wether anybody don notice am because me I don dey take eye to see if I go get or see the new naira note.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "April 11, 2023, 05:56:56 PM",
      "body": "Quote from: CryptSafe on April 11, 2023, 05:31:53 PMNa innocent Nigerians I dey pitty  because na Dem go be the scape goat wey go fall victim of this policy.Meanwhile the new naira note wey Dem dey talk about no dey in circulation again. I no know wether anybody don notice am because me I don dey take eye to see if I go get or see the new naira note. Na always the masses day always suffer the end results of these irradical actions wet these confused people dey take, but am just confused on how these people still dey talk about this matter of bank not link with Bvn because I feel say everyone Don already link their bank. Well as the new naira note dat one sef na another problem wey dey pile up oo because the note no dey exist for where I dey again oo na only the old currencies nai dey flow and very the deadline go reach again but no new money for the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "April 11, 2023, 10:07:06 PM",
      "body": "So people still dey wey neva link their account with BVN sef? Na wa oo wey government no take action about am all this while come dey allow them use the account till today. I been see the news but I been think say na accounts wey dem open and them no dey use am do anything na him CBN wan close down. This rule of linking BVN to accounts don tey where be say everybody by now suppose don do am. Any action wey CBN go take about am now, e dey very welcome as far as e no cause harm to the general public and na only the affected people go face the consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "April 14, 2023, 12:45:10 PM",
      "body": "Quote from: Asiska02 on April 11, 2023, 10:07:06 PMSo people still dey wey neva link their account with BVN sef? Na wa oo wey government no take action about am all this while come dey allow them use the account till today. I been see the news but I been think say na accounts wey dem open and them no dey use am do anything na him CBN wan close down. This rule of linking BVN to accounts don tey where be say everybody by now suppose don do am. Any action wey CBN go take about am now, e dey very welcome as far as e no cause harm to the general public and na only the affected people go face the consequences.My own question be say the banks wey those account holders dey with no fit call the attention of the account holders to do the needful since then till now abi the account dem dey dormant for that long with or without funds in them? Well i no go dey surprise because Bank too get their own interest in those accounts as na those accounts Dem dey use dey run their business wey make Dem no dey talk about them. As  e be so, those accounts sometimes na wetin Dem dey hope on to carry out their shaddy deals and I no go dey surprise say most of those accounts owner dey late while some na  invalid address holders ie ghost account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "April 14, 2023, 08:14:44 PM",
      "body": "Quote from: CryptSafe on April 09, 2023, 06:43:42 PMSo my people if una get any of una family members or friends wey never link their account based on say Dem forget abeg make una tell Dem to go do the needful make those CBN niggas no collect their bar I say make drop this information here make we for know. Una weldone.Thank you say you bring this matter come but this matter no be today matter na and I believe say as long as person get active account, he suppose get bvn wey already dey linked to the bank and me I know my country wey everybody dey find way to take achieve one or two and even bank suppose don temper with the money if at all any inactive account dey their bank.I no understand why this matter come resurface again but this emefiele guy(I no know if I spell the name well🙄) don really prove to people say he office na one big office wey fit affect the entire country and oga CBN we no dey argue again, take the trophy and go make you stop to dey worry the poor masses.Any account wey no get bvn linked to it but now suppose be new accounts or suppose don dey dormant or tagged inactive already by now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "April 18, 2023, 06:40:14 AM",
      "body": "I suprise o, so e still get people wey never link their bvn to their accounts up till now?;but na wetin those kind people dey wait for na?To me if CBN want close their accounts make Dem close am abeg, because I no see any reason why Dem no go register and link their bvn to their accounts atleast for their own good,I no get plenty talk to talk for this matter abeg, some Nigerians just dey very stubborn for nothing, CBN close their accounts if possible..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}