{
  "id": "topic_5416281",
  "title": "Zilon",
  "author": "Zilon",
  "created_time": "October 07, 2022, 06:32:45 AM",
  "content": "Everyone approach the market differently using different indicators, techniques, strategies and trend detectors. I tried comparing crypto trading and our every day business. People in our commercial markets keep their profit realistic. For every commodity displayed the have a fixed price attached to them and even if the give buyers the opportunity to bargain the always have a fixed price the will never sell below. This regular business individuals also experience loss but because of their consistency and realistic profit margin their profit cover-up for their losses.Comparing this to crypto trading many traders have good strategy. Some see good profit but fail to take them because the expect something bigger. If crypto traders can use the business mindset on their analysis the ratio of their profit to loss percentage will be so large. A business person keeps their greed out of their business because the know if their price get unaffordable they might lose their customers. If crypto traders have a price the expect from every trade we will have more profit than losses.Crypto trading isn't a get rich scheme. Some days can be very profitable while some days might be terrible. The good days should be appreciated, the bad days welcomed and because everyday isn't profitable having a good profit plan for everyday trade helps save the profit and limit the losses. The first step is having a working strategy and after that is knowing the limit of your strategy. No matter how good a traders strategy appears there is always a limit it can't exceed. Not because those strategies aren't reliable but because the market varies and no single model trained can make accurate prediction in all market situation. Each of them have their strength and limitations",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416281",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "October 07, 2022, 06:56:14 AM",
      "body": "In trading, it is good to take away greed and not good to look for what you can not lose, I mean if you can lose $5 daily, then you can think of a way to make $5 daily from trading with your trading capital, in a way that if losses occur, it won't be more than $5. Before losing the $5, there should be a better high range between the entry price and the mark price before the money would be lost. It is good to have good money risk strategies and also making indicators and other fundamental analyses to back it up.But we should still considering that trading is risky and far riskier than what you compare it to which are people that buy and sell goods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ararbermas",
      "created_time": "October 07, 2022, 07:41:12 AM",
      "body": "Trading is a very unpredictable business tbh and you should accept what amount you can get in every trade as long as you can make profits afterwards and not losing money in it. Be practical and always build a good strategy so that you can gradually get your price target. Being greedy will not work so be smart enough..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GelatikKembar",
      "created_time": "October 07, 2022, 08:31:31 AM",
      "body": "Quote from: Ararbermas on October 07, 2022, 07:41:12 AMTrading is a very unpredictable business tbh and you should accept what amount you can get in every trade as long as you can make profits afterwards and not losing money in it. Be practical and always build a good strategy so that you can gradually get your price target. Being greedy will not work so be smart enough.. Trading is indeed very complex and to be successful we need many things,knowledge and skills are two things we must have before trading,We need to avoid greed because it can make us lose so trade wisely",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "October 07, 2022, 08:59:48 AM",
      "body": "Eh? Actually trading is a get rich scheme since you're trying make profit everyday by beating the market. Investment is the strategy that not get rich scheme since they don't mind if their investment not making any return for short time as they're looking for long term prospect.Even though there's a day where market is bear and the price continue to dump, that's what cut loss for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "October 07, 2022, 09:16:01 AM",
      "body": "That's why learning to control your emotions is the top priority list in trading, even in everything you do in your life. Emotion is very tricky, you can be easily manipulated by your own emotions if you don't know how to control it. There's a monk saying that \"mind is power\" therefore it should be separated on your body, but not literally, lol. This means that your mind is the master of all the things you'll do, but you must have the power to command it, not the other way around. For example, a bad trade after hours or days of making a good technical analysis could result to a huge frustration and disappointment, your mind will probably tell you to quit or enter a trade without any plan, that's danger right there. So if you know how to control it, the right thing you'll do is to rest, plan again, and trade again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 07, 2022, 11:31:36 AM",
      "body": "Firstly every trader needs the know that trading is a very serious business and if any trader wants to be successful at it then they have to be ready to put in work and dedication. Without doing those then you might most likely not be profitable and results in you quiting. If trading is your professional business then you must learn to input those attributes that helps a business becomes profitable when your are trading, firstly you have to have a clear focus, been able to differentiate your emotion from your business (which is trading) should be a priority before anything else.Strategizing should come next, as to become a professional traders has to do with you having a strategy that works profitably for you. You can't be guessing and expect the outcome to be productive. Even if it works in the earlier stage of your journey, as you progress the results will change. Any trader that doesn't go with a business mindset and thinks trading is all about been lucky through gambling will end up losing all their capitals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "October 07, 2022, 11:56:49 AM",
      "body": "Quote from: GelatikKembar on October 07, 2022, 08:31:31 AMWe need to avoid greed because it can make us lose so trade wiselyMoney management in trade is very important here. Despite our skill/indicators, knowledge and emotional control, if we can't have a working money management then all we know amounts to nothing because we are going to be losing just as we are gaining and at a time our loses will take us out entirely. So using appropriate leverage, risk appetite to our capital and stop lose are ways we can be a better and less greedy trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "October 07, 2022, 12:50:56 PM",
      "body": "Quote from: Zilon on October 07, 2022, 06:32:45 AMSome see good profit but fail to take them because the expect something bigger. If crypto traders can use the business mindset on their analysis the ratio of their profit to loss percentage will be so large. A business person keeps their greed out of their business because the know if their price get unaffordable they might lose their customers. If crypto traders have a price the expect from every trade we will have more profit than losses.You succinctly captured the whole thing in the quoted text. That aspect is the great undoing of many speculative traders, not just crypto alone. There's no trader who would say truthfully that they hadn't been caught in that web. We need a bit of greed once in a while in this market, especially when one thinks the coasts are clear. The market doesn't show us mercy when dealing us in loss and I believe that's why traders expand their expectations while in small profit. However, what I will advise in a situation like this is for such a trader who wants to risk it further to adjust their SL to entry level. It's a bad trading habit to watch a trade already in profit go back into loss. With entry level, you don't loss anything again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "October 07, 2022, 12:56:10 PM",
      "body": "I’m trading for many years in crypto but until now I’m not comfortable on my trading strategy even though I’m having a good steady income on stocks trading here in my country. The fundamental analysis on crypto makes crypto trading very wild since you didn’t know when this kind of volatility will hit and on what direction. Even if you have a good TA while a big news can easily deny your TA.I’m thinking on business mindset but still crypto trading is not meant for a source of steady income for me unlike stocks trading that really work for me since I can saw the the physical business company of each stock that I’m investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "October 07, 2022, 01:29:25 PM",
      "body": "Quote from: AbuBhakar on October 07, 2022, 12:56:47 PMAs we trade more we will learn what can be the best method that makes us profitable. It will depend on our dedication and principle in how we handle money when we win and when we lose. There were times we will lose and realize that we should not do such or such move. We must take note of those times and apply in our next method. Once we find the method that make profit we will be able to analyze how to manage it well. Yes, it is a learning process we can get by practicing it directly to give us experience.The more we learn about trading, of course, it will increase our ability to analyze and our efforts to get bigger profits.It's okay if we experience losses; as long as we consider it a process that we must go through, it can also make us cautious in our decisions.By continuing to learn, we can find which ones are suitable for us to do and in analyzing, we can also get clues about when to enter the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "October 07, 2022, 01:32:02 PM",
      "body": "I'm not sure how to integrate a Business mindset into trading. Maybe it was because both are aiming to earn profit but what makes them different is that in business every opportunity should not be missed and we have to be more aggressive like a greedy person but in trading, we don't have to do it (greed) as this will make you fail. Likely, if you are into trading, then make your mindset as a trader. But if you are in business, make up your mind that you are in business as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awwal08",
      "created_time": "October 07, 2022, 03:52:23 PM",
      "body": "I see trading as a business, so anyone who does not have that mindset is wasting is time because both are looking forward for profit. In my own view trading is not a physical business, that why I advise any trader to no rely on trading, have a physical business because of unforseen circumstances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "October 07, 2022, 06:24:59 PM",
      "body": "I like the word realistic profits from the OP. The thing is everyone wants to start trading today and want to 5x or 100x their investments by the end of the day. This is just ridiculously expensive thought anyone could have even in their dreams. I literally laugh when I see advertisements where some random guy is posing in the film and how seriously he keeps telling his story that he is earning 20-50k every month from trading and he just started couple of months ago and he is using XYZ app that’s why he got success. Bullshit man, I literally laugh on such things. Not only this, now there are instagramers who are experts in the field. But nothing is realistic in them. Trading is big bull game. You have to give lot of time and effort for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rendravolt",
      "created_time": "October 07, 2022, 06:46:50 PM",
      "body": "Quote from: Awwal08 on October 07, 2022, 03:52:23 PMI see trading as a business, so anyone who does not have that mindset is wasting is time because both are looking forward for profit. In my own view trading is not a physical business, that why I advise any trader to no rely on trading, have a physical business because of unforseen circumstances. Sometimes if they are used to trading they will forget that there is something to prepare when the market is unstable. I am a person with a similar perspective, but I have also set up a small business in real life to cover the income. Therefore it is better to be on guard for things we do not know before it is too late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 07, 2022, 06:53:08 PM",
      "body": "I learn from the time I spent in cryptocurrency that greed is the main problem in cryptocurrency. I had lost a lot due to greedy trading behavior. Over-expectations aren't good always. Then it will be like gambling. I agree with OP that we have to take profits from trade with a min target. Once reach the target we can exit and re-enter once again. This is real life business strategy, selling things and buying again with a profit margin. Not hold for a lifetime with over expectations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "October 07, 2022, 07:38:54 PM",
      "body": "Quote from: The Cryptovator on October 07, 2022, 06:53:08 PMI learn from the time I spent in cryptocurrency that greed is the main problem in cryptocurrency. I had lost a lot due to greedy trading behavior. Over-expectations aren't good always. Then it will be like gambling. I agree with OP that we have to take profits from trade with a min target. Once reach the target we can exit and re-enter once again. This is real life business strategy, selling things and buying again with a profit margin. Not hold for a lifetime with over expectations. Simply buy and then sell in profits but it might sound that very pretty basic but this is something that you cant really able to do in the right way.Greed would be always your main enemy when it comes to making money matters which we do know that business or any other activities that involves money will surely be that your main challenge.Setting up some goals shouldnt really be on that unrealistic level.Take your time on achieving or acquiring it,without the need of being too desperate or making yourself in a rush because we know  that this do really cause and resultsinto lots of errors or mistakes which we dont really like for it to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "October 07, 2022, 08:21:53 PM",
      "body": "Quote from: AakZaki on October 07, 2022, 08:09:10 PMActually, it can be overcome if we have set a trading plan consistently, both by procuring a structured portfolio.It is difficult to be faced with greedy words, but we must be aware that the market moves very high fluctuations.Of course, It is difficult to determine between greed and maximizing opportunities. I understand that sometimes completely trusting in a certain asset will not be good especially if it is not bitcoin, here between greed and maximizing available opportunities will come into play.Price fluctuations are unavoidable even if it is a stablecoin, so it is true that one can hesitate to say others are greedy or not when they want to maximize profits by taking advantage of these fluctuations. After all, going all-in on one particular asset shouldn't be called greedy, but it would be wise to have some spare money in addition to investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "October 07, 2022, 11:39:25 PM",
      "body": "Greed will just ruin your trading method and that's the reason why most of the traders suffer from losses or not gaining enough profit. If you think it this way like how businesses do, you'll notice that they have a day that their sales didn't make enough profit for what they've expected but still continue their business on the next day.In order to make profit they have to do something like marketing strategy and this is what the Bitcoin market would look like if you see how news affect the price of the market. It's a grinding method everyday not a grinding method in one day that's why most traders suffer from losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "October 07, 2022, 11:49:44 PM",
      "body": "Just treat trading seriously and don't make it a child's game. If we are really determined to learn to trade, we should focus on working on that. Invest in knowledge as even if we spend lots of money doing trades, if we are not learning the process, then we are just throwing away that money.It will take time to become familiarize with trading but it's worth it once people achieved that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}