{
  "id": "topic_5402884",
  "title": "Smack That Ace",
  "author": "Smack That Ace",
  "created_time": "June 16, 2022, 07:15:17 PM",
  "content": "Because no one knows for sure, which price is the bottom and which is the top? We can just buy at the price we expect to be the bottom and take profits at the price we expect to be the top. No one wants to buy at the top and sell at the bottom, the act of buying and selling comes from your judgment and results in the best answer, not a right or wrong argument in the market.Last December 4, 2021, Bitcoin had a bad drop from ATH to $42,000, down nearly 40%, and many Altcoins dropped 20-30%, for many investors, this is really like like a nightmare. but calmly looking back, this is not unusual for the crypto market.From August 2021 to the end of 2021, everywhere you go you will see a lot of people predicting bitcoin will reach 100k - 200k, then most investors just buy more, not sell. But as a result, we have seen, that bitcoin keeps falling in price.Cryptocurrencies are always like that, it feeds us every day, fattening us up and then eating us with subjectivity and confidence that we are smart enough to beat this market.But no, capital management is ultimately still iron armor to help us survive in the market for a long time.Bottom or top is valid only when we have a sell action. It is the price at which we sell that determines whether the order is bottom or top. Prices always fluctuate over time and never stand and no one can predict the top or bottom price 100% correctly, So, when entering the market, prepare yourself not to give up.:::Crypto Is On Sale:::.-Duke Khan",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402884",
  "comments": [
    {
      "author": "youdacapt",
      "created_time": "June 16, 2022, 08:07:18 PM",
      "body": "Quote from: Smack That Ace on June 16, 2022, 07:15:17 PMBecause no one knows for sure, which price is the bottom and which is the top?   It is true that nobody knows the bottom or the top; this is why it is being preached that everyone (either a newbie or pro) should always take profits everytime in crypto currency. Thast way you don't have to worry about the bottom price or the top price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "June 16, 2022, 09:57:40 PM",
      "body": "One of the biggest mistake traders make is to only think about profit and not a possible loss in case the market goes the opposite way. When you are prepared for a loss, you also get to have a good risk management plan so that you don't lose everything in a single day.Another thing that affects trader's profits so much is greed and FOMO. People should know when to exit and enter markets to avoid losing every trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "June 16, 2022, 10:14:42 PM",
      "body": "This has been the case for bitcoin for many years if you ask me. I mean not seeing \"all\" crypto like this, because there are some serious shitcoins out there, so do not generalize it for all of crypto of course. But when we are talking about bitcoin, I would never say that it went down too much to recover, there is no level where I can see it going down and lose hope, even if it is 100 bucks one day, I will buy as many as I can, will never consider it gone. Except of course if there is a technical problem, in that case I don't know what the reason is and would decide based on that if I want to go on or not. But not for financial reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 17, 2022, 01:21:30 AMLast edit: June 17, 2022, 06:21:34 AM by avikz",
      "body": "I do agree with OP. Crypto is on sale at the moment and no one really knows the bottom. So it is wiser to score slowly but certainly. We are going through one of those 3 years cycle we have experienced back in early 2018. So when the next bull cycle kicks in, bitcoin may get a valuation of 100k quite easily. We all need to prepare now to get the profits out of it.Naysayers will always be there to demotivate people. Some will say crypto is dead. But we need to ensure that none of these negative things affect our own thought process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 17, 2022, 04:48:58 AM",
      "body": "The hardest part there is when you bought at semi top and the value of your token/coin are going down so big. Some investors mind set are to cut loss or just typically hold it. If you are confident enough, then youll definitely hold and wait for the price to go back or surpass your buying price. So what will you do when this happened?If you are gonna hold, try to look for staking platform or their own and put it there, so while holding you also been given some tokens from that alone, making your negative value could decrease partially. At least your shares are being increase slowly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "June 17, 2022, 06:37:38 AM",
      "body": "Agree! People who are new to trading tend to see ATH's as buy opportunities and Dips as sell opportunities and oh boy was that the complete opposite. I felt so stupid when I realized how dumb the \"trading\" I've done ever since I started. Additionally trying to identify the bottom is like looking for a needle in a haystack, it's like a wild goose chase. It's also why I transferred to DCA'ing instead of trading, it's a load off of my mind so that I can stop thinking even when dumps like this happen. It also helps how I honestly just expect to lose the money I invested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 17, 2022, 02:34:01 PM",
      "body": "Proper trading skills means proper mindset to approach a bull and bear market, lack of which is the reason why traders who are entering crypto often end up in the vicious cycle of buying at the top and selling at the low.While I always advocate a positive approach to trading, I would agree that knowing a loss will be incurred should be kept in mind when starting to trade. However with the rationality that a loss is a lesson for any trader and that one can recover a loss gradually, long term trading becomes a habit not a stint.But most traders enter with a get-rich-quick mindset, which is a dangerous thing to have. When they dont get it, they sell and lose money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "June 17, 2022, 03:29:36 PM",
      "body": "Quote from: TheUltraElite on June 17, 2022, 02:34:01 PMBut most traders enter with a get-rich-quick mindset, which is a dangerous thing to have. When they dont get it, they sell and lose money.that's what new traders do, who don't even have enough experience and skills to trade crypto.what has always been on my mind, and the cornerstone of my investing and trading is to assume that what I put into the crypto market must have disappeared. That means I'm ready to lose.Thinking of getting rich quickly by trading and investing in crypto is a bad idea. those who own it are not experienced in this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "June 17, 2022, 03:40:16 PM",
      "body": "Can't deny what the OP said true, but often traders always feel they can guess the bottom and high correctly and end up losing the moment and getting emotional so they make the wrong choice of when to enter and exit the market.Quote from: Smack That Ace on June 16, 2022, 07:15:17 PMSo, when entering the market, prepare yourself not to give upWhat is never prepared for is a loss so that traders will be frustrated when experience it even though both losses and profits can be experienced by all traders even though they are have experience and knowledge. So traders should prepared for everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 17, 2022, 04:01:53 PM",
      "body": "Quote from: youdacapt on June 16, 2022, 08:07:18 PMQuote from: Smack That Ace on June 16, 2022, 07:15:17 PMBecause no one knows for sure, which price is the bottom and which is the top?   It is true that nobody knows the bottom or the top; this is why it is being preached that everyone (either a newbie or pro) should always take profits everytime in crypto currency. Thast way you don't have to worry about the bottom price or the top priceSome times it is our mistake that puts us into losses and the mistake is simply greed. We wait to get all the profit at same time while market has done its highest but we keep hodling it waiting for more bear but when it start to drop , panic begin to happen and regret. I think that setting our mind onto the profit point we want should be our top height.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "June 17, 2022, 06:21:47 PM",
      "body": "Quote from: palle11 on June 17, 2022, 04:01:53 PMSome times it is our mistake that puts us into losses and the mistake is simply greed. We wait to get all the profit at same time while market has done its highest but we keep hodling it waiting for more bear but when it start to drop , panic begin to happen and regret. I think that setting our mind onto the profit point we want should be our top height.If the purpose of buying bitcoin is for long term investment then I think buying at any price is fine \"it looks not greedy\". However, if we want to maximize profit potential, we must know when is the right time to make a purchase, and one of them is when it goes down. The problem is, people may be confident about the potential profit they will make from investing in bitcoin but they are not brave enough to make a decision to buy on a downturn due to concerns of continued downside. That's one mindset that may not be suitable for this investment because in fact they can still have other superior strategies such as DCA.But we can also preassure everyone that they should buy and buy because whatever other people say shouldn't be financial advice to them. There has to be their own analysis to make a decision, but I believe that if they want to invest in bitcoin in the long term then they will get a decent return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "June 17, 2022, 07:31:10 PM",
      "body": "Quote from: TheUltraElite on June 17, 2022, 02:34:01 PM~snip~But most traders enter with a get-rich-quick mindset, which is a dangerous thing to have. When they dont get it, they sell and lose money.This kind of mindset is a mindset that should be avoided, because the get rich quick mindset only results in losses and expectations that will not be the same. Those who want to get rich instantly don't want to do complicated processes such as learning how to master technical analysis and fundamental analysis. Trading cannot be done as easily as turning the palm of the hand. need a process, even those who are professionals are still experiencing losses, let alone just new traders who are just trying their luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "June 17, 2022, 09:06:41 PM",
      "body": "Quote from: palle11 on June 17, 2022, 04:01:53 PMSome times it is our mistake that puts us into losses and the mistake is simply greed. We wait to get all the profit at same time while market has done its highest but we keep hodling it waiting for more bear but when it start to drop , panic begin to happen and regret. I think that setting our mind onto the profit point we want should be our top height.It is all about discipline.When someone holds and the ATH happens and he won't sell, that's because he's thinking that there's gonna be more from that all time high. But it should be about taking profits because that's the way of how it should go. From experiencing bears and bulls, you'll have the idea on when you must really have to sell and when you must decide to buy using your profits from the time you've sold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 17, 2022, 09:14:25 PM",
      "body": "Quote from: AakZaki on June 17, 2022, 07:31:10 PMQuote from: TheUltraElite on June 17, 2022, 02:34:01 PM~snip~But most traders enter with a get-rich-quick mindset, which is a dangerous thing to have. When they dont get it, they sell and lose money.This kind of mindset is a mindset that should be avoided, because the get rich quick mindset only results in losses and expectations that will not be the same. Those who want to get rich instantly don't want to do complicated processes such as learning how to master technical analysis and fundamental analysis. Trading cannot be done as easily as turning the palm of the hand. need a process, even those who are professionals are still experiencing losses, let alone just new traders who are just trying their luck.Those which enter this market with the mindset of making a lot of money in a relatively short amount of time cannot even called traders, since they do not have what it is necessary at all to succeed, even if the profits that we can obtain in the markets are without a doubt better than what you can get in other markets, it is a mistake to think that you can get rich so quickly, now I know there are a few cases like that but those people relied on their luck and not their skill to get those results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leebabe",
      "created_time": "June 18, 2022, 12:24:18 PM",
      "body": "Very true. Go in with what you can afford to lose or let go. It helps a lot thats why everyone is encouraged to in with a certain level of experience or training as well as not having the get rich quick mindset. Fluctuation in the market makes predictions difficult to get it right so it is advisable to take profits even though it can be sometimes difficult to do that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 18, 2022, 01:14:27 PM",
      "body": "Quote from: ShowOff on June 17, 2022, 06:21:47 PMQuote from: palle11 on June 17, 2022, 04:01:53 PMSome times it is our mistake that puts us into losses and the mistake is simply greed. We wait to get all the profit at same time while market has done its highest but we keep hodling it waiting for more bear but when it start to drop , panic begin to happen and regret. I think that setting our mind onto the profit point we want should be our top height.If the purpose of buying bitcoin is for long term investment then I think buying at any price is fine \"it looks not greedy\". Everyone wants a huge return on investment and so no one will want to buy intentionally when they know that price is going high. High in the sense that it is already ATH and they jump in. This is not possible but because nobody knows the exact point of trend, they jump in when price is high hoping to continue riding the bull but surprisedly they are buying the sliding knife. This situation happened in 2017 when investors bought the high of $20,000 and also this current high . It is better to wait for at least a slight correction and not to be greedy to jump in while the bull is currently on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "June 18, 2022, 01:59:40 PM",
      "body": "Quote from: palle11 on June 18, 2022, 01:14:27 PMEveryone wants a huge return on investment and so no one will want to buy intentionally when they know that price is going high. High in the sense that it is already ATH and they jump in. This is not possible but because nobody knows the exact point of trend, they jump in when price is high hoping to continue riding the bull but surprisedly they are buying the sliding knife. This situation happened in 2017 when investors bought the high of $20,000 and also this current high . It is better to wait for at least a slight correction and not to be greedy to jump in while the bull is currently on.I've just about to remember how people are saying they will buy during the bear season but sadly, they had changed they're seeing the market moving down. And instead of taking this opportunity, they now said we've waited for recovery. It is definitely hard to understand and you are right, people have no intention of buying Bitcoin whether it was at its correction or bull market have no way to achieve their goals and it only remains assumptions. Investing is not a joke, it needs positivity and good mindeste or else, nothing happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "June 18, 2022, 02:44:32 PM",
      "body": "Buying the dip ain't that bad because from $68,000 per Bitcoin, grabbing it for its price now is a steal from me, then hodl if you don't know how to make profits in this kind of market. I agree that you only have to invest the extra amount of money you have in order not to get homeless while waiting for the next bull run. Don't put all the eggs in one basket, like the saying said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "June 18, 2022, 05:16:45 PM",
      "body": "Quote from: AicecreaME on June 18, 2022, 02:44:32 PMBuying the dip ain't that bad because from $68,000 per Bitcoin, grabbing it for its price now is a steal from me, then hodl if you don't know how to make profits in this kind of market. I agree that you only have to invest the extra amount of money you have in order not to get homeless while waiting for the next bull run. Don't put all the eggs in one basket, like the saying said. That's not too bad, still buying Dip. I dare to do that if I have extra money in my pocket, because the bullrun will definitely continue in the future, this is a cycle that will continue to occur over and over again.If it's already in the basket, keep it, never sell it. I believe that at any time the price can change and it won't be bearish for as long and for me, I will invest regularly considering the current price, which cannot be determined until when this will end.Still if there is more money I will still invest it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}