{
  "id": "topic_5422053",
  "title": "Question:",
  "author": "bbc.reporter",
  "created_time": "November 18, 2022, 12:11:33 AMLast edit: November 18, 2022, 12:27:56 AM by bbc.reporter",
  "content": "It is official and I reckon that this fight can be bigger than Errol Spence vs. Terence Crawford with the proper marketing and promotion. Boxing fans will get at least one of the big fights they want in 2023.Gervonta Davis and Ryan Garcia announced through their Instagram accounts Thursday that their representatives have completed a deal for the popular knockout artists to meet in a much-discussed showdown on a date to be determined in 2023. Their 12-round fight, which will be contested at a catch weight of 136 pounds, will be a Showtime Pay-Per-View main event from an undetermined venue in Las Vegas.Read in full https://www.boxingscene.com/gervonta-davis-vs-ryan-garcia-showdown-finalized--170528It appears the sportsbooks are listing Tank Davis as the favorite. However, this is only the beginning. The odds might change when the fans from Mexico and the women start betting hehehehe.Bookmakers made Gervonta ‘Tank’ Davis a favourite against Ryan Garcia in a potential future bout between the pair, when they last released odds on November 17, 2022.He is currently 4/9 (-230) to win the bout outright, while you can get 31/20 (+150) on Ryan Garcia if you fancy the small upset.Source https://box.live/boxing-betting/davis-vs-garcia-odds/That means that oddsmakers think there is 64% chance of Davis winning while giving Garcia a 36% chance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422053",
  "comments": [
    {
      "author": "bittraffic",
      "created_time": "November 18, 2022, 01:54:43 AM",
      "body": "Ryan Garcia fighting a real contender is one of the most awaited. But this is if Tank is not going to jail for his hit-and-run violations, Ryan must have been praying for jail time before the date. January 7 according to the article so he has more time for it's moved to May.Having no belt to risk seem very unlikely for these guys to fight, so expect the fight to be delayed again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "November 18, 2022, 03:36:56 AM",
      "body": "Good news indeed, although what Tank Davis hold is just the paper belt as Haney has all the belts right now.But with the hype surrounding this fight and this two going out in public and social media to verbally attack each other and wanted to fight, make sense that the deal is finally in table.They really hate each other, so just imagine the weigh in and the stare down and the promotions. Not sure who to look and who will take the W hear, both have power to knock each other out. But I'm not be surprised to see Davis being the favorite in the sports bookies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "November 18, 2022, 05:03:50 AM",
      "body": "@Yaunfitda. Agreed. They might not be the champions and the kings of their weight divisions, however, they have the biggest names. This is very much similar to Conor McGregor and Nate Diaz in the UFC, I reckon. It can also be argued that this fight might be as big or bigger than Spence vs. Crawford in excitement and expectation for the fans.@bittraffic. It will not be delayed again. The promoters, their teams and themselves certainly want to receive a large amount of money on May 2023 heheehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 18, 2022, 05:32:20 AM",
      "body": "This is going to be an exciting fight. Both of them are young and undefeated and have powerful punches. But saying that this match is going to be bigger than a potential Spence vs. Crawford match is an exaggeration. Neither Davis nor Garcia is comparable to either Spence or Crawford. Neither Davis and Garcia has made it to any top 10 pound-for-pound rankings. On the other hand, both Spence and Crawford are top pound-for-pound fighters, in ESPN, The Ring, BWAA, and others. Anyway, I'm for Tank here. Although Ryan has really a significant height advantage and is also quick and is even the more aggressive fighter, I think Tank's left is more powerful than Ryan's right. Ryan may have the reach, but Tank is a great counter puncher. It also doesn't help that Ryan has been fighting against unknown fighters recently. Nothing prepared him for a strong and talented opponent as Tank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "November 18, 2022, 06:14:34 AM",
      "body": "There's still no official date but both agree to fight each other, Ryan Garcia needs this fight to materialize he is the one who dares Tank to fight, he's been doing this for the last two years, I still remember Mike Tyson's podcast he is daring Tank for them to fight, he's been left behind in the lightweight division, Kambosos became the undisputed champion now Haney is the undisputed world champion, Tank Davis has been winning the title and defending his title, Ryan Garcia is considered as the best lightweight fighter in papers.His promoters are not doing him good by fighting low-level fighters he really needs to step up although Tank Davis is a risky fight he needs this fight to prove himself, I hope there'll be an official date so we can all bookmark it, I consider this as good as the Spence - Crawford match up that did not materialize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 18, 2022, 07:23:43 AM",
      "body": "I will also go with Tank here, and he is used to fight tall fighters, so I doubt that there is an advantage of Ryan in terms of height and reach. And this fight can really end in a knock out.And like what Ryan said in the past, he wanted Davis because he will get the respect in this division. And since the Crawford vs Spence has died down, this could be the next biggest fight, hype has build up even before the actual announcement of the fight date. And it's good the the network has sit down and talk, , Showtime will handle the telecast, but it is available on DAZN, but the PPV sales are separated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "November 18, 2022, 07:46:32 AM",
      "body": "Quote from: bbc.reporter on November 18, 2022, 05:03:50 AM@Yaunfitda. Agreed. They might not be the champions and the kings of their weight divisions, however, they have the biggest names. This is very much similar to Conor McGregor and Nate Diaz in the UFC, I reckon. It can also be argued that this fight might be as big or bigger than Spence vs. Crawford in excitement and expectation for the fans.Yeah, they might not be champions but this is what hard core fans of this sweet science is longing for as well as the ordinary fans, they want to see toe to toe actions which for me this fight if pushes through could deliver the actions. I reckon that this is an even match, though Davis is the experienced fighter but Garcia has the size advantage that if used well could make life hard for Davis.I just hope though that this would push through this time and not just hype on social media and end up like the Spence vs Crawford negotiation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "November 18, 2022, 09:13:19 AM",
      "body": "One of the most awaited fight next year, and finally it's being realized and it's time for Ryan Garcia to prove that he can beat a real champion. Though Ryan Garcia here has the height and reach advantage, but Tank Davis is a champion for a reason, he is quick and has a high IQ in the ring, so it's good that these two will clash next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 18, 2022, 09:17:14 AM",
      "body": "After many months of speculations, finally this fight is made so Kudos to Oscar Dela Hoya and Floyd Mayweather for letting this fight happen. The fans are asking for this, both boxers, hyping it, by going back and forth. And if I'm not mistaken, there are even a confrontation between the twoQuoteMultiple-time world champion Gervonta Davis has given his insight into the conversation with Ryan Garcia in a nightclub. The 27-year-old says that he was told to leave Garcia (23-0, 19 KOs) alone by Al Haymon.Initially, the 24-year-old American fighter said that the “Tank” grabbed his chain while confronting him at the club.As he was narrating the story, you could feel that Garcia almost choked with emotions. Some fans suggested that he was on the verge of crying.The younger American has talked animatedly about Davis in the media.“Al [Haymon] told me to leave him because he went crying to his lawyer. Al got a little scared because they were going to pull out of the fight,” Davis said on social media.https://www.fightsports.tv/gervonta-davis-opens-up-on-ryan-garcia-confrontation/For sure this has attracted all boxing fans, casual and hardcore. So yes, I think this could be bigger than the Spence vs Crawford (didn't materialized unfortunately).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "November 18, 2022, 12:13:08 PM",
      "body": "Quote from: Baofeng on November 18, 2022, 09:17:14 AMAfter many months of speculations, finally this fight is made so Kudos to Oscar Dela Hoya and Floyd Mayweather for letting this fight happen. The fans are asking for this, both boxers, hyping it, by going back and forth. And if I'm not mistaken, there are even a confrontation between the twoOscar Dela Hoya and Mayweather are both boxers and they both attained greatness because they fight the best in their era, its time to give their boys a chance to prove that they are the best in there, this is the kind of fight the boxing community wants both undefeated, both on the prime of their career and both want to establish their legacy, could become the biggest fight in 2023 and could become a trilogy, its been a long time we haven't seen trilogy from rivalries, so this is the first step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "November 18, 2022, 12:17:29 PM",
      "body": "Quote from: coin-investor on November 18, 2022, 12:13:08 PMQuote from: Baofeng on November 18, 2022, 09:17:14 AMAfter many months of speculations, finally this fight is made so Kudos to Oscar Dela Hoya and Floyd Mayweather for letting this fight happen. The fans are asking for this, both boxers, hyping it, by going back and forth. And if I'm not mistaken, there are even a confrontation between the twoOscar Dela Hoya and Mayweather are both boxers and they both attained greatness because they fight the best in their era, its time to give their boys a chance to prove that they are the best in there, this is the kind of fight the boxing community wants both undefeated, both on the prime of their career and both want to establish their legacy, could become the biggest fight in 2023 and could become a trilogy, its been a long time we haven't seen trilogy from rivalries, so this is the first step. Too early to talk about trilogies, but in any case if this fight goes on like that, then I wouldn't be surprised.But first the fight should be close enough to merit a rematch, and then eventual 3rd fight. So we will have to see how this fight will end, if this goes on a distance and again, hard to judge and a controversy arises, for sure they might want to do a second fight and settle.However, both are knockout artist, and most likely this fight might not go to distance in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "November 18, 2022, 12:36:57 PM",
      "body": "Quote from: btc_angela on November 18, 2022, 12:17:29 PMQuote from: coin-investor on November 18, 2022, 12:13:08 PMQuote from: Baofeng on November 18, 2022, 09:17:14 AMAfter many months of speculations, finally this fight is made so Kudos to Oscar Dela Hoya and Floyd Mayweather for letting this fight happen. The fans are asking for this, both boxers, hyping it, by going back and forth. And if I'm not mistaken, there are even a confrontation between the twoOscar Dela Hoya and Mayweather are both boxers and they both attained greatness because they fight the best in their era, its time to give their boys a chance to prove that they are the best in there, this is the kind of fight the boxing community wants both undefeated, both on the prime of their career and both want to establish their legacy, could become the biggest fight in 2023 and could become a trilogy, its been a long time we haven't seen trilogy from rivalries, so this is the first step. Too early to talk about trilogies, but in any case if this fight goes on like that, then I wouldn't be surprised.But first the fight should be close enough to merit a rematch, and then eventual 3rd fight. So we will have to see how this fight will end, if this goes on a distance and again, hard to judge and a controversy arises, for sure they might want to do a second fight and settle.However, both are knockout artist, and most likely this fight might not go to distance in my opinion.It's unlikely to go the distance, both fighters are always ready to engage but most of their knockouts from the counter punches, I'm sure both fighters will respect the punches I see Ryan being on the offensive here because he is the taller guy and with good reach advantage, but between the two its Tank who has the experience I feel that even if there is a knock out if the early stage of the fight is very even there will be a rematch, there are times when there is rematch even if there's a knockout, we'll see who is the most explosive puncher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 18, 2022, 02:45:36 PM",
      "body": "Quote from: aioc on November 18, 2022, 12:36:57 PMIt's unlikely to go the distance, both fighters are always ready to engage but most of their knockouts from the counter punches, I'm sure both fighters will respect the punches I see Ryan being on the offensive here because he is the taller guy and with good reach advantage, but between the two its Tank who has the experience I feel that even if there is a knock out if the early stage of the fight is very even there will be a rematch, there are times when there is rematch even if there's a knockout, we'll see who is the most explosive puncher.Ryan is more explosive. Apparently not quick enough against Davis but they will be cautious to each other. any of them fights the same way, same pattern, he'd be predictable. whoever wins will have a title shot against Haney? this fight will determine whether the public still has to desire for PPV despite the rocky economy. Oscar and Floyd decide too late for this to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "November 18, 2022, 03:20:54 PM",
      "body": "Quote from: bbc.reporter on November 18, 2022, 12:11:33 AMIt is official and I reckon that this fight can be bigger than Errol Spence vs. Terence Crawford with the proper marketing and promotion.We know Davis vs Ryan both are undefeated boxers, we see the way they bet in the ring, they are both dubbed as the current king of boxing, but if you want to bet on them I think not now, wait for them to announce the official date of the fight between Davis vs Ryan, even though there is currently a lot of news saying the two of them will meet next year, but we often see them throwing words of war between the two of them outside the ring/arena.Afraid, they will cancel their meeting to meet/box next year, maybe I think it's better if the schedule and everything is 100% official they bet then it's decided to place the bet, My consideration is for the two of them Davis vs Ryan to monitor in detail for the next after they have signed their contracts both finals, l will choose the best of them to place a bet on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "November 18, 2022, 04:13:38 PM",
      "body": "At last! After all the commotion happened in the industry these past few weeks and months, we are now given a fight that we wanted. Ryan Garcia vs Gervonta Davis! I'm thinking that this fight will eventually happen soon because of the political ties, that is why I haven't thought anything that both camps are already considering nor talking behind the scenes.At least, we've got the fight that we wanted. By the way, which division is this fight will be contested?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "November 18, 2022, 04:24:41 PM",
      "body": "Quote from: Hypnosis00 on November 18, 2022, 09:13:19 AMOne of the most awaited fight next year, and finally it's being realized and it's time for Ryan Garcia to prove that he can beat a real champion. Though Ryan Garcia here has the height and reach advantage, but Tank Davis is a champion for a reason, he is quick and has a high IQ in the ring, so it's good that these two will clash next year. Yes, finally. Ryan Garcia can now have a shot at the throne of Davis's and might dethrone the current champion if he's talent and skills will prevail over Tank Davis. But certainly he won't getting a nice and safe journey because cracking the current champion won't be easy even if Garcia here already have what it takes as Garcia is different that is why he is the champion. Garcia might've got the advantages needed but he also need to outsmart Tank's IQ in the ring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 18, 2022, 04:32:15 PM",
      "body": "Quote from: bbc.reporter on November 18, 2022, 12:11:33 AMIt appears the sportsbooks are listing Tank Davis as the favorite. However, this is only the beginning. The odds might change when the fans from Mexico and the women start betting hehehehe.For sure it will make a huge difference if the women will vote for the favorite LOL. I think Davis has high chance to defeat Garcia but everyone knows how explosive Garcia too so this wouldn't just be an easy feat for Davis. I think this fight is huge and a proper marketing would surely get some boxing fanatics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "November 18, 2022, 05:54:37 PM",
      "body": "Quote from: rhomelmabini on November 18, 2022, 04:32:15 PMQuote from: bbc.reporter on November 18, 2022, 12:11:33 AMIt appears the sportsbooks are listing Tank Davis as the favorite. However, this is only the beginning. The odds might change when the fans from Mexico and the women start betting hehehehe.For sure it will make a huge difference if the women will vote for the favorite LOL. I think Davis has high chance to defeat Garcia but everyone knows how explosive Garcia too so this wouldn't just be an easy feat for Davis. I think this fight is huge and a proper marketing would surely get some boxing fanatics.I doubt the odds will change, but I like the odds for Ryan Garcia as he has very attractive odds. I know some are criticizing him but this fight is going to be his biggest challenge and I'm willing to risk my bet on him because I'm tempted with the odds. Also, I'm thinking of betting on Ryan Garcia winning by KO once the odds are out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 18, 2022, 06:27:35 PM",
      "body": "Quote from: Yamifoud on November 18, 2022, 05:54:37 PMQuote from: rhomelmabini on November 18, 2022, 04:32:15 PMQuote from: bbc.reporter on November 18, 2022, 12:11:33 AMIt appears the sportsbooks are listing Tank Davis as the favorite. However, this is only the beginning. The odds might change when the fans from Mexico and the women start betting hehehehe.For sure it will make a huge difference if the women will vote for the favorite LOL. I think Davis has high chance to defeat Garcia but everyone knows how explosive Garcia too so this wouldn't just be an easy feat for Davis. I think this fight is huge and a proper marketing would surely get some boxing fanatics.I doubt the odds will change, but I like the odds for Ryan Garcia as he has very attractive odds. I know some are criticizing him but this fight is going to be his biggest challenge and I'm willing to risk my bet on him because I'm tempted with the odds. Also, I'm thinking of betting on Ryan Garcia winning by KO once the odds are out. I doubt that as well considering most of those who are betting are lads, I know that was an intended pun by the OP. I think odds will be out in no time since people will anticipate this huge fight the next year, I think it is. Can't say a KO here but more like a unanimous decision considering these two will surely last until the end of the 12 rounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}