{
  "id": "topic_5436988",
  "title": "Silence Scream",
  "author": "Silence Scream",
  "created_time": "January 27, 2023, 11:30:02 AM",
  "content": "Arkadaşlar hepimiz 555-666-777 gibi rakamları görmüşüz ve dikkat etmişizdir. Bu rakamlar ile ilgili olarak internette araştırma yaparken bu rakamların “Melek Numerolojisi” adı altında spiratüel inanışlara sahip kişiler tarafından kullanıldığını gördüm. Bu sayıların her birinin bir anlamı temsil ettiğine inanıyorlar. Genelde internette 777 rakamını görürsünüz. 777, spiratüele göre daha fazla mucizenin gerçekleşmesini bekleyebilirsiniz anlamını taşıyormuş. Bazı sayılar ve anlamlarını Aşağıdaki linkten bulabilirsiniz.Ayrıca bazı rakamlar yansıma rakamlar da oluyor örneğin 21.12, 23.32 gibi. Bunların da numerolojide bir anlamı var.Siz daha önce böyle bir kavram duymuş muydunuz? Kaynak : https://www.spiritueller.net/spirituel/melek-numerolojisi-tekrarlayan-sayilarin-anlamlari/amp/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436988",
  "comments": [
    {
      "author": "wolwoo",
      "created_time": "January 27, 2023, 11:34:07 AM",
      "body": "666 şeytan galiba 66 Allah lafzı diye biliyorum rakamlar önemli her manada",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "January 27, 2023, 11:51:49 AM",
      "body": "Duydum numeroloji,kriptoloji ve semboller oldukça ilgimi çekmiştir. Bu saydığınız numaraların da evrensel bir kriptolojisi olduğuna inanıyorum ispat edilebilir mi bu numaraların uğurlu oldukları. imkansız, sadece varsayım bundan da öteye gidilmiyor..11- Sayı 11, Karma ile ilgili olan Ana sayıdır. Bu sayı aynı zamanda ruhsal uyanışın bir sembolüdür.432- Sayı 432, hepimize sakinleştirici bir güvence mesajı getiriyor.Tam da olmamız gereken yerdeyiz.Her şey sizin çıkarlarınız doğrultusunda, ilahi plan doğrultusunda ilerliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "50promil",
      "created_time": "January 27, 2023, 12:14:51 PM",
      "body": "sayıların bir anlamı falan yok. insanlar nereden bakmak isterse oradan bakıyor .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "January 27, 2023, 12:47:27 PM",
      "body": "Bu işlere pek inanmıyorum.Bana göre astroloji ve bu numaralar insanları kandırmak için yapılan uydurma şeyler.Bununla ilgili bazı medyum diye bilinen şahısların açıklamaları da var.İnsanlara duymak istediklerini söylüyoruz diyordu.Bu ünlü isimlerin medyumluğunu yapan bir şahıstı üstelik.Bu yüzden rakamların bir şeyleri tetiklediğini inanmıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ozgr",
      "created_time": "January 27, 2023, 12:58:00 PM",
      "body": "Quote from: W Jr. on January 27, 2023, 12:47:27 PMBu işlere pek inanmıyorum.Bana göre astroloji ve bu numaralar insanları kandırmak için yapılan uydurma şeyler.Bununla ilgili bazı medyum diye bilinen şahısların açıklamaları da var.İnsanlara duymak istediklerini söylüyoruz diyordu.Bu ünlü isimlerin medyumluğunu yapan bir şahıstı üstelik.Bu yüzden rakamların bir şeyleri tetiklediğini inanmıyorum. Astrolog ve medyum denilen kişilerin çoğu zaten hikaye. Numeroloji biraz kişisel deneyimlerle kendimize kanıtlayabileceğimiz şeyler.Bütün sayıların ve harflerin ayrı ayrı titreşimi olduğuna inanıyorsanız deneyebilirsiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "January 28, 2023, 07:37:37 PM",
      "body": "Biz insanların en fazla kandırıldığı alanlardan birisi astroloji. Kartların çevrilmesiyle ilgili gelecek kararı vermek veya falcılar ile gelecek kararı vermek dinimizce yasaklanmış çünkü gayb hakkında büyük engeller var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "January 29, 2023, 04:33:17 AM",
      "body": "Hocam ben pek sallamam böyle şeyleri de hanım biraz dikkat ediyor işte saatler aynı saat aynı dakikaya gelince bir şey oluyor gibi bir düşüncesi var dur sorayım bakayım bilgisi var mıymış  ben genelde 14:53 saatine dikkat ediyorum denk gelince aha İstanbul’un fethi diyorum daha ilerisi yok bende",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 31, 2023, 11:47:18 AM",
      "body": "Bu sayılarla ilgili tek hatırladığım bir ara forumda 777 imza kampanyası olduğuydu  baya da Türk kullanıcı vardı, onun dışında 666 şeytan rakamı diye biliyorum, daha ötesi bende yok, sayıların hepsi birbirine benziyor sonuçta aynı sayıdan bir sürü anlam çıkarmak mantıksız bence,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "February 01, 2023, 03:22:22 AM",
      "body": "sayılar her yerde, biraz matrix tarzı bir laf oldu ama olsun https://m.dinimizislam.com/detay.asp?Aid=463Kainat da belirli sayılar ve oranlar ile ayakta duruyor. Havadaki gaz oranları, iklim ve sıcaklık değerleri, kan şekeri, tansiyon vs vs vs dolayısıyla rakamlar ile arası iyi olan her zaman avantajlıdır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}