{
  "id": "topic_5456495",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "June 15, 2023, 10:21:24 PM",
  "content": "This is not the first time bitcoin is experiencing price drop, it only needs few time; months or years to correct and hit another ATH. Few years back many investors took the loss and cashed out their money, believing that bitcoin settled for lesser price. Don't be in such a hurry to move out your investment; bitcoin is falling in price so that it can rise up again. Below is a tweet of a bitcoin investor 12 years ago, that should encourage people to hodl and hope for the best in the market. I know some will never sell, when it hits a high price, but for profits purposes there's no gain in withdrawing an investment now that the price is below or slightly above the amount you bought in the market. Unless you depend on the funds for survival or for other important dispute, keep holding on. Tom only had to wait for 6 years to meet the 2017 pump; a long time indeed! Isn't the wait worth it?Photo @Rizzo",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456495",
  "comments": [
    {
      "author": "Baofeng",
      "created_time": "June 15, 2023, 10:38:47 PM",
      "body": "I think the we have gotten over the huge drop, it was from last year, the negative effect of FTX collapse doing some damage to the market when we bottom at $15,500. So right now, this is just a rebound from that. We even touch $31,000 around March-April if I'm not mistaken. And technically we are still in the bear market, so be ready to experience some drop or even a big one. Just like what we have seen after SEC filed a case against Binance, we thought that we will retest $23k again as $25k support has crumbled, and yet we are back to above $25k again.So patience is the key here, or just continue to stack sats, just look for the long term perspective. For sure those who have seen the previous bear/bull cycle knows what to do and has a lot of mental toughness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "June 15, 2023, 10:44:30 PM",
      "body": "Nothing's new if you're here for years, in this industry. If you know the possible reasons of the market price decline then you shouldn't be worried of things. Best thing is to wait for the bottom and accumulate more to be held until the next bullrun. Nothing would come in an instant. What happened recently with large exchangers of this industry, probably created FUD and FOMO towards investors simply because things were associated with alike occurrnce last year. Also with the CME gap around $20k, therefore it is normal. I'd rather just sleep on this one and avoid checking the market often to avoid stressing myself out. The market prices would either go up or down, and that should be it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 15, 2023, 10:59:15 PM",
      "body": "Yea, newbies or I should say some crypto amateurs would would not be convinced about the whole long period of waiting time just as on the picture you provided. But some Bitcoinners who are experienced here would know that the waiting time is not yet reached and even if it does and price is still down, they can give it more time. It's just how the markets have always been right from time. Cryptocurrency price are dynamic, that there is not very accurate predictions, so we should just keep holding and also buying the Dip or using DCA to accumulate more Bitcoin in this season. I still remember an old saying, that goes , \"after rain, comes sun.\" the price is down now but will still normalize within some period of time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "June 15, 2023, 11:03:42 PM",
      "body": "If you are a long-term holder you should know how many years you will hold the Bitcoin you bought. And you should also have a lot of patience if you do decide to hold Bitcoin. Because if you are not sure that you have long patience, you are not good for long-term investment in my opinion.But he has been waiting for 6 years (Thomas), he should be patient and not waste the year that has passed just because he feels he is impatient because the thing he is expecting here will take a long time to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "June 15, 2023, 11:21:43 PM",
      "body": "From the years that I've been into this market, that's what I've learned and that's to take profit when it's on high. It's not gonna hurt my ego to have to see my lessened portfolio because that's how it should go, to enjoy my profits earned from my investments on this market.Other than that, holding is truly one of the best strategies that I've ever learned. These scenarios of plummets and crashes, it taught me a lot of things especially in forcing me to be patient when I'm thinking of dumping as much as I can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "June 15, 2023, 11:31:23 PM",
      "body": "Waiting for this kind of jump will take a long time, it cannot be seen with just a few days of investment. People who hodl since the beginning of bitcoin and sell it when ATH in 2017 or even ATH 2021 will be a long-term investment that is worth the time it takes. But of course only a few percent of people can hold it until now. The long term will be very difficult when only focusing on quick profits. Buy now and try to hold it for the next 5-6 years, the profit might be worth the time. Buying more and holding until the new ATH is reached is also good enough, but can it last for a long time? because the market will continue to fluctuate and will play the psychology of everyone who holds it. then it's better to buy and forget.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 16, 2023, 01:50:01 AM",
      "body": "Quote from: Accardo on June 15, 2023, 10:21:24 PMTom only had to wait for 6 years to meet the 2017 pump; a long time indeed! Isn't the wait worth it?6 years of wait is more than enough than we compare it with any investment like a stock. As I know, Warren Buffet is wait for 10 years to get a profit from the stock he bought. While the bitcoiners is just waiting only 4 years when we calculate with halving bitcoin period. So, I don't know why we don't have a bit of patience. the growth and profit of bitcoin is much bigger than other investments, so when we have a bit forbear, our wealth is the same as 20 years time investor.The weakness that we have is we don't focus on what we held and are easily influenced by dumper. That homework we should to solved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bazzu",
      "created_time": "June 16, 2023, 02:31:48 AM",
      "body": "for people who invest using money that is ready to lose or idle money, of course, they will be calm in facing any situation and of course they will be patient even though they have to wait for years, but for people who invest using money that is not ready to lose, of course they will feel frustrated because the btc price is always down and down, and it will certainly be tiring for investors who use money who are not ready to lose or who are not idle.but personally I really enjoy my investment because I invest using idle money and am ready to take risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "June 16, 2023, 02:35:46 AM",
      "body": "No, I am not tired or waiting for any pump to happen as soon as today. Just give it some time, it literally went from $3000 to $69000. That's a 23x move.Let it calm down, let the shitcoins craze go down, then we will start going up again. Most probably after the next Bitcoin Halving which is scheduled for May-June 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "June 16, 2023, 02:45:04 AM",
      "body": "Quote from: Accardo on June 15, 2023, 10:21:24 PMThis is not the first time bitcoin is experiencing price dropWe had a drop recently, not a crash. A drop is better than any crash.  The Bitcoin Crash of 2021 Compared to Past Sell-OffsYou would see a latest drop is better than all crashes in the image.Quoteit only needs few time; months or years to correct and hit another ATH.If Bitcoin block reward halving continues its historical effects like past halvings and previous bull cycles.About 315 more days till the 2024 halving.QuoteFew years back many investors took the loss and cashed out their money, believing that bitcoin settled for lesser price. Don't be in such a hurry to move out your investment; bitcoin is falling in price so that it can rise up again.Buying high, selling low or buying low and selling high or around all time high, you decide.When you sell, others who are buying would think they are taking an opportunity. When you are buying, others who are selling would think that you are taking risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 16, 2023, 03:00:53 AM",
      "body": "I don't think that getting tired should be one traits of a investors, not just in bitcoin, but in any other markets. So definitely, it's going to be a long and hard for us, but along the way of holding for a long time, it's going to be very good for us.Maybe the best approach is try to hold for at least one cycle and see it for yourself. Definitely you are going to make money on that time frame. But if you want more profits then you should hold a bit longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 16, 2023, 03:16:41 AM",
      "body": "To those who are impatient with Bitcoin, take time to review its previous price movements. It's up and down all the time. But the up is always worth waiting. It pays to wait. Bitcoin is a waiting game most of the time. You lose patience and sell when Bitcoin is down, you lose money. Buy low sell high is a Bitcoin investment advice that can't get old. If only we stay within reason and stick to this, we can't go wrong. If you're feeling tired, perhaps you're checking on the price too often. Quit it, especially during the not-so-good days. Do some other things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FrozenBit",
      "created_time": "June 16, 2023, 03:33:51 AM",
      "body": "I think it is understandable that many of us lose patience in investing in btc, since our lives are not tied to btc alone, not everyone has the complete financial freedom to invest comfortably, as well as have the experience to implement a plan that helps balance both life and investment. And the fact that the market is so volatile on a personal level, I will console myself, this is a good opportunity to help purify this market as well as have more time to accumulate and wait for a new bull cycle future. If you wait patiently for the price of BTC to increase over time, I think everyone will get a good profit, but this market includes many different factors as well as different investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "June 16, 2023, 07:29:28 AM",
      "body": "Quote from: Sarah Azhari on June 16, 2023, 01:50:01 AM-snip-The weakness that we have is we don't focus on what we held and are easily influenced by dumper. That homework we should to solved.Homework is never done when bad hands are holding and not focusing on what is being held. Always panicking when the dumper starts working, getting affected by FOMO and not following the strategy already made. Everything done will only end in losses. People like this really need to psychologically train themselves when trading or investing.Quote from: ImThour on June 16, 2023, 02:35:46 AMNo, I am not tired or waiting for any pump to happen as soon as today. Just give it some time, it literally went from $3000 to $69000. That's a 23x move.Let it calm down, let the shitcoins craze go down, then we will start going up again. Most probably after the next Bitcoin Halving which is scheduled for May-June 2024.The next halving is the target for everyone to start selling their holdings and today it is only necessary to buy and hold on. But those who panic too much will not be able to hold on until the 2024 halving.Quote from: OcTradism on June 16, 2023, 02:45:04 AM-snip-Buying high, selling low or buying low and selling high or around all time high, you decide.When you sell, others who are buying would think they are taking an opportunity. When you are buying, others who are selling would think that you are taking risk.It happens quite often, even when I first started trading, I was always cornered by the situation of whether to sell at a loss or hold it. When the price always goes down, I finally cut loss and buy again when FOMO occurs. It is quite a meaningful experience for me to be careful in every trade or investment.Quote from: Dave1 on June 16, 2023, 03:00:53 AM-snip-Maybe the best approach is try to hold for at least one cycle and see it for yourself. Definitely you are going to make money on that time frame. But if you want more profits then you should hold a bit longer. Trying to hold for one cycle may need to be tested. After the 4th Halving, this is a good time. Now it is just a matter of buying and holding for a short period of time. The halving will happen next year at the start of May.Quote from: Darker45 on June 16, 2023, 03:16:41 AM-snip-If you're feeling tired, perhaps you're checking on the price too often. Quit it, especially during the not-so-good days. Do some other things. Checking prices every day or every time is only done by day traders or scalping traders. Those who invest for the long term should only check when necessary. Because if it is seen every day it will interfere with the strategy that has been compiled, because market fluctuations will affect our minds to start selling it when the price continues to fall or even rises but does not reach the target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 16, 2023, 11:32:33 AM",
      "body": "Technically you shouldn't buy bitcoin to make profit Bitcoin is not meant for profit making, it is the only decentralized money that is created to give you financial sovereignty. In fact if you ask me the reason why price hasn't been going up similar to a couple of years ago is because the adopters have changed from those who believe in bitcoin to those who want to make a quick profit. Which is why they panic sell at the sight of first bump in the road and create a sell pressure preventing the rise.Of course we can't talk about bitcoin price without mentioning the current ongoing economic crisis in the world specially the recession in the West.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "June 16, 2023, 12:08:32 PM",
      "body": "Yeah these are the stories I am looking forward to print and put on my desk. Gives me inspiration how people lost the path of being millionaires. I think it’s best practice we should start our journey from the current timeline and look forward to achieve that very path which we missed. Actually we aren’t missing it if we haven’t sold anything yet. I am bracing myself for the 2024 halving when I am sure Bitcoin is going to have amazing up drive. Who knows there gonna be more millionaires who are holding since 5-7 years back when Bitcoin was way down the current price. So yep one more vote from my side for this whole new experience. Keep holding and keep holding in your non custodial wallets or paper wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "June 16, 2023, 12:15:04 PM",
      "body": "Quote from: Accardo on June 15, 2023, 10:21:24 PMThis is not the first time bitcoin is experiencing price drop, it only needs few time; months or years to correct and hit another ATH. Few years back many investors took the loss and cashed out their money, believing that bitcoin settled for lesser price. Don't be in such a hurry to move out your investment; bitcoin is falling in price so that it can rise up again. Below is a tweet of a bitcoin investor 12 years ago, that should encourage people to hodl and hope for the best in the market. I know some will never sell, when it hits a high price, but for profits purposes there's no gain in withdrawing an investment now that the price is below or slightly above the amount you bought in the market. Unless you depend on the funds for survival or for other important dispute, keep holding on. Tom only had to wait for 6 years to meet the 2017 pump; a long time indeed! Isn't the wait worth it?Would love to do the same if I have enough money to use for hodling but I can't afford to do this so I guess the only thing we can for now is to continue trade it or find another source to gain profit out of our bitcoins have. To many good stories like that happen in the past and I also think it will still happen in future since we don't see yet the full potential of bitcoin since there are so many things to grow especially that its tecnology has been slowly noticed by many institutional investors across the globe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "June 16, 2023, 12:23:17 PM",
      "body": "The bear market currently at a good price compare to last year when bitcoin price dip below 19k. We are still seeing bitcoin price at $25k+,which makes it still on a better price to me. We might still experience a lower price as time goes because of Binance current saga with SEC. This is an opportunity for investors to stash more sats to their bitcoin portfolio or better still keep holding your coins and don't sell off due to panic because bitcoin price will go up sooner or later. Long term investment is necessary for every bitcoiner except for traders, it is only the weak hands that will panic and sell off",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "June 16, 2023, 12:36:58 PM",
      "body": "Quote from: Accardo on June 15, 2023, 10:21:24 PMThis is not the first time bitcoin is experiencing price drop, it only needs few time; months or years to correct and hit another ATH.If you're in the market for many years you will understand the flow of the market, old traders understand the FUDS and how the community struggles to win against it, it's the new investors and the unbelievers who are still doubting, they are always holding on to the scenario of what if, I can't blame them these investors invest their hard-earned money and their life savings. QuoteFew years back many investors took the loss and cashed out their money, believing that bitcoin settled for lesser price. Don't be in such a hurry to move out your investment; bitcoin is falling in price so that it can rise up again. Below is a tweet of a bitcoin investor 12 years ago, that should encourage people to hodl and hope for the best in the market. I know some will never sell, when it hits a high price, but for profits purposes there's no gain in withdrawing an investment now that the price is below or slightly above the amount you bought in the market. Unless you depend on the funds for survival or for other important dispute, keep holding on. Tom only had to wait for 6 years to meet the 2017 pump; a long time indeed! Isn't the wait worth it?I'm one of those many investors but I learned my lesson, from there I learned you have to extend your patience and keep believing, there's a part of your investment for short-term profit and for long-term holding, the long-term investment is the most important it is allocated to a price that many experts predicted to be its all-time high in the next ten years.Old Investors should look forward and beyond they have seen everything, you have something to regret if you do not take action and now is the best time to take action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}