{
  "id": "topic_5476472",
  "title": "julerz12",
  "author": "julerz12",
  "created_time": "December 04, 2023, 09:51:18 AM",
  "content": "I've setup a 2/2 multisig wallet on Electrum and cosigned it with a hardware wallet (Ledger).From what I've understood, your keys never leave the hardware wallet when signing transactions, correct?And since if I try and make a transaction on the electrum multisig wallet, I still need to sign it with the hardware wallet then broadcast it; it is an added security. Is my understanding correct?If so, are there any possible vulnerabilities in this setup? A possible means of someone accessing the multisig wallet I've setup and actually spending the coins, without access to the hardware wallet.Also, if the hardware wallet gets lost, I wouldn't be able to spend the coins too unless I restore it on another device. Correct?Sorry if I sound dumb, I tried searching specific answers and couldn't find any and as you know, some sources also cannot be trusted so I think it is better to get answers here instead.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476472",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 04, 2023, 10:14:13 AM",
      "body": "Multisig wallet are more secure and safer than single signature wallet. There is increase in security in this wallet setup.Quote from: julerz12 on December 04, 2023, 09:51:18 AMAnd since if I try and make a transaction on the electrum multisig wallet, I still need to sign it with the hardware wallet then broadcast it; it is an added security. Is my understanding correct?I am not a Ledger wallet user, but if it is 2-of-2 multisig wallet, you will need the two wallets to sign the transaction.Quote from: julerz12 on December 04, 2023, 09:51:18 AMFrom what I've understood, your keys never leave the hardware wallet when signing transactions, correct?Yes, your Ledger seed phrase and keys never go online.Quote from: julerz12 on December 04, 2023, 09:51:18 AMAlso, if the hardware wallet gets lost, I wouldn't be able to spend the coins too unless I restore it on another device. Correct?Yes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 04, 2023, 10:16:26 AM",
      "body": "Yes the keys and seed phrase are actually stored on the hardware wallet and does not leave the wallet. What I understand is when a hardware wallet is connected to software wallets like electrum it creates something like a watch only wallet. A watch only wallet doesn’t have any risk because no keys or seed phrase is stored on it, just the master public key I think.If the hardware wallets gets damaged or spoiled then you can import the seed phrase into another wallet either software or hardware to recover those funds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 04, 2023, 10:29:11 AM",
      "body": "Quote from: Zaguru12 on December 04, 2023, 10:16:26 AMWhat I understand is when a hardware wallet is connected to software wallets like electrum it creates something like a watch only wallet. A watch only wallet doesn’t have any risk because no keys or seed phrase is stored on it, just the master public key I think.Watch-only wallet is created when you import master public key generated by seed phrase or master private key, or when you import address or addresses. This is not the same as when you connected your wallet to a hardware wallet, or when you setup a multisig wallet with a software wallet and a hardware wallet. You did not connect Electrum with the Ledger with 2-of-2 multisig, it is just that you will need the two wallets to make transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dump3er",
      "created_time": "December 04, 2023, 10:54:25 AM",
      "body": "I was about to say a few words concerning the fees and a comparison between single-sig and multi-sig, but I recalled this overview, which I think is quite helpful as fees are often underestimated when the setup is chosen:But I can only support your intention to keep funds secure especially when the amounts are significant. Cutting corners may save you time, but not money, as it is only a question of time until it costs you money!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 04, 2023, 11:00:58 AM",
      "body": "Quote from: julerz12 on December 04, 2023, 09:51:18 AMI've setup a 2/2 multisig wallet on Electrum and cosigned it with a hardware wallet (Ledger).From what I've understood, your keys never leave the hardware wallet when signing transactions, correct?Yes, that's right, the private key is stored in a secure chip hardware wallet.Quote- https://trezor.io/learn/a/secure-element-in-trezor-safe-3- https://blog.coinkite.com/understanding-mk4-security-model/- https://www.coolwallet.io/blog/hardware-wallet-secure-element-complete-guide/- https://www.ledger.com/academy/security/not-all-chips-are-born-equalQuote from: julerz12 on December 04, 2023, 09:51:18 AMAnd since if I try and make a transaction on the electrum multisig wallet, I still need to sign it with the hardware wallet then broadcast it; it is an added security. Is my understanding correct?Yes, that's correct. You still need the hardware wallet to sign transactions on the previously created multi-sig wallet.Quote from: julerz12 on December 04, 2023, 09:51:18 AMIf so, are there any possible vulnerabilities in this setup? A possible means of someone accessing the multisig wallet I've setup and actually spending the coins, without access to the hardware wallet.He still needs a hardware wallet (or private key from the multi-sig address) to access the multi-sig wallet and all cosigner access from each wallet.Quote from: julerz12 on December 04, 2023, 09:51:18 AMAlso, if the hardware wallet gets lost, I wouldn't be able to spend the coins too unless I restore it on another device. Correct?Yes, that's correct; You can restore to another hardware wallet;When creating a new multi-sig wallet, make sure to use the Master Public key that you previously used so you can reaccess the wallet address on the multi-sig wallet you created.Quote from: julerz12 on December 04, 2023, 09:51:18 AMSorry if I sound dumb, I tried searching specific answers and couldn't find any and as you know, some sources also cannot be trusted so I think it is better to get answers here instead.The following is one of my practices when creating a multi-sig wallet using 2 Electrum wallets + 2 Hardware wallets on different OS and devices:https://bitcointalk.org/index.php?topic=5392586.msg60534500#msg60534500Quote from: Husna QA on July 08, 2022, 03:23:34 PMMulti-Signature Wallet using the Electrum and the Hardware Wallet.-snip-Wallet 1Wallet: Electrum Testnet 4.0.9 (macOS)Hardware wallet: Trezor TWallet 2Wallet: Electrum Testnet 4.0.9 (Windows OS)Hardware wallet: Ledger Nano X",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 04, 2023, 11:56:26 AM",
      "body": "Quote from: Husna QA on December 04, 2023, 11:00:58 AMWhen creating a new multi-sig wallet, make sure to use the Master Public key that you previously used so you can reaccess the wallet address on the multi-sig wallet you created.Did you mean master private key?It is not 2-of-3 multisig wallet, neither the number of signature needed are more than the number of cosigners. To recover 2-of-2 multisig wallet, everything needed are the two seed phrases, master private keys or private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 04, 2023, 01:02:36 PM",
      "body": "Quote from: Charles-Tim on December 04, 2023, 11:56:26 AMQuote from: Husna QA on December 04, 2023, 11:00:58 AMWhen creating a new multi-sig wallet, make sure to use the Master Public key that you previously used so you can reaccess the wallet address on the multi-sig wallet you created.Did you mean master private key?It is not 2-of-3 multisig wallet, neither the number of signature needed are more than the number of cosigners. To recover 2-of-2 multisig wallet, everything needed are the two seed phrases, master private keys or private keys.Master Public key, if you use a multi-sig wallet such as Electrum + hardware wallet because the hardware wallet already represents the master key or seed phrase.However, if you use a multi-sig wallet on Electrum without selecting the \"Use a Hardware Device\" option, you need a seed phrase or master key.Here's an example:Quote from: Husna QA on July 08, 2022, 03:23:34 PM-snip-Under wallet type, select Multi-Signature wallet.Then specify the Consigner and also the number of signatures needed to be able to process transactions in the wallet.On \"Add cosigner (1 of 2)\", I selected the option \"Use a hardware device\".In 'Hardware Keystore', select the connected device, then clicks  'Next'.- Device on Wallet (Cosigner) 1:- Device on Wallet (Cosigner) 2:Select the wallet address type; For \"derivation path\", I leave it by default.Then write the 'Master Public Key' it generates, then clicks  'Next'.- Master Public Key on Cosigner 1:- Master Public Key on Cosigner 2:On the 'Add Cosigner (2 of 2)', select 'Enter cosigner key'.In wallet 1, fill in using the master public key (xpub) of wallet 2:In wallet 2, fill in using the master public key (xpub) of wallet 1:Create a password to encrypt each wallet on both 'Cosigners'.Go to the 'Addresses' tab (View Menu -> Show Addresses), and make sure the addresses in all Cosigners are the same:- Address Wallet (cosigner) 1:- Address Wallet (cosigner) 2:-snip-",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 04, 2023, 01:14:23 PM",
      "body": "Quote from: Husna QA on December 04, 2023, 01:02:36 PMHere's an example:This is only the case if you are using two separate computers for your 2-of-2 multi-sig; one with an Electrum wallet storing the Electrum seed phrase, and another with an Electrum wallet storing no seed phrases but interacting with your hardware wallet.OP seems to have a set up a single wallet with contains the Electrum seed phrase and which he also connects to his hardware wallet. This is less secure than using completely separate devices, but still much more secure than a standard single sig hot Electrum wallet. With such a wallet, he does not need to interact with this xpubs since Electrum provides one seed phrase and the hardware wallet provides the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "December 04, 2023, 02:02:36 PM",
      "body": "Quote from: Husna QA on December 04, 2023, 01:02:36 PMHere's an example:Yes, on the part where it asks to add a cosigner, I use:'Cosign with hardware device'Quote from: o_e_l_e_o on December 04, 2023, 01:14:23 PMOP seems to have a set up a single wallet with contains the Electrum seed phrase and which he also connects to his hardware wallet. This is less secure than using completely separate devices, but still much more secure than a standard single sig hot Electrum wallet. With such a wallet, he does not need to interact with this xpubs since Electrum provides one seed phrase and the hardware wallet provides the other.Correct, I'm using an Electrum (desktop) and a connected a ledger wallet on the same system.What's the security risk of having both devices on the same system? Is the ledger wallet vulnerable when connected to the Electrum wallet?Everytime I open Electrum (multisig) wallet, It always asks to insert/connect the Ledger device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 04, 2023, 02:30:16 PM",
      "body": "Quote from: o_e_l_e_o on December 04, 2023, 01:14:23 PMQuote from: Husna QA on December 04, 2023, 01:02:36 PMHere's an example:This is only the case if you are using two separate computers for your 2-of-2 multi-sig; one with an Electrum wallet storing the Electrum seed phrase, and another with an Electrum wallet storing no seed phrases but interacting with your hardware wallet.-snip-Thank you for the additional explanation.Quote from: julerz12 on December 04, 2023, 02:02:36 PMCorrect, I'm using an Electrum (desktop) and a connected a ledger wallet on the same system.What's the security risk of having both devices on the same system? Is the ledger wallet vulnerable when connected to the Electrum wallet?In my opinion, the Electrum wallet is more vulnerable than the hardware wallet;Because you are using the same device, it must be online to make and broadcast transactions.Meanwhile, if you use a different device and a separate wallet, you can make it offline for the first Electrum Wallet. Then, to broadcast transactions that have been signed, you use the Electrum+hardware wallet on another online device.Quote from: julerz12 on December 04, 2023, 02:02:36 PMEverytime I open Electrum (multisig) wallet, It always asks to insert/connect the Ledger device.Because you have set the hardware wallet as one of the cosigners on the multi-sig wallet, if you don't connect it to Electrum, then the wallet can't be used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "December 04, 2023, 02:46:16 PM",
      "body": "Quote from: Husna QA on December 04, 2023, 02:30:16 PMIn my opinion, the Electrum wallet is more vulnerable than the hardware wallet;Because you are using the same device, it must be online to make and broadcast transactions.Quote from: Husna QA on December 04, 2023, 02:30:16 PMBecause you have set the hardware wallet as one of the cosigners on the multi-sig wallet, if you don't connect it to Electrum, then the wallet can't be used.So let's say while the hardware wallet is connected in Electrum, then Electrum somehow gets compromised, the hacker then sends a transaction; they still couldn't spend any coins unless they have physical access to the hardware wallet (ledger) to sign and broadcast the transaction, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 04, 2023, 03:13:23 PM",
      "body": "Quote from: julerz12 on December 04, 2023, 02:46:16 PMQuote from: Husna QA on December 04, 2023, 02:30:16 PMIn my opinion, the Electrum wallet is more vulnerable than the hardware wallet;Because you are using the same device, it must be online to make and broadcast transactions.Quote from: Husna QA on December 04, 2023, 02:30:16 PMBecause you have set the hardware wallet as one of the cosigners on the multi-sig wallet, if you don't connect it to Electrum, then the wallet can't be used.So let's say while the hardware wallet is connected in Electrum, then Electrum somehow gets compromised, the hacker then sends a transaction; they still couldn't spend any coins unless they have physical access to the hardware wallet (ledger) to sign and broadcast the transaction, right?Yes, when Electrum is compromised, let's say the hacker gets access to Electrum as cosigner 1. He still can't use the wallet because he needs the Hardware wallet as cosigner 2 to be able to complete the process of signing the remaining transactions from 2 of 2 multi-sig wallets.Therefore, separating multi-sig wallets on different devices can be more secure because one of the Electrum wallets can be used offline to minimize compromise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 04, 2023, 03:18:13 PM",
      "body": "Quote from: julerz12 on December 04, 2023, 02:02:36 PMWhat's the security risk of having both devices on the same system? Is the ledger wallet vulnerable when connected to the Electrum wallet?Only that having the wallets on two completely separate devices (i.e. one computer with Electrum with one seed phrase, and another computer with Electrum with no seed phrases which is used to interact with your hardware wallet) is safer than only using one device, since an attacker would need to compromise an additional device in order to steal your coins. Further, your second Electrum wallet which holds no seed phrases and only interacts with your hardware wallet could be permanently airgapped for even more security.Quote from: julerz12 on December 04, 2023, 02:46:16 PMSo let's say while the hardware wallet is connected in Electrum, then Electrum somehow gets compromised, the hacker then sends a transaction; they still couldn't spend any coins unless they have physical access to the hardware wallet (ledger) to sign and broadcast the transaction, right?Theoretically, yes. As far as I know, there are no known remote attacks against the most popular brands of hardware wallet where someone compromising your computer could remotely compromise your hardware wallet or make it sign transactions you didn't wish to sign. However, no one can guarantee 100% that such attacks do not exist. That is why the set up I described above is marginally safer, since the hardware wallet would only ever connect to a second (potentially permanently airgapped) device. The other option would be to swap out the Ledger for a permanently airgapped hardware wallet such as Passport.That's not to say your set up is not secure. It's much more secure than a standard Electrum wallet, since as you say an attacker would probably need physical access to your hardware wallet as well as compromising your Electrum wallet in order to steal your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "December 04, 2023, 03:23:22 PM",
      "body": "I see. Thanks guys for the well explained answers. I'm a bit confident now to use what I've setup. Tho I might still try and test it first with small amounts just to be sure I didn't miss anything.I've got no further inquiries.Again, thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 04, 2023, 03:25:43 PM",
      "body": "Quote from: julerz12 on December 04, 2023, 03:23:22 PMTho I might still try and test it first with small amounts just to be sure I didn't miss anything.That's always a smart idea. I would also recommend making a note of the first address in your multi-sig wallet, wiping your Electrum wallet, resetting your Ledger device, and checking you can recover the same multi-sig wallet using your back ups in order to verify that your back ups are accurate. Obviously you should back up your two seed phrases separately, and ideally, you want four back ups in total (two of each seed phrase) to provide protection against the accidental loss or damage of one back up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 04, 2023, 09:04:56 PM",
      "body": "Quote from: julerz12 on December 04, 2023, 03:23:22 PMI see. Thanks guys for the well explained answers. I'm a bit confident now to use what I've setup. Tho I might still try and test it first with small amounts just to be sure I didn't miss anything.I've got no further inquiries.After testing if you are actually using it for the large storage of funds I will advise two things. 1. After the test is done and you understand everything, do not use the exiting seed phrase or keys, just create a new one and then transfer all funds there to eliminate mistakes like the seed phrase or private touching the internet probably because you lack have knowledge before and make sure you do everything offline. 2. I would advise you take extra cost to get another device so that each co-signer will be on different devices even though this your current set up isn’t bad but this one will be more secure. And this time the devices should be airgapped to eliminate any chance of compromise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "igor72",
      "created_time": "December 05, 2023, 04:01:38 AM",
      "body": "I use such a ledger + electrum 2-of-2 wallet for long term storage. Besides the obvious pros there are a few cons:1. On the ledger display it is impossible to check the receiving address. Ledger can't check the change address either. There is no such problem with some other hardware wallets.2. You cannot sign a message.3. Transaction fee (segwit 1 input/2 outputs) is 27% higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "December 06, 2023, 12:46:52 PM",
      "body": "Quote from: igor72 on December 05, 2023, 04:01:38 AMI use such a ledger + electrum 2-of-2 wallet for long term storage. Besides the obvious pros there are a few cons:1. On the ledger display it is impossible to check the receiving address. Ledger can't check the change address either. There is no such problem with some other hardware wallets.Crap, that's a bummer. I haven't tried sending a transaction yet so I didn't know. Is there any solution for this?How about this setup? I make a multi-sig 3/3, Electrum Desktop [1], Ledger (hardware wallet) [2] and another Electrum desktop [3] (preferably on another device). Then, I make a transaction on 1st Electrum [1], then blindly sign it on Ledger [2] then finally sign and broadcast it on another Electrum [3] setup. At least on the 3rd and final Electrum, I can see the receiving address. Sort of like final screening before broadcasting the transaction rather than Ledger broadcasting it out without knowing if the receiving address is correct.Is my understanding right?  Quote from: igor72 on December 05, 2023, 04:01:38 AM2. You cannot sign a message.I noticed this too.Quote from: Zaguru12 on December 04, 2023, 09:04:56 PMAfter testing if you are actually using it for the large storage of funds I will advise two things. 1. After the test is done and you understand everything, do not use the exiting seed phrase or keys, just create a new one and then transfer all funds there to eliminate mistakes like the seed phrase or private touching the internet probably because you lack have knowledge before and make sure you do everything offline. Yes, I'm currently testing everything first on testnet before actually using the multisig wallet.Quote from: Zaguru12 on December 04, 2023, 09:04:56 PM2. I would advise you take extra cost to get another device so that each co-signer will be on different devices even though this your current set up isn’t bad but this one will be more secure. And this time the devices should be airgapped to eliminate any chance of compromise. Will do. I'm trying to get my hands on another device. BTW, I saw that Electrum has an Android app, would that suffice as the third setup? A mobile phone that is air-gapped. Or that app has limitations?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "igor72",
      "created_time": "December 06, 2023, 12:57:02 PM",
      "body": "Quote from: julerz12 on December 06, 2023, 12:46:52 PMQuote from: igor72 on December 05, 2023, 04:01:38 AMI use such a ledger + electrum 2-of-2 wallet for long term storage. Besides the obvious pros there are a few cons:1. On the ledger display it is impossible to check the receiving address. Ledger can't check the change address either. There is no such problem with some other hardware wallets.Crap, that's a bummer. I haven't tried sending a transaction yet so I didn't know. Is there any solution for this?You misunderstood me. You can see the recipient's address on the display. You cannot check your own receiving address.You just have to create in a file or print out a list of your addresses and check against it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}