{
  "id": "topic_5433683",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "January 09, 2023, 11:38:17 PM",
  "content": "QuoteThe increased quits rate is the opposite of what the Fed wants to seeAmericans wrapped up 2022 by quitting more. The overall quits rate grew in November after staying steady or declining for nine months, according to new data from the US Bureau of Labor Statistics.The overall quits rate climbed from 2.6% in October to 2.7% in November. Quits in the private sector hit 3% again, an increase from 2.9% the previous month. Job openings also remained steady from October to November at 10.5 million.This is the opposite of what Federal Reserve Chair Jerome Powell has said he wants to see in the labor market. Throughout 2022, Powell noted that the Fed would like to see job openings and quits decrease and wage growth slow down in order to help bring down prices. Still, the labor market is cooling off in some aspects. The hiring rate fell from 4% in October to 3.9% in November. That trend is likely to continue as recession fears weigh on employers—or as they simply become satisfied with their staffing levels after hiring sprees.https://qz.com/us-quit-rate-increase-in-november-2022-1849948946....I haven't seen it mentioned anywhere. But it is possible that one of the reasons people are quitting in high numbers involves them not being able to pay their bills with the salary they earn. Which has to be a tough spot to be in. It is known that many homeless living on the streets, have stable full time jobs and simply cannot find residence within an affordable range.Is it possible that economic and living trends will naturally shift in response to the shifting nature of wages and real estate costs. Perhaps in the future our culture will shift to become more nomadic and rural. People will adapt to become more like atilla the hun or genghis khan. Or is a shift towards nomadic lifestyles, no longer as easy as it once was. Nature and the wild no longer being able to offer as much in terms of potable water or foragable sustenance.While we have definitely seen a shift towards offgrid living and organic farming becoming mainstream trends. I don't think we have seen the full evolution of the cultural movement that will be spawned by automation of jobs and other modern trends. One interesting statistic to know is how many americans are currently employed in the crypto industry in the USA. And the size of the unbanked demographic. We have recently seen countries like spain, el salvador, argentina and others cater to digital nomads and crypto whales in an effort to achieve the opposite of capital flight. It has long been acknowledged that small business owners are responsible for the creation of 50% of new jobs. In which case, perhaps this makes the crypto industry with its good growth, liquidity and small business support as a logical sector to tap in order to stave off some of these negative economic conditions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433683",
  "comments": [
    {
      "author": "Despairo",
      "created_time": "January 10, 2023, 03:56:19 AM",
      "body": "I wonder why people are quitting their jobs? I know the most reason would be due to low salary, but how can they survive if they're not working? I think any people will accept any jobs even though how low the salary is, rather than become unemployed and doesn't earn anything. So IMO, they've already find a job that paid very well in private, which is like a programmer where they got paid with Bitcoin and they have a chance to publish it, so the government think they're not working, but the truth they're working in their home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 10, 2023, 04:06:09 AM",
      "body": "Quote from: Despairo on January 10, 2023, 03:56:19 AMI wonder why people are quitting their jobs? I know the most reason would be due to low salary, but how can they survive if they're not working? I think any people will accept any jobs even though how low the salary is, rather than become unemployed and doesn't earn anything. So IMO, they've already find a job that paid very well in private, which is like a programmer where they got paid with Bitcoin and they have a chance to publish it, so the government think they're not working, but the truth they're working in their home.Yes I never understood this either. I think what is happening they are quitting bad jobs like at McDonald’s and basically staying unemployed until they find something better. Most likely their friends had a bad job, at min wage and they looked for another job which was more fun and higher pay and they told all their friends about it and they also quit. And this is most likely all these min wage jobs that nobody wants to work because they are over difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 10, 2023, 06:01:33 AM",
      "body": "Quote from: Hydrogen on January 09, 2023, 11:38:17 PMI haven't seen it mentioned anywhere. But it is possible that one of the reasons people are quitting in high numbers involves them not being able to pay their bills with the salary they earn. Which has to be a tough spot to be in. It is known that many homeless living on the streets, have stable full time jobs and simply cannot find residence within an affordable range.That seems like the complete opposite of the logical thing to do, because even the shittiest-paying job is better than whatever you could get from government assistance programs.  That said, I don't have a clue why people are quitting their jobs or what the real state of the economy is.  Usually when there's an economic downturn, unemployment is high and people hold onto their jobs for dear life.Quote from: adaseb on January 10, 2023, 04:06:09 AMYes I never understood this either. I think what is happening they are quitting bad jobs like at McDonald’s and basically staying unemployed until they find something better. Most likely their friends had a bad job, at min wage and they looked for another job which was more fun and higher pay and they told all their friends about it and they also quit. And this is most likely all these min wage jobs that nobody wants to work because they are over difficult. What?  None of that makes any sense, especially that crap I bolded.  Sure, some people quit jobs without having anything else lined up, but that's a stupid move and not one most people make.  It'd be nice if the data released broke down the types of positions being quit.  McDonald's never seems to have a shortage of employees, by the way.  That's a transient job for most, so I doubt that's what this news is all about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "January 10, 2023, 09:57:00 AM",
      "body": "Quote from: Despairo on January 10, 2023, 03:56:19 AMI wonder why people are quitting their jobs? I know the most reason would be due to low salary, but how can they survive if they're not working? I think any people will accept any jobs even though how low the salary is, rather than become unemployed and doesn't earn anything. So IMO, they've already find a job that paid very well in private, which is like a programmer where they got paid with Bitcoin and they have a chance to publish it, so the government think they're not working, but the truth they're working in their home.Not a good reason to quit since crisis still occuring and they will go broke if they quit without having an alternative profit source. To many people accepting low salary jobs at the moment just to survive the ongoing crisis and maybe this kind of incident maybe a part of protest to the government to do something related to this issues. But all of this are just temporary since those guys will find job after they realized that they cannot do anything with these issues and they in badly need of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shinpako09",
      "created_time": "January 10, 2023, 10:01:00 AM",
      "body": "Quote from: Despairo on January 10, 2023, 03:56:19 AMI wonder why people are quitting their jobs? I know the most reason would be due to low salary, but how can they survive if they're not working? I think any people will accept any jobs even though how low the salary is, rather than become unemployed and doesn't earn anything. So IMO, they've already find a job that paid very well in private, which is like a programmer where they got paid with Bitcoin and they have a chance to publish it, so the government think they're not working, but the truth they're working in their home.Or, maybe the salary is fine but they are extravagant so they need to find a job that pays more to get the things they want. Or, they are envious of others salaries they see on different social media platforms, so they quit and try to do the same. Some are transitioning to working online which is more relaxing and pays the same or even more. That is also the trend right now and some people always follow the trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "January 10, 2023, 10:07:53 AM",
      "body": "I saw someone who's got a decent job but I'd forgotten the state and still ended up being homeless after years of working. It could really be related to the economic downfall and the state where they're living. But another reason is that their way of living and the salary they earn isn't really enough for their lifestyle. I'm balancing my thought about it because when someone who's earning decently but has a luxurious way of living, that's really not sustainable. While in the US, the number of quitters are increasing, in some other countries, jobs are too limited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "January 10, 2023, 10:15:23 AM",
      "body": "Quote from: Hydrogen on January 09, 2023, 11:38:17 PMI haven't seen it mentioned anywhere. But it is possible that one of the reasons people are quitting in high numbers involves them not being able to pay their bills with the salary they earn. Which has to be a tough spot to be in. It is known that many homeless living on the streets, have stable full time jobs and simply cannot find residence within an affordable range.I've also seen a documentary about homeless people who work as accountants or have other regular jobs.I used to believe that being homeless meant having no job, no family, and nothing at all, but after watching those documentaries, I realized that they were actually living on the streets by their cars while still going to work as having a house is very expensive even if it is an apartment.Back on topic, does this imply that they are changing careers or jobs to ones that pay more? This probably is true since waiting for a salary increase will take more years than finding another job, but again, the competition right now is difficult. But that is only the reason I can see why they quit their jobs, even if the situation right now is very difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "January 10, 2023, 10:48:20 AM",
      "body": "Wages that cannot cover all the necessities of a human being especially those who have a family. But I don't like quitting the job while there's no back up yet. I'd wait to see if I have a high chance to be employed again in another company before I pass my resignation. Being idle will get you nowhere and that means hunger. On top of that, what will I tell my wife?  About the street people though, I saw one streamer exploring Los Angeles and he was shocked at how many homeless people are there. Maybe that kind of strategy does work but only for singles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "January 10, 2023, 11:22:22 AM",
      "body": "QuoteThe overall quits rate climbed from 2.6% in October to 2.7% in November. Quits in the private sector hit 3% again, an increase from 2.9% the previous month. Job openings also remained steady from October to November at 10.5 million.Should we be worried about this statistic? The quit rate growing from 2.6% to 3% doesn't seem like a big deal to me.The ability of the people to quit their job and find a better job fast is actually a good sign for the labor market and it's flexibility.However, we don't know how many of the people, who are quitting manage to find new jobs.I think that the amount of job openings will start decreasing at the beginning of 2023. The labor market cooling down is supposed to be a signal for decreasing inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "January 10, 2023, 02:16:59 PM",
      "body": "Quote from: Despairo on January 10, 2023, 03:56:19 AMI wonder why people are quitting their jobs? I know the most reason would be due to low salary, but how can they survive if they're not working? I think any people will accept any jobs even though how low the salary is, rather than become unemployed and doesn't earn anything. So IMO, they've already find a job that paid very well in private, which is like a programmer where they got paid with Bitcoin and they have a chance to publish it, so the government think they're not working, but the truth they're working in their home.A commoner who commit him/herself to a day job with low salary and can't able to fulfill the monthly bills with the salary they're are getting thinks that they will stuck into more debt if they keep stuck in their so they quit and trying to find a new one which may fulfil the bill requirements. But as a temporary solution they can look for a part time job too which comes handy and give them a choice for their survival.But with the inflation rate its not really possible for an average waged person to survive so government has to do something to reduce the inflation rate or pass a policy to increase the minimum wage policy according to the inflation increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "January 10, 2023, 02:24:33 PM",
      "body": "Quote from: Hydrogen on January 09, 2023, 11:38:17 PMI haven't seen it mentioned anywhere. But it is possible that one of the reasons people are quitting in high numbers involves them not being able to pay their bills with the salary they earn. Which has to be a tough spot to be in. It is known that many homeless living on the streets, have stable full time jobs and simply cannot find residence within an affordable range.It will be pointless working a job that cannot pay bills completely, It is also dangerous being idle and without any Job.  The economy is in a terrible state and there is a need to be smart when making economic decisions. If you know that you can make the equivalent of what you make from work and even more from whatever skill you have but just need to dedicate more time to it, quitting your job is better off because salaries are fixed and rarely reviewed even if things are extremely tough economically. If you have no skill and know that you cannot earn the equivalent of your salary if you quit, holding on the job while looking for another better option is better than just quitting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cloirecrom",
      "created_time": "January 10, 2023, 02:46:53 PM",
      "body": "Do they have better alternative? wonder what make them quit their job",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 10, 2023, 04:01:24 PM",
      "body": "Quote from: cloirecrom on January 10, 2023, 02:46:53 PMDo they have better alternative? wonder what make them quit their jobAmidst a global recession, if some people are quitting their jobs, the reason must be far more serious than we can fathom. Not able to pay the bills with the salary, can't be the sole reason for quitting jobs. If that is the case, people will find a better paying job before leaving.But it seems that the career interests of the Americans are shifting. Instead of taking up jobs in corporates, they are becoming more interested into farming, entrepreneurship etc. Due to the cost of living in the big cities, the interest is shifting towards the countryside. Going back to the roots has its own perks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "January 10, 2023, 04:50:11 PM",
      "body": "Quote from: cloirecrom on January 10, 2023, 02:46:53 PMDo they have better alternative? wonder what make them quit their jobThe economic crisis and recession has something to do with it, like for example when the salary they were getting wasn't even growing but the stuff in the market like their needs and wants getting expensive/growing. What would you think you would do if all of your efforts for hard working isn't enough to satisfy your needs.I'm sure they aren't just quitting just to stay unemployed there has to be a reason and maybe they want a job that's worth their efforts and energy plus the stress and anxiety. Most of the people I've known or seen finding a worthy job that will give them enough to balance the overpricing stuffs in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jostorres",
      "created_time": "January 10, 2023, 05:45:34 PM",
      "body": "Quote from: avikz on January 10, 2023, 04:01:24 PMQuote from: cloirecrom on January 10, 2023, 02:46:53 PMDo they have better alternative? wonder what make them quit their jobAmidst a global recession, if some people are quitting their jobs, the reason must be far more serious than we can fathom. Not able to pay the bills with the salary, can't be the sole reason for quitting jobs. If that is the case, people will find a better paying job before leaving.But it seems that the career interests of the Americans are shifting. Instead of taking up jobs in corporates, they are becoming more interested into farming, entrepreneurship etc. Due to the cost of living in the big cities, the interest is shifting towards the countryside. Going back to the roots has its own perks. I believe that those people are working for a long time on a similar job so they also feel bored and they are now deciding to try something different. That's not a bad idea IMO only to bring back their excitement in life. Jobs outside like farming seems to be fun and relaxing in fact. I mean we can inhale the fresh air outside. We are exposed to sun and we can see the nature around us.If our concern is only the cost of living then I think quitting our current job is not a solution but we can still do some alternatives like budgeting. Either in the food that we eat or consuming electricity, water, etc. Adding another small job on the side should also help us to earn an extra income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "January 10, 2023, 09:53:21 PM",
      "body": "I guess,they are quitting their jobs and get into something independent from an employer, like self work. For instance,they can start up something on their own to sell or do that is more better than the pay gotten from their jobs. It is stupid to go and work for someone and at the end of the week or month,you can't take care of your basic needs with the pay,the best thing is to quit and look for something more helping. In my country as long as you are working, some of your relations will always ask you for assistance and when you tell them that you don't have,it will look as if you are greedy or don't want to give them,unknown to them that you pay can't take care of you properly. Inflation is everywhere and you will find out that your money worthless everyday by day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "January 10, 2023, 10:31:43 PM",
      "body": "Quote from: Oceat on January 10, 2023, 04:50:11 PMQuote from: cloirecrom on January 10, 2023, 02:46:53 PMDo they have better alternative? wonder what make them quit their jobThe economic crisis and recession has something to do with it, like for example when the salary they were getting wasn't even growing but the stuff in the market like their needs and wants getting expensive/growing. What would you think you would do if all of your efforts for hard working isn't enough to satisfy your needs.I'm sure they aren't just quitting just to stay unemployed there has to be a reason and maybe they want a job that's worth their efforts and energy plus the stress and anxiety. Most of the people I've known or seen finding a worthy job that will give them enough to balance the overpricing stuffs in the market.Would be totally no sense if you do quit or resign for your job just because it doesnt really fit out on their living or wont be that sufficient.If you do look towards on the action that you would potentially make then itwould really be worsen up your condition on which if you dont have job then where you would be going? Dont make things even more complicated, if you do find out that your current earning isnt sufficient thenfinding another source would be sensible rather than on quitting directly. Basing up on op about increasing rate of quitting their jobs then it is one of the obvious reasons but wondering on how they wouldreally be able to sustain themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 11, 2023, 04:13:50 AM",
      "body": "Quote from: The Sceptical Chymist on January 10, 2023, 06:01:33 AMWhat?  None of that makes any sense, especially that crap I bolded.  Sure, some people quit jobs without having anything else lined up, but that's a stupid move and not one most people make.  It'd be nice if the data released broke down the types of positions being quit.  McDonald's never seems to have a shortage of employees, by the way.  That's a transient job for most, so I doubt that's what this news is all about.When I was in high school a bunch of us had a crappy min wage job. Then one guy from work got a job at a construction company which basically paid double. Was almost same amount of labor. And one by one we all quit and went to work for that construction job.This is pretty much what is happening with many. A lot of people got crappy jobs with bad pay and right across from them is an employer which pays them more for the same amount of work. So eventually these people quit and go work for the other employer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "January 11, 2023, 08:10:37 AM",
      "body": "Quote from: The Sceptical Chymist on January 10, 2023, 06:01:33 AMQuote from: Hydrogen on January 09, 2023, 11:38:17 PM>Snip That seems like the complete opposite of the logical thing to do, because even the shittiest-paying job is better than whatever you could get from government assistance programs.  That said, I don't have a clue why people are quitting their jobs or what the real state of the economy is.  Usually when there's an economic downturn, unemployment is high and people hold onto their jobs for dear life.Stop working and accept PMTH assistance programs, Both look stupid and very unreasonable, I'm starting to realize why PMTH provides assistance programs for its people?To be seen they careMake the people dependenceSecurity when they are in power.What they do actually makes people more lazy and stupid, when people expect PMTH to be present to provide free and instant employment and remain comfortable with existing assistance programs, then therein lies a country's setback in preparing existing human resources.Quote from: The Sceptical Chymist on January 10, 2023, 06:01:33 AMQuote from: adaseb on January 10, 2023, 04:06:09 AM>Snip What?  None of that makes any sense, especially that crap I bolded.  Sure, some people quit jobs without having anything else lined up, but that's a stupid move and not one most people make.  It'd be nice if the data released broke down the types of positions being quit.  McDonald's never seems to have a shortage of employees, by the way.  That's a transient job for most, so I doubt that's what this news is all about.And did you know \"That those who work in parliament look like joking, but the salary is quite serious\" In our area many factory and small compans with home industry scale, they have never lacked workers like mcdonald's that you mention, there is no other choice but to survive in existing work. Because when employees chosen to go out, the number of unemployment available, much smaller the number of compans that are going to accept new employees, then each choice is in each individual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}