{
  "id": "topic_5444155",
  "title": "nikolaspaolo",
  "author": "nikolaspaolo",
  "created_time": "March 09, 2023, 07:23:34 PM",
  "content": "Vou descrever como será esse processo até o fim. 1) Comprando a hardware wallet na França: 06/03/2023Acessei o site ledger e escolhi comprar 3 X o modelo Ledger Nano X, note que escolhi uma a uma separada e não o pack com 3.Fiz isso porque o pack com 3, significa uma única caixa com 3 carteiras dentro. Eu não conseguiria revender assim, pois, venderia 3 ou nenhuma. Ledger Nano X = 149,00 USD cada.usei meu cartão internacional que me cobrou, 3 X 149,00 USD =  2.486,17 BRL + IOF 133,49 BRL = total na compra 2.619,66 BRL Até aqui, o preço unitário fica 873,22 BRL 2) Recebendo no redirecionador na França: 09/03/2023Aqui gostaria de deixar claro que é meu próprio endereço na França, no sul, Toulouse. Como tenho muitos amigos e parentes por lá, recebi lá. O pacote foi frete grátis(pelo que entendi no país inteiro) e veio desde Parc Technologique de Sologne, sendo enviado no dia 07/03/2023 e chegou hoje, 09/03/2023 basta ver o rastreamento aqui. Peso 0.474 KG.O pacote chegou rápido, mas veio bem surrado, até rasgado. A entrega só seria feita com assinatura, observação da própria Ledger.Mas o conteúdo de dentro, perfeito.Tudo certo com as carteiras.Próximo passo será preparar o envio delas para meu endereço no sul do Brasil. Será que serei taxado?Quando custará o frete?Quanto tempo total?Antes do próximo passo, fiz breve consulta no preço atual médio no Brasil para uma unidade de Ledger Nano X.Mercado Livre com frete grátis: 1.496,69 BRL link patrocinado, alguns nunca venderam nenhuma unidade e zero avaliações.MagaLu parceiro sem frete: 1.369,97 BRL link patrocidano.Alguns lugares somente lista de espera e não citam preços ou número de unidades, nem prazo.O google fez esse breve comparativo do que achou , até agora, o preço máximo foi de 1.890,00 BRL com frete grátis.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444155",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "March 09, 2023, 07:31:27 PM",
      "body": "Quote from: nikolaspaolo on March 09, 2023, 07:23:34 PMPróximo passo será preparar o envio delas para meu endereço no sul do Brasil. [/b]Será que serei taxado?Quando custará o frete?Quanto tempo total?Se for enviado de um particular para particular, talvez você seja taxado por muito pouco ou nem taxar.Sugiro que o valor que os seus familiares/amigos declararem no enviou seja baixo, talvez uns 20/30€, como fosse uma pendrive.Isso pode ajudar a minimizar uma possível taxa.Quanto ao frete, não sei, deve ficar nos 30~40€.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 09, 2023, 07:49:17 PM",
      "body": "Uma dica futura é usar um cartão em dólar/euros na próxima vez. Exemplo: Wise, Inter Global, C6 Global, criar uma conta na N26 europeia já que você tem endereço francês... Sai bem mais barato do que usar um cartão internacional em BRL que tem spread alto e IOF alto.Também vou ter que brincar de roleta na receita. Ganhei o Bitcointalk Community Awards e um dos premios foi uma Ledger X personlizada da Betnomi. Já enviaram e deve chegar ao Brasil em breve... vamos ver se passa. Essa dica da declaração é boa. Um \"pen drive\" de baixo valor deve passar sem problemas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 09, 2023, 08:45:33 PM",
      "body": "Que legal, nos mantenha atualizadosE se enviar como pessoa física pra pessoa física, tem boas chances de não ser taxado.Eu aqui só fui taxado 1 vez em minhas encomendas, e foi justamente os collectibles que ganhei num sorteio aqui no fórum.Uma coisa boa de você ter encomendado pela Ledger, é que você sabe que veio da Ledger mesmo, lacrado. Comprar de revendedor aqui tem que ter confiança e ser um vendedor honesto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "March 09, 2023, 11:12:37 PM",
      "body": "Tem um cara que está escondido em Miami que sabe direitinho como fazer isso. Apesar que pegaram um Almirante dele com umas joias presenteadas da Arábia Saudita no aeroporto de Guarulhos. Olha que teve carteirada de tudo que foi jeito e não teve como liberar.     Não podia deixar passar batido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 10, 2023, 07:46:39 AM",
      "body": "Quote from: TryNinja on March 09, 2023, 07:49:17 PMEssa dica da declaração é boa. Um \"pen drive\" de baixo valor deve passar sem problemas.Outra dica, será enviar em 3 encomendas diferentes. Apesar de ter de pagar 3 portes, a remessa terá menos volume e dá ainda menos nas vistas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 10, 2023, 12:23:21 PM",
      "body": "Quote from: rdluffy on March 09, 2023, 08:45:33 PMUma coisa boa de você ter encomendado pela Ledger, é que você sabe que veio da Ledger mesmo, lacrado. Comprar de revendedor aqui tem que ter confiança e ser um vendedor honesto.Vale muito a pena. Melhor ser taxado do que pagar 1800 reais por um item que voce nem sabe a procedencia.'Quote from: nikolaspaolo on March 09, 2023, 07:23:34 PMPróximo passo será preparar o envio delas para meu endereço no sul do Brasil. [/b]Será que serei taxado?Quando custará o frete?Quanto tempo total?Uma opção é voce ir la buscar pessoalmente quando for viajar ou pedir para alguém trazer, pois esse tipo de encomenda em geral não tem pressa. Esse item não vai valer menos daqui a 6 meses ou um ano.Aí não teria chance de ser taxado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nikolaspaolo",
      "created_time": "March 10, 2023, 03:32:42 PM",
      "body": "Antigamente eu comprava aquele primeiro modelo de ledger a HW1, era muito discreto, até hoje tenho uma lacrada.Eu já comprei hardware usadas, basta errar 3 vezes o pin que reseta, claro, usar o app do fornecedor, jamais aceitar uma com senha e app pre instalado.Depois de alguns anos, tanto a trezor com a ledger, fazem uma breve varredura no hardware pra ver se ele é original.Como antigamente eu queria testar todas, nem sempre era vantagem eu comprar nova em folha. Obrigado pelas dicas de uso de cartão em euros e bem como a declaração de pen drives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 10, 2023, 06:38:36 PM",
      "body": "Quote from: nikolaspaolo on March 10, 2023, 03:32:42 PMEu já comprei hardware usadas, basta errar 3 vezes o pin que reseta, claro, usar o app do fornecedor, jamais aceitar uma com senha e app pre instalado.Todas as vulnerabilidades conhecidas da Ledger exigem que o hacker tenha contato físico com o aparelho.Em teoria, o ideal é considerar toda e qualquer ledger que já esteve nas mãos de desconhecidos (potencialmente atacantes) como permanentemente comprometidas. A não ser que seja usada apenas para pequeno valor.Curiosidade:Voce usa sempre o mesmo endereço para suas vendas. A Ledger não traz grande benefício pra você no seu trabalho. VOce usa a ledger apenas para uso pessoal, no seu \"stash\" pessoal, certo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 10, 2023, 06:41:12 PM",
      "body": "Quote from: bitmover on March 10, 2023, 06:38:36 PMTodas as vulnerabilidades conhecidas da Ledger exigem que o hacker tenha contato físico com o aparelho.Contato físico para extrair a seed do dispositivo. Não existe vulnerabilidade conhecida para alterar o firmware de forma que a geração futura da sua seed seja adulterada, ou que a sua seed seja compartilhada via internet depois de uma adulteração previa, etc... nenhum caso conhecido comprometeria uma HW usada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nikolaspaolo",
      "created_time": "March 10, 2023, 06:47:08 PM",
      "body": "Quote from: bitmover on March 10, 2023, 06:38:36 PMQuote from: nikolaspaolo on March 10, 2023, 03:32:42 PMEu já comprei hardware usadas, basta errar 3 vezes o pin que reseta, claro, usar o app do fornecedor, jamais aceitar uma com senha e app pre instalado.Todas as vulnerabilidades conhecidas da Ledger exigem que o hacker tenha contato físico com o aparelho.Em teoria, o ideal é considerar toda e qualquer ledger que já esteve nas mãos de desconhecidos (potencialmente atacantes) como permanentemente comprometidas. A não ser que seja usada apenas para pequeno valor.Curiosidade:Voce usa sempre o mesmo endereço para suas vendas. A Ledger não traz grande benefício pra você no seu trabalho. VOce usa a ledger apenas para uso pessoal, no seu \"stash\" pessoal, certo?Não consigo usar hardware wallet no dia a dia, geralmente eu compro para testar, pois sempre vendo a cliente ou parceiros. Se o pessoal que comprar comigo tiver alguma dúvida, coisa e tal, eu pego a minha ledger e testo lá pra resolver ou indicar o que fazer.Dessas 3, certeza que uma será minha, uma vou dar a um cliente e outra talvez venda. Preciso da bitcoin core por exemplo, que tem muitas funções avançadas, que eu lembre, uma hardware wallet não tem até então. pagar vários e substituir hash, é o que mais uso........não tem em hw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 10, 2023, 06:57:43 PM",
      "body": "Quote from: nikolaspaolo on March 10, 2023, 06:47:08 PMpagar vários e substituir hash, é o que mais uso........não tem em hw.Pagar vários = enviar BTC para vários endereços em uma só transação? Se sim, é só usar a sua Ledger com uma carteira que suporta essa funcionalidade, como a própria Electrum. Eu mesmo só usei o programa da Ledger (Ledger Live) por umas 2 semanas antes de decidir voltar para a Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 10, 2023, 07:08:59 PM",
      "body": "Quote from: nikolaspaolo on March 10, 2023, 06:47:08 PMPreciso da bitcoin core por exemplo, que tem muitas funções avançadas, que eu lembre, uma hardware wallet não tem até então. pagar vários e substituir hash, é o que mais uso........não tem em hw.basta seguir esse guia aqui:https://support.ledger.com/hc/en-us/articles/115005161925-Set-up-and-use-Electrumfunciona perfeitamente como o TryNinja falou.Essa função de pagar para várias pessoas é super simples fazer na electrumbasta separar usando linhas e virgulas conforme a imagem abaixo:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nikolaspaolo",
      "created_time": "March 10, 2023, 07:17:33 PM",
      "body": "Olha que massa, cada dia mais funções em um único device.Um dia desse comentei sobre segundo fator por dispositivo, ledger tem também. Compartibilidade com U2F/FIDO. Agora mais essa de funcionar pela Electrum, excelente. Assim, sei que na Electrum tem funções avançadas bem completas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 10, 2023, 09:45:31 PM",
      "body": "Quote from: TryNinja on March 10, 2023, 06:57:43 PMEu mesmo só usei o programa da Ledger (Ledger Live) por umas 2 semanas antes de decidir voltar para a Electrum.Bem, voce até uso muito tempo.Eu ao fim de algumas horas, desisti da ideia... Apenas faço intensão de usar, caso utilize para outras coins que não seja BTC. Para BTC vou usar o Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nikolaspaolo",
      "created_time": "March 19, 2023, 02:43:11 AMLast edit: March 20, 2023, 06:26:14 AM by nikolaspaolo",
      "body": "3) Enviando do sul da França para o sul do Brasil.Infelizmente peguei uma semana ruim na França, pois nesse momento Paris puxou uma série de protestos e greves para todo o país. No sul não foi diferente, houve muita greve e paralização parcial de correrios por exemplo, a encomenda estava parada no endereço desde o dia 09/03/2023 mas a  conseguiu ser postada para o Brasil, ontem 17/03/2023.A encomenda pode ser rastreada aqui, previsão de 8 a 14 dias. A caixa de 23 x 13 x 12 CM teve o custo de 3 euros nos correios. Sendo a de menor tamanho. O envio por EMS Internacional, declarado como pen drive de 30 euros e entrega apenas com assinatura de recebedor, teve custo de 36,25 euros.Considerando esse custo de envio no total de 36,25 + 3 = 39,25 Euros mais ou menos 223,29 BRL.Atualizando os valores até o momento:Total na compra 2.619,66 BRL 3 x Ledger Nano XTotal no envio 223,29 BRL da França para o BrasilPreço unitário subiu pra 947,65 BRL Será que pega taxação em Curitiba? Aguardemos.....Acharam até o momento o preço unitário melhor que o praticado no Brasil?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 19, 2023, 05:24:09 AMLast edit: March 19, 2023, 08:05:01 AM by TryNinja",
      "body": "Quote from: nikolaspaolo on March 19, 2023, 02:43:11 AMSerá que pega taxação em Curitiba? Aguardemos.....A última atualização da minha é que ela está a caminho da fiscalização aduaneira. Agora é esperar os homens trabalharem rápido e eu logo retorno o resultado. Detalhe que não sei como o pessoal lá do awards declarou ela... podem ter colocado o valor cheio da Nano X.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 19, 2023, 07:58:10 AM",
      "body": "Quote from: nikolaspaolo on March 19, 2023, 02:43:11 AMO envio por EMS Internacional, declarado como pen drive de 30 euros e entrega apenas com assinatura de recebedor, teve custo de 36,25 euros.Achei o custo de enviou até aceitável. Acho que dificilmente iria conseguir um preço mais baixo que isso.De Portugal, o valor tinha sido praticamente o mesmo, talvez um pouco mesmo, mas não muito.Ficamos agora na espectativa para ver como corre na alfandega.EDIT: E veremos qual chega primeiro, se a tua ou do TryNinja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 19, 2023, 12:41:28 PM",
      "body": "Pessoal, não sei se viram, mas agora a Ledger tem uma parceria com a Kabum. Desde que a Ledger começou a focar no Brasil e contratou um representante pra cá, ele tinha como objetivo facilitar o sistema de compra e fechar algumas parcerias grandes pra permitir a expansão pra cá. A Ledger até chegou a fazer alguns eventos em SP. Essa semana, o responsável brasileiro me enviou o link para falar dessa parceria:https://www.kabum.com.br/promocao/LEDGERNANO?utm_source=LEDGER&utm_medium=PARCERIAS&utm_campaign=LINK9Mas o estoque já acabou   Perguntei pra ele quando vai ter mais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 19, 2023, 01:37:48 PM",
      "body": "Quote from: Disruptivas on March 19, 2023, 12:41:28 PMPessoal, não sei se viram, mas agora a Ledger tem uma parceria com a Kabum. Desde que a Ledger começou a focar no Brasil e contratou um representante pra cá, ele tinha como objetivo facilitar o sistema de compra e fechar algumas parcerias grandes pra permitir a expansão pra cá. A Ledger até chegou a fazer alguns eventos em SP. Mas, é a Ledger em especial que se esta a focar no Brasil, ou foi a Kabum que entro no programa de parcerias da Legder?Sinceramente eu acho que é mais a segunda opção. Qualquer comerciante pode se inscrever:https://www.ledger.com/become-a-ledger-resellerClaro que pode não ser aceite, mas na maioria dos casos é aceite, desde que apresente um bom plano de venda, conforme as perguntas que são colocadas.Não estou a dizer que a Kabum esta errada. Mas, na realidade não foi a Ledger que procurou a Kabum, mas sim ao contrario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}