{
  "id": "topic_5440049",
  "title": "dWill.app",
  "author": "dWill.app",
  "created_time": "February 16, 2023, 10:20:26 AMLast edit: February 16, 2023, 10:47:11 AM by dWill.app",
  "content": "Hi everyone! One existential thought came to me recently:How can my family/friends receive crypto assets in the event of my death or other circumstances in which I will not be able to manage my crypto wallet?And the answer was born along with a new project that we are now launching.Welcome dWill!dWill is the first fully decentralized protocol that allows you to bequeath cryptocurrencies.Project site: dWill.appWith dWill you can:* Bequeath ERC-20 tokens (done)* Bequeath NFT (in development)* Bequeath encrypted NFT messages (for example, you can securely bequeath a seed phrase from a bitcoin wallet to an heir. In development)How dWill works:* dWILL offers to connect the user's wallet and specify the address to which the cryptocurrency will be transferred in case the user's wallet is inactive* The user himself determines the duration of inactivity of his wallet, after which dWill will take effect.* The dWILL system monitors wallet activity. If there are no transactions, dWill offers to conduct a free transaction, which will confirm the activity of the wallet. If the wallet is still inactive and the specified date falls, dWill sends funds to the bequeathed wallet.Why is dWill reliable?* Decentralized:dWill works through smart contracts.* Transparent:dWill's algorithms are fully open to external audit at any time. The 100% transparent protocol allows you to bequeath cryptocurrencies with an unprecedented level of reliability.* Gives you full control over your assets:The user's funds remain on his wallet under his full control. dWill is technically unable to receive these funds.Additionally: dWill also plans to partner with international charitable organizations and offer users to give a percentage of the will to those in need.Current status:A. We launched the first version of the project at dWill.app.Q. At the moment, we are undergoing a technical audit of a reputable company, which will confirm the transparency of the service.By the way, after the audit is completed, we will launch a bounty program for developers to find errors in the protocol, so it will help our project and will give an opportunity for developers to earn some money.Future plans:A. Attract the 1st round of investments needed to expand and popularize the projectC. Invite authoritative De-Fi projects to cooperateC. Create a partnership agreement for cooperation with charitable organizationsWe will be glad to hear comments on the project, as well as answer your questions!Keep your crypto assets safe. dWill",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440049",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "February 16, 2023, 10:45:51 AM",
      "body": "Quote from: dWill.app on February 16, 2023, 10:20:26 AMProject site: dWill.appIt's asking me to open an FTP link not a complete site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dWill.app",
      "created_time": "February 16, 2023, 10:52:14 AM",
      "body": "Quote from: Royse777 on February 16, 2023, 10:45:51 AMQuote from: dWill.app on February 16, 2023, 10:20:26 AMProject site: dWill.appIt's asking me to open an FTP link not a complete site.Hey! We changed it to hyperlink, please feel free to enter the site!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AB de Royse777",
      "created_time": "February 16, 2023, 11:13:16 AM",
      "body": "Quote from: dWill.app on February 16, 2023, 10:52:14 AMHey! We changed it to hyperlink, please feel free to enter the site!Works nice now.The project sounds good I guess. Not a huge tech guy but in the marketing and promotions.When I go to the following page I do not get permission. It's probably giving a 403 error.Quotehttps://dwill.slite.page/p/yFyU0Vhz-TJakC/dWIll",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dWill.app",
      "created_time": "February 17, 2023, 06:09:10 AM",
      "body": "Quote When I go to the following page I do not get permission. It's probably giving a 403 error.https://dwill.slite.page/p/yFyU0Vhz-TJakC/dWIllhttps://i.ibb.co/nwqJCH6/link.pngHi again!The link works fine, I just checked it. Please try it again. The only thing is that the documentation is not translated into English yet, we plan to do that in the next few days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dWill.app",
      "created_time": "March 26, 2023, 04:10:50 AM",
      "body": "Hello everyone!We are happy to announce that our project was audited by a reputable auditor certik.comOur project got a very high security rating and had no significant security issues, which proves the high code culture and skills of our team     - Audit results are available at this link: https://www.certik.com/projects/dwill    - The project code is open and available at this link: https://github.com/Mycelium-Lab/dWillThank you for being with us!We sincerely want to build a decentralized solution in the best traditions of DeFi. If you are interested in the project, you would like to take part in its development or follow how it develops, join us, we will be glad to keep in touch with you on this forum or in our Telegram group, join us: https://t.me/+r7mhTcRP_VI1MThk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}