{
  "id": "topic_5502674",
  "title": "Y3shot",
  "author": "Y3shot",
  "created_time": "July 11, 2024, 09:58:21 AMLast edit: July 11, 2024, 12:06:09 PM by Y3shot",
  "content": "Santa Monica is opening an official bitcoin office, the reason for this opening is to provide bitcoin education and search potential economic opportunities.  The office has four main goals. 1. Providing bitcoin education.2. Facilitating partnerships and conferences to grow tourism.3. Connect residents to jobs.4. Exploring sustainable bitcoin mining power by the City's renewable energy. Santa Monica is emulating the footsteps of El Salvador, because El Salvador has opened a bitcoin office and much engaged to significant investment and tourism related to bitcoin. Some other recent bitcoin developments in santa Monica include firefighters adopting self-custody of bitcoin and City leader visiting El Salvador to study its bitcoin adoption.  https://bitcoinmagazine.com/business/the-city-of-santa-monica-is-opening-a-bitcoin-office?utm_source=carrot&utm_medium=partner&utm_campaign=carrot_share",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5502674",
  "comments": [
    {
      "author": "pakhitheboss",
      "created_time": "July 11, 2024, 10:10:08 AM",
      "body": "Quote from: Y3shot on July 11, 2024, 09:58:21 AMSanta Monica is emulating the footsteps of El Salvador, because El Salvador has opened a bitcoin office and much engaged to significant investment and tourism related to bitcoin. How can Santa Monica do better than El Salvador? They are not declaring Bitcoin as a legal tender. So, I feel the word emulating is not appropriate in this context. I think the right word in this context should be aspiring. Quote from: Y3shot on July 11, 2024, 09:58:21 AM1. Providing bitcoin education.This is the only point that interest me as there are a lot of people globally who do not have clue about Bitcoin. They only know two thing that investing in Bitcoin can make them rich. The next is that a Bitcoin is used for illegal activities and that they should avoid in a Ponzi Internet currency. That to this education all those myth and negativity surrounding Bitcoin will get removed from the minds of most local.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 11, 2024, 10:15:11 AM",
      "body": "I've looked at Santa Monica's economy to understand their decision better. One of the leading economic sectors is “Silicon Beach”, so primarily Technology. Another major sector is tourism, generating nearly 1 billion dollars annually for the local economy. So, with a focus on technology and significant tourism, it sounds smart to open a Bitcoin office there. It can be of interest to tech companies, and it can also become a tourist attraction. Their unemployment rate isn't high (6%), so I'm not sure whether they particularly need to improve that area, but growing revenue never hurts.I'd say it's a big jump from here to 'emulating El Salvador', a country that accepts Bitcoin as legal tender, but it is still a positive development for people living there or visiting that place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "July 11, 2024, 10:21:39 AM",
      "body": "Quote from: pakhitheboss on July 11, 2024, 10:10:08 AMHow can Santa Monica do better than El Salvador? They are not declaring Bitcoin as a legal tender. So, I feel the word emulating is not appropriate in this context. I think the right word in this context should be aspiring. For me I think this can be a starting point for adopting bitcoin as a legal tender. For the fact the City embrace bitcoin very well, this is a good development at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "July 11, 2024, 10:28:50 AM",
      "body": "Quote from: Y3shot on July 11, 2024, 10:21:39 AMFor me I think this can be a starting point for adopting bitcoin as a legal tender. For the fact the City embrace bitcoin very well, this is a good development at this point.Good to know that you have a positive attitude about Bitcoin and you foresee a good approach by the city in Bitcoin adoption. I do not deny anything in your reply, what I put forward was a word that you have used in your topic. Emulating EL Salvador is wrong word to choose. Why? Because the city of Santa Monica cannot make Bitcoin a legal tender. It is part of the USA and Bitcon was created to counter the USD globally. That was the essence of my reply and it is nothing against adoption of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 11, 2024, 11:04:32 AM",
      "body": "Quote from: pakhitheboss on July 11, 2024, 10:28:50 AMEmulating EL Salvador is wrong word to choose. Why? Because the city of Santa Monica cannot make Bitcoin a legal tender. It is part of the USA and Bitcon was created to counter the USD globally. That was the essence of my reply and it is nothing against adoption of Bitcoin. Bitcoin is not created by Satoshi Nakamoto to counter the USD or fiat currency globally.It is an option for everyone to choose and use as their alternative or supplement for their financial lives. They can use Bitcoin blockchain and central banks, commercial banks at the same time. Like you can use cash or bank transfer depends on your access to either cash or digital bank transfer at specific time.The USA is becoming more friendly with Bitcoin by approving Bitcoin Spot ETFs in January 2024 and three months later approving Ethereum Spot ETFs but I don't see legal tender is a mandatory condition for people to use Bitcoin or cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 11, 2024, 11:05:49 AM",
      "body": "So, it's Santa Monica which is located in California, in the US. Well, any place that's going to do so is definitely going to do it for the attraction and as well as education. I do wish them to have a good progress with this. I guess instead of calling it as a bitcoin office, they should call it as a Bitcoin center.Quote from: Y3shot on July 11, 2024, 09:58:21 AMSanta Monica is emulating the footsteps of El Salvador, because El Salvador has opened a bitcoin office and much engaged to significant investment and tourism related to bitcoin. They are not emulating El Salvador. Every place or country is free to do it but let's just take it positively. Any place that does the same should be supported and we must be happy about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "July 11, 2024, 11:23:25 AM",
      "body": "That is a pretty good step for a country like Santa Monica to take and it would probably be a decision that could advance their economy, because by opening up wider access to bitcoin it could allow its citizens to access extensive knowledge on bitcoin and also make more bitcoin investors to visit the country and it will provide more tax revenue from the tourism sector. And there are many opportunities and benefits they can get by opening the widest access to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "July 11, 2024, 11:54:18 AM",
      "body": "Quote from: Y3shot on July 11, 2024, 09:58:21 AMSanta Monica is emulating the footsteps of El Salvador, because El Salvador has opened a bitcoin office and much engaged to significant investment and tourism related to bitcoin. Some other recent bitcoin developments in santa Monica include firefighters adopting self-custody of bitcoin and City leader visiting El Salvador to study its bitcoin adoption. Santa Monica is a beautiful city in California because it is a tourist city as I know from search sources. If their main economy lies in the tourism sector, then their decision on Bitcoin is very good for increasing interest from tourism sectors such as El Salvador. But I want to equate Santa Monica with El Salvador because it doesn't really follow the development of Santa Monica. But I am happy with this news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Donneski",
      "created_time": "July 11, 2024, 01:09:08 PM",
      "body": "Quote from: pakhitheboss on July 11, 2024, 10:28:50 AMQuote from: Y3shot on July 11, 2024, 10:21:39 AMGood to know that you have a positive attitude about Bitcoin and you foresee a good approach by the city in Bitcoin adoption. I do not deny anything in your reply, what I put forward was a word that you have used in your topic. Emulating EL Salvador is wrong word to choose. Why? Because the city of Santa Monica cannot make Bitcoin a legal tender. It is part of the USA and Bitcon was created to counter the USD globally. That was the essence of my reply and it is nothing against adoption of Bitcoin. Bitcoin wasn't created to counter the USD rather the primary motive of Satoshi Nakamoto in creating Bitcoin was to the global population to be the sole controller of their own money. Just like every other paper currency in the world, USD is controlled by the government of the United States of America, they create and implement rules that guides the usage of the USD making them a third party in the ownership of the currency and Satoshi in his vision to create a decentralized currency came up with Bitcoin. So Bitcoin wasn't created to counter any currency but to give owners of money the power to control and manage their money without a third party which the power of decentralization in Bitcoin.Santa Monica is reported to be the latest city that has decided to adopt Bitcoin as a legal tender and I strongly believe that many other regions of the world are also making efforts to follow suit because it's rapid acceptance by different people of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ishicryptic",
      "created_time": "July 11, 2024, 02:43:37 PM",
      "body": "Quote from: tabas on July 11, 2024, 11:05:49 AMSo, it's Santa Monica which is located in California, in the US. Well, any place that's going to do so is definitely going to do it for the attraction and as well as education. I do wish them to have a good progress with this. I guess instead of calling it as a bitcoin office, they should call it as a Bitcoin center.I think that it is not proper for the city of Santa Monica, to name the place where people can be informed about Bitcoin, a Bitcoin office. It sounds like a Bitcoin centralized office, the name can be misleading for some people to think that Bitcoin now has a physical offices, it should have been called a Bitcoin center. Since the city generates it's income from tourism, I think that it is a step in the right direction for them to have the Bitcoin office or center to educate people about Bitcoin and how it can promote tourism in their city. Other cities should emulate them and have these Bitcoin centers to educate people and increase it's adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 11, 2024, 05:10:15 PM",
      "body": "Opening of a Bitcoin office doesn't bring anything on the plate except a little hope! Also we are not sure behind the intention of having such department. It may be very well possible that something negative will come out of this. So stay cautious rather than feeling excited. Unless that country declares Bitcoin as a legal tender, there's no reason to cheer yet!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "July 13, 2024, 12:39:36 PM",
      "body": "Quote from: Y3shot on July 11, 2024, 09:58:21 AMSanta Monica is opening an official bitcoin office,I just finished watching the Bitcoin-related parts of their \"July 9th council meeting\" and noticed Vice Mayor Negrete explicitly mentioned this is not going to be \"a specific physical office... It is opportunities that we will be hosting at maybe public spaces like our library or whatnot [6:56:51]\". A few council members were worried if this so-called Bitcoin office was going to give investment advice with their city logo being in the picture, so they were asking for insurance stuff, but since none of these are part of its goals, no one opposed it.Bitcoin-related timeline:One of the speakers [not a council member] labeled it as a scam [2:18:16 to 2:19:24]Other speakers [2:30:05 to 2:48:37]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "July 13, 2024, 02:07:37 PM",
      "body": "Quote from: pakhitheboss on July 11, 2024, 10:28:50 AMQuote from: Y3shot on July 11, 2024, 10:21:39 AMFor me I think this can be a starting point for adopting bitcoin as a legal tender. For the fact the City embrace bitcoin very well, this is a good development at this point.Good to know that you have a positive attitude about Bitcoin and you foresee a good approach by the city in Bitcoin adoption. I do not deny anything in your reply, what I put forward was a word that you have used in your topic. Emulating EL Salvador is wrong word to choose. Why? Because the city of Santa Monica cannot make Bitcoin a legal tender. It is part of the USA and Bitcon was created to counter the USD globally. That was the essence of my reply and it is nothing against adoption of Bitcoin. I get your point pakhitheboss, Santa Monica is just a City in California, USA, so it cannot make laws to make Bitcoin a legal tender. Laws that will make the coin a legal tender like El Salvador should come from Federal lawmakers and assent by the President. However, Bitcoin was not created to counter any currency of any country. It is just a decentralized currency created to be a viable alternative to fiat. It was designed to give freedom to people who value privacy. Anyway, the city of Santa Monica took the right step in promoting Bitcoin education and businesses. Bitcoin awareness brings about an increase in Bitcoin adoption. I hope this education will be able to help residents of the city know the difference between Bitcoin and altcoins to avoid scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 13, 2024, 02:32:25 PM",
      "body": "Quote from: Ishicryptic on July 11, 2024, 02:43:37 PMQuote from: tabas on July 11, 2024, 11:05:49 AMSo, it's Santa Monica which is located in California, in the US. Well, any place that's going to do so is definitely going to do it for the attraction and as well as education. I do wish them to have a good progress with this. I guess instead of calling it as a bitcoin office, they should call it as a Bitcoin center.I think that it is not proper for the city of Santa Monica, to name the place where people can be informed about Bitcoin, a Bitcoin office. It sounds like a Bitcoin centralized office, the name can be misleading for some people to think that Bitcoin now has a physical offices, it should have been called a Bitcoin center. Since the city generates it's income from tourism, I think that it is a step in the right direction for them to have the Bitcoin office or center to educate people about Bitcoin and how it can promote tourism in their city. Other cities should emulate them and have these Bitcoin centers to educate people and increase it's adoption.Well, to each their own. If they think that's what it should be named, we can't do anything about that. We're not from there but that's just our thought that it shouldn't be a Bitcoin office. But anyway, however, it is called won't matter but what matters most is about the usage of that facility. If there will be more people that will be informed of its purpose then let's see the impact and results of it. Anyway, you just said what I have said and repeated about what it should be called.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "July 15, 2024, 01:48:40 PM",
      "body": "Quote from: pakhitheboss on July 11, 2024, 10:10:08 AMQuote from: Y3shot on July 11, 2024, 09:58:21 AMSanta Monica is emulating the footsteps of El Salvador, because El Salvador has opened a bitcoin office and much engaged to significant investment and tourism related to bitcoin. How can Santa Monica do better than El Salvador? They are not declaring Bitcoin as a legal tender. So, I feel the word emulating is not appropriate in this context. I think the right word in this context should be aspiring. local. I think the Op mean \"emulate\" is of Santa taking such step following the possessions of El Salvador optimizing more utilizations of bitcoin technology as encouragement. Literally the emulations is being an aspiration, motivation from the verdict of El Salvador on the basis of bitcoin technology and doesn't really mean Santa tends to bargain a competitive challenge with El Salvador.Quote from: pakhitheboss on July 11, 2024, 10:10:08 AMQuote from: Y3shot on July 11, 2024, 09:58:21 AM1. Providing bitcoin education.This is the only point that interest me as there are a lot of people globally who do not have clue about Bitcoin. They only know two thing that investing in Bitcoin can make them rich. The next is that a Bitcoin is used for illegal activities and that they should avoid in a Ponzi Internet currency. That to this education all those myth and negativity surrounding Bitcoin will get removed from the minds of most local.It is really a bold move because lot of persons has actually had this same motive but due to the fear of governments and insecurities threats, they've been so discouraged to make such ideal a reality.Indeed this session would help a lot of people who're not too conversant to online learning to physically hold on and learn about bitcoin.The anonymity of bitcoin relationship in both communication such as bitcoin education has really had a lot of Interested persons doubts to believe bitcoin is real.Maybe this educational up root of Santa may have a more crystal clear for better understanding of those doubting the anonymity of bitcoin as decentralized technology with the one on one encounters of Interested persons with the Santa's obligation to conversational bitcoin education.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "July 15, 2024, 02:14:44 PM",
      "body": "Quote from: retreat on July 11, 2024, 11:23:25 AMThat is a pretty good step for a country like Santa Monica to take and it would probably be a decision that could advance their economy, because by opening up wider access to bitcoin it could allow its citizens to access extensive knowledge on bitcoin and also make more bitcoin investors to visit the country and it will provide more tax revenue from the tourism sector. And there are many opportunities and benefits they can get by opening the widest access to bitcoin.These things you mentioned are really what will happen if they make bitcoin part of their things education, but you know what? They can not achieve all these things if they don’t make it legal in their country, because if they do not make it legal, investors cannot come in, as you said. Also, the education of bitcoin and other cryptocurrencies will be limited, and not all the citizens will get the knowledge about them, so it will only be a few of them. However, many youths who do not have jobs or any other way to earn money can learn bitcoin education and be rich after investing or even trading, and by doing so, even the economic system will grow and they will start earning money through cryptocurrency because I know anything that will make them implement bitcoin other cryptocurrencies most come in. So trading cryptocurrency will definitely take place, and many people will make money from it to sustain their lives financially.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 15, 2024, 04:17:19 PM",
      "body": "Quote from: Y3shot on July 11, 2024, 09:58:21 AMSanta Monica is opening an official bitcoin office, the reason for this opening is to provide bitcoin education and search potential economic opportunities.  The office has four main goals. 1. Providing bitcoin education.2. Facilitating partnerships and conferences to grow tourism.3. Connect residents to jobs.4. Exploring sustainable bitcoin mining power by the City's renewable energy. Santa Monica is emulating the footsteps of El Salvador, because El Salvador has opened a bitcoin office and much engaged to significant investment and tourism related to bitcoin. Bitcoin is a reliable digital currency and anyone who ever comes across this coin will always want to have it for adoption, anything that we can do and it provides with us opportunities in diverse ways for our own advantage, then we must have to take effective utilization of such opportunity towards going for its adoption and use, this action taken by Santa Monica will help encourage the citizens for more adoption and they will have more access to learning by gaining exposure concerning bitcoin network, many like this are still coming under the influence of El-Salvador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}