{
  "id": "topic_5515384",
  "title": "Japinat",
  "author": "Japinat",
  "created_time": "October 26, 2024, 05:53:44 AM",
  "content": "When we talk about government holdings, it usually implies safety since they’ve taken all the necessary steps to secure it. But hackers still managed to breach it, maybe just testing the system’s security before returning it within 24 hours. Makes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?The story-Hacker returns stolen funds to US government in less than 24 hours",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5515384",
  "comments": [
    {
      "author": "MeGold666",
      "created_time": "October 26, 2024, 08:40:58 AM",
      "body": "Everything connected to the Internet can be hacked, even your hardware wallet through some new found bug in the firmware.People are still brainwashed by a system where banks act as guardians, treating everyone as if they are incapable of managing their own finances.Unfortunately, many adults have the financial literacy of a ten-year-old, a result of carefully designed government programs that exclude economic education from primary school curricula.If you want to be your own bank, you need a certain level of knowledge. You can’t just jump on the bandwagon and expect to succeed; without proper understanding, you’ll end up getting burned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 26, 2024, 08:51:24 AM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMMakes me wonder why some people think putting their crypto with a third party is safer because of “better security.” It's because that's what they think what \"trust\" is. We've been trained to believe that they're the only reliable ones when we handover our money to them.But there's more to it once they learn more about the funds that these third parties are not their holdings but them, just as how we're saying that \"not your keys, not your coins\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "October 26, 2024, 08:58:15 AM",
      "body": "Every decision comes with a risk even owning your coin yourself with no proper knowledge isn't secured.None is truly safer, owning your coin gives you control over your funds and won't be subject to been seized because of allegations. So a better choice What's the essence of securing what you don't own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 26, 2024, 08:58:36 AM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMWhen we talk about government holdings, it usually implies safety since they’ve taken all the necessary steps to secure it. But hackers still managed to breach it, maybe just testing the system’s security before returning it within 24 hours. Makes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?Maybe because such people are so stupid and irresponsible that they are not able to take security measures and preserve their crypto assets. Also, we can add the lack of basic technical skills and the desire to learn something new. I am talking about those people who are not even able to \"press a couple of extra buttons\" on their smartphone in addition to the ones they use. From my observations, there are plenty of such people around and for them the best solution is \"putting their crypto with a third party\" if they want to dive into the world of cryptocurrencies. Attempts by such people to show independence in this matter leads to the creation of topics on this forum (and not only), like \"I was hacked and all my savings in crypto were stolen\". Paraphrasing the title of the topic, I can ask, how can you trust yourself if the user is a complete lamer newbie?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "October 26, 2024, 08:59:11 AM",
      "body": "Quote from: passwordnow on October 26, 2024, 08:51:24 AMQuote from: Japinat on October 26, 2024, 05:53:44 AMMakes me wonder why some people think putting their crypto with a third party is safer because of “better security.” It's because that's what they think what \"trust\" is. We've been trained to believe that they're the only reliable ones when we handover our money to them.But there's more to it once they learn more about the funds that these third parties are not their holdings but them, just as how we're saying that \"not your keys, not your coins\". I’ve always said: you never own a bank account; you have an account registered in your name.Subtle but big difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "October 26, 2024, 09:00:21 AM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMMakes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?People actually think the opposites.It's true government or exchanges can be hacked, but in this case the government is successfully recover almost all of their coins, so at least it's better than hacker that hack your wallet and lose it all.That's what other people think, while I, myself, choose to hold my coins in non custodial wallet since I don't trust with centralized entity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "October 26, 2024, 09:05:49 AM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AM But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?This world is colorful and everyone has different thoughts and perspectives on life, you don't need to feel confused when others don't think the same way as you. Likewise, have you ever wondered or asked your parents why they prefer to deposit money in banks, invest in gold or real estate but not bitcoin like you? Likewise, many people who are not confident in themselves feel that it is safer to entrust their assets to the government or the bank, and there is nothing wrong with that.Storing bitcoins ourselves allows us to have full control over our assets, which makes us feel more secure instead of having to trust others. But that doesn't mean our assets are absolutely safe, never get hacked and stolen. The Internet world is a risky world and anything can happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "October 26, 2024, 09:41:32 AM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMMakes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?I think it is more about authority and having someone to run to than anything else. People thinks it is much safer when you know there is an organization behind that you can give your money to. People probably think that they have more sophisticated technology and security services than most. And going back to my first point: in case something happens, they have someone to blame.As opposed to if you hold it yourself and you lose it, you bear all responsibility. You can’t go up to someone and request refunds or something like that.QuoteThe story-Hacker returns stolen funds to US government in less than 24 hoursWon’t be surprised if more hackers try the same thing knowing how breach-able their systems are. Doesn’t bode well for the US government to be honest. Especially during election season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 26, 2024, 09:52:12 AM",
      "body": "Quote from: MeGold666 on October 26, 2024, 08:59:11 AMQuote from: passwordnow on October 26, 2024, 08:51:24 AMQuote from: Japinat on October 26, 2024, 05:53:44 AMMakes me wonder why some people think putting their crypto with a third party is safer because of “better security.” It's because that's what they think what \"trust\" is. We've been trained to believe that they're the only reliable ones when we handover our money to them.But there's more to it once they learn more about the funds that these third parties are not their holdings but them, just as how we're saying that \"not your keys, not your coins\". I’ve always said: you never own a bank account; you have an account registered in your name.Subtle but big difference.We have realized that because the government tells us that it's a safe thing to deposit and save our money in the bank. And so as what everything the government told us to do, we've brought it up to this point that the exchanges are also safe to keep our funds because they're centralized and they have licenses to operate. Well, good thing that this community has been here for so long and thanks to the ones who have been here first in giving us tips and reminders about keeping our own funds in our hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 26, 2024, 09:58:48 AM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMWhen we talk about government holdings, it usually implies safety since they’ve taken all the necessary steps to secure it. But hackers still managed to breach it, maybe just testing the system’s security before returning it within 24 hours. Makes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?We trust the government because our parents told us to trust them from a young age. We have seen our parents blindly trusting the government with their finances, so we have followed in their footsteps. I agree that it is very risky to keep your cryptocurrencies and Bitcoin with a third party but if someone is not that educated then they can lose their crypto from their wallet. There have been so many instances we have read wherein users accidentally lost all their crypto to a hacker by sharing their pass keys or authorizing an application. Unless we are aware of how to keep crypto safe in a noncustodial wallet we might end up giving access to the wallet to a hacker or a scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "October 26, 2024, 10:14:24 AM",
      "body": "Third party wallets especially non-custodial wallets are I think way more safer compared to storing your funds in centralized exchanges. One thing is full control which is not an option when you store your money in the banks or centralized exchanges. Government can also play with your funds if they wanted to like freezing them or whatsoever so yeah this is the reason why I don't trust the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 26, 2024, 10:16:17 AM",
      "body": "Quote from: m2017 on October 26, 2024, 08:58:36 AMMaybe because such people are so stupid and irresponsible that they are not able to take security measures and preserve their crypto assets. Also, we can add the lack of basic technical skills and the desire to learn something new. I am talking about those people who are not even able to \"press a couple of extra buttons\" on their smartphone in addition to the ones they use. From my observations, there are plenty of such people around and for them the best solution is \"putting their crypto with a third party\" if they want to dive into the world of cryptocurrencies. Attempts by such people to show independence in this matter leads to the creation of topics on this forum (and not only), like \"I was hacked and all my savings in crypto were stolen\". Paraphrasing the title of the topic, I can ask, how can you trust yourself if the user is a complete lamer newbie?I wouldn't be so categorical with the definition of stupidity. Everyone was a beginner once. For some, if you look at the situation from the outside, mistakes will be lessons. The mistakes themselves are created so that people learn from them, but someone learns not from other people's (and here it is appropriate to call them stupid) mistakes but exclusively from their own. The rule \"not your keys, not your coins\" was not invented yesterday. And yes, beginners are different, as are people in everything else. Greed or laziness will always be an appendage of those who do not want to hear and listen to advice and of those who are too self-confident in their \"knowledge.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelockg",
      "created_time": "October 26, 2024, 10:20:48 AM",
      "body": "Quote from: MeGold666 on October 26, 2024, 08:40:58 AMPeople are still brainwashed by a system where banks act as guardians, treating everyone as if they are incapable of managing their own finances.Unfortunately, many adults have the financial literacy of a ten-year-old, a result of carefully designed government programs that exclude economic education from primary school curricula.it's an intentional concept that has been handed down to adults while they were much younger and they've Come to live by it. Banks and centralized institutions have been projected in a manner that they look safer holding your money for you than you keeping it yourself. We've grown to trust them even when in several instances, they've proven to be less reliable than we take them to be.Life becomes more meaningful when you starts questioning some certain things and prob to know why certain things have to be done a certain way but unfortunately, the definition of a good person has always been the individual that doesn't want to question things but act the way the government wants them to act.Most exchanges are facing regulatory deficulty and banks are struggling to deal with government policies and how most of the policies have negative effect on the existence of the banks and all other centralized financial institutions. relying completely on them will mean that you're giving them complete authority over your finance and whatever asset that's in Thier possession which is a risky thing to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 26, 2024, 10:31:02 AM",
      "body": "Quote from: Japinat When we talk about government holdings, it usually implies safety since they’ve taken all the necessary steps to secure it. But hackers still managed to breach it, maybe just testing the system’s security before returning it within 24 hours. Makes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?Sometimes, alot of persons don't actually see the need to have their own coins under their own control. This is most especially don't by business owners who offers crypto as a payment option. But the, these centralized bodies can be control by the government and who knows what might happen next. Like we have seen in the past, where some exchanges shuts down something with no warning. All these are more reasons why we should try our best to own our keys to our wallet. From the article op posted, I still don't get the reason why the hacker returned the funds though. Such cases are rare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "October 26, 2024, 10:32:14 AM",
      "body": "Quote from: Reatim on October 26, 2024, 09:41:32 AMWon’t be surprised if more hackers try the same thing knowing how breach-able their systems are. Doesn’t bode well for the US government to be honest. Especially during election season.People who do this are known as white hat hackers. They look for vulnerabilities in the system but won’t steal any money. It’s a good thing the government had white hat hackers check for vulnerabilities first because if it had been criminal hackers, that money would be gone.There’s a big difference between holding your Bitcoin yourself (which most of us would recommend ) and letting an organization hold it for you. But at the end of the day, it’s about what we’re comfortable with. Holding your own isn’t foolproof either; you could lose your Bitcoin if you lose your key due to unavoidable events like floods or other disasters, even fires.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "October 26, 2024, 10:34:57 AM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMBut with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?Why was the whole Bitcoin thing introduced in the first place?. We all know that it's just a system that gives each individual the opportunity to become their own bank and also being financially independent, which I believe most of us are aware of while few don't adhere to. Though, people have their choice of preference, but it's quite surprising that so many people choose do things outside the whole context of becoming a personal bank. I clearly don't see much difference between a cex and a bank, because they they keep funds, which the government also have access to.  I think people tend to trust cex and the government because they personally lack accountability and maybe don't trust their own personal safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "October 26, 2024, 01:07:03 PM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMMakes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?It is a misconception that is based on lack of information that third party apps or things promoted by the government are completely safe because if you are properly informed about security methods and up to date on how to keep your bitcoin safe you would not want to depend on third party apps for security because you trust what you know. With proper information that you have as well, you will know the history of those who trusted third party apps and the government, and how they ended up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "October 26, 2024, 02:51:41 PM",
      "body": "I think that is because the fee of transaction that makes people thinks that if they putting their crypto with a third party will be safe and they don't have to bother sending their crypto. Not to mention about the transaction fee that can increase following the busy of the network.Besides that, if their crypto is on the exchanges, they can directly sell their coin in any high price they want. They don't have to wait until the transaction finish which can be longer if the network is crowd. They should realize that there are no 100% safe in the internet even if third party can guarantee that all data in their site is safe.The other reason is because they feel comfortable with the third party so they think it will safe if they keep their crypto on that third party. Each people will have their own decision where they want to keep their crypto. But we are always recommend to save it in our private wallet so we can have full control over our assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 26, 2024, 03:37:54 PM",
      "body": "Quote from: Japinat on October 26, 2024, 05:53:44 AMWhen we talk about government holdings, it usually implies safety since they’ve taken all the necessary steps to secure it. But hackers still managed to breach it, maybe just testing the system’s security before returning it within 24 hours. Makes me wonder why some people think putting their crypto with a third party is safer because of “better security.” But with what’s happened, even the government can be hacked, so why trust them with our Bitcoin?The story-Hacker returns stolen funds to US government in less than 24 hoursHackers can return fund, can be arrested or succeed with stolen fund and if you have your money on a hacked exchange, you only can pray that God will save you.But always prepare for worst that you will lose that fund forever, because many hacked exchanges turn to dead. Exchange graveyard.Putting your fund to hands of others to secure it is wrong and risky practice, then if their platforms are hacked, you will have very little hope that they will have enough business budget to compensate your loss. Most of times, small exchanges will disappear, die and even a Tier 1 exchange FTX bankrupted, many centralized exchanges can die after a big hack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}