{
  "id": "topic_5475417",
  "title": "Richkiedx",
  "author": "Richkiedx",
  "created_time": "November 25, 2023, 03:16:28 AM",
  "content": "how do you use a stoploss",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475417",
  "comments": [
    {
      "author": "mk4",
      "created_time": "November 25, 2023, 03:22:22 AM",
      "body": "Maybe at least tell us what platform so we can help you? Because It'll totally depend on the exchange you're using. And chances are, whatever platform you're using has an article on how to use their stop-loss function so you're better off Google-ing it first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 25, 2023, 03:31:56 AM",
      "body": "Quote from: Richkiedx on November 25, 2023, 03:16:28 AMhow do you use a stoplossYou can use Stop loss order but there is a better order, Stop limit order.One of best weapons in trading: Stop loss orderStop loss order: make sure you use itWhat is a stop limit order?Stop limit order: What it is and why investors use it?Above are general documents to understand about those order types but how to use it, you have to read guide of an exchange you are using. Each exchange has its own user interface and you have to be familiar with it as well as how to use trading order types on that exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "November 25, 2023, 04:42:16 AM",
      "body": "Using stoploss depends on you risk to reward ratio.If you have a risk to reward ratio of 1:3, then you need to place your stoploss at a distance that corresponds to one-third of the potential profit target,this will be profitable because your risk exposure is limited while allowing the trade sufficient room for price fluctuations within that established risk parameters.most people lose in trading because they don't follow their plan trade according to their risk to reward ratio. and trade emotionally which cause them to close many trades without gaining significant profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "November 25, 2023, 06:54:26 AM",
      "body": "Quote from: Richkiedx on November 25, 2023, 03:16:28 AMhow do you use a stoplossStop loss is a protective trading tool that limits the risk of any trader in trading positions. It's good to use it even though some people argue that it's not necessary and could give people bad luck of getting hit while the market still goes back to the trader's position. As painful as that is, it's not happening all the time and one thing that is sure is that the stop loss is more good than evil, that's if it's evil at all. There are times it would truly save your trading account and you will be so happy, but there are times that it would save the trading account but people think it's bad because the market goes back to the direction of choice. But in honesty, in this case, the stop loss has done its part, it's the trader that should monitor the trade and act accordingly afterwards.This is why the following points might help and we must know that nothing is perfect in trading;1. Plan your stop loss in line with your trading strategy. You can use a fixed stop loss or varied ones depending on the strategy you use.2. Use tight stop loss around price action and S/R level only.3. Use a loose stop loss when you are trading long-term or when you are not monitoring the stop loss in case the market goes back after hitting it.4. Do not leave the work alone to stop loss, monitor your trade and act according depending on the situation (enter the position back if need be).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "November 25, 2023, 07:46:29 AM",
      "body": "Depends……On how much risk I am willing to take. Some people sell when the asset goes down by 5%. Sometimes it is 10%. Personally I don’t use stop-loss most of the time because I don’t gamble on such crappy assets. I only buy the assets which i am not going to sell in the short term. That means if the asset price drops, I don’t sell, I buy more because I believe that it will become a good trade later on.If I’m gambling on shitcoins (which doesn’t happen very often) I use 5-10% stop loss depending on my mood.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 25, 2023, 08:28:32 AM",
      "body": "There are two that I know and they are:stop limitstop lossStop limit is used for spot trading in a way you can buy an unstable coin with stable coin and later automatically buy back the stable coin at certain price if you are losing. Assuming the price of a coin to USDT is $1. You use stop limit for the coin and the limit price your set is $0.9 while the stop price is $0.91. That means if the price of the coin fall to $0.91, the coin should be converted back to the stable coin at $0.9. The stop price should be slightly higher than the limit price that you set.But the question that you asked which is stop loss, it is used in derivative trading. To be specific, it is used in perpetual and future trading. If you open a long position with a coin at price of $1 and you set the stop loss to be $0.9, if the price of the coin fall to $0.9, your long position will close and you will not further lose again. If you open a short position with a coin at $1 and you set stop loss to be $1.1, if the coin increase in price and reach $1.1, your position will close and you will not further lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "November 25, 2023, 09:05:47 AM",
      "body": "The nature of your trades always determines your strategies to boycott lost.For instance you trades on stocks that is liable to run out of date, you basically don't need to hodl for larger profits else your stocks could count you lost out of expirations.I have run some kind of stock businesses in sometimes with marketing competitions which in times runs investors  stop gains due to lack of trading strategies.Example. Your competitors has a rate to sell a pair of stock at $10 whereas there is a poor demand maybe a caused of inflations.So I could logically insight the rate of demands and the demands challenges and then instead of selling same pair of stock at $10 as others traders, I sells at $8.09 or $9 to magnetise number of demands to myself and then I could sell out quickly on the process and orders for a restocking again. So before other traders could sell 1 pair of stock at the rate of $10, I must have sold over 7stocks at my stipulated rate.While others traders still have old stocks in store, I must have ordered for restocks over several times.And this would help my stocks to keep up to date instead of running out to date.With this, I could boycott stop gain and maintains a level of stop loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "November 25, 2023, 01:17:00 PM",
      "body": "Stop loss is use to minimize the loss you could suffer just in case the market went to the opposite direction of your trade, because it will stop your trade once it's triggered on a certain price you've set it. If I'm not mistaken, it's always visible on the trading panel in futures, you just have to explore UI of whenever platform you're using in trading. If you can't still see it, for sure there's a lot of YouTube tutorials regarding about the exchange where you're doing your trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "November 25, 2023, 01:23:07 PM",
      "body": "Quote from: AicecreaME on November 25, 2023, 01:17:00 PMIf I'm not mistaken, it's always visible on the trading panel in futures, you just have to explore UI of whenever platform you're using in trading. If you can't still see it, for sure there's a lot of YouTube tutorials regarding about the exchange where you're doing your trades. A stop-loss is normally a so-called advanced feature on the exchanges, i.e. it is only available on the Pro-Exchanges (Kraken Pro, ...). The classic \"I want to buy and sell Bitcoin\" trader has not started much with it and usually does not use it. For me, however, stop loss is one of the basic tools of every trader, alongside take profit. Anyone who trades at least in short time frames should inform themselves about how they work and, above all, their benefits. A stop loss has already saved me from many dicey situations, but of course it is not a panacea. It should be used with caution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 25, 2023, 01:30:28 PM",
      "body": "The links have been dropped already OP so take all of those reference and read how to use it. Basically, the word itself is to set an amount for you to have a stoppage of your loss. You just simply set the price for your trade and it's likely 5%-10% or depending on how much you want it to be.This is why I don't like trading, I let it lose if I'm holding because eventually it's going to recover without doing anything and no need to be pressured by the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "November 25, 2023, 04:25:53 PM",
      "body": "Quote from: boyptc on November 25, 2023, 01:30:28 PMThis is why I don't like trading, I let it lose if I'm holding because eventually it's going to recover without doing anything and no need to be pressured by the market.Every time I trade, I set a stop loss. When I was new to trading, I tried to not to use a stop loss, but it cost my funds every time my margin was liquidated. Therefore, I backtested and modified my method in order to create a trading plan. I discovered an invalidity in which if the price moves to that place, it confirms that the market will go in the other way. In that way, you will reduce your risk while increasing your gain. So, for me, a stop loss is essential for market survival.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "November 25, 2023, 04:28:27 PM",
      "body": "Quote from: Richkiedx on November 25, 2023, 03:16:28 AMhow do you use a stoplossYou set your stop loss as a safety when you are sure and not sure about the direction a trade will go. If you are selling, your stop loss should be set above the point at which your trade was executed, so that your capital will be save if the trade buys instead of sells as predicted. If you are buying, stop loss should be set below the point of execution of the trade. The ability to be able to detect and correctly set up stop loss in each trade will help the trader ensure that they do not loose too much to a trade if it does not go as planned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "November 25, 2023, 04:36:17 PM",
      "body": "Quote from: Richkiedx on November 25, 2023, 03:16:28 AMhow do you use a stoplossDifferent website have different option of stop loss feature because they add some minor modification for setup which is confusing for newbie user like you.But to make it simple. Stop loss purposes is self explanatory, it’s use to limit your losses by setting up the price which you accept loss in case it hits by the market price. Most the exchange just let you input the price to place an advance order to sell your asset at loss when the market price hits it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "November 25, 2023, 05:08:19 PM",
      "body": "The use of stop loss is generally used to limit the level of loss that will be accepted, usually stop loss is closely related to futures trading. Because of the high level of risk in this market, it is not surprising if losses occur that cause the balance to run out. Stop loss is intended as a loss limiter, we can freely determine the loss limit that we will receive if the market moves not in accordance with our trading position. Usually we will set a stop loss with a loss of funds that is afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "petulino",
      "created_time": "November 25, 2023, 05:09:33 PM",
      "body": "Quote from: Richkiedx on November 25, 2023, 03:16:28 AMhow do you use a stoplossfirst of all you understand stop loss setting you can set a price in your mind which you want to accept its all depend on your knowledge about coin graph and also your risk taking percentage for example you buy one coin in price of 100$$ and you cover loss of 10% then you can use and set stop loss on 90$$you can place your order on your desired platform then inter your specific stop loss order which you want.now there are two types of stop loss MARKIT STOP LOSS and LIMIT STOP LOSS,  the 1st one is depend on market condition the order will be executed once stop loss price reached and the 2nd one is depends on price which you set if markets down and hit your target then its sold but its not guarantee that its fully executed it market moving quickely",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "November 25, 2023, 05:30:19 PM",
      "body": "Quote from: Stepstowealth on November 25, 2023, 04:28:27 PMQuote from: Richkiedx on November 25, 2023, 03:16:28 AMhow do you use a stoplossYou set your stop loss as a safety when you are sure and not sure about the direction a trade will go. If you are selling, your stop loss should be set above the point at which your trade was executed, so that your capital will be save if the trade buys instead of sells as predicted. If you are buying, stop loss should be set below the point of execution of the trade. The ability to be able to detect and correctly set up stop loss in each trade will help the trader ensure that they do not loose too much to a trade if it does not go as planned. I think OP is asking how to set stop loss rather than when to set stop loss. Basically, OP is a newbie with no knowledge on how to set things up with the exchange he is using so he is asking us how to set a stop loss. I believe he doesn't have any experience in trading, so best for OP to learn is by doing it, trade with low margin and see things work. It is easier to learn things when you experience it, rather than merely reading replies from here or from google. And as a newbie, my friendly advice is to set a stop loss every time you position yourself in the market, don't trust yourself that you can monitor the market, sometimes it takes 30 seconds for the market to crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 25, 2023, 09:12:15 PM",
      "body": "Quote from: jeraldskie11 on November 25, 2023, 04:25:53 PMQuote from: boyptc on November 25, 2023, 01:30:28 PMThis is why I don't like trading, I let it lose if I'm holding because eventually it's going to recover without doing anything and no need to be pressured by the market.Every time I trade, I set a stop loss. When I was new to trading, I tried to not to use a stop loss, but it cost my funds every time my margin was liquidated. Therefore, I backtested and modified my method in order to create a trading plan. I discovered an invalidity in which if the price moves to that place, it confirms that the market will go in the other way. In that way, you will reduce your risk while increasing your gain. So, for me, a stop loss is essential for market survival.Most newbies get it wrong when they trade.They thought that they just have to leave their trades without this feature. But they have to set the stop loss for them to be able to at least mitigate the losses that they might incur.It's true that stop loss reduces the risk that you're about to gain when you're not in favor of the market. A trader should always anticipate that he might lose his trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "November 25, 2023, 11:50:42 PM",
      "body": "Regardless of what exchange you're using, the purpose and the process of using a stop loss remains the same. let me walk you through. When you're trading futures, there's a tendency for you to burn through your whole wallet's amounts in order to satisfy your trading position, and when this happens, you're going to be left with nothing, and unlike investing you'll have nothing to sell for either since this is a call you made for a crypto, not a purchase itself. Now, to counteract this eventuality, you're given the chance to set and execute a certain amount/value that would trigger your trade position to stop immediately, as soon as it reaches that amount. That's your stop loss. It literally means what it says on the tin, it stops you from incurring more losses. Now, the process may differ from exchanges but for the most part, when you're trading futures you're going to be given the chance to set a stop loss amount in the same interface where you're locking in your trade. Be very mindful of using it so you don't lose all your money in one go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "November 26, 2023, 09:28:44 AM",
      "body": "Quote from: Stepstowealth on November 25, 2023, 04:28:27 PMQuote from: Richkiedx on November 25, 2023, 03:16:28 AMhow do you use a stoplossYou set your stop loss as a safety when you are sure and not sure about the direction a trade will go. If you are selling, your stop loss should be set above the point at which your trade was executed, so that your capital will be save if the trade buys instead of sells as predicted. If you are buying, stop loss should be set below the point of execution of the trade. The ability to be able to detect and correctly set up stop loss in each trade will help the trader ensure that they do not loose too much to a trade if it does not go as planned.To start with stop loss helps to prevent financial loss. Stop loss is an order that is associated with an open trade or a position in an open market. It is designed to get you out of a losing trade at a predetermined level or predetermined financial amount to prevent any further loss. You should use it as a beginner and a very important benefit is that it protects you from unforeseen events that take place in the trading space. Also setting a stop loss gives you control over the risks inherent in a trade.The way to use a stop loss is to place the stop loss where you don't expect to get stopped out. First view the market using a top-down approach. Using a chart, draw in your key levels of support and resistance because that is what will form the basis of where you place your stop loss levels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}