{
  "id": "topic_5420948",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "November 14, 2022, 11:24:03 AM",
  "content": "Вот никак не мог обойти своим вниманием тему украинского енота. Как она меня уже достала! Как будто уже более важных тем нет в этом мире. Итак, что мы в итоге имеем (далее идут отрывки из канала Пивоварова): Военный блогер Анна Долгарева после отхода российский войск из Херсона писала (https://t.me/dolgarevaanna/2255): «Единственная хорошая новость в том, что мой товарищ успел покрасть енота из херсонского зоопарка». После того, как сообщение о краже енота распространилось в интернете, Долгарева объяснила (https://t.me/dolgarevaanna/2268) свой выбор слов «легкомысленностью и утонченным чувством языка» и добавила, что в своем телеграм-канале использует слово «покрасть» в значении «вывезти из-под обстрелов».      Афигенная тема в итоге! Теперь, каждого жулика, вора, бандита и мародера можно оправдать словами об том, что он, дескать, попытался вывести объект «из зоны обстрела», енота ли, стиральную машину или унитаз или «изнасиловать, чтобы спасти от насилия другими коллегами».  «Спасение культурных ценностей, а также копченых мощей Потемкина», вывоз их во славу Российского православия, и во имя Господа нашего Иисуса христа, который, однако, почему-то запрещает убивать себе подобных (странно, не правда ли?). Но вот некоторые еноты (пропагандисты, по-сути) почему-то этот факт усиленно скрывают от общественности. Резюмируя вышесказанное, я хотел бы еще раз порекомендовать дать свободу всем енотам, бобрам, и прочим деятелям политики и культуры, а также порекомендовать чисто из гуманитарных соображений покрасть все самое лучше, что создано человечеством, присвоить и легализовать, сделать \"цап-царап\" (с) В. Путин, но уже в российской юрисдикции. Как-то так, Аминь акбар!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420948",
  "comments": [
    {
      "author": "Vadi2323",
      "created_time": "November 14, 2022, 02:25:01 PM",
      "body": "Енота \"покрал\" Олежка Зубков из парка Тайган. Я когда-то смотрел его видео на Ютубе, пока лев не покусал женщину, которой он отказался оплатить лечение, при этом повёл себя омерзительно. После этого я его смотреть принципиально перестал.А тут после истории с енотом узнал, что Олежка, оказывается, не только мразь, а мраZь и коллаборант.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "November 14, 2022, 04:26:55 PM",
      "body": "Вот будет прикол если действительно как обещали обменяют 10 кадыровцев на одного енота",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "November 14, 2022, 04:47:45 PM",
      "body": "А это будет не дофига? 10 енотов на одного кадыровца? А что на это счет думают сами кадыровцы? Они типа согласны?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 14, 2022, 05:40:04 PM",
      "body": "Quote from: The0ldl_lser on November 14, 2022, 04:26:55 PMВот будет прикол если действительно как обещали обменяют 10 кадыровцев на одного енота  Интересное предложение.Но, ты думаешь, у хохлов есть столько пленных кадыровцев? По теме: ну хотя бы енота от нацистов спасли. И то хорошо. Грета будет рада )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "November 16, 2022, 10:37:45 AM",
      "body": "А вот если бы кое-кто когда-то зачем-то не стал бы захватывать Херсон, то ни одного енота не пришлось бы спасать. И всем было бы хорошо.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vadi2323",
      "created_time": "November 16, 2022, 02:15:58 PM",
      "body": "Quote from: bonfire66 on November 16, 2022, 10:37:45 AMА вот если бы кое-кто когда-то зачем-то не стал бы захватывать Херсон, то ни одного енота не пришлось бы спасать. И всем было бы хорошо.Поди Мандавошка опять что-то скопировал-вставил, зря ты его не игноришь.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 16, 2022, 07:02:55 PM",
      "body": "Опять наш Боевой сруль обосрался и сравнил бедного енота, которого спасли от надругательсва укро-нацистами, с унитазом (хотя данное сравнение гораздо больше подходит для укро-беженцев, в число которых наш Боевой сруль и хотел бы давно попасть, но ... никак не может этого сделать из-за его небольшого \"недоразумения\" между ног (которым он всё равно не пользуется по его главному назначению), из-за которого его Клоун Всея Укроины за пределы этой самой укроины не выпускает давно уж ...)Сочувствую нашему Вадяю, в чем-то его понимаю и даже немного ему сочувствую ...Ведь гнусные поляки до сих пор не передали украине свои унитазы \"Polska Dupa\" для производства супер-современных боевых говномётов \"Какл\", которыми Боевые срули сразу всех победят! Quote from: Snork1979 on November 02, 2022, 08:49:38 PMИли ты думаешь, что украинский нац.батальон \"Боевые срули\" получит таки давно ожидаемые польские Каклы и уж тогда то ты \"всем покажешь!\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "November 20, 2022, 03:05:58 PM",
      "body": "Пленные теперь сами просят поменять их на херсонского енота: https://t.me/operativnoZSU/57529",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 21, 2022, 07:16:42 AM",
      "body": "Quote from: The0ldl_lser on November 20, 2022, 03:05:58 PMПленные теперь сами просят поменять их на херсонского енотаЕноту это очень не понравится Он жил в тепле, с нормальной едой и чистой водой.А теперь Херсон оккупировали укро-нацисты и там даже люди уже набирают воду из луж.И, как пытаются уверить нас хохло-сми, сами люди от этого безмерно счастливы и в полном восторге от такого «освобождения»",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaxsun",
      "created_time": "November 21, 2022, 07:41:06 AM",
      "body": "Quote from: Snork1979 on November 21, 2022, 07:16:42 AMQuote from: The0ldl_lser on November 20, 2022, 03:05:58 PMПленные теперь сами просят поменять их на херсонского енотаЕноту это очень не понравится Он жил в тепле, с нормальной едой и чистой водой.А теперь Херсон оккупировали укро-нацисты и там даже люди уже набирают воду из луж.И, как пытаются уверить нас хохло-сми, сами люди от этого безмерно счастливы и в полном восторге от такого «освобождения» Это не сон, это АТБ в ХерсонеКак видно кацапня за 8 месяцев  окупации так и не смогла или не схотела сделать нечто подобное,хотя имели стыреную базу супермаркетов,то что АТБ  сделали за считанные дни.Ну зато мародерить ,грабить,разрушать нормально в орков получается.https://twitter.com/Q0MT6pFmbVqynsM/status/1594290108009676802",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "November 21, 2022, 09:13:41 AM",
      "body": "Кстати, в сети, а в частности во вчерашнем выпуске Редакции Ньюс Пивоварова есть видео, где русофилы \"защитники животных\" берут за хвост того самого енота и пихают его в клетку. Ну, то есть жил себе енот в Херсоне, никого не трогал, радовал херсонских  детишек, а тут его выдрали за хвост из будки и насильно переселили в Крым. Вам будет приятно, если вас за хвост подвешивают и держат кверху ногами? Да, и это я еще не упомянул подробности разграбления Херсонского Краеведческого Музея.Скажите мне пожалуйста, сколько енотов и мощей похитили украинцы с российских территорий за последние 30 лет?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 21, 2022, 06:22:14 PM",
      "body": "Quote from: bonfire66 on November 21, 2022, 09:13:41 AMСкажите мне пожалуйста, сколько енотов и мощей похитили украинцы с российских территорий за последние 30 лет?Бонифаций, открою тебе страшный секрет: 30 лет назад (до 1991, если быть точным) на Украине, как отдельном суверенном государстве, воообще не было ни одного енота и ещё чего-либо.По той простой причине, что такого государства даже не существовало на карте мира",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "November 23, 2022, 09:53:42 AM",
      "body": "И у вас есть доказательства, что до 1991 года ни в одном украинском зоопарке не было ни одного енота? Скажу вам еще более страшный секрет. 30 лет назад даже РОССИИ не было НИ НА ОДНОЙ карте мира! Она как государство тоже не существовала!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 23, 2022, 06:27:10 PM",
      "body": "Бонифаций, мы отошли от твоей же темы.Так с енотом то чего делать будем?Отдадим его на растерзание укро-нацистам?Или таки уважим Гретту и оставим его ещё жить в Крыму в нормальных условиях?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rostislavgrishin91",
      "created_time": "November 24, 2022, 01:52:06 AM",
      "body": "а других животных спасли ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "November 25, 2022, 12:43:46 PM",
      "body": "Вот вы знаете, А я был очень удивлен, когда недавно прочитал, что оказывается, несмотря на оккупацию и блокаду, Ленинградский, Одесский и Киевский зоопарки в период 1941-1944 гг существовали, и многие животные там выжили. И не только эти зоопарки на оккупированных территориях. То есть, фашисто-нацисты к животным вполне нормально относились. Да и к мирным российским людям тоже, что удивительно, в отличии от того же И. Сталина. А вот российские войска, зайдя на чужую территорию тут же начали грабить украинское зоопарки. О чем это говорит?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}