{
  "id": "topic_5425937",
  "title": "Ghostnipple",
  "author": "Ghostnipple",
  "created_time": "December 06, 2022, 07:45:55 AM",
  "content": "Hi Guys,I'm no longer reachable on the Stake community forum. The moderators there have taken control of my personal account and made modifications to my content there without my permission. Over the last 18 months moderators have been engaging in an escalating set of unethical behaviours: - censoring and removing posts that express opinions they do not agree with. - creating new accounts, using them to abuse existing players. - taking over reputable player accounts and modifying their content. Censorship is a tool of oppression and I cannot continue to contribute to a forum that is policed by individuals who's sole objective is to create an illusion of a supportive community while suppressing the emergence of a supportive community. I have instructed the staff in the Serbian office to remove all of my content as it does not belong to Stake.com, however 3 months later they continue to use that material to promote the casino, without permission. This is two counts of theft that I am aware of. There are many good individuals who work at stake.com, but (similar to the players) they are fragmented, and can't conceive of the kind of behaviour that I describe above. So it's really up to the directors now to take action. To any members of the stake community forum who need to reach me you can contact me here.regards Ghostnipple",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425937",
  "comments": [
    {
      "author": "Slow death",
      "created_time": "December 06, 2022, 10:04:12 AM",
      "body": "these are very serious accusations, I suggest you post proof of these accusations, it is not a scam accusation per se as far as I can see, but it is still an accusation of bad behavior by some people, this is not against stake.com casino , and about some people, I believe that the casino did not send these people to do this kind of things if it turns out that they do this kind of things, I don't know if this thread is appropriate for this section, but if you have proof then post. By the way, have you contacted their support to see if they can intervene in this problem?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 06, 2022, 10:31:10 AM",
      "body": "I agree with Slow Death,these are extremely dangerous and serious accusations and without providing proof,like your chats against the stake moderators and any other email you may have received from them that they have disabled your account for such and such reasons need to be here,or better if you have real proof you can open a scam accusation in the section called like that here in the forum in order to make those people responsible for this being punished by stake as I believe stake has no control of what an employee decides to do with their privileges but if they are given proofs then they can take serious measures against abusers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "December 06, 2022, 11:29:20 AM",
      "body": "no offence, but any proof that you actually are who you say you are? also, as Slow death has mentioned, any evidence to support your claim? I am not telling you that you are lying but with the number of scams I have seen here in the forum, it would be best for me and the members to be cautious and verify that you are who you say you are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "December 06, 2022, 12:11:02 PM",
      "body": "If you are serious, we are here to help you, but the issue requires real evidence, and in the absence of it, we have no power. You can also contact support and file a complaint with them. I think they will help you, And if the process doesn't work for you, you can take a screenshot and share it in the dedicated section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "December 06, 2022, 12:21:49 PM",
      "body": "For such accusations of manipulation of the opinion of the community by the organizers, it is necessary to prepare well and prepare supporting facts. Otherwise, it will simply remain a statement without appropriate evidence, I don't believe anything, but at the same time I can't exclude anything, but everything should be based on evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "December 06, 2022, 12:35:27 PM",
      "body": "Quote from: Ghostnipple on December 06, 2022, 07:45:55 AM...such accusations (very serious ones) must be proved by proofs. otherwise they have no value. above all, evidence is needed to understand who is involved since as you yourself say \"they are not all involved\" in this series of actions.last but not least you should also provide proof that you are the same from the stake community user (a signed message or a reputable person confirming your identity).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "December 06, 2022, 04:02:59 PM",
      "body": "suggestion for the OP. if your allegation is true, it is best to provide details and include valid evidence. so that all of us here can see how big a problem you are.but I think this has nothing to do with Stake.com, this is just the behavior of people outside the company.but try to provide evidence first.sorry if I am wrong",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 06, 2022, 04:14:12 PM",
      "body": "Quote from: Ghostnipple on December 06, 2022, 07:45:55 AM....The moderators there have taken control of my personal account and made modifications to my content there without my permission.Have you considered that your account may have been exploited by another person not related to the casino? Did you ask assistance from Stake's customer support the first time you discovered you can no longer access that account? This is probably an angle they can use as defense against your accusation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 06, 2022, 07:25:10 PM",
      "body": "I don't think you posting content on their platform and them not being willing to remove it counts as the theft of intellectual property.  I don't believe they have any responsibility to act upon your request to remove your content.  Sure, it sucks, but I imagine the reason for them doing this isn't to profit from your amazing content.  More likely they don't have the manpower to be catering to people who are worried about such things.  They have money to make, not a community to moderate.  If you are causing problems, they aren't going to tip toe around to make sure you feel like your rights are respected.  They'll just take action and move on.  The level of catering you're seeking can't be scaled at the level they're operating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ghostnipple",
      "created_time": "December 07, 2022, 05:38:58 AM",
      "body": "Quote from: OgNasty on December 06, 2022, 07:25:10 PMI don't think you posting content on their platform and them not being willing to remove it counts as the theft of intellectual property.  I don't believe they have any responsibility to act upon your request to remove your content.  Sure, it sucks, but I imagine the reason for them doing this isn't to profit from your amazing content.  More likely they don't have the manpower to be catering to people who are worried about such things.  They have money to make, not a community to moderate.  If you are causing problems, they aren't going to tip toe around to make sure you feel like your rights are respected.  They'll just take action and move on.  The level of catering you're seeking can't be scaled at the level they're operating. Please make a full disclosure of your financial interests in Stake.com before you comment in this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blawpaw",
      "created_time": "December 07, 2022, 08:39:17 AM",
      "body": "Before you come here to do such accusations you should gather some proof. Pointing the finger without any proof whatsoever is just playing dirty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ghostnipple",
      "created_time": "December 09, 2022, 05:23:40 PM",
      "body": "Quote from: Blawpaw on December 07, 2022, 08:39:17 AMBefore you come here to do such accusations you should gather some proof. Pointing the finger without any proof whatsoever is just playing dirty.I think you mean \"evidence\". I do have documented evidence. However I see no reason to post it here, as I am not trying to convince anyone of anything.Believe what you want it is of no consequence to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ghostnipple",
      "created_time": "December 09, 2022, 05:37:57 PM",
      "body": "Quote from: Ulven on December 06, 2022, 12:11:02 PMIf you are serious, we are here to help you, but the issue requires real evidence, and in the absence of it, we have no power. You can also contact support and file a complaint with them. I think they will help you, And if the process doesn't work for you, you can take a screenshot and share it in the dedicated section.Thanks for your response, actually I'm not looking for help or anyone to do anything nor am I looking to convince anyone of anything. I'm just reaching out to those who supported me in the stake forum who are unaware of my situation. I just want to inform them that I'm excluded from posting and can't reply to their questions there and also notifying them of the actions taken by moderators. I do this here as I know there is cross over between forums.I'm also informing stake.com that they have an issue relating to IP ownership of posts made on site. Whether they pay any attention to me or not is not important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 09, 2022, 06:29:35 PM",
      "body": "Quote from: Ghostnipple on December 09, 2022, 05:37:57 PMQuote from: Ulven on December 06, 2022, 12:11:02 PMIf you are serious, we are here to help you, but the issue requires real evidence, and in the absence of it, we have no power. You can also contact support and file a complaint with them. I think they will help you, And if the process doesn't work for you, you can take a screenshot and share it in the dedicated section.Thanks for your response, actually I'm not looking for help or anyone to do anything nor am I looking to convince anyone of anything. I'm just reaching out to those who supported me in the stake forum who are unaware of my situation. I just want to inform them that I'm excluded from posting and can't reply to their questions there and also notifying them of the actions taken by moderators. I do this here as I know there is cross over between forums.I'm also informing stake.com that they have an issue relating to IP ownership of posts made on site. Whether they pay any attention to me or not is not important.Well, I totally understand or rather get the angle you are coming from, this is not like you are accusing the stake casino itself of doing you wrong, but the stake forum which according to you, and to what I understand, have been hijacked(if am allowed to use that word) by some unethical people with the moderators status, in other words, we can say that they are abusing their power as moderators by using it to silence some important contributors on the stake forum which you happen to be one.Well, things like this are common anyway, so I am not surprised, all I can say or suggest now is, depending on how serious you take the issue, you might want to report this to those at the top at stake.com, you can contact Stunna here on bitcointalk and discuss the issue with him, I believe that if he understands and see reasons with you, he can help pass the issue to those who can take action on the moderators perpetrating such act.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ghostnipple",
      "created_time": "December 10, 2022, 07:46:09 AM",
      "body": "Quote from: Fivestar4everMVP on December 09, 2022, 06:29:35 PMQuote from: Ghostnipple on December 09, 2022, 05:37:57 PMQuote from: Ulven on December 06, 2022, 12:11:02 PMIf you are serious, we are here to help you, but the issue requires real evidence, and in the absence of it, we have no power. You can also contact support and file a complaint with them. I think they will help you, And if the process doesn't work for you, you can take a screenshot and share it in the dedicated section.Thanks for your response, actually I'm not looking for help or anyone to do anything nor am I looking to convince anyone of anything. I'm just reaching out to those who supported me in the stake forum who are unaware of my situation. I just want to inform them that I'm excluded from posting and can't reply to their questions there and also notifying them of the actions taken by moderators. I do this here as I know there is cross over between forums.I'm also informing stake.com that they have an issue relating to IP ownership of posts made on site. Whether they pay any attention to me or not is not important.Well, I totally understand or rather get the angle you are coming from, this is not like you are accusing the stake casino itself of doing you wrong, but the stake forum which according to you, and to what I understand, have been hijacked(if am allowed to use that word) by some unethical people with the moderators status, in other words, we can say that they are abusing their power as moderators by using it to silence some important contributors on the stake forum which you happen to be one.Well, things like this are common anyway, so I am not surprised, all I can say or suggest now is, depending on how serious you take the issue, you might want to report this to those at the top at stake.com, you can contact Stunna here on bitcointalk and discuss the issue with him, I believe that if he understands and see reasons with you, he can help pass the issue to those who can take action on the moderators perpetrating such act. Thanks for the advice. Im not so concerned on a personal level, but it is very alarming to see staff hack into a players account, modify that player's profile without permission, in order to hide a ban they actioned without due process.The management team dont have time to engage at player level, so to get their attention sometimes you have to start a fire. If you don't do this your message will be lost in the background noise. I have started many fires in the stake forum each with its own message, if they are smart they see the point I'm making, some only see the fires.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "December 10, 2022, 07:52:41 AM",
      "body": "Quote from: Ghostnipple on December 09, 2022, 05:23:40 PMQuote from: Blawpaw on December 07, 2022, 08:39:17 AMBefore you come here to do such accusations you should gather some proof. Pointing the finger without any proof whatsoever is just playing dirty.I think you mean \"evidence\". I do have documented evidence. However I see no reason to post it here, as I am not trying to convince anyone of anything.Believe what you want it is of no consequence to me.If you are not trying to convince us, why did you even create this thread? If you have evidence post it here (creating a separate scam accusation thread would be better) and create a flag on stake’s account. If the default trust users think you are right, then they will support your flag and stake.com will be in trouble here.If you are not going to walk the talk, then wtf are you doing here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ghostnipple",
      "created_time": "December 10, 2022, 07:59:43 AM",
      "body": "Quote from: acroman08 on December 06, 2022, 11:29:20 AMno offence, but any proof that you actually are who you say you are? also, as Slow death has mentioned, any evidence to support your claim? I am not telling you that you are lying but with the number of scams I have seen here in the forum, it would be best for me and the members to be cautious and verify that you are who you say you are.Thanks for your response. A lot of people would know me from bustadice originally, as for stake I think anyone who frequents the stake forum would know my writing style. I can't think why it would be necessary for me to prove I am the same individual as Ghostnipple at Stake.com and Ghostnipple at Bustadice.com, but if a good enough reason arose I'm sure I could find a way to prove I am the same individual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "December 10, 2022, 09:21:15 AM",
      "body": "Well, about a Week ago I started a thread there to determine if people want these Bonus drops with a sucky RTP or if they just want a normal RTP on original games without the \"feeding\" mode turned on..... and it was deleted. (I started a Poll on Strawpoll to see what people want)Now, it can be one of two things.... 1. They did not want people to know that \"feeding\" mode is turned on during Bonus drops. (Which is perfectly legal, as long as you show the correct RTP being used) or2. They do not agree with me that \"feeding\" mode is turned on during Bonus Drops. (I base my observation on tests that has been done by myself and 50+ of my friends that help me test this... we discuss this in our own WhatsApp Stake Group) I think it would have been better, if a Mod just replied to the thread and then denied that the RTP are altered during Bonus drop periods. (They could then just closed the thread)  In any way.... my experience with Stake has been very good, so things like this does not influence me to not play there. They do a lot other things correctly, so I forgive them...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ghostnipple",
      "created_time": "December 10, 2022, 09:33:41 AMLast edit: December 10, 2022, 09:45:47 AM by Ghostnipple",
      "body": "Quote from: Kakmakr on December 10, 2022, 09:21:15 AMWell, about a Week ago I started a thread there to determine if people want these Bonus drops with a sucky RTP or if they just want a normal RTP on original games without the \"feeding\" mode turned on..... and it was deleted. (I started a Poll on Strawpoll to see what people want)Now, it can be one of two things.... 1. They did not want people to know that \"feeding\" mode is turned on during Bonus drops. (Which is perfectly legal, as long as you show the correct RTP being used) or2. They do not agree with me that \"feeding\" mode is turned on during Bonus Drops. (I base my observation on tests that has been done by myself and 50+ of my friends that help me test this... we discuss this in our own WhatsApp Stake Group) I think it would have been better, if a Mod just replied to the thread and then denied that the RTP are altered during Bonus drop periods. (They could then just closed the thread)  In any way.... my experience with Stake has been very good, so things like this does not influence me to not play there. They do a lot other things correctly, so I forgive them...  I don't think it is acceptable behaviour to delete someone's post without any justification. You put thought and time into writing that, and you are contributing in a meaningful way to the community there. It's disrespectful behaviour... however every action communicates something and that action communicates fear, so it's useful either way XDI'm a long term supporter of stake, however I draw a very clear line between the current individuals who are temporary and make up the ever changing management team,  and Stake itself which is essentially the players.So what is feeding mode? it's when the casino eats players coin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}