{
  "id": "topic_5468239",
  "title": "BlackBoss_",
  "author": "BlackBoss_",
  "created_time": "September 27, 2023, 12:20:58 AM",
  "content": "The Bitcoin Spiral: Halving cycle is interesting. It summarizes past cycles, the current one and future ones as well. With multiplier x10 between two consecutive circles, it is easily to see Bitcoin growth through some cycles but with slower growth rate for future halving cycles, I think we will have to wait some more halvings to see Bitcoin price reaches $1M.Cycle repeat from Charts.bitbo.io has a price projection for Bitcoin next bull run after 2024 halving. I know projection is not correct but let's see how the projection is. According to it, if the historic cycle repeats itself, a next all time high can be around $180,000 to $200,000 in late of 2025, about one year and a half after 2024 April halving.The progress of 2024 halving is about 85% done. The latest block is 809,891 and a block where halving happens is 840,000. Counting down only 30,509 more blocks till the 2024 halving.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468239",
  "comments": [
    {
      "author": "GreatArkansas",
      "created_time": "September 27, 2023, 01:32:38 AM",
      "body": "The most awaited event right now. If you really deep dive into the history of past Bitcoin block halvings, you will see that it clearly shows that the price of Bitcoin will be somehow above the lows months before the block halvings. As months before the Bitcoin block halvings is the best time to accumulate Bitcoin, just my 2 cents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 27, 2023, 02:14:01 AM",
      "body": "Quote from: GreatArkansas on September 27, 2023, 01:32:38 AMThe most awaited event right now. If you really deep dive into the history of past Bitcoin block halvings, you will see that it clearly shows that the price of Bitcoin will be somehow above the lows months before the block halvings. As months before the Bitcoin block halvings is the best time to accumulate Bitcoin, just my 2 cents.I am also taking the opportunity now to accumulate. The only fear I have is that the halving may not be as good as expected, as everyone expects. In fact, this cycle was better than all the forecasts that were made, as all the serious ones were giving a maximum above $100,000.Quote from: BlackBoss_ on September 27, 2023, 12:20:58 AMAccording to it, if the historic cycle repeats itself, a next all time high can be around $180,000 to $200,000 in late of 2025, about one year and a half after 2024 April halving.History will not keep repeating itself forever. From what I said before I would expect a more moderate high, around $150,000 or thereabouts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 27, 2023, 02:32:48 AM",
      "body": "Quote from: BlackBoss_ on September 27, 2023, 12:20:58 AMCycle repeat from Charts.bitbo.io has a price projection for Bitcoin next bull run after 2024 halving. I know projection is not correct but let's see how the projection is. According to it, if the historic cycle repeats itself, a next all time high can be around $180,000 to $200,000 in late of 2025, about one year and a half after 2024 April halving.Expectations indicate this, but to be sure, let us say that if the price of Bitcoin does not decline, the price of $180,000 to $200,000 will be real. What is more logical is that we no longer believe that we will reach a million dollars within the next 10 years, exactly as was said in 2021.But the charts also tell us that we may be in the range of $30,000 to $50,000 by the date of the Halving cycle, with the possibility of a correction occurring in the coming months.What hides me most is the accelerating pace of hacking. If we continue at the same pace, most of the platforms will be hacked and go bankrupt in the coming months, which will lead to the cycle being dumped before $100,000 as what happen after FTX.The list is very long https://hacked.slowmist.io/QuoteThe total amount of money lost by blockchain hackers is about$ 30,934,292,291.24Total hack events 1207",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 27, 2023, 02:39:22 AM",
      "body": "Quote from: Husires on September 27, 2023, 02:32:48 AMWhat hides me most is the accelerating pace of hacking. If we continue at the same pace, most of the platforms will be hacked and go bankrupt in the coming months, which will lead to the cycle being dumped before $100,000 as what happen after FTX.Fucking hell! It's the first time I've seen a prediction based on future hacks, but the way we're going doesn't look very promising and it seems to make sense that if hacks continue to occur, news of them will negatively affect price. Quote from: Husires on September 27, 2023, 02:32:48 AMThe list is very long https://hacked.slowmist.io/QuoteThe total amount of money lost by blockchain hackers is about$ 30,934,292,291.24Total hack events 1207I don't quite see this 'blockchain hackers' thing, I think the name is misleading, as the blockchain has not been hacked, but rather the bitcoins stored in cold wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2023, 04:02:49 AM",
      "body": "Too much people are betting on the fact that the same will happen historically.So I'm betting:1. Halving comes2. We dump3. We sideways chop for a good amount of time4. People realizing that the same won't happen, hence dump5. We pump once weak hands leaveI'm not putting heavy money on this, but I'm going to have some dry powder ready.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "September 27, 2023, 04:22:01 AM",
      "body": "Quote from: mk4 on September 27, 2023, 04:02:49 AMToo much people are betting on the fact that the same will happen historically.So I'm betting:1. Halving comes2. We dump3. We sideways chop for a good amount of time4. People realizing that the same won't happen, hence dump5. We pump once weak hands leaveI'm not putting heavy money on this, but I'm going to have some dry powder ready.Same cycle with different moments in time. In my opinion, point 2 and point 3 have the most potential to occur after point 1 is formed from this cycle pattern and Bitcoin prices may not appear pleasant. Yes. we have to be prepared, but at least it will be a benchmark and a moment that many people have been waiting for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "September 27, 2023, 04:42:27 AM",
      "body": "Quote from: mk4 on September 27, 2023, 04:02:49 AM5. We pump once weak hands leaveBitcoin will pump parabolic after weak hands are out but they don't leave voluntarily but they will be killed with forced liquidations by their greed positions with Leverage, Margin and Futures.I don't hope anyone will be killed by liquidations and lose their money, have their life harder but it's what happen on the market. I hope or don't hope, it can not change what's going on the market and basic psychology of the market cycles",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "September 27, 2023, 05:39:48 AM",
      "body": "Quote from: BlackBoss_ on September 27, 2023, 12:20:58 AMThe progress of 2024 halving is about 85% done. The latest block is 809,891 and a block where halving happens is 840,000. Counting down only 30,509 more blocks till the 2024 halving.]The feeling is usually strong for me whenever I think about the next bitcoin halving and there's no other right time to start accumulating ahead of the halving and the bull run other than from this time as the count down is really drawing closer with each dawning day.I have a hunch that the prospect in the figures projected by many bitcoin experts about the bull run just after it's halving may not be achieved as a lot of expects but I have no fear that the next ATH will be something we all be grateful for when compared to the previous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "September 27, 2023, 06:10:21 AM",
      "body": "Quote from: GreatArkansas on September 27, 2023, 01:32:38 AMThe most awaited event right now. If you really deep dive into the history of past Bitcoin block halvings, you will see that it clearly shows that the price of Bitcoin will be somehow above the lows months before the block halvings. As months before the Bitcoin block halvings is the best time to accumulate Bitcoin, just my 2 cents.You're right there. That's why, in times like this, there are many communities that take advantage of the events so that they can save as much as they can; in fact, they don't want to be left behind in the double halving of Bitcoin. Here they are again.And with the coming Bitcoin halving or bull, as far as I can see, there are many who are already prepared for this matter. But honestly speaking, I envy people who are at least middle-class because, for sure, people like them who believe in Bitcoin will get richer in the future because of their holdings. I just hope that my accumulated bitcoin will also help a lot in the future or in the coming halving until you finish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "September 27, 2023, 06:11:57 AM",
      "body": "Quote from: GreatArkansas on September 27, 2023, 01:32:38 AMThe most awaited event right now. If you really deep dive into the history of past Bitcoin block halvings, you will see that it clearly shows that the price of Bitcoin will be somehow above the lows months before the block halvings. As months before the Bitcoin block halvings is the best time to accumulate Bitcoin, just my 2 cents.The halving is definitely on the horizon and in everyones radar now...along with a Blackrock Spot ETF approval!We have seen before a market rise within the 6 months before the halving followed bya slump after the event itself.  It has taken the best part of a year after that for maximum growth to be achieved.Now - throw into the mix an approved Blackrock Spot ETF - what does that do to the cycle?I think there could be supply v's demand issues...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2023, 06:23:07 AM",
      "body": "Quote from: YUriy1991 on September 27, 2023, 04:22:01 AMQuote from: mk4 on September 27, 2023, 04:02:49 AMToo much people are betting on the fact that the same will happen historically.So I'm betting:1. Halving comes2. We dump3. We sideways chop for a good amount of time4. People realizing that the same won't happen, hence dump5. We pump once weak hands leaveI'm not putting heavy money on this, but I'm going to have some dry powder ready.Same cycle with different moments in time. In my opinion, point 2 and point 3 have the most potential to occur after point 1 is formed from this cycle pattern and Bitcoin prices may not appear pleasant. Yes. we have to be prepared, but at least it will be a benchmark and a moment that many people have been waiting for.I'm on my phone so I can't check the charts currently, but #2 and #3 frequently happens if I remember correctly. It's the #3 part (and a longer chop than usual, probably) that will I think make step #4(hence #5 after)occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WatChe",
      "created_time": "September 27, 2023, 06:24:16 AM",
      "body": "Quote from: GreatArkansas on September 27, 2023, 01:32:38 AMThe most awaited event right now. If you really deep dive into the history of past Bitcoin block halvings, you will see that it clearly shows that the price of Bitcoin will be somehow above the lows months before the block halvings. As months before the Bitcoin block halvings is the best time to accumulate Bitcoin, just my 2 cents.The price stability we are witnessing in Bitcoin is also because majority of investors are mature enough to wait for the halving coming up next year. We saw few dips in price due to some news but price is recovering back towards 30k. Previous halving show that Bitcoin price goes up after few weeks of halving not immediately. Price of Bitcoin is still low and good for accumulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "September 27, 2023, 09:42:12 AM",
      "body": "Quote from: mk4 on September 27, 2023, 04:02:49 AMToo much people are betting on the fact that the same will happen historically.So I'm betting:1. Halving comes2. We dump3. We sideways chop for a good amount of time4. People realizing that the same won't happen, hence dump5. We pump once weak hands leaveDon’t really get what you mean by Sideways chop in your point 3.On the count of point 4. I would have imagined it’s  possibility but, I don’t think there would be any significant dump. Maybe a few 3k-4k dump as, the market will seek to offload the one time profit seeking investors. Clearly, I don’t see those guys to be of any benefit to the crypto ecosystem but, they still do there bit in pushing price towards an expected quota and bring the idea of the possibility of a price range.I don’t what to be in the what if but which ever condition the halving plays out, a pump is eminent.Quotebut, I'm going to have some dry powder readyBe sure not to blow it in the direction of the wind else, the breeze will blow it right back at your face, lol!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 27, 2023, 12:23:04 PM",
      "body": "Quote from: BlackBoss_ on September 27, 2023, 12:20:58 AMThe Bitcoin Spiral: Halving cycle is interesting. It summarizes past cycles, the current one and future ones as well. With multiplier x10 between two consecutive circles, it is easily to see Bitcoin growth through some cycles but with slower growth rate for future halving cycles, I think we will have to wait some more halvings to see Bitcoin price reaches $1M.Cycle repeat from Charts.bitbo.io has a price projection for Bitcoin next bull run after 2024 halving. I know projection is not correct but let's see how the projection is. According to it, if the historic cycle repeats itself, a next all time high can be around $180,000 to $200,000 in late of 2025, about one year and a half after 2024 April halving.The progress of 2024 halving is about 85% done. The latest block is 809,891 and a block where halving happens is 840,000. Counting down only 30,509 more blocks till the 2024 halving.The informations are well explanatory on the chart as shown by OP from his contents, bitcoin halving is the most awaited event everyone anticipated to see come to pass just because of the bullrun the follows it, we have a record of the past events with bitcoin market price and the halving even on several occasions and now that we are on the fourth again, it's another opportunity for every investors to get possible opportunities well they are well positioned to experience this coming next year, the key to participate in them is to invest and hodl.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "September 27, 2023, 01:00:04 PM",
      "body": "The world is a completely different place than at the last having. The world and markets are going to crap. I am going to keep on like the halving doesn't mean anything. I'll see it when I see but if the ETF guys add enough market cap we can add some stability but not too much as to squash volatility.Those ETF guys are collectively smarter than us and if not still have the money. This may be the last horaah of the big 2 or 3x jumps. The market slumps they buy. Blackrock could write a check for the whole crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 27, 2023, 01:53:08 PM",
      "body": "Ever since COVID pandemic with its recession, the predictability of the market has significantly diminished because the so called \"cycles\" trend was effectively broken. If you look at the chart, in 2019 we are seeing the repetition of the same 4-year cycle trend but with the pandemic starting it is stopped and then it crashes before it can turn into a full scale rally. Half of 2020 is bear market which is completely against the \"projection\".Long story short, in a normal cycle price should have been half way to 6 digits already. But instead we are still stuck in $20k-$30k levels.This is why I think the rallies will happen somewhat similar to before but the size of them are unpredictable so we can't know whether it is going to get to $200k as you mentioned in OP.P.S. The first chart is a very interesting way of representing the cycles, thanks for sharing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 27, 2023, 03:05:33 PM",
      "body": "Quote from: pooya87 on September 27, 2023, 01:53:08 PMEver since COVID pandemic with its recession, the predictability of the market has significantly diminished because the so called \"cycles\" trend was effectively broken. If you look at the chart, in 2019 we are seeing the repetition of the same 4-year cycle trend but with the pandemic starting it is stopped and then it crashes before it can turn into a full scale rally. Half of 2020 is bear market which is completely against the \"projection\".Long story short, in a normal cycle price should have been half way to 6 digits already. But instead we are still stuck in $20k-$30k levels.This is why I think the rallies will happen somewhat similar to before but the size of them are unpredictable so we can't know whether it is going to get to $200k as you mentioned in OP.P.S. The first chart is a very interesting way of representing the cycles, thanks for sharing.It's why there are theories that Blackrock is manipulating the market and it's all because of the futures market where the traders in that market are pulling the price down. And SEC is also not approving any Spot ETF for it will just go from the lowest price to shoot up to the 6 digits.But then anyway, once the volume gets too low after halving, there is nowhere else to go but up but I couldn't expect too much as soon as the RSI says it's overbought, thats just it. It may dump a bit and retrace back but it won't exceed far from the ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2023, 04:14:22 PM",
      "body": "Quote from: Mr.right85 on September 27, 2023, 09:42:12 AMDon’t really get what you mean by Sideways chop in your point 3.You know those boring days where bitcoin (and even ethereum) barely moves? Like sometimes not even $100 in either direction? Yeap, they're mostly called sideways chop or \"crab market\" in non-professional trading/investing communities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "September 28, 2023, 02:04:58 AM",
      "body": "Quote from: pooya87 on September 27, 2023, 01:53:08 PMEver since COVID pandemic with its recession, the predictability of the market has significantly diminished because the so called \"cycles\" trend was effectively broken. If you look at the chart, in 2019 we are seeing the repetition of the same 4-year cycle trend but with the pandemic starting it is stopped and then it crashes before it can turn into a full scale rally. Half of 2020 is bear market which is completely against the \"projection\".Long story short, in a normal cycle price should have been half way to 6 digits already. But instead we are still stuck in $20k-$30k levels.This is why I think the rallies will happen somewhat similar to before but the size of them are unpredictable so we can't know whether it is going to get to $200k as you mentioned in OP.Pandemic changed a lot of things globally from health care, politics, economics and Bitcoin market is affected too. I am said that Bitcoin failed to break $100,000 in the last bull run even I admitted that I know Bitcoin bull runs will be smaller with time because it will harder to make big bull runs like previous cycles (before 2020 - 2021 cycle) when its marketcap becomes bigger.QuoteP.S. The first chart is a very interesting way of representing the cycles, thanks for sharing.I like it too and it is a very creative and insightful way to represent Bitcoin cycle.Quote from: bittraffic on September 27, 2023, 03:05:33 PMBut then anyway, once the volume gets too low after halving, there is nowhere else to go but up but I couldn't expect too much as soon as the RSI says it's overbought, thats just it. It may dump a bit and retrace back but it won't exceed far from the ATH.After halving, market will be warmed up and become hotter so trading volume must increase. I fail to understand why you expected lower trading volume after halving, could you explain your thinking please.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}