{
  "id": "topic_5460716",
  "title": "Whut2.0",
  "author": "Whut2.0",
  "created_time": "July 22, 2023, 07:36:57 PMLast edit: July 23, 2023, 04:31:02 AM by Whut2.0",
  "content": "zzz",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460716",
  "comments": [
    {
      "author": "1miau",
      "created_time": "July 22, 2023, 08:59:30 PM",
      "body": "Quote from: Whut2.0 on July 22, 2023, 07:36:57 PMBrauch mal dafür ein gewerbe ? kleingewerbe müsste reichen kostet 15€ sind virtuelle büros legal ? fragen übr fragen   Such dir doch einen Steuerberater, dem kannst du dann auch erklären, was genau du \"beraten\" willst. Von Leuten wie dir würde ich mich nämlich nicht beraten lassen, wenn man bedenkt, dass du damals versucht hast, die Leute hier mit einer absolut schäbigen Abzocke das Geld aus der Tasche ziehen zu wollen. Non Public Bankkonto mit Crypto Debit zu verkaufen suche BTCFür 120€ den Namen eines ominösen Anbieters zu nennen. LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Whut2.0",
      "created_time": "July 22, 2023, 09:03:30 PM",
      "body": "Jetzt kommst du wieder aus deinem internet loch gekrochen mit der alten kamelle. Wieso sollte ich infos umsonst raus hauen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hanspeter77",
      "created_time": "July 22, 2023, 09:21:24 PM",
      "body": "Quote from: Whut2.0 on July 22, 2023, 07:36:57 PMBrauch mal dafür ein gewerbe ? kleingewerbe müsste reichen kostet 15€ sind virtuelle büros legal ? fragen übr fragen   Je nachdem wieviel umsatz du hast must du ein gewerbe anmelden oder wenn dein gewerbe mit dem ziel läuft gewinn zu machen must du auch ein gewerbe anmelden.für den anfang reicht ein kleingewerbe.du must alle rechnungen aufheben und dokumentieren fall das finanzamt eine prüfung haben will.und du solltest falls du auch außerhalb der eu kunden haben möchtest brauchst du eine USt-idNr.mach das so schnell wie mögich wenn du das brauchst weil das braucht seine zeit bis das deine nummer bekommst.und neben bei ich hab dir jetzt auch umsonst geholfen ich denke was du machen möchtest ist schweres gewerbe sehr schwer.heutzutage gibts doch google da wird dir mir allem geholfen und ne richtige beratung da müssen die kunden dir vertrauen ist schwer sowas aufzubauen.ich wünsche dir viel erfolg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Whut2.0",
      "created_time": "July 22, 2023, 09:27:05 PM",
      "body": "Gibt es einen Betrag bis zu dem ich keine Steuern zahlen muss ? Brauch ich wahrscheinlich einen private Krankenversicherung ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 22, 2023, 09:45:27 PM",
      "body": "Quote from: Whut2.0 on July 22, 2023, 09:03:30 PMJetzt kommst du wieder aus deinem internet loch gekrochen mit der alten kamelle. Schreibt derjenige, der mit seinen 90+ Beiträgen aus seinem Loch gekrochen kommt.   Ich glaube dir ja, dass es dir unangenehm ist, wenn deine damalige Abzocke thematisiert wird. Dann solltest du dich aber auch für deine damalige, versuchte Abzocke entschuldigen. Quote from: Whut2.0 on July 22, 2023, 09:03:30 PMWieso sollte ich infos umsonst raus hauen. Du scheinst immer noch nicht kapiert zu haben, dass das ein übelst schäbiges Geschäftsgebaren war. Hast ja 2 negative Bewertungen bekommen.  Vielleicht isses morgen sogar eine mehr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Whut2.0",
      "created_time": "July 22, 2023, 10:18:10 PM",
      "body": "haha  ich hab in meinem ganzen leben noch nie jemanden abgezockt. Im internet werden coachings für 10k verkauft und du heulst rum weil ich einen non public crypto debit anbieter nicht umsonst rausgeben wollte. Ich bin durch mit dir, antworte einfach nicht mehr in meinen Themen und gut ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 22, 2023, 10:26:48 PM",
      "body": "Quote from: Whut2.0 on July 22, 2023, 10:18:10 PMhaha  ich hab in meinem ganzen leben noch nie jemanden abgezockt. Freut mich, zu hören, dass es lediglich bei einem Versuch geblieben ist, die Leute abzuzocken.  Zum Glück keiner drauf hereingefallen. Quote from: Whut2.0 on July 22, 2023, 10:18:10 PMIm internet werden coachings für 10k verkauft und du heulst rum weil ich einen non public crypto debit anbieter nicht umsonst rausgeben wollte. Nicht nur ich \"heule rum\", wie du damals dort gemerkt haben dürftest: https://bitcointalk.org/index.php?topic=5337381.0Nachdem mehrere Forumsnutzer dir aufgezeigt haben, dass dein Geschäftsgebaren eine üble Abzocke ist, hätten wir zumindest gehofft, dass du es einsiehst. Dort hat lassdas den wie ich finde den besten Vergleich angestellt. Ja, natürlich kann man Leute generell abzocken, das ist aber halt einfach asozial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Whut2.0",
      "created_time": "July 22, 2023, 10:38:33 PM",
      "body": "Ich sags dir jetzt zum ersten und letzen mal. Wenn du nicht aufhörst mich als Betrüger darzustellen werde ich Strafanzeige wegen Verleundung erstellen.https://www.gesetze-im-internet.de/stgb/__187.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 22, 2023, 10:47:54 PM",
      "body": "Quote from: Whut2.0 on July 22, 2023, 10:38:33 PMIch sags dir jetzt zum ersten und letzen mal. Wenn du nicht aufhörst mich als Betrüger darzustellen werde ich Strafanzeige wegen Verleundung erstellen.https://www.gesetze-im-internet.de/stgb/__187.html Das habe ich nicht einmal getan, denn wenn du des Lesens mächtig wärst, hättest du gemerkt, dass lediglich von einer schäbigen Abzocke die Rede war und das ist halt 100% zutreffend, denn für den Namen eines Anbieters 120$ zu verlangen ist übelste Abzocke, vor der man nur warnen kann und das haben etliche Forumsmitglieder ja auch getan. Dass du hier so dreist auftrittst und offenbar immer noch nicht verstanden hast, wie asozial dein Geschäftsgebaren war, würde es mich nicht wundern, wenn du morgen noch mehr negative Bewertungen in dein Profil bekommen würdest.  Demnach ist deine Darstellung oben eine Lüge. Wenn hier jemand wen anzeigen könnte, dann bekämst eher du die Anzeige an den Hals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Whut2.0",
      "created_time": "July 22, 2023, 11:13:42 PM",
      "body": "b2t kann jemand auf meine Frage eingehn ? keine zeit für euren kindergarten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 23, 2023, 03:38:57 PM",
      "body": "Oh, eigentlich schade, dass der Originalbeitrag seltsamerweise gelöscht wurde. Nun ja, zum Glück speichert das Forum alle Originalbeiträge ab, so auch diesen hier: https://loyce.club/archive/posts/6258/62588352.htmlLöschen ist aber in diesem Fall sowieso unnötig, da der Originalbeitrag sogar bereits 2x zitiert wurde...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}