{
  "id": "topic_5411875",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "August 31, 2022, 11:38:35 AM",
  "content": "Red Vertical Line is where we currently compared to previous cycles.Source: https://buybitcoinworldwide.com/stats/days-since-high/We have always seen the bottom once it turns to yellow which is about to happen in first week of November i.e. 62 days from today.And once we reach the light orange, price drops almost 45-50% to mark the bottom in.What do you think, if it's going to happen again or Bottom is already in?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411875",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "August 31, 2022, 11:47:43 AM",
      "body": "I am predict the bottom to be $17600 which happened to be last month or so, all I am expecting now is $18000 or above to be the support. Irrespective of looking for the bottom, holding now is a good investment. I am not implying that the price may not still plummet down below $20000 even in November or December, but it would not be more than $18000 if it breaks $20000 support. I think the yellow zone is $17600 just like the $3100 of 2018. This is a complete guess work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "August 31, 2022, 08:56:34 PM",
      "body": "Quote from: Charles-Tim on August 31, 2022, 11:47:43 AMI am predict the bottom to be $17600 which happened to be last month or so, all I am expecting now is $18000 or above to be the support. Irrespective of looking for the bottom, holding now is a good investment. I am not implying that the price may not still plummet down below $20000 even in November or December, but it would not be more than $18000 if it breaks $20000 support. I think the yellow zone is $17600 just like the $3100 of 2018. This is a complete guess work.I wont really be making myself do believe on some assurances when it comes to fixed price specially on the support zone,until we do have that Mt.Gox sell-off then we might be seeing those low numbersthat we've never been anticipate for it to reach on and this is something that we  cant really able to predict on whats ahead but much sure my funds or money is already ready for getting in incase that we go that low but considering this current low then it isnt really that bad to consider on having some positioning specially if 17-18k supportline wont be broken or able to held up strong then its a good indication.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "August 31, 2022, 09:08:50 PM",
      "body": "What if we counted from the original $65K high when the bullish momentum subsided? The answer is 504 days, as opposed to 294 from the November high, otherwise the longest bear market in Bitcoin history. But what if neither of these were correct as the peak of the bull market, neither April nor November 2021, so what about the average in between the two? That'd be 399 days, approximately 1 year and 1 month. As per the 4 year cycle disciples believers, it takes almost exactly 1 year from the peak of the bull market in order to form a bear market low, so that's something to consider here rather than arbitrary numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 01, 2022, 06:46:05 AM",
      "body": "Quote from: dragonvslinux on August 31, 2022, 09:08:50 PMAs per the 4 year cycle disciples believers, it takes almost exactly 1 year from the peak of the bull market in order to form a bear market low, so that's something to consider here rather than arbitrary numbers.Let's look a bit more to that rule:First it took more than a year (November to January).Then it took one year (December to December).Some may say that this time it will take less than a year. Still, November to July feels a bit short, hence either the rule is incorrect, either we are pretty close to a new leg down.I do think that there's a good chance for the 4-year cycle get repeated, but imho this only tells that in the winter the bear market will end and we cannot be that precise about when the market low happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 01, 2022, 07:13:36 AM",
      "body": "Based on this chart analysis we may stay at this 19 -20K region till the end of this year, right? I agree with that because even myself predicted 20K to be the best range to accumulate for next season and that is what actually true in the reality, we may see further dump in the prices for near future but it won't be last that much longer so its better to accumulate now than waiting for the perfect lowest low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "September 01, 2022, 09:33:54 AM",
      "body": "Quote from: dragonvslinux on August 31, 2022, 09:08:50 PMWhat if we counted from the original $65K high when the bullish momentum subsided? The answer is 504 days, as opposed to 294 from the November high, otherwise the longest bear market in Bitcoin history. But what if neither of these were correct as the peak of the bull market, neither April nor November 2021, so what about the average in between the two? That'd be 399 days, approximately 1 year and 1 month. As per the 4 year cycle disciples believers, it takes almost exactly 1 year from the peak of the bull market in order to form a bear market low, so that's something to consider here rather than arbitrary numbers.Yep, there are a to look at as with regards to the actual day since our last all time high. And again, it just shows how unpredictable the market is, many factors to look at and maybe for some this is just a arbitrary numbers and we can also deduce what is the correct one until we crossed the bridge.As for the 4 year cycle, so far it is still holding, so based on it's past historical logs, the next bull run could be in 2024-2025, or right after the bitcoin block halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 01, 2022, 09:43:57 AM",
      "body": "I guess Bitcoins won’t fall below this.I mean yes the patterns are already seen but, this time won’t happen the same.Bitcoins already struggling due to the bear market, so definitely after a point of time the price will increase.If anyone waiting for more low price of Bitcoins and they buy it, then let me tell you my friend that BTC won’t fall more, so if possible buy as many coins as you can for the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbterryboy",
      "created_time": "September 01, 2022, 11:19:31 AM",
      "body": "Quote from: jrrsparkles on September 01, 2022, 07:13:36 AMBased on this chart analysis we may stay at this 19 -20K region till the end of this year, right? I agree with that because even myself predicted 20K to be the best range to accumulate for next season and that is what actually true in the reality, we may see further dump in the prices for near future but it won't be last that much longer so its better to accumulate now than waiting for the perfect lowest low.That is only according to them but I think others have a different analysis than this one and even myself I don't also believe that we can stay on 19 to 20k ranges because I think that was too small. Many people are going to be disappointed if ever btc didn't grow for more upon ending the year.Maybe for you 20k is the best accumulating price because this can stay long and you can always buy at this range by the time money is already available but other lower price range can only come and go however those who are attentive enough or the ones who always motivator the price can be able to purchase it. Waiting for the perfect low isn't possible though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pieppiep",
      "created_time": "September 01, 2022, 12:01:24 PM",
      "body": "Quote from: jrrsparkles on September 01, 2022, 07:13:36 AMBased on this chart analysis we may stay at this 19 -20K region till the end of this year, right? I agree with that because even myself predicted 20K to be the best range to accumulate for next season and that is what actually true in the reality, we may see further dump in the prices for near future but it won't be last that much longer so its better to accumulate now than waiting for the perfect lowest low.Hopefully the price can exceed $ 20k this month and continue to increase until the end of the year. But well, that might just be the dream of many while we don't know how the bitcoin price will move until the end of this year. Actually, we can buy bitcoin when the price is decreasing but we are difficult to get the lowest price and we can only try to buy at a low price. But I agree to stack up before the price starts to move up because it's too late for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "September 01, 2022, 12:05:31 PM",
      "body": "The news about Michael Saylor tax evasion case makes my inner bearish side stronger. The Government is very eager to take down crypto while it’s on the weak state. I believe that we might see lower lows in the upcoming months because there’s still a lot of upcoming negative news for crypto that might be a source for more selling pressure. Ber months usually the start of the bull run for crypto but we can’t still see any sign of it so I believe November is the right assumption to see such movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "September 01, 2022, 01:33:35 PM",
      "body": "Quote from: NeuroticFish on September 01, 2022, 06:46:05 AMQuote from: dragonvslinux on August 31, 2022, 09:08:50 PMAs per the 4 year cycle disciples believers, it takes almost exactly 1 year from the peak of the bull market in order to form a bear market low, so that's something to consider here rather than arbitrary numbers.Let's look a bit more to that rule:First it took more than a year (November to January).Then it took one year (December to December).Some may say that this time it will take less than a year. Still, November to July feels a bit short, hence either the rule is incorrect, either we are pretty close to a new leg down.Fair point, 14 months then 12 months from previous highs. Maybe 10 months would be a more accurate time-frame for the current cycle. Based on current ATH, then that could be this month without too many surprises. I also agree that either the low is in, or that we are very close to breaking this low and forming the bear market low. Ultimately, only time will tell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 01, 2022, 02:37:20 PM",
      "body": "Quote from: tbterryboy on September 01, 2022, 11:19:31 AMQuote from: jrrsparkles on September 01, 2022, 07:13:36 AMBased on this chart analysis we may stay at this 19 -20K region till the end of this year, right? I agree with that because even myself predicted 20K to be the best range to accumulate for next season and that is what actually true in the reality, we may see further dump in the prices for near future but it won't be last that much longer so its better to accumulate now than waiting for the perfect lowest low.That is only according to them but I think others have a different analysis than this one and even myself I don't also believe that we can stay on 19 to 20k ranges because I think that was too small. Many people are going to be disappointed if ever btc didn't grow for more upon ending the year.Maybe for you 20k is the best accumulating price because this can stay long and you can always buy at this range by the time money is already available but other lower price range can only come and go however those who are attentive enough or the ones who always motivator the price can be able to purchase it. Waiting for the perfect low isn't possible though.I am not quite able to understand your point, if bitcoin is going to stay longer in this region then buying at this price is more plausible whereas it may get a dip further but not for too long so you need to keep liquid cash all the time if you're waiting for the perfect low and also you may get confused a lot with FUDs and FOMOs created along with dump and bump on the prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 01, 2022, 04:00:13 PM",
      "body": "You need to understand that price can trade sideways for the next few months and the dots will turn yellow and the bottom can still be in. It doesn't mean the last cycles low will play out.There are too many people out there thinking we will hit a new low, or go to $10K or lower. And this is why I am long term bullish. Many already sold. I don't think there are many sellers out there. The only sellers that will be in the market will be the MtGox coins but who knows when they will be released.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 01, 2022, 05:01:40 PM",
      "body": "This chart more-less shows what I’ve been thinking lately. It feels exactly like the last time we were in this situation. If history repeats again for the 4th time then we’ve got one more big drop in store for us, which will be the dip to buy if you’re looking to time markets and maximize returns for yourself (dangerous game).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 01, 2022, 06:14:44 PM",
      "body": "people will think it's going to repeat history once again, but i don't think it's going down again to hit $10k or below, i think the current price is pretty much lower than the actual ATH price, so not sure that it will go down again, trust me History may repeat itself but remember that charts will never be the same",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inspiron14",
      "created_time": "September 01, 2022, 11:09:53 PM",
      "body": "Quote from: piebeyb on September 01, 2022, 06:14:44 PMpeople will think it's going to repeat history once again, but i don't think it's going down again to hit $10k or below, i think the current price is pretty much lower than the actual ATH price, so not sure that it will go down again, trust me History may repeat itself but remember that charts will never be the samethen what about the history of bitcoin according to a 4 year cycle? every 4 years Bitcoin always increases up to New ATH, of course this also triggers new investors and traders to enter the world of crypto currency!, do you think this 4 year cycle can also not occur? because if it doesn't happen then bitcoin will really die, and keep going down, of course this is terrible think",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 03, 2022, 05:43:18 PM",
      "body": "Quote from: Inspiron14 on September 01, 2022, 11:09:53 PMQuote from: piebeyb on September 01, 2022, 06:14:44 PMpeople will think it's going to repeat history once again, but i don't think it's going down again to hit $10k or below, i think the current price is pretty much lower than the actual ATH price, so not sure that it will go down again, trust me History may repeat itself but remember that charts will never be the samethen what about the history of bitcoin according to a 4 year cycle? every 4 years Bitcoin always increases up to New ATH, of course this also triggers new investors and traders to enter the world of crypto currency!, do you think this 4 year cycle can also not occur? because if it doesn't happen then bitcoin will really die, and keep going down, of course this is terrible thinkthe cycle is still working but not the same as the 4 year cycle as before, bitcoin will hit another ATH any time it could be the end of this year or next year, nothing is impossible for bitcoin to reach another new ATH any time, but we need to completely exit the market bear now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 03, 2022, 11:58:10 PM",
      "body": "My guess could be Bitcoin dropped into a range of $15k to $16k in the month of November and it will resist a little in the last quarter of this year which is what the chart seems right but I don't think it will repeat itself.  I didn't see if there's a bullish trend this year or even next year, it seems the resistance waiting after the next halving comes which the most anticipated that it will repeat after 4 years.However, I didn't think that too much scratching my head about the Bitcoin price, I prefer long-term holding which will surely there's will be a bull trend soon. But still, the Bitcoin price is unpredictable for me which is I've faith that there will be a new ATH soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "September 04, 2022, 02:51:02 AM",
      "body": "Quote from: Beparanf on September 01, 2022, 12:05:31 PMThe news about Michael Saylor tax evasion case makes my inner bearish side stronger. The Government is very eager to take down crypto while it’s on the weak state. I believe that we might see lower lows in the upcoming months because there’s still a lot of upcoming negative news for crypto that might be a source for more selling pressure. Ber months usually the start of the bull run for crypto but we can’t still see any sign of it so I believe November is the right assumption to see such movement.I don't believed though that the news about Michael Saylor will have a drastic effect on the market. Although we are still in the bear market and it can go either way, break the lowest low and then final capitulation of around $10,000. But so far we are resisting further down slide. The market keeps bouncing off to the support of $20,000 that I don't see the price reeling to a new lows this year. It might be that December could be a good time to see some pump right before the holidays. And then we go full bear market again early 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}