{
  "id": "topic_5437056",
  "title": "pomchain",
  "author": "pomchain",
  "created_time": "January 27, 2023, 10:49:12 PM",
  "content": "A very new blockchain has combined the best of both worlds. Like Dogecoin, the supply is higher and the rewards per block are also higher (9 coins). Similar to Ethereum prior to the move to POS, the coin can be mined with GPUS or high end ASIC models designated for ETH consensus mining. POM AKA POMCHAIN is a fun environment for new crypto enthusiasts and a way to submerge yourself in defi. The team is even developing on top of Twitter APIS to allow people to mint their memes as NFTS and sell them for a value based on the social volume those memes attract. If you want to learn more you can go to proofofmemes.org or just search for Proof Of Memes on Google  Hope to see you all in the bull run!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437056",
  "comments": [
    {
      "author": "PhatSteak",
      "created_time": "January 27, 2023, 11:01:13 PM",
      "body": "Dope. Heard y’all just launched a bridge today too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pomdog",
      "created_time": "January 27, 2023, 11:01:29 PM",
      "body": "The low gas fees are nice for project devs and users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr-Kek",
      "created_time": "January 27, 2023, 11:02:49 PM",
      "body": "Ohhhhhh yes I’ve heard they are new blockchain Layer 1? Cheaper fees trading ? Since its just new, I see massive potential I will look into that for more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phatkow",
      "created_time": "January 27, 2023, 11:06:02 PM",
      "body": "Proof of Memes is the OG, and the catalyst for the bullrun. We started the “2.0” trend, we started the “Proof of” trend, we started the layer one trend… success is inevitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Superbligh",
      "created_time": "January 27, 2023, 11:07:23 PM",
      "body": "Proof of Memes is definitely the best and (I think) most promising project I've gotten involved with. The developers push out features at an incredible rate. Today the bridge went live, meaning you can now buy on ETH or BNB chains and just send it over the the POM network. Also, buy a BridgeKeeper NFT and you can get a share of the bridging fees, for life! (Be quick though, there are only a handful left). Exciting times!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SancordBTC",
      "created_time": "January 27, 2023, 11:08:19 PM",
      "body": "Proof of Memes - POM is a new L1 Blockchain which is Proof of Work and can be mined. It's the best of the both worlds with low fees on transactions and with miners support for decentralised network transactions. The have a swap - dex , bridge from ETH and BSC networks to move investors across different networks, they currently have 150+ projects developed on their chain and it's growing rapidly. The blockchain has NFT's for lauchpad projects which gives direct access to any presale for NFT owners and also have bridge keeper NFT's which pay fees from bridge to the NFT holders. It has the best utilities for a L1 chain and the dev team are all hard working with good pipeline for future developments. The marketing for the chain is going to start shortly , so get POM now using Mexc or Bitmart if you like to use exchanges or use ETH-uniswap or BSC-pancakeswap and bridge to POM network. Join us in the TG group and find out about this latest L1 on the blocks. https://t.me/proofofmemes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Laptopcop",
      "created_time": "January 27, 2023, 11:09:05 PM",
      "body": "Cheapest place to play, have fun and become a Pom millionaire!!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whaletalk",
      "created_time": "January 27, 2023, 11:12:01 PM",
      "body": "Real bullish on POM. So many aspects like mining, staking, education, collaboration, huge community, awesome team, etc. Going to be a force to be reckoned with come bull run. My exchange buddy said they have some cool stuff planned as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yochalant",
      "created_time": "January 27, 2023, 11:14:33 PM",
      "body": "A meme oriented L1 blockchain will do incredibly well in the next bullrun… load up!!!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sridharpoli",
      "created_time": "January 27, 2023, 11:17:22 PM",
      "body": "This is what crypto investors are looking at..A very unique layer 1 blockchain with already built in ecosystem and utilities.The team is just awesome behind it..Its going to be different, its going to be fun, it's going to be safe, it's going to MARS..just read the whitepaper and you will understand how unique, exciting and fun this project. Get in early...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitspill",
      "created_time": "January 28, 2023, 12:47:56 AM",
      "body": "lmao every single one registered within 15 minutes of posting, absolutely no information provided, just another waste of time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypto-meow",
      "created_time": "January 28, 2023, 02:31:45 AM",
      "body": "Quote from: bitspill on January 28, 2023, 12:47:56 AMlmao every single one registered within 15 minutes of posting, absolutely no information provided, just another waste of timeHi Probably not a waste of time but a network to keep an eye on  I am myself a small mining enthusiast and mostly looking after PoW networks, not being fan at all of PoS virtual networks.This Proof of Memes one got my attention for the Defi and social aspects that seem to drive the project.About the info I'm not 100% sure so don't take it as truth but just an order of magnitude, someone will maybe tell.From what I remember 1B was pre-mined (but a lot was burnt, ~350m burnt in total)~500m of the pre-mined was distributed as airdrop to people that participated in public sales of an eth2.0 token.the rest remaining is treasury for devs, marketing etc.the only emission now is via mining. Price has probably hit its floor already and surely only profitable with ethash ASICs but could turn profitable with GPUs in the near future.I like fair launches like BTC, Ergo, Kaspa... some may argue about treasury sizes or even early mining like Satoshi did etc.Just to say the team looks very capable, transparent and involved into turning sources of revenue to be shared by its community public investors giving everyone the same opportunity and financing itself at the same time (ex ETH/BSC bridge 1% fees are 100% shared by NFT holders).... so following this community I'd say the (KYC) team behind has gained my trust. The development is rapid and efficient, there seem to have some very good devs, and projects develop quickly... I am very surprised how fast things grow on this chain.There has been a massive ddos attack on the network rpcs and team handled it, enforced the network infrastructure etc. To be honest many weak teams woulda given up in the blink of an eye facing such starting difficulties, but dev team just keeps delivering and is here to stay undoubtedly.A last word about it, that's a different way of working than BTC or Kaspa \"no treasury\" spirit but miles away from ETH one on the other side... I have far more confidence in this team that plays for its community rather than Vitalik, his tokenomics manipulation, locked eth2.0 staking, merge drama etc.That was just my 2 cent to share about this community and hope it would invite some to throw an eye and judge by themselves Have a good day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "January 28, 2023, 02:55:09 PM",
      "body": "Wow, I'm very happy to learn new mechanisms in the crypto space, but here you don't provide information regarding what PoM is as a whole. Besides, I see that there are many shillers on this topic, believe me, mate. If your project is a good project, people will see for themselves, no need to do something stupid as doing shillings. I'll try to review this PoM project as best I can, and maybe I'll also ask some questions related to the project. See you later, mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "January 28, 2023, 03:00:50 PM",
      "body": "Quote from: pomchain on January 27, 2023, 10:49:12 PMA very new blockchain has combined the best of both worlds. Like Dogecoin, the supply is higher and the rewards per block are also higher (9 coins). Similar to Ethereum prior to the move to POS, the coin can be mined with GPUS or high end ASIC models designated for ETH consensus mining. POM AKA POMCHAIN is a fun environment for new crypto enthusiasts and a way to submerge yourself in defi. The team is even developing on top of Twitter APIS to allow people to mint their memes as NFTS and sell them for a value based on the social volume those memes attract. If you want to learn more you can go to proofofmemes.org or just search for Proof Of Memes on Google  Hope to see you all in the bull run!Dude if you want to shill your own project, than at least do it in a way that is not so obvious and annoying. Everyone that is older than 8 years and that has an IQ that is higher than 70 istantly knows that all those 12 accounts that are praising your project are created by yourself. I mean you could have at least took the effort to reister a few of those accounts a few weeks ago and \"level them up\" so they are at least no newbie accounts anymore, so it would not have been that obvious.To the project itself, i don't really think that a higher supply and higher rewards per block are something positive. In the end a higher supply just means that every coin is worth less, if the marketcap is identical. It doesn't matter if you have 1000 coins or 1 if both are worth the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}