{
  "id": "topic_5463964",
  "title": "chaindeckxyz",
  "author": "chaindeckxyz",
  "created_time": "August 20, 2023, 08:06:32 PM",
  "content": "Hello Bitcointalk community! We are Chaindeck, a small startup founded in 2021 with the goal to improve seed-phrase storage security. Just like Bitcoin, we wanted a product that would be accessible to all. Also, no electronics, no software, nothing hackable… It should be relatively simple for the owner to set up but require significant time and effort for others to access the information. We are proud to launch our product today that strikes a balance between security and convenience: a meticulously crafted deck of cards that hides your seed phrase in plain sight. Chaindeck is a deck of 100 square cards that have been carefully designed so that any 3-digit PIN leads to an arrangement of the cards in a unique but seemingly random way. The Chaindeck instructions walk you through how to use your PIN to order, flip, and rotate each card. You’re then ready to write your seed phrase on the sides of the deck. Shuffling the cards makes the text illegible, encrypting your seed phrase. Simply re-organize the deck using your PIN to retrieve your seed phrase.   https://i.ibb.co/61dnVyx/secret-phrase-goes-here.jpghttps://i.ibb.co/BjNXDJd/shuffled-deck.jpgSecurely storing seed phrases is not an intuitive problem for most people and Bitcoin self-custody significantly increases the stakes in the event that something goes wrong. This space is one of the first and most active Bitcoin communities that is still true to the core principles of Bitcoin, so we are excited to announce our launch here first. We are looking forward to your feedback to make Chaindeck and self-custody better for everyone!Find out more: www.chaindeck.xyzhttps://i.ibb.co/JvY8rN3/box-contents.jpg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463964",
  "comments": [
    {
      "author": "BIT-BENDER",
      "created_time": "August 20, 2023, 08:28:15 PM",
      "body": "Firstly is this an advert or a recommendation I think it belongs to the service board https://bitcointalk.org/index.php?board=52.0 . I don't know how your chaindeck work but I don't think I trust a Total stranger who developed something and expect me to work with it in storing my seed phrase, I don't think it's advisable, but this is not to discredit you but it's not wise. Even when setting up your wallet you are advice to keep it secretly and not to even screenshot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaindeckxyz",
      "created_time": "August 20, 2023, 08:34:39 PM",
      "body": "Quote from: BIT-BENDER on August 20, 2023, 08:28:15 PMFirstly is this an advert or a recommendation I think it belongs to the service board https://bitcointalk.org/index.php?board=52.0 . Thanks for pointing this out, we can post there if it is more appropriate.Quote from: BIT-BENDER on August 20, 2023, 08:28:15 PMI don't know how your chaindeck work but I don't think I trust a Total stranger who developed something and expect me to work with it in storing my seed phrase, I don't think it's advisable, but this is not to discredit you but it's not wise. Even when setting up your wallet you are advice to keep it secretly and not to even screenshot.Chaindeck is entirely made out of paper so you don't need to trust us to use it, it's a deck of square cards with random numbers printed on the faces. It is similar to the metal storage devices, but it is also very different in the sense that having possession of the item does not immediately reveal the seed phrase (you'd have to either guess PIN's or try to solve it like a type of jigsaw puzzle).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hopenotlate",
      "created_time": "August 20, 2023, 09:02:56 PM",
      "body": "Quote from: chaindeckxyz on August 20, 2023, 08:06:32 PMHello Bitcointalk community! We are Chaindeck, a small startup founded in 2021 with the goal to improve seed-phrase storage security. Just like Bitcoin, we wanted a product that would be accessible to all. Also, no electronics, no software, nothing hackable… It should be relatively simple for the owner to set up but require significant time and effort for others to access the information. We are proud to launch our product today that strikes a balance between security and convenience: a meticulously crafted deck of cards that hides your seed phrase in plain sight. Chaindeck is a deck of 100 square cards that have been carefully designed so that any 3-digit PIN leads to an arrangement of the cards in a unique but seemingly random way. The Chaindeck instructions walk you through how to use your PIN to order, flip, and rotate each card. You’re then ready to write your seed phrase on the sides of the deck. Shuffling the cards makes the text illegible, encrypting your seed phrase. Simply re-organize the deck using your PIN to retrieve your seed phrase.   Securely storing seed phrases is not an intuitive problem for most people and Bitcoin self-custody significantly increases the stakes in the event that something goes wrong. This space is one of the first and most active Bitcoin communities that is still true to the core principles of Bitcoin, so we are excited to announce our launch here first. We are looking forward to your feedback to make Chaindeck and self-custody better for everyone!Find out more: www.chaindeck.xyzQuoted your post to make pictures visible (you might want to buy a copper membership to gain the ability to post pictures - another way is ranking up).  Also be aware that on bottom left of this page you can move this thread in proper section as suggested by BIT-BENDER.Congrats for this innovative idea, still not sure if it brings more security in generating and storing  seed phrases or of it carries with itself some risk in the intrinsic methodology ( waiting for opinions from tech savvy users); if you wanna gain better exposure for your project consider taking advantage of the service offered by campaign managers on this forum (yahoo62278, icopress,Hampuz are just some of them).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}