{
  "id": "topic_5467500",
  "title": "Alana Arden",
  "author": "Alana Arden",
  "created_time": "September 20, 2023, 07:43:06 PM",
  "content": "Ever since I joined the forum community I have wasted no time learning about Bitcoin. I'm trying my best to learn something from every post and I've gained a bit more knowledge about Bitcoin than before. Although Bitcoin is a vast area that is not easy to learn about, the more we learn, the more knowledge we gain.     The most surprising thing I learned was that I was both really surprised and happy to know the past, present and future market value of Bitcoin.When Satoshi Nakamoto launched this virtual currency (Bitcoin) in 2009, the market value of Bitcoin was zero. But in July 2010 itself1BTC = $0.09then    1BTC=$68.790 in November 2021Which is slowly rising and is currently there    1 BTC = $27,194.58(I am new, if there is any mistake in writing please correct it)    The price has doubled. This means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467500",
  "comments": [
    {
      "author": "Ever-young",
      "created_time": "September 20, 2023, 08:14:36 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PM    1BTC=$68.790 in November 2021I guess you mean $68,790 and not $68.790 as one look like hundred and the other as thousand. It’s actually good that you have make out time to learn about bitcoin which I believe will be very beneficial to you, and I also don’t see bitcoin learning process as something that’s difficult, if we are talking about what you have studied about bitcoin it seems like it’s just about price history and nothing more. If that’s true I will advice you learn more things about bitcoin’s especially about wallet, security, privacy, and other things which could really help you enjoy your bitcoin journey, and also you can learn the best accumulating strategy which is the DCA, as it will help you buy and grabs as much bitcoin as you can afford without even realizing you have purchased such number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "September 20, 2023, 08:39:02 PM",
      "body": "I do not think that BTC price will go up. So investing in BTC, can be popular, but not profitable project.Look here https://www.investopedia.com/articles/forex/121815/bitcoins-price-history.asp. Bitcoin price is stable now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 20, 2023, 08:44:43 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PM    The price has doubled. This means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.Don't get me wrong. But  don't expect bitcoin value do make 1000% every few years or so again. It may happen, but you are late for the party dude.Bitcoin gains were amazing in the past 10 years. The upward potential is not the same as before.Just be careful and don't keep expectations so high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "September 20, 2023, 09:14:22 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PMThis means investing with Bitcoin will never count as a loss project.We can say that as many as we can. But usually when it's about the losses, you'll see people selling at loss because they can no longer wait for the time that it should recover.We know that if you're long term to Bitcoin, you'll never lose because that's how it is designed. The difference of our acceptance in our losses varies and even you say that but, when you are not that patient anymore and you call it a day and just wanna take the losses. Then, that's the loss from investing on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 20, 2023, 09:29:50 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PMWhen Satoshi Nakamoto launched this virtual currency (Bitcoin) in 2009, the market value of Bitcoin was zero. But in July 2010 itself1BTC = $0.09Bitcoin market value can not be zero as it was not even zero from the start, at least it will start with a price. According to what I read, the market value of bitcoin started with $0.03 when it was created in 2009.Quote from: Alana Arden on September 20, 2023, 07:43:06 PMThe price has doubled. This means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.That is just it and you are not doing anything wrong if you are holding bitcoin, all-time-high will be seen again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "September 20, 2023, 10:08:27 PM",
      "body": "Quote from: Joeyp on September 20, 2023, 08:39:02 PMI do not think that BTC price will go up. So investing in BTC, can be popular, but not profitable project.Look here https://www.investopedia.com/articles/forex/121815/bitcoins-price-history.asp. Bitcoin price is stable now.If you look at the Bitcoin market in the short term of a day or a week, the Bitcoin market may look idle but if you look at it in a zoom-out mode, you can see that Bitcoin is moving in a highly volatile phase since it goes up and down and sideways before getting into a bull market and eventually break its ATH record every cycle in four year time.Quote from: _act_ on September 20, 2023, 09:29:50 PMQuote from: Alana Arden on September 20, 2023, 07:43:06 PMWhen Satoshi Nakamoto launched this virtual currency (Bitcoin) in 2009, the market value of Bitcoin was zero. But in July 2010 itself1BTC = $0.09Bitcoin market value can not be zero as it was not even zero from the start, at least it will start with a price. According to what I read, the market value of bitcoin started with $0.03 when it was created in 2009.Bitcoin was worthless when it was created, it is after Bitcoin entered the market that it got its price.  It has no demand during its first days so how could it have a price back then when it was just created?  Kindly enlighten me if I am wrong about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "September 20, 2023, 10:13:08 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PMEver since I joined the forum community I have wasted no time learning about Bitcoin. I'm trying my best to learn something from every post and I've gained a bit more knowledge about Bitcoin than before. Although Bitcoin is a vast area that is not easy to learn about, the more we learn, the more knowledge we gain.     The most surprising thing I learned was that I was both really surprised and happy to know the past, present and future market value of Bitcoin.I checked your registered date you're just about 4 days in the forum and I think you shouldn't be too excited about the little you have uncovered there's still much grounds for you to covered although it s all in a gradual process and if your main purpose to the forum was to learn then your knowledge about bitcoin will definitely expend as you voyage through the informative contents in all boards concerning bitcoin.Avoid repetitive posting and what I mean by repetitive posting is making query posts that have already been made, to avoid doing so always make use of the search button at the right top corner to be certain if the topic hasn't been raised.You will be needing this informations too as a guide moving forward:Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQFAQ: Everything you need to know about forum 'activity, account ranks and meritForum account: security, privacy, and recovery",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "September 20, 2023, 10:55:28 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PMthe market value of Bitcoin was zero. But in July 2010 itself1BTC = $0.09Bitcoin did not start with a market price of zero. According to the Wikipedia, from Jan 2009 to March 2010, there were no exchanges where it was being traded, so the price was basically set by users who transacts with it. It was reported that someone bought 5050 BTC for $5.02, so that should be 0.00099 per dollar.Quote from: Alana Arden on September 20, 2023, 07:43:06 PMThis means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.You can still invest in Bitcoin and suffer loss, I've seen that happened before with some persons. Thus, it's very pertinent that you've a good knowledge of the market, know when to buy and when to sell. I also want to reiterate that Bitcoin is not a get rich quick money scheme, you need to be patient with your Bitcoin investment, hodling is golden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "September 20, 2023, 11:55:47 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PM This means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.No it doesn't. Past performance is not a guarantee of future performance. You need to answer what was driving the price growth in the past and would the same force be present in the future? Spoiler: no, because Bitcoin experienced this explosive growth due to being new and unknown to most people in the world. This phase is over, many people who wanted to invest have already invested, and those that didn't won't change their mind easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "September 21, 2023, 01:52:16 AM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PM~    The price has doubled. This means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.Also, I would like to say that \"Past performances doesn't mean it will be the same in the future.\"Yes we've seen the price of Bitcoin went up to nearly $70,000 from a dollar in a short span of time (12 years), but that doesn't mean that it will happen in the future. Though I believe that it will happen, there's still something in my mind saying that \"With the unpredictability of crypto, there might be a chance that the price of Bitcoin might not reach 6 digits.\" What I'm trying to say is that, don't focus on one side, but at least think of the other side as well.Keep your expectations at it's lowest so you will not feel disappointed in yourself. You're a newbie base on what you posted, and looking at the prices alone will give you a positive feeling. I know that because that's what I felt as well when I was a newbie, but over time, I learned how to lower my expectations because it's not a smooth sailing ride. Bitcoin might be a profitable investment for those who are holding it for long term, but for short-to mid term holders, there's a chance that it doesn't. It all depends on when you will sell it. Be patient. 2 words that's very easy to say, but it's hard to do because of the fact that emotions are getting us all the time. Being patient means being emotionless as well.  Good luck to you OP, and don't stop learning. That's what makes those famous businessmen rich right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 21, 2023, 02:14:34 AM",
      "body": "It's much easier for $0.001 to double than $20,000. In the past, Bitcoin easily doubled, tripled, and more in just a matter of hours, days, and weeks. Will that happen again? Possibly, but most probably not. Bitcoin could have easily been \"the most profitable project of life\" in the past, but might not be so today and in the future. So, it's probably wise not to use the past as reference when speaking of Bitcoin as a profitable investment. Things are a world different now. Basic mathematical common sense dictates that Bitcoin's $27,051.58 price as of this moment cannot just turn into $60,000 24 hours from now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "September 21, 2023, 10:12:07 AM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PMEver since I joined the forum community I have wasted no time learning about Bitcoin. I'm trying my best to learn something from every post and I've gained a bit more knowledge about Bitcoin than before. Although Bitcoin is a vast area that is not easy to learn about, the more we learn, the more knowledge we gain.     The most surprising thing I learned was that I was both really surprised and happy to know the past, present and future market value of Bitcoin.When Satoshi Nakamoto launched this virtual currency (Bitcoin) in 2009, the market value of Bitcoin was zero. But in July 2010 itself1BTC = $0.09then    1BTC=$68.790 in November 2021Which is slowly rising and is currently there    1 BTC = $27,194.58(I am new, if there is any mistake in writing please correct it)    The price has doubled. This means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.Don't get hype by numbers but rather you need to watch the challenges before the price reach that since if you only consider the positive aspects. You might  struggle to deal with it on challenging times so better deal with different situation since experience can make you a better trader, always consider the risk on every occasion to know on when you could possibly gain. Learning every day about crypto is really good especially for those people who's new on cryptocurrency ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "September 21, 2023, 11:05:02 AM",
      "body": "Quote from: hatshepsut93 on September 20, 2023, 11:55:47 PMQuote from: Alana Arden on September 20, 2023, 07:43:06 PM This means investing with Bitcoin will never count as a loss project. Bitcoin is our future profitable investment.And patiently we should spend more time behind Bitcoin.No it doesn't. Past performance is not a guarantee of future performance. You need to answer what was driving the price growth in the past and would the same force be present in the future? Spoiler: no, because Bitcoin experienced this explosive growth due to being new and unknown to most people in the world. This phase is over, many people who wanted to invest have already invested, and those that didn't won't change their mind easily.I know their are things in the past that contributed to the growth of bitcoin price, maybe those things are not having much effect to the price of bitcoin presently but one thing I truly know about Bitcoin is that the price is always unpredictable. The price of bitcoin is not showing much volatility in the increase of price and this doesn't mean that bitcoin price will remain in this nature , never can tell where bitcoin is going to. Before now their was a time bitcoin price was kind of stunted, no good growth, no one ever thought the price will get to this point. The price of bitcoin today will be definitely better than that in the future with better value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "September 21, 2023, 11:36:50 AM",
      "body": "Quote from: Alana Arden on September 21, 2023, 12:26:37 AMI have been observing the forum community for quite some time although I was a guest then. After reading Beginners encyclopedia some parts I feel that I can learn and know a lot about Bitcoin just by being in this community. Then I joined the community as a registered member.This forum has helped so many people out with any of their bitcoin-related issues, and most questions related to bitcoin wallets, exchanges, and others are settled when asked here; therefore, there is no doubt you will learn so many things about bitcoin and cryptocurrency in general here in this forum.Moreover, you can also be doing further research on what you want to know somewhere else and comparing the results with the responses you get from the forum members, but I am assuring you that, compared to any other online investment, foreign investment, or cryptocurrency investment, bitcoin investment is the perfect and less risky investment if you can invest the amount you can afford to lose and give it time to grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "September 21, 2023, 12:12:11 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PMEver since I joined the forum community I have wasted no time learning about Bitcoin. I'm trying my best to learn something from every post and I've gained a bit more knowledge about Bitcoin than before. Although Bitcoin is a vast area that is not easy to learn about, the more we learn, the more knowledge we gain.     The most surprising thing I learned was that I was both really surprised and happy to know the past, present and future market value of Bitcoin.First of all, let me congratulate you on joining this great community forum. You are at the right place, and definitely you will learn a lot in this forum as you have decided to learn about bitcoin and cryptocurrency in general. However, don’t hesitate to ask questions about anything you don’t know; it will help you grow faster here.But you shouldn’t only rely on the positive aspects of bitcoin; you also need to study the other side of bitcoin so that you can deal with any situation that you come across in your journey. If you do that, I can assure you that you will definitely enjoy your bitcoin journey since you will be able to cope with any situation in the market. Since the increase in the bitcoin price may encourage you to invest more, you should not be convinced by these figures to invest the amount you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "September 21, 2023, 01:30:36 PM",
      "body": "Quote from: Alana Arden on September 20, 2023, 07:43:06 PM     The most surprising thing I learned was that I was both really surprised and happy to know the past, present, and future market value of Bitcoin. Use this link to get access to some Bitcoin-related books https://bitcointalk.org/index.php?topic=5350541.0When Satoshi Nakamoto launched this virtual currency (Bitcoin) in 2009, the market value of Bitcoin was zero. But in July 2010 itself1BTC = $0.09then    1BTC=$68.790 in November 2021Which is slowly rising and is currently there    1 BTC = $27,194.58(I am new, if there is any mistake in writing please correct it)Don't be so excited about the past, present, or future price of Bitcoin. I can see you are most interested in the investment aspect part of Bitcoin, but I want to let you know Bitcoin is not a bed of roses or a get-rich-quick scheme. Bitcoin requires holding for a long time before you will see a good profit. You have to understand Bitcoin very well so when you start investing in Bitcoin you will not be dismayed when you see the volatility part of Bitcoin and sell your Bitcoin at a loss because that was not what you expected.Use this link to get access to Bitcoin-related bookshttps://bitcointalk.org/index.php?topic=5350541.0QuoteThe price has doubled. This means invg with will never count as a loss project. I agree with you, people will never lose their money by investing in Bitcoin it just requires patience in holding it for a long time, and surely the profit will come",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 21, 2023, 02:12:38 PM",
      "body": "If you think you will earn as big as July 2010 to November 2021 by holding Bitcoin for a decade, you're wrong. Bitcoin price could be doubled or tripled, but if you only invest small amount of money like $200, you're only earn $200-$400 after 2-3 years, I don't think it's big if you're really looking to increase your wealth.Investing in Bitcoin is good when you have money and don't know what you need to use that money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pingrapole",
      "created_time": "September 21, 2023, 02:32:25 PM",
      "body": "I do not know if Bitcoin will be a profitable project for your life, but it will not do anything to disappoint you.I have written earlier that to get something here you have to be patient not for few days but for long time and try to figure out what the loss will be and wait a patiently.Bitcoin price will not skyrocket, but I am sure it will rule the market, and it will be used everywhere.*It will at least keep you going before the price doubles or not*You are 100% sure that you will not suffer loss or profit amount may be less*You stick with bitcoin and work hard and learn more and wait and also know the amount of loss though hopefully not amount of loss.You have to accept the bottom line, be it loss or gain, then you will not fail It may help you to make it profitable project for your life, and it may not but as far as I know all those who have stuck with it has seen the amount of gain but also the amount of loss But that depends on the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 21, 2023, 02:33:35 PM",
      "body": "So, you say this:Quote from: Alana Arden on September 20, 2023, 07:43:06 PMAlthough Bitcoin is a vast area that is not easy to learn about, the more we learn, the more knowledge we gain.But then you focus only on the price or fiat countervalue of Bitcoin. Wrong. Inform yourself why it was created, what problem it solved and what its nature and intrinsic characteristics are. That it goes up in price is all well and good and we all hope it continues to do so but if it goes up it is for some reason that has to do with what Bitcoin is, a scarce commodity, limited and finite in supply, decentralized, autonomous, and extremely difficult to seize and censor. Quote from: Joeyp on September 20, 2023, 08:39:02 PMI do not think that BTC price will go up. So investing in BTC, can be popular, but not profitable project.Look here https://www.investopedia.com/articles/forex/121815/bitcoins-price-history.asp. Bitcoin price is stable now.The link you post does not support what you say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}