{
  "id": "topic_5436435",
  "title": "digaran",
  "author": "digaran",
  "created_time": "January 23, 2023, 07:41:57 AMLast edit: January 23, 2023, 11:09:15 PM by digaran",
  "content": "I'm not siding with franky1, I actually had my disagreements with him in the past, however I find half of his posts constructive and the other half is too long to read every word, so I just read them half through, though I know sometimes he can be annoying but banning him from a board and even posting a topic stating such ban seems more like a political discrimination and a blatant unjustified use of moderation power, what this forum is set to be IMO, is a place for everyone to freely discuss and express their opinions without fearing of bans(if they don't violate the rules), having someone banned from a sub-forum just because 2 moderators deem his posts as misinformation/ trolling seems a bit personal than of a substantially proven facts pointing to the spreading of misinformation essence.Since I'm not a technical nerd, I really can't say if mods are right on this, however I'd find it more appealing if there was actually some references of such misinformation and the corrected information (reasonably proven by facts, evidence and scientific merits to it) attached to it, that way anyone going to that sub forum seeing the evidence  would be convinced and would avoid further interactions with such person in the future.Doing it as gmaxwell has done it is more of a retaliatory nature. Simply stick a topic on top with the evidence posted would be enough to clear any misunderstanding.This way people would see that forum's governing body as a whole is not a centralized forum existing only to support a certain group of people/political agenda and application.It should be up to the readers to decide, forcing them to decide what they can read and not read is censorship in a not very smart way.A wise man once said: Quote from @Jet Cash.Quotesanctions and censorship - it creates an increased awareness of the issues that you are trying to suppress.While franky1 is extremely against the route taken by core developers and dispises their affairs of developing certain applications, people on a universal scale of doing their usual businesses don't give a fuck about such matters which franky1 is so concerned about, but people care and can notice censorship and discrimination.     _______________________________________________Edit : I guess I did my job delivering my concerns, rest is up to the administration, will lock this topic in 2 days, so if anyone has something new to say, you are welcome.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436435",
  "comments": [
    {
      "author": "_act_",
      "created_time": "January 23, 2023, 07:57:00 AM",
      "body": "It started from this thread: Ban request for user: franky1You can read the whole thread to understand. If franky1 do want the ban to be lifted, he should appeal about it. Although I see him as a person that do not support what most people are posting, example is how he sees bitcoin lighting network not to be bitcoin, but he is one of the best poster on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "January 23, 2023, 08:29:36 AM",
      "body": "Quote from: _act_ on January 23, 2023, 07:57:00 AM If franky1 do want the ban to be lifted, he should appeal about it.Actually he gave 100 merits to that thread leading to his ban. Not sure what is on his mind. Is he trying to troll with the mods who banned him?Quote from: _act_ on January 23, 2023, 07:57:00 AMbut he is one of the best poster on this forum.His each and every post is like a \"big wall of text\" on my screen. I dont even dare to try reading those all and most of the time cant understand his point. Maybe, you got a different view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "January 23, 2023, 08:46:34 AM",
      "body": "Forum rules should be enforced universally and not locally.Theymos posted this, Can't quote it because topic is locked. administrator's reactionDon't get me wrong, I'm all against fake news/ misinformation, but I do also like transparency, I'm not saying he was banned from that sub forum without a reason, I'm saying there should be convincing evidence presented in that topic, but it's just 2 posts from 2 moderators, imagine I'm just a newbie, or someone with no account without any prior knowledge of the subject, first thing coming in my mind after seeing that locked topic is obvious discrimination and censorship, and by who? The one person we should trust the most aka gmaxwell, I'm saying this doesn't look good for him and the forum, having the substantiated evidence on the same topic is enough to clear the doubts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "January 23, 2023, 09:54:55 AM",
      "body": "Quote from: digaran on January 23, 2023, 07:41:57 AMbanning him from a board and even posting a topic stating such ban seems more like a political discrimination and a blatant unjustified use of moderation powerThe tech boards aren't political.Read your own link:Quote from: gmaxwell in 2019After years of continual harassment and misinformation from franky1 and repeated efforts to reach out and encourage polite and honest behaviour from him that have resulted in no improvements, franky1 is banned from the technical subforum.Quote from: digaran on January 23, 2023, 07:41:57 AMSimply stick a topic on top with the evidence posted would be enough to clear any misunderstanding.After doing that hundreds of times, it becomes pointless. New users may believe franky1, so letting it go unanswered doesn't work either. Banning him from Bitcointalk isn't warranted, so this is a good compromise.Quote from: _act_ on January 23, 2023, 07:57:00 AMIt started from this thread: Ban request for user: franky1Nope, it started years before that (long before BlackHatCoiner joined Bitcointalk).Quote from: digaran on January 23, 2023, 07:41:57 AMI just read them half throughSo you're saying you don't want to read all his posts, but you want him to post more? I dare you: read everything he posted in [self-moderated] Is LN Bitcoin? franky1: About scaling, on-chain and off-chain. Good luck!Quote from: digaran on January 23, 2023, 08:46:34 AMForum rules should be enforced universally and not locally.What forum rules? There are barely any forum rules. And there's this:Quote from: theymos in 2021Almost all rules are subject to mod discretion.Quote from: digaran on January 23, 2023, 08:46:34 AMDon't get me wrong, I'm all against fake news/ misinformation, but I do also like transparency, I'm not saying he was banned from that sub forum without a reason, I'm saying there should be convincing evidence presented in that topicThere is no transparency on bans. It's more of a FYI, so users can just report his violating posts without having to read through it (again).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 23, 2023, 10:00:30 AM",
      "body": "The problem with gatekeepers of \"truth\" is that you're trusting someone to know the truth in an absolute manner and trusting that they won't use that power of censorship for any reason other than preventing people from writing words that the gatekeeper deems wrong....and I fucking hate that whole setup.  I think most of us know Youtube and Facebook were performing the role of gatekeeper of COVID information, and they were taking orders from the US government. Ugh.Bottom line: Misinformation should be allowed.  The solution is debate with facts presented, not some big daddy figure protecting you from posts that might give you the wrong idea--assuming it is the wrong idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "January 23, 2023, 10:12:03 AM",
      "body": "Quote from: The Sceptical Chymist on January 23, 2023, 10:00:30 AMMisinformation should be allowed.  The solution is debate with facts presentedAt what point does misinformation become spam? Franky1 made 25 thousand posts. You can't keep presenting the same facts over and over again, just because he keeps creating the same BS posts over and over again all over the forum!QuoteThe solution is debate with facts presentedI guess you haven't read much of his posts. I dare you to try to talk some sense into him",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "January 23, 2023, 11:15:50 AM",
      "body": "Quote from: digaran on January 23, 2023, 07:41:57 AMSince I'm not a technical nerd, I really can't say if mods are right on this, however I'd find it more appealing if there was actually some references of such misinformation and the corrected information (reasonably proven by facts, evidence and scientific merits to it) attached to it, that way anyone going to that sub forum seeing the evidence  would be convinced and would avoid further interactions with such person in the future.You can read a more detailed explanation by achow101 in this thread: https://bitcointalk.org/index.php?topic=5193489.msg52782685#msg52782685I like reading Franky1's posts (some of them) even though I don't always agree with his opinion, but that doesn't mean that his posts belong in the  Dev & Tech board. I like to think of myself as a technical nerd, therefore my view is that every technical board should be more factual and less about opinions and personal views. Don't get me wrong, I'm all for free speech and all that, but as LoyceV elegantly put it, when does it cross the line into spam? It's important to note that Franky1 still has the freedom to post in all other forum boards, so there is absolutely no question of censorship or political agenda at play here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "January 23, 2023, 01:32:18 PM",
      "body": "I know all the things you guys saying, I actually dislike his method of diving deep on details about LN and essentially everything core developers do, mostly he repeats the same detailed arguments over and over and he doesn't realize that if bitcoin becomes centralized due to the efforts of core developers, people would simply stop using bitcoin and look for alternatives, this alone seems to have no way to get into his head, so he does what he is either trained to do or just does it out of his own political aspirations.I have read his posts for years, only the bitcoin related ones, I haven't followed him to other sections to see what he is on to. So when I say I read his redundant posts half way, is because I already know the other half already, I can even post on his behalf whining about LN and core dev agendas if you want even without looking at his posts from time to time.I'm not here to discuss his personality which somehow had to do that a little bit but won't do no more, my concern is the legitimacy of the direction which the forum is trying to move forward. Bottom line, the forum staff team including admins should reconsider some of their rules to avoid setting a bad precedent.Because you know what? Whether banning him from a certain forum or not he will always find a way to broadcast his opinions elsewhere, therefore disallowing him to partake in some discussions does more bad than good.Critics always find their way to critisize, I should know better since I live in Iran. lol.Anyways, I hope forum administration doesn't become a crook politician like every other politicians around the world.Seeing achow101 bumping that topic saying \"still enforcing\" triggered me to respond, it felt like a threat as in I'm still on your ass, better watch out. who knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 23, 2023, 01:47:03 PM",
      "body": "If we stopped discussing about individuals (in particular franky1 ), we might get better results.If franky1 was upset about the ban, he would have defended himself.Is it correct to ban someone from participating in tech boards because they are posting a lot of constant harassment and misinformation? There are rules that prevent spam, trolling, pointless or uninteresting posts( [1] [2] [3] ) so it handles case by case but I see that putting a warning at the end of every post made by a member in that board is better than banning it, or at least hiding the response and leaving the option to the user to activate it or not (closer to what happens to ignored member posts)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "January 23, 2023, 01:50:58 PM",
      "body": "I made a very similar topic once before: Why was franky1 banned from Dev & Tech?. I had to experience franky myself to realize what the more experienced members were saying about him; he's not fit for technical discussion. I'm not sure what his malfunction is, but (most of the time) he's basically unable to stay on-topic, make coherent points, and participate constructively. It's a pity, because I think there's a version of franky (on the right meds, or something) that would add a ton of value. I do (or did) enjoy some of his posts, and I do appreciate some of his views (like his misgivings about how the core dev team operates), but (on balance) he's not worth interacting with (try disagree with him sometime, and get into a prolonged back-and-forth, and you'll see what I mean; he'll argue passionately while being completely unaware of how off the mark he his).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "January 23, 2023, 02:04:49 PM",
      "body": "Quote from: digaran on January 23, 2023, 01:32:18 PMmy concern is the legitimacy of the direction which the forum is trying to move forward. Bottom line, the forum staff team including admins should reconsider some of their rules to avoid setting a bad precedent.I don't look at it as a precedent, it's an exception that hasn't happened to anyone else since it was first used years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "January 23, 2023, 02:26:05 PM",
      "body": "Quote from: Husires on January 23, 2023, 01:47:03 PMIs it correct to ban someone from participating in tech boards because they are posting a lot of constant harassment and misinformation?Technically speaking, he's not banned and can still participate in Tech board. Also, we cannot make generalizations as this measure was only applied once and only for one specific case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 24, 2023, 12:42:55 PM",
      "body": "Franky does have violated forum rules, according to the moderators at least; spamming and trolling to be precise. I agree with OP. We can't just ban someone from one board, users should either get banned universally or not banned at all. But, besides that, banning him from one board, just because he spreads misinformation in that board, doesn't mean he stops there. We frequently observe franky derailing threads in the Bitcoin Discussion with technical terms included, just because one user dared to mention the Lightning Network, or questioned the block size limit. I had requested a ban. I later changed my mind. I honestly don't care anymore. Mentally ill, idiot, and abstruse. Every forum has one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}