{
  "id": "topic_5459288",
  "title": "Researchoo",
  "author": "Researchoo",
  "created_time": "July 10, 2023, 07:42:44 AM",
  "content": "i will write and post articles on my website $10 price for 1 guest post",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459288",
  "comments": [
    {
      "author": "HONDACD125",
      "created_time": "July 10, 2023, 08:32:50 AM",
      "body": "would you like to public your site? how much daily traffic im your site and which country visitors are more?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Researchoo",
      "created_time": "July 10, 2023, 09:37:34 AM",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "July 10, 2023, 09:51:54 AM",
      "body": "Quote from: Researchoo on July 10, 2023, 09:37:34 AMYour trust score is not encouraging, regardless, your website is important for us to make our own review/research. And you might want to use TalkImg or other alternative image hosting sites as the forum doesn't support the one you used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Researchoo",
      "created_time": "July 10, 2023, 11:17:35 AM",
      "body": "here is website trafiic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Researchoo",
      "created_time": "July 10, 2023, 11:26:22 AM",
      "body": "here is links which will show you website trafficcheck https://ibb.co/b6Rsxhmhttps://ibb.co/crF0Wgk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 10, 2023, 03:20:53 PM",
      "body": "Quote from: Researchoo on July 10, 2023, 11:26:22 AMhere is links which will show you website trafficcheck https://ibb.co/b6Rsxhmhttps://ibb.co/crF0WgkI don't see the name of your website it is just a stat anyone can extract a stat and claim it as theirs if you are serious and not trying to fool us post your website and create a page or a link back here that you are the owner of that website with the stat you are showing.This is not how you offer guest posts, you have to be transparent and proud in posting your website not just an edited stat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "July 10, 2023, 03:40:23 PM",
      "body": "Quote from: Researchoo on July 10, 2023, 11:26:22 AMhere is links which will show you website trafficcheck https://ibb.co/b6Rsxhmhttps://ibb.co/crF0WgkWhy do you need to hide the site if it is so popular?  No one is going to believe you but yes, if you can share the site then we may check the traffic on traffic analyzing sites like https://www.similarweb.com/ and others and get to know the real picture. Remember if you are real, there is no need to hide the site even if it has low traffic. Transparency is the most important thing when you are looking for any service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Researchoo",
      "created_time": "July 10, 2023, 06:16:12 PM",
      "body": "I will ask for money after guest postdont worry about this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 13, 2023, 09:46:17 PM",
      "body": "Quote from: Researchoo on July 10, 2023, 06:16:12 PMI will ask for money after guest postdont worry about thisNo one will order you to write and post an article on a site that you are ashamed to report yourself. What's wrong with it that you can't tell its name? If you are going to post the articles you have written on Pornhub, then this will not be exactly a thematic placement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 13, 2023, 11:15:00 PM",
      "body": "Quote from: Researchoo on July 10, 2023, 06:16:12 PMI will ask for money after guest postdont worry about thisIf I am a client I would like to know first what is the niche of the site where you are posting about my project, so I can check and see if the niche is the same as mine, so I can also check if the stat that you're showing is the same like the one that you just showed, transparency is important if you're going to offer this kind of service, if you have a site with this kind of stat you should be proud of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "July 14, 2023, 03:55:24 AM",
      "body": "Quote from: Researchoo on July 10, 2023, 07:42:44 AMi will write and post articles on my website $10 price for 1 guest post To completely understand the concern about transparency and ensure niche alignment between the site and your project, you need to provide that information upfront. It's important to verify the niche and statistics. You should share more information about the site, including its domain authority, monthly traffic, and audience demographics so that they can make an informed decision. Transparency is indeed crucial, and we are emphasizing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "July 14, 2023, 04:04:13 PM",
      "body": "Quote from: Text on July 14, 2023, 03:55:24 AMQuote from: Researchoo on July 10, 2023, 07:42:44 AMi will write and post articles on my website $10 price for 1 guest post To completely understand the concern about transparency and ensure niche alignment between the site and your project, you need to provide that information upfront. It's important to verify the niche and statistics. You should share more information about the site, including its domain authority, monthly traffic, and audience demographics so that they can make an informed decision. Transparency is indeed crucial, and we are emphasizing it.He should have posted it when he creates this thread, this guy has a red flag he has tagged and an active flag for promoting a Ponzi scheme I don't think this guy is worth trusting, he is not transparent, and even if he posted that he will accept payment after posting the article in his so-called website he did not specify it on his thread.A legit offer should be complete with all the details that clients want to know, so avoid this guy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 14, 2023, 09:10:39 PM",
      "body": "Quote from: Researchoo on July 10, 2023, 06:16:12 PMI will ask for money after guest postdont worry about thisThere are sites from which backlinks are undesirable. It can happen that someone pays $10 for publishing an article and setting up a backlink so that it causes more damage than good. After that, it is necessary to invest more money to remove such a relationship. Without posting the website address, this is just hunting in the dark and these screenshots don't mean much, plus they can be faked.So leave a link to the site so that everyone can do their own research, is it all worth the effort.$10 for this service is a low price that raises suspicion, when we add to that your reputation here, everyone should definitely be careful with this offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}