{
  "id": "topic_5435887",
  "title": "Becassine",
  "author": "Becassine",
  "created_time": "January 18, 2023, 11:48:55 AMLast edit: January 18, 2023, 03:29:07 PM by Becassine",
  "content": "Bonjour,Toujours dans mes petits tests, j'ai besoin d'une explication sur un truc svp.Vous avez un wallet de 24 mots.Vous installez ce wallet dans une appli qui ne demande que 12 motsVous pouvez recevoir des coinsMais visiblement vous ne pouvez pas en envoyer à partir de ce nouveau wallet.Question : je voudrais bien une explication facile à comprendre. Merci. (je pense que l'explication n'est pas si compliquée, mais je me demande pourquoi ça ne fonctionne que dans un sens ? recevoir OK, envoyer pas OK)Edit : finalement ça a l'air de fonctionner : donc on installe un wallet genre trustwallet à partir de 24 mots et ça marche normalement. Ce n'est pas si simple à comprendre, malgré les shémas de Saint-Loup",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435887",
  "comments": [
    {
      "author": "Saint-loup",
      "created_time": "January 18, 2023, 01:15:36 PMLast edit: January 18, 2023, 01:27:38 PM by Saint-loup",
      "body": "Quote from: Becassine on January 18, 2023, 11:48:55 AMBonjour,Toujours dans mes petits tests, j'ai besoin d'une explication sur un truc svp.Vous avez un wallet de 24 mots.Vous installez ce wallet dans une appli qui ne demande que 12 motsVous pouvez recevoir des coinsMais visiblement vous ne pouvez pas en envoyer à partir de ce nouveau wallet.Question : je voudrais bien une explication facile à comprendre. Merci. (je pense que l'explication n'est pas si compliquée, mais je me demande pourquoi ça ne fonctionne que dans un sens ? recevoir OK, envoyer pas OK)BonjourAs-tu vérifié les adresses? Si tu le fais tu t'apercevras que ce ne sont pas les mêmes. Ce sont des adresses vierges, et donc vides, dans le nouveau wallet.Une seed c'est une valeur présentée(encodée) sous forme de mots facilement manipulables par l'homme. Mais c'est juste un nombre au final. Comme tous les nombres il peut en outre être représenté en binaire(base 2). Et en effectuant une série d'opérations mathématiques sur cette valeur on peut obtenir des clefs et des adresses. Cette chaîne d'opération étant déterministe, on est sûr de toujours obtenir les mêmes clefs et adresses au final. On a ainsi juste besoin de garder cette seed pour retrouver toutes les clés et adresses qui lui sont liées.Donc si cette valeur est modifiée, en la tronquant par exemple de 12 mots sur les 24 initiaux, on obtient plus le même trousseau de clefs et d'adresses au final.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "patrickus",
      "created_time": "January 18, 2023, 01:22:33 PM",
      "body": "Combien de clés privées peuvent être associées à une seed de 24 mots ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 18, 2023, 01:44:20 PMLast edit: January 18, 2023, 02:02:16 PM by Saint-loup",
      "body": "Quote from: patrickus on January 18, 2023, 01:22:33 PMCombien de clés privées peuvent être associées à une seed de 24 mots ?Je ne veux pas dire de bêtises, mais je crois avoir lu qu'il n'y avait pas de limite théorique, puisque les paires clefs/adresses sont obtenues en les dérivant de la seed en appliquant une fonction(Child Key Derivation) qu'on peut appliquer indéfiniment. Par exemple une adresse m/0/0/999999999 peut théoriquement être créée. Les limites sont donc celles du wallet logiciel utilisé. Augmenter le nombre de mots de la seed, n'augmente pas le nombre d'adresses pouvant être générées (ca augmente juste la difficulté à \"casser\" la seed)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Becassine",
      "created_time": "January 18, 2023, 03:19:50 PM",
      "body": "Merci, désolée je n'ai plus de smerits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}