{
  "id": "topic_5462654",
  "title": "DVlog",
  "author": "DVlog",
  "created_time": "August 09, 2023, 02:12:36 PM",
  "content": "I am in crypto for a few years and i have good knowledge of the crypto markets and their behavior. For the past few years, I am mostly invested in some top crypto project and held it till I get decent profits. You can say i am a holder. Now i want to try something different. I want to try day trading methods to generate a daily income from the spot market. Is that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462654",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "August 09, 2023, 02:16:19 PM",
      "body": "I would imagine that in order to generate such amounts per day, you would need a decent amount to start with. Do you have that? But assuming that you do, the market is very volatile. You can't simply use a grid bot, or follow a certain strategy and expect money to keep flowing. So if you don't know what you're doing, daytrading is probably something you should stay away from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "August 09, 2023, 02:26:05 PM",
      "body": "Quote from: OmegaStarScream on August 09, 2023, 02:16:19 PMI would imagine that in order to generate such amounts per day, you would need a decent amount to start with. Do you have that? But assuming that you do, the market is very volatile. You can't simply use a grid bot, or follow a certain strategy and expect money to keep flowing. So if you don't know what you're doing, daytrading is probably something you should stay away from.I have funds to start with and i saw there are people who are earning a good amount of money from spot trading. Forget about day trading, is that even possible to generate 100$ weekly from spot trading with minimal risk? I would like to know how many among us generating this type of figure from the crypto market and what methods they are using to do that. Also how they manage their risk and reward ratio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "August 09, 2023, 02:48:12 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:26:05 PMQuote from: OmegaStarScream on August 09, 2023, 02:16:19 PMI would imagine that in order to generate such amounts per day, you would need a decent amount to start with. Do you have that? But assuming that you do, the market is very volatile. You can't simply use a grid bot, or follow a certain strategy and expect money to keep flowing. So if you don't know what you're doing, daytrading is probably something you should stay away from.I have funds to start with and i saw there are people who are earning a good amount of money from spot trading. Forget about day trading, is that even possible to generate 100$ weekly from spot trading with minimal risk? I would like to know how many among us generating this type of figure from the crypto market and what methods they are using to do that. Also how they manage their risk and reward ratio.I don't think that's a good idea. I believe in HOLDING. Long-term investments are the best because if you have enough knowledge about the market and how it works, you can surely gain a lot of profit. If you can analyze the history of a coin and how it has behaved for the last 5 or 10 years, you can surely predict whether it will go up or down. Not always, but most of the time.On short-term trading, there are many things like bots, AI trading, and up-down signal groups. But I think they are all scams. I have tried several times. Failed miserably.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 09, 2023, 03:30:42 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMI am in crypto for a few years and i have good knowledge of the crypto markets and their behavior. For the past few years, I am mostly invested in some top crypto project and held it till I get decent profits. You can say i am a holder. Now i want to try something different. I want to try day trading methods to generate a daily income from the spot market. Is that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?Yes, that's very likely to earn that much in trading if you've got a bigger capital. I'd just say that it's possible but making it in actuality is where the real challenge starts. I don't know how many mistakes you'll have to make for you to make that amount that you're targeting.Here's a piece of tip, most of the people that are day trading are getting rekt. Now, that's the reality that has to be taken into consideration if you've got that plans of making that much daily in trading. It sounds easy but it isn't and once you're able to make that then you can consider yourself a legend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "August 09, 2023, 03:33:21 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMIs that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?It depends on your total invested amount and your ability to make good trades. Don't take trading as a primary income source. It is not what you think it is. And trading is not for everyone. Just because some other people are making profits from trading does not mean that you can do the same as well. One's loss is another's profit. So as long as people are making losses, people on the other side will make profits. And those who are making profits today will also lose someday. So keep in mind that anything could happen in the market at any time. And the amount you are talking about daily and weekly can be achieved by future trading or a huge amount if you want it from the spot trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "August 09, 2023, 03:37:00 PM",
      "body": "Quote from: DYING_S0UL on August 09, 2023, 02:48:12 PMQuote from: DVlog on August 09, 2023, 02:26:05 PMQuote from: OmegaStarScream on August 09, 2023, 02:16:19 PMI would imagine that in order to generate such amounts per day, you would need a decent amount to start with. Do you have that? But assuming that you do, the market is very volatile. You can't simply use a grid bot, or follow a certain strategy and expect money to keep flowing. So if you don't know what you're doing, daytrading is probably something you should stay away from.I have funds to start with and i saw there are people who are earning a good amount of money from spot trading. Forget about day trading, is that even possible to generate 100$ weekly from spot trading with minimal risk? I would like to know how many among us generating this type of figure from the crypto market and what methods they are using to do that. Also how they manage their risk and reward ratio.I don't think that's a good idea. I believe in HOLDING. Long-term investments are the best because if you have enough knowledge about the market and how it works, you can surely gain a lot of profit. If you can analyze the history of a coin and how it has behaved for the last 5 or 10 years, you can surely predict whether it will go up or down. Not always, but most of the time.On short-term trading, there are many things like bots, AI trading, and up-down signal groups. But I think they are all scams. I have tried several times. Failed miserably. Most projects don't even survive that long and dude if you are not a holder you do not know how boring it is to hold a 3 long year with 2 years of continuous bear market and one year of sideway market. In this long period of time market gave us a lot of speculative chances to get some profits with short-term trades but i was not able to take it because of my lack of knowledge about the proper way to do that. I came here to learn from someone who might be generous enough to help me regarding that.Quote from: blockman on August 09, 2023, 03:30:42 PMQuote from: DVlog on August 09, 2023, 02:12:36 PMI am in crypto for a few years and i have good knowledge of the crypto markets and their behavior. For the past few years, I am mostly invested in some top crypto project and held it till I get decent profits. You can say i am a holder. Now i want to try something different. I want to try day trading methods to generate a daily income from the spot market. Is that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?Yes, that's very likely to earn that much in trading if you've got a bigger capital. I'd just say that it's possible but making it in actuality is where the real challenge starts. I don't know how many mistakes you'll have to make for you to make that amount that you're targeting.Here's a piece of tip, most of the people that are day trading are getting rekt. Now, that's the reality that has to be taken into consideration if you've got that plans of making that much daily in trading. It sounds easy but it isn't and once you're able to make that then you can consider yourself a legend.90% of people do fail to make any profits from trading but there are still 10% who do make profits. I want to be in that 10% and I am not a newbie in this sector. I just need some guidance to find my way to do that. I just want to hear how other are doing it so that i can improve my own strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "August 09, 2023, 03:59:49 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMIs that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?There's always a possible but there's no guarantee since we are talking about here a short timeframe trading on a volatile asset. You will need a huge capital in able to have this kind of target profit with minimal risk or else use futures trading with increase leverage if you want low capital but high risk.Indicators is not that helpful when use on short time frame because the signal it gives can be easily invalidate once someone sell or buy in huge amount. Using candle stick pattern works for me on scalping but It's very hard to be consistent on this kind of trade. Just stick your current strategy since it's already working to you. Just increase your capital if you want more gain on your long term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 09, 2023, 05:08:02 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMIs that even possible to earn 50$-100$ every day with spot trading?Mate you can earn as low as $1 per day to as high as $999,999 per day; just like how sky is also the limit when in business. It’s just going to depend on how good you actually are and how much money you’re willing to risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "August 09, 2023, 05:34:25 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMI am in crypto for a few years and i have good knowledge of the crypto markets and their behavior. For the past few years, I am mostly invested in some top crypto project and held it till I get decent profits. You can say i am a holder. Now i want to try something different. I want to try day trading methods to generate a daily income from the spot market. Is that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?Daily income from day trading is possible if you know how to analyze the market and become an expert in trading. But to make $50-$100 daily profit from spot you need to trade at least with $5000. Otherwise you will not be able to make such earning daily but crypto trading never guarantees profit so no one can guarantee that you will make profit every day.  You can lose a single day and the losses can be big. However, crypto trading requires the ability to take risks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "August 09, 2023, 05:46:35 PM",
      "body": "The amount of capital to start a trading is not really the issue because if you know your charts and analysis you can gradually build your capital to the range where your $50/$100 daily target will not cause panic on your account but the major issue is doing it to work that out. You are a hodler and obviously you don't know anything in trading like you didn't say that. Asking what method is a misplaced question because it is assumed that you don't know any method yourself. So the first you need to do is to learn a bit of trading and come back to ask questions. There are some information here, google, YouTube and many others that you can stay with and gradually things as the trading terminologies, techniques will start sinking in to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 09, 2023, 06:24:05 PM",
      "body": "Quote from: DVlog on August 09, 2023, 03:37:00 PMQuote from: blockman on August 09, 2023, 03:30:42 PMYes, that's very likely to earn that much in trading if you've got a bigger capital. I'd just say that it's possible but making it in actuality is where the real challenge starts. I don't know how many mistakes you'll have to make for you to make that amount that you're targeting.Here's a piece of tip, most of the people that are day trading are getting rekt. Now, that's the reality that has to be taken into consideration if you've got that plans of making that much daily in trading. It sounds easy but it isn't and once you're able to make that then you can consider yourself a legend.90% of people do fail to make any profits from trading but there are still 10% who do make profits. I want to be in that 10% and I am not a newbie in this sector. I just need some guidance to find my way to do that. I just want to hear how other are doing it so that i can improve my own strategy.I'm not successful in it but based on what I am reading from the other successful traders, they're into the charts actually and applying most of the methods that you probably know and how they read it. There's no secret or exemption to what they're applying to their trades. I know that you've got already some experience on how it goes but you really need to make a trial and error run for your trades. Test every possible method that you know and see to it on which of them is the most applicable and working to you, you'll see that on which is the most effective when you've made some wins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 09, 2023, 07:55:53 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMI am in crypto for a few years and i have good knowledge of the crypto markets and their behavior. For the past few years, I am mostly invested in some top crypto project and held it till I get decent profits. You can say i am a holder. Now i want to try something different. I want to try day trading methods to generate a daily income from the spot market. Is that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?Hmm, it's quite simple to explain the method a day trader can easily make a 1% to 3% profit from a good market trend. Remember 1% to 3% can be higher if you are in aggressive bull rally up to 5%. To make 100$ to 50$ you need to have enough capital investment to meet your requirement in the 2% or 3% profit = to the 50$ t 100$.There is no need for rocket science or unknown strategies simply follow your analysis keep an eye on the market development and be careful while taking trades with prevention measures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "August 09, 2023, 07:59:36 PM",
      "body": "This definitely depends on the capital without a doubt. We haven't seen OP say what his capital is, but if we are talking about like a million dollars then of course its possible and if we are talking about 100 dollars then its of course not possible. Yes the amount per day matters, but what matters most is the capital. Someone who has 100 dollars will not double it per day, and someone who has 1 million dollars could make one investment, and can make 36.5k a year, just hold bitcoin, even in a few days with a bit of increase that can happen easily. So as you can see, the \"possibility\" of it depends on the capital, the greater the capital the greater the chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 09, 2023, 08:14:36 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMIs that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?It's possible, but it's very risky, and it will require a huge amount of capital for you to be able to achieve that with minimum risk. If you have a huge amount of capital, then there is a possibility for you to earn up to $50, at least, by day trading. Let's say you have up to $100,000 in stable coins. You can choose a few coins from the market, either BTC, Eth, or BNB.With the current market condition, you can see the price is floating constantly, which means you can take the risk of buying every single hour and selling back even if it's $1–$5 added to your purchase. Before you can do that for about 3 times on different coins, you will be able to raise that. But there is also the possibility that if you purchase and wait for the price to go up a bit, it might turn against you, so you will definitely have to be considerate when you choose to enter the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "August 09, 2023, 08:16:18 PM",
      "body": "$50 per day would require a decently sized capital, which means that you should be accustomed to risking your money. Are you up for that challenge? I used to make approximately $40 to $50 per trade with a capital of approximately $500 to $600, which is about 8% to 10% profit depending on the amount I invested and the occasion, of course. See the keyword I used, per trade. I wasn't conducting transactions on a daily basis; it depended on the market situation and how everything was performing. I'd usually buy BTC, ETH, XLM, or some other coin, hold it for a few hours to a few days at most, and then proceed to sell it. Most of my trades were successful and I never suffered any major losses, but I decided to stop because it was way too time-consuming and stressful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 09, 2023, 10:31:06 PM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMIs that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?@OP, Yes, it is very possible; you can even earn more than that, just up to the amount that @MK4 stated, but what you must know is that in trading, your profit is not always certain because the crypto market can really be very volatile and could go against your predicted price, which can result in a loss on your investment. Another thing to consider is how much you are willing to risk, because that will actually also determine the level of your profit, because in Investment, the higher your Invested amount, the higher your profit. Since you said you want to trade sports on CEX, let me give you an example.Example: Yesterday, Bitcoin went from $29,300 to $30k+, so let's assume you had $58,600 in fiat and you bought two pieces of Bitcoin at $29,300 each, held it for some hours until it got to $30,120, and sold at that price. Your profit would have been $1,640 just yesterday.Assuming you had $117,200 and invested in 4 bitcoins, your profit would have been double what is stated above in one day.Also, if you are dealing with an altcoin, perhaps the price for one of those coins is just $0.21, and you bought 60,000 pieces of the coin for $12,600. Then, let's say the price of the coin just moved from $0.21 to $0.23, then your profit would be $1200; that's just one day's profit.I have only calculated the profit side of the market, but assuming the market goes against you, then you would have some loss on your investment.So, my point is that you can make even more than $50 in a day, depending on how much you are willing to risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "August 10, 2023, 01:52:45 AM",
      "body": "Quote from: DVlog on August 09, 2023, 02:12:36 PMI am in crypto for a few years and i have good knowledge of the crypto markets and their behavior. For the past few years, I am mostly invested in some top crypto project and held it till I get decent profits. You can say i am a holder.I am very surprising if you only got profit from holding altcoins so far and did not get any loss with them.Not all altcoins even they are top altcoins will help you gaining profit by holding. Many top altcoins lost their prices from all time highs and never recovered to their all time highs, not yet mention that they failed to make new all time highs. More serious, they die with time so holding altcoins can cause losses, serious losses, not only profit. By that I mean you are very good investor if you only got profit from altcoins.QuoteNow i want to try something different. I want to try day trading methods to generate a daily income from the spot market. Is that even possible to earn 50$-100$ every day with spot trading? If yes then what methods you are using and how do you manage your risk?Trading is not a game for all and most of traders have losses from trading. Do you really think you can belong to minority of traders and will be able to get profit from trading?$50 or $100 profit from spot trading is possible but it depends on your trading capital. If you have a trading capital like $50,000, it is an easy target. If your trading capital is only $100 or $500, it is a very impossible target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rojan",
      "created_time": "August 10, 2023, 02:10:29 AM",
      "body": "Quote from: coinerer on August 09, 2023, 05:34:25 PMDaily income from day trading is possible if you know how to analyze the market and become an expert in trading. But to make $50-$100 daily profit from spot you need to trade at least with $5000. Otherwise you will not be able to make such earning daily but crypto trading never guarantees profit so no one can guarantee that you will make profit every day.  You can lose a single day and the losses can be big. However, crypto trading requires the ability to take risksIt is normal to trade profit and loss. But there is no guarantee that you will get $50-$100 daily income from spot trade. Some days there will be profit and some days there will be loss. But if you can analyze the market and trade, the loss will be very small. But all of us  Time has to take risk. If we don't have risk, then we can't do anything in life. If we have to stick to the right work at the right time, then we can be successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "August 10, 2023, 06:35:12 AM",
      "body": "Getting a hundred per day is tough even if you are a pro at day trading. Remember that day trading would mean more and more intensive monitoring of prices over 24hr. Most professional day traders use bot to get that data and a lot of sleepless nights will occur. It is a toll on your physical and mental health. I don't recommend day trading to a person who is already a holder. However I can suggest you to try dummy trading with a day trading mindset and see whether you are comfortable with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}