{
  "id": "topic_5452067",
  "title": "Trinx01",
  "author": "Trinx01",
  "created_time": "May 09, 2023, 09:11:40 AM",
  "content": "I stopped my crypto journey way back last year because of so many losses and got busy with my school works,  it was last year in February when I lost a huge amount of my money investing in altcoin and got rugged, I was depressed that time and sad because I lost a huge amount of money which makes me stop my crypto journey and just focus on my study.Two weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.I just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452067",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "May 09, 2023, 09:33:19 AM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.sadly a lot of people who are new to cryptocurrency make this mistake, they dive into crypto thinking that it's an easy way to gain profit because of all the success stories they saw online. I hope this time you make your due diligence to know what you are getting into before doing anything especially if it involves money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "May 09, 2023, 10:16:42 AM",
      "body": "If after returning you are still with old habits with altcoins, then your chances of expecting a change will not exist.Think again if your goal is to return to altcoins.Quote from: Trinx01 on May 09, 2023, 09:11:40 AM-snipI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Cryptocurrency is very risky, that's true, but there are ways to stay away from the risk while in the crypto space, namely choosing Bitcoin and making it a long-term investment.Before you stop, I'm sure you already know how the crypto space is. You already have some experience in judging what coins are and are not worth owning.We wish you a successful return to continue activities in the crypto space with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 09, 2023, 10:30:13 AM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AM~snip~Two weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.Are you talking here about someone you know personally or a friend you met online? I ask because there are people who steal other people's pictures and create fake profiles on social networks, all in order to promote some scam projects. You will ask where he got all this from, he will say from investing in cryptocurrencies and then suggest some coins on which he got rich, and so you will return to the beginning of your story.My advice is not to repeat the mistake you have already made, which is not to invest money in something that has no meaning and purpose, as well as in something that you do not understand. In any case, welcome back to the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "May 09, 2023, 11:10:04 AM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI stopped my crypto journey way back last year because of so many losses and got busy with my school works,  it was last year in February when I lost a huge amount of my money investing in altcoin and got rugged, I was depressed that time and sad because I lost a huge amount of money which makes me stop my crypto journey and just focus on my study.Two weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.I just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Its good to rest since mental health is important and best decision to focus on school work before anything else. But what good thing happened here is you came back and for sure there's a lot of learnings you gain from past experiences you encounter so learn from that mistake to grow on crypto scene.Crypto is really a risky investment but there are methods we can use or apply to minimize the risk and we can also adopt the changes especially with the news to gain from it so maybe practice to control your emotion so that you will not caught up by bad decisions and can able to think good action according to what status of the market we are on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "May 09, 2023, 11:32:37 AM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Welcome back and i hope you've taken your tie to learn enough about cryptocurrency all these while you've been away, this same mistake is what many people make and ended up getting them being frustrated about bitcoin or cryptocurrency without knowing it's actually their own fault, what we don't know will certainly fall us down because we are unconscious about it's existence, so how do we attack whebbwe are even a novice in that aspect, try to learn and be active, start your investment with bitcoin and avoid altcoins for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 09, 2023, 12:35:55 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI stopped my crypto journey way back last year because of so many losses and got busy with my school works,  it was last year in February when I lost a huge amount of my money investing in altcoin and got rugged, I was depressed that time and sad because I lost a huge amount of money which makes me stop my crypto journey and just focus on my study.Two weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.I just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.I do hope that you have learn your lessons very well the first time. We might have different path, but the end result should be the same. Earn and make profits through our journey in crypto currency. And I guess it's good for you to stop your initial crypto journey because it didn't end well and you focus on your studies.Yes, crypto investment/trading is very risky, if you don't have the experience, you will definitely lose big money here. And as I have said, it's a expensive lessons to learn and so with that already under your belt, it might be a different result this time. So good luck in your journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "May 09, 2023, 12:43:47 PM",
      "body": "Welcome back! I'm glad that you're continuing your journey despite any past mistakes. It's important to remember that not everyone succeeds on their first attempt, and what matters most is your determination to succeed. With the market potentially moving into a bullish phase soon, now is a good time to invest. This is just my personal prediction based on my years of experience in the market, but I always remind myself to take my predictions with a grain of salt as I could be wrong.Whether you invest for the short or long term, success is achievable as long as you have the necessary skills and knowledge. The bull run will eventually come for both bitcoin and altcoins, so it's a good idea to start buying now and hold on to your investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demonica",
      "created_time": "May 09, 2023, 12:45:46 PM",
      "body": "It's nice to hear that you still considered coming back even after your losses cause not everyone is willing to give a second try on something if they really lost a lot. Experiencing losses are part of risking and I've also experienced it a lot but I've learned from my mistakes so I hope you also do. I also hope that sooner, you can also achieve the things that inspire you to be back. Crypto investment involves such a big risk. It'll either allow you to earn big or lose big with the decisions you'll make. But this forum is a great platform to learn and discover a lot especially from those who have a lot of experience already. Good luck on your journey",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "May 09, 2023, 12:51:05 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMTwo weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.I hardly see any bitcoiner showing off wealth on social media, I might be wrong. But I have encountered many scammers or fraudsters on social media that got their money by cheating people showcasing the wealth they claim that got from the crypto space. If you ask them how they became very rich, they will claim they are trading or investing in the crypto sector. I am not saying that the sector can make someone rich but you should get more information from your friend. This is because his flamboyant lifestyle can lure you to make the same mistake you made.QuoteI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Risks in the crypto sector are in levels. If your target is to make an instant profit within a short period, then you are facing a higher risk. But if you focus on investing in Bitcoin, the profit might not be big and instant but it is less risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "May 09, 2023, 12:59:52 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI stopped my crypto journey way back last year because of so many losses and got busy with my school works,  it was last year in February when I lost a huge amount of my money investing in altcoin and got rugged, I was depressed that time and sad because I lost a huge amount of money which makes me stop my crypto journey and just focus on my study.Two weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.I just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.It always interest me seeing people learn from their past mistakes, As you've learnt so far, the crypto industry is very volatile and you should invest with caution, if you had invested with the amount you could have afford to lose, I don't think you would have felt the negative impact that much, to the extent that you almost quitted your crypto journey.However, I would advise in my little experience here that you should have plans, don't be greedy and quick to recover loses let the past be in the past and see this as a new beginning of your crypto journey , hence if come back with the mindset of recovering the past loses , I bet you might still get it wrong the second time if you don't take care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "May 09, 2023, 02:14:35 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Crypto investment is full of lessons and new experiences. It is better to retrace then re-enforce to come back well grounded and knowledgable about the market mysteries than still to consistent loss. If a trader is not confident enough to engage with the market volatility it is better they trade less and learn more. The profit will always be there waiting when the get better .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 09, 2023, 05:11:31 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Welcome back, mate, but I hope you take your time to learn from your previous mistakes.If you are back again to continue your journey with altcoins, then I don't think you have learned enough lessons because altcoins are not reliable and are not as centralized as many people think they are.The best thing to do now is to invest in Bitcoin now that the price is down, and I am sure you will benefit from it in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 09, 2023, 05:42:15 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMTwo weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.Sorry to say but your second coming to bitcoin may just go the same way as your first and you thinking that you can just come to the Crypto-currency space to make money just like that will lead you to more loses, try to learn from your mistakes.You saw your friends showing of wealth really what are you facts they were made of crypto-currency, and even if it was what did he do in crypto-currency to make such money, all I can see here is greedy and jealousy which is actually what scammers prey on. Go learn crypto and enjoy every process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 09, 2023, 05:48:56 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI stopped my crypto journey way back last year because of so many losses and got busy with my school worksWelcome back to the forum, and learning too. Your decision to round up your formal education is a right decision; first thing first. Notably, your hiatus wasn't for a long time and I believe you will catch up with what has transpired here in your absence. Talking about what your friend has shown you as dividends from his investment in cryptocurrency, I hope you will tread carefully believing him hook, line and sinker.Remember that it's not all that glitters that's gold. Most of these people who display the supposed luxury acquisitions as dividends of crypto earnings aren't truthful. I ain't saying people don't hit it big in cryptos. Of course people do but most of those who do make it big like to lie low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "May 09, 2023, 07:09:19 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Having thorough knowledge of the cryptocurrency sector is the best approach for someone to reduce the risk involved with using cryptocurrencies.so it is necessary that we should have good knowledge to accomplish our cryptocurrency journey.many beginners have lost a significant amount of money in the sector because they don't have appropriate knowledge of Cryptocurrency and that is what result many of them invested in the wrong projects or were duped by scammers.Therefore, before making any investment decisions, it is crucial to have a thorough understanding of the cryptocurrency.ate try to hold off on making an investment until you have additional information. And based on your explanation, I hope you will stay away from altcoins for while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "May 09, 2023, 08:27:19 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMTwo weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.I just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Welcome back OP, I hope you can learn from this forum and improve your knowledge on bitcoin. It’s possible to make money from trading bitcoin and other cryptocurrencies, but I think it would’ve been best if you had asked your friend to tell you his source of income instead of just assuming that he got all that he has from investing in cryptocurrency. I’m afraid your enthusiasm will fade once again if you do not get the results (luxurious cars and houses) that you hope for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 09, 2023, 09:41:47 PM",
      "body": "Welcome back to you. It's never too late to get back to the market and have your plans again and execute them while we're not yet in the bull run. But as you know, the road has never been easy to everybody. You may see other people sharing what they've achieved with crypto but it's not always the case that should be taken a look. But it's the journey on how was it for and how much losses they've made before reaching those successes that they're sharing right now. Well, just enjoy your journey OP, it may not going to be as easy as before but at least you've started again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "May 09, 2023, 09:54:38 PM",
      "body": "It's great to hear that you returned to the world of cryptocurrency and learned valuable lessons along the way. If you had given up on your crypto journey, you might have lost all your invested funds permanently. I can relate to your experience as I also lost a significant amount of funds when I purchased certain altcoins that experienced a drastic decline and never rebounded. However, I didn't let that discourage me. I persevered in my crypto journey and gradually regained everything I had lost. Eventually, I became successful and established myself through crypto investments. Therefore, I encourage you not to lose hope and continue moving forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "May 09, 2023, 10:18:37 PM",
      "body": "Quote from: Trinx01 on May 09, 2023, 09:11:40 AMTwo weeks ago I saw my friend on Facebook posting such luxury and cars he already has and I know that person is into cryptocurrency so I know that he got all those things because of cryptocurrency that inspires me now to continue my crypto journey and I will start it with this forum as I know I can have a lot of lessons and advice here.Now that you're back, you need to rekindle your interest in bitcoin rather than altcoins. Your friend who inspired you must have made a fortune in crypto by investing in bitcoin over time or was just lucky with some shitcoins on a pump and dump basis. The lesson you learned from investing in altcoins should not discourage you, but rather inspire you to learn from your mistakes. I'm confident you'll understand things straight away; you can't get bitten twice in the same area if you're prepared to meet the challenge.QuoteI just realized how risky cryptocurrency is, especially for those people who have not yet have good knowledge about it, I've learned from my mistakes last year and j am now here exploring again and will be careful this time.Good to have you back into the crypto space, hope you trade with caution this time around. Enjoy your exploration and be more extra careful and also confidence in your decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}