{
  "id": "topic_5474618",
  "title": "BenCodie",
  "author": "BenCodie",
  "created_time": "November 19, 2023, 04:05:23 AMLast edit: November 21, 2023, 08:47:44 PM by BenCodie",
  "content": "Hi all,I have a good handle on Linux however I am looking someone above my skill-set to be able to setup a workflow environment for some collaborative work. I am looking for someone with a background in server management to help setup some services on a linux server. Proxmox seems to work best with Debian, though the base server is clean and any preferred OS can be installed. Ubuntu, Debian or Centos preferred as these will be easier to maintain. Setting up: Proxmox VE 8Installing and configuring 3 VMs each to run: Taiga, ERPNext and cyberpanel alongside the above. Please post or PM me if you are confident in doing the above in a way where there will be no bugs and no hiccups. I do not want someone who is just trying for the sake of trying, I can do this myself. There are hiccups if you aren't sure of what you're doing, or if you're not experienced. I will not be satisfied if you come into the job with confidence and cause delays due to facing unexpected hiccups and not being able to do the job 100% perfectly. If you have more questions to be able to help you do the job, please do not hesitate to ask. If you are ready to go, preferably, provide a rough quote for your work so I can compare with other quotes.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474618",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "November 21, 2023, 08:45:18 PM",
      "body": "No PM's or posts yet. Still looking  Bump",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "November 25, 2023, 07:22:05 AM",
      "body": "Talking to a couple of users. If you are interested in the job please be prepared to provide a quote, as the most competitive quote and the person most confident in doing the job will be the one to work on this.If you are not prepared to use an escrow, or work first and get paid after the job, please do not apply. Nothing will be paid upfront, but the full quote can go into escrow once all details are confirmed and the job is ready to get started if trust is an issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}