{
  "id": "topic_5476327",
  "title": "ScamViruS",
  "author": "ScamViruS",
  "created_time": "December 02, 2023, 07:36:52 PM",
  "content": "X.com (Twitter) has now become the easiest medium for scammers to promote their scams. The X.com advertising system makes it easier for scammers to reach more people with fake/phishing websites. So newbie crypto users and those inexperienced with such phishing scams should avoid such tempting ads and refrain from connecting their wallets to any unknown websites. Because the main goal of these scammers is to get access to the wallets of crypto users, and for this they are promoting phishing websites with such tempting ads.Website Link :Code:http://claim.blast-web3.com/Ads link :  https://twitter.com/puckgao/status/1730704810553270647?t=cLX4N225L9QK4xsl4eeV4A&s=19QuoteDomain Name: blast-web3.comRegistry Domain ID: 2834282825_DOMAIN_COM-VRSNRegistrar WHOIS Server: whois.psi-usa.infoRegistrar URL: https://www.psi-usa.infoUpdated Date: 2023-12-01T18:04:02ZCreation Date: 2023-12-01T18:00:35ZRegistrar Registration Expiration Date: 2024-12-01T18:00:35ZRegistrar: PSI-USA, Inc. dba Domain RobotRegistrar IANA ID: 151Registrar Abuse Contact Email: email@psi-usa.infoRegistrar Abuse Contact Phone: +49.94159559482",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476327",
  "comments": [
    {
      "author": "alastantiger",
      "created_time": "December 02, 2023, 08:09:58 PM",
      "body": "Good information. Thank you. This is not limited to only X. It is rampant on other social media platforms as well. There is nothing that the owners can do. The best is to advice users to be careful of clicking and visiting untrusted websites. Another way is for others users to report these scam websites just as you have done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "December 02, 2023, 08:51:36 PM",
      "body": "You do not have to include the link to the post of Twitter website, it gives more visibility to the post cause of those that will click to view it. It's best to include it in code tags so the link is not clickable.About phishing websites being allowed or approved, scammers have always been able to get past whatever restrictions set for them by social media platforms, this does not mean the have been approved by Twitter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "December 02, 2023, 09:06:31 PM",
      "body": "Twitter now as X, as always been a home for crypto scammers and phishing scam as been the most common only just continuously get innovated, we are always advice here, to be cautious of the site we visit, what we share online and others. Through this the scammer maybe able to track your transaction (dusting attack) through your inputed wallet address on the site and is a phishing scam which is still possible by this in binance Phishing scam on (exchanges) altcoins addresses",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "December 03, 2023, 07:14:25 AM",
      "body": "Quote from: alastantiger on December 02, 2023, 08:09:58 PMGood information. Thank you. This is not limited to only X. It is rampant on other social media platforms as well. There is nothing that the owners can do. The best is to advice users to be careful of clicking and visiting untrusted websites. Another way is for others users to report these scam websites just as you have done.I don't think that there's much that X,com can do about this, it's a public domain, therefore the good, bad and the ugly all have access to their service. Besides this problem is not peculiar to them, any public domain like Facebook, WhatsApp, telegram and the rest of them are also  hubs for this scammers to advertise their evil deeds. The only thing that we can do is to inform our loved ones to be on the lookout for these phishing website ads on social media, to also bring the information to groups that we belong to, so people can be informed and avoid these traps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "December 03, 2023, 07:21:21 AM",
      "body": "That's the problem with every social media platform. The problem with X com is much bigger as the bluetick in front of the username can fool a lot of new users. If I am correct anyone can pay a small amount monthly on X.com and can get bluetick. Till now other platforms don't allow such feature. This feature makes X.com more vulnerable to scammers and a hub for misinformation. After Elon Musk bought Twitter he made the platform far worst than what it used to be earlier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 03, 2023, 07:32:16 AM",
      "body": "This is not new with the development of not only running ads with scams like this, but I remember recently when I accidentally looked at the information of an account and saw that they were inciting violence. But basically, these situations can all be avoided by improving your internet skills. Because most new people will be easily attracted to meaningless clichés about work or easy income. But anyway, I still think the problem lies with each person, so not only X but also other media platforms need to be vigilant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "December 03, 2023, 10:20:50 AM",
      "body": "As other users mentioned, it's nothing new. Although recently X also caught showing anti-semitism ads[1] and attempt to disguise ads as regular ads[2] which makes it more concerning.Quote from: alastantiger on December 02, 2023, 08:09:58 PMThis is not limited to only X. It is rampant on other social media platforms as well. There is nothing that the owners can do.I disagree, with manual check performed by human many of such ads could be caught before it's shown to X users.[1] https://www.npr.org/2023/11/17/1213836636/advertiser-exodus-grows-as-elon-musks-x-struggles-to-calm-concerns-over-antisemi[2] https://techcrunch.com/2023/09/08/x-formerly-twitter-caught-running-unlabeled-ads-in-users-following-feeds/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "December 03, 2023, 10:36:22 AM",
      "body": "There are many impersonating accounts on X nowadays and those scammers try to impersonate accounts of big accounts on X, exchange accounts. They use those impersonating accounts to follow other users and try to find potential victims.I am experienced enough to know those ones are impersonators but for newbies, they will have to deal with big risk. If they receive PMs from those impersonating accounts and think it is real offers from real accounts of exchanges ie. they will be scammed.Pay attention on date of registration, total followers, check audit score [1], and don't click on links send to you by those accounts.[1] https://www.twitteraudit.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luffygroove",
      "created_time": "December 03, 2023, 11:55:56 AM",
      "body": "It's not only about X; it's a general concern. Here's the scoop: steer clear of ads on social media that might lure you in. I've long stopped being an airdrop hunter because I realized there are more sketchy ones than genuine ones. The risk just isn't worth it anymore, it's genuinely risky business. It's like walking through a shady alley; you're better off sticking to the well-lit path. Falling for these ads can lead to trouble, so it's wise to resist the temptation. Think of it as safeguarding your virtual wallet, avoiding potential danger and keeping your crypto safe from harm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terizla",
      "created_time": "December 03, 2023, 02:11:02 PM",
      "body": "This already happening in Twitter long time ago.Not only phising website ads, many scammer do anything to scam target like create a fake giveaway. Since every account can get blue verification by paying every month/year. Many fake account pretend to be original account make the scammer more easy to try scam target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "December 03, 2023, 02:29:56 PM",
      "body": "This is one of the useless coins we normally see on social media promoting their projects to lure potential investors that might not be aware of how this thing works. We need to be very careful and inform people too that might be ignorant of this tricks. There are so many coin projects on Twitter that do not have a good team that would keep the project for a long time. This is the pattern many scam projects normally do to attract users and customers and at the end they would dump the project for holders. Sometimes we can be ignorant too not knowing how to select good projects from the bad ones but we should always try to invest what we can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "December 03, 2023, 02:34:28 PM",
      "body": "Phishing websites and links can be found in so many platforms other than X (Twitter), phishing applications are also everywhere in Playstore and even in Apple App store, and you'd be surprised at the number of victims that these scammers manage to defraud. Some people are just ignorant or gullible and most times they are just greedy, they want to earn unrealistic rewards and they don't want to do their own research on the right place to download certain applications,. Even if X tightens their security on scam website ads, there are so many other options for scammers to use, thus it is on the individual to get more knowledge in order to avoid them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "December 03, 2023, 02:37:32 PM",
      "body": "Yeah, Twitter (X.com) has kinda morphed into a playground for fraudsters and phishing scams.  They mainly go after people just getting into crypto who don't really know the deal yet and  the ad platform lets them cast a wide net too.  Legit businesses do fine there, but con artists have figured out how to game the system.  New folks tend to be more trusting and easier to fool, so scammers actively seek them out over there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 03, 2023, 02:56:18 PM",
      "body": "Quote from: ScamViruS on December 02, 2023, 07:36:52 PMX.com (Twshitter) has now become the easiest medium for scammers to promote their scams. ~snip~Hasn't it always been like that? The new owner just raised it to an even higher level, considering that he managed to turn a company that was successful into a company that lost millions of users, so it should not be surprising that someone found one phishing link, there are certainly thousands of them. Although what is the difference between that platform and other social networks and communication applications that have essentially become tools for scammers and hackers who earn loads of money in a relatively easy way?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "December 03, 2023, 03:36:01 PM",
      "body": "Quote from: ScamViruS on December 02, 2023, 07:36:52 PMThe X.com advertising system makes it easier for scammers to reach more people with fake/phishing websites.Twitter allow scam advertisement because I believe they do not moderate scams anymore. Moreover, they do not censor the linking to mixers as well. But If you have noticed the recent development, our beloved BitcoinTalk which is supposed to give full freedom of speech is now censoring mixers. Admin afraid, the forum might get seized for linking to the mixers. What about social media like Twitter and Facebook? Aren't those platforms more centralized and more censored than BitcoinTalk? Sorry for the off-topic mate. As you know, these platforms do not care about anything except for money. If you pay for the advertisement, no matter what are you advertising. You are allowed to promote anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "December 03, 2023, 03:41:53 PM",
      "body": "I am not surprised to see this, because social media has been a medium nowadays for scammers to socialize with their victims and lure them into their scam trick with offers that are too good to be real. X own has increased significantly, after Elon took over the company.It is better to avoid any link on social media that you don't trust and stay away from platforms that offers big returns for a tax that is asked of you to carry out because they are scammers and don't get carried away with greed because there is no get rich quick scheme that is real. Don't fall for them as your safety is in your own hands",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "December 03, 2023, 04:31:09 PM",
      "body": "I stopped using Twitter AKA X, a long time ago because of this reason. Before the takeover of Twitter by Elon, it was somehow still usable. But after Elon took control, everything changed. Fake phishing fraudulent promotional message notifications skyrocketed. Every day, I would get suggestions from random crypto projects, giveaways, airdrops, etc. Every single day. Twitter doesn't even verify whether the ads are real or fake. So annoying. Later, I thought FCUK Twitter. I won't use it anymore.It would have been better if you hadn't directly posted the links directly. We humans have an urge or tendency to do the unthinkable. We don't listen. This curiosity might harm us one day. At least edit it, so that it doesn't show as hyperlinked or clickable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 03, 2023, 05:06:40 PM",
      "body": "Social media is a channel where most scammers and hackers drop some phishing links, and those social media sites don't seem to filter out some of those posts all the time. I don't think this is anything new; even when Twitter was not yet with the name X, this sort has been posted there before, and I believe that even if someone takes their time to look through other social media like Facebook, There are some Facebook posts you will come across, and if you open the comment section, you will see most of those phishing links.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 03, 2023, 06:22:36 PM",
      "body": "Twitter x is the worst place to click a link or even follow any promotion that just pump up and twitter doesn't restricts those scammers why because they are the center for scamming people. This is what made me to reduce my interest to use twitter as a matter of fact the rate of scam is increasing every day by day so newbie should be alert of whatever they clicked.Media like X should be a place to avoid due to fake information and scam link",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}