{
  "id": "topic_5450776",
  "title": "btcpepa04",
  "author": "btcpepa04",
  "created_time": "May 01, 2023, 02:29:46 AM",
  "content": "هل يمكنني ان احذف feedback negative هل يمكنني المواصلة من هذا الحساب او لا أمل في ذللك لتغيير الابلاغات الحمراء التي علا حسابي الحمراء من اجل كسب ثقة الاعضاء",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450776",
  "comments": [
    {
      "author": "GxSTxV",
      "created_time": "May 26, 2023, 11:25:31 AM",
      "body": "اضن ان العديد من الاعضاء قاموا بتوضيح الامر من قبل حول هذا الامر و مع الاسف الطريقة الوحيدة لحذف الثقة السلبية من حسابك هي عن طريق التواصل مع العضو الذي قام بوضع تلك الثقة في حسابك لانه يعتبر عضو DT1 او DT2 واقناعه بانك اما لست مخطئًا واعطائه الادلة الكافية واما ان تقنعه بانك سوف تتغير الى الافضل ولن تعيد الخطأ لكن حسب حالتك من الافضل ان تبدا من جديد وتتعلم الدرس ولكسب ثقة المجتمع يجب ان تقدم فائدة للاعضاء من مواضيع مفيدة او مساعدة الاعضاء . وانت الان بدأت بالخطوة الاولى وهي محاولة التغير الى الافضل بالتوفيق لك اخي الفاضل",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 03, 2023, 09:49:30 PM",
      "body": "ليس سهلاً حذف العلامات الحمراء على حسابك و لكن في حالة كانت لديك الرغبة يمكنك المواصلة مع الأعضاء الذين قاموا بترقيم حسابك كما وضح لك الأخ @GXSTXV و إقناعهم ربما ستكون لديك فرصة لتفادي المشكلة كما أنصحك إذا تم تحسين وضعية حسابك يجب عليك أن لا تكرر الأفعال التي تسببت لك في المشكلة.الحل الثاني الذي قدمته لا أعتقد أنه سيكون مفيداً لأنه سيتم كشفه مع مرور الوقت. أتمنى أن تنجح في تحسين وضعيتك و الإستمرار لأطول فترة.كدت أنسى أخي يجب عليك الإطلاع على قوانين المنتدى لتفادي المشاكل في المستقبل المرجو تقبل مروري",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 03, 2023, 10:14:03 PM",
      "body": "Quote from: btcpepa04 on May 01, 2023, 02:29:46 AMهل يمكنني ان احذف feedback negative هل يمكنني المواصلة من هذا الحساب او لا أمل في ذللك لتغيير الابلاغات الحمراء التي علا حسابي الحمراء من اجل كسب ثقة الاعضاءبالتأكيد هذا ممكن و لكن بطريقة واحدة و هي ان يقتنع الاعضاء الذين وضعوا لك تقييما سلبيا بمراجعة تقييماتهم و طبعا لهم القرار الأخير في قرارهم الاخير خصوصا ان تقييماتهم مبنية على اسباب منطقية. السؤال هو كيف يمكنك ان تقنع هؤلاء الاعضاء؟ لن يجدي ان نفعا ان تتصل بكل منهم و تستجدي عطفه ان يشفق عليك لانهم بالتأكيد لا يتأثرون بكل ذلك (ليس فقط اعضاء Dt1 و Dt2 بل اي عضو اخر ترك لك تقييما سلبيا).الوسيلة الوحيدة لاقناعهم هي بان تثبت لهم بانك شخص نزيه و ان وجودك هنا على المنتدى هو بغاية الافادة و الاستفادة من خلال نشر مواضيع مفيدة و مساعدة الاخرين و العمل على دعم المنتدى عموما، سيكون هذا صعبا قليلا ان لم يكن لديك ما تقدمه و هنا سيلزمك وقت اكثر لتتعلم اشياء مفيدة لتقوم بمشاركتها فيما بعد. هذا حل نسبي لانه لا شيء يضمن ان كل الاعضاء سيقتنعون بنزاهتك خصوصا ان الادانات الموجهة اليك سيئة للغاية مثل طلبك لقروض بدون ضمانات.لن ينفعك ان تنسى هذا الحساب و تنشأ حسابا اخر اذا كنت نفس الشخص بنفس العادات السيئة التي تسببت في فقدانك لثقة الاخرين على حسابك الحالي. انصحك بمواصلة استخدام هذا الحساب و ان تعبر عن حسن نواياك بعد تتوقف عن كل العادات السيئة التي كنت تقوم بها و الأكيد ان هناك من سيدعمك.لو تلاحظ فان هناك العديد من الاعضاء الجيدين و لديهم تقييمات سلبية بسبب اخطاء قاموا بها اثناء مسيرتهم. لم يستسلموا و لم ينشؤوا حسابات جديدة و واصلوا مشوارهم هنا و فعلا وجدوا دعما من اعضاء اخرين بما فيهم مديروا حملات قبلوا بضمهم الى حملات يديرونها لاقتناعهم انهم اعضاء جيدون بالرغم من الاخطاء التي ارتكبوها.أتمنى فعلا انك اعتبرت مما حصل لك و انك اخذت الدرس.أدعوك لمراجعة قوانين المنتدى و ان يكون نشاطك في حدود تلك القوانين.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}