{
  "id": "topic_5448430",
  "title": "AHOYBRAUSE",
  "author": "AHOYBRAUSE",
  "created_time": "April 11, 2023, 05:11:10 PMLast edit: April 12, 2023, 04:01:59 AM by AHOYBRAUSE",
  "content": "Ridiculous what new members do here.I saw this thread https://bitcointalk.org/index.php?topic=5448272.msg62070214#msg62070214 and a ask of new user \"Carius\" in the lending thread of Shasan.Since it was the perfect fit I sent him a message that its maybe interesting for him.No reply but a red tag accusing me to be Carius.I have a positive lending history with Shasan, without collateral, why would I do something like this? Also I am in a signature campaign.Anyway, here is what I wrote him where as a result he tagged me, what a joke.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448430",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 11, 2023, 09:20:26 PM",
      "body": "1. It's bad feedback IMOCryptoHFs is acting on suspicion. I don't think we should be leaving people feedback just based on suspicion. There needs to be more than enough concrete evidence connecting the accounts.I see you (CryptoHFs) are still new here, but if you go on leaving unnecessary or inaccurate feedback. Members won't trust your judgment here, and they will end up excluding you in their trustlists.\"Potential ALT\": Carlus... What is Potential ALT? You are not even sure they are alt accounts.2. OP avoid sending people unsolicited PMs. It's better you refer people using threads if you want to help. If not. Just ignore, if they have the brain to use the search button, they get what they want.There's too much paranoia on the internet, so some people won't believe you were only trying to help.3. OP, stop impulsively leaving retaliatory feedback, It defeats the purpose of you opening this thread complaining about bad feedback. Let the members guide if you are not sure about what happened",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "April 11, 2023, 11:57:53 PM",
      "body": "Quote from: CryptoHFs on April 11, 2023, 11:48:36 PMwas the slogan ...Bitcoin_Arena gave you both a good observation of where you are going wrong and what you need to correct. Considering that you get burned out and it seems fun, you go to the distrust list for a reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 12, 2023, 12:02:09 AMLast edit: April 12, 2023, 12:33:25 AM by CryptoHFs",
      "body": "Quote from: examplens on April 11, 2023, 11:57:53 PMQuote from: CryptoHFs on April 11, 2023, 11:48:36 PMwas the slogan ...Bitcoin_Arena gave you both a good observation of where you are going wrong and what you need to correct. Considering that you get burned out and it seems fun, you go to the distrust list for a reason. i dont care about lists. however, i am interested in knowing if he loves arch enemy.the admin deleted the other two comments",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "April 12, 2023, 01:07:59 AM",
      "body": "Both of you are in the wrong here. Tagging someone as a suspected alt is not right as people have already stated, but retaliating with feedback isn't correct either. As far as I see it both need a ~ for now until you can show people to trust your feedbacks. AHOYBRAUSE what you did does seem pretty suspect. Noone asked you to do them a favor did they? You created this mess by sending the message, and you continue to feed the fire by leaving the retaliatory feedback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "April 12, 2023, 03:22:41 AMLast edit: April 12, 2023, 04:05:26 AM by AHOYBRAUSE",
      "body": "Quote from: yahoo62278 on April 12, 2023, 01:07:59 AMBoth of you are in the wrong here. Tagging someone as a suspected alt is not right as people have already stated, but retaliating with feedback isn't correct either. As far as I see it both need a ~ for now until you can show people to trust your feedbacks. AHOYBRAUSE what you did does seem pretty suspect. Noone asked you to do them a favor did they? You created this mess by sending the message, and you continue to feed the fire by leaving the retaliatory feedback. See what I mean, what is CryptoHFs even talking about, enemy what? I don't even know you.I left the feedback because he didn’t reply when I kindly asked him to clear this up. He just ignored me. I thought this would bring him to his senses and finally reply. Also I want this thread to be linked in my feedback so that people can see what his bs tag is about, there was no other way. If he does this abuse to me he will do it to others.From now on I will stay away from doing possible favors. I only did this because I saw his thread and later the other post and I remembered the first once. Never saw this kind of deal before and thought it was a perfect fit. I thought in a community people can help each other out, guess I am wrong. Anyway, my feedback with the link to this thread stays until he comes to his senses, what I unfortunately don't see since he acts like a strange person.Edit: He removed it and so will I , will lock this thread for now and will also be more \"careful\" with what I think is a kind gesture. Thanks for all the input.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}