{
  "id": "topic_5428465",
  "title": "gantez",
  "author": "gantez",
  "created_time": "December 14, 2022, 07:10:38 AMLast edit: December 14, 2022, 08:57:30 AM by gantez",
  "content": "Messi is now close to grab the world cup glory adding to his name and trophy he have to himself like most of the greatest footballers that passed this place, the earth. Like Maradona in 1986 world cup and many other big player. Messi won't be happy if he will lose the second and last chance to add the world cup trophy in his name. He has the first chance in the finals in 2014 but Germany denied it.Is he going to fight against Moroccans or the French side but I know he is going to really fight for it because this is his very last chance to win the greatest of the football trophy. Image",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428465",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "December 14, 2022, 07:40:53 AM",
      "body": "I don't watch much soccer, or really any to be honest, but I have been paying a little bit of attention to the modern day GOAT talk between Cristiano Ronaldo & Lionel Messi.  My understanding is that if Lionel Messi wins this World Cup, he'll have a damned good argument at being the GOAT over Cristiano Ronaldo.  I'm sure it isn't that black and white, and no matter what happens there will always be doubters, but from my perspective I think Lionel Messi will be the GOAT (of modern soccer) if he is able to win this World Cup.  I'm hoping he can pull it off.  I like a good legacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "December 14, 2022, 10:44:44 AM",
      "body": "Quote from: gantez on December 14, 2022, 07:10:38 AMMessi is now close to grab the world cup glory adding to his name and trophy he have to himself like most of the greatest footballers that passed this place, the earth. Like Maradona in 1986 world cup and many other big player. Messi won't be happy if he will lose the second and last chance to add the world cup trophy in his name. He has the first chance in the finals in 2014 but Germany denied it.Is he going to fight against Moroccans or the French side but I know he is going to really fight for it because this is his very last chance to win the greatest of the football trophy. ImageThough everyone aspires to do so, not everyone will succeed. Good for Argentina if they perform well in the finals. But if Messi plays in two World Cup finals without taking home the trophy, it will be disastrous. If France make it to the finals, I see France winning it once more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "December 14, 2022, 10:55:33 AM",
      "body": "Quote from: gantez on December 14, 2022, 07:10:38 AMMessi is now close to grab the world cup glory adding to his name and trophy he have to himself like most of the greatest footballers that passed this place, the earth. Like Maradona in 1986 world cup and many other big player. Messi won't be happy if he will lose the second and last chance to add the world cup trophy in his name. He has the first chance in the finals in 2014 but Germany denied it.Is he going to fight against Moroccans or the French side but I know he is going to really fight for it because this is his very last chance to win the greatest of the football trophy.It's going to be the icing on the cake for Messi he is considered the greatest football player of the new generation, and this is the only one missing in his illustrious career, we all get surprised when Qatar beat them in the opener but it turned out to be a blessing in disguise, now look at them they are on the finals waiting for their competitor to the crown, I'm sure Messi will deliver when it matters the most in the final game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 14, 2022, 11:07:50 AM",
      "body": "Messi deserves it as Argentina was stellar yesterday especially in the second half and thanks to him who scored a penalty and assisted Alvarez in the other two goals,he is a great player,he disorient the opponents and thus making room for the Argentinian attackers to show their skills and he even in most of the cases as I said provides great assists to the attackers.It is up to him now to bring for the second time the World Cup in Argentina as Maradona did in 1986 and nearly missed again in 1990 in the final.France is most likely going to be the opponent,a strong one but surely not as strong as this Argentinian side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirJohnVonSlotty",
      "created_time": "December 14, 2022, 11:10:10 AM",
      "body": "I felt really bad for Croatia, but their approach was simply not aggressive enough. Argentina didn't deserve the penalty, but they did deserve the win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "December 14, 2022, 11:21:27 AM",
      "body": "How can Lionel Messi still be like this, and this 35 year old man still has extraordinary appearance and talent in playing football, unlike Ronaldo and Neymar, his appearance is different from Messi when on the field, especially in providing assists and also scoring goals.Messi will have the chance to win the golden ball, golden boot and trophy that will dispel any doubts about the identity of the greatest player of all time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "December 14, 2022, 11:21:51 AM",
      "body": "If Lionel Messi win's the world cup, it will be the most important trophy to him as a footballer, because that's a trophy he has not lifted before,and he deserves it, years back, the Argentina fans use to abuse  him of not caring for his country that he always playing well at club level Barcelona, they even call him Spaniard, he took his country to the 2014 and lost at the finals to Germany, I think this second Chance he got he deserves to win it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "December 14, 2022, 11:33:34 AM",
      "body": "Quote from: gantez on December 14, 2022, 07:10:38 AMMessi is now close to grab the world cup glory adding to his name and trophy he have to himself like most of the greatest footballers that passed this place, the earth. Like Maradona in 1986 world cup and many other big player. Messi won't be happy if he will lose the second and last chance to add the world cup trophy in his name. He has the first chance in the finals in 2014 but Germany denied it.Is he going to fight against Moroccans or the French side but I know he is going to really fight for it because this is his very last chance to win the greatest of the football trophy.Messi is down to one last game to establish himself as the GOAT of modern soccer it doesn't matter who they are going to face, if they are really the best team right now he'll beat whoever they meet in the final, the Argentinian will be the favorite here no doubt it, the Argentinian has been to a lot and the other member of the team knows this is not only for their country but of their best players as well Messi, this is going to be the most watched telecast in this Cup because even those who are not into soccer will watch if Messi will finally win himself a World Cup, I'm not a big fan of football but the drama since day one made me watch how Argentina landed in the finalsFor those who missed this is how Argentina landed in the finalsWorld Cup 2022: Argentina's route to final explained",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 14, 2022, 11:49:59 AM",
      "body": "Dude is already a legend in football even if he doesn't get the trophy this world cup, but it will certainly be a nice addition to his legacy if he were to win it all to his name and to their team as well. Whichever team they face, for sure that team will do their best to not let Messi win, and at the same time bring pride and joy to their home country as well. We're lucky we've witnessed Messi go from a relatively unknown player up until his peak and we're enjoying it til now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "December 14, 2022, 11:51:56 AM",
      "body": "Quote from: bitzizzix on December 14, 2022, 11:21:27 AMHow can Lionel Messi still be like this, and this 35 year old man still has extraordinary appearance and talent in playing football, unlike Ronaldo and Neymar, his appearance is different from Messi when on the field, especially in providing assists and also scoring goals.Messi will have the chance to win the golden ball, golden boot and trophy that will dispel any doubts about the identity of the greatest player of all time.Egyptian goalkeeper Essam El-Hadary is the oldest footballer to play at the men’s FIFA World Cup ==> 45 years, 161 days   .... so Messi is still young at 35 years. Messi played against Luka Modrić ...age 37 last night..... so he was not the oldest on the field. In any way.... I think Messi will hang up his boots after this Wold Cup.... he is walking most of the time..and he is not as fast as he used to be. (in my opinion)  edit : https://www.cnbctv18.com/sports/lionel-messi-confirms-international-retirement-post-fifa-world-cup-2022-15417461.htm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fennic",
      "created_time": "December 14, 2022, 12:06:44 PM",
      "body": "Quote from: gantez on December 14, 2022, 07:10:38 AMMessi is now close to grab the world cup glory adding to his name and trophy he have to himself like most of the greatest footballers that passed this place, the earth. Like Maradona in 1986 world cup and many other big player. Messi won't be happy if he will lose the second and last chance to add the world cup trophy in his name. He has the first chance in the finals in 2014 but Germany denied it.Is he going to fight against Moroccans or the French side but I know he is going to really fight for it because this is his very last chance to win the greatest of the football trophy. ImageMessi is a good player though as he is 36 years old and still he made history. I was talking on telegram and where a a guy from Argentina said that they love Messi as A god. I do not know that how Kuch craze is for this person. And also there are high chances that they might win This year Football cup. It would be super great if they win world cup with Messi hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boltz",
      "created_time": "December 14, 2022, 12:27:11 PM",
      "body": "Closer than ever if I could say that!  More than this , Argentina has a dream squad right now and everyone seems to bring a plus to their game and also it seems that everyone can be decisive from this squad + Messi is on godlike mode on both dribbling but also assisting and shooting. I'm also happy that we saw Dybala for a couple of minutes.If somehow Messi won't win World Cup in Qatar , it will be just because France is better than them because I doubt luck will play a role in the final. There is also the chance that Marocco will eliminate France and move into finals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 14, 2022, 12:54:50 PM",
      "body": "Quote from: boltz on December 14, 2022, 12:27:11 PMThere is also the chance that Marocco will eliminate France and move into finals.I think this will be going on in the side of Argentina also. They will feel it that Morocco can be cheaper for them during the final than for them to go through France. Morocco also when you look the record to get to play in semi final has beat tough country too like Portugal and Spain, France can join and Argentina losing in the last match with them is not impossible in football.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "December 14, 2022, 01:15:36 PM",
      "body": "Quote from: OgNasty on December 14, 2022, 07:40:53 AMI don't watch much soccer, or really any to be honest, but I have been paying a little bit of attention to the modern day GOAT talk between Cristiano Ronaldo & Lionel Messi.  My understanding is that if Lionel Messi wins this World Cup, he'll have a damned good argument at being the GOAT over Cristiano Ronaldo.  I'm sure it isn't that black and white, and no matter what happens there will always be doubters, but from my perspective I think Lionel Messi will be the GOAT (of modern soccer) if he is able to win this World Cup.  I'm hoping he can pull it off.  I like a good legacy. It's going to be a great legacy for Messi, but speaking of who's the GOAT is? it's gonna be a long one coz there's a lot to be considered. With Messi and Ronaldo on the line there are great players that lifted their team winning world cup which is the biggest league for football, and neither of them have won a single world cup. In comparison, Ronaldo may be better than Messi given his stats on each league he have played, plus he is the most influential person on instagram so he's the GOAT jk  While Messi is on the Finals of the world cup, that made Argentina proud of him. What a man!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "December 14, 2022, 01:34:50 PM",
      "body": "Quote from: Pierre 2 on December 14, 2022, 12:30:37 PMI feel like he will not pass this chance and gonna strike bullseye this cup. I wish Moroccans would beat France so Messi can help Argentina beat Morocco. France is very tough team to crack even for Messi. Or whole Argentina team. I really want Messi to achieve his World Cup dream this tournament. I believe he will be counted as one of the best football players in whole football history. But he needs world cup to be counted among legends.I go with your view that an Argentina vs France Final will be tougher to through for messi than Morocco. Morocco might have beaten favourites to get to this point but I don't see them edging pass Argentina should they progress to the final. France on the other hand will prove a test too much for Argentina in the final. Concerning the legendary status I think messi is already a legend regardless of how the final turns out. He has won seven player of the year award that already is legendary. But wining the most prestigious trophy will only cement his title as the Greatest of all time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "December 14, 2022, 01:36:56 PM",
      "body": "something very funny is that messi has 5 goals and mbappe also has 5 goals, if mbappe scores more goals in the game against morocco then he will become the best scorer of this world cup, that in itself would already take a position that it would be for messi, as if that wasn't enough, if franca also wins in the game against morocco, something i believe franca will beat morocco, then we will have france in the final against argentina, soon we will have messi against mbappe, that if franca beats argentina then mbappe beat messi, that's something pretty funny, despite that these two players are teammates at psg, the two are disputing the title of top scorer in the world cup and also who will win the world CupQuote from: Twentyonepaylots on December 14, 2022, 01:15:36 PMQuote from: OgNasty on December 14, 2022, 07:40:53 AMI don't watch much soccer, or really any to be honest, but I have been paying a little bit of attention to the modern day GOAT talk between Cristiano Ronaldo & Lionel Messi.  My understanding is that if Lionel Messi wins this World Cup, he'll have a damned good argument at being the GOAT over Cristiano Ronaldo.  I'm sure it isn't that black and white, and no matter what happens there will always be doubters, but from my perspective I think Lionel Messi will be the GOAT (of modern soccer) if he is able to win this World Cup.  I'm hoping he can pull it off.  I like a good legacy. It's going to be a great legacy for Messi, but speaking of who's the GOAT is? it's gonna be a long one coz there's a lot to be considered. With Messi and Ronaldo on the line there are great players that lifted their team winning world cup which is the biggest league for football, and neither of them have won a single world cup. In comparison, Ronaldo may be better than Messi given his stats on each league he have played, plus he is the most influential person on instagram so he's the GOAT jk  While Messi is on the Finals of the world cup, that made Argentina proud of him. What a man! ronaldo's bad performance this last season has placed him as a player with few results and not very popular when it comes to having many results, while messi is still popular due to the good results, nowadays for example many teams would want messi if he left PSG, but cristiano ronaldo is without a team and nobody wants him, this is due to the fact that ronaldo is not giving good results, see that ronaldo does not even appear in the list of the 10 best scorers of this world cup, because ronaldo failed to score many goals",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "December 14, 2022, 01:59:05 PM",
      "body": "Finally, if messi will able to win the trophy and it will give us an answer about which was the best between messi and ronaldo. The world cup will make messi one step ahead ronaldo. If argentina will be losing in the final and then the debate between messi and ronaldo fans will still continue. I hope that messi will perform like last match against croatia. He deserves the world cup trophy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "December 14, 2022, 02:04:43 PM",
      "body": "The whole world is wishing Messi to win his first World Cup of course he is already a legend because of what he achieved in the past but a World Cup title is something any footballer and country wants to have I'm sure this is something Messi wanted badly and he could get this the way he and the team play, France or Morocco they'll win the Cup, I'm going to watch this final game even though I'm not a football fan, as our country is not Football crazy nation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pungopete468",
      "created_time": "December 14, 2022, 03:41:10 PM",
      "body": "Messi is a renewed football player around the globe, and that alone is a dream that every player will be happy to achieve as a result of their passion and hard work. Although this recognition will really make an impact on the image and background of Messi, I firmly believe that his legacy is already established and will never be replaced or changed based on any awards. But, at the end of the day, having this award will surely add up to his many achievements which would not only make him happy but his fans as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}