{
  "id": "topic_5466048",
  "title": "Jonn Tomson",
  "author": "Jonn Tomson",
  "created_time": "September 07, 2023, 08:42:19 PMLast edit: September 08, 2023, 11:41:02 AM by Jonn Tomson",
  "content": "Good evening gentlemen and ladies.  Welcome to our website.  We have cool games for you: Crash, Dice, Roulette. You will be in a good shock from the bonuses and winnings. Cool bonuses, 24/7 support, 24/7 great gaming fun and a pleasant atmosphere.https://999luckydice.comWe have absolutely no connection to the owners of 999dice. We are completely different people, and we are newcomers to this sphere!!!if you have any questions you can ask them but there is no need for accusations when you do not play with us.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466048",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "September 07, 2023, 08:51:24 PM",
      "body": "Welcome,  but first you have to put up a professional ANN thread if you are the owner of the project,  and also instead of sharing a screenshot why not post the link to your website and let members who are willing to see you site could visit. More also you have to purchase a copper member account to be able to post some other content that is limited to your current rank, If you want to promote your casino here take those steps to improve your presence here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 07, 2023, 09:38:11 PM",
      "body": "At first, I will welcome you as a newbie here but this casino you have mentioned already have an announcement thread or is this one different from the other? There are lots of pending cases and questions waiting for answer from your casino. If I may ask you, are you a representative or a team member? It is expected that you continue with your old thread rather than spamming the platform with various announcement thread to one casino. The platform frowns at Such .You can check out for yourself.Old announcement thread https://bitcointalk.org/index.php?topic=386238.0Another announcement thread.https://bitcointalk.org/index.php?topic=5465217.msg62775401#msg62775401https://bitcointalk.org/index.php?topic=386238.msg58840470#msg58840470From the looks, I think they are just abandoning the threads for another which is resulting to spamming of this platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "September 07, 2023, 09:50:21 PM",
      "body": "Welcome to the forum.This might not be your first time to the forum but I still have to welcome you officially. If you want to make your ANN thread appealing and attractive to the forum members, you can purchase a copper membership title to enable you post images. Alternatively you can hire a designer to create an ANN thread for you.Meanwhile, arw yoy Jakem or MrLen?I asked because these persons have opened a thread concerning 999casino here in the foeum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jonn Tomson",
      "created_time": "September 07, 2023, 10:01:34 PM",
      "body": "Quote from: Zoomic on September 07, 2023, 09:50:21 PMWelcome to the forum.This might not be your first time to the forum but I still have to welcome you officially. If you want to make your ANN thread appealing and attractive to the forum members, you can purchase a copper membership title to enable you post images. Alternatively you can hire a designer to create an ANN thread for you.Meanwhile, arw yoy Jakem or MrLen?I asked because these persons have opened a thread concerning 999casino here in the foeum.We have absolutely no connection to the owners of 999dice. We are completely different people, and we are newcomers to this sphere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 07, 2023, 11:36:18 PM",
      "body": "with the tough competition on this business, the team should step up on their services. as a newcomer, we will see if you will hear people's opinion or suggestions to gain players in your site.the OP or their rep should look around this board to learn how to properly introduce their site to the community here. the site says it is under maintenance, so they should not accept any deposit for the moment. and those potential players should not deposit as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "markk1",
      "created_time": "September 08, 2023, 01:50:37 AM",
      "body": "Be careful! In the chat of the casino players the system displays messages about the withdrawal and how much was the withdrawal - this is a 100% fake. Avoid this casino. Such casinos do not have licenses. Also, such casinos can manipulate the RTP. If in doubt, check for a license. Good luck to all!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 08, 2023, 03:17:21 AM",
      "body": "So basically you bought the domain and started your new business? Nevertheless welcome to the forum. The announcement thread could have been better. I mean you could have visited other people’s Ann thread and could have taken inspiration on how to start an ANN thread. Moreover I don’t see any great features in your site. If you could have mentioned more information about the games and sites here in the ANN, then it would have been great. Nevertheless let’s see what promotions you bring for us in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "September 08, 2023, 03:37:05 AM",
      "body": "Quote from: Jonn Tomson on September 07, 2023, 10:01:34 PMQuote from: Zoomic on September 07, 2023, 09:50:21 PM-----We have absolutely no connection to the owners of 999dice. We are completely different people, and we are newcomers to this sphere.Confirmed by the previous user MrLen who created the same thread as you made which is about 999luckydice. So what is your connection to MrLen? If you both are from official part of 999luckydice, why do you need to create 2 different thread with 2 different account? Even worse, both thread are so bad, but I'm not surprised since the casino itself has many red flags as pointed out by some users in the thread created by MrLen. Can you give reasonable argument to those red flags? Or will be there another new thread by new user once this thread is full of questions about the red flags in your casino?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 08, 2023, 04:00:08 AM",
      "body": "I am certainly not going to deposit a single satoshi on that site. Too many suspicious points: two different newbies claiming to have nothing to do with the casino, bothering to promote it on the forum, a casino created in the last month, and then we have this:Quote from: markk1 on September 08, 2023, 01:50:37 AMBe careful! In the chat of the casino players the system displays messages about the withdrawal and how much was the withdrawal - this is a 100% fake. Avoid this casino. Such casinos do not have licenses. Also, such casinos can manipulate the RTP. If in doubt, check for a license. Good luck to all!When there's smoke there's fire, you know.Stay away from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 08, 2023, 05:07:16 AM",
      "body": "Quote from: Don Pedro Dinero on September 08, 2023, 04:00:08 AMI am certainly not going to deposit a single satoshi on that site. Too many suspicious points: two different newbies claiming to have nothing to do with the casino, bothering to promote it on the forum, a casino created in the last month, and then we have this:Quote from: markk1 on September 08, 2023, 01:50:37 AMBe careful! In the chat of the casino players the system displays messages about the withdrawal and how much was the withdrawal - this is a 100% fake. Avoid this casino. Such casinos do not have licenses. Also, such casinos can manipulate the RTP. If in doubt, check for a license. Good luck to all!When there's smoke there's fire, you know.Stay away from it.I have nothing against new business like that which want to get their share in the market, while we all know that there are more serious platforms who have been used for a while and tested by other people before, so going there is less risky. But who knows, other great casinos started from draft also, so I agree with you that at this initial stage it can be better to avoid deposits in newly created services, but we should follow it up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 08, 2023, 05:20:59 AM",
      "body": "Quote from: Porfirii on September 08, 2023, 05:07:16 AMQuote from: Don Pedro Dinero on September 08, 2023, 04:00:08 AMI am certainly not going to deposit a single satoshi on that site. Too many suspicious points: two different newbies claiming to have nothing to do with the casino, bothering to promote it on the forum, a casino created in the last month, and then we have this:Quote from: markk1 on September 08, 2023, 01:50:37 AMBe careful! In the chat of the casino players the system displays messages about the withdrawal and how much was the withdrawal - this is a 100% fake. Avoid this casino. Such casinos do not have licenses. Also, such casinos can manipulate the RTP. If in doubt, check for a license. Good luck to all!When there's smoke there's fire, you know.Stay away from it.I have nothing against new business like that which want to get their share in the market, while we all know that there are more serious platforms who have been used for a while and tested by other people before, so going there is less risky. But who knows, other great casinos started from draft also, so I agree with you that at this initial stage it can be better to avoid deposits in newly created services, but we should follow it up.Well, trusting a new casino may not be so risky if the casino starts with genuine beginning but if we look closely at this site then it can be easily known that they are using fake statistics to grab players which isn't a good sign in my eyes. The fake statistics are mostly promoted by scam casinos because they only know the skill to grab gamblers and they don't really work on advertisement or anything else. The OP of the past also confessed that he isn't the owner of the casino and has no connection with the real owner of the site. All of those signs show that the casino is there to scam the users and if anyone deposits in a casino like that then he/she may lose the money that he/she has deposited on that site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "September 08, 2023, 05:21:12 AM",
      "body": "Quote from: Jonn Tomson on September 07, 2023, 08:42:19 PMGood evening gentlemen and ladies.  Welcome to our website.  We have cool games for you: Crash, Dice, Roulette. You will be in a good shock from the bonuses and winnings. Cool bonuses, 24/7 support, 24/7 great gaming fun and a pleasant atmosphere.welcome to the forum guys.But don't you have enough budget or at least digging how to provide a legit looking thread? because this seems to be a not a serious advertising promising good return but not providing decent ANN Thread.QuoteWe have absolutely no connection to the owners of 999dice. We are completely different people, and we are newcomers to this sphere!!!and why deny this from the beginning when your site name is far different from 999dice? sounds have some guilt from that clarification when there are no even one that asks you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jonn Tomson",
      "created_time": "September 08, 2023, 11:23:00 AM",
      "body": "Quote from: Reatim on September 08, 2023, 05:21:12 AMQuote from: Jonn Tomson on September 07, 2023, 08:42:19 PMGood evening gentlemen and ladies.  Welcome to our website.  We have cool games for you: Crash, Dice, Roulette. You will be in a good shock from the bonuses and winnings. Cool bonuses, 24/7 support, 24/7 great gaming fun and a pleasant atmosphere.https://999luckydice.comwelcome to the forum guys.But don't you have enough budget or at least digging how to provide a legit looking thread? because this seems to be a not a serious advertising promising good return but not providing decent ANN Thread.QuoteWe have absolutely no connection to the owners of 999dice. We are completely different people, and we are newcomers to this sphere!!!and why deny this from the beginning when your site name is far different from 999dice? sounds have some guilt from that clarification when there are no even one that asks you?here people say that we are related to 999Dice because we have a similar domain we are not affiliated with 999Dice in any way we are different people!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jonn Tomson",
      "created_time": "September 08, 2023, 11:32:10 AM",
      "body": "Quote from: Bitinity on September 08, 2023, 03:37:05 AMQuote from: Jonn Tomson on September 07, 2023, 10:01:34 PMQuote from: Zoomic on September 07, 2023, 09:50:21 PM-----We have absolutely no connection to the owners of 999dice. We are completely different people, and we are newcomers to this sphere.Confirmed by the previous user MrLen who created the same thread as you made which is about 999luckydice. So what is your connection to MrLen? If you both are from official part of 999luckydice, why do you need to create 2 different thread with 2 different account? Even worse, both thread are so bad, but I'm not surprised since the casino itself has many red flags as pointed out by some users in the thread created by MrLen. Can you give reasonable argument to those red flags? Or will be there another new thread by new user once this thread is full of questions about the red flags in your casino? We want more people to know about our site, we are now trying to use more advertising",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jonn Tomson",
      "created_time": "September 08, 2023, 11:39:08 AM",
      "body": "Quote from: AmoreJaz on September 07, 2023, 11:36:18 PMwith the tough competition on this business, the team should step up on their services. as a newcomer, we will see if you will hear people's opinion or suggestions to gain players in your site.the OP or their rep should look around this board to learn how to properly introduce their site to the community here. the site says it is under maintenance, so they should not accept any deposit for the moment. and those potential players should not deposit as well.When we have technical work, we disable deposits and withdrawals you not try do deposits and not see it and write it why you not see all for site and write it's not serious",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 08, 2023, 02:47:54 PM",
      "body": "Quote from: Jonn Tomson on September 08, 2023, 11:39:08 AMQuote from: AmoreJaz on September 07, 2023, 11:36:18 PMwith the tough competition on this business, the team should step up on their services. as a newcomer, we will see if you will hear people's opinion or suggestions to gain players in your site.the OP or their rep should look around this board to learn how to properly introduce their site to the community here. the site says it is under maintenance, so they should not accept any deposit for the moment. and those potential players should not deposit as well.When we have technical work, we disable deposits and withdrawals you not try do deposits and not see it and write it why you not see all for site and write it's not seriousAt first, if you claim to not have any affiliation with the other casino why choose the same name or did you not do your research and findings before choosing a name for your casino? Ordinarily if you google a name online, if there are any such name it pops up and other related names pops up as well for you to have the knowledge that name already exists in a particular way but you went still come here to tell us you have no affiliation. Same way this thread was raised same way the other was raised as well. There is similarity in your presentation.Do well to quote replying all your response on one page rather than doing it one for one otherwise you will be tagged for spamming your thread as the forum frowns against it. If you claim to not have affiliation with any other  casino try to coordinate your announcement thread as it looks very poor otherwise seek the expertise of a reputable campaign manager to help you coordinate your announcement thread for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 08, 2023, 03:07:02 PM",
      "body": "Quote from: markk1 on September 08, 2023, 01:50:37 AMBe careful! In the chat of the casino players the system displays messages about the withdrawal and how much was the withdrawal - this is a 100% fake. Avoid this casino. Such casinos do not have licenses. Also, such casinos can manipulate the RTP. If in doubt, check for a license. Good luck to all!I think OP missed this one, This is a big concern he addresses about affiliation and domain he should refute this accusation if he wants to continue promoting their platform here, OP also admitted that they are newcomers in this sphere which is not good, it's hard when a new casino opened up here and their reputation is already in question.They have to double their time and be transparent in presenting their evidence that they are not a part of another questionable casino.I still recommend that they get a copper account if they want to stay here and continue promoting their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdzahed134",
      "created_time": "September 08, 2023, 03:11:54 PM",
      "body": "I think as a gambling site it seems very poor development, and site name is similar with 999dice, may be inspired from it. I see here showing game name and winner list, a lot of big wining as like some figure over 2k$, i don’t think it will be real because this is a new platform, so still no one will deposit big amount of money here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "September 08, 2023, 03:34:52 PM",
      "body": "Welcome to the forum. We keep seeing bunch of sites promoting themselves on the forum everyday but they have far better presentation of their casino. In many cases we can literally get 99% idea that what casino has to offer to their users. Whether it is game providers list, deposit and withdrawal methods, sponsors if any, promotions and new comer offers. You see that makes an excellent impression on the casino right from the beginning. Like I have myself felt many times to put some money into it and start playing right away. That feeling I did not get with your post and it is very important to be straight to the new comers. Hope so you will look at the different ANN and also make the changes accordingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}