{
  "id": "topic_5404490",
  "title": "smartaction",
  "author": "smartaction",
  "created_time": "June 29, 2022, 11:07:41 AM",
  "content": "I decided yesterday morning that I would buy 1 bitcoin from this dip market. But I did not have enough money.  With which I can buy 1 bitcoin. I had an Fixt Deposit of $ 6,000 in the central bank. And the bank would paying interest at the rate of 5.5% APR. I broke it down yesterday and decided to buy Bitcoin with that money. But with this money I will not be able to buy 1 bitcoin.  On the other hand, my dream and desire is to buy 1 bitcoin. I then decided to take a loan and applied to the bank for a loan. But I told the bank that I would use this money for business. The bank agreed to give me a loan of $10,000 at 10% APR interest. I take advantage of that opportunity and take out a loan. And the remaining $ 4,000 I borrowed from my uncle and promised to pay him 8% APR interest, which is more then bank interest. Finally i bought just now 1 BTC price at $20,000. It gives me a different feeling That feeling I have never had before. I think if I hold this bitcoin for 2 years I can get 100% -500% profit. Then I will be able to easily repay my debtors with an average interest of 18-19% in 2 years as an average of 9.something% APR and I will be able to keep a huge profit.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404490",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 29, 2022, 11:14:38 AM",
      "body": "Taking loans to buy a volatile asset is a dumb idea. Why not just buy in slowly using your hard-earned money from your job/business? You don't need to have 1 full bitcoin literally right now, it's not like the price is going to skyrocket overnight and that you're going to be left out.P.S. I hope you're using a hardware wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 29, 2022, 11:28:33 AM",
      "body": "Quote from: smartaction on June 29, 2022, 11:07:41 AMI find is an extremely risky move. Of course, it may pay off. But I hope that you have a backup plan in case bitcoin price doesn't go as expected in the next 2 years.And yes, make sure you have very safe means of storage for your newly acquired coins: hardware wallet or even safely (offline) generated seed or private key; and the backup/recovery should also be safe and offline.Best of luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sensimilia",
      "created_time": "June 29, 2022, 11:31:06 AM",
      "body": "This is a great story. I like investment in bitcoin every time. Now bitcoin price too low. It is drop around -70% from ATH. so, this is not bad idea to invest in bitcoin now. Good luck Op for take a high risk and bought bitcoin by borrowing money. Hope your dream will success. Since you want to hold it for a long time.  So use a hardware wallet to hold it. It will give your extra safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "June 29, 2022, 11:38:00 AM",
      "body": "Quote from: mk4 on June 29, 2022, 11:14:38 AMP.S. I hope you're using a hardware walletYes i am using Hardware Wallet. Since I'm holding a full of bitcoin.  And i bought it with borrowed money.  So I have to take care of it a lot. So I saved it in a hardware wallet. As if one is not stolen in any way. The rest is my luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "June 29, 2022, 11:45:43 AM",
      "body": "as @mk4 has already pointed out, this is a risky business even at the supposedly lower price...the general principle also applies to BTCitcoin: only invest money that you can do without.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 29, 2022, 01:04:46 PM",
      "body": "Good speculation to predict Bitcoin price will increase 100%-500% in the next 2 years, where's the solution if Bitcoin price will decline 50%-80% from the current price right now in the next 2 years? You need to think about this since there's no guarantee the market will goes like your prediction. I'm not a risk taker person, so all of my decision always have a risk that I can solve if my prediction goes wrong and yeah, I almost not regret with my decision since there's no risk that will ruin my life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 29, 2022, 01:13:07 PM",
      "body": "Yeah, wish you'd not done that. mk4 might be harsh but he's right, it's a dumb idea. Gold I'd agree, but even then 10% APR? You're heavily in debt now and gambling. I'd just liquidate, pay off the debts early and look this up:  Dollar Cost Average.Work hard, advance your career, live your life, and build up a Bitcoin savings with money leftover from salary. It's slower but with the next rally probably a couple of years away, you'll have a chance to get that 1 BTC easily.I mean, a bank actually allowed you to borrow $10k. That means you're earning well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "June 29, 2022, 01:15:34 PM",
      "body": "I also had this desire but I follow the first rules of trading and that is \"invest as much as you can afford to lose\". So this desire . But I can feel yours feeling that In the future you can say that you owned a bitcoin. It is also very risky, on the but it can also be profitable.  I hope you make a profit,  I also hope you don't have to be like Luna holders (sui ****), no offense please. After seeing this post, those who have awakened this desire this topic is for them:Quote from: Scripture on June 21, 2022, 05:32:27 AMBefore you apply for a loan make sure to consider this first.1. How much money you can afford to take the risk?2. Is the profit enough to repay the loan, is there any guarantee?3. Can you still repay the loan even if the market continues to drop?4. Is your collateral enough to cover your loans?5. Are you confident about your investment decision?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "June 29, 2022, 01:34:30 PM",
      "body": "While I give you credit for being courageous for loaning just to buy bitcoin. This is not really a good idea with those interest rates that you'll pay. But if you're able and you've got somewhere else to be spent for paying the loan with the interest and not just going to rely on the profit that you're expecting within the next years of projection with 1 bitcoin's profit, then that's better. But if you're going to rely on it, much better that you just did a DCA strategy rather than taking a loan to buy bitcoin. Still, anyway, good luck and hope to see you in the blooming days again and wishing you repay all of those debts of yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "June 29, 2022, 01:36:15 PM",
      "body": "You are a risky person, smartaction. You owe everyone you can to buy 1 bitcoin and this story gives me conflicting thoughts. Why were you willing to go into debt at high interest when you could buy parts of bitcoin as soon as free money appeared? Undoubtedly, bitcoin price is now cheap and this may continue for some time, which would allow you to gradually accumulate the amount of 1 bitcoin you want. I don't condemn you in any way and even consider your act commendable, because your faith in bitcoin is much higher than those who, even with money, still don't buy it in anticipation of a better price or other pretexts. I hope your act will be a reproach to such people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 29, 2022, 02:37:10 PM",
      "body": "Quote from: smartaction on June 29, 2022, 11:07:41 AMI decided yesterday morning that I would buy 1 bitcoin from this dip market. But I did not have enough money.  With which I can buy 1 bitcoin. I had an Fixt Deposit of $ 6,000 in the central bank. And the bank would paying interest at the rate of 5.5% APR. I broke it down yesterday and decided to buy Bitcoin with that money. But with this money I will not be able to buy 1 bitcoin.  On the other hand, my dream and desire is to buy 1 bitcoin. I then decided to take a loan and applied to the bank for a loan. But I told the bank that I would use this money for business. The bank agreed to give me a loan of $10,000 at 10% APR interest. I take advantage of that opportunity and take out a loan. And the remaining $ 4,000 I borrowed from my uncle and promised to pay him 8% APR interest, which is more then bank interest. Finally i bought just now 1 BTC price at $20,000. It gives me a different feeling That feeling I have never had before. I think if I hold this bitcoin for 2 years I can get 100% -500% profit. Then I will be able to easily repay my debtors with an average interest of 18-19% in 2 years as an average of 9.something% APR and I will be able to keep a huge profit.All the best with your investment! But taking out loan at such a high percentage for a super volatile asset like bitcoin, is a stupidity to be honest. While I want you to get over this loan quickly enough, but if you rely on the price of bitcoin to repay the loan, the time horizon will get extended by 4 - 6 years. Honestly, I wouldn't have taken out loan for such investment. Rather I would have invested over a period of time to acquire one bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "June 29, 2022, 03:28:27 PM",
      "body": "Congratulations for owing one BTC for the first time, it must feel very good knowing you are among those who owns one BTC. however i think it is a little too risky to take funds from the bank especially perhaps your uncle will be a little more understanding, it is always advisable to invest what we can afford to lose in crypto investment. But seeing the price of btc this cheap anyone will be tempted to buy even if it means taking out a loan from the bank to do so. Good luck with your investment, in about a year or two when the market fully recovers you will be very happy with your bold step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 29, 2022, 03:41:24 PM",
      "body": "Accumulating smaller fractions over time is also what I would have suggested if you had asked this question before having invested in real. But assuming you did all this in real nothing more can be done at this juncture. I hope you were not high during taking this decision.That nice feeling you are having is temporary and it will not comfort you when you run out of liquid cash at hand which I assume you are already lacking, hence the loan. Still I hope you make some money from this investment plan. But taking a loan would be the one thing I would never suggest a fellow bitcoiner to do.My suggestion would be once bitcoin rises, sell the asset at profit and cash out, payback the loan once you are breaking even or profiting, rethink your strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "June 29, 2022, 03:47:23 PM",
      "body": "Imagine taking a loan to buy the most volatile asset in the biggest marketcap's. Not a good idea at all, I will call it a Greed move.You might end up like 3AC or some other company that got liquidated but the difference will be that you will be having no money to pay back the loan as the market is going to range sideways for the next 2 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bobrox",
      "created_time": "June 29, 2022, 03:54:29 PM",
      "body": "Taking loan with higher APR paying and try to buy bitcoin, did you think good ideas? do you have planning how to pay Bank loan every month? I think too risk when you try taking loan and use for investing with bitcoin actually bitcoin still on dip price, I think you don't have daily income except as bitcoin investor and you look not use loan for scalping trade, how ever you need money every month to pay bank loan and exactly with your family you have to pay them several months later. What happen if next time bitcoin price drop and do you have other planning for recovery and paying bank loan? before late you have think again what happen next time if your investment exactly with bitcoin not profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JohnBitCo",
      "created_time": "June 29, 2022, 04:12:54 PM",
      "body": "Quote from: smartaction on June 29, 2022, 11:07:41 AMI then decided to take a loanIf i was at your place, i would not have taken loan to buy bitcoin but i won't say that you took a wrong decision. The only reason i like your decision is that you bought bitcoin at lowest prices and there is very likely that bitcoin will keep going up from this point.I always heard that taking loan to buy crypto is not a good decision but now after seeing your story i am tempting to get a loan too for myself and buy bitcoin. Should i also do the same?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 29, 2022, 04:57:13 PM",
      "body": "Investing in Bitcoin during a dip market is good, and $6k could buy a decent part of BTC at its current price. Taking a loan to buy even more, and also borrowing money from a relative, and aside from the loaned amounts having to pay interest rates is.... risky. Congrats on 1 BTC, but how soon are you supposed to start making payments on that loan you got, and how soon does your uncle expect those $4k + interest?I do agree that 2 years will probably be enough time for Bitcoin to recover and for you to get 3x-5x profits, but there's also a risk it'll take longer, and does your loan not require any payments for the full 2 years?And as many pointed out, it's a very risky decision. This situation breaks the rule of only investing what you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "June 29, 2022, 05:16:48 PM",
      "body": "I am in debt myself after recent crashes, but I got a steady source of income from multiple sources.I would advise investing your money in some biz instead of keeping it locked. Sell something on amazon(or its equivalent). [Make sure you don't get into competitive keywords. Stick to new viral niches in your country. Start small. Test the water first.]At least this way, things will be under your control and you will be taking a manageable risk. If you need other biz ideas, check what's trending on Google in your country. Run an ad on it by selling related service/goods. Just don't keep it locked as bitcoin, it's not your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 29, 2022, 05:26:22 PM",
      "body": "Quote from: smartaction on June 29, 2022, 11:38:00 AMYes i am using Hardware Wallet. Since I'm holding a full of bitcoin.  And i bought it with borrowed money.  So I have to take care of it a lot. So I saved it in a hardware wallet. As if one is not stolen in any way. The rest is my luckGreat. Because no offense, but using a hardware wallet is the best you could do for doing such a reckless move finance-wise. I doubt it, but I really hope this goes really well in your favor; like seriously if you were a sibling or close friend of mine I'd be furious at you right now. Best of luck, you're going to need it. Never do this again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}