{
  "id": "topic_5471614",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "October 25, 2023, 01:16:04 PM",
  "content": "Oct 23 (Reuters) - Nvidia (NVDA.O) dominates the market for artificial intelligence computing chips. Now it is coming after Intel’s longtime stronghold of personal computers.Nvidia has quietly begun designing central processing units (CPUs) that would run Microsoft’s (MSFT.O) Windows operating system and use technology from Arm Holdings(O9Ty.F), , two people familiar with the matter told Reuters.The AI chip giant's new pursuit is part of Microsoft's effort to help chip companies build Arm-based processors for Windows PCs. Microsoft's plans take aim at Apple, which has nearly doubled its market share in the three years since releasing its own Arm-based chips in-house for its Mac computers, according to preliminary third-quarter data from research firm IDC.https://www.reuters.com/technology/nvidia-make-arm-based-pc-chips-major-new-challenge-intel-2023-10-23/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471614",
  "comments": [
    {
      "author": "JayDDee",
      "created_time": "October 25, 2023, 06:15:51 PMLast edit: October 26, 2023, 03:41:40 AM by JayDDee",
      "body": "It took me a bit to figure out MSFT.O was not a version of Windows, but the stock symbol: That's very interesting considering ARM support is being added to cpuminer-opt. The arcticle also saysAMD is getting into the ARM game.The problem with Windows on ARM is it uses a compatibility layer because most Windows apps haven'tbeen updated to run natively on ARM.An interesting quote from  the arcticle:Computer code built for x86 chips will not automatically run on Arm-based designs, and the transition could pose challenges.I have to disagree based on my recent experience. There are certainly challenges but it wasn't as daunting as I feared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "October 26, 2023, 03:28:34 PM",
      "body": "It must be said that ARM processors also have other manufacturers and this business also has good competition. Still, for Windows it is easier to use regular x86 processors, because they are suitable for all tasks; for ARM processors you will need to adapt a lot of software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "October 26, 2023, 08:06:34 PM",
      "body": "Quote from: FP91G on October 26, 2023, 03:28:34 PMARM processors you will need to adapt a lot of software.Not really. The compiler takes care of most of it. Only low level code like intrinsics & ASM or some code segments that can take advantage ofthe architectural differences need to be rewritten.Porting something like Virtualbox is a big challenge because it's all architecture specific. but for something like spreadsheets, vectorizing is thesame regardless of architecture. Doing cpuminer-opt requires around 500 lines of code, less because there are many blank lines and all theoptimization is targetted code. Full featured Linux distributions exist so those apps are already done. I don't know why MS is dragging their heels with their's, they're sellling ARMlaptops with Windows. It's a bad look they didn't do the job properly, but I rant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "October 27, 2023, 04:37:01 PM",
      "body": "Quote from: JayDDee on October 26, 2023, 08:06:34 PMQuote from: FP91G on October 26, 2023, 03:28:34 PMARM processors you will need to adapt a lot of software.Not really. The compiler takes care of most of it. Only low level code like intrinsics & ASM or some code segments that can take advantage ofthe architectural differences need to be rewritten.Porting something like Virtualbox is a big challenge because it's all architecture specific. but for something like spreadsheets, vectorizing is thesame regardless of architecture. Doing cpuminer-opt requires around 500 lines of code, less because there are many blank lines and all theoptimization is targetted code. Full featured Linux distributions exist so those apps are already done. I don't know why MS is dragging their heels with their's, they're sellling ARMlaptops with Windows. It's a bad look they didn't do the job properly, but I rant.I only know that now I shouldn’t buy a laptop with a processor worse than core i3 and a frequency of at least 3 GHz, otherwise the laptop runs very slowly. But I've seen a lot of slow, cheap laptops that run slowly on cheap processors. Therefore, I avoid such cheap processor replacements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 29, 2023, 05:01:19 PM",
      "body": "With all the money Nvidia just raised through the artificial intelligence hype, I imagine they’ll have to expand their business in every way possible in order to try and bring in enough revenue to satisfy investors. This will no doubt result in a lot of wasted money, which is why I think that AMD makes a better investment currently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "October 29, 2023, 10:07:16 PM",
      "body": "The focus is all wrong. It's not Nvidia is making ARM CPUs, it's Nvidia is making ARM CPUs.And they're not alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "November 01, 2023, 01:29:23 PM",
      "body": "Quote from: OgNasty on October 29, 2023, 05:01:19 PMWith all the money Nvidia just raised through the artificial intelligence hype, I imagine they’ll have to expand their business in every way possible in order to try and bring in enough revenue to satisfy investors. This will no doubt result in a lot of wasted money, which is why I think that AMD makes a better investment currently. Chinese companies have already released their own video cardChinese MTT S80 PCIe 5.0 GPU Closes in on GTX 1650https://www.tomshardware.com/news/chinese-mtt-s80-pcie-50-gpu-closes-in-on-gtx-1650#Chinese companies also have their own good ARM processorsBut all of Nvidia’s competitors are losing in developments for artificial intelligence, so I think that the green company will increase its leadership in this direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}