{
  "id": "topic_5455212",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "June 05, 2023, 07:39:47 PM",
  "content": "تفاجئت بهبوط سريع لسعر البيتكوين الان بعدما كان يتداول في مستويات ال 27 الف اول امس وحالي السعر انخفض الى 25,493$ والسبب وراء هذا الامر هي لجنة الأوراق المالية والبورصات الأمريكية التي تقاضي منصة بايننس ومؤسسها زاو تشانغبينغ وتوجه عدة تهم و اكاذيب ضدهم ومن ابرزها«إن الشركة كانت تضيف أموال المستخدمين إلى حساباتها الخاصة وترسلها إلى شركة أوروبية يديرها زاو»في الاونة الاخيرة منصة بايننس تعرضت الى عدة هجمات من طرف الحكومة الامريكية بالخصوص مما اثر سلبا وكثيرا على السوق ونلاحظ في كل مرة يجد السوق القليل من الاستقرار والتحسن يأتي خبر جديد يعيد الامور الى نقطة الصفر. حاليا السوق صامد لكن السؤال الى متى؟ وهل تضن ان جميع التهم هذه حقيقة وتدين منصة بايننس ومؤسسها ام انها اكاذيب اخرى وتلاعبات لاسقاط السوق في اخر المحاولات؟انا شخصيا لا اجد العديد من المشاكل التي اوقعتها هذه المنصة للسوق والبيتكوين بشكل اكبر وحاليا لا يمكن تفريق واستخراج جميع الكميات المخزنة في المنصة لاستقلال البيتكوين مرة اخرى باعتبارها اكبر تجمع للبيتكوين من المستخدمين حاليا العديد من الاطراف يرون ان ما يحدث هو بداية اخرى لقصة FTX مع بايننس هذه المرة وستكون ضربة موجعة بالطبع للسوق باكملهمصادر للموضوع:1: https://www.alkhaleej.ae/2023-06-05/لجنة-الأوراق-المالية-والبورصات-الأمريكية-تقاضي-بينانس-ومؤسسها/أسواق-عالمية/اقتصاد2: https://www.nytimes.com/2023/06/05/business/sec-binance-charges.html3: https://www.barrons.com/articles/bitcoin-sec-binance-cz-7c9391",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455212",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "June 06, 2023, 01:43:26 AM",
      "body": "نعم شيء مؤسف بالفعل، تضج كل وسائل التواصل الاجتماعي بالخبر. يبدو أن الحكومة الأمريكية لن تترك cz وشأنه أبدا، لايزالون يلاحقونه منذ فترة طويلة وكلما مرة يجهزون قائمة اتهامات طويلة وأتوقع أن الكثير منها صادق للأسف. لكن بالنسبة لهذه التهمة الأخيرة تحديدا: Quote«إن الشركة كانت تضيف أموال المستخدمين إلى حساباتها الخاصة وترسلها إلى شركة أوروبية يديرها زاو»يعني هذه تهمة سخيفة بالفعل، لأن كل المنصات تفعل ذلك منذ زمن بعيد وليس المنصات فحسب بل كل البنوك والشركات الاستثمارية أيضا، كل هذه الشركات التي تعتمد على إيداعات المستخدمين تقوم باستخدام أموال المستخدمين كأنها أموالها ، إذا ما الجديد في الموضوع؟ هل صحي ضمير الحكومة الأمريكية فجأة؟؟!!!على كل حال ينبغي الحذر بشدة هذه المرة ، لأن الحديث يدور عن أن هذه المرة مخنلفة وربما تتلقى بينانس ضربة قوية وربما ستكون ضربة كبيرة جدا لسوق كريبتو بأكمله. والأفضل حسب رأي من عنده أموال كبيرة في بينانس أن ينقلها بهدوء إلى محفظته في هذه الفترة العصيبة حتى تتضح الأمور.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 06, 2023, 11:51:52 AM",
      "body": "Quote from: yhiaali3 on June 06, 2023, 01:43:26 AMنعم شيء مؤسف بالفعل، تضج كل وسائل التواصل الاجتماعي بالخبر. يبدو أن الحكومة الأمريكية لن تترك cz وشأنه أبدا، لايزالون يلاحقونه منذ فترة طويلة وكلما مرة يجهزون قائمة اتهامات طويلة وأتوقع أن الكثير منها صادق للأسف. لكن بالنسبة لهذه التهمة الأخيرة تحديدا: Quote«إن الشركة كانت تضيف أموال المستخدمين إلى حساباتها الخاصة وترسلها إلى شركة أوروبية يديرها زاو»يعني هذه تهمة سخيفة بالفعل، لأن كل المنصات تفعل ذلك منذ زمن بعيد وليس المنصات فحسب بل كل البنوك والشركات الاستثمارية أيضا، كل هذه الشركات التي تعتمد على إيداعات المستخدمين تقوم باستخدام أموال المستخدمين كأنها أموالها ، إذا ما الجديد في الموضوع؟ هل صحي ضمير الحكومة الأمريكية فجأة؟؟!!!على كل حال ينبغي الحذر بشدة هذه المرة ، لأن الحديث يدور عن أن هذه المرة مخنلفة وربما تتلقى بينانس ضربة قوية وربما ستكون ضربة كبيرة جدا لسوق كريبتو بأكمله. والأفضل حسب رأي من عنده أموال كبيرة في بينانس أن ينقلها بهدوء إلى محفظته في هذه الفترة العصيبة حتى تتضح الأمور. فعلاً هذا ما يحدث لقد سبق و ألفقت تهمة إلى المنصة من قبل الحكومة الأمريكية حول تلاعبها بالعقود الأجلة، و لكن هذه المرة التحكم بأموال مستخدميها و الإستفادة منها في إستثمارات مختلفة. كما وضحت هذا العمل سار سائد معمول به منذ عقود من طرف المؤسسات المالية.في الواقع أحيانا عندما تكون هناك أخبار سلبية يشهد السوق تراجع طفيف و بعدها مباشرة يأتي الصعود ربما يتم تفعيل هذه الأخبار من أجل إرباك المتداولين حتى يقوموا بالبيع و سحب الأموال خوفاً من إنهيار غير متوقع.دعونا نتابع الحدث لنرى كيف يتم التعامل مع هذه المشاكل التي باتت مستمرة منذ عام الفارط و لا تزال مستمرة إلى أجل غير معلوم.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 06, 2023, 02:52:38 PM",
      "body": "Quote from: yhiaali3 on June 06, 2023, 01:43:26 AMلكن بالنسبة لهذه التهمة الأخيرة تحديدا: Quote«إن الشركة كانت تضيف أموال المستخدمين إلى حساباتها الخاصة وترسلها إلى شركة أوروبية يديرها زاو»يعني هذه تهمة سخيفة بالفعل، لأن كل المنصات تفعل ذلك منذ زمن بعيد وليس المنصات فحسب بل كل البنوك والشركات الاستثمارية أيضا، كل هذه الشركات التي تعتمد على إيداعات المستخدمين تقوم باستخدام أموال المستخدمين كأنها أموالها ، إذا ما الجديد في الموضوع؟ هل صحي ضمير الحكومة الأمريكية فجأة؟؟!!!بصرف النظر عن كونها يمكن اعتبارها تهمة كيدية اي مفتعلة لتضييق الخنافق على المنصة و هذا وارد جدا، فان التهمة ليست سخيفة أبدا و ان ثبتت صحتها فان المنصة ستجد نفسها في موقف محرج للغاية. أموال المستخدمين يجب ان تكون مأمنة في محفظات تشرف عليها بينانس و لا يحق لها المساس باي سنت منها دون موافقة رسمية من صاحبها و هو ما لم تقع الاشارة اليه باي شكل من الاشكال في شروط الاستخدام التي اكد كل مستخدم اطلاعه عليها اثناء القيام بعملية التسجيل. بينانس لها الحق في التصرف من ارباحها التي تجنيها و ليس من ودائع المستخدمين.المقارنة مع البنوك غير جائزة لان منصات تداول العملات المشفرة او حتى تلك المختصة في اسهم البورصة الاوراق المالية ليست ابدا بنكا و لا تشترك مع البنك في العديد من العناصر بما ان منصة التداول مجعولة للتداول و ليس للتخزين في حين ان البنك من مهامه توظيف تلك الودائع لانتاج عوائد يكون صاحب الحساب يتمتع بجزء منها. و حتى لو صحت المقارنة فان التشبه بالبنوك هو اخطر ما يمكن ان يحصل بما ان انهيار اي بنك في اي لحظة يمكن ان يتسبب في ازمة كبيرة يصل مداها الى مدى عالمي بما ان البنك (اي بنك) لا يمتلك سيولة في حجم الودائع في حين ان منصة التداول يجب ان تحافظ على اموال المستخدمين حتى حين تعلن افلاسها.انا اقدم وجهة نظر تقنية بحتة و اعرف انه في الواقع يمكن ان تكون الامور تسير بشكل لا احد يستطيع توقعه خصوصا اننا نتحدث من خارج المجال كمشاهدين.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 06, 2023, 04:29:34 PM",
      "body": "Quote from: Kavelj22 on June 06, 2023, 02:52:38 PMبصرف النظر عن كونها يمكن اعتبارها تهمة كيدية اي مفتعلة لتضييق الخنافق على المنصة و هذا وارد جدا، فان التهمة ليست سخيفة أبدا و ان ثبتت صحتها فان المنصة ستجد نفسها في موقف محرج للغاية. أموال المستخدمين يجب ان تكون مأمنة في محفظات تشرف عليها بينانس و لا يحق لها المساس باي سنت منها دون موافقة رسمية من صاحبها و هو ما لم تقع الاشارة اليه باي شكل من الاشكال في شروط الاستخدام التي اكد كل مستخدم اطلاعه عليها اثناء القيام بعملية التسجيل. بينانس لها الحق في التصرف من ارباحها التي تجنيها و ليس من ودائع المستخدمين.أخي أنا قصدت التهمة سخيفة من كونها أمر قديم وليس بجديد، لأننا كلنا يعلم أنا وأنت والحكومات والجميع أن المنصات تفعل هذا منذ زمن بعيد وليس بينانس فحسب ورغم ذلك فإن الحكومة لم يتحركوا حتى هذا الوقت، هذا ما قصدته وليس بمعنى أن القضية سخيفة ولا يحدث من وراءها شيء لبينانس، على العكس هذا المرة يبدو أن القضية كبيرة جدا وCZ يبدو مضطرب جدا من خلال تغريداته وكل التحليلات تقول أنها ربما تكون الضربة القاضية لبينانس هذه المرة، لذلك الكل خائف ويترقب وهناك ضجة كبيرة على مواقع التواصل. يعني زبدة الكلام أنهم يريدون تدمير بينانس بكل طريقة سواء كانت التهمة قديمة أم جديدة، وهذا ما عنيته بقولي سخيفة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "June 06, 2023, 10:53:15 PMLast edit: June 07, 2023, 12:10:08 AM by albon",
      "body": "رغم الأخبار السلبية التي يشهدها السوق حاليا من حرب لجنة الأوراق المالية على منصة بينانس وكوين بيز وغيرهم وحالات عدم اليقين والشك والذعر المنتشرة بين قطاع المستثمرين والمتداولين، إلا أنه تمكن البيتكوين من الارتداد مرة أخرى إلى $ 27,172.43 مما أدى إلى ارتفاع مشهود لأغلب العملات الأخرى والذي كان من المتوقع أن ينخفض إلى 24 ألف دولار حتى يستوعب السوق القضية، أما بالنسبة لأكبر عملة تضررت بهذه الأخبار فهي عملة ال BNB حيث تم تصنيفها كورقة مالية بموجب القانون الأمريكي، بالنسبة للجنة الأوراق المالية فما أراه أنه ليس مصلحتهم حماية المستثمرين كما يدعون ولكن لملء خزائنهم بالأموال من هذه الاتهامات والحروب المستمرة منذ سنوات على قطاع التشفير ومنصات التبادل المركزية، ماراه أن رئيس بينانس صامد بصلابة وفريقه متواجد في الساحة وقد برؤا أنفسهم من التهم الثلاثة عشر المنسوبة إليهم ولديهم عدد من أفضل محامين الدفاع عن انفاذ القانون وقالCZ ان فريق بينانس على أهبة الاستعداد لضمان إستقرار أنظمتهم بما فى تلك العمليات التى تخص السحوبات والإيداعات، ضف إلى أن سوق الكريبتو يدعم بينانس بقوة حيث قام مؤسس بينانس فى حسابه بتويتر بنشر تصويت بين بينانس و SEC وجاءت النسبة الأكثر لبينانس والنسبة الأضعف بكثير للجنة الأوراق المالية، لذلك أنا متفائل خيرا بأن بينانس ستنتصر فى النهاية وتعود الأمور لمجاريها.ولا ننسى رقم 4 الذى أشار إليه CZ بأصابعه في صورته هذا العام (والذى يشير الرقم إلى تجاهل الذعر وعدم اليقين والاخبار الزائفة والهجمات على المنصة ونحو ذلك)[1] رد بينانس على إدعاءات لجنة الأوراق المالية: https://www.binance.com/en/blog/ecosystem/sec-complaint-aims-to-unilaterally-define-crypto-market-structure-8707489117122437402[2] التصويت الذى حدث على حساب مؤسس بينانس : https://twitter.com/cz_binance/status/1665960645076844544",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "June 07, 2023, 12:09:24 AM",
      "body": "Quote from: albon on June 06, 2023, 10:53:15 PMرغم الأخبار السلبية التي يشهدها السوق حاليا من حرب لجنة الأوراق المالية على منصة بينانس وكوين بيز وغيرهم وحالات عدم اليقين والشك والذعر المنتشرة بين قطاع المستثمرين والمتداولين، إلا أنه تمكن البيتكوين من الارتداد مرة أخرى إلى $ 27,172.43 مما أدى إلى ارتفاع مشهود لأغلب العملات الأخرى والذي كان من المتوقع أن ينخفض إلى 24 ألف دولار حتى يستوعب السوق القضية، أما بالنسبة لأكبر عملة تضررت بهذه الأخبار فهي عملة ال BNB حيث تم تصنيفها كورقة مالية بموجب القانون الأمريكي، بالنسبة للجنة الأوراق المالية فما أراه أنه ليس مصلحتهم حماية المستثمرين كما يدعون ولكن لملء خزائنهم بالأموال من هذه الاتهامات والحروب المستمرة منذ سنوات على قطاع التشفير ومنصات التبادل المركزية، ماراه أن رئيس بينانس صامد بصلابة وفريقه متواجد في الساحة وقد برؤا أنفسهم من التهم الثلاثة عشر المنسوبة إليهم ولديهم عدد من أفضل محامين الدفاع عن انفاذ القانون وقالCZ ان فريق بينانس على أهبة الاستعداد لضمان إستقرار أنظمتهم بما فى تلك العمليات التى تخص السحوبات والإيداعات، ضف إلى أن سوق الكريبتو يدعم بينانس بقوة حيث قام مؤسس بينانس فى حسابه بتويتر بنشر تصويت بين بينانس و SEC وجاءت النسبة الأكثر لبينانس والنسبة الأضعف بكثير للجنة الأوراق المالية، لذلك أنا متفائل خيرا بأن بينانس ستنتصر فى النهاية وتعود الأمور لمجاريها.ولا ننسى رقم 4 الذى أشار إليه CZ بأصابعه في صورته هذا العام (والذى يشير الرقم إلى تجاهل الذعر وعدم اليقين والاخبار الزائفة والهجمات على المنصة ونحو ذلك)صراحة لم اتوقع عودة سعر البيتكوين الى هذا المستوى ربما بعد اسابيع لكن ما حدث فعل يظهر لنا قوة مجتمع الكريبتو ومساندته والجانب الايجابي حاليا هو إكتشاف نية الحكومات وتجاهل محاولاتهم الفاشلة دائما لاسقاط الكريبتو وبالخصوص منصة بايننس والمدير التنفيذي له والامر حاليا يعمل عكس خطتهم لاثارة الخوف والهلع فالمجتمع الرد حاليا عكس التوقعات وما اراه هذه المرة هو القوة في مجتمعنا ودعم كبير ل CZ وشخصيته القوية لمواجهة التهم واظهار الوجه الحقيقي لهم بانها حقيقة تعمل على دعم البيتكوين والعملات المشفرة عكس تماما ما حدث مع FTXالامر الان قد يكون ايجابيا اكثر من سلبي في حالة استمرار الوضع وتبرئة بايننس من التهم سوف نرى صعود اكثر للبيتكوين في نظري رغم رايي المختلف يوم امس",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 07, 2023, 01:49:40 AM",
      "body": "نعم صراحة الارتفاع كان مفاجئ وسعيد للجميع، لم يتوقع أحد صراحة عودة البيتكوين إلى سعره بهذه السرعة. حتى أن محللين كبار توقعوا استمرار الهبوط لكنهم تفاجأوا بالعودة السريعة، هذا درس تاريخي صراحة يدل على مدى القوة والثقة التي وصل إليها البيتكوين ومجتمع البيتكوين أيضا الذي أصبح لديه ثقة كبيرة ولم يعد يهتم بالأخبار السلبية حتى لو كانت على هذا المستوى الضخم مثل انهيار بينانس فرضا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 07, 2023, 02:59:14 AM",
      "body": "Quote from: GxSTxV on June 07, 2023, 12:09:24 AMQuote from: albon on June 06, 2023, 10:53:15 PMرغم الأخبار السلبية التي يشهدها السوق حاليا من حرب لجنة الأوراق المالية على منصة بينانس وكوين بيز وغيرهم وحالات عدم اليقين والشك والذعر المنتشرة بين قطاع المستثمرين والمتداولين، إلا أنه تمكن البيتكوين من الارتداد مرة أخرى إلى $ 27,172.43 مما أدى إلى ارتفاع مشهود لأغلب العملات الأخرى والذي كان من المتوقع أن ينخفض إلى 24 ألف دولار حتى يستوعب السوق القضية، أما بالنسبة لأكبر عملة تضررت بهذه الأخبار فهي عملة ال BNB حيث تم تصنيفها كورقة مالية بموجب القانون الأمريكي، بالنسبة للجنة الأوراق المالية فما أراه أنه ليس مصلحتهم حماية المستثمرين كما يدعون ولكن لملء خزائنهم بالأموال من هذه الاتهامات والحروب المستمرة منذ سنوات على قطاع التشفير ومنصات التبادل المركزية، ماراه أن رئيس بينانس صامد بصلابة وفريقه متواجد في الساحة وقد برؤا أنفسهم من التهم الثلاثة عشر المنسوبة إليهم ولديهم عدد من أفضل محامين الدفاع عن انفاذ القانون وقالCZ ان فريق بينانس على أهبة الاستعداد لضمان إستقرار أنظمتهم بما فى تلك العمليات التى تخص السحوبات والإيداعات، ضف إلى أن سوق الكريبتو يدعم بينانس بقوة حيث قام مؤسس بينانس فى حسابه بتويتر بنشر تصويت بين بينانس و SEC وجاءت النسبة الأكثر لبينانس والنسبة الأضعف بكثير للجنة الأوراق المالية، لذلك أنا متفائل خيرا بأن بينانس ستنتصر فى النهاية وتعود الأمور لمجاريها.ولا ننسى رقم 4 الذى أشار إليه CZ بأصابعه في صورته هذا العام (والذى يشير الرقم إلى تجاهل الذعر وعدم اليقين والاخبار الزائفة والهجمات على المنصة ونحو ذلك)صراحة لم اتوقع عودة سعر البيتكوين الى هذا المستوى ربما بعد اسابيع لكن ما حدث فعل يظهر لنا قوة مجتمع الكريبتو ومساندته والجانب الايجابي حاليا هو إكتشاف نية الحكومات وتجاهل محاولاتهم الفاشلة دائما لاسقاط الكريبتو وبالخصوص منصة بايننس والمدير التنفيذي له والامر حاليا يعمل عكس خطتهم لاثارة الخوف والهلع فالمجتمع الرد حاليا عكس التوقعات وما اراه هذه المرة هو القوة في مجتمعنا ودعم كبير ل CZ وشخصيته القوية لمواجهة التهم واظهار الوجه الحقيقي لهم بانها حقيقة تعمل على دعم البيتكوين والعملات المشفرة عكس تماما ما حدث مع FTXالامر الان قد يكون ايجابيا اكثر من سلبي في حالة استمرار الوضع وتبرئة بايننس من التهم سوف نرى صعود اكثر للبيتكوين في نظري رغم رايي المختلف يوم امسبصراحة لا استطيع تفسير كل هذا الحماس لبينانس سوى كون المستخدمين لم يأخذوا العبرة مما حصل سابقا مع المنصات الاخرى. القاعدة تقول ان اي منصة قابلة للانهيار مهما بلغ حجمها السوقي و قوتها. و على هذا الأساس فأنا شخصيا مساند لكل الاجراءات بحق بينانس و أؤيد ان يتم تفقد كل عملياتها من حين لاخر و المجازفة بادانتها اذا ثبت وجود اي نوع من الشبهات. منذ فترة تم الكشف عن كيف ان موظفين من بينانس يقدمون حلولا للمستخدميين الصينيين ليتمكنوا من تجاوز اجراءات تثبت الهوية و تأكيد حساباتهم بالرغم من كون الصين تمنع هذا بشكل قاطع و نفس الشيء حصل مع الولايات المتحدة التي ادانتها بنفس التهمة تقريبا ما أدى الى اغلاق موقع بينانس المخصص للولايات المتحدةلو كان هذا حصل مع منصة Ftx قبل زمن من انهيارها لما انهارت ربما او لما كان لانهيارها كل تلك التداعيات. يعني من الجانب الحمائي فالافضل ان تتواصل الضغوط هعلى المنصات مما يساعد في الحد من قوتها و عدم اعطائها فرصة للتغول بما ان بينانس مثلا تحتكر القطاع تقريبا و ليست هناك منصة قادرة على منافستها. و ايضا هذا محفز للمستخدمين على عدم الوثوق ابدا ببتينانس و بقية المنصات المركزية و الاخذ بعين الاعتبار انها قد تصبح في اي لحظة موضوع تتبع من طرف السلطات لاسباب قد نجهلها.نصيحة: عودوا انفسكم على استخدام المنصات اللامركزية و منصات الند للند الموثوقة و في الحالتين فالحذر دوما مطلوب.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 07, 2023, 08:57:18 PM",
      "body": "مستغرب فعلا من قدرة CZ على تحمل كل هذه الضغوطات و تعامله بطريقة مثلى ضد كل القضايا التي رفعت ضده! متأكد لو كان اي شخص آخر يدير منصة بينانص لأنهارت المنصة منذ مدة طويلة.لا أهتم فعلا لمآل المنصة و لا يعنيني ان تم غلثقها أكن ما يقلقني هو أن يتم ربط مصير البيتكوين بمصير منصة معينة و ان يتأثر سعره بما يحدث معها. للأسف هذا يعني ان البيتكوين، لحد الان، يعتبر بشكل او بآخر مركزي و لم يصل لمرحلة اللامركزية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 08, 2023, 11:02:54 AM",
      "body": "في آخر التطورات لقضية بينانس المحكمه تستدعي مؤسس منصة باينانس للرد على الادعاءات الموجهه له خلال 21 يوماً .Quoteوجاء في الاستدعاء \"تم رفع دعوى قضائية ضدك\".وفقًا للوثيقة ، بمجرد حدوث الخدمة ، سيكون أمام Binance والمدير التنفيذي 21 يومًا للرد. \"إذا فشلت في الرد ، فسيتم إدخال الحكم بشكل افتراضي ضدك للإغاثة المطلوبة في الشكوى.\"https://cointelegraph.com/news/us-district-court-issues-summons-for-binance-ceo-changpen-zhao-over-sec-actionحسب ما يتضح من الخبر أن الأمر يتوقف على رئيس بينانس أن ينجح في الرد على الاتهامات خلال 21 يوم، وإذا فشل في تقديم الردود المقنعة فسوف يتم الحكم ضد بينانس.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "June 09, 2023, 11:43:38 AM",
      "body": "Quote from:  yhiaali3 on June 08, 2023, 11:02:54 AMفي آخر التطورات لقضية بينانس المحكمه تستدعي مؤسس منصة باينانس للرد على الادعاءات الموجهه له خلال 21 يوماً .Quoteوجاء في الاستدعاء \"تم رفع دعوى قضائية ضدك\".وفقًا للوثيقة ، بمجرد حدوث الخدمة ، سيكون أمام Binance والمدير التنفيذي 21 يومًا للرد. \"إذا فشلت في الرد ، فسيتم إدخال الحكم بشكل افتراضي ضدك للإغاثة المطلوبة في الشكوى.\"https://cointelegraph.com/news/us-district-court-issues-summons-for-binance-ceo-changpen-zhao-over-sec-actionحسب ما يتضح من الخبر أن الأمر يتوقف على رئيس بينانس أن ينجح في الرد على الاتهامات خلال 21 يوم، وإذا فشل في تقديم الردود المقنعة فسوف يتم الحكم ضد بينانس.الرد على هذه الاتهامات لن يكفي وحده وعلى منصة بايننس وCZ تقديم كل الادلة اللازمة لانقاذ الامر وتفادي حصول كارثة في السوق لان الامر واضح ان المحكمة سوف تقرر اما ايقاف المنصة وتغريمها وربما اسوء من ذلك وتحويل العديد من اطراف المنصة الى المحاكمة ايضا وسوف نرى انهيار في السوق من كل العملات وبالخصوص البيتكوين و BNB قرات هذا الرد Quote from:  1 On Thursday, CZ denied SEC claims that Binance had redirected billions of dollars in customer funds from Binance and Binance US to his own company, Merit Peak. “All user funds are accounted for, and never left the http://Binance.US platform (unless users withdraw themselves of course), ever,” he said.    حيث قام يوم امس CZ برفض وتكذيب ما تم اتهامه به وبعض الامور التي اعتبرها مجرد محاولات بائسة من طرف SEC ضد الكريبتوبالاضافة الى ان binance us والخاص بالاعضاء المتواجدين في الولايات المتحدة الامريكية انه تم تعليق الايداع بالدولار الامريكي وحتى ربما السحب ايضا[1] : https://decrypt.co/143907/cz-messages-employees-after-sec-leaks-binance-chat-logs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 09, 2023, 03:25:04 PM",
      "body": "Quote from: GxSTxV on June 09, 2023, 11:43:38 AMبالاضافة الى ان binance us والخاص بالاعضاء المتواجدين في الولايات المتحدة الامريكية انه تم تعليق الايداع بالدولار الامريكي وحتى ربما السحب ايضانعم وضع بينانس وخاصة binance us سيء جدا والبارحة أيضا أعلنت binance.us  عن إزالة العشرات من أزواج تداول BTC, USDT, BUSD:                                                 يبدو أن الوضع سيء جدا ولا أحد يعلم ما الذي ستنتهي إليه القضية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 09, 2023, 10:26:31 PM",
      "body": "Quote from: yhiaali3 on June 09, 2023, 03:25:04 PMQuote from: GxSTxV on June 09, 2023, 11:43:38 AMبالاضافة الى ان binance us والخاص بالاعضاء المتواجدين في الولايات المتحدة الامريكية انه تم تعليق الايداع بالدولار الامريكي وحتى ربما السحب ايضانعم وضع بينانس وخاصة binance us سيء جدا والبارحة أيضا أعلنت binance.us  عن إزالة العشرات من أزواج تداول BTC, USDT, BUSD:                                                ]يبدو أن الوضع سيء جدا ولا أحد يعلم ما الذي ستنتهي إليه القضية. من يعلم أخي في حالة عدم الإجابة على التهم الموجهة لمدير منصة بينانص هذا يعني ستتخذ إجراءات المتعلقة بالإغلاق و إنهيار الشركة أما إذا نجح في الإجابة على التهم قبل الموعد المحدد سيكون كل شيء على ما يرام.و لكن هل تمت إزالة هذه الأزواج رغبة للجنة الأوراق المالية و البورصات؟ أم هناك شبهة ما بخصوص هذه الأزواج؟أخاف أن يطلب من المنصة تشطيب عملات معينة حينها ستزداد القضية غرقاً، قرأت أيضا خبراً يبين زيادة في أوامر البيع لعملة بينانص هذا قد ينتج عنه السحب الجماعي و يؤثر على مسار سعر السوق نحو الأسوأ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "June 10, 2023, 12:50:57 AM",
      "body": "حاليا و لحسن الحظ لا يوجد نزيف في السوق بعد لاحظنا هبوط طفيف في سعر البيتكوين وتتبعه بعض العملات الاخرى ومنها اكثر تضررا هي ال BNB. السوق وجميع المستخدمين والمستثمرين يترقبون اخبار قضية بايننس وكيف ستنتهي وتقرر مصير اتجاه السوق التالي.مع الاسف بايننس اصبحت مرتبطة جدا بالبتكوين وهو امر سيء في هذه الحالات وسوف يأثر على السوق سلبيا اذا لم يتم تبرئة المنصة و المؤسس من كل القضايا. والسبب هو حجم السيولة في المنصة تعتبر تقريبا 60% وعمليات السحب من المنصة سوف تحدث كارثة في سعر البيتكوين.انا حاليا لازلت احتفظ بالبيتكوين واتمنى رجوع السوق للافضل لكن هل من نصيحة حول كيفية الخروج من هذه اللحظات باقل الخسائر او بفائدة اذا ما كانت",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 10, 2023, 01:46:50 AM",
      "body": "Quote from: Ulven on June 09, 2023, 10:26:31 PMو لكن هل تمت إزالة هذه الأزواج رغبة للجنة الأوراق المالية و البورصات؟ أم هناك شبهة ما بخصوص هذه الأزواج؟أخاف أن يطلب من المنصة تشطيب عملات معينة حينها ستزداد القضية غرقاً، قرأت أيضا خبراً يبين زيادة في أوامر البيع لعملة بينانص هذا قد ينتج عنه السحب الجماعي و يؤثر على مسار سعر السوق نحو الأسوأ.نعم أخي تمت إزالة هذه الأزواج بناء على قرار لجنة الأوراق المالية و البورصات التي اعتبرتها فيما يبدو سلع وليس عملات. كما ترى من الصورة هناك العديد من العملات المهمة في القائمة مثلا عملة 1inch التابعة لمنصة 1inch المشهورة.هذا القرار دفع المؤسس المشارك لشبكة 1inch سيرجي كونز للقول: إن هيئة الأوراق المالية والبورصات تقتل الابتكار في الولايات المتحدةhttps://ar.cointelegraph.com/news/sec-is-killing-innovation-in-united-states-1inch-co-founder",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "June 10, 2023, 08:59:54 AM",
      "body": "Quote from: yhiaali3 on June 10, 2023, 01:46:50 AMنعم أخي تمت إزالة هذه الأزواج بناء على قرار لجنة الأوراق المالية و البورصات التي اعتبرتها فيما يبدو سلع وليس عملات. كما ترى من الصورة هناك العديد من العملات المهمة في القائمة مثلا عملة 1inch التابعة لمنصة 1inch المشهورة.هذا القرار دفع المؤسس المشارك لشبكة 1inch سيرجي كونز للقول: إن هيئة الأوراق المالية والبورصات تقتل الابتكار في الولايات المتحدةhttps://ar.cointelegraph.com/news/sec-is-killing-innovation-in-united-states-1inch-co-founderسيتم ازالة كل الازواج والعملات المرتبطة بالدولار الامريكي وتحويل منصة Binance us كاملة الى منصة خاصة بالعملات الرقمية والمشفرة فقط واضنها خطوة سوف تدمر هذه المنصة مع الاسفبداية من يوم امس تم تعطيل الايداع بالدولار الامريكي اخر اجل لاخراج اموالك من الدولار على المنصة هو 13 جوان  و اذا لم تقم بذلك سيتم تحويلها الى عملات مستقرة Stable coins بداية من 15 جوان السؤال الان هل ستقوم بايننس بتطبيق نفس الامر على منصتها العالمية بعد هذه الخطوات وهل هي تخص الامريكية فقط؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 10, 2023, 04:48:46 PM",
      "body": "Quote from: GxSTxV on June 10, 2023, 08:59:54 AMالسؤال الان هل ستقوم بايننس بتطبيق نفس الامر على منصتها العالمية بعد هذه الخطوات وهل هي تخص الامريكية فقط؟لا أتوقع أن يتم تطبيق هذه الإجراءات على المنصة العالمية، من الجيد أن الولايات المتحدة لاتملك سلطة عليها . في النهاية أتوقع أن تقوم بينانس بنقل مقرها الرئيسي إلى دبي كما ستفعل أغلب المنصات وخدمات كريبتو التي مقرها الولايات المتحدة. كثير منهم لمحوا إلى هذا الأمر.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoCuMan",
      "created_time": "June 12, 2023, 09:11:44 PM",
      "body": "الموعد سيكون في 13 /6  في جلسة بينانس مع المحكمة ضدالدعوى المقدمة من هيئة الاوراق المالية , وفي نفس الموعد ايضا موعد قضية الريبل في الدعوى المرفوعة عليها سابقا , نتمنى ان تكون الاخبار ايجابية في بعد جلسة المحكمة",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 13, 2023, 03:07:53 AM",
      "body": "Quote from: CryptoCuMan on June 12, 2023, 09:11:44 PMالموعد سيكون في 13 /6  في جلسة بينانس مع المحكمة ضدالدعوى المقدمة من هيئة الاوراق المالية , وفي نفس الموعد ايضا موعد قضية الريبل في الدعوى المرفوعة عليها سابقا , نتمنى ان تكون الاخبار ايجابية في بعد جلسة المحكمة نعم نتمنى ذلك، سمعت أن باينانس داخله الدفاع بقوه بتوكيلها المحامي المشاغب المشهور جورج كانيلوس. والرئيس السابق لوحدة الجرائم الكبرى في مكتب المدعي العام بامريكا الجنوبيه. والرئيس السابق لمكتب نيويورك التابع للجنة الاوراق الماليه والبورصات. والمدير المشارك السابق لقسم التنفيذ في SEC.يعني جيش من المحامين.أيضا موقف ريبل يبدو جيدا لذلك أتمنى أن نسمع أخبار طيبة اليوم تؤدي إلى انتعاش السوق.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}