{
  "id": "topic_5447012",
  "title": "oldloco",
  "author": "oldloco",
  "created_time": "March 31, 2023, 12:50:34 PMLast edit: March 31, 2023, 01:13:47 PM by oldloco",
  "content": "If you have experience with organizing ICO and marketing for new projects - We would love to have you in our team!About us: We are a company that sells gardens and free time/leisure buildings in a Nordic country. The company was started by two persons (and still is run by only two of us) in 2019 with literally zero investments and went up to $61,000 in profit in 2021, and for the last year of 2022, we are looking at $120,000+ in profit once the annual report will be submitted later this year. Why ICO/presale?We are expanding our business to Europe and Scandinavia and will be opening an LTD company in the EU that will manage Scandinavia, Europe and UK markets. We will be expanding with or without the ICO, however, having a successful  ICO/Presale will help us grow faster. Here's why we a sure that ICO will help us grow faster:1. Bulk pre-ordering.We have a good understanding of the market and therefore we can pre-order units from the factory before the season begins, but for that, we need to pay at least 50% of the order sum when ordering. What advantage does it give us:1.01 Better pricing - ordering 10 or more units in advance gives a 10%-20% discount (varies per model and factory) vs an order of a single unit.1.02. Faster delivery time - during the season delivery time can go anywhere from 4 weeks to 16 weeks or even more. Most people want their unit to be delivered ASAP, without waiting for months and therefore pre-ordering gives us a huge advantage vs our competitors that does not have stock.1.1 Operational costs.With bulk, pre-ordering comes a need for a storage unit where orders can be proceeded with maximum efficiency, by optimising delivery time and price.TokenomicsWe want to reward our investors with staking rewards. Proposed rewards will be paid in a stablecoin (USDT, BUSD, etc). The staking reward is proposed in such way:The staking pool lifetime is 3 months, New pool starts within 10 days after the old one ends.Staking rewards provided by the company profits (75% of the reported quarterly profit).This is a proposed tokenomic and they can be modified/changed in order to present the best reward option for investors and the team.We forecast a profit of $140,000 in year one and for the year 2 it is $310,000; This is a very pessimistic forecast based on our knowledge and experienceProgress up to date1. German, Swedish and Danish websites are in progress and 70% completed.2. Domain names secured3. Agreements with multiple factories signed.4. Agreements with multiple transport companies and forwarding centres signed.Important: All that is stated above about my current company can be checked online;Would love to hear back from you, either by public reply or dm",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447012",
  "comments": [
    {
      "author": "ARCADIA-OG",
      "created_time": "April 20, 2023, 05:06:09 AM",
      "body": "Hi. I think I'm missing the link or a brand name we could Google. I think we are both newbs so we can dm yet, not sure, but I'd like to know more before anything. I have a long experience in eCommerce so that is why it interest me.Other thing is, do you have the token and developers?, or you are including all that with the \"ICO\"? ICO does not contain blockchain, is just a type of fundraising using blockchain. A different type is probably more useful and simpler. for what you want to do",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}