{
  "id": "topic_5435991",
  "title": "Beparanf",
  "author": "Beparanf",
  "created_time": "January 19, 2023, 09:32:10 AM",
  "content": "As title implied. My Ledger X can’t send TRC20 using the mobile ledger live app. I have sufficient TRX tokens sufficient for the gas fee but my transaction always failed and mark as energy failure despite I’m being charge with 20 TRX per failed transaction. I read online that this is an issue with ledger live mobile app but is there any alternative way to send via mobile apps? I’m always away with my computer and the reason why I purchase ledger x is due to its bluetooth feature to connect with my phone. Is there any working alternative trick for this without importing my seed phrase on other wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435991",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "January 19, 2023, 10:09:49 AM",
      "body": "I'm not sure if this would work since you'll still need to install the Tron app by ledger for this to work, but have you tried to link your Ledger X with TronLink wallet?If that doesn't work, you should probably just wait until Ledger fixes the issue:Quote from: https://support.ledger.com/hc/en-us/articles/8085235615133-Tether-USDT-transaction-on-Tron-failed-and-ran-out-of-energy?support=true Please note that this fix only applies to to the desktop version of Ledger Live. A fix for the mobile version will be released as soon as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "January 19, 2023, 12:26:17 PM",
      "body": "Quote from: OmegaStarScream on January 19, 2023, 10:09:49 AMI'm not sure if this would work since you'll still need to install the Tron app by ledger for this to work, but have you tried to link your Ledger X with TronLink wallet?If that doesn't work, you should probably just wait until Ledger fixes the issue:Quote from: https://support.ledger.com/hc/en-us/articles/8085235615133-Tether-USDT-transaction-on-Tron-failed-and-ran-out-of-energy?support=true Please note that this fix only applies to to the desktop version of Ledger Live. A fix for the mobile version will be released as soon as possible.Is this the official website of the TronLink app https://www.tronlink.org/. Just making I’m downloading from the official website. Ledger seems slow on working to the fix for the mobile version ledger live. I will give a feedback here if this method turn out to be successful. Thanks for sharing. I’m a complete noob on tron dapps because I never touch this shitcoin except now for their USDT after Binance BUSD show some potential risk on the recent drama of Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 19, 2023, 04:30:12 PM",
      "body": "@Beparanf, if you go to the Ledger page and look at all the supported coins, then next to Tron you will see two links, one is Ledger Live, and the other shows a link to the TronScan wallet. I can't say anything about that other wallet, but if I really had to, I would always use the one linked on the official website.https://www.ledger.com/supported-crypto-assets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 19, 2023, 10:51:57 PM",
      "body": "Quote from: Beparanf on January 19, 2023, 09:32:10 AMIs there any working alternative trick for this without importing my seed phrase on other wallet?You should first try connecting some desktop wallet that is supportinh tron tokens, but first thing you should try is with ledger live desktop app.Ledger is claiming that trc20 tokens are supported by Tronwallet, Tronscan and ledger live, so this are all the options you have.I don't know exactly how this shitcoin centraized blockchain works with ledger, but make sure you have firmware and app updated to latest version.Check if this token is supported here:https://www.ledger.com/supported-crypto-assetshttps://support.ledger.com/hc/en-us/articles/360013062159-Manage-TRC10-and-TRC20-tokens?support=true",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "January 28, 2023, 08:01:37 PM",
      "body": "Ledger has some issues when syncing Tron accounts. That's been going on even before that bug with failed TRC-20 tokens became known. When I say issues, I mean it takes much longer to sync a Tron account in Ledger Live compared to Bitcoin accounts. When it happens, a restart of Ledger Live tends to fix it.But besides the syncing difficulties, I haven't noticed the transaction failures you mentioned. I have some USDT in a Tron account and when I make transactions (from my desktop), it works just fine. It's just the syncing that gets on my nerves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}