{
  "id": "topic_5427846",
  "title": "Rruchi man",
  "author": "Rruchi man",
  "created_time": "December 11, 2022, 03:59:21 PM",
  "content": "I recently played a slot game named \"Wanted dead or a wild\", on Livecasino.io and I so much liked it because of the great soundtrack the game had. I have asked here if anyone has an idea the origin of the songs used in slot games, there was no definite answer, so I am bringing it up here for general discussion. Where do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427846",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "December 11, 2022, 04:19:53 PM",
      "body": "I imagine that like all other game developers, slot game developers get the soundtracks they use from a variety of sources. Those sources include music libraries, professional or freelance composers and production music companies. Music libraries are collections of pre-recorded music tracks that can be licensed for use in a variety of media, including games. Composers are individual musicians who create original music tracks for specific clients or projects. Some slot game developers may also create their own soundtracks in-house using a team of in-house composers and sound designers. It depends on their decision about what they want, what kind of resources are available to them and how much money they can spend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "December 11, 2022, 04:23:07 PM",
      "body": "Quote from: Rruchi man on December 11, 2022, 03:59:21 PMI recently played a slot game named \"Wanted dead or a wild\", on Livecasino.io and I so much liked it because of the great soundtrack the game had. I have asked here if anyone has an idea the origin of the songs used in slot games, there was no definite answer, so I am bringing it up here for general discussion. Where do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it? Every possible thought as to how they get their music is plausible. Technology has made everything you almost dream possible as per composition, integration and adaptation of sound to fit a concept of spin or casino theme, very possible. The music could be composed if they can afford an orchestra, it could be gotten from game music sites which offer a variety of sounds to pick from. It could also be gotten by using a creators sound and paying royalties. It depends on what the directors agree upon at the end of the day. The aim of the music is to captivate the users to stick around more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 11, 2022, 04:31:41 PM",
      "body": "Quote from: Cryptomultiplier on December 11, 2022, 04:23:07 PMQuote from: Rruchi man on December 11, 2022, 03:59:21 PMI recently played a slot game named \"Wanted dead or a wild\", on Livecasino.io and I so much liked it because of the great soundtrack the game had. I have asked here if anyone has an idea the origin of the songs used in slot games, there was no definite answer, so I am bringing it up here for general discussion. Where do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it? Every possible thought as to how they get their music is plausible. Technology has made everything you almost dream possible as per composition, integration and adaptation of sound to fit a concept of spin or casino theme, very possible. The music could be composed if they can afford an orchestra, it could be gotten from game music sites which offer a variety of sounds to pick from. It could also be gotten by using a creators sound and paying royalties. It depends on what the directors agree upon at the end of the day. The aim of the music is to captivate the users to stick around more.there are already digital music creator today, one would not need an orchestra to create one. everything is digital like techno music, all you need is arrange the beat and add some components to it. for the Wanted dead or a wild,  its great composition that fits for wild west but doesn't sound very country.but i think staker is right about music libraries of the game developers. a full package offer for casino business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 11, 2022, 04:36:59 PM",
      "body": "Quote from: Rruchi man on December 11, 2022, 03:59:21 PMI recently played a slot game named \"Wanted dead or a wild\", on Livecasino.io and I so much liked it because of the great soundtrack the game had. I have asked here if anyone has an idea the origin of the songs used in slot games, there was no definite answer, so I am bringing it up here for general discussion. Where do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it?Most likely the developers depending on the theme they try to find a soundtrack that fits to that theme.For example I play mostly medieval themes slots and of course the soundtracks are normally slow music and beautiful songs that fit perfectly to the theme of the slots I play.The ones that go the extra mile that want everything to run smoothly,it would no surprise for me if they spend extra budget for the soundtrack,I know that most of the slot lovers if they don't have soundtracks they like they do not play that long in that particular slot so the soundtracks are some of the most curated elements from the slot providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Genemind",
      "created_time": "December 11, 2022, 04:46:11 PM",
      "body": "Game developers base their game sound-track on their theme. There are several websites where you can download game soundtracks, sound effects, etc, and you can even contact music composers to create one for you.  One of the reasons why slot games are catchy is because of their soundtrack. Either they create their own sound track or hire composers to do it for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "December 11, 2022, 04:52:21 PM",
      "body": "Quote from: Genemind on December 11, 2022, 04:46:11 PMGame developers base their game sound-track on their theme. There are several websites where you can download game soundtracks, sound effects, etc, and you can even contact music composers to create one for you.  One of the reasons why slot games are catchy is because of their soundtrack. Either they create their own sound track or hire composers to do it for them. First of all, I must commend you for your wonderful comments but nevertheless, your comments is incomplete without you giving examples of such websites. Is it is now, it's merely like an assumption if we have no access to those websites for a personal experience. I will check back later with the hope that you edit your comment and include it. Cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 11, 2022, 05:14:04 PM",
      "body": "Mostly, game developers in any niche, either for gambling or not, hire music composers for so many reasons. First is to avoid being copyrighted, being unique and music/sounds that suited for the kind of game. Although they can just use a copyrighted-free music/sounds but it will defy all of the mentioned above which turns out to be its cons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "December 11, 2022, 06:11:33 PM",
      "body": "Most are existing libraries with copyright and are part of the creative process, licenses for intros or singles are the most used.There is an App called Shazam decrypts any audio, and it does not do so with that intro, which indicates that it is a specific audio created for that slot.There are an infinite number of programs to create audio that developers use, as well as companies that take care of such a thing, although the one for that game that you mention seems to me to have a very basic rhythm, anyway, i usually play volume off.Is this a Gambling issue (topic)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roslinpl",
      "created_time": "December 11, 2022, 06:13:02 PM",
      "body": "The track of the game may be trend to the copyright, so the developers should avoid of copying from the old games. If they made such sound also, they need to pay some money as the penalty. No one will like to do the penalty pay for any reason. Instead of feeling at the end of the game, it’s essential one for the precarious position to avoid such things. Most of the developers will create their own way of sound to be notified by the other project. Surely the new project will look the other games sound. This mostly to get the essential one for knew about the sounds of slot games. So it’s essential to made the unique sounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 11, 2022, 07:23:49 PM",
      "body": "It's probably cheap to get someone to compose a simple backing track for a gambling site. Some might use content that's gone out of copyright and can also modify it (such as speeding up a classical tune or changing its key signature).Have you tried using inspect element to check the resources the site calls to see if there's something well known as an audio like mp3 as you might be able to find the composer, title or a link to where it might be played from (like Spotify)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 11, 2022, 07:39:57 PM",
      "body": "Quote from: Rruchi man on December 11, 2022, 03:59:21 PMI recently played a slot game named \"Wanted dead or a wild\", on Livecasino.io and I so much liked it because of the great soundtrack the game had. I have asked here if anyone has an idea the origin of the songs used in slot games, there was no definite answer, so I am bringing it up here for general discussion. Where do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it?As a composer who knows composers, they just pick and choose or order a song from someone who composes tunes for work. Whole net is flooded by talented composers looking for work or to sell their songs so you can probably find something cheap. But if you want quality work you have to pay for it.Royalties depend on various things. If composer is part any copyright society casino automatically has to play royalties, but it's not much as it's per play per listener. Net streaming has turned royalties to crap. In normal radio they were much higher. Then there obviously are fiverr type services that could basically sell the rights of the song with one time paymenr so casinos wouldn't need to pay anything after that. Also it could be that slot machine team has their own composers / audio effect guys that work for the company. That's what they have been doing in gaming and films. They just hire experts to work with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "December 11, 2022, 08:17:57 PM",
      "body": "Quote from: Rruchi man on December 11, 2022, 03:59:21 PMWhere do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it?Usually, soundtracks on various games came from their own sources or they outsource those kinds of things from different platforms that offer this service and I think it's just the same with gambling slot games. However, I highly doubt that they outsource and provide royalty to the artist who produces these soundtracks as it will cost them a lot and it may cause confusion on how to pay royalty as it's a gambling game, but things might be different if they produce a custom soundtrack and requested it to be played by famous artists.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 11, 2022, 08:29:50 PM",
      "body": "Quote from: Rruchi man on December 11, 2022, 03:59:21 PMI recently played a slot game named \"Wanted dead or a wild\", on Livecasino.io and I so much liked it because of the great soundtrack the game had. I have asked here if anyone has an idea the origin of the songs used in slot games, there was no definite answer, so I am bringing it up here for general discussion. Where do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it?I think they hire professional composers for them to create soundtrack for their slot games.They can't just download anything in the internet even if it's for free. I mean slot games operation are a billion dollar business, so they need to look it very professional. They can spend hundreds of thousand or even million to get a great composer. And still the margin of profit is going to be very huge for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "December 11, 2022, 08:39:57 PM",
      "body": "If it's not original music specific for that game then there are the sound marketplaces where they can purchase the licensing of that music to be used over their content.It's a popular market niche these days where everyone who wants to have that unique sound, can purchase it for permanent usage or just for a specific period of time. But mostly, with these games, they're buying or having someone to work for that music and have it permanently for the license.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "December 11, 2022, 09:01:35 PM",
      "body": "Quote from: Baofeng on December 11, 2022, 08:29:50 PMI think they hire professional composers for them to create soundtrack for their slot games.You're right.This slot game is made by https://www.hacksawgaming.com/These guys are a pro game developer and they have a team of programmers and designers who made these things from scratch. The music is composed for the game and I'm pretty sure they have all the rights.It's not that hard to make music if you have some experience. It takes time just like drawing or painting but a good composer can make a short tune like the one you hear in slot machines in a couple hours. The soundtrack is on youtube if any of you want to hear it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 11, 2022, 10:08:06 PM",
      "body": "I've used to watch content creators on YouTube and some of them said that their fans have asked them where they're getting their background musics/soundtracks. One of the most mentioned is epidemic sound.Maybe some casino developers are also getting music there, they're not for free and there could be agreements that they would sign for a royalty for using that music or Quote from: Baofeng on December 11, 2022, 08:29:50 PMI think they hire professional composers for them to create soundtrack for their slot games.I agree, they can just outright hire someone to compose one for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "December 11, 2022, 10:20:19 PM",
      "body": "Quote from: Rruchi man on December 11, 2022, 03:59:21 PMWhere do slot game developers get the soundtracks they use in their game development? Are soundtracks made specifically for every game (that will be an extra budget) or do they use selected already existing soundtracks and just pay the creators some royalty for using it?I believed you will get the most accurate answers from the game developers/game providers instead of us here in the community.Not unless a part of the developing team will lurk here and they will be able to read this thread or spend time responding here.In that case, if I have the same concern, maybe I will contact the game provider of that game and will wait for their response. Let's see if they will give some details about the said concern since, after all, the music-related thing shouldn't be something that isn't harmful to discuss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 11, 2022, 10:29:06 PM",
      "body": "For me, I think I have played more than five different games on stake.com and they all had the same soundtrack, so by this, I don't think soundtracks are created differently for each and every game, there are some group of slot games that come with the same soundtrack.And also, me being someone with experience in music development, I would tell you that creating those sound tracks are not as hard as you might think, it is something a professional and good music developer can do in less than 1 hour or 30 minutes, developing the slot game itself is far more heftier than creating and adding the soundtrack to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "December 11, 2022, 10:36:33 PM",
      "body": "Quote from: Fivestar4everMVP on December 11, 2022, 10:29:06 PMFor me, I think I have played more than five different games on stake.com and they all had the same soundtrack, so by this, I don't think soundtracks are created differently for each and every game, there are some group of slot games that come with the same soundtrack.And also, me being someone with experience in music development, I would tell you that creating those sound tracks are not as hard as you might think, it is something a professional and good music developer can do in less than 1 hour or 30 minutes, developing the slot game itself is far more heftier than creating and adding the soundtrack to it. I'm not much into music, based on what you've said I understood that music making is simple for a professional to create for a slot game. The music needs to be created relative to the theme which takes a little time. Most of the time game developers never give importance to music, at times some used to get attracted to these music. One such experience is shared by OP. When I was into gambling even if the volume is at the high, it never reaches ny ears.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}