{
  "id": "topic_5513561",
  "title": "wiss19",
  "author": "wiss19",
  "created_time": "October 17, 2024, 06:46:24 PMLast edit: October 18, 2024, 09:07:13 AM by wiss19",
  "content": "Foreword:HBO recently aired this documentary on bitcoin as everyone was waiting on it, while there are some people who talked about it, I would like to talk about what the general documentary was about and what happened and basically give an overall summary of the entire thing. Mind you, I am not a journalist and I am not some movie critic or anything like that neither, so this is going to be just straight up me, and what I think about the whole situation basically and how this Cullen Hoback basically made a mockery of himself entire time.First of all, the entire thing starts with the idea of what bitcoin is, and explains the entire situation about bitcoin, because not everyone may know what bitcoin is, even to this day we have some people who do not understand how it works, but they can watch this on some youtube video and understand it in five minutes so this part is useless. They move to the \"big question\", because after all, even when talking about what bitcoin is, they talk about \"someone named satoshi nakomoto created it, but who is he?\" as a cutaway to their real reason for shooting this, which is trying to figure out who satoshi is. However, they can't just make a documentary and say \"well we don't know\", so they end up trying to chase it and try to figure it out.They start with the early people, the cypher punks, Adam Becks and other people, basically people who were forefathers of bitcoin with how they dealth with anonimity in online world, which leads to an interesting character. Someone who is so anarchist, dude went to fight off ISIS in syria, definitely looks like a few screws are loose on his mind, but doesn't look harmful person at the very least. Then they just move to segway where they explain everyone, from gavin to hal to basically everyone involved with crypto on early stages of it. They talk about how Gavin and Satoshi fell apart as well, because Gavin wanted ot take bitcoin to legit side and went to talk with fbi, whereas satoshi didn't want government approach.Later on they talk about silkroad, and all the illegal ways bitcoin is used, to explain why the bitcoin people was upset about how it was used, roger ver basically talks about how they could turn this into business thing and not some illegal anarchist thing, and there were talks about the block size war as well. It was made out to be \"anarchists versus business people\" but in reality, it was \"people who do not want to pay a ton of money to miners versus miners\" and they didn't mention that part at all of course.Then it moves to a person called Samson, I have to admit this dude turns out did a lot for bitcoin and I never heard of him even though I have been here for over eight years, which is my mistake because he has actually done a lot. He met with nations, governments, princes, kings, central banks, and he was one of the few people Bukele take up on stage when he made bitcoin legal tender. He is a maximalist of bitcoin as a dictionary meaning of the word, he is definitely someone who is helping bitcoin grow, more than most of us here, probably all of us. And he was asked a bunch of questions about everything, from satoshi himself, to a million bitcoin being burned, and everything else. He is not focused on any of that, and he only cares about the future, because questions of the past doesn't change the future and he only focuses on making the future a better place for bitcoiners.Lastly, we have Peter Todd, who they talk with a lot, and who helped with replace by fee structure as well, and basically they ended up with a lot of ways where he is \"lying\" or at least looks like lying but doesn't even have to be lying, that's just what Cullen Hoback thinks, and if the director thinks Peter is lying, he can definitely make the documentary look like Peter is lying of course. From John Dillon, to FBI, to joking about he is satoshi, basically they have no serious talks at all. I believe we are going to see a ton of people mocking Cullen Hoback because of this in the future, and I doubt his documentaries will ever be taken seriously because of this as well. Peter Todd never says he is not satoshi, in fact, he is so obviously not satoshi that he actually jokes about how he IS satoshi, and never disagrees, and just laughs at directors face. At one point near the end he basically says director will be mocked to his face, and he was definitely right.So, what made the director think Peter Todd was Satoshi Nakomoto? What kind of \"proof\" does Cullen Hoback provide to the world to say he thinks Peter is satoshi?https://bitcointalk.org/index.php?topic=2181.msg28739#msg28739This. Yeap, you heard it right, he thinks, this message looks suspicious and this is why he thinks Peter is Satoshi. He thinks, because that message comes after satoshi writing something, and the message looks like its finishing a thought, he thinks satoshi basically forgot to switch off the users he has, he had one Peter Todd account and one satoshi account and peter just forgot to change and finished his own thoughts with his other account. Caught! Lol. He obviously talks about timing too, because only 2 days after this post, satoshi disappears completely, and also Peter doesn't come back for nearly 2 years as well, which Cullen thinks its only to throw people of his track. So there you have it, a short story of how a director came up with a bitcointalk post to figure out who satoshi is. As silly as it sounds, HBO actually paid this dude to make a documentary about bitcoin, and because he couldn't come up empty handed, and because if he said Gavin or Hal it would be just like any others, then we can't really have a zero sum documentary, so he had to come up with an original idea and \"this post looks suspicious\" was his hill he wanted to die on. Makes no sense, but you can take whatever you will out of this, I find it silly and funny and will mock this Cullen dude for a long time whenever I hear his name, but I hardly believe he will ever be heard ever again, he will return back to being a nobody.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5513561",
  "comments": []
}