{
  "id": "topic_5405361",
  "title": "multidice.io",
  "author": "multidice.io",
  "created_time": "July 06, 2022, 09:27:44 AMLast edit: September 06, 2022, 10:34:13 AM by multidice.io",
  "content": "We just launched the Multidice.io ICO (Initial coin offering).Buy Multidice Token (MDICE) and be part of the most advanced crypto betting site!MDICE Token specificationsName: Multidice TokenSymbol: MDICENetwork: ETH - ERC20Total supply: 40 000 000Price: 0.2$Hard cap: $3 880 000Soft cap: $760 000Multidice intends to become the new paradigm of online gambling, a place where players, creators and investors explore multigame, multicurrency and multiplayer global solutions.Token AllocationWe will be issuing 40 000 000 MDICE tokens as part of our ICO. No additional tokens will be created. 65% of the tokens will be sold in the successive rounds of the crowdsale.ICO Funds UsageMultidice.io will use the funds raised during the crowdsale for engineering & development, operations and administration, marketing & promotion, legal affairs, while keeping a reserve for unexpected expenses and future expansions. Airdrop & Bounties Multidice is launching an Official Airdrop and Bounties program to reward its supporters totaling 1 200 000 MDICE (3% of the total supply). Check the details of the Airdrop here.Affiliate programJoin the Multidice.io ICO Affiliate Program and receive up to 5% commission for every user that buys tokens through your link. You can build your network up to 3 levels of referrals.CommunityTwitterFacebookRedditYoutubeInstagramTelegramMultidice Public Sale is live - Buy MDICE tokens here",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405361",
  "comments": [
    {
      "author": "teslag",
      "created_time": "July 06, 2022, 12:34:28 PM",
      "body": "please post about your team, white paper and your project social meda.  so that it is not considered a scam project",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "July 06, 2022, 01:33:22 PM",
      "body": "We added the links to social media.You can see the team on the ico website.The whitepaper will be published soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "July 11, 2022, 09:55:38 AM",
      "body": "The 1st week of the Multidice ICO Airdrop is ending today!Don't forget to submit your weekly report to get free MDICE tokens. Check details here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "July 14, 2022, 09:53:10 AM",
      "body": "The 2nd week of the Multidice ICO Airdrop is ending soon!Don't forget to submit your weekly report to get free MDICE tokens. To submit the report, go to Multidice.io, sign up and follow the instructions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koang",
      "created_time": "July 15, 2022, 10:41:12 AM",
      "body": "Quote from: multidice.io on July 14, 2022, 09:53:10 AMThe 2nd week of the Multidice ICO Airdrop is ending soon!Don't forget to submit your weekly report to get free MDICE tokens. To submit the report, go to Multidice.io, sign up and follow the instructions.The gambling industry has proven to be resilient in both bear and bull markets, and the usage of cryptocurrencies in gambling stays constantBut there are plenty of Popular gambling sites out there, so what makes this project different and deserves more attention than existing sites?The airdrop (Bounty) that you launched did not get a good response from the community.Just 37 members on TG and 49 Followers on Twitter, So far",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "July 18, 2022, 11:01:12 AMLast edit: July 18, 2022, 02:41:45 PM by multidice.io",
      "body": "Quote from: koang on July 15, 2022, 10:41:12 AMQuote from: multidice.io on July 14, 2022, 09:53:10 AMThe 2nd week of the Multidice ICO Airdrop is ending soon!Don't forget to submit your weekly report to get free MDICE tokens. To submit the report, go to Multidice.io, sign up and follow the instructions.The gambling industry has proven to be resilient in both bear and bull markets, and the usage of cryptocurrencies in gambling stays constantBut there are plenty of Popular gambling sites out there, so what makes this project different and deserves more attention than existing sites?The airdrop (Bounty) that you launched did not get a good response from the community.Just 37 members on TG and 49 Followers on Twitter, So farThanks for your feedback. We think that our site has a huge potential for grow. We are the crypto games site that accepts more currencies (50+). With our ICO we aim to expand our site, adding new games, new features and new currencies to Multidice.io.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "July 18, 2022, 11:09:00 AM",
      "body": "The 2nd week of the Multidice ICO Airdrop is ending today!Don't forget to sign up to our website and submit your weekly report to get free MDICE tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "July 25, 2022, 08:41:31 AM",
      "body": "Check the latest Multidice ICO listings:IcoholderFoundicoIcolinkIdodar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "July 30, 2022, 09:04:57 AM",
      "body": "Multidice ICO is now listed on CryptoCompare",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "August 01, 2022, 03:55:58 PM",
      "body": "❗️ The Pre Sale of #MDICE token just ended!🗓 Public Sale is going to start on September 5th,Meanwhile you can still claim free #MDICE from the #Multidice airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "August 05, 2022, 11:00:55 AM",
      "body": "💎 We just completed the approval of #Multidice tokens of all submitted reports. ➡️ Check on your Wallet page if you have received free MDICE. 🗓 You still have until Monday 8th to submit the latest airdrop report and get free #MDICE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "September 01, 2022, 09:26:17 AM",
      "body": "We are working in some improvements before the launch of the Public Sale 1:Publication of the whitepaperChanges on the airdrop and bountiesImproved affiliate programMore detailed roadmap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "September 01, 2022, 07:38:42 PM",
      "body": "Quote from: multidice.io on September 01, 2022, 09:26:17 AMWe are working in some improvements before the launch of the Public Sale 1:Publication of the whitepaperChanges on the airdrop and bountiesImproved affiliate programMore detailed roadmapAs many know about casino tokens, only few of them actually are receiving positive interest from the players.Do you think you have your resources and plans that will make this token achieve what you want for this token?Also, the fate of the token usually depends on the performance of the gambling site itself. Are you dedicating the site to the dice game only? You have so many known competitors already when it comes to dice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "September 05, 2022, 03:28:49 PM",
      "body": "Multidice ICO Public Sale is liveThe Public Sale of Multidice ICO just started! You can buy MDICE token for $0.12, that's a 40% discount! The crowdsale will last 3 months with bonus decreasing every month. Check the details here.Improved Affiliates, Airdrop & BountiesWe increased the reward for the Affiliate program, now you can get up to 5% referral commission. We decided to separate the Airdrop (one time free reward) and the Bounty program (get rewards for doing tasks such as blog articles or youtube videos). Updated multidice.io websiteWe made some improvements in both our dice game website and ico website. We solved some minor bugs (for example: sorting of bankroll tables) and made some changes on the design. The ICO website now contains more information about Multidice project: new features, detailed roadmap, extended team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "September 27, 2022, 03:42:43 PM",
      "body": "This is the last week of the 1st phase of #Multidice ICO Public Sale!You can buy #MDICE tokens for $0.12, that's a 40% discount! Check the #ICO calendar at https://multidice.io/ico-home#buyPromote Multidice ICO on social media and get up to 160 MDICE every week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blowon",
      "created_time": "September 29, 2022, 05:35:28 PM",
      "body": "Quote from: multidice.io on September 27, 2022, 03:42:43 PMThis is the last week of the 1st phase of #Multidice ICO Public Sale!You can buy #MDICE tokens for $0.12, that's a 40% discount! Check the #ICO calendar at https://multidice.io/ico-home#buyPromote Multidice ICO on social media and get up to 160 MDICE every week.it's best to make a special thread for your bounty campaign, many people don't know if it's only available on your website, by making it more special you will definitely get more participantsby the way how much has been collected in the sale of ico?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hokilucky92",
      "created_time": "September 30, 2022, 05:26:58 PM",
      "body": "can we contact the team regarding the promotion?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "October 03, 2022, 04:43:52 PM",
      "body": "Public Sale phase 2 is live!Stage 1 of the Public sale of Multidice ICO is over and the Stage 2 started today with a total supply of 6 million MDICE tokens and a price of 0.16$/MDICE, that's a 20% discount!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "multidice.io",
      "created_time": "October 31, 2022, 03:36:25 PM",
      "body": "Public Sale phase 3 is live!Stage 2 of the Public sale of Multidice ICO is over and the Stage 3 starts today with a total supply of 10 million MDICE tokens and a price of 0.2$/MDICE. This is the final sale of Multidice ICO!Bounty program tokens awardedAll the submitted claims for the Bounty Program have been reviewed and the tokens awarded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}