{
  "id": "topic_5411625",
  "title": "Crypt0S0ul",
  "author": "Crypt0S0ul",
  "created_time": "August 29, 2022, 05:53:42 PM",
  "content": "The accounts are -FanEagle Legendary -bc1qrye76e3vwnzmjmlycg9kmz469ks0w7q0ytduvqdarewaller Hero - bc1qrs5scdtnuj2cuj5f8hw7kq6khkpvt5quxpu9gaCaptain Corporate Sr. -bc1q5mzrw2sv7cl7j3mfcr3xxv3x6wnq3hvr6te3p5Check The ConnectionsHere bc1qrs5scdtnuj2cuj5f8hw7kq6khkpvt5quxpu9ga [darewaller] sent 0.00714000 BTC to bc1q5mzrw2sv7cl7j3mfcr3xxv3x6wnq3hvr6te3p5 [Captain Corporate].Here bc1qrs5scdtnuj2cuj5f8hw7kq6khkpvt5quxpu9ga [darewaller] sent 0.00923135 BTC to bc1qe0uamq58f740zq6my2pp7w8tp86mtje2c9hapv [middle account]Now, bc1qrye76e3vwnzmjmlycg9kmz469ks0w7q0ytduvq [FanEagle] sent 0.00868300 BTC to bc1qe0uamq58f740zq6my2pp7w8tp86mtje2c9hapv [middle account]Quotebc1qrs5scdtnuj2cuj5f8hw7kq6khkpvt5quxpu9ga [darewaller] > bc1qe0uamq58f740zq6my2pp7w8tp86mtje2c9hapvbc1qrye76e3vwnzmjmlycg9kmz469ks0w7q0ytduvq [FanEagle] > bc1qe0uamq58f740zq6my2pp7w8tp86mtje2c9hapvbc1qrye76e3vwnzmjmlycg9kmz469ks0w7q0ytduvq [FanEagle] > bc1q8ejqu0x7km56fapkkj9v7h3uc8z6wt0gfw3ppr > bc1q5mzrw2sv7cl7j3mfcr3xxv3x6wnq3hvr6te3p5 [Captain Corporate]If you check those addresses, you will know what's happening.Now, You may ask what's wrong if all of them are owned by the same person. Well, there is nothing wrong with owning multiple accounts. But, It's unethical to try to cheat the signature campaign by trying to enroll multiple accounts. Three accounts applied to the LiveCasino.io Signature campaign.Quote from: Captain Corporate on June 09, 2022, 09:17:33 PMUsername: Captain CorporatePost count: 1808 (including this one)BTC address (SegWit): bc1q5mzrw2sv7cl7j3mfcr3xxv3x6wnq3hvr6te3p5Livecasino.io username: CaptainCorporatehttps://ninjastic.space/post/60324502QuoteUsername:  darewallerPost count:  3462BTC address (SegWit):  bc1qrs5scdtnuj2cuj5f8hw7kq6khkpvt5quxpu9gaLivecasino.io username:  darewallerhttps://ninjastic.space/post/60324461QuoteUsername:  FanEaglePost count: 6266BTC address (SegWit): bc1qrye76e3vwnzmjmlycg9kmz469ks0w7q0ytduvqLivecasino.io username: Faneaglelchttps://ninjastic.space/post/60324527Two of them Applied to the Cloudbet Signature Campaign (One Accepted)Quote from: darewaller on June 13, 2022, 08:46:38 PMUsername: darewallerCurrent post count: 3462BTC SegWit Address:  bc1qrs5scdtnuj2cuj5f8hw7kq6khkpvt5quxpu9gaQuote from: Captain Corporate on May 18, 2022, 08:16:11 PMUsername: Captain CorporateCurrent post count: 1739 (including this one)BTC SegWit Address: bc1q5mzrw2sv7cl7j3mfcr3xxv3x6wnq3hvr6te3p5I am active in the Turkish Local Board.Two of them Applied to the Fortunejack Signature Campaign.Quote from: FanEagle on December 23, 2021, 06:53:34 PMBitcointalk Profile Link:  https://bitcointalk.org/index.php?action=profile;u=144315Current amount of posts (Including this one):  5930bech32 BTC Address:  bc1qrye76e3vwnzmjmlycg9kmz469ks0w7q0ytduvqEARNED merit in the last 120 days:  10Quote from: darewaller on December 24, 2021, 11:14:32 AMBitcointalk Profile Link:  https://bitcointalk.org/index.php?action=profile;u=557005Current amount of posts (Including this one):  3008bech32 BTC Address:  bc1qrs5scdtnuj2cuj5f8hw7kq6khkpvt5quxpu9gaEARNED merit in the last 120 days:  8Not only that But on many other campaigns.At least they deserve a neutral mark as connected accounts and maybe try to cheat (IDK the intention)AnotherAlt",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411625",
  "comments": [
    {
      "author": "shasan",
      "created_time": "August 29, 2022, 06:04:27 PM",
      "body": "You have tried your best to make the accusation. But I do not think it is a valid point to considered those as alt account. Anyone can make transaction with anyone. Even there might have a large community who may make transaction with each other. Better try to find out more connection eg: social media profile, posted same information on the proof of authentication post either on bounty or on signature campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 29, 2022, 07:40:03 PM",
      "body": "Quote from: shasan on August 29, 2022, 06:04:27 PMAnyone can make transaction with anyone. Even there might have a large community who may make transaction with each other. Thi,s they should be able to explain if this thread is brought to their attention. If they are innocent, i think most community members here will understandQuote from: shasan on August 29, 2022, 06:04:27 PMBetter try to find out more connection eg: social media profile, posted same information on the proof of authentication post either on bounty or on signature campaign. Some members are cunning, they know that they can easily be caught with such information so you won't find them posting the same social media handles.I would really be more interested if the addresses were from the same wallet, but the proof in the OP too could mean perhaps some further investigation before making a rush decision. Meanwhile I am counting on the accused to come defend themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "August 29, 2022, 08:01:15 PM",
      "body": "In almost the same case, I had to remove negative tag and close my case investigation against 16 accounts collecting assets in one wallet. I assume that it is an off-forum transaction which can occur from any user regardless of friend or otherwise. Some of them are considered collectors, but some of them can happen because of other legitimate things such as loans, payment of services, or others. So in your case, I agree with shasan that you must attach strong additional evidence. But I don't know, I haven't tried to go deeper for the 3 accounts but I think two of them [FanEagle and Captain Corporate] are active on two different local board, Italian and Turkey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 29, 2022, 08:56:52 PM",
      "body": "Sorry Crypt0S0ul,  but the evidences you have provided do not prove anything. Some members sending coins to each other,  there is nothing wrong in that and it doesn't mean they are the same person.If you check one of my addresses you will find that I have received/sent bitcoin to other forum members too.You can say they are alts with total certainty only if they use the same address or the same wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0S0ul",
      "created_time": "August 30, 2022, 01:05:23 AM",
      "body": "I want to reply to everyone at once. Yes, I do believe it's possible to do the transaction outside of the forum and also possible to make transactions with a lot of accounts. But, Almost all the transactions of those five wallets are regularly circling, and it looks suspicious to me. Yes, Still, it doesn't mean they are alt accounts. They must be able to explain if they are doing business or other things. Let's hear from them. I am not sure about FanEagle. But, I believe Mr. darewaller and Captain Corporate are alts.@_Blackstar, Alt accounts are allowed. So, It's not appropriate to tag someone just because of being alt. I have an Alt account too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "August 30, 2022, 03:44:20 PM",
      "body": "Quote from: Crypt0S0ul on August 30, 2022, 01:05:23 AM@_Blackstar, Alt accounts are allowed. So, It's not appropriate to tag someone just because of being alt. I have an Alt account too.Why not, you can tag them alt with a neutral tag if they don't cheat the campaign [prove that they are alt], but if they cheat the campaign or anything else that violates the rules then the negative tag should be raised.I've been learning a lot lately and maybe I will be more careful in conducting my investigations before bringing charges against them because if it is not proven then I think I have disturbed the accused. I must refrain from accusing someone again without valid, strong and accountable evidence because this concerns the reputation of others. If in fact I still have doubts about the evidence, then I will not make a thread especially if it is an accusation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0S0ul",
      "created_time": "September 01, 2022, 04:51:04 AM",
      "body": "Whoever is involved in this thread so far, I want to let you know that it's been over two days since I PM'ed All three accused members. None of them at least replied to me nor responded to this thread. Don't you think this is another Red Flag? I often see reporters being strict about their claims. But I don't want to be a smart ass. Two days is enough to make a fairy tale and write this thread. If no one believes me, I will mark them with a neutral tag since none of them responded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scam Exposey",
      "created_time": "September 01, 2022, 05:18:16 AM",
      "body": "Transaction to each forum member is natural since we can deal with anybody here. Your proof is lacking and seems you only want to destroy someones reputation. If you think your right and I believe you really think your right with your claims that's why you posted this better leave a neutral trust on their accounts.Also if I where the accused person I will also not reply with you because its irrelevant to talk about nonsense thing which doesn't need your energy to waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "September 01, 2022, 05:20:12 AM",
      "body": "Quote from: Crypt0S0ul on September 01, 2022, 04:51:04 AMWhoever is involved in this thread so far, I want to let you know that it's been over two days since I PM'ed All three accused members. None of them at least replied to me nor responded to this thread. Don't you think this is another Red Flag? I often see reporters being strict about their claims. But I don't want to be a smart ass. Two days is enough to make a fairy tale and write this thread. If no one believes me, I will mark them with a neutral tag since none of them responded. You could be 100% correct, but you also could be 100% incorrect. Lots of factors point towards correct but IMO you need to have more proof before accusing. It could be considered slander or you slinging shit at the wall to see what sticks. You also don't need a separate thread for each group you are finding as alts. Make a thread like Timelords or report in his thread. No need to make 1000 different threads.(FYI this isn't me criticizing you because I think you are wrong. I'm trying to help a little and want you to present your proof in a more solid matter. I think you're 99.9% correct most likely, but I don't want to see someone's rep ruined if you are wrong. This community can be brutal sometimes so keep that in mind.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "September 01, 2022, 08:47:31 AM",
      "body": "I ignored it until OP gave a trust rating. I still would love to ignore it if I could but he found good enough \"reason\" to put a trust rating for some reason even though the whole topic and everyone is saying that its not enough proof. OP is basically merit chasing, trying to grind merits and starting a new topic every single time he is suspicious of something. It is good that we have people chasing scammers and what not, thats what trust was for, but to spend time and told that you are wrong and you do not have enough proof and then claiming foul even when everyone else tells you its not? Thats not helping the forum, thats literally trying to grind merit even when you are making the forum worse.I am not any of those people, I am captaincorporate, come talk to me on telegram @captaincorporate, or you can check my politicwars.com new business, or go join our telegram channel and ask about me. I have been around for many years, and I have been doxxed and did audit and KYC on my project as well and can even see my face on all my projects as well. If you still have a doubt, I am sorry but it is on you and you are the one who is trying to \"find\" something that isn't there and can't handle the truth that you failed and couldn't find something even when a dozen people told you to and still left a trust rating because I just decided to ignore you, I ignored you because you are unimportant, remove the trust rating and move on to another account.Check the team on politicwars.com whitepaper, I am the chief marketing officer there, I do marketing help to many many people, both here and outside, because I understand how crypto marketing works. Worked as social media manager, worked as content writer, worked as medium writer, worked as community manager, worked as many positions to many people all around the world. People know who I am, and if you want further details, write to me on telegram before making claims that NOBODY believes... silly move mate.can I go back to ignoring you now? Are you satisfied?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0S0ul",
      "created_time": "September 01, 2022, 08:57:46 AM",
      "body": "Quote from: Captain Corporate on September 01, 2022, 08:47:31 AMcan I go back to ignoring you now? Are you satisfied?You don't need to write a noble book here. I don't want to know who you are, your position, and where you are employed. You ignored a simple question. I found the connection between you guys, and you can answer how you know them and the purpose of the transaction. This is how the story can be ended. But, You came up here with your career history. Don't you think it's a serious question? I am suspicious of you guys because I saw those accounts connected with transactions, and they all applied in the same campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "September 01, 2022, 09:11:56 AM",
      "body": "Quote from: Crypt0S0ul on September 01, 2022, 08:57:46 AMI am suspicious of you guys because I saw those accounts connected with transactions, and they all applied in the same campaign. I gave you the reason, I told you that I work in marketing, if you didn't get from that then I am sorry but that is not my fault. I do marketing work for many people both here and out of here. I literally worked with many people here and wrote you this, why is it so weird for you to understand the fact that I did marketing for not just two, but close to 20 people here? I also check the services section daily to see if there is any places to apply, thats about 200-250 dollars per month added income, I apply to all that I am eligible for, I don't care if the customers also apply or not, I don't check that. Isn't it normal that 2 people who work in projects together, have their own accounts, and apply to ALL campaigns they can? Can't you even imagine that being possible? This isn't a strech of imagination, this is literally the easiest thing to consider. That is literally why people didn't believe you here.I am not giving you my career CV here, I am telling you the reason, read, understand, and remove the tag already because you are wrong on this one, people told you that you are wrong, and I ignored you because you were wrong, and you still didn't get it, you still left a tag, because you want to chase merits and be right, well its not this time, but I do hope you catch people next time, it will at least do some good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0S0ul",
      "created_time": "September 01, 2022, 09:39:40 AM",
      "body": "Quote from: Captain Corporate on September 01, 2022, 09:11:56 AMSnipIndeed, I see only angriness and attacking answers. Why so? I didn't know you were doing marketing or whatever you claimed. Don't I have the right to suspect something? I just asked you a simple question, and you seem to be trying to attack me just because I created this thread. I don't see any post you made this year except the Signature campaign application in the service thread. Anyways, I don't want to misjudge you. I am not a DT member, so my neutral won't be shown as Default trust. I need some times to think about this. I will reconsider removing my feedback if I think you are right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "September 01, 2022, 09:53:00 AM",
      "body": "Ok, understandable. I told you the reason, everyone told you that it isn't enough proof, and yet you still left a tag. I find it bothersome, and I am not attacking you, I have no intention at all, in fact I ignored you at first until you left a tag, which I disliked. You tried to hurt my signature campaign income, which is 200-250 dollars per month, that is attacking, what I \"said\" is not even close to that, so you started attacking me first, even after many people told you not to. Think it over, come chat with me on video chat and I can show my face and all if you want, and realize that you were wrong on this one. I will give you as much time as you want, but the result will be the same",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "September 01, 2022, 11:09:47 AM",
      "body": "Quote from: Captain Corporate on September 01, 2022, 09:53:00 AMOk, understandable. I told you the reason, everyone told you that it isn't enough proof, and yet you still left a tag. I find it bothersome, and I am not attacking you, I have no intention at all, in fact I ignored you at first until you left a tag, which I disliked. You tried to hurt my signature campaign income, which is 200-250 dollars per month, that is attacking, what I \"said\" is not even close to that, so you started attacking me first, even after many people told you not to. Think it over, come chat with me on video chat and I can show my face and all if you want, and realize that you were wrong on this one. I will give you as much time as you want, but the result will be the same Multiple users said there wasn't enough proof, that is true. That also doesn't mean his accusation is false. It just means he needs more proof before posting it. Having a video chat with you will not prove anything except this 1 account was willing to chat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "September 01, 2022, 11:48:42 AMLast edit: September 01, 2022, 01:03:46 PM by dataispower",
      "body": "Quote from: Crypt0S0ul on September 01, 2022, 08:57:46 AMQuote from: Captain Corporate on September 01, 2022, 08:47:31 AMcan I go back to ignoring you now? Are you satisfied?You don't need to write a noble book here. I don't want to know who you are, your position, and where you are employed. You ignored a simple question. I found the connection between you guys, and you can answer how you know them and the purpose of the transaction. This is how the story can be ended. But, You came up here with your career history. Don't you think it's a serious question? I am suspicious of you guys because I saw those accounts connected with transactions, and they all applied in the same campaign. The only place i should be angry @ Captain Corporate is that since this thread has being made and it took time to respond to it, that means he is slightly afraid of the accusation from the beginning, what you no that you are not guilty of, will not take you days to respond to it. But op every body who reply your report suggested that their is no enough proof to justify those accounts, so if you have any other proof that is authentic you can table it to public to see if the accounts is connected or not. And sometimes some can send somebody coin in the wallet but they are different person due to business outside the forum, that does not mean that is the owner of the wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 01, 2022, 12:28:21 PM",
      "body": "OP, owning alternate accounts is not prohibited. In addition, even if this is true, then all three accounts today participate in different signature companies. One of them speaks Turkish and has posted in the Turkish local section. There would be more evidence, at least on a linguistic basis, but even here I did not find any matches. Although it would be very easy to have three accounts and make a mistake and write in Turkish at least once, But it doesn't; at least I didn't see it. In any case, if you accuse, you should provide additional evidence, not just these three accounts. So far, you haven't done enough of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "September 01, 2022, 06:09:01 PM",
      "body": "Quote from: Crypt0S0ul on August 29, 2022, 05:53:42 PMTwo of them Applied to the Cloudbet Signature Campaign (One Accepted)Two of them Applied to the Fortunejack Signature Campaign.Quote from: lovesmayfamilis on September 01, 2022, 12:28:21 PMOP, owning alternate accounts is not prohibited. <snip>Quote from: Crypt0S0ul on August 30, 2022, 01:05:23 AM@_Blackstar, Alt accounts are allowed. So, It's not appropriate to tag someone just because of being alt. I have an Alt account too.I had to quote one or two users before my post. It is known that owning alts is allowed in the forum, however what is not allowed is cheating the forum with your alts. Such as joining same Campaign with your alt or sending merits to your alt.Then I have a cutout case to present here. The op identified two cases where his accused both applied  for the same campaign - Cloudbet and Fortunejack. My question is, assuming they are truly alts, then a slot opens in Fortunejack and he decided to apply with his two accounts to stand a better chance of being accepted in either accounts. We know that it must be one person that would be accepted. That is to say, it is not possible for both accounts to be accepted. Do we call it smartness or is it cheating for applying with both accounts?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 01, 2022, 08:42:19 PM",
      "body": "Shesan took his comment right from my thought, there is absolutely no evidence to prove this accounts are connected, all that the op pointed out, though good, but those are not evidences, cause as Shesan said, forum members transact between each other, Infact, I personally have transacted with a couple of forum members who also transacted with other forum members too.If we are to go by OP's type of evidence for connected accounts, it simply means I am connected to those accounts I've transacted with, and also, the accounts, the account I transacted with, transacted with also connected with me - which actually is not correct.So respectfully speaking, I think OP should do a proper investigation next time before wrongly accusing accounts of being connected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}