{
  "id": "topic_5521104",
  "title": "uchegod-21",
  "author": "uchegod-21",
  "created_time": "November 29, 2024, 08:11:16 PM",
  "content": "Just as the title suggests, which is a better method of bitcoin investment. I will appreciate an in-depth explanation with relatable historical data.1. Buying and hodling BTC for two circles (two bear and two, 8 years).2. Buying and hodling BTC for only one circle, sell all during the bull run and wait for the next circle to buy again.3. Buying and hodling BTC for one circle, sell 50% during bull run and leave 50% to continue investment in the next circle?Which will give a better profit within 8 years.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521104",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 29, 2024, 08:16:15 PM",
      "body": "I prefer to buy and hold bitcoin for only one circle, sell all during the bull run when the price has already increased significantly and wait for the next circle to buy again. I will buy when the bear market has been very significant. But it is hard to know the bottom, so I DCA during the time especially if the price hit bottom much further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "November 29, 2024, 08:28:33 PM",
      "body": "Quote from: Oshosondy on November 29, 2024, 08:16:15 PMI prefer to buy and hold bitcoin for only one circle, sell all during the bull run when the price has already increased significantly and wait for the next circle to buy again. I will buy when the bear market has been very significant. But it is hard to know the bottom, so I DCA during the time especially if the price hit bottom much further.This is also what I have done and what I plan on doing continuously. I think waiting for 2 circles is quite too long for me. I have already waited a lot for one circle, I would want to reap my rewards and do something productive or profitable with the money I will earn from the profits from the bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "November 29, 2024, 08:39:05 PM",
      "body": "Quote from: Reatim on November 29, 2024, 08:28:33 PMQuote from: Oshosondy on November 29, 2024, 08:16:15 PMI prefer to buy and hold bitcoin for only one circle, sell all during the bull run when the price has already increased significantly and wait for the next circle to buy again. I will buy when the bear market has been very significant. But it is hard to know the bottom, so I DCA during the time especially if the price hit bottom much further.This is also what I have done and what I plan on doing continuously. I think waiting for 2 circles is quite too long for me. I have already waited a lot for one circle, I would want to reap my rewards and do something productive or profitable with the money I will earn from the profits from the bull run. Let's say only the rich waits for 2 circles. They have other sources of income and not in any need of their BTC investment (capital nor profit). But in theory, around here in the forum, you could see a random advice to hodl for 8 to 10 years. This seems unrealistic in practice while it could easily be dished out as an advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 29, 2024, 08:39:11 PM",
      "body": "Quote from: uchegod-21 on November 29, 2024, 08:11:16 PMJust as the title suggests, which is a better method of bitcoin investment. I will appreciate an in-depth explanation with relatable historical data.1. Buying and hodling BTC for two circles (two bear and two, 8 years).2. Buying and hodling BTC for only one circle, sell all during the bull run and wait for the next circle to buy again.3. Buying and hodling BTC for one circle, sell 50% during bull run and leave 50% to continue investment in the next circle?Which will give a better profit within 8 years.I know a lot of persons would say that the longer you wait the more profits you get which is true but it's no easy job to hold that long especially when you know the ROI have increased significantly so I would say selling 50% in one circle and leave 50% to continue staking up and the reason being personal in the fact that seeing my portfolio all empty would really make my savings impossible again and plus no ever would ever know the actual Dip or bull limit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "November 29, 2024, 08:51:17 PM",
      "body": "It’s much easier if you keep buying and buying while setting a target to sell 50% at a very high profit and hold the remaining 50% for a true HODL strategy. It all comes down to timing, and since everyone has their own goals, either strategy could work for an investor. The simpler, the better.. but what’s most important is having a clear target, as that makes the process much easier.At the current stage, simply holding might not earn you as much profit since Bitcoin has already reached close to $100k. The room for growth isn’t as big compared to when the price was still $1,000. It’s worth considering this kind of factor when setting your target to keep things realistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 29, 2024, 08:59:18 PM",
      "body": "Quote from: uchegod-21 on November 29, 2024, 08:11:16 PMJust as the title suggests, which is a better method of bitcoin investment. I will appreciate an in-depth explanation with relatable historical data.1. Buying and hodling BTC for two circles (two bear and two, 8 years).2. Buying and hodling BTC for only one circle, sell all during the bull run and wait for the next circle to buy again.3. Buying and hodling BTC for one circle, sell 50% during bull run and leave 50% to continue investment in the next circle?Which will give a better profit within 8 years.The first option is the less risky option and for anyone not looking to risk or play the pump and the dump game it is better they stick to it, the number two option is the most profitable if the trend follow the predicted pattern base on the historical chart but it is the most risky of the three options. Reason been that even though history shows that there is a dump after every bull run there is certainly no guarantee that it will work out all the time, imagine selling bitcoin at $100k and the price pumps above it and never get to that point again or even below it then it is more like a loss, even though it is not looking realistic there is still an option of it happening. The third option is just simply playing the safe hands which balances both the first and the second option and I’mTerms of doubt is the better option but will recommend holding all to eliminate any possible risk, although if you can play the game well selling high and buying low is the best strategy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "November 29, 2024, 09:44:07 PM",
      "body": "Well if you ask me I'll go with the first option for hodling for two cycles of the halving. Now before this recent pump in bitcoin's price, many people would go for the option that says hodling for one cycle. However let's do a little math. Before the halving just before this current one we are experiencing it's effect ( more like the previous halving literally around periods of 2020) we were actually floating around 4 digits $8k+ and just over a span of around 4 years we are already 97k+ and Still pushing.If we should calculate the effect in the next 4 years based on the stats of this last four years then we would likely be floating around $180k+ . If you check some people HODL with time in mind and not cycles so once they reach a tagged price they sell off and re buy when we experience a pullback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "November 29, 2024, 09:50:52 PM",
      "body": "Quote from: uchegod-21 on November 29, 2024, 08:11:16 PM2. Buying and hodling BTC for only one circle, sell all during the bull run and wait for the next circle to buy again.This strategy is definitely attractive because it can boost profits while keeping things simple. It’s a different game compared to HODLing, which usually requires patience for years. Bull runs, on the other hand, happen in shorter intervals, so you need to be more proactive.Awareness, this is what we need.. recognizing that the market moves in cycles and taking advantage of those patterns. It’s a repetitive strategy, but as long as you stay tuned to the market’s behavior, you can maximize opportunities without overcomplicating things. take at look at this data, it might be helpful. https://www.techopedia.com/crypto-bull-run-history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 29, 2024, 11:20:05 PM",
      "body": "Quote from: uchegod-21 on November 29, 2024, 08:11:16 PMJust as the title suggests, which is a better method of bitcoin investment. I will appreciate an in-depth explanation with relatable historical data.1. Buying and hodling BTC for two circles (two bear and two, 8 years).2. Buying and hodling BTC for only one circle, sell all during the bull run and wait for the next circle to buy again.3. Buying and hodling BTC for one circle, sell 50% during bull run and leave 50% to continue investment in the next circle?Which will give a better profit within 8 years.I have been using the number 2 option of yours, pretty much stack up everything prior to the pandemic, and then it's easy to save during the pandemic because obviously, you can't go out and so that's one advantage for me during that lockdown. And then I sold all early 2021 to buy something big from my profits.And after that, I just take a break from buying in the next 3 months and then after that, I started to collect, sell some during emergencies, but still continue up to this day to save and accumulate.However, I'm thinking as well with option 3 for next year's biggest bull-run, I might just sold 50% of what I might accumulate till next year and not sell everything. And then the cycle starts again, continue to accumulate in bear market, and then let's see how it goes in the next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "November 29, 2024, 11:31:03 PM",
      "body": "Quote from: Baofeng on November 29, 2024, 11:20:05 PMI have been using the number 2 option of yours, pretty much stack up everything prior to the pandemic, and then it's easy to save during the pandemic because obviously, you can't go out and so that's one advantage for me during that lockdown. And then I sold all early 2021 to buy something big from my profits.And after that, I just take a break from buying in the next 3 months and then after that, I started to collect, sell some during emergencies, but still continue up to this day to save and accumulate.However, I'm thinking as well with option 3 for next year's biggest bull-run, I might just sold 50% of what I might accumulate till next year and not sell everything. And then the cycle starts again, continue to accumulate in bear market, and then let's see how it goes in the next bull run. It's not a bad option when doing option 2 and also option 3. Why?, if you did the option 3 and did get the capital that you spend then leaving the profit or a portion for the next circle won't be a good choice to make since you already earned a profit and got your capital back so it won't be a loss in that case. Selling all of the profit to DCA is also a good choice I think since you only spend the profit that you have gained this bull season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 29, 2024, 11:38:40 PM",
      "body": "Quote from: uchegod-21 on November 29, 2024, 08:11:16 PMJust as the title suggests, which is a better method of bitcoin investment. I will appreciate an in-depth explanation with relatable historical data.2. Buying and hodling BTC for only one circle, sell all during the bull run and wait for the next circle to buy again.It's always been this strategy for me, start of the bear market, accumulate, do DCA, has the mentally to do it. Because there will be times that you will have to question whether what you are doing is right, so just remember to look at the bigger picture, you can't connect the dots early. So just go along and try to accumulate as much as you can in the bear market. You will be tested that's for sure. But if others can do it, then why not you?Quote from: uchegod-21 on November 29, 2024, 08:11:16 PMWhich will give a better profit within 8 years.Hard to say, we need someone to really compute and have the data. But I guess the thing is that we really have to think of how are we going to make profits after that long bear market. That's why for me, just buying and holding for one cycle is already enough. Realized profits at the end is very satisfying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 29, 2024, 11:44:12 PM",
      "body": "I think having a continuous approach in buying is obviously the most profitable strategy for 8 years. But all are not in the same place.So, the very basic call is to get into Bitcoin while in the bear market. Sleep and wait until it matures during the next cycle of bull run. It sounds hard to do so but when you're used to it, you're printing cash for yourself every 4 years with consistency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "November 30, 2024, 01:18:37 AM",
      "body": "Quote from: uchegod-21 on November 29, 2024, 08:11:16 PMJust as the title suggests, which is a better method of bitcoin investment. I will appreciate an in-depth explanation with relatable historical data.1. Buying and hodling BTC for two circles (two bear and two, 8 years).2. Buying and hodling BTC for only one circle, sell all during the bull run and wait for the next circle to buy again.3. Buying and hodling BTC for one circle, sell 50% during bull run and leave 50% to continue investment in the next circle?Which will give a better profit within 8 years.With Bitcoin, if you can hold it, you can get rich. If you can hold your bitcoin longer time, like three more cycles, you can get bigger profit. With past cycles, Bitcoin always makes new all time highs with new Bitcoin block reward halvings and new cycles, so if you can hold your bitcoin through more cycles, you get bigger profit.Case Bitcoin (useful)When you want to take profit or plan your withdrawal, you can refer to a withdrawal strategy built up by JayJuanGee and bitmover.[ANN] JJG Sustainable Bitcoin Withdrawal Strategy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "November 30, 2024, 01:20:29 AM",
      "body": "I would not rely too much on the cycles. I'm in a minority position here in the forum with this opinion, but you should at least consider the possibility that Bitcoin's price doesn't follow the patterns of earlier years.At least my stance is that there is no hard rule that the cycles will last around four years.Reasons for this opinion:1) there were only two complete 4 year cycles (2013-17 and 2017-21), but before those, Bitcoin had a quite clear 2-year cycle (2011-13). 2:1 is a quite thin evidence. If the top of the current cycle happens to be in 2025 (we don't know it) then of course we might have better evidence but still the options \"2024 top\" and \"top after 2025\" are still on the table.2) there were intermediate bull runs in 2019 and 2013 which were almost as strong as one of the \"canonical\" bull markets, i.e. the price at least made a x4 and then fell again by more than 70%:  In 20193) Miners are not too relevant as Bitcoin sellers (only 0,1-0,3% of the daily BTC sell volume is miner driven) so the popular \"post-halving pump theory\" is also quite weak, demand fluctuations almost for sure are more important.4) The current bullish movement \"looks\" like \"from the books of the 4-year cycle theory\", but is primarily news-driven (US election).So if your three options are the only ones you would consider, then I would favour option 3. However the DCA strategy mentioned by others is even better.And my recommendation is to take note of the \"attention economy\" surrounding Bitcoin. There are clearly phases with positive sentiment (like now, but also during the second half of 2023 and the first 3 months of 2024), and other ones with negative sentiment. It's best to buy when everybody is thinking Bitcoin is dead while the other indicators are okay, i.e. if the price is low despite of no fundamental reasons for a Bitcoin crash.A quite interesting strategy is also this one to improve on the DCA strategy.All of these options can of course fail. Thus this is no investment advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "November 30, 2024, 02:03:07 AM",
      "body": "So far I am still on option number one and have held bitcoin for two rounds or two missed cycles, and it does require high patience. Because it is not easy to wait for two rounds or 8 years that I will soon reach, and there is always temptation when bitcoin reaches a new high and this is an experience and also about what I think is extraordinary because when I really need it and I try not to be tempted and look for other alternatives so as not to touch it.And I have a plan to take option number three if bitcoin reaches a new ATH at the end of the second round after 8 years, because I think this is the right time to be able to enjoy the benefits of Bitcoin that I have maintained well for two rounds. Taking a profit of 50% so that I can enjoy and realize what I want and save 50% and continue DCA as I did before which may be longer around 10-12 years or more, because for the next 10 years it is likely that the time when I may not work anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 30, 2024, 02:25:19 AMLast edit: November 30, 2024, 02:36:38 AM by franky1",
      "body": "Quote from: uchegod-21 on November 29, 2024, 08:11:16 PM3. Buying and hodling BTC for one circle, sell 50% during bull run and leave 50% to continue investment in the next circle?Which will give a better profit within 8 years.4. Buy and hoard BTC, sell X0% during a bull run and hoard remaining. then use the received fiat to buy at the correction to increase hoard#buy-low-sell-high-repeat#dont-sell-all-hoard..no one can know the true max a market can peak at nor the true correction new bottomso instead of picking a number and selling all 50% you can try selling 30% at your picked number. and if the price then continues to go up you can sell another 10-20%.. and the same in reverse during the correction. EGif you plan to sell 50% at $150k, try 30% and then set a option to sell 1% per $7k rise. meaning if it gets to $220k you sold 40% in total. if it reached $290k you sold 50% and maximised opportunity whilst still only selling 50% and sticking to the never sell all hoard rulethen if you think the $150k-$290k would then correct down to $80k buy 30% at $80k but then have a 1% buy at every $1k amount below $80k, so if it corrected down to $60k you would have used all that fiat to buy more coin than pre-sell",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 30, 2024, 02:26:16 AM",
      "body": "The most profitable is the second option. In every cycle, there's the ATH and the bottom. If you sell everything during the ATH and buy back during the bottom, you'd have the best profit. But you can't always be accurate in timing the market. It's not as if the cycles are exact copies of each other. It's only predictable and easy in hindsight, when you're looking at past charts. But when you're trying to predict the future, you'd find it hard.Like today, how do you see things would turn out in the near future? Would you wait for $100,000 before selling or you have a higher target? $110,000? $120,000? If the price corrects all the way to $90,000 before even hitting $100,000, would you sell or wait for the rebound? If instead of recovery, the price goes down to $85,000? Would you sell or still wait? My point is, just buy and hodl and add more Sats every time you have extra funds. The safest option on the list is the 3rd, by the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "November 30, 2024, 03:06:52 AM",
      "body": "I prefer the second method to maximize profit but we don't know until when BTC gonna consistently have cyclical period like this where there's bullish season and there's bearish season.once adoption grows large I expect such thing to be a lot more irrelevant and BTC will just be up only with occasional small retracement but nothing meaningful to be considered as bearish.but yeah, seeing the price action so far I think 2nd method yields larger result but one thing you need to consider is you may find it difficult to find bottom and tops. therefore you can pretty well selling when BTC can still go up more than double and buying when it can still go down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "November 30, 2024, 03:58:19 AM",
      "body": "I would choose the third option because I have no courage to choose the second option.If you're good in trading, you can earn more than all the options you mentioned above.Quote from: Darker45 on November 30, 2024, 02:26:16 AMLike today, how do you see things would turn out in the near future? Would you wait for $100,000 before selling or you have a higher target? $110,000? $120,000? If the price corrects all the way to $90,000 before even hitting $100,000, would you sell or wait for the rebound? If instead of recovery, the price goes down to $85,000? Would you sell or still wait? Technically it's still profitable than DCA.You don't have to really predict the peak and the bottom, as long as you're sell high and buy low, you will outperform people who DCA-ing Bitcoin. When someone have DCA-ing Bitcoin, at some point you will your coins too and you also not able to know the peak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}