{
  "id": "topic_5420417",
  "title": "KingsDen",
  "author": "KingsDen",
  "created_time": "November 10, 2022, 04:51:07 PM",
  "content": "Preamble:When I newly joined this forum, I tried my best to follow the standard and to obey all the  unofficial forum rules I was being advised and guided by established members, but there was a repetitive advice which I couldn't ignore. \"Make quality posts and merits will come\". I was eager to know what a quality post is. I visited the profile of some known quality posters to know how quality looks like. But I felt cheated when I realised that same yardstick used to measure the quality of a legendary user's post is same used to measure mine as a newbie. Out of grudges and sadness I made this post How Quality Can A Newbie's Post Be?On this very premise I decided to create this topic to show newbies what a quality post is.It will be fine to understand that quality is largely subjective. It's also related to the mood of the reader at that particular time. If my portfolio is 45% in minus, and I am scanning the forum, a simple text like \"HODL bull is near\" will be more quality to me than a comprehensive  guide.Having said these, let me drop some definitions of a quality post.A quality post is a;Post that answers a question:If there is a question in the forum by a lower-ranked member or an established member, be it technical or not. Any post that answers the question is a quality post.Post that corrects mistakes:There are some obvious mistakes other than grammatical blunders. Any post that corrects a mistake that has the tendency to mislead is a quality post.Post that teaches a new idea:Have you ever being searching the forum and eventually meet a completely new thing you have never heard about since your 5 years in this forum? That is a quality post.Post that states an old idea in a new way:There's hardly a totally new idea, but your ability to refine a general idea and present it in a more unique way could make your post a quality one.A quality post can be one line:It must not be lengthy to be called quality. A post with few words could have more impacts that posts with 1000 words e.g, \"Merry Christmas \", \"If Satoshi was around\", etc. I always see such one line quality posts, but they don't appear often.A quality post can be a hilarious:How are you able to spice up your posts? Your post while passing great meanings can also put a smile on the face of anyone having a bad day. Check this hilarious  post. Almost all the posts in the first page are one line posts and they are all quality in that context.A sarcastic Post can be qualityWe don't sound straightforward every time. Most times we put up a sarcasm at the appropriate time to filter or map through different minds and understanding. I do it often but Poker player beat me at this.Post that is made from personal experiences:That feeling when someone relates a post to their personal life experience. The reader will learn many lessons while feeling as if he was reading a novel by Chinua Echebe. Such posts from personal experiences are always great and quality.  A post that raises a divided opinion about a particular idea:Have you ever seen a post that is being quoted from 1st page even upto 5th page. Some debate, others argue and many contribute and almost all the ideas are making sense. Such a post is quality, no matter how controversial it may appear.Post that exposes scam or spam:Any post that exposes scam and cheaters is a quality post. Such a post do not only help in sanitising the forum but it saves other members from being hurt.A well formatted post:Even when a long post do not carry semantics. Maybe not needed by majority of members, but it should be neatly formatted, having paragraphs, cool worded and punctuated. It is a quality post as opposed to someone who will dump 500+ words in a single paragraph. A Post that can stand the test of time:Some posts could be quality today and lose its quality next week. But when you see a post that is monumental. Even after 5 years, all the information therein is still fresh and usable. E.g In the famous  I AM HODLING  post, the idea in the OP will remain valid as long as bitcoin lasts. He explained that he wasn't a good trader who will understand the signal of bear and sell and know when to buy again. He decided to Hodl and therefore doesn't lose. As I earlier said, quality is subjective. You are free to share what you think is a quality post and it maybe included in the original post.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420417",
  "comments": [
    {
      "author": "Accardo",
      "created_time": "November 10, 2022, 10:12:19 PM",
      "body": "Your post is quality but lacks one quality. One which I've scanned to see on the list and didn't find it. Maybe, it's there, if not there, I'll add that a quality post is a post with references to the source. And it adds more quality to the first point on your list. References on a particular answer to a question facilitates a better comprehension to the reader by encouraging them to further research about the subject.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 12, 2022, 11:14:32 AM",
      "body": "This topic is an interesting one that can help beginners have a good understanding towards what a quality post is and uow to meat up to the required standard the forum would accept as a quality post, this is also a thread createe or existing that carries a meaningful taughts to the person that fone across it, this not not necessarily has to be a created topic but it can be in a form of a good reply on a thread discussion as well in which every beginner is expected to go through the posting etiquettes before starting one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kingkongs",
      "created_time": "November 12, 2022, 05:27:46 PM",
      "body": "Absolutely a very thoughtful explanation of the entire forum I guess, but if I must be honest, there's really no Quality post, and if there's, they're just few. What I found here on BTT Forum is informative post, which I think most people refer to as quality, we need to learn the difference, because everyone is just after quality post, they write heavens and earth all together, but one informative line, it's enough to spike a superb light in the live of forum users",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "November 12, 2022, 09:05:29 PM",
      "body": "Quote from: Kingkongs on November 12, 2022, 05:27:46 PMAbsolutely a very thoughtful explanation of the entire forum I guess, but if I must be honest, there's really no Quality post, and if there's, they're just few. What I found here on BTT Forum is informative post, which I think most people refer to as quality, we need to learn the difference, because everyone is just after quality post, they write heavens and earth all together, but one informative line, it's enough to spike a superb light in the live of forum usersImo there is absolutely no difference, a quality post is one that has ample information about the existing subject/topic of discussion, meaning that is an informative post, i don't know why you are differentiating the both of them when there is definitely no difference, they can both be considered synonyms in this context and can be used interchangeably without any confusion.Quote from: Accardo on November 10, 2022, 10:12:19 PMI'll add that a quality post is a post with references to the source. I don't see how that makes a post a quality one, and only posts that are extracted/copied from somewhere requires a reference/citation to the original source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 12, 2022, 11:16:31 PM",
      "body": "Some of the characteristics of a quality posts like a Post that answers a question, corrects mistakes, Post that teaches a new idea, fall under the simple term of \"providing value\". Ask yourself always how your post will provide value and be valuable to someone, so you can easily ascertain if your post is quality or not. A post that provides value is the first obvious sign of a quality post.Quote from: KingsDen on November 10, 2022, 04:51:07 PMA quality post can be one line:It must not be lengthy to be called quality.. If your post is too long, people can easily miss the point, short, simple and straight to the point does the trick at times.Thanks for sharing OP, some of us needed to be reminded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "November 12, 2022, 11:35:35 PM",
      "body": "Quote from: KingsDen on November 10, 2022, 04:51:07 PMPost that answers a question:It starts with this how to determine a quality post.  No matter how it's lengthy it is as long as it answered questions. But usually here that has a signature campaign that follows the required length of the post.That's good input and nothing else to add but one thing that I suggest is that surely you'll have a quality post.  Never interact with a topic that you don't know because it creates a nonsense reply or it's off-topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 13, 2022, 03:34:44 AM",
      "body": "I think we don't need to explain what's a quality post and what's the low quality post. Just reply the thread that you think you will add an input or create thread that you think it's important and useful for the other forum users.Usually users are replying without add anything and just keep repeating what the above users has pointed before. Actually it's a low quality post, but since he have a point and replied on topic, the moderators didn't delete it because the post is kind of soft-bad.Quote from: sheenshane on November 12, 2022, 11:35:35 PMIt starts with this how to determine a quality post.  No matter how it's lengthy it is as long as it answered questions. This is the user which I think has the shortest post but it's on point and has earn more than 5K+ merit ETFbitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harapan",
      "created_time": "November 13, 2022, 03:46:48 AM",
      "body": "Good Topic (OP)For those newbies who still haven't found the way around here already. If I should add I'll say keep it direct, simple and short just like this user mk4. One can equally check in her profile day in day out for knowledge.I think they need know what quality means without that they will never get noticed in the forum by going and talking off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "November 13, 2022, 08:57:53 AM",
      "body": "OP, everything you wrote can be explained much more simply, without too many words and explanations.A quality post brings something new to the discussion, an original idea, information or conclusion.A quality post is a constructive post that can help other forum members because of some new information or answer to a question.Writing quality posts requires certain knowledge and experience on a topic or research on a specific topic.Newbie members should learn from older and more experienced forum members how to present a new idea, ask a question in the right way, and how to participate in forum discussions in a quality manner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 13, 2022, 09:13:33 AM",
      "body": "Quote from: sheenshane on November 12, 2022, 11:35:35 PMThat's good input and nothing else to add but one thing that I suggest is that surely you'll have a quality post.  Never interact with a topic that you don't know because it creates a nonsense reply or it's off-topic.Yes and this is not a good way to interact or possibly be called quality when you talk or say something really not about the topic. Newbies should be aware about replying on a certain topic, or at least research first about it if they really wanna engage in the topic to lessen spammy response or off topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 13, 2022, 10:10:01 AM",
      "body": "Quote from: Accardo on November 10, 2022, 10:12:19 PMYour post is quality but lacks one quality. One which I've scanned to see on the list and didn't find it. Maybe, it's there, if not there, I'll add that a quality post is a post with references to the source. And it adds more quality to the first point on your list. References on a particular answer to a question facilitates a better comprehension to the reader by encouraging them to further research about the subject. I should warn you that not every post with a link will be considered good. What the OP did is based on his own experience; what other links do you need? I will show you an example of those posts that have recently been massively deleted, this was a retelling of articles (check in the archive). But to be safe, the person always gave a link to the source.A good post or not is always the opinion of the one who evaluates it. Any joke or casual remark can be so subtle and to the point that after receiving merit, it will be considered a quality post by others. A good post always evokes a response - not just soulless communication, but the feeling that the interlocutor is next to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "November 13, 2022, 01:16:42 PM",
      "body": "Quote from: Accardo on November 10, 2022, 10:12:19 PMYour post is quality but lacks one quality. One which I've scanned to see on the list and didn't find it. Maybe, it's there, if not there, I'll add that a quality post is a post with references to the source. And it adds more quality to the first point on your list. References on a particular answer to a question facilitates a better comprehension to the reader by encouraging them to further research about the subject. No I don't agree that when you reference your post by putting the link or source for it means you have make a good post, this is not really. Some post are just copied from the internet not original and it is boring and too much to read because the writer is looking for merit and thinking size of what they write will get them merit. IMO Making source of your post is to avoid the offence of plagiarism and not because the post is fantastic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "November 13, 2022, 03:02:11 PM",
      "body": "Quote from: Accardo on November 10, 2022, 10:12:19 PMYour post is quality but lacks one quality. One which I've scanned to see on the list and didn't find it. Maybe, it's there, if not there, I'll add that a quality post is a post with references to the source. And it adds more quality to the first point on your list. References on a particular answer to a question facilitates a better comprehension to the reader by encouraging them to further research about the subject. A quality post doesn't really need referencing especially if the op is the original owner of the work. The quality of a post is determined by the information enacted and the problems it solved in the community here. A post with useful information and education is already encouraging users who are free to do more research before accepting the information and teaching of the op. I think you should follow the information provided by@Lovesmayfamilis and be guided.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "November 13, 2022, 04:47:12 PM",
      "body": "Quote from: KingsDen on November 10, 2022, 04:51:07 PM<snip>In my opinion, I consider a post to have that quality if it is at least relevant to the board (if the post is a created topic) and/or relevant to the topic (if it is a post as a reply to a topic) which does have a sense overall. And if the user wants to improve the quality of his/her post, adding or asking for more related information which hasn't been discussed on the thread will help a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "November 13, 2022, 05:11:45 PM",
      "body": "Quote from: Accardo on November 10, 2022, 10:12:19 PMYour post is quality but lacks one quality. One which I've scanned to see on the list and didn't find it. Maybe, it's there, if not there, I'll add that a quality post is a post with references to the source. And it adds more quality to the first point on your list. References on a particular answer to a question facilitates a better comprehension to the reader by encouraging them to further research about the subject. Disagree. Adding references would not make difference. If the content was just generalized by a shitposter, adding reference to it would be like putting cherry on top of a poop shake. It would not make it any better.Referencing external resources is an obvious thing to do when you made your research and came up with a quality content. Not sure where you got the idea from, but I am pretty sure that there are way better methods of \"encouraging people to read more about the mentioned subject\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "November 13, 2022, 08:33:48 PM",
      "body": "Quote from: KingsDen on November 10, 2022, 04:51:07 PMAs I earlier said, quality is subjective. You are free to share what you think is a quality post and it maybe included in the original post.You are right, rating the quality of a post is very subjective so there is always a possibility that what we consider quality at this time doesn't get the same rating among all users especially those who expect something more than standard. I believe we all have different standards when it comes to judging post quality but if it's about newbie then I really feel like they need to put in 2x more effort to prove their quality.I have an addition: Quality posts are posts that have good and strong arguments and can be accounted for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "November 13, 2022, 09:45:05 PM",
      "body": "Quote from: sheenshane on November 12, 2022, 11:35:35 PMQuote from: KingsDen on November 10, 2022, 04:51:07 PMPost that answers a question:It starts with this how to determine a quality post.  No matter how it's lengthy it is as long as it answered questions. But usually here that has a signature campaign that follows the required length of the post.That's good input and nothing else to add but one thing that I suggest is that surely you'll have a quality post.  Never interact with a topic that you don't know because it creates a nonsense reply or it's off-topic. A quality post always gives benefits to others because they gained valid ideas and information from it. If it’s not seen as a valuable one, then definitely its not a quality post. And yes, one sure thing that you can create a quality post, always chose a topic that will be of your interest because you can actually make an answer that comes from your own experience which makes it more valid and reliable from the eyes of other people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "November 13, 2022, 10:52:28 PM",
      "body": "Quote from: Eureka_07 on November 13, 2022, 04:47:12 PMQuote from: KingsDen on November 10, 2022, 04:51:07 PM<snip>In my opinion, I consider a post to have that quality if it is at least relevant to the board (if the post is a created topic) and/or relevant to the topic (if it is a post as a reply to a topic) which does have a sense overall. What do you mean by a post being relevant to the board it is made?If we consider this your opinion denotatively, it means that every reply to a particular post even to page 1000 is quality,  in as much as it is not deleted by a moderator as an off topic. Which means, if it is not off topic, it is relevant to the board and if it is relevant, it is quality. Quote from: Falconer on November 13, 2022, 08:33:48 PMQuote from: KingsDen on November 10, 2022, 04:51:07 PMAs I earlier said, quality is subjective. You are free to share what you think is a quality post and it maybe included in the original post.I have an addition: Quality posts are posts that have good and strong arguments and can be accounted for.I understood you when you said about a post having good and strong arguments. It can be related to this point in  Op   A post that raises a divided opinion about a particular idea.But I don't understand fully when you said about a post being accounted for! Do you mean a post that has a firm personality responsible for it anytime?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "November 13, 2022, 10:55:17 PM",
      "body": "Quote from: Techkoy407 on November 13, 2022, 01:22:15 PMI personally judge that quality posts are posts that always benefit others, even though the writing is irregular or the punctuation is wrong, the most important thing is the intent and purpose of the post.People will understand the purpose/intent of the post if that post is written in the right way. Instead of understanding the purpose, people probably misunderstand if it is written with the wrong punction, unsuitable words, or not constructed properly. So, don't neglect the correct writing procedures since it determines people's understanding of what we write. It will be useless if people can't understand it, people will miss the purpose of the post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}