{
  "id": "topic_5440708",
  "title": "Ivartheragnarson",
  "author": "Ivartheragnarson",
  "created_time": "February 21, 2023, 03:58:37 PM",
  "content": "hey guys! i  have been   using sui testnet for months for now. everytime i mint an nft on sui are disappear after some times or days..., i need to know why.... anyone who has a clear vision on that plz explain me on this reason..... thank you!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440708",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "February 21, 2023, 06:55:41 PM",
      "body": "Hey mate!If you are need some answer with a fastest response, my suggestion is better to ask this one about \"Sui Network\" in their discord. I see they have active community and you can ask them, especially directly to the developer or team.Best way to get answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "February 21, 2023, 07:38:47 PM",
      "body": "actually I've tried Mint NFT Sui. But at that time it was still in the Devnet period or before the testnet. and almost every day the NFT that had been obtained disappeared because the team explained that there was a reset process every day. and I think the Testnet period was the same. but to be more clear, it's better to ask at the official SUI Discord. because the community and the team there will know more about the answer to this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "February 22, 2023, 04:13:47 AM",
      "body": "It's a testnet so there was probably a network reset at some point last year. Just like its name, testnets are meant for testing, so any assets there shouldn't hold any value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shobhikhan_007",
      "created_time": "February 22, 2023, 05:06:12 PM",
      "body": "SUI network is a scam. It's just live because of this stupid airdrop channels and youtubes. Otherwise they will be dead while ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "youdacapt",
      "created_time": "February 22, 2023, 08:08:24 PM",
      "body": "Quote from: Ivartheragnarson on February 21, 2023, 03:58:37 PMhey guys! i  have been   using sui testnet for months for now. everytime i mint an nft on sui are disappear after some times or days..., i need to know why.... anyone who has a clear vision on that plz explain me on this reason..... thank you!I am responding as a sui testnet participants; The Sui network testnets and devnet are wiped time and time and time again by their devs; and this is why the tokens claimed and the nfts claimed using the test phase networks disappears. Also, the Sui devs usually make announcements when the wipes take place; and yes they did admit that they takle snapshots of wallet that joins each event. What to do ? Join the Sui network discord channel; follow their twitter account and read up announcement from time to time. Also, the sui testnet 3rd phase form is out for validator applicationsDyor and Goodluck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "February 23, 2023, 06:27:05 AM",
      "body": "Quote from: Ivartheragnarson on February 21, 2023, 03:58:37 PMhey guys! i  have been   using sui testnet for months for now. everytime i mint an nft on sui are disappear after some times or days..., i need to know why.... anyone who has a clear vision on that plz explain me on this reason..... thank you!Its on their announcement on discord. Mine also got wiped out for the nft I mintef before, but probably they are testing it since its still on testnet. This would take a while to become stable. Im sure youll get more specific answer on their social platform or heed some hint on their Twitter.Dont worry if they had airdrop surely youll not missed that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}