{
  "id": "topic_5444144",
  "title": "dharry",
  "author": "dharry",
  "created_time": "March 09, 2023, 04:48:54 PM",
  "content": "since I cannot find a legit site to lookup liquidity for a smart contract this is my only option. Like there isn’t a single site that you go on, paste a smart contract option and it gives you all the liquidity given to that token so I know what I can swap for at the best value.My question is, how do I get the exact or close to exact value for a smart contract token. Like if metamask, bscan, zerion all these apps are giving me a value for the amount of a specific token, how do I swap and receive that amount in eth or bsc??I’m guessing it goes off liquidity, if that’s the case, how do i check to see which coin is providing most liquidity for that contract so i can swap for that coin. I’m asking here because theres swapTokenforexactETH tools and whatnot if that helps regarding being able to swap for amount shown in wallet ill do it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444144",
  "comments": [
    {
      "author": "slashz9",
      "created_time": "March 10, 2023, 07:21:42 AM",
      "body": "if you visit dex like uniswap and pencak swap, when you want to exchange tokens, you will see an estimate of the price of the token or the value of the token you want to exchange, for example the price of eth is 1000$ you want to exchange your 100usdt to ethereum, then price comparison and the amount will appear 100$ in the form of eth which is 0.1 eth can be less or more and you will be charged a fee for each transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "March 10, 2023, 12:15:12 PM",
      "body": "You can check the token's price on different decentralized exchanges (DEXs) like Uniswap, PancakeSwap, Sushiswap, etc. These DEXs allow you to swap tokens for other tokens or ETH/BSC, and the prices are determined by the liquidity provided by the users. You can check the liquidity of the token by searching for the token's contract address on the DEX and checking the liquidity pool.When swapping tokens, you can use a tool like Uniswap's Swap Interface or PancakeSwap's Trade Interface, which allows you to swap tokens for ETH or BSC at the best available price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "savetheFORUM",
      "created_time": "March 10, 2023, 02:31:43 PM",
      "body": "Quote from: dharry on March 09, 2023, 04:48:54 PMMy question is, how do I get the exact or close to exact value for a smart contract token. Like if metamask, bscan, zerion all these apps are giving me a value for the amount of a specific token, how do I swap and receive that amount in eth or bsc??I’m guessing it goes off liquidity, if that’s the case, how do i check to see which coin is providing most liquidity for that contract so i can swap for that coin. I’m asking here because theres swapTokenforexactETH tools and whatnot if that helps regarding being able to swap for amount shown in wallet ill do it.It can be challenging to find a reliable site to look up liquidity for a smart contract. Though it would be ideal to have a single site that could provide all the liquidity information for a particular token, there are currently no widely accepted platforms that offer this functionality.You can use decentralized exchanges (DEXs) such as Uniswap or PancakeSwap to swap the token for ETH or BNB if there's liquidity available. Liquidity is indeed an essential factor to consider when swapping tokens, as it affects the price of the token and the slippage you may experience during the swap. To check which coin is providing the most liquidity for a specific token, you can use the liquidity pool information provided by DEXs such as Uniswap or PancakeSwap.You may also consider using automated market makers (AMMs) that provide price guarantees for swaps, such as Kyber or 1inch, which can help you get the best value for your token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "March 10, 2023, 03:22:46 PM",
      "body": "Quote from: dharry on March 09, 2023, 04:48:54 PMsince I cannot find a legit site to lookup liquidity for a smart contract this is my only option. Like there isn’t a single site that you go on, paste a smart contract option and it gives you all the liquidity given to that token so I know what I can swap for at the best value.My question is, how do I get the exact or close to exact value for a smart contract token. Like if metamask, bscan, zerion all these apps are giving me a value for the amount of a specific token, how do I swap and receive that amount in eth or bsc??I’m guessing it goes off liquidity, if that’s the case, how do i check to see which coin is providing most liquidity for that contract so i can swap for that coin. I’m asking here because theres swapTokenforexactETH tools and whatnot if that helps regarding being able to swap for amount shown in wallet ill do it.The value shown by the wallet is the average value available on coin tracking site whichever the wallet provider designed for, about swapping out tokens to ETH or BSC you need to move it to an exchange either centralized or decentralised or instant swap exchange like coinswap, changelly and there you will have value depends on the liquidity and current demand for the particular token for the particular pair so both are different.Incase the token you hold has high value but doesn't have any volume on exchange then you may be forced to sell for lower or wait until there is an buying order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bobrox",
      "created_time": "March 10, 2023, 03:46:34 PM",
      "body": "Depend on your coins network kinds and usually with BSC Scan network ability check on Pancakeswap and looking there with how much liquidity volume. But don't be happy when having new coins with higher values between Polygon or BSC Scan network because possibility with dusting attack token and give access by approving swap.I think to know exact values with your token looking on how much holder on smart contract address and any possibility there to know with coins have values or shit coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "March 10, 2023, 04:09:36 PM",
      "body": "the price depends on the amount of liquidity available that's where the price will be generated and what token value you mean, but I think if you ask for ETH network it's really expensive and the DEX you can use is the most widely used uniswap or metamask swap, if you use the BSC network you can use pancaeswap DEX, but did you know that gas fees and swap transactions on the ETH network are quite expensive. it's better to use a network that has lower transaction fees and you can swap easily at any time, just a suggestion, you should add a screenshot so that we can explain in detail and direct what you really want here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 10, 2023, 04:26:39 PM",
      "body": "Quote from: dharry on March 09, 2023, 04:48:54 PMsince I cannot find a legit site to lookup liquidity for a smart contract this is my only option. Like there isn’t a single site that you go on, paste a smart contract option and it gives you all the liquidity given to that token so I know what I can swap for at the best value.My question is, how do I get the exact or close to exact value for a smart contract token. Like if metamask, bscan, zerion all these apps are giving me a value for the amount of a specific token, how do I swap and receive that amount in eth or bsc??I’m guessing it goes off liquidity, if that’s the case, how do i check to see which coin is providing most liquidity for that contract so i can swap for that coin. I’m asking here because theres swapTokenforexactETH tools and whatnot if that helps regarding being able to swap for amount shown in wallet ill do it.I use these statisticshttps://info.uniswap.org/#/tokens/0xA0b86991c6218b36c1d19D4a2e9Eb0cE3606eB48But you must understand that in each new block the situation on the pool may change, so in the settings when exchanging, you set the allowable percentage of price slippage.Sometimes the exchange is not completed, and the coins are spent on a commission.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "March 10, 2023, 04:35:30 PM",
      "body": "Quote from: dharry on March 09, 2023, 04:48:54 PMsince I cannot find a legit site to lookup liquidity for a smart contract this is my only option. Like there isn’t a single site that you go on, paste a smart contract option and it gives you all the liquidity given to that token so I know what I can swap for at the best value.Just use dextool. Just copy smartcontract in the seach column and then you will be finding lots of pairs available for your coin including how much liquidity is available to swap your coin.Quote from: dharry on March 09, 2023, 04:48:54 PMMy question is, how do I get the exact or close to exact value for a smart contract token. Like if metamask, bscan, zerion all these apps are giving me a value for the amount of a specific token, how do I swap and receive that amount in eth or bsc??That specific amounts showed by some wallets like metamask were coming from API.Just try to visit uniswap for ethereum and pancake swap for BSC blockchain. Quote from: dharry on March 09, 2023, 04:48:54 PMI’m guessing it goes off liquidity, if that’s the case, how do i check to see which coin is providing most liquidity for that contract so i can swap for that coin. I’m asking here because theres swapTokenforexactETH tools and whatnot if that helps regarding being able to swap for amount shown in wallet ill do it.Please go here https://www.dextools.io/app/en It will be giving what you are looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}