{
  "id": "topic_5470409",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "October 10, 2023, 11:51:33 PM",
  "content": "Trump is the potential savior of the world, because he believes in God and follows through with his faith. The Satan-led Deep State is trying to destroy the world.Stephen Miller goes mega-viral for posting the reason why there was global peace only under Trump…https://revolver.news/2023/10/stephen-miller-goes-mega-viral-for-posting-the-reason-why-there-was-only-global-peace-under-trump/Since his removal due to a very questionable pandemic and a wave of unverified mail-in ballots, the world has descended into mass chaos. We find ourselves back in the \"status quo,\" where establishment-driven globalists hold the reins and enrich themselves and their friends while the rest of us suffer. However, we had a taste of the good life, and the majority of us yearned for more. Unfortunately, our government, which is deeply corrupted and rotten to its very core, couldn't allow that, especially from outsiders. As a result, the United States is now facing skyrocketing crime rates, a cruddy economy, a planned invasion at the border, domestic policies that resemble North Korean-style communism, and wars and possible World War III erupting worldwide. None of this would've happened under Trump.What we're witnessing now is \"establishment\" politics at its very worst.Trump loyalist Stephen Miller recently went mega-viral for explaining why world peace only happened during President Trump's tenure. In these times, particularly in the wake of horrific terrorist attacks in Israel, both the nation and the world can benefit from Stephen's perspective. Here's what Miller said in his powerful X post:Our world was at peace under President Trump.His clear-eyed realism, raw projection of national strength, and his rejection of ideology in favor of pragmatism and national interest, brought us an unprecedented era of global harmony.Whereas the DC set prattles on endlessly about the rules-based international order — the bloodless and esoteric obsession of the grad school credential class divorced from the iron laws of history — Trump understood the forces that shape world events: relationships, resources, rivalries, and the rational pursuit of self-interest and self-determination.----------Laura Loomer@LauraLoomer·FollowTrump is the glue that was holding the entire world together when he was in office. Do you see it now? I just wish people would wake up and come to understand the world is going to be over if Trump doesn’t get back into office.Our country will be finished, forever. Wake up!...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470409",
  "comments": []
}