{
  "id": "topic_5468329",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "September 27, 2023, 05:22:40 PM",
  "content": "Newegg has introduced a GPU trade-in initiative, providing gamers with the opportunity to exchange their old graphics cards for a predetermined monetary value. Typically, such trade-in programs may not be the optimal choice compared to personally selling the card. However, there is a group of gamers who would rather prefer to avoid the complexities of selling their cards independently, opting for the convenience of a third-party service. This specific group is the primary target of this new program.It’s important to note that not all graphics cards will qualify for trade-in, as the eligibility is determined by the SKU and a list curated by Newegg. It appears that only GeForce RTX 20/30 and Radeon 5000/6000 models are currently eligible for trade-in. Additionally, the value may vary depending on the card’s condition, with Newegg potentially reducing the offered amount accordingly.According to Newegg’s posted list, the RTX 3090 is valued at $561, while the RX 6950XT can yield $375 when traded in. It’s worth mentioning that Newegg sells refurbished RTX 3090 cards starting at $831, representing a substantial markup of approximately 48%. Nevertheless, Newegg assumes responsibility for the entire reselling process.https://videocardz.com/newz/newegg-announces-gpu-trade-in-program-up-to-561-for-rtx-3090-and-375-for-rx-6950xtI think that Newegg has become insolent and wants to make more money by selling used video cards than by selling new ones.Or they want to start mining",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468329",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "September 27, 2023, 09:51:02 PM",
      "body": "Something is up. the price for a 3090 is 457on eBay the cheapest one is 699if I sell my card on eBay fees would be 150I would clear 550 and worry about issues457 is tempting price I have 20 cards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "P00P135",
      "created_time": "September 28, 2023, 04:29:07 AM",
      "body": "Quote from: philipma1957 on September 27, 2023, 09:51:02 PMSomething is up. the price for a 3090 is 457on eBay the cheapest one is 699if I sell my card on eBay fees would be 150I would clear 550 and worry about issues457 is tempting price I have 20 cardsYou trust Newegg to pay you that price?  I'm sure there is some fine print \"up to $457\" or some bullshit.  3090's should come back in demand once flux comes online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 28, 2023, 11:39:25 AM",
      "body": "Quote from: philipma1957 on September 27, 2023, 09:51:02 PMSomething is up. the price for a 3090 is 457on eBay the cheapest one is 699if I sell my card on eBay fees would be 150I would clear 550 and worry about issues457 is tempting price I have 20 cardsOf course, I envy that the prices for video cards are so high in the USA, but even if you sell 20 PTX 3090 video cards, you will have to pay extra and buy 20 new video cards, which now have nothing to mine with such a large payback. And commissions on eBay are very high.But you can try the trade-in program with 1 video card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 28, 2023, 04:58:10 PM",
      "body": "Quote from: philipma1957 on September 27, 2023, 09:51:02 PMSomething is up. the price for a 3090 is 457on eBay the cheapest one is 699if I sell my card on eBay fees would be 150I would clear 550 and worry about issues457 is tempting price I have 20 cardsAt that price I’m sure you’d find some interest here on the forums. I myself might even be a buyer. I don’t blame Newegg. They probably have some deal with a company wanting cheap GPUs and pitched them this idea to procure them at a discount while giving Newegg a cut of the action as I’m sure their GPU business has slowed considerably.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 28, 2023, 06:06:37 PM",
      "body": "Quote from: OgNasty on September 28, 2023, 04:58:10 PMAt that price I’m sure you’d find some interest here on the forums. I myself might even be a buyer. I don’t blame Newegg. They probably have some deal with a company wanting cheap GPUs and pitched them this idea to procure them at a discount while giving Newegg a cut of the action as I’m sure their GPU business has slowed considerably. Newegg also sells used and refurbished graphics cards, so I'm sure they don't need a partner to buy used graphics cards. They definitely won’t buy bad or broken video cards, because their specialists will do a good check. And I think the buyer will pay for all the shortcomings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 28, 2023, 06:38:45 PM",
      "body": "Quote from: FP91G on September 28, 2023, 11:39:25 AMQuote from: philipma1957 on September 27, 2023, 09:51:02 PMSomething is up. the price for a 3090 is 457on eBay the cheapest one is 699if I sell my card on eBay fees would be 150I would clear 550 and worry about issues457 is tempting price I have 20 cardsOf course, I envy that the prices for video cards are so high in the USA, but even if you sell 20 PTX 3090 video cards, you will have to pay extra and buy 20 new video cards, which now have nothing to mine with such a large payback. And commissions on eBay are very high.But you can try the trade-in program with 1 video card.yeah I am curious. I do a lot of business with them. In fact I will be reviewing a corsair case for them soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 29, 2023, 06:01:22 PM",
      "body": "Quote from: philipma1957 on September 28, 2023, 06:38:45 PMQuote from: FP91G on September 28, 2023, 11:39:25 AMQuote from: philipma1957 on September 27, 2023, 09:51:02 PMSomething is up. the price for a 3090 is 457on eBay the cheapest one is 699if I sell my card on eBay fees would be 150I would clear 550 and worry about issues457 is tempting price I have 20 cardsOf course, I envy that the prices for video cards are so high in the USA, but even if you sell 20 PTX 3090 video cards, you will have to pay extra and buy 20 new video cards, which now have nothing to mine with such a large payback. And commissions on eBay are very high.But you can try the trade-in program with 1 video card.yeah I am curious. I do a lot of business with them. In fact I will be reviewing a corsair case for them soon.I believe that the RTX 3090 video card will be relevant in mining for a very long time, and it makes sense to get rid of such a video card if it is unstable in mining. But on most algorithms this video card will not lose much to the 4xxx series. But if a miner is ready to sell this good GPU for $561, then there are big problems in mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batsonxl",
      "created_time": "September 30, 2023, 05:06:10 PM",
      "body": "Where you can find rx5700 for 70$?Newegg definitely think they are smart",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "September 30, 2023, 05:18:09 PM",
      "body": "Quote from: batsonxl on September 30, 2023, 05:06:10 PMWhere you can find rx5700 for 70$?Newegg definitely think they are smart I would also buy a 5600 xt for $50 after my review, even without your obligation to buy another new video card from me. I sell my 5600 xt video cards for $145 and they sell well in my country. I can assume that people will not sell their video cards so cheaply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "October 04, 2023, 11:01:07 AM",
      "body": "I'm waiting for someone to come up with cheap delivery of video cards from the USA to another continent. Prices in China for video cards are not the best right now, but if you buy at a big discount, you will probably buy problematic video cards. New video cards at retail in China are more expensive than in Russia or a little cheaper, but all the actions are not worth the profit or the profit will go towards delivery costs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fmz89",
      "created_time": "October 08, 2023, 11:37:20 AM",
      "body": "174$ for 6700xt is quite fair, nice to see some company doing this, well they now  , this is all time low for pc parts, its time to absorb used gpu for rebranding laterin my country price used gpu for 6700 xt is 178$, nice newegg for the program",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "October 08, 2023, 04:06:34 PM",
      "body": "Quote from: fmz89 on October 08, 2023, 11:37:20 AM174$ for 6700xt is quite fair, nice to see some company doing this, well they now  , this is all time low for pc parts, its time to absorb used gpu for rebranding laterin my country price used gpu for 6700 xt is 178$, nice newegg for the programIn my country, this video card costs at least 260-300 dollars. And the cheapest price is in big Russian cities like Moscow.In other regions, this video card will cost $300-350, and if the 6700 xt is sold for $230-250, they will be bought very quickly. I would be very happy to buy these video cards even for $200.https://www.avito.ru/moskva/tovary_dlya_kompyutera/komplektuyuschie/videokarty-ASgBAgICAkTGB~pm7gmmZw?cd=1&q=rx+6700xt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}