{
  "id": "topic_5451188",
  "title": "libert19",
  "author": "libert19",
  "created_time": "May 04, 2023, 05:07:53 AM",
  "content": "QuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451188",
  "comments": [
    {
      "author": "Helena Yu",
      "created_time": "May 04, 2023, 05:19:31 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMInflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Unfortunately most of people can accept quality or quantity downgrade rather than price increasing of the product because price is more sensitive for them. That's why people are more preferable to hold fiat even though the value is always decrease, rather than holding Bitcoin which the price will increase after super cycle. If I were running a company, I would do same because downgrading the quality or quantity aren't crime, it's legal and one of business strategy. This will make poor people can still buy my product, while a rich people they can buy more if they feel one isn't enough, so it's make affordable for any people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "May 04, 2023, 07:01:52 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Every company wants to gain and be happy, but the approach used matters, some are ill and inhumane. Inflation is mostly bad, I used \"mostly\" because it's not bad for everyone, it's as a matter of fact the time for some companies to make more money. This can only be done by cheating people. They go away with it in climes because of poor regulations.As we are complaining about global inflation, do you know that banks and many companies in my country are declaring higher annual gains? They could only do this by cheating people with higher prices, fees, charges and manipulations.Aside from the banks, many manufacturers reduced their product size and still increase the price of the product. This is a means of maximizing profits through cheating in the guise of inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "May 04, 2023, 08:28:26 AM",
      "body": "Quote from: EarnOnVictor on May 04, 2023, 07:01:52 AMEvery company wants to gain and be happy, but the approach used matters, some are ill and inhumane. Inflation is mostly bad, I used \"mostly\" because it's not bad for everyone, it's as a matter of fact the time for some companies to make more money. This can only be done by cheating people. They go away with it in climes because of poor regulations.As we are complaining about global inflation, do you know that banks and many companies in my country are declaring higher annual gains? They could only do this by cheating people with higher prices, fees, charges and manipulations.Aside from the banks, many manufacturers reduced their product size and still increase the price of the product. This is a means of maximizing profits through cheating in the guise of inflation.QuoteMeanwhile, corporate CEOs are doing just fine. The average compensation of CEOs at companies in the United States is over $12.3 million. CEO compensation has grown 940% since 1978. It would take several lifetimes for an employee to earn as much as their CEOs.Source:CEOs Are Making Millions While Laying Off Thousands Of Workers And Filing For Bankruptcy, but I guess you can find other similar articles around... We all want to gain and be happy, and I can't agree more with your words that the approach used matters a lot. Some ways are simply wrong, as you say ill and inhumane, that description fits perfectly. I am sure they are cheating us in many ways, maybe the worst of all is the quality of the products themselves, the prices go up and the quality goes down... who knows what they are mixing to produce more and earn even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "May 04, 2023, 09:08:47 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? In the country where I live, the price of a product is always determined by quality because usually the best quality products are clearly made from the best materials with fairly sophisticated machines so it's only natural that the price is a bit more expensive. But if you ask about how to fight inflation in terms of production of goods, I would prefer to make products that are not too bad in quality by setting prices that are not too expensive so that it can be reached by all levels of society.Apart from that, quantity also needs to be considered, because if a product gets more demand in the market, of course this is an opportunity for companies to produce more goods. Because when the goods produced can be sold in greater quantities, of course the profits that can be obtained by the company are also many because they take advantage of per unit of goods that are sold in the market. So in my opinion quantity and quality both need to be considered by the company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "May 04, 2023, 10:23:32 AM",
      "body": "In cryptocurrencies it is different, they add more zeros to manipulate the market. But that was before, I don't know how they do it today. I think the burning mechanism is the ace up their sleeves. When it comes to products, you are right, they are taking away the quality too. Less number of items, less quality but damn expensive because they can use the reason of lack of materials and expensive ones. And, the pandemic had always been the scapegoat to support their evil plans. That's one of my mistakes when the pandemic came, I should've just saved the money and wait for the products to be cheap again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "May 04, 2023, 10:29:40 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Most companies believe if they increase the price, they might end up losing most of their customers because people end up going for cheaper products. Most of the companies are not alone in the market, they are having competitors, so if their prices is not equal to other companies, then people might end up not buying their products, they will go for the cheaper company not knowing that they reduced their quality already. But to me it’s better a company increases their price and maintain their quality and quantity, people that really know the quality of your products will still patronize, but most company owners don’t really know this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 04, 2023, 10:30:45 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMI hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Companies have been doing this forever, only now we really noticed it because it happened on a massive scale, and none of the customers can be satisfied that they are paying more for less, and often the product is not of the same quality as before. Buyers should therefore pay attention to each package and look for an alternative (if it exists), because not all companies are the same.Quote from: libert19 on May 04, 2023, 05:07:53 AMInflation makes everything rise, so might as well keep the original quantity and just increase the price. If you can reduce the packaging and sell it at a higher price than before, and in addition use lower quality raw materials to make the product, then most companies will do it - profit comes first, and they consider customers to be sheep who are not very intelligent anyway.Quote from: libert19 on May 04, 2023, 05:07:53 AMDo you agree? How would you combat inflation if you were running a company? If at all possible, I would keep my product in the same quantity with the same quality, and I would adjust the price in such a way that my business would continue to be sustainable. In addition, I would be transparent about it and inform my customers about the changes, because people are ready to pay more if they know the reasons and if they are treated with respect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "May 04, 2023, 10:38:51 AM",
      "body": "Well, we can't do anything about it, they've separated the workers to the means of production and people are too poor to organize a strike to protest that and many other things so I guess it's in our best interest to just play the cards we've been dealt with and press on, we need to learn what Japan is doing in their economy, they don't have a problem with inflation although they do have a problem with deflation which I think is much easier to solve than inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 04, 2023, 10:45:46 AM",
      "body": "The term is pretty accurate and the practice is common, but I personally prefer shrinkflation to same portions but more expensive. If you know what's going on (and inflation is no secret), I'd choose shrinkflation over higher prices for former portions because this way, you can spend the same amount of money and just buy a bit less food, whereas if it's about changing the price and keeping the size, you may just not afford to buy certain products anymore. Smaller portions can be a less painful way to live through inflation by eating and wasting a bit less. So, in theory, I don't mind shrinkflation. In practice, however, of course I mind it when companies merely use it to make more profit rather than out of necessity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "May 04, 2023, 10:48:01 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Because I'm only a consumer just like you, I also don't like it. But there's no other way a company can keep up with their monthly expenditures if the costs to produce their products are going up. They have no choice but to be more \"creative\" to reduce costs. A more obvious sign that a company is significantly affected by inflation is, employee down-sizing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "May 04, 2023, 10:51:38 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMInflation makes everything rise, so might as well keep the original quantity and just increase the price. This kind of unfortunate. I was thinking the situation of reduction in quality of products to meet up with cost and to make profit is only a Nigerian and African phenomenon at large but not knowing it is a general syndrome of the world but why? Imagine where medicines and drugs are reduced to be made in lower quality to meet up to cost, it means the efficacy of such medicine will reduce or may not even have any effect whatsoever but cause more damages to the organs of the body. I think the government has a lot to do on this and IMO instead of reducing of quality of products it will be better the size are reduced and you have smaller prices and big sizes of different price but adequate content of the high quality of the product especially for house hold products. To reduce the quality of drugs is an aberration that is counterproductive and should be discouraged. One way to ensure quality are maintained is by regulation, monitoring and control. The Nigerian price control Act of 2004 has not been made active and so price goes up at random depending on the choice of the seller to fix his or her own price independently.Quote from: libert19 on May 04, 2023, 05:07:53 AMDo you agree? How would you combat inflation if you were running a company? As a business man or woman, you are limited to combate inflation because it arises from government policy, you can only try to reduce your cost of running your business through bulk buying and reduced transportation, reduction on unnecessary cost and focus on products in demand to ensure ROI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 04, 2023, 11:40:47 AM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Does it ever matter? Inflation is inflation. It doesn't matter if the quality/quantity gets reduced or the prices go up. You are terribly wrong about something.The business owners/managers cannot \"combat inflation\". Only the governments and the central banks can fight inflation by interest rate hikes, higher taxes and cutting government expenses. 99% of the time, inflation is created by the governments and the central banks, which is a part of the absurd reality we live in. All the companies in the private sector can only adapt to the situation(by cutting costs and increasing the prices).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "May 04, 2023, 12:50:28 PM",
      "body": "Actually the quantity and quality of both are equally important in business. Quantity concerns the amount of goods or services produced or provided by a company, while quality relates to the standard of products or services provided to consumers. Of course, every company is different and has its own challenges in dealing with inflation. However, what is important is to maintain integrity and not engage in actions that harm consumers in order to gain profit.Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? when companies face inflation, raising prices is one way to offset rising production costs and maintain profits. However, companies must also consider the quality of the product or service they provide to customers. If companies choose to increase their prices, they must ensure that the increase in price is not offset by a decrease in the quality of the product or service. Instead, companies must continuously maintain or improve the quality of their products, while considering reasonable and competitive prices.In this way companies can also fight inflation by looking for ways to increase efficiency and reduce production costs. They can look for cheaper raw materials, increase production efficiency, or look for ways to increase employee productivity.What is certain is that even though we are facing inflation, it is also important for companies to keep innovating and looking for new ways to improve quality and efficiency, while maintaining competitive prices. There are many better ways to fight inflation than to deceive consumers. Because actions such as reducing product size and increasing prices to maximize profits are unethical actions and can harm consumers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "May 04, 2023, 01:10:30 PM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Yes! but it's just the company's strategic campaign despite shrinkflation. They instead use it to their advantage. It's actually true, due to shrinkflation, products typically lowered its quality, be it on size, weight, and other indicators. With that lowering the cost of production but still maintaining the selling price of any product. At first, it will be unnoticeable but it's the truth.Companies rather fall into shrinkflation and lower their quality to keep their customers because of the price than to maintain the quality of the product but raise the selling price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "May 04, 2023, 01:15:47 PM",
      "body": "There's not much choice for those companies unless they wanna close shops. But then the employees will suffer in such action, theyd rather be chosing price increase or shrinkflation.To survive the companies will need to tighten their belts too. The lay off has been happening to big companies since the FED keeps making companies default. So here we are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YinShuiSiYuan",
      "created_time": "May 04, 2023, 01:16:20 PM",
      "body": "Quote from: CarnagexD on May 04, 2023, 01:10:30 PMQuote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Yes! but it's just the company's strategic campaign despite shrinkflation. They instead use it to their advantage. It's actually true, due to shrinkflation, products typically lowered its quality, be it on size, weight, and other indicators. With that lowering the cost of production but still maintaining the selling price of any product. At first, it will be unnoticeable but it's the truth.Companies rather fall into shrinkflation and lower their quality to keep their customers because of the price than to maintain the quality of the product but raise the selling price.This practice is very common now and most of the companies have been doing this for a long time with total confidence   they have reduced quantity and quality of their products with increasing prices . But it should not be done  if they are increasing the prices than they should work on their standard and customer satisfaction.  Inflation have blinded everyone and have numb public relations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "May 04, 2023, 01:26:45 PM",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? It's either of the two and there's really no choice at all but to choose one of them. Reduce the size or quantity but maintain the price or retain the quantity, size, and quality of what you sell then increase the price. I am a bread lover and the bread that I used to buy has actually shrunk those bakeshops understand the need for them to adjust because of the higher price of ingredients, mainly flour and wheat. If I own a company and produce products, I don't want to pass the burden to my customer and will choose to adjust at least the quantity/quality. But before doing that, I'll try to make a survey of my loyal customers about what they prefer, an increase in prices or the same price but an adjustment in quantity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mame89",
      "created_time": "May 04, 2023, 02:35:49 PM",
      "body": "It is understandable that certain companies may use unsavory approaches to achieve higher profits. But not all companies are like that and many also pay attention to business ethics and social responsibility. Even though there are some companies that can take advantage of this situation to gain higher profits by deceiving consumers, however, inflation is generally detrimental to the economy and society at large. because Price increases and higher costs can burden consumers and exacerbate social inequality. On the other hand, inflation can also reduce people's purchasing power and wealth because the value of their money decreases. Therefore, inflation should be managed carefully and with a responsible approach.Inflation can indeed have an impact on a company's production costs, which can force companies to look for ways to reduce costs and maintain profitability. However, reducing product quality or increasing prices without considering the value of the product is not an act that is responsible for consumers. As an entrepreneur, maintaining a balance between production costs and product selling prices is a challenge faced in the midst of an inflationary situationThis is where the function of the government is to encourage companies to consider a sustainable and responsible business approach, which not only prioritizes profits but also pays attention to social and environmental impacts. This can help create long-term sustainability and sustainable profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "May 04, 2023, 02:47:39 PMLast edit: May 04, 2023, 03:25:24 PM by Sayeds56",
      "body": "Quote from: libert19 on May 04, 2023, 05:07:53 AMQuoteShrinkflation is practice of reducing the size of a product while maintaining its sticker price. I hate it when companies reduce quantity (and often quality too) of product to sell it at same price as before to combat inflation. Oh and don't forget those, \"30% Extra\" labels. Inflation makes everything rise, so might as well keep the original quantity and just increase the price. Do you agree? How would you combat inflation if you were running a company? Inflation is a complex economic issue, that affects not only individual consumers but also businesses. The companies often face higher cost of raw materials, labor and other input, which leads to increased cost of their products. There are several measure companies can take to combat inflation, such as renegotiating prices of raw materials with their suppliers, improve efficiency of their machines and reduce cost of energy by green sources of energy. In summary, combating inflation while maintaining profitability and keeping prices of products affordable, is a challenging task, and needs effective strategy to get desired results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}