{
  "id": "topic_5459373",
  "title": "HoferBit",
  "author": "HoferBit",
  "created_time": "July 11, 2023, 02:05:57 AMLast edit: July 12, 2023, 02:16:39 AM by HoferBit",
  "content": "文/胡翌霖 2015年1月29日原文链接 https://yilinhut.net/2015/01/29/5219.html1、是革命不是升级BTS是所谓“二代币”（全称第二代山寨币）中圈钱最多（目前来说）、名声最响（主要在中国）的项目之一，我在微博上偶尔黑它两句，总会有许多热心网友前来“指教”，谆谆教导我需要与时俱进，需要开放包容，需要不断学习……所以我一般也懒得多说什么，这次巴比特约稿，我不妨再集中吐吐嘈，但不负责接受BTS粉丝的教学。有一些善意的网友总觉得我不待见BTS是因为学习不够、了解不足，认为帮我补补课我就能接受了，奈何我观念陈旧、思想封闭，不愿意学新知识，让那些网友扼腕叹息，颇有一副恨铁不成钢的意思。但这种“意见不合是因为学习不够”的心态并不是一个很好的讨论态度，这有点像教徒传教时的心态：你不信是因为你不愿意学习。但事实上，人与人之间的观点分歧，往往都不是缘于知识上的差别，比如我不待见跳大神，并不是说我学习了跳大神的各种跳法以及背后的各种神秘理论之后，就能够认同它了，当然我肯定对学习这些玩意儿没多大热情，但这也很难说是观念过于守旧或心胸不够开放造成的，在广义上说，当然这也可以算是思想封闭，但如果思想毫不“封闭”，见啥学啥，听啥信啥，那就根本没有思想了。如果我从根上就否认跳大神的合理性或必要性，那么我就不需要去学习它的各种细节。当然，如果我完全不待见跳大神，也就没有必要混入大神们的圈子里去“教育”他们，敬而远之是一种起码的尊重方式。不过在我自己的地盘，远远看着另一边跳大神的在那里煞有介事不亦乐乎，我偶尔嘲讽几句，显然不算过分。嘲讽他们并不是为了驳倒或教育他们，而更多是表达我自己的观念，比如我要讲追求真理破除迷信，我就可能拿那帮巫师作为反面事例，这时候我面对的听众不是那些巫师，而是我自己的听众。所以我从来不会跑到BTS或其它山寨币的地盘去“布道”，也排斥他们来我面前布道。不同信念的人之间的友善而激烈的交流当然是好事，但如果持有“布道”、“教学”的心态，这种交流就很难展开了。我可以说是一个比特币“原教旨主义”者，也就是说，我支持且仅支持比特币，而不待见任何花里胡哨的山寨币或二代币。于是在我眼中“二代币”信徒类似于异教、邪教或新宗教。比如说伊斯兰教也承认摩西和耶稣都是先知，只是他们认为默罕默德是最新一代的先知，犹太教只认摩西，基督教承认摩西+耶稣，伊斯兰教承认摩西+耶稣+默罕默德，于是乎伊斯兰教是宗教3.0，比之前的版本更高级、更进步？显然没那么简单。我只承认中本聪的理念，然后有一拨人认同中本聪+PoS，再一波人认同中本聪+PoS+BTSX，于是我是1.0，他们是二代三代，比我更高级更宽容？也没那么简单。分歧背后涉及的是信仰、理念、心态、环境等多方面的因素，并不能因为哪一方额外多加了一个X，就一定更高明。比特币玩家对待来自传统金融世界的反对时，也应该持有这样的态度：我站在更合理的一边，而不是站在更高级的一边。比特币并不是对纸币的“升级”，而是“范式革命”，它在很多方面主张退回金本位时代的某些理念，反对者并不只是因为观念落后或知识匮乏，而更多地是思维方式的差异。如果把比特币的革命看作单纯的更新换代，看作比纸币“高一级”的东西，那就差之毫厘谬之千里了，这比把伊斯兰教看作基督教的升级版更加可笑。 2、锚定法币只是画蛇添足遗憾的是，许多“二代币”的信徒正是把他们的币看作比特币的“升级版”，这从“二代币”这一称呼上也可以看出。BTS更是其中的典型，他提供的BTSX，如BitUSD、BitCNY等，也恰好是试图提供法币的“升级版”。在我看来，这类努力——无论是对法币的“改进”还是对比特币的“改进”，都是画蛇添足，是给汽车装马鞍，除了看似花哨之外，毫无意义。据说BTS本身不是货币，而是一种类似于股票的东西，基于它之上可以开发出林林总总好多项目，其中主打的项目是BTSX，再其中主打的产品是BitUSD（比特美元），以及BitCNY（比特人民币）等。整个BTS是一个巨大的坑，这从它的圈钱模式就看得出来，但这方面咱们先不管，我们就说BitCNY是怎么一回事。BTSX利用一套复杂的机制生成BitCNY，说复杂是因为其中的许多细节说来话长，但其实笼统地说来也挺简单，就是用户可以抵押BTS铸造BitCNY。而这套抵押机制达成了所谓“锚定”的效果，使得这种被铸造的BitCNY的价值大约与实际的CNY相当。于是，BitCNY变成了“比特人民币”，BTS的支持者们认为，这种电子化的比特人民币将让商家更好接受，因为相比比特币来说，它的汇率更稳定，可以当做人民币来记账。BTS的批评者一般集中于质疑“锚定”的可能性。的确，锚定基于BTS的价值，如果BTS出现崩盘，锚定将会失效。当然BTS的支持者会拿出许多理由来回应，例如这种情况是多么极端，以及即便出现极端情况也有可能应对等等。但我关注的焦点不在这里。事实上，能不能锚定本来就是一个相对的命题，短期来看，在一个月内维持BitCNY汇率相对稳定也可以说是达成了“锚定”了，维持一周、维持一年，都可以说是锚定了，能在一定时期内维持一个相对稳定的比价并不稀奇。但长期来说，例如十年，几十年的跨度来说，我不相信锚定可以永远维持。当然，如果BTS一直非常小众，就几个粉丝自娱自乐，一直锚定下去倒是可能，但如果BitCNY流行起来，比如其总量占到人民币流通量的百分之一，那么它还能锚得定吗？国际货币竞争中，一些试图以举国之力锚定汇率的行动最终也都失败了，BTS真能做得到？这几个月来所谓的成功锚定的现实，是建立在流通量和应用面少到忽略不计的前提之下的，一些提供CNY买卖BitCNY的平台虽然貌似基本维持在0.95到1的范围，但成交量和市场深度都少得可怜，几乎只有象征意义，什么都证明不了。不过更关键的问题是，即便我们说“锚定”能够成功，那么又意味着什么呢？如果锚定压根就没什么意义，那么关于能否锚定的争论就显得很无聊了。例如某些人想在汽车上装马鞍，那么当然会有许多质疑，比如说马鞍能不能装牢，马鞍用铁还是用铜，安车顶还是安车头……一撮人为这些技术问题殚精竭虑，争论不休。路过的我问了一句：为什么要给汽车装马鞍呢？恐怕就要被他们嗤之以鼻，乃至轰出大门了。BTS的支持者认为，BitCNY与人民币锚定，有助于那些愿意接受电子货币提供的便利性，但不能接受比特币的汇率波动的商家们接受电子货币的支付。这听起来似乎像那么一回事，但实际上那些商家多半是BTS支持者们臆想出来的。不说与比特币相比，就说和BTS相比，乐于接受BitCNY的商家为什么不直接通过BTS支付呢？据说因为BTS和BTC一样价格是波动的，BitCNY价格锚定人民币，因此适合被用来记账。但要注意，支付与入账是两个环节，现在那些不接受BTC汇率波动的商家，都是借助Coinbase、Bitpay等第三方平台支持比特币支付的，用户可以通过中介平台向商家发送比特币，而中介平台负责承兑，最后商家直接收到法币。这样一套以美元标价，以比特币支付，以美元入账的系统中，商家并不需要考虑比特币的波动问题。如果你嫌比特币不好，认为BTS好，那么完全也可以做成BTS的支付平台，商家还是可以以法币入账。据说BitCNY能更容易劝服一些传统商家接受电子货币支付，但在劝服过程中你也得先劝服他理解BTS的机制。BitCNY的意义只适用于恰好能够接受BitCNY但又不接受BTS的商家，我想象不到这样的商家会有多少。如果我搞不懂或不接受BTS的机制，我仍然愿意接受人民币，通过中介平台，我仍然可以享受去中心化密码货币带来的许多好处。但我为什么敢接受比特人民币？如果我收到比特人民币后立刻兑换为人民币入账，那么就和收取BTC或BTS兑换为法币入账是一样的，何必多此一举？如果我收到比特人民币后直接入账，储存起来，那我图的是什么？如果我偏好法币的稳定性，那么我为什么不储存稳定的法币，而要储存这种比特法币呢？BTS支持者可能给出很多理由，例如商家们怕麻烦，既然收入了BitCNY就懒得特地去兑换成CNY了，但第三方支付平台完全可以提供更便利的服务，帮你完成兑换。又例如第三方支付平台是中心化的，因此不可靠，但既然针对的是追求稳定的商家，我想他们对去不去中心化要求不高，对一家找得到人的正规中介公司的信任恐怕更多一些。又例如BitCNY囤着能产生利息收益，只有这一条原因似乎靠谱一些，但这恰是一大不稳定性，在目前小打小闹的环境下搞个10%的年利率也没啥大不了的，但如果BitCNY的应用真能达到一定可观的规模，一个特别的活期利率能够在法币金融体系中独善其身吗？须知比特币汇率之所以波动厉害，很多时候都是因为和现存金融世界的纠葛，今天中国一个公告，明天美国一个动作，都让比特币汇率上蹿下跳。现在各国政府是没工夫管这种小打小闹的“伪法币”，但如果啥时候他们想管一下呢？BTC承受政策冲击的能力与BTS的承受力哪个更大呢？无论如何，一个追求稳定的商家，恐怕不会选择用BitCNY入账，除非他本来就支持BTS，或者思路特别独特，我目前还很难想象。 3、比特币要颠覆的正是BTS固守不放的我说道BTS画蛇添足的设计，其根源在于它对新货币的理解局限于某种“升级”，而不是革命。在它看来，电子货币的意义上更方便、更稳定，等等，但这些恰恰不是比特币的核心意义。比特币的基本理念是“自由”，是货币的“解放”。BTS沿用了比特币“去中心化”的旗号（实际怎么样容我呵呵），但得其形而不得其神。要说比特币为什么要去中心化，先要理解法币为什么是中心化的，据说法币的中心化正是为了“稳定”，政府和经济学家们殚精竭虑，时时调整利率，统筹规划通胀率和物价水平，推出QE等一系列高科技手段来控制货币市场，据说就是为了维持“稳定”，似乎货币的价值波动一旦超出了政府的掌控，就会发生可怕的事情，经济就将失去秩序。而比特币就是要打破传统货币概念中“稳定压倒一切”的逻辑——放开控制，让自由市场决定货币价值的波动，又能如何呢？当然，许多建立在现存金融体系下的经济活动将面临困难，但如果说这一金融体系本身就是不合理的呢？另外，比特币还要打破货币的“虚拟化”。我已多次说过，比特币虽然是电子货币，但它恰恰比法币更真实。法币的产生就是通过虚拟的抵押铸成的，例如早期的用黄金抵押出钱，或者后来中国用美金抵押出人民币，或者像美国用明天的债抵押出今天的钱。用BTS抵押出BitCNY也是类似的逻辑，它还可以抵押出比特黄金、比特石油等等虚拟资产，这些资产与擅长无中生有的法币体系更为亲近，而与比特币世界格格不入。试图让金圆券锚定黄金，试图让人民币锚定美元，这些事业之所以失败不是因为技术不够（于是现在BTS带来了最新技术），而是从一开始就走错了。纸是纸，黄金是黄金，纸不能也没必要锚定黄金，所有这些所谓的锚定不是一厢情愿就是某种阴谋。比特币看透了这一切，因此比特币不再是虚拟的代币，它不是什么的抵押或什么的对应物，比特币就是比特币，它是继金银之后卷土重来，对虚拟货币（法币）拨乱反正的又一种实物货币。因此比特币最终要做的事情可比BTS激进的多，至于在过渡阶段的推广，靠Coinbase之类的平台就可以支持，BTS纯属画蛇添足，而在过渡阶段之后，比特币的理想是BTS之类难以想象的。",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459373",
  "comments": []
}