{
  "id": "topic_5437640",
  "title": "Alik138",
  "author": "Alik138",
  "created_time": "February 01, 2023, 01:35:26 PM",
  "content": "Please help me! Maybe someone understands where it can be sold. Or teach you how to use it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437640",
  "comments": [
    {
      "author": "TribalBob",
      "created_time": "February 01, 2023, 02:02:31 PM",
      "body": "try to clarify a little the meaning of your question? what mining is this?and what will you sell, and stay in touch so that your questions can be answered and solved if it's too risky",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik138",
      "created_time": "February 01, 2023, 02:46:16 PM",
      "body": "Quote from: TribalBob on February 01, 2023, 02:02:31 PMtry to clarify a little the meaning of your question? what mining is this?and what will you sell, and stay in touch so that your questions can be answered and solved if it's too riskyCan you write to me in private messages?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "February 01, 2023, 03:11:28 PM",
      "body": "Quote from: Alik138 on February 01, 2023, 02:46:16 PMQuote from: TribalBob on February 01, 2023, 02:02:31 PMtry to clarify a little the meaning of your question? what mining is this?and what will you sell, and stay in touch so that your questions can be answered and solved if it's too riskyCan you write to me in private messages?Sorry for your loss, but please stay calm and clear everything here so that everyone can give you the best advice, you should not speak to anyone privately as you will most likely get scammed. Of course, I don't mean that TribalBob is a scammer, but if someone sees this chat, they will send a private message to you, and you will easily fall into the trap without even knowing it. You are talking about mining, but we still don't know what your husband has mined and what you need to sell. Please make things more specific.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "February 01, 2023, 03:15:13 PM",
      "body": "Quote from: Alik138 on February 01, 2023, 02:46:16 PMCan you write to me in private messages?I agree with what was posted before me. Dealing in private (especially at this stage) can get you (too) easily scammed.I advise you wait until users with bigger experience in mining will see this and can guide you into providing relevant information (eg what kind of miners and hardware you have there).It may worth moving this (or asking again) in the Mining Hardware subforum: https://bitcointalk.org/index.php?board=76.0You may want to consider taking a few pictures with those devices (make sure nothing private/sensitive is captured), uploading the images to imgur.com and posting the links here on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "February 01, 2023, 03:17:32 PM",
      "body": "The better the clarity of what you want the easier it is for you to quickly get it solved, be precise and explained in an understandable tone the real current situation and the way you want to be helped, this is a community solely for bitcoin discussion, if you're late husband has a mining rig, what do you want next for the community to help you with, remember you need to be careful as well in this period not to fall into hands since you're eager to get help from any end, and sorry about your late husband.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "February 01, 2023, 04:19:26 PM",
      "body": "Quote from: Alik138 on February 01, 2023, 01:35:26 PMPlease help me! Maybe someone understands where it can be sold. Or teach you how to use it?Has he been mining before passing away? Do you know if he had friends, family members, children etc he associated with that know alot about the mining or who are also involved in mining business? If you have such who understand mining really well and can be able to manage it then you may let them help you. Unfortunately, Sole Proprietorship or private business like that could be a bit hard to manage if the owner has passed away, so it's usually advisable to sell it off. But if you can find any who can properly manage it then do. If your final wish is to sell the business, you should first of all try to see if there are willing buyers within you country/community. You could use Google to find miners around you, get their contact and ask them if they are interested in buying your late husband miner(or mining business) or perhaps they can teach you how to run the business profitably.If you can't find any then I will suggest you go to this forum section called Mining and possibly ask your question or move this your post there. Here is the section link(I guess for Bitcoin mining): https://bitcointalk.org/index.php?board=14.0Go there and ask your questions, it's a Mining-related section Hopefully you will find the right people/person to guide you on what to do with the mining farm.Hope you have the receipt that proves the miners were purchased by your husband, just in case you need to sell them/it. And I wonder if you know what he has mined so far and possibly have authorized access to it. That will probably enable you determine whether it's profitable enough to continue mining,  use it to take care of your family or continue from where he stopped.Try to provide other proofs about the miners, like pictures(or probably video) as someone already suggested. This can help make things easy for for your helpers in this forum mining section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AverageGlabella",
      "created_time": "February 01, 2023, 04:21:44 PM",
      "body": "What do you mean with mining farm? if it is a large scale mining farm then I would seek legal advice and post it for sale on the marketplace for this forum but if it is only the one or two miners you can post it in the marketplace board. You will need to gather the names of the miners and some pictures. Then you can search the marketplace and find the same model that has been sold and you can find out the price to expect from that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "February 01, 2023, 04:28:08 PM",
      "body": "Quote from: Alik138 on February 01, 2023, 01:35:26 PMPlease help me! Maybe someone understands where it can be sold. Or teach you how to use it?You can sell it in the forum marketplace or on ebay. I believe selling it is the best than run it for yourself because you don’t know how to operate it. There’s a chance that you can’t maintain it properly that will cause damage to the mining rig. Besides bitcoin mining takes a long time to get profit and it requires a lot of maintenance for the rig run smoothly. You will have trouble running it if you have other things like your job.I suggest to sell it here and ask trusted escrow to hold the funds for you so that you will not get scam. Ask @minerjones for help because I remember he is selling goods for someone then he will just ask for a commission. He is the most trusted escrow here in the forum that involves on selling goods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "February 01, 2023, 04:56:29 PM",
      "body": "Sorry for your loss and welcome to the platform. First and foremost, be careful that you do not get scammed by anyone claiming to be of help or support to you as this post is very sensitive as it has to do with bitcoin mining and there a lots of people there who knows more about mining and would go to any length to getting it. I would suggest you ignore any message sent to you in respect to this post requesting your attention for purchase or assistance in running the bitcoin mining.  I suggest any conversation about the bitcoin mine farm should be made or done here for your own safety so as not to get scammed by scammers who would use this opportunity you have already created by this post. If i may ask you this question,  did your husband tell you about any one else involved in the mine farm or he did it alone? and another, is there any regulation or law holding bitcoin mining or trading in your country ? otherwise, remain silent so as not to get yourself exposed to government actions against you which might result to you loosing your bitcoin mine farm and serving jail term. In all, I would advise you to listen or follow the high rank members here on this platform with good reputation as they would guide you through on how to go about the bitcoin mine farm your late husband had.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "February 01, 2023, 10:53:03 PM",
      "body": "Are you sure it's a mining farm do you see what exactly the equipment or units they use?Can check these two images below and tell us which one exactlyOr are you talking about mining rigs that can only mine Altcoins? If yes then this is not the right place you need to move this thread to altcoin mining section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "February 06, 2023, 09:13:51 PM",
      "body": "Quote from: BitMaxz on February 01, 2023, 10:53:03 PMAre you sure it's a mining farm do you see what exactly the equipment or units they use?Can check these two images below and tell us which one exactlyThe fact that she came to the right forum and the correct board suggests that she knows the difference between an asic miner/GPU and a pickaxe. OP, save the day and post an image of the stuff, you can use this website to upload pics > https://imgbb.com/ and then copy-paste the links here.I would also agree on what the other folks mentioned about not taking this to private messaging, keep everything as public as possible, in case you finds some long textx that looks like a bitcoin private keyCode:L2AFQdBnPoB521u6dMjrZHdqtTKBdznukkH48QGwPEA6fQkTEzU3or seed phrase that consists of 24, 18, or 12 words, never post any of those online, learn how to safely extract the coins from the wallet and then either exchange them for fiat or store them safely, aside from that you should be safe until you figure this out.Sorry for your loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "February 13, 2023, 01:50:50 AM",
      "body": "Quote from: NeuroticFish on February 01, 2023, 03:15:13 PMI agree with what was posted before me. Dealing in private (especially at this stage) can get you (too) easily scammed.I just want to the same way, I bet the OP is already bombarded by a dozen of PM right now. if the story true you husband might give you a note or anything that he talked before he dies if this big mining farm ask the employee or learn how the bitcoin work at the meantime I think is the best to shutdown the mining farm since you don't know how to work and to avoid crazy electric bill till everything settle",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "February 20, 2023, 05:44:04 PM",
      "body": "Quote from: dansus021 on February 13, 2023, 01:50:50 AMQuote from: NeuroticFish on February 01, 2023, 03:15:13 PMI agree with what was posted before me. Dealing in private (especially at this stage) can get you (too) easily scammed.I just want to the same way, I bet the OP is already bombarded by a dozen of PM right now. if the story true you husband might give you a note or anything that he talked before he dies if this big mining farm ask the employee or learn how the bitcoin work at the meantime I think is the best to shutdown the mining farm since you don't know how to work and to avoid crazy electric bill till everything settle Moreso, if there's no note at all, since it's a big mining farm as she claim and which should have workers employed by her late husband, she can put one of the trusted worker in charge of the mining farm while she oversee everything as the head getting feedbacks on outcomes, and with time she will be very well exposed to how mining works instead of planing on selling it rather see it as a legacy left behind for you and your children by your husband.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}