{
  "id": "topic_5478093",
  "title": "Thy7ace",
  "author": "Thy7ace",
  "created_time": "December 16, 2023, 01:12:33 AM",
  "content": "The truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5478093",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "December 16, 2023, 04:12:31 AM",
      "body": "That's all well and good but being a newbie, if you are not an alt account, what you have to do is dedicate yourself to using the forum. Giving that kind of advice sounds like merit fishing. If you are sincere with what you say you'd better apply that advice to yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "December 16, 2023, 04:27:18 AM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit.And you made another useless topic?QuoteIs like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies.It is a forum for free (but ordered) exchange of ideas.QuoteYou guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit.They did it because it helps them to fish merit more easily.QuoteJust focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. See welcome message on how to use the forum and rank up.Newbies Stop Teaching When You Need To Learn. It is a topic from another Nigerian user, you must read it.It is strange to see newbies want to teach other newbies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "December 16, 2023, 05:22:31 AM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. Where have you been all this time, almost a year now you created this account is just this month you decided to start posting and your posts look so matured that I will not consider you as a newbie rather an alt account or I will give you the benefit of the doubt that since you registered you used almost a year to study the forum. Sometimes some newbie are not eger to get Merit but they want to know whether the path they are riding on is okay, we all know that merit is not easy to get, for some newbies to see their post is been merited it gives them more courage to learn more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "December 16, 2023, 05:41:32 AM",
      "body": "Another fact is that you need to dedicate yourself to the forum to facilitate your path to achieving new rankings. You must apply this advice to yourself first, the wisest thing for someone to do is to advise themselves before advising others. This forum can be used as a source of additional income and you can also gain insight and knowledge if you actively discuss here.Now it's like you're on a new path since signing up, three posts in almost a year is something that's impossible. I don't want to speculate further about your development, as long as you are able to improve the quality of your posts, other users will help you speed up your reach to a new ranking. You can also apply all the suggestions above to continue your story while on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "December 16, 2023, 06:04:34 AM",
      "body": "Quote from: Chilwell on December 16, 2023, 05:22:31 AMWhere have you been all this time, almost a year now you created this account is just this month you decided to start posting and your posts look so matured that I will not consider you as a newbie rather an alt account or I will give you the benefit of the doubt that since you registered you used almost a year to study the forum. Sometimes some newbie are not eger to get Merit but they want to know whether the path they are riding on is okay, we all know that merit is not easy to get, for some newbies to see their post is been merited it gives them more courage to learn more. Actually this wasn’t his first post, the user actually made his first post at the start of this year, and another in around September, maybe OP opted out of the due to maybe personal reasons or so. But still As for the OP, newbies have come to the forum too and just as you have done give out advice like this but at the end them they self couldn’t curtail the urge to trail gradually grow and some started breaking the rules to fish for merit, I hope you hold on to your advice and possibly start engage gradually at least that is the only way to grow in ranks in the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "December 16, 2023, 11:43:44 AM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMJust focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. Judging by your first post, you promised not to write here until you understood that useful topics were important on the forum. I want to believe that you will show us all your learned topics from this day. Teaching someone how to behave on a forum without showing them an example is not entirely correct behavior.In any case, don't take criticism too seriously, but stay true to your study idea.Merit to encourage you to keep going.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "December 16, 2023, 12:23:38 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patient enough to learn. I agree with you, I have also seen tens of topics created by newbies asking how they can rank faster and how they can get more merits while some are asking what merits are and why they are important. I am not saying they should not ask such question because by asking questions people learn more and the same advice as this one are given to those who have questions about merits.They should ask questions and I think they ask because they might not have some idea about it and it is a valid reason to ask. Other than this, your advice is also a good one and we all should focus more on creating useful posts and should avoid spamming. Even I have seen many posts that look of no use to one but are given merits by the other one for whom this post is considered as useful. Merits can be given to any post as it is possible for first users who considers one's topic a great contribution while for other who know that this op had copied the whole thing and did not add any creative thing to it will prefer to give no merits but to report it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "December 16, 2023, 02:01:11 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. Newbies nowadays are actually chasing for quick merits, when they are not yet capable because they mostly lack the knowledge that makes them a good, quality poster. Instead, they should do more diligence to study and learn that connects to crypto and bitcoin. Patience and persistency are the keys,  without these they will never rank up and increase their knowledge in the forum.We should always prioritize acquiring knowledge and learning more than chasing for merits and profits. At the end of the day, that would be our end goal so we should learn to work on it as getting merits is hardly earned not freely given.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "December 16, 2023, 02:17:06 PM",
      "body": "Quote from: lovesmayfamilis on December 16, 2023, 11:43:44 AM I want to believe that you will show us all your learned topics from this day. Teaching someone how to behave on a forum without showing them an example is not entirely correct behavior.In any case, don't take criticism too seriously, but stay true to your study idea.I really hope the user centers his or her focus on how to handle criticism though because, if the user is to go by the expectation mounted on him or her by virtue of prior statement as per learned and commenting, such user might find a hard way ever writing anymore, not even to asking questions that ponders on the mind for a long time.Still, I’ll like Newbies and the rest of us to understand that, learning is continuous, it’s all true life and even concepts could be wrong, updated or corrected as new information pops up and anyone could teach so, don’t get scared to go on your keypad and show us just what you’ve learnt or discovered.It’s always a beauty when some of these beginners try not to be so focused on hateful of the ranked users on the forum for not showering them with merits. I’ll say, that’s just some means to remind everyone that merits are deserving and not given just uplift the low rank users on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 16, 2023, 02:38:10 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. Almost everything you have said in this thread is true and I hope some newbies will find it useful. The truth is that everyone wants to be commended for their efforts and merits serve as a sign that your work is appreciated.  It is not bad to expect merit for your post but it becomes a problem when one becomes desperate to earn merits to rank up. This could lead to low-quality and sometimes irrelevant posts which could attract backlash and ignores. If you put up informative and relevant posts, merits will naturally flow. And quality post is a product of learning and creativity. I have seen some wonderful posts from newbies that have earned them a good amount of merits. But sadly a large number of newbies these days don't want to learn but they want to rank up overnight. Newbies should just be themselves and enjoy the forum. OP you have just three posts and all of them are threads you created. It shows that you are not even responding to the thread or following up based on the comments it generated. I suggest that you create fewer threads and learn more about Bitcoin and the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tajimas",
      "created_time": "December 16, 2023, 02:39:49 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMIs like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies.  How far have you gone to understanding about cryptocurrency and the technology \"blockchain\" behind it, I'm just hoping to you see grow Thy7ace either on bitcointalk or somewhere else, many people started with different storyline about their crypto journey, like mine started like an airdrop participant and now had many coins bagged so far, right now started my coding lesson to becoming a full stack blockchain developer, won't you be interested growing to this point?Anyway, keep exploring the crypto space by choosing your own direction while you keep learning from your mistake which you must surely make and earn merits from your knowledge. keep up bro",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 16, 2023, 04:32:38 PM",
      "body": "For over a year that I have spent on the forum, things have actually changed a lot, particularly in the aspect of talking about merit. In my newbie day, just around this time last year, it was a very big offense to so many members for a newbie to even mention merit, but this time around, there is not much attention to how newbies are frequently talking about merit. Maybe everyone has now become soft and less concerned, but if it continues like that, I think other newbies that will create accounts here and see the other merit thread will want to create there's too, and it might become a normal thing, but the side effects are that newbies will then become more concerned about earning merit and not making any positive contribution here.Op, your advice is good if you adopt it, and there are also a few newbies that will adopt the advice too, although many of them will also ignore it and do what pleases them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 16, 2023, 04:35:00 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. This is your first post on beginners and help board and you are already teaching other newbies how to go about in the forum, it looks like we got a new teacher here. I like your post and the idea behind you making the post. Like you’ve said, just stay focused and practice what you’re teaching others in this post because anytime your found wanting of any of this mentioned allegations on other newbies, you won’t be someone that can be trusted again. So stay true to your words and do what others will love to embrace from you and not what they will use against you in the future while you are still here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 16, 2023, 04:46:15 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThose higher rank you're now where ones newbie they where patients enough to learn. To be fair towards the post-merit system newbies, it's harder now for them to rank up than it was in the past and before theymos introduced merits as a critical rank-up requirement. You didn't have to learn anything in the past, only your activity determined your forum rank. As long as your posts were good enough not to get deleted by the moderators, they remained and you gained activity, and ultimately rank. To advance in the forum hierarchy today, your posts need to matter for others to merit you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbigtart",
      "created_time": "December 16, 2023, 05:44:45 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. Good advice, especially for yourself and other beginners. This forum is quite complex if you want to learn knowledge about crypto, so take advantage of your time to continue studying and studying. Over time, if you continue to enjoy the process, merit will come by itself. Because if you focus on looking for merit you will get tired, bored and in the end you will give up. The most dangerous thing, as you said, is being too enthusiastic about seeking merit and making posts continuously, which ends up in spam. Everything takes time and a process, including increasing your account, all members here start from newbies so trust the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "December 16, 2023, 06:08:24 PM",
      "body": "One of the advised I was given when I was a newbie was to ensure that I don't involve in plagiarism. This is the only way you can find yourself out of this community and you might not have the opportunity to come back. You need to understand each section before you make a post and also getting familiar with the forum would help you so you could understand how the forum works. You will need to be asking questions where you don't understand especially about Bitcoin and other aspects. Although asking stupid questions could attract people to dislike your posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "December 16, 2023, 06:10:41 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. It's very nice to see such posts from newbie members. The merits are present on the forum and everyone looks after to get some merits especially the newbies in order to reach the ranks which would allow them to participate in signature campaigns. The users who give proper time to the forum, who create good posts, and who try to help others with their knowledge get merits as reward for their contribution. I suggest you to be optimistic and create informative posts, you'll see yourself the flow of merits. I have seen newbie members who received so many merits in a few days with just a few number of posts but there were also those newbie members who earned some merits after creating so many posts. The simplest way to earn merits is to create valuable posts and help other members with your knowledge and ideas. Focus more on learning things about Bitcoin and crypto-currencies and share your knowledge in the form of posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "December 16, 2023, 06:15:04 PM",
      "body": "Quote from: Thy7ace on December 16, 2023, 01:12:33 AMThe truth is that there's no easy way through it concerning merits, just click the beginners board all I could see is merely post concerning merit. Is like you guys are forgetting the purpose of this great forum it was created for Bitcoiners or cryptocurrencies lovers to interact and to gain more knowledge about cryptocurrencies. You guys should hold from the merit and focus on learning because if you continue with this getting of merit quick it may lead you to spamming which can affect any chance of you getting any merit. Just focus on the knowledge the forum already have for you with time eventually we will all Rank up. Those higher rank you're now where ones newbie they where patients enough to learn. As a newbie if you continue to study, without eaning merit you will be tired of the forum. I think why most people came here is to learn, earn merit and grow in rank. No need for pretence like your own motive is quit different. You just have 3 activties that is to show that you just started posting recently and the kind of advice you are giving much like a pro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "December 16, 2023, 06:39:14 PM",
      "body": "Even though your post shows your interest in the forum as to learn rather than teach yet it contradicts what you're saying from your profile status as a newbie. As you said the forum is a place to learn and converse concerning Bitcoin as the primary aim of the forum but the merit system has changed a little bit that most of us are not longer interested in marking good post rather finding a merit farming posts that seems to be helping but solely for the purpose of merit. One fact is I'm not excluded from wanting merit but it's better done in a good way than me trying to teach what I don't know. my biggest mistake right now is not reading what is necessary before hand now I'm reading it and saying to myself why didn't I read it before now. So mate do as your post portrays and don't fall of the line because you're now being watch by senior colleagues and any mistake contradicting yourself might lead to ignore list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}