{
  "id": "topic_5444206",
  "title": "Othellobit",
  "author": "Othellobit",
  "created_time": "March 10, 2023, 05:43:58 AM",
  "content": "newbies keep asking question on how to grow in Bitcoin.  Many experienced speaks more about the risks involved without saying nothing about the safety measures that one can take, why many speak about having the knowledge first, yet they contribute little or nothing to how this knowledge can be gotten. This leaves newbie with fear and different questions as of how, when and where they will get this Bitcoin knowledge easily, so I'm on a plea that the experienced should give more solution approach to this questions>>>> #how, where and when.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444206",
  "comments": [
    {
      "author": "mk4",
      "created_time": "March 10, 2023, 05:55:12 AM",
      "body": "How do you grow your bitcoin? The same way how you grow your money. By investing, trading, getting a job, starting a business, mining, you know the drill. Bitcoin isn't some magic money that you can magically grow with little to no effort.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 10, 2023, 06:15:02 AM",
      "body": "Quote from: Othellobit on March 10, 2023, 05:43:58 AMnewbies keep asking question on how to grow in Bitcoin.  Many experienced speaks more about the risks involved without saying nothing about the safety measures that one can take, why many speak about having the knowledge first, yet they contribute little or nothing to how this knowledge can be gotten. This leaves newbie with fear and different questions as of how, when and where they will get this Bitcoin knowledge easily, so I'm on a plea that the experienced should give more solution approach to this questions>>>> #how, where and when. Oh, my God! OP, can you read? Starting a topic with complaints indicates your inability to switch between sections of the forum.Almost all sections are full of warnings that you should not invest the money on which your financial well-being may depend. When investing in Bitcoin, you must understand that you are taking on the risks associated with cryptocurrencies. Read about the preferred wallets for holding Bitcoin, learn how to store your passphrases, and read about which exchanges to hold your assets on.I am not sure that you have not met similar questions and answers to them on the forum. But if you want a guarantee that someone will tell you how to become a millionaire without taking any risks, I think you have chosen the wrong forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "March 10, 2023, 06:36:20 AM",
      "body": "Quote from: Othellobit on March 10, 2023, 05:43:58 AMMany experienced speaks more about the risks involved without saying nothing about the safety measures that one can take, Safety measure to protect against risks of loss or theft:Only store bitcoin on a hardware wallet or an unused device you own that never goes online, this would be your cold wallet. Create backupsDo not store your coins on a centralized exchangesKeep your bitcoin holdings a secretNever enter your seedphrase or private keys on a website or send to someoneTo protect against panic selling:Do not FOMO inUse Dollar Cost Averaging to make purchasesOnly use money you can afford to losePlay the long gameQuote from: Othellobit on March 10, 2023, 05:43:58 AM why many speak about having the knowledge first, yet they contribute little or nothing to how this knowledge can be gotten. This leaves newbie with fear and different questions as of how, when and where they will get this Bitcoin knowledge easily,The knowledge can be gotten freely here and many a times newbies are given easy links they can use to access it.Knowledge on bitcoin is too broad to expect someone to summarize in a reply. Research and return with specific questions.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "March 10, 2023, 07:05:14 AM",
      "body": "Got the first bitcoinsHow: exchanging fiat to bitcoin, selling goods or services for bitcoin.Where: You can start on this forum[1], currency exchange board (to exchange fiat), goods and services boardWhen: any timeGrowing bitcoinsHow: with all of the above (again) or tradingWhere: Centralized[2] or P2p exchanges[3] to tradeWhen: any time1. https://bitcointalk.org/index.php?board=5.02. https://bitcointalk.org/index.php?topic=5414539.03. https://bitcointalk.org/index.php?topic=5224711.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 10, 2023, 07:33:20 AM",
      "body": "Quote from: Othellobit on March 10, 2023, 05:43:58 AMMany experienced speaks more about the risks involved without saying nothing about the safety measures that one can take, why many speak about having the knowledge first, yet they contribute little or nothing to how this knowledge can be gotten. This leaves newbie with fear and different questions as of how, when and where they will get this Bitcoin knowledge easily, so I'm on a plea that the experienced should give more solution approach to this questions>>>> #how, where and when. This is a false accusation, there have never been a time that a newbie will raise a question on how to go about his/her learning journey, and forum member will just keep their mouth shut. Did you even bother to check the beginners and helps board? You'll find so many threads from newbies asking for resources. The only time that forum members complain or advice the newbie about creating such a thread is when the thread is a duplicate or if such a thread was recently created by another newbie account, so instead they'll direct the newbie on how to search the forum to get most of the answers they may require. So I'll also advice that you check out the beginners and helps board if you have any issue. Btw I think you should learn how to post image since your rank is enough for you to post image in the forum, follow this thread to see how image link are supposed to look like. Guideline on posting images (with size adjustments), hyperlinks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 10, 2023, 11:46:49 AM",
      "body": "It's all about knowledge of Bitcoin why don't you start reading the wiki about Bitcoin?Wikipedia is a good source to start learning about Bitcoin sample this one \"History of Bitcoin\" and this \"All about Bitcoin\"Or if you are looking for the technical side of Bitcoin then check this source below.- https://github.com/yjjnls/awesome-blockchain And if about trading Bitcoin then start reading this \"Awesome Crypto Trading\"And the last thing is help and educate your self learning about Bitcoin is not instant it takes time and learn how to use the search button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 10, 2023, 11:53:21 AM",
      "body": "Quote from: BitMaxz on March 10, 2023, 11:46:49 AMIt's all about knowledge of Bitcoin why don't you start reading the wiki about Bitcoin?Wikipedia is a good source to start learning about Bitcoin sample this one \"History of Bitcoin\" and this \"All about Bitcoin\"And OP should read Prehistory of Bitcoin as well.To use Bitcoin, OP can start with Learn me a Bitcoin for beginnersChoose a wallet and secure it wellChoose it: https://bitcoin.org/en/choose-your-walletSecure it: https://bitcoin.org/en/secure-your-wallet#onlineSome advice from Chainsec for Security checklist",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "March 10, 2023, 02:52:10 PM",
      "body": "Unpopular to recommend but I'm with mk4 on \"get a job\".I think the danger with Bitcoin or any kind of investment is people get enamoured with the promise, and then abandon themselves and their careers/skills/livelihood. So save yourself time and use it to get better value for youself.If you're like me or most people, you can't really afford to deep dive and entrench yourself in it. Instead, do your job well, upskill, gain experience, focus on yourself, and you'll be able to expand your income -- and then DCA strategy benefits.That's the long-term solution. No magic bitcoin tree.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 10, 2023, 03:15:09 PM",
      "body": "Quote from: buwaytress on March 10, 2023, 02:52:10 PMUnpopular to recommend but I'm with mk4 on \"get a job\".I think the danger with Bitcoin or any kind of investment is people get enamoured with the promise, and then abandon themselves and their careers/skills/livelihood. So save yourself time and use it to get better value for youself.Get a job and use part of salary for investment in Bitcoin. It makes their bitcoin investment more sustainable long term.If they use all salary for investment, it turns to be unsustainable because when they lose a job or when they need money (cash), they must sell their bitcoin and not all times they can sell it at profitable price.Investment is executed to gain profit but investors must have plans they won't have profit but loss instead from their investment. What will they do with loss like this, they must have reserved money to use.Fortunately with Bitcoin, if you don't have to sell it at bottom, you can sell it at new all time high in a next bull run that comes after a next halving.Knowing about next block reward halving is important too: https://bitcoinblockhalf.com/Controlled supply for future halvings after 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justtoons",
      "created_time": "March 10, 2023, 05:08:30 PM",
      "body": "Quote from: mk4 on March 10, 2023, 05:55:12 AMHow do you grow your bitcoin? The same way how you grow your money. By investing, trading, getting a job, starting a business, mining, you know the drill. Bitcoin isn't some magic money that you can magically grow with little to no effort.You don't grow Bitcoin of cause, you either earn by investing , trading or mining just as he said. So newbies looking for how to grow their Bitcoin should have it in mind that they have to work for it, take risk and also bear losses. You can as well, learn when to trade and where to trade from this forum. There are good topics here that you can learn from aswell. And also you should avoid anyone or any Website that tells you that they can help you multiply your btc as these are all Ponzi schemes. Try knowing very well to know the person you are trading with before sending anything to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbterryboy",
      "created_time": "March 12, 2023, 01:20:59 PM",
      "body": "One of the best ways to start learning about Bitcoin is to read as much as you can about it. There are several books, blogs, and forums (including this one, in fact, it's the biggest and most knowledgeable one) available that provide valuable information about Bitcoin, its history, and how it works. There are also several online courses and tutorials available that can help you gain a better understanding of Bitcoin and its underlying technology.In terms of safety measures, it's important to store your Bitcoin in a secure wallet where you control the private keys, like a hardware wallet. You should also use a strong and unique password for your wallet and enable two-factor authentication wherever possible.Remember to research and carefully consider any investment opportunities related to Bitcoin before investing. Make sure to only invest what you can afford to lose and diversify your portfolio to minimize risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}