{
  "id": "topic_5447257",
  "title": "Ferib",
  "author": "Ferib",
  "created_time": "April 02, 2023, 01:48:14 PM",
  "content": "Hi,I have been doing some research lately on how multi-sig transactions can be used to harden the privacy of transactions involved in such joint transactions.Additionally, I tried to do some chain analysis to get a feeling of how difficult it can be for a third party to look at transactions and guess the flow of coins.My latest research is posted in this article, I concluded that the main challenge of doing a joint transaction (aka CoinJoin) is finding participants who are willing to participate but also follow some strict rules (e.g. no coin consolidation) to secure the privacy of all participants.My goal is to do this for Litecoin (in theory can be done for Bitcoin as well, but no interest).Does anyone know if there are any such services already? most likely, but if so, how do they work? are they obscure services listed on TOR or are there some more trusted once out there?And speaking of trust, are there zero-proof ones? I only seem to find shady mixers with 'delay' features.Thanks in advance!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447257",
  "comments": [
    {
      "author": "vv181",
      "created_time": "April 02, 2023, 05:21:36 PM",
      "body": "Litecoin need not CoinJoin. And the CoinJoin implementation on Bitcoin has been running, see JoinMarket, Wasabi, and Whirlpool. You must be looking somewhere wrong since CoinJoin in bitcoin garnered interest.Take a further look at:https://www.samouraiwallet.com/whirlpoolhttps://docs.wasabiwallet.io/why-wasabi/https://sparrowwallet.com/features/https://github.com/JoinMarket-Org/joinmarket-clientserverRegarding Litecoin, I don't know if CoinJoin implementation exists and was used within the Litecoin communities back then. Regardless of it, CoinJoin is useless in Litecoin since they have implemented MimbleWimble. I'm quite surprised that you didn't mention or talk about it in the article you referred to.The MimbleWimble implementation on Litecoin offers an opt-in privacy solution or feature in the ecosystem. It was activated on May 12, a year ago. See it on: https://www.litecoin.net/news/mweb-has-officially-activated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ferib",
      "created_time": "June 22, 2023, 07:12:55 PM",
      "body": "I am aware of MWEB but this is more of a Layer 2 solution which comes with its own set of problems.My goal for the research was to look at blockchain analysis to obscure the perm record of transactions made. An issue that MWEB does not face.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}