{
  "id": "topic_5472246",
  "title": "rahim066",
  "author": "rahim066",
  "created_time": "October 30, 2023, 08:58:14 PMLast edit: November 02, 2023, 07:31:29 PM by rahim066",
  "content": "I've been using the Omada Social Sports for about a month, and im really enjoying it gives you the gambling taste without losing ans penny, you can make predictions, and compete against your friend and other users Users earn coins for each correct prediction, which they can use to purchase in-app items such as avatars, stickers, and other customization options, Coins can also be used to enter competitions and win prizesThe app covers a wide variety of sports, including soccer, basketball, football, baseball, and more. It also has a number of competitive features, such as leaderboards, competitions, and challengespersonally i use it to test my sport betting technique, analysis to find the perfect method and not lossing moneyI am not offering any services, and i don't have any interest in sharing it is an app that i heard about from a French influencer \"NasDas\". i tried it, liked it, and wanted to share it on the forum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472246",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "October 30, 2023, 09:05:21 PM",
      "body": "I can see on playstore that they have over 1 million downloads already and it is highly rated by those that downloaded the app. It is about sport betting. I will try to gamble on the site with some people and see how it works. But this is not about casinos, just sport.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 30, 2023, 09:19:46 PM",
      "body": "Seem not BTC coins they are talking about. But you can earn money without spending a dime, seems fun to learn what's there. Good place to train yourself to bet on sports though. I would like to install it as well, I'm just not confident when they are saying we don't get to spend any money. It feels too good to be true. Wanna hear more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "October 30, 2023, 09:52:49 PM",
      "body": "That sounds like a good betting application I think but still I won't use that one myself because it's not worth it to purchase in-app items as I don't really enjoy in-app items at all. However, it seems to be a very nice app for those who may want to have some in-app items for free just by placing some bets on sports events. I don't know but if they are making money via ads then they will hardly pay any good amount to the gamblers who place bets on those events. But, still it's better to have something then nothing at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "October 30, 2023, 10:24:21 PM",
      "body": "hmmm. Real sport betting is always different from programmed betting. But everything there is trial and error. And there is no harm in trial so anyone that is interested can download and try the omada app. But one thing we have to keep at the back of our minds is that they way you play the games in the app will not be the same way it play out in reality. This is not the first time we have heard and seen betting platform or gaming site. 'Well experience is the best T.' So I will also download it and will have more to say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "October 30, 2023, 11:08:26 PM",
      "body": "I just checked the app and it seems like even those who are at the top of the leaderboard are also just doing a guess work; because if you look at their stats you’ll see that most of their predictions are no different from what we are doing sometimes. So if I’m to use the app it would be purely because I want to have not because I want to improve my chance of winning anything; I don’t believe they can do that for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 31, 2023, 09:50:09 AM",
      "body": "I just downloaded the app. This is just like some prediction app that we have out there, where everyone has to predict the outcome of a particular game based on their expectations, but here you earn a reward for having the most accurate predictions. I see some features like how to buy and unlock some rewards in the app, which requires you to pay from external funds based on your currency, which means people can also convert some of their rewards to real cash and withdraw them to their accounts. If that's correct, it's indeed a nice app to learn and earn at the same time. We will have to look for any interesting friends with whom we might have the same desired sport location so that we can try this out and see how friends-to friends playing works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 31, 2023, 10:13:54 PM",
      "body": "Is this what you're referring to, if I'm not mistaken?Website: https://www.omadagame.comTheir app is also available on the Play Store. I'll give it a try.Thanks for sharing about this, OP. It seems like an amazing app for sports enthusiasts who want to enjoy the thrill of sports betting and test technique and analysis without the risk of losing real money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "October 31, 2023, 11:01:29 PM",
      "body": "If you are offering a service you will need at least two things to put forward to the prospective customers. How can we make sure this site is trustable? Where are the reviews or the forum members opinions and experiences. The second one, you are offering \"a experience\" so you have to substantiate that there is actually something different in the experience to other sites. More information is required particularly if newby posting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "November 01, 2023, 12:16:49 AM",
      "body": "I'm still on the fence about this, yeah it has been downloaded many times, but still it does not support crypto if I'm not mistaken. Plus it seems that most gamblers here haven't heard of this app before and obviously didn't used it.As we love to play sports betting on our favorite casino and not rely on some apps. Definitely, there is a thrill for sports betting that's why millions of people around the word are betting on it. But until I saw some reputable members here giving a feedback or review with this apps, I wouldn't download it for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahim066",
      "created_time": "November 01, 2023, 03:43:25 PM",
      "body": "Quote from: paxmao on October 31, 2023, 11:01:29 PMIf you are offering a service you will need at least two things to put forward to the prospective customers. How can we make sure this site is trustable? Where are the reviews or the forum members opinions and experiences. The second one, you are offering \"a experience\" so you have to substantiate that there is actually something different in the experience to other sites. More information is required particularly if newby posting.Honestly, i am not offering any services. it is an app that i heard about from a French influencer \"NasDas\". i tried it, liked it, and wanted to share it on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "November 01, 2023, 04:22:50 PM",
      "body": "Very interesting mate. I noticed their presence is unknown here and i can not tell if they are for real but  from what I see on play store, possibly they have over one million downloads which is a good and positive sign they are up and doing but OP, I would be made to understand that you are trying to promote them here or possibly you are their representative here which would make it more easier for the casino to operate here.It would be nice you create an announcement thread for the casino and do the needful rather than this shillings you are doing here. I believe if you do an the right thing, members would pick interest in your casino to start with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 01, 2023, 05:00:56 PM",
      "body": "Quote from: rahim066 on November 01, 2023, 03:43:25 PMQuote from: paxmao on October 31, 2023, 11:01:29 PMIf you are offering a service you will need at least two things to put forward to the prospective customers. How can we make sure this site is trustable? Where are the reviews or the forum members opinions and experiences. The second one, you are offering \"a experience\" so you have to substantiate that there is actually something different in the experience to other sites. More information is required particularly if newby posting.Honestly, i am not offering any services. it is an app that i heard about from a French influencer \"NasDas\". i tried it, liked it, and wanted to share it on the forum. Perhaps that is a little detail you should have included in your initial post when opening this thread, because the first thing which comes to mind when someone talks about a service like this, is there is some advertisement campaign behind all of this. It is something which has happened before here, you know: people being paid or taking advantage of some review campaign, posting links around and won't even disclose they are receiving benefits from it. I personally like how that feature of betting without using real money in order to access avatars and other features sounds , it may be a good practice for newbies who would feel like to test their betting skills and intuition, before going in and depositing their money right away. If you feel like sharing more details about this app, feel free to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "November 01, 2023, 05:55:05 PM",
      "body": "To be honest, I haven't seen many articles explaining what the point of this app is, how they manage to make profits to pay people when they make predictions and they get it right, so I can't understand what the advantage is for people to use this app rather than using casinos. normal. because if we look closely, we will see that in normal casinos they have options to play in demo mode, people don't put money in to play but they also don't win real money if they win when they are in demo mode, but there is an advantage that people can get used to it with the games before they put in real moneySo if people don't put real money in this app, but play and can win real money if they get it right, then I don't see any big differences with normal casinos when they offer a demo account option. and honestly I don't see how this app would be making profits if they are allowing people to play without putting money in but earning money if they get it right, can someone explain to me how the owners of this app are making a profit with this app and what people lose when using it he?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "November 01, 2023, 06:01:15 PM",
      "body": "Quote from: rahim066 on October 30, 2023, 08:58:14 PMI've been using the Omada Social Sports for about a month, and im really enjoying it gives you the gambling taste without losing ans penny, you can make predictions, and compete against your friend and other users Users earn coins for each correct prediction, which they can use to purchase in-app items such as avatars, stickers, and other customization options, Coins can also be used to enter competitions and win prizesThe app covers a wide variety of sports, including soccer, basketball, football, baseball, and more. It also has a number of competitive features, such as leaderboards, competitions, and challengespersonally i use it to test my sport betting technique, and analysis to find the perfect method and not lose moneyNice to have such information and to also have the app listed on the Play Store This may be a great help for those who are looking for where to test and build their predictions and sports analysis at some point, also we have to adapt to some of its features to help guide us through the platform and how to use it effectively.Just i quick one, can we deposits and make real-time sport predictions, this app is going to receive a lot of attention and from what I can see on the reviews on Play stay they already have a lot of positive things going on for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 02, 2023, 10:30:01 AMLast edit: November 02, 2023, 10:58:33 AM by Text",
      "body": "Quote from: Slow death on November 01, 2023, 05:55:05 PM-snipSo if people don't put real money in this app, but play and can win real money if they get it right, then I don't see any big differences with normal casinos when they offer a demo account option. and honestly I don't see how this app would be making profits if they are allowing people to play without putting money in but earning money if they get it right, can someone explain to me how the owners of this app are making a profit with this app and what people lose when using it he?The company makes its money in two ways:In-app purchases: Users cannot buy points but can buy ‘diamonds’ to boost their competitive play.Commercial partnerships: Selected commercial partnerships are featured on Omada’s platform.Read more here:https://venturebeat.com/games/omada-raises-7-5m-for-social-prediction-game-for-sports-fanshttps://www.businessinsider.com/omada-sports-gaming-app-raises-75-million-round-led-by-felix-capital-2023-9Quote from: Ojima-ojo on November 01, 2023, 06:01:15 PMNice to have such information and to also have the app listed on the Play Store This may be a great help for those who are looking for where to test and build their predictions and sports analysis at some point, also we have to adapt to some of its features to help guide us through the platform and how to use it effectively.Just i quick one, can we deposits and make real-time sport predictions, this app is going to receive a lot of attention and from what I can see on the reviews on Play stay they already have a lot of positive things going on for them.I think this app does not support real-time sports predictions with real money at the moment so we cannot deposit but we users can buy diamonds and use them to buy avatars or collectible cards to boost odds or boost performance in the game. They are focused on providing a fun and risk-free environment for sports enthusiasts to test their prediction skills.But do you think OP that developers might work on adding this feature in the future?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "November 02, 2023, 12:47:04 PM",
      "body": "Looking at the above detailed reviews we can say that it is more or less for fun play. If I’m gonna earn virtual currency for virtual currency with no other gains then definitely it’s fun play only app. This could be opportunistic app for those who wants to experience sports betting without putting their real money on any platform. I think there are plenty apps like this but only few of them are as good as worth discussing. Now a days sports betting has gone up wildly due to their integrations on various gambling sites, faucets, and also independent sites. I think this would be fun to have with you if the stats are picked up from the real game event so that one can train himself on real play without real money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "November 02, 2023, 01:53:44 PM",
      "body": "Quote from: Cantsay on October 30, 2023, 11:08:26 PMSo if I’m to use the app it would be purely because I want to have not because I want to improve my chance of winning anything; I don’t believe they can do that for me.If this app can make it easier for you to track your betting history and it's free, why not give it a try? I haven't checked the app myself, but I'm interested in using it to keep a record of my sports betting experiences. This way, I can see how successful my betting strategy is and gain more confidence when betting larger amounts once I have a convincing track record.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "November 02, 2023, 02:11:42 PM",
      "body": "The thrill of sportsbetting comes from betting real money which introduces a sense of risk that is completely absent from the app that you are talking about op which is why it cannot replicate realistic sportsbetting.However, if the intention is to just have fun and not focus on earning serious money, this app is recommended for sure in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 02, 2023, 03:22:51 PM",
      "body": "Quote from: Viscore on November 02, 2023, 01:53:44 PMQuote from: Cantsay on October 30, 2023, 11:08:26 PMSo if I’m to use the app it would be purely because I want to have not because I want to improve my chance of winning anything; I don’t believe they can do that for me.If this app can make it easier for you to track your betting history and it's free, why not give it a try? I haven't checked the app myself, but I'm interested in using it to keep a record of my sports betting experiences. This way, I can see how successful my betting strategy is and gain more confidence when betting larger amounts once I have a convincing track record.It’s not a bet tracking app.It’s just an app where you can see people make predictions and if their prediction comes out right they’ll be given a certain amount of coins (the coins depends on how much you staked initially) so if you are a punter and too lazy to make predictions or analyze games you can just go to the app and look at the leaderboard and look for those win high win rates and follow their predictions. As for the coins that users normally win, I don’t know what it’s used for but if you’re looking for a way to experience betting while not risking your money you can try the app; but note that it does not track your real bet history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}