{
  "id": "topic_5439385",
  "title": "Rockson1",
  "author": "Rockson1",
  "created_time": "February 10, 2023, 07:43:15 PM",
  "content": "There is a big problem in the marketing industry where people in Nigeria buy sales products, how can business men an women sales there products with the action taking by the Senate President of the federation Nigeria, to stop taking the old note's from customers, I think with this lest trends crypto currency can help. the situation in the marketing industry,many business men and women don't know about this cashless. Policy, how can they survived it by exchanging in the marketing industry in Nigeria please need help as a new.beginner.https://www.legit.ng/nigeria/1519349-naira-swap-meeting-buhari-lawan-speaks-cbns-deadline-reveals-fresh-position/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439385",
  "comments": [
    {
      "author": "Broadanbig",
      "created_time": "February 10, 2023, 10:24:18 PM",
      "body": "Quote from: Rockson1 on February 10, 2023, 07:43:15 PMThere is a big problem in the marketing industry where people in Nigeria buy sales products, how can business men an women sales there products with the action taking by the Senate President of the federation Nigeria, to stop taking the old note's from customers, I think with this lest trends crypto currency can help. the situation in the marketing industry,many business men and women don't know about this cashless. Policy, how can they survived it by exchanging in the marketing industry in Nigeria please need help as a new.beginner.https://www.legit.ng/nigeria/1519349-naira-swap-meeting-buhari-lawan-speaks-cbns-deadline-reveals-fresh-position/Oboy this your grammar sef get as e be. E for better say you flow for our local Pidgin so that  one go make sense say we understand than to come dey see all this. Well you try Sha but see ehn de news wey dey for air now be say the supreme court which na the Apex court of Naija don suspend the deadline for currency swap see am here https://www.primebusiness.africa/just-in-cbn-stopped-from-phasing-out-old-naira-as-supreme-court-favours-northern-states/ but that one no means say people no go swap their old currency o. The only thing with this court judgement be say e give enough time for everyone to go bank go swap their old currency notes so that e go reduce in circulation while the new note go come begin tmdey circulate.Another issue be say Naija never mature for this cashless policy matter of a thing. Dem want to do cashless wey bank no even get network to do transfer. I go market today to go buy something the market women Dem no gree for transfer o. The woman say make I pay cash omo o need go find post to get cash even the POS sef na wa. The new note and cashless policy matter tie wrapper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}