{
  "id": "topic_5450379",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "April 27, 2023, 01:45:12 PM",
  "content": "https://nhglobalpartners.com/china-social-credit-system-explained/Key Takeaways1. The goal of the China social credit system is to provide a holistic assessment of an individual’s, or a company’s, trustworthiness.2. The China social credit system, while still in development, is arguably an extension of existing social rankings and ratings in China which have existed for millennia.3. The consequences of a poor social credit score could be serious. It may affect travel prospects, employment, access to finance, and the ability to enter into contracts. On the other hand, a positive credit score could make a range of business transactions much easier.4. It is essential that any foreign business consolidating or establishing their presence in China seek professional advice for managing a social credit score. This applies both to individual scores, and the corporate social credit score. __China banned millions of people with poor social credit from transportation in 2018https://www.theverge.com/2019/3/1/18246297/china-transportation-people-banned-poor-social-credit-planes-trains-2018___Do you think this is a good system for managing people so that good people get more benefits at the expense of bad people.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450379",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "April 27, 2023, 02:42:14 PM",
      "body": "Helping the poor and committing heroic act gets you some points based on that image. So this also means I could get a low social ranking even if I'm not doing anything illegal. if I only care about my source of living and pretty much ignore everything that's happening around me then no points for me huh? It looks like this is not a place for minding my own business. Voluntarism would be removed in this kind of environment since everyone is expecting some reward for their actions.Praising the Government on social media are plus points too? hehehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 27, 2023, 02:57:30 PM",
      "body": "Quote from: Yogee on April 27, 2023, 02:42:14 PMHelping the poor and committing heroic act gets you some points based on that image. So this also means I could get a low social ranking even if I'm not doing anything illegal. if I only care about my source of living and pretty much ignore everything that's happening around me then no points for me huh? It looks like this is not a place for minding my own business. Voluntarism would be removed in this kind of environment since everyone is expecting some reward for their actions.Praising the Government on social media are plus points too? hehehe.Any system can be hacked if you understand how it works. I read that this system collects more than 140 indicators and makes its own calculations based on them. And this system is gradually being introduced in large cities, then in small ones. On the one hand, this system can train the population, but on the other hand, it can force citizens to be more law-abiding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "April 27, 2023, 05:30:26 PM",
      "body": "Thanks for sharing. I didn't realise they actually had benefits for having high scores. I thought it was just a stick with no carrot.You have to admit, that's a pretty effective way of controlling the population. Some silver-lining is that it's probably less harsh on the disobedient people than the \"traditional\" methods of jail, labour camps and torture, although they probably still use those too.I wonder how much time we have left before similar systems are implemented in the West. The messed up part is, that after a while everyone would get used to it and consider it as the new normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "April 27, 2023, 05:40:50 PM",
      "body": "Quote from: zasad@ on April 27, 2023, 01:45:12 PMKey Takeaways1. The goal of the China social credit system is to provide a holistic assessment of an individual’s, or a company’s, trustworthiness.2. The China social credit system, while still in development, is arguably an extension of existing social rankings and ratings in China which have existed for millennia.3. The consequences of a poor social credit score could be serious. It may affect travel prospects, employment, access to finance, and the ability to enter into contracts. On the other hand, a positive credit score could make a range of business transactions much easier.4. It is essential that any foreign business consolidating or establishing their presence in China seek professional advice for managing a social credit score. This applies both to individual scores, and the corporate social credit score. ___Do you think this is a good system for managing people so that good people get more benefits at the expense of bad people.The mid point trap door and description for it highlights the real reason behind this. It's all about absolute political control and coercion. A dystopian society where you cannot criticize the leaders of your country, even if they are completely incompetent and leading your people to self destruction. The good news it such societal controls ultimately lead to self destruction of the political elite, the bad news is it can take a while to happen and nobody knows what will be the final straw that breaks it. It's pathetic and almost comical that they put online cheating at the bottom of all this, like that is the worst thing in society - not drugs, or domestic abuse, or any numerous other crimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "April 27, 2023, 05:52:01 PM",
      "body": "Quote from: Fortify on April 27, 2023, 05:40:50 PMIt's pathetic and almost comical that they put online cheating at the bottom of all this, like that is the worst thing in society - not drugs, or domestic abuse, or any numerous other crimes.I'm guessing the list of credit-reducing offenses is not exhaustive and probably only mentions things that are not already criminalised under normal laws. I can't imagine that common criminals would not have their ratings reduced.Or maybe the wording was just a choice of whoever designed that graphic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "April 27, 2023, 05:59:30 PM",
      "body": "Quote from: Yogee on April 27, 2023, 02:42:14 PMHelping the poor and committing heroic act gets you some points based on that image. So this also means I could get a low social ranking even if I'm not doing anything illegal. if I only care about my source of living and pretty much ignore everything that's happening around me then no points for me huh? It looks like this is not a place for minding my own business. Voluntarism would be removed in this kind of environment since everyone is expecting some reward for their actions.Praising the Government on social media are plus points too? hehehe.That's about right. If you hear something that isn't right, you gotta stick your nose to find out and earn credits. This is where you will be paranoid all the time if someone around your family going to snitch on what you are doing. You just gotta do things right. This is why the bad seeds are going abroad to commit crimes outside China because if they commit crimes in the mainland, they'd get zero or worse fed to a dog.  A real penalty which I guess is what people need to be disciplined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 27, 2023, 06:06:07 PM",
      "body": "I have seen this before and i knew it was bad, but this puts thing into a new perspective. Why in the world China would punish someone for cheating in an online game? is that a crime against the state or something?Also, notice how the graphic points out the fact this social points system use concepts which are very relative like \"dishonesty\" or \"illegality\". It is such a disgrace one of the leading economical powers in the world would need to opt for such dystopian models to control the population. This makes me kind of grateful not to live where I do.No wonder why Taiwan is afraid of getting invaded and conquered by Mainland China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 27, 2023, 07:37:00 PM",
      "body": "Quote from: Hispo on April 27, 2023, 06:06:07 PMI have seen this before and i knew it was bad, but this puts thing into a new perspective. Why in the world China would punish someone for cheating in an online game? is that a crime against the state or something?Also, notice how the graphic points out the fact this social points system use concepts which are very relative like \"dishonesty\" or \"illegality\". It is such a disgrace one of the leading economical powers in the world would need to opt for such dystopian models to control the population. This makes me kind of grateful not to live where I do.No wonder why Taiwan is afraid of getting invaded and conquered by Mainland China.  The Chinese Communist Party is creating a system to manage its large population (China has almost 1.5 billion people).  This system is so rigid that the founder of one of the world's largest companies (AliBaba), chose to transfer control of his company to the Chinese Communist Party and leave the country.  In medieval Spain, laws were passed against luxury.  In modern China, there are also such laws - for example, Chinese bloggers are forbidden to dress expensively and brightly....  Some prohibitions are reasonable from the point of view of preventing the degradation of the nation - for example, children under 16 are allowed to play computer games no more than 2 hours a day.  This is monitored by special computer programs.  China's choice is the total control of the population, the transformation of the Chinese population into a new kind of intelligent ants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "April 27, 2023, 08:08:22 PM",
      "body": "Quote from: zasad@ on April 27, 2023, 01:45:12 PMDo you think this is a good system for managing people so that good people get more benefits at the expense of bad people.Nope. This is government sponsored segregation. The government can deprive you of civil liberties based on their arbitrary scoring system to serve no purpose but state interest. Communism always comes down to these sort of restrictions/population control because the system never works as intended so they don't have a choice but issue a credit system.Quote from: Fortify on April 27, 2023, 05:40:50 PMIt's pathetic and almost comical that they put online cheating at the bottom of all this, like that is the worst thing in society - not drugs, or domestic abuse, or any numerous other crimes.Wonder where'd they put \"illicit currency usage\", aka Bitcoin holders? To the communist regime, having citizens freed from the their tyrannical grip through decentralized currency must rank as a high violation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "April 27, 2023, 08:12:40 PM",
      "body": "Quote from: zasad@ on April 27, 2023, 01:45:12 PMDo you think this is a good system for managing people so that good people get more benefits at the expense of bad people.I think it's a horrible system all around, and I might be inclined to think \"Who cares? This is China we're talking about, not the US\" but China seems to be exerting its influence all around the world these days and shit like this might well spread to Europe, the states, and who knows where else.Even in the US, we've already got a credit rating system that screws people over on the regular--and that's in addition to standard background checks that any employer or anyone with enough dough to afford to get one can do.  That's pretty damn close to a social ranking system if you ask me, and it's been aided and abetted by technology.  I can't imagine things getting any better with respect to that.Weather forecast:  gloomy and little to no chance of sunshine.  Ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "April 27, 2023, 08:25:55 PM",
      "body": "Quote from: Yogee on April 27, 2023, 02:42:14 PMHelping the poor and committing heroic act gets you some points based on that image. So this also means I could get a low social ranking even if I'm not doing anything illegal. if I only care about my source of living and pretty much ignore everything that's happening around me then no points for me huh? It looks like this is not a place for minding my own business. Voluntarism would be removed in this kind of environment since everyone is expecting some reward for their actions.Praising the Government on social media are plus points too? hehehe. Well if you're not keen about giving the homeless alms or helping the sick, you could always look out for your older parents. Apparently people must visit their parents on a regular basis otherwise the parents are (and correct me if I'm wrong with this) obliged to tell the authorities that you are neglecting them. You're also not allowed to talk smack about Xi Jinping and the consequences for violating this rule is a little more dire than the rest. Basically, you have to paint the image of an ideal Chinese. Which is of course not going to work all the time. I can see the greater intent in creating these ordinances, but as with the Xi Jinping rule, this could also be used to control the public to do the government's bidding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "April 27, 2023, 08:29:13 PM",
      "body": "I like how you can have points deducted for participating in a cult  This means that if you're a bitcoiner, supporting free money can be seen as participating in a cult, or some other anti-government activity. It's the same with spreading false information in the Internet. It gives the government full power and allows it to score your conduct the way it wants. If you say the government doesn't want you to hold your own money, that can be labeled as spreading misinformation because the government doesn't want people to hold money, but will not admit it. You could see a similar situation in Russia where people were being arrested for wearing blue and yellow, as in the eyes of the government this was a sign of support for Ukraine. I remember that one guy was arrested for wearing blue and yellow sneakers.  You can try and try and still become the enemy of the state for being in the wrong place at the wrong time, or wearing clothes they don't want you to wear. If they ever try this in my country, I'm out of here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 27, 2023, 08:43:36 PM",
      "body": "Quote from: darkangel11 on April 27, 2023, 08:29:13 PMI like how you can have points deducted for participating in a cult  This means that if you're a bitcoiner, supporting free money can be seen as participating in a cult, or some other anti-government activity. It's the same with spreading false information in the Internet. It gives the government full power and allows it to score your conduct the way it wants. If you say the government doesn't want you to hold your own money, that can be labeled as spreading misinformation because the government doesn't want people to hold money, but will not admit it. You could see a similar situation in Russia where people were being arrested for wearing blue and yellow, as in the eyes of the government this was a sign of support for Ukraine. I remember that one guy was arrested for wearing blue and yellow sneakers.  You can try and try and still become the enemy of the state for being in the wrong place at the wrong time, or wearing clothes they don't want you to wear. If they ever try this in my country, I'm out of here. There is such a psychological concept as “learned helplessness”.  People are taught that nothing depends on their actions, their actions are not able to lead to the result they need.  The social rating system develops a syndrome of \"learned helplessness\" in people.  For example, newlyweds come to check into a Chinese hotel.  But at the hotel reception they are told - \"Sorry, but according to your social rating you do not have the right to stay in a four-star hotel. Please look for another - three-star hotel !\" At the same time, the newlyweds have no idea why  their social rating has been lowered and what are these strange restrictions (prohibitions) connected with. They develop a syndrome of “learned helplessness.” A person with the syndrome of “learned helplessness” is not capable of seriously resisting government power and is absolutely not dangerous to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arallmuus",
      "created_time": "April 27, 2023, 09:04:43 PM",
      "body": "Quote from: zasad@ on April 27, 2023, 01:45:12 PMDo you think this is a good system for managing people so that good people get more benefits at the expense of bad people.Personally I think its a decent system but its kinda harsh on the punishment especially if you are on low end social scores. This might actually benefit the country in a sense to enforce the people to do some good deeds to earn some sort of social scores with the benefits of getting better public facilitiesImagine that if they omitted the punishment for getting low scores but instead encourage more people to get better scores by giving away better facilities, the worlds could be a better place to live. Those who dont really care about this shit would be free to use the average joe facilities like usual so nobody is getting any negative effect because of this systemQuote from: darkangel11 on April 27, 2023, 08:29:13 PMI like how you can have points deducted for participating in a cult  This means that if you're a bitcoiner, supporting free money can be seen as participating in a cult, or some other anti-government activity. It's the same with spreading false information in the Internet. It gives the government full power and allows it to score your conduct the way it wantsIts China we are talking about so its clear that this is a step that they would take if you ever not support the goverment by doing all these various activities",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "April 27, 2023, 09:17:17 PM",
      "body": "Quote from: Smartprofit on April 27, 2023, 07:37:00 PM...China's choice is the total control of the population, the transformation of the Chinese population into a new kind of intelligent ants.This has always been one of the aims of communism, individual expression and idiosyncratic behavior is undesired, they want people to become nothing more but cogs in the machine they can replace as needed without anyone making any fuss about it in order to reach the goals of the government, whatever those goals may be, and obviously individualism runs contrary to this, so this credit system is nothing more but a new attempt to make people more uniform on their behavior and actions, by using a system similar to what you could find in a video game with levels and quests you need to complete.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "April 27, 2023, 09:25:03 PM",
      "body": "The manipulation of Social Credit scores cannot be avoided. There are many individuals who choose not to do good things, yet they remain wealthy.The system is challenging to implement with China's current population of 1.4 billion. Such a system is more suitable for educational institutions to teach discipline and responsibility to students.We cannot judge a person's activities and represent them with a number. It takes a lot of human resources to evaluate it all, and even the cost of implementing such a system would undoubtedly be substantial.I believe that a system like this will not last long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "April 27, 2023, 09:26:21 PM",
      "body": "There are probably some good sides to this as well as bad sides as well. I do not care who says what, I believe that China is managed by dictatorship, by definition if a nation doesn't have proper democratic elections then it is a dictatorship and if you and I both know that the president will stay president, that is dictatorship.In a world with dictatorship, social credit score could be ruined if the party wants it to be ruined, that is how corruption in dictatorship works, you could be a great person who dislikes the government and you would be banned, this is another way of just labelling people. However, for regular people who have nothing to fear and like the government, it could be a good improvement on their life as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "disconnectme",
      "created_time": "April 27, 2023, 09:32:46 PM",
      "body": "If you know the end goal there is nothing good in this, there is no saint anywhere so for you to think you will be assigning value for everyone's actions is wrong, all these guys setting up this kind of system are all evil people and want to stick to power at all cost, the disturbing thing is that the western countries are buying into this system, we know what China stands for but if you looked at what is happening France, Canada, Netherlands, I just hope people will stand up to these evil people on time.The concerning thing is that they have successfully brain-watched some people believing that this is a good thing and you see these people defending government actions, Government has never done anything for the people but take more power and control for itself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 27, 2023, 10:11:41 PM",
      "body": "Quote from: South Park on April 27, 2023, 09:17:17 PMQuote from: Smartprofit on April 27, 2023, 07:37:00 PM...China's choice is the total control of the population, the transformation of the Chinese population into a new kind of intelligent ants.This has always been one of the aims of communism, individual expression and idiosyncratic behavior is undesired, they want people to become nothing more but cogs in the machine they can replace as needed without anyone making any fuss about it in order to reach the goals of the government, whatever those goals may be, and obviously individualism runs contrary to this, so this credit system is nothing more but a new attempt to make people more uniform on their behavior and actions, by using a system similar to what you could find in a video game with levels and quests you need to complete.Here I do not quite agree, the goal of communism is still not total control over the population, but the construction of an ideal society in which each person strives to the best of his ability to benefit the whole society (at the same time, he receives in abundance all the benefits that he needs).  Communism originally had a humanistic basis.  This social concept proceeded from the fact that a person can become better.  Therefore, a person needs to be educated.  As for the total control over society with the help of modern technologies (the so-called digital concentration camp), this is a relatively new concept of the 21st century.  It comes from the fact that a person is just an object of control.  He does not need to be educated, since in principle he is not able to become better and is a biological robot.  At the same time, this is implemented all over the world in one way or another (it's just that in China everything happens much more strictly and consistently).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}