{
  "id": "topic_5477217",
  "title": "cryptosize",
  "author": "cryptosize",
  "created_time": "December 09, 2023, 08:34:41 PMLast edit: December 09, 2023, 08:46:40 PM by cryptosize",
  "content": "A Western-type Democracy is associated with liberal principles (freedom of movement, freedom of capital etc.)BTC is kinda the same... you're free to transact as you wish (within BTC's mainnet rules) and there's an expectation of zero censorship.The problem with Western-type Democracy is that it's very easy to hijack it: you can flood it with illegal immigrants (see: USA/Europe) and nobody can do anything about it.BTC is kinda the same... you can flood the network with monkey jpegs and nobody can do anything about it, because there's this expectation of zero censorship.Trying to censor transactions feels like adopting totalitarian regimes' principles, even if it's for a good purpose (banning Ordinals/NFTs).Neither West, nor BTC are perfect, that's pretty much obvious to everyone.I'm afraid some people might be right that there's a conspiracy going on (BlackRock might be trying to flood the network before ETF's approval with ORDI/NFTs raising the fees to absurd levels).No, I don't have any proof, it's just a thought and I sincerely hope I'm wrong, because if I'm right, then it doesn't sound too good for Bitcoin's future (they will push everyone to custodial solutions with KYC, since very few people will be able to open Lightning channels).Back in May I had written a FB post about how in the future you will have to pay $1000* for an on-chain transaction. BTC mainnet will basically become a settlement network for banks. The Average Joe will be forced to use CEX or Lightning (if he's lucky enough to have a channel already).* this could also happen if BTC is worth millions of dollars one dayCBDC will bring back the Gold standard. CBDC will be backed by BTC.Do I have a solution in mind that doesn't have drawbacks? No, I don't. Both big blocks and Lightning have serious drawbacks.Just thought I'd make a West/BTC analogy... you don't have to attack me for it. This isn't a thread to discuss illegal immigration.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477217",
  "comments": [
    {
      "author": "icalical",
      "created_time": "December 09, 2023, 10:40:12 PM",
      "body": "Quote from: cryptosize on December 09, 2023, 08:34:41 PMBTC is kinda the same... you can flood the network with monkey jpegs and nobody can do anything about it, because there's this expectation of zero censorship.You definitely can't distinguish between Bitcoin and Altcoins (Cryptocurrency), there is no monkey jpegs in BTC even tho Bitcoin blockchain can be used to make NFT, but most of the time it was used for .btc domain. Bitcoin is very different with any democracy that exist today, most of the democracy nowadays are still very centralized all the policies executed and made by central entity, this means that all the policies need to secure the interest of the entity, while bitcoin is ture decentralized everything that is happened and is going to happened is because the market and community. What you are describing is centralized altcoin and we know most of the bitcoin enthusiast is against that centralization used of blockchain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 09, 2023, 10:49:56 PM",
      "body": "Quote from: icalical on December 09, 2023, 10:40:12 PMQuote from: cryptosize on December 09, 2023, 08:34:41 PMBTC is kinda the same... you can flood the network with monkey jpegs and nobody can do anything about it, because there's this expectation of zero censorship.You definitely can't distinguish between Bitcoin and Altcoins (Cryptocurrency), there is no monkey jpegs in BTC even tho Bitcoin blockchain can be used to make NFT, but most of the time it was used for .btc domain. Bitcoin is very different with any democracy that exist today, most of the democracy nowadays are still very centralized all the policies executed and made by central entity, this means that all the policies need to secure the interest of the entity, while bitcoin is ture decentralized everything that is happened and is going to happened is because the market and community. What you are describing is centralized altcoin and we know most of the bitcoin enthusiast is against that centralization used of blockchainYou definitely cannot understand the point of this thread...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "December 09, 2023, 11:37:47 PM",
      "body": "Quote from: cryptosize on December 09, 2023, 08:34:41 PMI'm afraid some people might be right that there's a conspiracy going on (BlackRock might be trying to flood the network before ETF's approval with ORDI/NFTs raising the fees to absurd levels).What do they gain from raising the fees?I think a simple explanation is that people are paying fees for ordinals and such because they either hope to make profitable trades, or because they are rich crypto investors who can afford to burn money on collectibles.And I doubt that nfts can drive the fees up to $1,000 but they can certainly drive it to $5-40 for short periods of time, and that's already highly annoying. We talk so much about Bitcoin helping the economies of poor countries and banking the unbanked, well good luck convincing them that they have to pay their daily salary for a single transaction fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 09, 2023, 11:47:21 PM",
      "body": "Quote from: hatshepsut93 on December 09, 2023, 11:37:47 PMQuote from: cryptosize on December 09, 2023, 08:34:41 PMI'm afraid some people might be right that there's a conspiracy going on (BlackRock might be trying to flood the network before ETF's approval with ORDI/NFTs raising the fees to absurd levels).What do they gain from raising the fees?I think a simple explanation is that people are paying fees for ordinals and such because they either hope to make profitable trades, or because they are rich crypto investors who can afford to burn money on collectibles.And I doubt that nfts can drive the fees up to $1,000 but they can certainly drive it to $5-40 for short periods of time, and that's already highly annoying. We talk so much about Bitcoin helping the economies of poor countries and banking the unbanked, well good luck convincing them that they have to pay their daily salary for a single transaction fee.They make the Bitcoin network less affordable for poor people as you said, so in a sense they will be forced to use custodial services (with KYC). Kinda like CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 10, 2023, 12:10:09 AMLast edit: December 10, 2023, 12:39:58 AM by franky1",
      "body": "my view,bitcoin 2009-2013 was western liberal democracybut dev politics and business sponsorships got in the way after 2013 and bitcoin has changed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 10, 2023, 12:13:54 AM",
      "body": "Quote from: franky1 on December 10, 2023, 12:10:09 AMmy view,bitcoin 2009-2013 was western liberal democracybut dev politics and business politics got in the way after 2013 and bitcoin has changedI think it's still a Western liberal democracy, unless censorship becomes the norm in every pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 10, 2023, 12:42:57 AM",
      "body": "Quote from: cryptosize on December 10, 2023, 12:13:54 AMQuote from: franky1 on December 10, 2023, 12:10:09 AMmy view,bitcoin 2009-2013 was western liberal democracybut dev politics and business politics got in the way after 2013 and bitcoin has changedI think it's still a Western liberal democracy, unless censorship becomes the norm in every pool.USER nodes dont get a vote no more.. thanks to \"backward compatibility\"its now economic nodes(services and exchanges) and core devs that sway pools to do thingsthe github of bitcoin clients was more open to people making personal clients not branded \"core\".. but now they want to moderate and control the core github and call anything not core a cheap knock off/fraudthings have changed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "December 10, 2023, 01:36:04 AM",
      "body": "Quote from: cryptosize on December 09, 2023, 08:34:41 PMA Western-type Democracy is associated with liberal principles (freedom of movement, freedom of capital etc.)I think the westerners have come to the standpoint that what they actually need is freedom and they do need it in the area of finance most especialy as the government is more focused on draining them financially. However, they can not totally enjoy freedom as the government still enact policies that strangulates whatever approach they take towards their freedom.Bitcoin is the best form of democracy to the global technology space and most importantly the financial space but the west is still trying to frustrate it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 10, 2023, 06:08:29 AM",
      "body": "Quote from: cryptosize on December 09, 2023, 08:34:41 PMA Western-type Democracy is associated with liberal principles (freedom of movement, freedom of capital etc.)That's on paper and what the advertisement says. But in reality and in actual definition democracy is all about brainwash. Those who invented it define democracy as \"convincing masses that the dog shit they're eating tastes like candy\".If you look at the societies with \"democracy\", there is always an unchanging regime that nobody voted for (eg. they call it deep state in US to make it sound like a conspiracy theory) and has full control of everything behind the scene and pulls all the strings.The most important part and parcel of democracy is the two sides that look like they are against each other (red and blue) and their purpose is to keep the the regime intact. It works like this: one side wins the election (eg. democrats) and takes a shit on the country (on economy, health care, pensions, etc.) and the other side (republicans) attract the support of the angry people by redirecting all the blame on the first side (democrats) instead of the regime itself. Then in the next election they win instead and take control of the country to do the same exact shit as the first party and this time the first party (democrats) blames those in office and attracts support creating an endless cycle until people rise up and start a regime change!In a democracy all types of freedom are also defined as whatever the regime likes. For example in \"liberal economy\" they tell you that you are free to do whatever you like with your capital but in reality it means you can do whatever the regime likes. Otherwise you can be Blackrock or MSCI and want to be free to take your capital to China and invest in their rapidly growing economy but since the regime doesn't like that they will prevents you and even takes you to court threatening to shut you down.We do not have that in Bitcoin, the \"constitution\" which is the consensus rules don't change and people don't vote on who enforces those rules periodically (like 4 years) and the power is not in the hands of a centralized entity.Although there are traces of the same brainwash seen in the community.QuoteBTC is kinda the same... you're free to transact as you wish (within BTC's mainnet rules) and there's an expectation of zero censorship.The problem with Western-type Democracy is that it's very easy to hijack it: you can flood it with illegal immigrants (see: USA/Europe) and nobody can do anything about it.BTC is kinda the same... you can flood the network with monkey jpegs and nobody can do anything about it, because there's this expectation of zero censorship.Trying to censor transactions feels like adopting totalitarian regimes' principles, even if it's for a good purpose (banning Ordinals/NFTs).This is the proof of what I said about brainwash!I don't know when and how a small portion of the community started referring to preventing exploit as censorship! What's worse is that we've been doing it for as long as Bitcoin existed. We've been preventing a lot of different ways people can easily spam the chain, there is a long list of the in standard rules, and yet this small number of people are excluding the most recent exploit Ordinals attack is using and refers to any effort at preventing it as \"censorship\"!!!Censorship is defined as preventing anyone from using this peer-to-peer cash system to send money to anyone they like. It is NOT defined as preventing people from abusing the system and exploiting the protocol to turn Bitcoin into a cloud storage.QuoteBack in May I had written a FB post about how in the future you will have to pay $1000* for an on-chain transaction. BTC mainnet will basically become a settlement network for banks. I disagree. I don't think this can ever happen (fees go up and remain up) because it would kill bitcoin and it will be replaced by something else that does not have the same problems (like being easy to be exploited by something like Ordinals and be attacked without the community lifting a finger to prevent it).Quotethis could also happen if BTC is worth millions of dollars one dayFees can always be adjusted and instead of 1 sat/vb being minimum we could have 1 sat/100vb being the minimum rate.QuoteCBDC will bring back the Gold standard. CBDC will be backed by BTC.CBDC will be centralized and be considered a shitcoin like Tether is in the decentralized community. Regardless of what it is backed by.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "December 10, 2023, 06:47:29 AM",
      "body": "QuoteCBDC will bring back the Gold standard. CBDC will be backed by BTC.How did you come up to this conclusion? Do you have any insider information from a central bank, that is willing to adopt BTC?CBDCs will be backed by nothing and no big central bank in the world will start buying BTC with the sole purpose of using it as a reserve asset.Western democracies are built around order and law, not around freedom. The only difference between democracies and dictatorships are that the governments elected by the people should also abide by the law, while the dictators are above the law.I can't say anything about your conspiracy theory regarding the Blackrock Bitcoin ETF and the ordinals clogging the blockchain and pumping the transaction fees up. I don't have any proof about this weird theory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 10, 2023, 06:58:17 AM",
      "body": "An interesting analogy that the OP mentioned is freedom, but I feel this way about freedom in the crypto space, where we think about our personal rights being unchecked but still not avoiding them being constrained by the legal corridor as Bitcoin increasingly develops. There will need to be separate regulations to link it with social life, or vice versa, society must take its course of action, and that will certainly cause conflicts.We all want freedom, even Western countries talk a lot about this idea, but the reality is that perfection is not realistic when people themselves have their own conflicts. Incidentally, when I first listened to the podcast again, it was about the economic system as well as the control of a country, perhaps ideally this is very compelling to aim for, but the way it works is still subject to limitations on cognitive bias.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 10, 2023, 07:00:37 AM",
      "body": "Thanks for raising these profound points, in fact I am of the opinion that both Bitcoin and Western-style democracy fail to provide true freedom.Both are similar in terms of wonderful theoretical principles that grant freedom, but on the ground there is no real freedom.Western countries that claim to enjoy liberal principles (freedom of movement, freedom of capital, etc.) exercise severe control over their citizens through banks and hidden central control and reject any system outside this central authoritarian system (which claims liberalism and calls for freedom), and for this reason they fight Bitcoin.As for Bitcoin, it has also unfortunately failed to grant true freedom and decentralization in a realistic manner because we were unable to get rid of the censorship imposed by a small group controlling the Bitcoin network, and we were also unable to get rid of the censorship imposed by governments on freedoms, and the greatest evidence of that is what is happening now in the forum after the decision to ban Mixers campaigns because they oppose government policy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 10, 2023, 08:21:32 AM",
      "body": "All the scenarios you put forward for Bitcoin scalability problem are far from the realistic scenario. It is true that Bitcoin transaction fees are currently high, but the blocks are almost full and confirmation times are instantaneous for large transactions. If you want to send $1,000 or more, Bitcoin fees are low (unless the number of inputs are Extremely large)There are many suggestions for solutions to this problem and for small transactions, in which case you may not have to pay a lot of fees, such as the lightning network and side networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 10, 2023, 08:36:00 AM",
      "body": "Any thing that becomes powerful will become an interest of the powerful people.Bitcoin became popular.  So it became an interest of the powerful and Wealthy.  I was hoping Bitcoin would not become what it is today but the more power it gains the less likely it will offer the same freedom it once did.See Micro Strategy.  Every body is cheering them for purchasing so many Bitcoin.  Currently Micro Strategy owns around 1 percent of the Bitcoin supply.  We cheer them for purchasing Bitcoin but we forget they are a business, Saylor is a businessman and one day this could turn into a catastrophe.  We were supposed to cheer for Decentralization.  Not for the Rich using Bitcoin as a tool to gain further power.They own 1 percent which is already a LOT.  Imagine how many other institutions and corporations are buying Bitcoin too.  If Bitcoin was meant to offer a refuge from the Rich and some sort of equilibrum between the Rich and the Poor.  Now Bitcoin is only another asset and method of the Wealthy to gain more wealth and for the Poor to become more Poor.This is unfortunate but I guess we have to accept our fate.  Bitcoin has changed like franky1 said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "December 10, 2023, 10:17:48 AM",
      "body": "Yes, Bitcoin and democracy both live on freedom and little or no censorship, but lets not make things too easy. The large number of \"monkey jpegs,\" which is a clever code word for small trades, is a problem, but it can be solved. Thats the same as saying democracy fails because of a few bad decisions about policy.Bitcoin's resilience is its core strength. Even though network overflow or BlackRock-style plots are possible, the fact that it is decentralized makes it hard to manipulate. Its not perfect, no; its a work in progress. As for the $1000 transaction fee scenario, its speculative, but it underscores the importance of solutions like Lightning Network, despite its flaws.And CBDCs backed by Bitcoin? Interesting, but lets face it: CBDCs are the exact opposite of what Bitcoin stands for: they are not controlled by a central authority. They're, frankly, trash. Bitcoin is the best at what it does because it is on the way to becoming the best answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "December 10, 2023, 10:21:09 AM",
      "body": "OP what do you think, is it ironic is it that the governments now who are most against Bitcoin and try to control Bitcoin are all Western-type Democracies? China banned Bitcoin yes but they didn't go try to hunt people down and seize their businesses etc.US and UK are actively chasing down Bitcoin users. Weird right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 10, 2023, 10:42:07 AM",
      "body": "I don't think we have any democracies that have zero censorship, surveillance, restrictions etc. Even strong Western democracies (and the USA isn't among them, it's usually classified as a flawed democracy) have their issues and restrictions (including quotas of immigrants they accept). If there's some censorship, it doesn't automatically mean that it's getting totalitarian. There's a very wide spectrum between a full democracy and a totalitarian regime.I'd support some restrictions on Bitcoin which are meant to protect it from crazy fee spikes like the one we're currently experiencing, as long as it's actually doable. Let's not forget that transaction fees jumped from time to time in the past, well before Ordinals and stuff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 10, 2023, 12:44:36 PM",
      "body": "I'm glad I got some pretty thoughtful responses.Disagreement is always welcome, as long as there's civil discourse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "December 10, 2023, 02:34:42 PM",
      "body": "If everyone who bought Bitcoin are understand with the purpose of Bitcoin was created, we can combat against the centralization. Unfortunately most people who have Bitcoin are don't care with that, they don't mind to use CEX to buy and hold their coins.As the government have a power and only the minority are against about the centralization, for sure we already lose before the war begin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}