{
  "id": "topic_5470655",
  "title": "NFTflow8545",
  "author": "NFTflow8545",
  "created_time": "October 17, 2023, 09:58:02 AM",
  "content": "Hi everyone from the past couple of days i found that meme coins are really trending and found many meme coins that had done 5x at least after the launch Further when i see the IDO i can only find the meme coins now a days So when i dig more i found a project name $OPIUM  https://opiumerc.com/If you guys missed SHiba , Doge , Pepe then don't miss $OPIUM 5X at launch for sure i am getting great vibes on this what you think check out: https://opiumerc.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470655",
  "comments": [
    {
      "author": "kizlod",
      "created_time": "October 17, 2023, 10:23:45 AM",
      "body": "I think that it's just another memecoinm like other hundreds of them. It has a chance to pump, but as with any memecoin it's a high risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "starkim",
      "created_time": "October 17, 2023, 10:34:45 AM",
      "body": "Memecoin is always high risk. But it could also be a high return. We recommend that you trade for small amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 18, 2023, 10:57:53 PM",
      "body": "Quote from: NFTflow8545 on October 17, 2023, 09:58:02 AM...So when i dig more i found a project name $OPIUM...As I understand it, you are a member of this team. You returned to the forum after 2 years of absence to promote this shit, the price of which dropped 10 times in one day after the launch. How much did you earn yourself from gullible newcomers who followed your advice to buy $OPIUM?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "October 19, 2023, 02:46:04 AM",
      "body": "Their motto is already a red flag. \"The Exclusive Gateway to your Financial Freedom.\" So are you saying that if we invest into this shitcoin, we will achieve financial freedom? I'm not a website developer, or at least an expert to it, but I can create that website even though I'm just a newbie. That's how awful the website is.As for the project as a whole, I already seen a newbie promoting this shitcoin already. Did both of you used OPIUM before posting it here? Kidding aside, to all newbies out there, avoid this project, and better look for those top projects already if you want to be safer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 19, 2023, 03:21:56 AM",
      "body": "Meme coins promote that they are a successful currency by claiming that they are the next alternative to Dogecoin or even SHiba, while these currencies are not successful, but rather were a trend at some point, otherwise they would move according to changes in the price of cryptocurrencies.Your attempt to say that this project is good because it is a Meme coin is meaningless, and without proving that it is something unique, it is its a coin will soon die like most projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}