{
  "id": "topic_5471530",
  "title": "alani123",
  "author": "alani123",
  "created_time": "October 25, 2023, 12:54:30 AM",
  "content": "Any achievement humanity has made, is due to our ability to record and pass down our progress, as well as recognize our mistakes. Likewise, by looking at bitcoin's history, we can learn to improve this technology that millions of people have come to be using. The famed \"blocksize debate\" that took place between 2015-2017 had a profound effect to the bitcoin community as well as bitcoin's future as a whole. So in this post a I'd like to make reference to some important proposals, as well as highlight the takes of several industry heads at the time. The point of contentionCirca 2014 bitcoin developers were caught between arguments on what methods should be used to address bitcoin's apparent lack of capacity for more transactions. Apparently bitcoin's 1MB hard limit for block size was for many considered a limiting factor on how much bitcoin could grow to accommodate a potential increase in demand to transact on bitcoin's blockchain. For that, different developers and groups came up with different solutions, most prominent of which will be mentioned below. Bitcoin scaling solutions proposed during the 2015-2017 block size debateFirst we have Bitcoin XT, proposed by Mike Hearn and Gavin Andresen: https://en.bitcoin.it/wiki/Bitcoin_XTThis was a bitcoin client that would lead to a hardfork if more than 75% of miners agreed to its proposals in the last 1000 blocks. The proposed solution to the scaling debate was to increase the block size to 8 MB, also doubling it every two years. Bitcoin Classic was another proposed hardfork. It was developed b Gavin Andresen and Jeff Garzik most famously among others. Classic's proposal was to hard fork to a 2MB block size limit, and by 2017 transition to a dynamic max_block_size. Segregated Witness is the solution that passed. It has essentially allowed for 4MB blocks without requiring a hard fork. It also opened up bitcoin functionality enough to make the Lightning Network concept viable for operation as well as allowing more advanced scripting. It's also worth noting that SegWit finally begun its implementation on mid 2017, way later than when the debate had reached its peak. Further solutionsThe following solutions are still being worked on to potentially be used on top of bitcoin alongside with SegWit. Sidechains are also worth a mention. Sidechains are the solution preferred by Adam Back, who has openly stated that he prefers sidechains as a scaling solution to Lightning transactions. He and his company Blockstream are currently developing the Liquid sidechain. The Lightning Network is perhaps the most talked about scaling solution for bitcoin, currently having a capacity over 5000 BTC which has kept being expanding fast over the last few years.  The concerns over big and dynamic blocks in 2015It's important to not forget what the talking points for each proposed solution were back when it was decision time. In early 2016, Jonas Schnelli, a full time bitcoin Core maintainer, was quoted stating the following against 2MB blocks. QuoteThere are consequences with 2-megabyte blocks. Chinese miners -- they are now [for] 2- megabyte blocks, but maybe it will turn out to be a problem for them . . . Every second really counts . . . When you mine a block that is no longer valid and you don’t get the information that a new block is here, you’re wasting lots of energy. If it’s just ten seconds you mine on the wrong block, you lose energy, and you lose coins in the end. That’s why, with Chinese miners [especially], every second counts, and [with] 2-megabyte [blocks], it’s twice the bandwidth you need.In this quote its easy to see how conservative bitcoin developers sought to be with the blockchain size, and how an increase in block size might severely affect the decentralization of bitcoin due to bandwidth constraints in many parts of the world. Contrary to the path projects like Ethereum have followed by having a full blockchain size in the terrabytes, bitcoin still chooses to form its network with full nodes. Users of bitcoin can still to this day download and easily synchronize the full blockchain therefore also contributing to decentralization. This lack of compromise is what has defined bitcoin through the years. What's currently going on with scaling solutions?The current state of affairs with bitcoin scaling solutions it that even after several years of development, we aren't sure if a scaling solution is ready to be put in place for widespread use. The Lightning Network's integrity was recently put in question by one of its core developers, shaking the project's very foundational principles and questioning if it would even be viable as a widely used scaling solution. We're left with sidechains, the decentralization and robustness of which hasn't really been studied widely. While sidechains are still in development, it's almost certain the compromises in trustlessness and decentralization will be far from what on-chain bitcoin transactions can offer. So it's questionable if a sidechain could fulfill bitcoin's promise for an electronic form of cash that would complete trustless transactions in a decentralized manner. Essentially the best talking point for sidechains up until now is that they bring more functionality on top of bitcoin, but probably this happens at the expense of other foundational principles. Is bitcoin ready for scale after SegWit?So far, with the existing demand on bitcoin transactions, SegWit has been contributed positively to containing the demand. As of writing this article BTC transactions are reaching record levels of cheapness at least for the last few years. However, one must think with a wider time scope when examining such issues. Taking into account the 2021 boom in demand for bitcoin transactions, it's obvious that there was a period when bitcoin transaction fees remained at high levels between 2020 and 2021.So really we see a fundamental issue that was constantly being brought up in 2015 at play here. When the crypto boom of 2021 happened, bitcoin's existing infrastructure wasn't exactly ready to welcome all the transactions from people that wanted to use the blockchain. While the transaction capacity didn't particularly need to be large in 2015, it would have been nice for infrastructure to be in place. This brings to mind the \"If you build it, they will come.\" principle that is often associated with infrastructure. Anything intended for widespread public use, must be future proofed. Building something for the masses requires the architect to be forward looking... And when demand in 2021 exploded, bitcoin's infrastructure wasn't there to sere everyone. Certainly back in 2021 having transactions cost $60 was a deterrent for many that would have wound up using alternative methods to transact value. And with on-chain transaction demand driving fees to levels like that as recently as 2021, it's certain that bitcoin's technology has yet to offer a solution for the masses to make cheap transactions on bitcoin. Be it sidechains or Lightning Network, we're just not there yet. Weaknesses of SegWit from the 2015-2017 scaling debate scopeHowever, looking back at things, it might have been easy to forget that back in the day, Chinese miners didn't exactly follow the sentiment of minimum bandwidth through and through. At some point in 2016, Antpool, who was the biggest pool and associated with the biggest miners back then, was signalling that they wouldn't support SegWit if it wasn't accompanied with a blocksize increase. So in hindsight, the authenticity of the bandwidth conservation argument that was so often cited against a block size increase in 2015 comes into question. Another thing worth mentioning in hindsight is that even SegWit pioneer Peter Todd later admitted that in the end it was a waste of resources to implement SegWit without a hardcoded blocksize increase coupled with it. Moreover, a detail many people miss is that Bitcoin XT was criticized by Adam Back for requiring a threshold of support of 75% to be implemented, calling it too low, while by 2019, more than two years after SegWit's activation, only an estimated 36% of bitcoin transactions were using it.'Trash' on the blockchain?Aside for high demand for transactions actually fulfilling bitcoin's intended purpose, transacting monetary value, on-chain scripting has allowed for recent trends like Ordinals and the so called BRC-20 tokens has been taking a lot of space in the bitcoin blockchain. Which combined with SegWit's 4MB block limit, makes up for a radical departure from the reasons why other solutions weren't adopted as a result of the blocksize debate.If we are to examine the considerations of bitcoin Core developers that were expressed during the 2015-2017 period, the bandwidth bitcoin would consume was a very serious concern. Even scaling to above 1MB was worrisome as seen by the quote mentioned above. However, SegWit took quire a radical departure from this principle. Even more so recently, bitcoin developers Luke Dash Jr, came out very much against certain developments like Ordinals and BRC-20 that SegWit has allowed for in bitcoin.ConclusionsThe blocksize debate set bitcoin's development back and made quite a few prominent scientists turn away from developing bitcoin (Namely and perhaps most notably Gavin Andresen, Jeff Garzik and Mike Hern). In the end it's hard to determine if much progress was achieved through all these years. It appears as though bitcoin's future was based on a vision of relying on external solution, that in the end aren't getting close to providing a reliable off-chain solution for fast and cheap transactions even after all this time. One might feel the need to ascribe hidden interests behind decisions that were taken. But the real valuable takeaways would be to recognize mistakes. Are we to believe that everything was done right in terms of scaling bitcoin? Were the aforementioned bitcoin developers that stopped contributing to the project after the debate was over just wrong on their proposals altogether? Should bitcoin perhaps make some radical changes now, better late than never? All these questions and more are worth seeking the answers to realize a better future for bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471530",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "October 25, 2023, 02:21:32 AM",
      "body": "Bigger blocksize will be non-sense if nobody uses it. Roger Ver and his scam team, made Bitcoin Cash, a scam fork from Bitcoin source code to scam investors.They said Bitcoin Cash is a real Bitcoin, focuses on Satoshi Nakamoto's vision. That coin has a better blockchain with bigger block size but 6 years after 2017 fork, that Bitcoin Cash blockchain is a dead chain if we compare it to Bitcoin blockchain.Comparison of two blockchains in their network hash rates.https://bitinfocharts.com/comparison/hashrate-btc-bch.html#alltimeBitcoin Cash is dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 25, 2023, 02:45:18 AM",
      "body": "Quote from: tbct_mt2 on October 25, 2023, 02:21:32 AMBigger blocksize will be non-sense if nobody uses it.But today it seems to be necessary at least that is what I think.Today's days there are over 40K pending transactions, most of them caused by the euphoria about the news around the bitcoin ETF of bitcoin. But those Transactions are going to be distributed in approximately 119 BlocksLets remember the news some month ago: Bitcoin mempool reaches 600K transactions .I think that some long run proposals at least should be taken into consideration.For example lets to said that more of the 50% of the volume of the transactions is moved to the Lightning Network, I think that at this point miners aren't going to be happy, for they it should be cheap stop mining and start Lightning nodes?I propose something like add 1MB per block each 8 halvings that is every 32 years Quoting some concerns about it:QuoteThere are consequences with 2-megabyte blocks. Chinese miners -- they are now [for] 2- megabyte blocks, but maybe it will turn out to be a problem for them . . . Every second really counts . . . When you mine a block that is no longer valid and you don’t get the information that a new block is here, you’re wasting lots of energy. If it’s just ten seconds you mine on the wrong block, you lose energy, and you lose coins in the end. That’s why, with Chinese miners [especially], every second counts, and [with] 2-megabyte [blocks], it’s twice the bandwidth you need.If in 32 years in the future send a extra megabyte is still a concern, i think that we should be disappointed of that future",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 25, 2023, 04:44:01 PM",
      "body": "you gotta laugh at their lame excuses for not allowing more transaction flow onchain per blockthe old \"2mb is bad\" yet they allow 4mb of junk meme images that have nothing to do with bitcoin payment flow.. and now say lets not stop the junk.. yet that same 4mb allowance has not caused a 4x of transaction flow. due to the cludgy way they implemented it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "October 25, 2023, 09:51:55 PM",
      "body": "Quote from: tbct_mt2 on October 25, 2023, 02:21:32 AMBigger blocksize will be non-sense if nobody uses it. Roger Ver and his scam team, made Bitcoin Cash, a scam fork from Bitcoin source code to scam investors.They said Bitcoin Cash is a real Bitcoin, focuses on Satoshi Nakamoto's vision. That coin has a better blockchain with bigger block size but 6 years after 2017 fork, that Bitcoin Cash blockchain is a dead chain if we compare it to Bitcoin blockchain.Comparison of two blockchains in their network hash rates.https://bitinfocharts.com/comparison/hashrate-btc-bch.html#alltimeBitcoin Cash is dead.I didn't make this post to say that bcash is good. I made this post so we can look back and maybe learn a thing or two. With even Peter Todd saying that it was a waste of resources to implement SegWit without a blocksize increase, maybe it's time to accept that at least to some degree there were mistakes that were made. How else are we going to improve? Cryptocurrency isn't a race to the bottom. If we somehow prove that is trash, that doesn't improve bitcoin... We have to be more practical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 27, 2023, 12:42:46 PM",
      "body": "I'm not going to engage into a block-size-war conversation, with taking sides in either camp, but I'm about to ask this; how come no hardforks succeeded? Let's assume that the hardforks SegWit2x, Bitcoin XT etc., were indeed superior blockchain implementations, how come nobody supports them currently?It appears to me that keeping the community together is what's invaluable for the community itself. Quote from: alani123 on October 25, 2023, 12:54:30 AMAnother thing worth mentioning in hindsight is that even SegWit pioneer Peter Todd later admitted that in the end it was a waste of resources to implement SegWit without a hardcoded blocksize increase coupled with it.Where exactly did he say that? The linked mail was sent by several developers, but not by Peter Todd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 27, 2023, 02:48:38 PMLast edit: October 27, 2023, 03:06:10 PM by franky1",
      "body": "Quote from: BlackHatCoiner on October 27, 2023, 12:42:46 PMI'm not going to engage into a block-size-war conversation, with taking sides in either camp, but I'm about to ask this; how come no hardforks succeeded? Let's assume that the hardforks SegWit2x, Bitcoin XT etc., were indeed superior blockchain implementations, how come nobody supports them currently?bitcoinXT was treated not as a bitcoin option. but as something that should be REKT and treated as an enemy. it gave core the ultimate power of single dev team ownership of protocol decision controlsegwits nov2016-june2017 never gained more then 45% because the community did not see personal benefit of actual tx discount(making legacy cheaper) nor a real up-count of transactions per block.. core thought community would just upgrade nodes to the newest and comply within 9 months due to the REKT's of any other brand out of the choice.  .. but people just didnt upgrade to newest core to flag compliance(it only required mining nodes to show compliance.. they declined)the segwit2x was a bait and switch. it was done by the same side of the NYA who just wanted segwit activated. the x2 base was never coded but a empty promise for \"later\". (it required economic(exchanges/merchants/services) to threaten to ignore pools who dont comply. forcing pools into compliance to stay engaged with services)the reason none of the bips of many ways to allow more transactions per block from 2015-2017 were methods that did not meet blockstreams(core) roadmap. and so with all the REKT's and mandatory drama. core solidified its authoritarianism to rule out any deviants to their plan.if you look at DCG (nya) portfolio. of blockstream, bloq you soon see all the options that were available and not smashed instantly in REKT drama all had the same people.. gavin and garzig(bloq) were funded by the same team of blockstream NYAso all the options were bait and switch options to get the end result they wanted.. segwit with not base block adjustmentanything that did involve code that would dynamic change, adjust or multiply the base blocksize. were REKT and treated as non bitcoin/enemies of bitcoin by sponsored trolls",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "October 27, 2023, 02:50:06 PM",
      "body": "Quote from: BlackHatCoiner on October 27, 2023, 12:42:46 PMQuote from: alani123 on October 25, 2023, 12:54:30 AMAnother thing worth mentioning in hindsight is that even SegWit pioneer Peter Todd later admitted that in the end it was a waste of resources to implement SegWit without a hardcoded blocksize increase coupled with it.Where exactly did he say that? The linked mail was sent by several developers, but not by Peter Todd. You are right, I think I meant to also link his commentsry but forgot. Here it is https://twitter.com/peterktodd/status/928308564208373761",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 27, 2023, 03:32:05 PMLast edit: October 27, 2023, 03:47:28 PM by BlackHatCoiner",
      "body": "Quote from: franky1 on October 27, 2023, 02:48:38 PMbitcoinXT was treated not as a bitcoin option. but as something that should be REKT and treated as an enemy. it gave core the ultimate power of single dev team ownership of protocol decision controlWhy? Didn't XT have its own developers and userbase? Why do you blame Core?Quote from: franky1 on October 27, 2023, 02:48:38 PMsegwits nov2016-june2017 never gained more then 45% because the community did not see personal benefit of actual tx discount(making legacy cheaper) nor a real up-count of transactions per block.. If it didn't gain the necessary recognition back then, how come everybody uses it nowadays? Has it ever crossed your mind that the benefit of \"making legacy cheaper\" could be outweighed by the risk of splitting the community in half?Quote from: alani123 on October 27, 2023, 02:50:06 PMYou are right, I think I meant to also link his commentsry but forgot. Here it is https://twitter.com/peterktodd/status/928308564208373761In that tweet, I understand that SegWit2x was wasteful, not Segwit. In this part of his sort of interview, he pretty much seems pro-Segwit: https://piped.video/watch?v=27Bp9ZU2KWw&t=530.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 27, 2023, 11:12:44 PM",
      "body": "Quote from: BlackHatCoiner on October 27, 2023, 03:32:05 PMQuote from: franky1 on October 27, 2023, 02:48:38 PMbitcoinXT was treated not as a bitcoin option. but as something that should be REKT and treated as an enemy. it gave core the ultimate power of single dev team ownership of protocol decision controlWhy? Didn't XT have its own developers and userbase? Why do you blame Core?dont play dumb you are fully aware of the term REKT campain. it has been told to you many times. do not play your forum-wifes game of selective amnesia every 3 monthsinstead of forgetting things every three months. just check your post history of the last few years to remind you of things been said to you beforeQuote from: BlackHatCoiner on October 27, 2023, 03:32:05 PMQuote from: franky1 on October 27, 2023, 02:48:38 PMsegwits nov2016-june2017 never gained more then 45% because the community did not see personal benefit of actual tx discount(making legacy cheaper) nor a real up-count of transactions per block.. If it didn't gain the necessary recognition back then, how come everybody uses it nowadays? Has it ever crossed your mind that the benefit of \"making legacy cheaper\" could be outweighed by the risk of splitting the community in half?the initial segwit consensus vote began as a november 2016 origin requiring super majority mass consent to activate.. YOU KNOW THIS DONT PLAY DUMBin june-july it never got above 45%. YOU KNOW THIS DONT PLAY DUMBit never reached above 45% becasue what core was offering was not what the community wanted.. so the sponsors of the core devs (DCG(NYA) via blockstream) then instigated the bait and switch via a mandatory activation by august.. YOU KNOW THIS DONT PLAY DUMBthe mandatory activation was a blackmail event to force mining pools to comply or have their blocks rejected by the economic nodes(cant spend rewards).. YOU KNOW THIS DONT PLAY DUMBit activated not due to community desire. but by threat and blackmail between mining pools and economic nodesit was also not requiring the super majority of user nodes to vote, due to the non-requirement of usernode to upgrade to be compliant, due to the \"backward compatibility\" trick to bypass needing network readiness of usernode to accept the new rules. YOU KNOW THIS DONT PLAY DUMBif a new feature that needed a hard fork had actual community benefit then usernodes, economic nodes and miningpools would review, accept the benefit and upgrade their nodes. they would not need threats and blackmail and bypass tricks to get something activatedif core actually offered things the mass community were begging for. core would not have had 2 years of fighting. core would not have needed to get their sponsors involved to push a few malicious campaigns. there would have been no 2015-2017 dramathe only reason there was drama is because the community wanted a onchain upgrade to allow more transactability onchain and cheaper fees onchain. however the core roadmap wanted to offer a tollbooth gateway to a subnetwork bridge as \"the solution\".. YOU KNOW THIS DONT PLAY DUMB",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 28, 2023, 03:40:48 AM",
      "body": "Quote from: franky1 on October 27, 2023, 11:12:44 PMYOU KNOW THIS DONT PLAY DUMBI wasn't aware that this topic generate such kind of debate... It is interesting to read youAnyway... i am interested in see what kind of proposal are apart of LN.Just to put some data on this, acording to this page: https://www.sciencedirect.com/science/article/abs/pii/S2214629621004813QuoteEstimates suggest that 106 million people (roughly 1.3% of the global population) have used bitcoin at least once [1]. Others suggest there are around 25 million 'active' cryptocurrency users [2].I don't know how much percentage of the population will use bitcoin in the future, also here is a graph of how population can grow according to some UN report:QuoteOn the low end, the UN estimates the year 2300 will see only 2.3 billion people walking the Earth, fewer than we saw in 1940.On the high end, it predicts 36 billion — five times the current size.But tucked in the middle is a number it forecasts will hold steady from approximately 2050 onward: 9 billion.The above graph show some 9 billion of population for the future but that is just a forecasts.Lets to said that only 10% of the population will use bitcoin in the future, that will be 900 Million of people, comparing it againts the current active number of users of the network is a HUGE GAP.Seriously the Bitcoin network need something NOW to scale it. On Chain or OFF chain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 28, 2023, 07:28:50 AM",
      "body": "i understand if we put bitcoin into context of fiat. bitcoin and fiat should not be limited to one payment app/method of spend. a dollar is not locked to only be spent as cheques. people can use wire transfer, visa-debit cards, store branded giftcards/loyalty cards, heck even store branded debit cards. but to just go with the argument \"cheques are dead, bank of americore visa credit is the only solution\" is not the answer. especially if everyone knows bank of americore visa has many flaws and bugs the managers admit they cant fixsaying that cheques should only also be bank of americore cheques and any other brand is an enemy is also bad precedent to by implyingthe most funniest of the REKT campaigns was certain group screaming how 2mb per block of valid transactional lean data would kill the networkand then later same group are saying 1mb base+3mb of junk space bloat filled with meme images unrelated to transactional data(4mb) is fine and we should not do anything to stop the nonsense junk bloat. nor should we reutilise the now acceptable 4mb to be fit for just lean transactional data to propel transactions per block average to be 4x the 2016 1mb limit.there are other subtle things they imply, such as bitcoin transactions are no longer (in their view) signed by the owner, but instead \"witnessed\" as being moved. where the evidence of proof is just a weight of evidence from a witness.. trying to make bitcoin seem less secure in its proofother things like trying to force people who have sole ownership of keys to instead use newer transaction formats by premiumising the cost of legacy transactions. where the new features are only beneficial if people deposit funds into multisig(more then one person control).these people are not interested in making bitcoin more useful for the many users wanting self control of wealth. they want to make bitcoin become a headache inducing network to make people avoid using it and pick their subnetwork that has middlemen fee's and require fund managers controling the flow of valueanywaysthese subnetworks that function via middlemen is how the sponsors of core devs 2014-19 want to earn returns on their investments. its why certain people are hyper promoting a certain subnetwork to the extreme and getting aggressive if anyone announces the flaws of the subnetwork in question. because they are paid to promote it and hope millions of users move over to the subnetwork and abandon daily use of the bitcoin networkit has become soo obsurd that they have even invented 'greenlight' and other hub/factory systems of account/channel management to centralise their subnetwork all so they can be the payment processors taking a fee. yet their favoured subnetwork still has not garnered the popularity it thought it would. some call it Eltoo solution.. i call it Elvis. everyone has heard of him but 99% have not experienced him personally i am not against subnetworks that fit a need and function securely.. much like im not against all the different fiat payment apps. but when their last 6 years has been headstrong driving down one roadmap direction of one flawed path. its time they build a new road, several roads, all offering different experiences(niches).. and we still need to expand the bitcoin network. and not just push people down these niche routes to avoid using the bitcoin networkas for statsdid you knowin 2022 avalanche had more liquidity in its 3 years of existance than LN had in its 5other bridges like WBTC have multiple amount of liquidity than LNi personally have other issues with those two too. but when certain people exaggerate LN's utility and popularity and yet dont take time to fix the flaws or learn from mistakes. LN becomes the worse example of subnetwork bridges trying to steal bitcoin fame while actually making bitcoin look worse",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 28, 2023, 10:48:11 AM",
      "body": "Quote from: tbct_mt2 on October 25, 2023, 02:21:32 AMBigger blocksize will be non-sense if nobody uses it. Roger Ver and his scam team, made Bitcoin Cash, a scam fork from Bitcoin source code to scam investors.The problem is that it is a temporary solution. When you get full, will you increase the mass again? We will come up with a model in which the block size is one gigabyte, which may eventually lead to the currency being centralized.Also, the developers did not put much effort into it. The development that happened to Bitcoin Cash was slow compared to Bitcoin, which all shows that easy solutions are useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "October 28, 2023, 11:53:06 AM",
      "body": "Quote from: alani123 on October 25, 2023, 12:54:30 AMSidechains are also worth a mention. Sidechains are the solution preferred by Adam Back, who has openly stated that he prefers sidechains as a scaling solution to Lightning transactions. He and his company Blockstream are currently developing the Liquid sidechain. Quote from: alani123 on October 25, 2023, 12:54:30 AMWe're left with sidechains, the decentralization and robustness of which hasn't really been studied widely. While sidechains are still in development, it's almost certain the compromises in trustlessness and decentralization will be far from what on-chain bitcoin transactions can offer. So it's questionable if a sidechain could fulfill bitcoin's promise for an electronic form of cash that would complete trustless transactions in a decentralized manner. Essentially the best talking point for sidechains up until now is that they bring more functionality on top of bitcoin, but probably this happens at the expense of other foundational principles. Those paragraph could give people false impression that Sidechain generally isn't ready to use, while in fact Sidechain is ready to use. There are already some exchange and wallet which support sidechain Liquid and RSK.Quote from: hugeblack on October 28, 2023, 10:48:11 AMQuote from: tbct_mt2 on October 25, 2023, 02:21:32 AMBigger blocksize will be non-sense if nobody uses it. Roger Ver and his scam team, made Bitcoin Cash, a scam fork from Bitcoin source code to scam investors.The problem is that it is a temporary solution. When you get full, will you increase the mass again? We will come up with a model in which the block size is one gigabyte, which may eventually lead to the currency being centralized.Also, the developers did not put much effort into it. The development that happened to Bitcoin Cash was slow compared to Bitcoin, which all shows that easy solutions are useless.That's why increasing block size should consider cost to build and run full node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 28, 2023, 12:46:34 PM",
      "body": "Quote from: ETFbitcoin on October 28, 2023, 11:53:06 AMThat's why increasing block size should consider cost to build and run full node.That argument flat out does not work anymore. Drive prices are falling fast, and that is unlikely to change.2TB SSD are well under $100 new. https://www.microcenter.com/product/665454/inland-platinum-2tb-ssd-3d-tlc-nand-sata-iii-6gb-s-25-internal-solid-state-drivehttps://www.amazon.com/Crucial-BX500-NAND-2-5-Inch-Internal/dp/B07YD5F561I have a stack of well used 1TB SSD with still over 95% life according to crystal disk info that I can't give away. For the cost of shipping and a bit of bubble wrap and an anti-static bag might as well get a new one.Spinning drives are just as bad...how about a 6TB for $60 https://www.amazon.com/MaxDigitalData-7200RPM-Internal-Surveillance-MD6000GSA12872DVR/dp/B097CYT437Looking at other parts of the world it's even worse. 2TB are even cheaper in India then the US and someone I know in Egypt is getting 2 gen out new old stock Samsungs (the 850 line and still plenty fast) for a lot less then used here.The cost of the rest of the system is the rest of the cost of the system. Should not change much.The IBD and ongoing bandwidth, might be an argument, but even a 4x increase in size you are still around 2TB. Which is a lot but not undoable.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "She shining",
      "created_time": "October 28, 2023, 01:39:52 PM",
      "body": "Scalability has been a big issue for Bitcoin in recent times and with how the community is divided into various school of thought, I don't really see a consensus in the short term. Every ideas brought up offer an answer to the problem but with diverse weaknesses. There's no perfect solution, all available solution requires a compromise and many don't want toSide chains require validators which is against the permissionless and trustless ethos of Bitcoin.Block size increment would increase scalability and transaction fees which is a benefit to everyday user but not to miners since it becomes a situation of lots of sellers and few buyers and the cheapest Trx wins. Besides an increase would create a fork.The battle on scalability has been ongoing for years and no side have been able to convince the other.QuoteAnyway... i am interested in see what kind of proposal are apart of LN. Sharding? I came across it sometime ago and read that ethereum are working on their very own sharding technique. Like other solution to Bitcoin scalability it is limited by its flaws maybe it would be better if it could be implemented off chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 28, 2023, 01:40:05 PM",
      "body": "Quote from: franky1 on October 27, 2023, 11:12:44 PMif a new feature that needed a hard fork had actual community benefit then usernodes, economic nodes and miningpools would review, accept the benefit and upgrade their nodes. they would not need threats and blackmail and bypass tricks to get something activatedNo matter how much you yell about this, if you can't provide a single example of a threat, then you don't make a point.Quote from: franky1 on October 27, 2023, 11:12:44 PMif core actually offered things the mass community were begging for.Core is not writing code in the name of \"mass community\", whatever the hell that means. If you don't like how Core operates, then you've got to take advantage of Bitcoin's nature being released under an MIT license, and attempt to cover the aforementioned issues. But, to turn your question in the other way around: \"If Bitcoin hardforks actually offered things the mass community were beggining for\", then... I presume we'd be using them? Somehow we don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 28, 2023, 03:40:58 PMLast edit: October 28, 2023, 03:53:45 PM by franky1",
      "body": "again to answer your question and break through your amnesia, (the tool you use so you can stay happily married to your insane forum-wifes beliefs)with core being the CORE implementation/reference client/ authoritarian brand.. other dev teams get REKT even before they have a chance to allow users a client they can download and populate the network.(there are proof of REKTS, dont play dumb)when non-core implimentations that offer protocol level fork options. those clients are treated not as bitcoin clients, but opposition/enemy/altcoin clients.(there are proof of REKTS, dont play dumb)the only time hard forks do happen in recent decade(such as the mandatory hardfork done by blackmailing pools to upgrade or be kicked off the network) are done now by core and only core. (there is literally code and block bit flagging signal proofs of this, dont play dumb)each time there is a mandatory deadline for mining pools to comply and upgrade or be ignored by the economic nodes(thrown off network) is a hardfork. the threat causes a UNNATURAL 100% compliance super majority.EMPHASIS: UNNATURAL(there is literally code and block bit flagging signal proofs of this, dont play dumb)and if you want to pretend these conversations have never happened or pretend there is no proof .. please check your post history, and stop asking for me to blast you all over again with the proof just for you to ignore all over again.. emphasis the graph of the blue red lines of how the activations occured to an unnatural 100% diagonal+straight line (you know exactly what i am referring to: dont play dumb)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 28, 2023, 03:52:18 PM",
      "body": "Quote from: franky1 on October 28, 2023, 03:40:58 PMwith core being the CORE implementation/reference client/ authoritarian brand.. other dev teams get REKT even before they have a chance to allow users a client they can download and populate the network.Most people run Bitcoin Core, no doubt about that. But, Bitcoin Core is merely a client. When another client connects to the Bitcoin network, given that it follows the same consensus rules, will be treated equally. However, it seems quite reasonable to metaphorically \"get rekt\" by the Core community if they decide to enforce something that contradicts Core's beliefs about how the system should operate. To avoid speaking in theoretical terms, could you direct me to a client that has implemented a policy contrary to Core's? Excluding hardforks for obvious reasons.Quote from: franky1 on October 28, 2023, 03:40:58 PMthe only time hard forks do happen in recent decade(such as the mandatory hardfork done by blackmailing pools to upgrade or be kicked off the network) are done now by core and only core. There has never been a single hardfork in Bitcoin's history supported by Core. To which are you referring to?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 28, 2023, 03:55:18 PM",
      "body": "Quote from: BlackHatCoiner on October 28, 2023, 03:52:18 PMQuote from: franky1 on October 28, 2023, 03:40:58 PMwith core being the CORE implementation/reference client/ authoritarian brand.. other dev teams get REKT even before they have a chance to allow users a client they can download and populate the network.Most people run Bitcoin Core, no doubt about that. But, Bitcoin Core is merely a client. When another client connects to the Bitcoin network, given that it follows the same consensus rules, will be treated equally. it FOLLOWSim talking about and this topic is talking about implementation clients that offer a proposal for a change of the protocol... and its these protocol proposition changes that are treated unfairly and as the enemyonly clients that FOLLOW core and just allow core to make the decisions are not given grief",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}