{
  "id": "topic_5403398",
  "title": "SVirusu",
  "author": "SVirusu",
  "created_time": "June 20, 2022, 09:04:20 PM",
  "content": "Son zamanlarda spekülasyonlar artmaya başladı kömür fiyatlarından haberiniz var mı ? Dolar bazında 1 yılda 8 kat arttı ton fiyatı 45 dolardan 400 dolara çıktı. Ortada gariplikler dolanıyor. Bugünde Amerika'da Kansas eylatinde kömür taşıyan tren kaza yaptı. Birileri yine birşeyler peşinde. Dünya iyi yerlere gitmiyor.  Emtialarda son zamanlarda büyük spekulasyon dönüyor. Birileri açık pozisyonlar aldığı kesin peki neler olacak bunu anlamaya çalışalım.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403398",
  "comments": [
    {
      "author": "Red Pie",
      "created_time": "June 21, 2022, 05:50:12 PM",
      "body": "Kömür fiyatlarıyla birlikte artık bir mangal keyfimiz vardı onun bile tadı kaçtı. tavuk eti bile kilosu 50 liradan az değil, bir de kömür, pidesi vs 4 kişi mangala gittiğinizde bayağı tuzlu oluyor. bir de ısınma için kullanan insanlar var. hala doğalgaz olmayan şehirlerde kömürle ısınma oluyor, aylık 2-2500 lira sadece kömür parasına denk gelen iklimi soğuk olan yerler var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "June 22, 2022, 06:24:02 PM",
      "body": "Benim memleketimde doğal gaz yok, evler eski tip kalorifer ile ısınıyor. Yani kaloriferin içinde dolaşan sıcak su için kalorifer kazanı yanıyor ve onun için kömür kullanılıyor. Ülkenin bir çok yerinde kömür madeni var ve kömür çıkarılmasına rağmen son zamanlarda artan kömür fiyatları yüzünden memleketten kim ile görüşsem kışın ısınma ile ilgili büyük problem yaşanıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "June 29, 2022, 11:08:25 AM",
      "body": "Doğalgaz, petrol fiyatları arttı. Kömür de artar. Altın fiyatı artınca gümüş fiyatı da artar. Demir fiyatı da artar. Emtia fiyatlarının hepsi artar. Kriptoparalarda Metaverse coinlerden MANA artınca geri kalan Metaverse coinlerin de fiyatı artar. Spekülasyon mu bilmem. Doğalgaz, petrol fiyatları artınca kömürün fiyatının artması normal bana göre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "June 29, 2022, 04:17:50 PM",
      "body": "Quote from: Ondekinecakabilirim on June 29, 2022, 11:08:25 AMDoğalgaz, petrol fiyatları arttı. Kömür de artar. Altın fiyatı artınca gümüş fiyatı da artar. Demir fiyatı da artar. Emtia fiyatlarının hepsi artar. Kriptoparalarda Metaverse coinlerden MANA artınca geri kalan Metaverse coinlerin de fiyatı artar. Spekülasyon mu bilmem. Doğalgaz, petrol fiyatları artınca kömürün fiyatının artması normal bana göre.Kömür zaten arttı. Nargile için istediğimiz kömürlerin kilogramı toptan halinde 80 lirayı buldu. Biz 20-30 liradan aldığımız zamanları biliyoruz ve bu geçen seneydi. Bir senede 3 kat artış yaşadı. Bu bizim için düşük ama şöyle kömürle ısınan az gücü olan vatandaşları düşününce artık kömür bile yakamayacaklar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "June 29, 2022, 05:03:02 PM",
      "body": "Quote from: Retro Harmony on June 29, 2022, 04:17:50 PMQuote from: Ondekinecakabilirim on June 29, 2022, 11:08:25 AMDoğalgaz, petrol fiyatları arttı. Kömür de artar. Altın fiyatı artınca gümüş fiyatı da artar. Demir fiyatı da artar. Emtia fiyatlarının hepsi artar. Kriptoparalarda Metaverse coinlerden MANA artınca geri kalan Metaverse coinlerin de fiyatı artar. Spekülasyon mu bilmem. Doğalgaz, petrol fiyatları artınca kömürün fiyatının artması normal bana göre.Kömür zaten arttı. Nargile için istediğimiz kömürlerin kilogramı toptan halinde 80 lirayı buldu. Biz 20-30 liradan aldığımız zamanları biliyoruz ve bu geçen seneydi. Bir senede 3 kat artış yaşadı. Bu bizim için düşük ama şöyle kömürle ısınan az gücü olan vatandaşları düşününce artık kömür bile yakamayacaklar.Kışın doğalgaz olmayan hala onlarca belki yüzlerce ilçe var. soğuk ilçeler oldukları için herhalde kömür daha iyi ısıtıyordur diye ondan devam ediyorlar ama o da çok pahalıya geliyor. kömür fiyatlarını bir çok kişi soğuk şehirde yaşayanlar daha iyi bilirler dolar bazlı alınır. dolar arttığı için zaten zamlı bir de kömüre zam verdiler daha da zamlandı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}