{
  "id": "topic_5445463",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "March 19, 2023, 06:23:17 AM",
  "content": "Do you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soon",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445463",
  "comments": [
    {
      "author": "gunhell16",
      "created_time": "March 19, 2023, 08:30:41 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soonBitcoin broke that 27k$ each last night. Then it went down a bit again to 26800+ one, now I'm kind of waiting to buy it again somehow, because we don't know and it can happen, you know that crypto is volatile.So right now, I don't think about the price of bitcoin because the only thing on my mind is to accumulate until it does, at least when the bull run comes I'm sure I have it and I'm ready.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 19, 2023, 08:43:43 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up.I am not sure what is your belief from?Do you think this year is a bullish year or still a bearish year? Is the market still be bearish? I can not answer it for you because I don't want to be responsible for your profit or loss. You're responsible for it and I don't make financial advice here but you can find answers by Bitcoin historic price.I believe it is still in accumulation phase of a bear market.https://cryptorank.io/price/bitcoinYearly candlesIn history, there is no two continuous years with red candles so perhaps 2023 will be green candle. However how high it will end compares to its opening price in 2023 is a myth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "March 19, 2023, 08:46:30 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soonYesterday, Bitcoins were up to 27,800 USD, so yes, we can claim that we are in a pre-bull market era. If everything remains the same and bitcoins rise at the same pace, then definitely by the end of September we can see a new all-time high price. Bitcoins are known for repeating history and following the trend. Bitcoins follow a 4-year cycle to pump, and this year it has been meant for Bitcoins to rise only. I am expecting a positive attitude from bitcoins this year. So let’s hope for the best and buy as many bitcoins as you can at this low price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "March 19, 2023, 08:50:13 AM",
      "body": "According to the past history, this year should be a recovery price where Bitcoin price will not pump a lot and hit new ATH, but the price will just staying above than the lowest price of the last 4 year super cycle. I think this year Bitcoin price will not change a lot, maximum will be around $40K, but I speculate the price will just staying at $30K.The bull run might happen in the next year or two years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoonOfLife",
      "created_time": "March 19, 2023, 09:04:04 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soonAll you can do is hope bitcoin continues to bring you profits and plan for the worst case scenario because bitcoin is unpredictable. No one can answer your questions, don't ask those stupid questions, if someone knows the future, they have become rich and don't have time to answer your questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "March 19, 2023, 09:14:24 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soonNo one really knows where the price will be, good to see the price going to $27k, but the question is will it maintain on that level?For those who buy when it was at lowest in November, then yeah, it could be profits already, but I guess it's better to just really HODL till the next bull run. We haven't touch the bull run yet as we have to wait for the block halving. So don't celebrate this kind of price increase as there are bigger and massive runs when we get to May-> onwards 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "March 19, 2023, 09:17:54 AM",
      "body": "One thing I have learned about bitcoin is that, regardless of how speculative people are or whether it is backed up by technical or fundamental analysis, bitcoin really is unpredictable. And this thing is, without a doubt, a rollercoaster ride.Personally, I believe the only thing we can do is observe what is currently happening and decide for ourselves what is likely to happen. There are rumors that aside from SVB going bankrupt, 186 other banks have the same vulnerabilities found in SVB[1]. Additionally, there is hardly any news about bitcoin being banned in other countries, which might imply that people are slowly accepting what bitcoin actually is. Plus, even the FED is hyperinflating the dollar[2].However, even if all of these rumors are true and could be clear signs of a bullish market, there is still no guarantee that it will happen.[1] https://watcher.guru/news/186-banks-found-to-have-similar-risks-as-silicon-valley-bank[2] https://twitter.com/balajis/status/1636822077775941633?s=20But hey, that's just me!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "March 19, 2023, 09:19:20 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soonI for sure know one thing that bitcoin has a bright future as a Crypto currency which doubles as a digital gold but however, bitcoin is still test running and getting set for the bull run. I really do not cast my hope on prediction  and analysis by the so called analyst and experts who claims to have being in the Crypto world for long. I do my things based on my follow up live with the market trend. I have no time sparing any opportunities to collect my profit as per trading. One thing we all should know is that the bitcoin market is very volatile and at any given time it could be positive or negative within seconds. What I do tell my friends is that collect profit from your investment as soon as you see it going towards the right direction in your favor.From all indications, bitcoin might likely go beyond $30000 this  coming week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "March 19, 2023, 10:06:05 AM",
      "body": "Is already touched $27,500 before going back $26,000 and then back to $27k again, I know too well that is taking another bold steps to conquer 29 and 30 before ending of this month.Then for those who bought at $23k is really good chance for them to Take Profit (TP) and then set their Stop Lost (SL) although sometimes traders are being skeptical at this point if they will exit from trading and just hold because then when was very active in trading whenever I noticed something like this I do exit and just hold to see the final movement of that day or week per say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypticj",
      "created_time": "March 19, 2023, 10:09:49 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMI believe this is good sign that bitcoin will pump this year.I recommend you not to make quick assumptions on what will happen to the market next after a relatively small pump. It sounds like wishful thinking.I already talked about it in my posts, but if you want to know what will happen to bitcoin this year you should watch how the economy looks right now. And pay attention to what is happening in the US with inflation and interesting rates, it plays a huge role in what will happen to the market next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "March 19, 2023, 10:18:06 AM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soonThis last month I've see that the bitcoin from $22k to $27k is a huge jump so you can say that its a bullish era. But we can't guarantee that it might pump in a next few months, however if the economic situation worsen it might affect the price of the bitcoin surely it will pump. So once that happen I'll surely take some profit before the bull run stop and will buy again once the dump situation. Good thing I bought some bitcoin when it's value is at $22k gained some little profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OpenCEX",
      "created_time": "March 19, 2023, 10:33:06 AM",
      "body": "On Saturday, BTC was trading with a strong bullish bias and was encountering immediate resistance near the $27,750 level. Should there be a bullish breakout above the $27,750 level, it could propel the BTC price toward the $30,750 milestone.However, if it fails to surpass the $27,750 level, a sell-off may occur, potentially pushing the price down to $25,200 or even $23,020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "March 19, 2023, 10:36:51 AM",
      "body": "The good thing about the recent increase in the price is the hope of the holders will be refreshed and they won't gonna have any second thoughts now on selling their BTC rather they will just wait for the price to further increase in the next months to come. Others that do not yet have their bitcoins can still buy right now because this is might be their last chance to see a price below $30k and after that, we will surely going to witness more price rises this year until it reaches $50k+ again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "March 19, 2023, 12:01:52 PM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMDo you see the recent increase bitcoin has come up with. I believe this is good sign that bitcoin will pump this year, we are still in the third month, looking at the middle of the year, something will surely bulls up. When I open my wallet I was surprise of the price from $23000 to $26000 that's cool for those who buys recently.What did you think about the price? Will it pump soonFind it interesting but nothing special with the pump as it normally happens in a volatile market. However, we couldn't just simply think that it all goes high and we don't have to rejoice too much because a dump will also happen after this pump. Indeed, we look forward to more price rallies in the coming days but I will say that Bullrun won't come out this year. I say this because based on my experience and in the past bull season, it comes every 4 year cycle and we are still in the 2nd year after 2021 ATH which means that we still need to wait more than a year from now before to see it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "March 19, 2023, 12:46:20 PM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AM...What did you think about the price? Will it pump soonOverall, bitcoin's growth since the start of the year has been very good, and it is worth expecting a more robust recovery in the coming months. But we also know bitcoin is highly volatile and unpredictable, it can increase 50% in 1 month but can also drop more than 50% in a short time. Optimism and expectations are what we should have, but we still need to have backup scenarios if things don't go as expected. Don't forget the economy is still very difficult, the halving is more than 1 year away, so don't be too subjective at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "March 19, 2023, 04:05:58 PM",
      "body": "The little spike in price doesn't mean the bear market is finally over. There's no need for high hopes now, investors are watching attentively, what I think is that Bitcoin may possibly reach $30k before the month ends, but we may not even see $50,000 before the end of the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "March 19, 2023, 04:37:47 PM",
      "body": "The price will surely pump up sooner or later so you better be prepared and decide what price you want to set to sell bitcoins. Many of us want to sell bitcoin at the highest price after the last ATH, which means higher than $60k. The highest price exceeding the last ATH is possible, considering the upcoming halving will reduce the reward for miners, the price may increase beyond the last ATH.But you must also be prepared to accept that bitcoin prices will fluctuate more than before. But you don't need to worry because the price of bitcoin will increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "March 19, 2023, 06:07:18 PM",
      "body": "Now almost everyone is paying attention since bitcoin has increased since the bear market where bitcoin was under 20k for a while. There has been much speculation that this will be the start of a bull market. I myself am not going to speculate too quickly like this, because we haven't really gotten out of a bear market where prices could have returned to the lowest price. I'm not pessimistic, but I learned from what happened. You don't need to go far, when bitcoin touched 25k for example, and recently returned to 19k, didn't that make some people panic again?  indeed I will not be hypocritical to want to see bitcoin fly, but I also have to see how long it takes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "March 19, 2023, 08:42:28 PM",
      "body": "Quote from: Godlovesyou on March 19, 2023, 06:23:17 AMWhat did you think about the price? Will it pump soonPump soon? maybe, but anything can still happen. We could see the market drop a bit and fluctuate on its ways to the top, but it is not something we should be panicking about at this point when we have experienced more than predicted in the previous months. Because these few weeks have been good for bitcoin, a good year is expected, it is now more important to stay disciplined and committed to increasing the bitcoins you have and keeping safe what you already have because at this rate, by the end of this year, bitcoin may likely increase more than we could have predicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}