{
  "id": "topic_5434768",
  "title": "Question:",
  "author": "SeeBiscuit",
  "created_time": "January 15, 2023, 01:44:47 AMLast edit: May 08, 2024, 07:06:37 AM by SeeBiscuit",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434768",
  "comments": [
    {
      "author": "UchihaSarada",
      "created_time": "February 17, 2023, 03:18:49 AM",
      "body": "Quote from: SeeBiscuit on January 15, 2023, 01:44:47 AMDO. NOT. CLICK. ON. ANY. LINKS. THAT. APPEAR. ON. NFT'S. THAT. GET. AIRDROPPED. TO. YOUR. WALLET. FOR. NO. DAMN. REASON.They will lead you to a website that will ask you to connect your wallet and approve a transaction that takes all your NFT's and other tokens. The website's look good because they were made by the ugliest rats who are the best at their job. We got our first Saga pass stolen this way during all of this on January 5th. We know most of you on here don't mess around with other ecosystems, for reasons just like this, and that is totally fine. Discussion about that is healthy, but we also must recognize the importance of eating glass and moving on. Always make sure to follow the correct Twitter trails and verify, verify, verify. Thank you.If anybody did click on those links to approve smart contract allowance, use https://app.unrekt.net/ to revoke access.Smart contract interactions, risk and liabilitiesAfter doing this, it is more important to transfer your coins, tokens to another new wallet. Move all your fund to another wallet, don't let it in that old wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "February 18, 2023, 09:57:32 PM",
      "body": "First of all I welcome you to the forum. The artistic works are really entertaining the eyes of the viewers. They are all fantastic. I voted for Fate because in my thinking I know that the future of the project is bright and with that fate which has a good fortune is the best name suitable to the project. I comment BONKz#777 The L.U.C.K Project for coming to the forum for more expansion and definitely it expand because the forum participants will give the maximum awareness in all ramifications. I have been looking for the main website of the project but I couldn't get any but the rabbit hole site is very nice https://thefracture.io/. I will check you out on the Twitter handle. I like he warning you dropped here so nobody will say you didn't warn them. That is clicking those links is at owners risk. I will also like to see the website of the project if there is any.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unbunplease",
      "created_time": "February 18, 2023, 10:49:25 PM",
      "body": "In my opinion, the name of Unrevealed BONKz #7777 should be Pleiade. First, it means the support of higher powers (nymphs from Greek mythology). Second, pleiade is a creative union of people. A group of people is generally considered to be illustrious or remarkable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LowRezStudios",
      "created_time": "February 20, 2023, 03:35:01 AMLast edit: February 27, 2023, 09:28:37 PM by LowRezStudios",
      "body": "Quote from: Unbunplease on February 18, 2023, 10:49:25 PMIn my opinion, the name of Unrevealed BONKz #7777 should be Pleiade. First, it means the support of higher powers (nymphs from Greek mythology). Second, pleiade is a creative union of people. A group of people is generally considered to be illustrious or remarkableWow!What an amazing rationale for your pick! Keep on the lookout for more art.Furthermore, the Solana artist community is BOOMING with activity and the destruction of FUD is everywhere. True warriors and a true group of digital artists.@Mate2237, Thank you so much for the warm welcome, it means the world to us!Edit: Hey, @Unbunplease, thank you so much for that merit!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}