{
  "id": "topic_5451159",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "May 03, 2023, 09:22:29 PMLast edit: March 16, 2025, 09:08:04 PM by zasad@",
  "content": "WWW.TALKIMG.COMПредставляю новый сервис хостинга изображений, специально разработанный для BitcoinTalk и всего сообщества.Через несколько лет после того, как мы заметили, как много изображений неправильно отображаются на форуме или загружаются очень медленно, не говоря уже об изображениях, которые перестают появляться через несколько месяцев или лет, появился проект TalkImg.  Цель  ____________________Предоставлять услуги хостинга, для форума BitcoinTalk, полезные и практичные для всех.Предполагается, что изображения остаются доступными на форуме и имеют быструю загрузку. Особенности ____________________-Все загруженные изображения могут использоваться только на форуме (если только это не запрошено пользователем; это можно сделать после разрешения joker_josue).-Разрешается загружать изображения только в форматах, принятых форумом (JPG, JPEG, PNG, GIF).-Изображения должны иметь максимальный размер 2,5 МБ.-После загрузки изображения нельзя удалить (если только вы не используете ссылку, сгенерированную во время загрузки, которая доступна только в это время).-NSFW-изображения не допускаются.-Регистрация информации о пользователе не производится (сохраняется только IP-адрес для контроля спама).-Вся EXIF-информация удаляется системой при загрузке.-Возможность в коде встраивать BBCode уже с фактической высотой и шириной изображения (просто выберите «BBCode full fix HxW»).- new Загружайте по ссылке, применяя те же правила загрузки файлов. (Временно приостановлено) Долгосрочная перспектива  __________________У меня есть несколько лет опыта работы с онлайн-галереями, и, основываясь на этом опыте, я надеюсь сохранить этот проект онлайн как можно дольше. Конечно, мы не можем предсказать будущее, но что от меня зависит, этот проект будет поддерживаться еще много-много лет. Сервер  _____________________Сервер, выделенный для TalkImg, расположен в Нидерландах и состоит из дисков NVMe SSD, гарантирующих наилучшую скорость чтения/записи. Он использует программное обеспечение для веб-сервера LiteSpeed, которое гарантирует лучшую производительность. Оснащен процессорами AMD EPYC, поэтому вся информация обрабатывается как можно быстрее. Эта услуга уже гарантирована на ближайшие годы с возможностью расширения по мере необходимости. Учетная запись ____________________Эта услуга предназначена для эксклюзивного использования на BitcoinTalk, только пользователи форума могут иметь учетную запись на TalkImg, по этой причине опция создания учетной записи неактивна для всех желающих. Пользователи, которые хотят иметь учетную запись, должны связаться с joker_josue через PM, чтобы запросить ее. Запрос будет рассмотрен, и в случае одобрения будет создана учетная запись.   Резервные копии ____________________- Сервер автоматически выполняет ежедневное резервное копирование, которое будет храниться до 30 дней.- Еженедельно создается ZIP-архив со всеми новыми загрузками изображений за последнюю неделю, который будет доступен для загрузки в течение 15 дней здесь: talkimg.com/tempbackups/новый ZIP Tool _________________Вспомогательный инструмент, позволяющий архивировать изображения размером более 2,5 МБ. Сжатие выполняется с помощью функций PHP, что может значительно снизить качество изображения. Изображение автоматически загружается, преобразуется и отправляется в TalkImg, предоставляя ссылку/BBCode для использования на форуме. Этот инструмент все еще находится в стадии бета-тестирования, и могут быть ошибки.Доступ по ссылке: Image Zip Tool - TalkImgnew Статистика ________________Общие статистические данные с момента запуска проекта (28 апреля 2023 г.):                                                                      Изображений: 172 970Место на диске: 51.4GBПоследнее обновление: 15/03/2025Ежемесячная статистика:[First 15 days][May'23][Jun'23][Jul'23][Aug'23][Sep'23][Oct'23][Nov'23][Dec'23][Jan'24][Feb'24][Mar'24][First Year][Apr'24][May'24][Jun'24][Jul'24][Ago'24][Sep'24][Oct'24][Nov'24][Dec'24][Jan'25][Feb'25] Донаты и реклама  ______________Проект должен поддерживаться за счет пожертвований сообщества и рекламы, аналогичной подписным кампаниям на форуме.- Донаты: Все желающие поддержать этот проект могут сделать пожертвование в биткойнах на адрес: bc1qhwnncpdd8gfzqwjkk9n052wf7g9mvks3xaa7qa или Lightning-адрес: talkimg@wallets.fyoumoneypod.com- Реклама: На главной странице будет только одно объявление, похожее на то, что мы наблюдаем сегодня в подписях пользователей. Если менеджер кампании хочет разместить рекламу на TalkImg, свяжитесь с joker_josue. Скоро  ________________- Автоматическая система конвертации файлов. (нет запланированной даты)- Возможность определить размер (высоту или ширину) изображения в BBCode. (нет запланированной даты) Подробнее _________________Сайтом управляет joker_josue , который будет поддерживать его и оказывать полную поддержку пользователям.Я жду вашего мнения и предложений; эта услуга была создана для сообщества и для лучшего обслуживания сообщества.Предполагается, что этот проект будет существовать как можно дольше, независимо от того, получит ли он большое признание или нет. Поэтому все загруженные изображения доступны навсегда. Ссылки, скрипты и дополнения    _______TalkImgУсловия предоставления услугПолитика конфиденциальностиnew Статус работы сервиса TalkImgnew Image Zip Tool - TalkImgПодпись для продвижения TalkImg###[Add-on] Добавьте кнопку для загрузки изображения прямо с форума - Автор TryNinja[Script] Imgur to TalkImg - автоматическое исправление поврежденных изображений - Автор TryNinjaЕсли вы разработаете скрипт или дополнение, которое станет общедоступным, дайте мне знать, чтобы я обновил список.new События  ___________________TalkImg Awards - Image of the Year 2023 | спонсор BC.Game / Icarus Локальные форумы _________________Эта тема единственная, которая будет поддерживать пользователей TalkImg, и всегда будет иметь официальную информацию о проекте. Это список тем, переведенных на локальных форумах:العربية (Arabic) Kavelj22Bahasa Indonesia (Indonesian) dansus021Bengali roksana.heeDeutsch (German) cyganEspañol (Spanish)  PorfiriiHrvatski (Croatian) ovcijisirNigeria (Naija)  ChilwellPakistan (Urdu) JunaidAziziPilipinas PeanutswarPolski cyganPortuguês (Portuguese) joker_josueRomână (Romanian) GazetaBitcoinTürkçe (Turkish) mindrustОригинал:    https://bitcointalk.org/index.php?topic=5450546Перевод выполнен от первого лица при поддержке",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451159",
  "comments": [
    {
      "author": "~DefaultTrust",
      "created_time": "May 04, 2023, 07:40:35 PM",
      "body": "QuoteВсе загруженные изображения можно использовать только на этом форумеА что мне будет, если я буду использовать изображение в другом месте?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "May 04, 2023, 07:57:08 PM",
      "body": "Спасибо за информацию о проекте! joker_josue - известный и уважаемый член сообщества форума BitcoinTalk.Подобный сервис конечно очень нужен, причём для ежедневного использования - то есть сам проект очень актуален.Есть вопросы по анонимности и конфиденциальности в процессе использования этого сервиса - можно ли на него свободно заходить под VPN, или может там есть ограничения для резидентов каких-либо стран?Нужно ли указывать какие-то данные о себе . Может только электронная почта (как в некоторых аналогичных сервисах)? Для пользователей форума думаю вопросы конфиденциальности и анонимности имеют большое значения.Может есть какие-то рекомендации по использованию нового сервиса с учётом этих моментов?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 04, 2023, 09:27:07 PM",
      "body": "Quote from: ~DefaultTrust on May 04, 2023, 07:40:35 PMQuoteВсе загруженные изображения можно использовать только на этом форумеА что мне будет, если я буду использовать изображение в другом месте? То что бывает с теми, кто нарушает пользовательское соглашение.Quote from: Smartprofit on May 04, 2023, 07:57:08 PMСпасибо за информацию о проекте! joker_josue - известный и уважаемый член сообщества форума BitcoinTalk.Подобный сервис конечно очень нужен, причём для ежедневного использования - то есть сам проект очень актуален.Есть вопросы по анонимности и конфиденциальности в процессе использования этого сервиса - можно ли на него свободно заходить под VPN, или может там есть ограничения для резидентов каких-либо стран?Нужно ли указывать какие-то данные о себе . Может только электронная почта (как в некоторых аналогичных сервисах)? Для пользователей форума думаю вопросы конфиденциальности и анонимности имеют большое значения.Может есть какие-то рекомендации по использованию нового сервиса с учётом этих моментов?Вы https://imgbb.com/ пользовались? загрузили и получили ссылку, на этом сервисе тоже самое.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "May 05, 2023, 05:37:17 AMLast edit: May 05, 2023, 05:57:16 AM by satscraper",
      "body": "Quote from: ~DefaultTrust on May 04, 2023, 07:40:35 PMQuoteВсе загруженные изображения можно использовать только на этом форумеА что мне будет, если я буду использовать изображение в другом месте? В этом случае Quote from: zasad@ on May 03, 2023, 09:22:29 PM \"Регистрация информации о пользователе не производится \"  Quote from: Smartprofit on May 04, 2023, 07:57:08 PMЕсть вопросы по анонимности и конфиденциальности в процессе использования этого сервиса - можно ли на него свободно заходить под VPN, или может там есть ограничения для резидентов каких-либо стран?На таком сайте ваше  железо можно разложить по косточкам.Никакое VPN не поможет, он скрывает только IP,Quote from: zasad@ on May 04, 2023, 09:27:07 PMВы https://imgbb.com/ пользовались? загрузили и получили ссылку, на этом сервисе тоже самое.Это верно, но пользовательская база imgbb и предлагаемого  сервиса это как говорят две большие разницы.Найти иголку в стоге сена гораздо труднее, чем сделать тоже самое в кучке хвороста.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "~DefaultTrust",
      "created_time": "May 05, 2023, 12:07:22 PM",
      "body": "Нахера козе боян - никто не объяснит тут походу?Есть имгур без этих дурацких пользовательских ограничений",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "May 06, 2023, 06:31:55 AM",
      "body": "Вопрос к знатокам: можно ли ограничить набор доменов, на которых картинки с этого сайта будут отображаться? Это бы избавило от необходимости вводить всякие нелепые условия и соглашения, потому как все что не bitcointalk.org  отображалось бы как текст, а не картинка. Технически это можно реализовать?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "May 06, 2023, 07:28:19 AM",
      "body": "Quote from: witcher_sense on May 06, 2023, 06:31:55 AMВопрос к знатокам: можно ли ограничить набор доменов, на которых картинки с этого сайта будут отображаться? Это бы избавило от необходимости вводить всякие нелепые условия и соглашения, потому как все что не bitcointalk.org  отображалось бы как текст, а не картинка. Технически это можно реализовать?Так joker_josue же написал в своей теме, что картинки котороые люди загружают на его этот сервис будут отображаться только на этом форуме. То бишь на других сайтах они не будут отображаться, я так понял его слова.Quote from: joker_josue on April 28, 2023, 07:50:05 PM- All uploaded images can only be used in the forum (unless requested by a user; it can be done after an evaluation by joker_josue).Или я что то не так понимаю?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "May 06, 2023, 02:50:45 PM",
      "body": "Quote from: light_warrior on May 06, 2023, 07:28:19 AMТак joker_josue же написал в своей теме, что картинки котороые люди загружают на его этот сервис будут отображаться только на этом форуме. То бишь на других сайтах они не будут отображаться, я так понял его слова.Отображаться они будут на любом форуме, видимо просто joker_josue может удалять c хоста загруженные изображения использованные на других ресурсах.Затестил сервис, ничего в целом особенного, но в качестве альтернативы можно будет использовать. Не понравилось лишь ограничение в 2.5 MB, необходимо подгонять изображение перед загрузкой.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "~DefaultTrust",
      "created_time": "May 06, 2023, 08:41:57 PM",
      "body": "Quote from: witcher_sense on May 06, 2023, 06:31:55 AMВопрос к знатокам: можно ли ограничить набор доменов, на которых картинки с этого сайта будут отображаться? Это бы избавило от необходимости вводить всякие нелепые условия и соглашения, потому как все что не bitcointalk.org  отображалось бы как текст, а не картинка. Технически это можно реализовать?Технически можно настроить собственный сервер так, что картинки будут показываться только на определенном сайте. Встроенное видео ютуба с подобными настройками работает.С точки зрения пользователя - это ограничение выглядит странно.  С точки зрения разработчика - ограничение видимо связано с экономией на нормальном хостинге. Если проект начнет приносить автору деньги, то ограничение наверное снимет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "May 07, 2023, 04:48:30 AM",
      "body": "У меня вопрос. А в чем преимущества перед другими подобными сайтами?  Не в обиду, конечно, сказано, но к чему изобретать велосипед, если есть уже всем известный хостинг, как imgbb.com? Да, специально только для форума, но ведь можно пойти гораздо дальше и развернуть поле деятельности. Так много вопросов и так мало ответов.         Для чего установлены такое ограничения, что нельзя изображения вставлять на другие ресурсы?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "May 07, 2023, 08:48:39 PM",
      "body": "Quote from: fruktik on May 07, 2023, 04:48:30 AMДля чего установлены такое ограничения, что нельзя изображения вставлять на другие ресурсы?На данный момент никаких ограничений нет, можете сами в этом убедиться вставив код на любом другом форуме. Quote from: ~DefaultTrust on May 06, 2023, 08:41:57 PMС точки зрения разработчика - ограничение видимо связано с экономией на нормальном хостинге. Если проект начнет приносить автору деньги, то ограничение наверное снимет.А сможет ли этот сервис принести профит, который перекрывал хотя бы затраты на поддержание? Можно ли выехать лишь на донатах и ограниченной рекламе?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "May 08, 2023, 05:40:48 AM",
      "body": "Quote from: ~DefaultTrust on May 06, 2023, 08:41:57 PMТехнически можно настроить собственный сервер так, что картинки будут показываться только на определенном сайте. Встроенное видео ютуба с подобными настройками работает.С точки зрения пользователя - это ограничение выглядит странно.  С точки зрения разработчика - ограничение видимо связано с экономией на нормальном хостинге. Если проект начнет приносить автору деньги, то ограничение наверное снимет.Любые ограничения лучше реализовывать в техническом плане, тогда не придется таскаться по судам или отслеживать нарушения соглашения вручную. С точки зрения пользователя это тоже выглядит странно, он скорее предпочтет использовать сервис, который не угрожает санкциями за \"неправильное\" использование. Техническое ограничение сделало бы сервис действительно уникальным для форума, а так это происходит только на словах: вы можете использовать этот сервис для форума, потому что я так сказал. С точки зрения разработчика это тоже выглядит глупо, всегда нужно предпочитать решения технические, а не юридические. К тому же интересная концепция может привлечь своего пользователя и это тоже поможет обеспечить монетизацию проекта. В общем и целом, задумка интересная, но вот подход к решению проблемы \"только для\" явно оставляет желать лучшего.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "May 08, 2023, 05:53:22 AM",
      "body": "Quote from: klarki on May 07, 2023, 08:48:39 PMНа данный момент никаких ограничений нет, можете сами в этом убедиться вставив код на любом другом форуме.          У меня вчера какую-то ошибку выдавало. Не хотелось изображение загружаться. Я предполагаю, что все дело в его объеме информации. Сегодня снова решил проверить и получил ссылку-код для вставки на форум. Такое себе дело возиться с этим моментом. Это же нужно будет подгонять картинку под размер каждый раз, если она превышает допустимые параметры.          Мы ведь сейчас не в 20-м веке живем, чтобы ограничивать трафик таким образом. Почему так? Из-за того, что хостинг слишком малые параметры имеет? Правильно я понимаю?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "May 08, 2023, 06:23:43 AM",
      "body": "Как я и писал выше я правильно понял что джокер хочет на своем сервисе сделать так, чтобы картинки работали только на форуме. Я задал вопрос по этому поводу у него в теме мол будут ли картинки которые размещены на его сервисе работать отображаться на других сайтах и он написал, что так не должно быть и что он проверит этот вопрос. Quote from: joker_josue on May 07, 2023, 08:46:51 AMWell that shouldn't happen.But, it may be due to browser cache reasons, which is causing this situation. As the image is loaded first here on the forum, when we get to the LoyceV website the image appears.Anyway, I'm checking this out, because it's only intended to work on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "May 08, 2023, 07:16:20 PM",
      "body": "Quote from: klarki on May 07, 2023, 08:48:39 PMQuote from: fruktik on May 07, 2023, 04:48:30 AMДля чего установлены такое ограничения, что нельзя изображения вставлять на другие ресурсы?На данный момент никаких ограничений нет, можете сами в этом убедиться вставив код на любом другом форуме. Quote from: ~DefaultTrust on May 06, 2023, 08:41:57 PMС точки зрения разработчика - ограничение видимо связано с экономией на нормальном хостинге. Если проект начнет приносить автору деньги, то ограничение наверное снимет.А сможет ли этот сервис принести профит, который перекрывал хотя бы затраты на поддержание? Можно ли выехать лишь на донатах и ограниченной рекламе? Если бы руководитель на форуме поддерживал такие проекты из форумного общака, и давал небольшие гранты на функционирование проекта, то разработчик мог бы зарабатывать и развивать сервис. К такому сервису наверно нужно больше дополнительных фишек, чтобы больше было трафика и он был интересен для рекламы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "May 08, 2023, 08:24:20 PM",
      "body": "Quote from: safar1980 on May 08, 2023, 07:16:20 PMЕсли бы руководитель на форуме поддерживал такие проекты из форумного общака, и давал небольшие гранты на функционирование проекта, то разработчик мог бы зарабатывать и развивать сервис. К такому сервису наверно нужно больше дополнительных фишек, чтобы больше было трафика и он был интересен для рекламы.Об этом можно только мечтать)) Тут до простых вещей у администрации форума руки не доходят, а тут еще о каких-то грантах заговорили))Ладно хоть переработали программу по поискам уязвимостей на форуме и выкатили более менее достойные награды в  BTC.Так что я бы на месте joker_josue не ограничивался бы лишь форумом Bitcointalk, так хоть будет какая-то надежда на профит с этого сервиса.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "May 10, 2023, 07:53:28 AM",
      "body": "joker_josue выкатил небольшое чаво по своему сервису. Он там конкретно ответил в том числе и на вопрос будут ли картинки отображаться на других сайтах. Коротко, нет не будут. Но уточнил, что могут и отображаться. И что сервис предназначен именно для нашего форума. А если сообщество захочет то он снимет это ограничение.Quote from: joker_josue on May 09, 2023, 11:22:28 PM# Do images uploaded to TalkImg only work in the forum?Generally speaking, yes. The server is configured, so that the images can only be used in the forum. Despite this configuration not being 100% effective in all scenarios, this is the project's objective: it will only work in the forum. But, if there is a lot of support in the community to open up the use of the images to other places, I can review this situation in the future.Quote from: safar1980 on May 08, 2023, 07:16:20 PMЕсли бы руководитель на форуме поддерживал такие проекты из форумного общака, и давал небольшие гранты на функционирование проекта, то разработчик мог бы зарабатывать и развивать сервис.Так он и не просил об этом. А если есть желание поддержать его на сайте есть адрес для доната. Кто мешает?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "May 13, 2023, 01:48:07 AM",
      "body": "Quote from: light_warrior on May 10, 2023, 07:53:28 AMjoker_josue выкатил небольшое чаво по своему сервису. Он там конкретно ответил в том числе и на вопрос будут ли картинки отображаться на других сайтах. Коротко, нет не будут. Но уточнил, что могут и отображаться. И что сервис предназначен именно для нашего форума. А если сообщество захочет то он снимет это ограничение.А все дело в ограниченности ресурсов joker_josue.Quote from: joker_josue on May 12, 2023, 09:20:00 PMAs I commented in another topic, so from one day to another 200GB can be more complicated, but not impossible. Complicated, because my plan was not to increase overnight, but progressively.I might even be willing to deal with that, depending on how the images are organized, and how they are linked in the forum. Sometimes the way the link is presented can make it difficult to replicate the same path on another server.Either way, it will be a subject to analyze. When you have all the information gathered it will be easier to analyze.But to move forward with this, oh yes, I'm really going to have some support from the community in order to make a sudden increase in resources, which, as you can understand, was not in the initial plan. Now, I am available for us to follow this path.Именно по этой причине сервис он запилил для btt. Если ему удастся монетизировать эту тему и (или) получит должную поддержку от комьюнити, то сможет масштабировать свой сервис.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "May 13, 2023, 10:05:53 AM",
      "body": "Тут TryNinja как всегда подсуетился и смастерил скрипт который добавляет кнопку для загрузки картинки на TalkImg прямо из окна где пишется пост. Жалко что эта кнопка не работает. Пока. Чтоб она работала я так понял нужен API key который нужно получить у joker_josue. Но он пока не раздает эти ключи, но сказал что скоро мол сделает чтоб эта кнопка работала. А сам скрипт работает и сейчас, только при нажатии кнопки открывается окно загрузки и когда выбираешь картинку и нажимаешь \"загрузить\" ничего не происходит.Ссылка на скрипт https://greasyfork.org/en/scripts/465886-bitcointalk-image-upload-button-talkimg",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}