{
  "id": "topic_5414863",
  "title": "Gorilla22",
  "author": "Gorilla22",
  "created_time": "September 25, 2022, 07:25:07 PM",
  "content": "Hi,I have 2 old core wallets on old PC, one of them with almost zero balance, and another one with some BTC on it.I was experimenting with the \"almost empty\" Core wallet.Experiment was: importing private keys from Core to Electrum. I set up new Electrum (on new PC) and imported private keys into it during set up.And Electrum shows very strange situation!1. Zero balance.  While there was 0.0006 btc on Core wallet.2. The history of transactions doesn't match. Many transactions shown on Electrum differs from the ones on Core. Time is slightly different, amounts are slightly different. Electrum shows some old transactions which are not on Core. And Core shows some old transactions which are not on Electrum. One cannot say that it is totally different history of transactions! It is similar to original one, but still different.Btw, Electrum says the last transaction was in 2017.That't right, the last transaction was in 2017,  but it was different last transaction and the balance was not zero.Why? What is it? :-)Did I wrong something or was something hacked?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414863",
  "comments": [
    {
      "author": "Saint-loup",
      "created_time": "September 25, 2022, 07:43:55 PM",
      "body": "Are you sure your Bitcoin core wallet is properly synchronized?Have you checked all your adresses one by one in each wallet? The same addresses are displayed in both wallets? All your adresses with unspent amounts from Bitcoin Core appear in your Electrum wallet and vice versa?If yes have you try to look at these addresses through a blockchain explorer to see what transactions/amounts they've really received?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 25, 2022, 07:46:58 PM",
      "body": "Is core fully synced (you won't see a progress bar at the bottom if it is).Have you checked if the addresses are similar or if there are differences in that between core and electrum. There was the segwit fork back in 2017 which might've caused some addresses to be different - if you were experimenting with segwit back then you might've sent some funds to an address that needs importing separately in electrum.How did you get the private keys out of core to put them into electrum too? Did you use a command/tool to get them all out or did you select specific addresses and their private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 25, 2022, 08:05:28 PM",
      "body": "Quote from: Gorilla22 on September 25, 2022, 07:25:07 PMWhy? What is it? :-)Did I wrong something or was something hacked?Your Core wallet is obviously not synced and it can't show correct balance and transaction, but you don't really need to use both wallet.Easy solution is to check your address on any blockchain explorer that can confirm your balance and transaction.You can also download full bitcoin blockchain if you want to wait for days and have your computer working 24/7.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 08:32:58 PM",
      "body": "Hi guys!Thank you very much!Starting answering your questions one by one!1. How I got private keys from core:Help ---> Debug ----> Console ----> Dumpprivkeys  [address].2. Addresses that I used:I used 3 addresses from the wallets, the ones that I ever used to receive btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 08:36:43 PM",
      "body": "I checked all 3 addresses on a blockchain explorer.Zero balance, the last transaction in 2017.The last transaction is just like the one on Electrum.But I remember that I didn't do that transaction......",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 08:38:48 PM",
      "body": "I didn't experiment with Segwit then in 2017.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 08:45:50 PMLast edit: September 28, 2022, 10:01:29 PM by Mr. Big",
      "body": "Yes addresses are the same on both Core and Electrum.The strange thing is, that Electrum is showing the last transaction as 0.07 btc sent from my wallet, thus bringing balance to zero. There is this transaction on blockchain explorer.While Core showing the totally different amount on last transaction, and the balance after it 0.0006 btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "September 25, 2022, 08:58:15 PM",
      "body": "Quote from: Gorilla22 on September 25, 2022, 08:36:43 PMI checked all 3 addresses on a blockchain explorer.Zero balance, the last transaction in 2017.The last transaction is just like the one on Electrum.But I remember that I didn't do that transaction......So it seems your bitcoin core wallet is not fully synchronized as I suspected. It must be sad for you to discover that your wallet was already empty in reality and that you have done all of this for nothing at the end. But if you didn't make that transaction, someone else has done it and five years later it will be hard to find the thief unfortunately. I recommend you to closely monitor the rest of your funds now, to fully check your computer with an anti-virus software and to not let anyone use your computer when you're not next to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 25, 2022, 08:58:36 PM",
      "body": "Have you ever made any transaction in bitcoin core?If you have done so, it's possible that the missing fund is on your change address(es).Take note that if you make a transaction in bitcoin core, the remaining balance goes to a new address called change address. If that's the case, you need to import the private key of the change address into electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 09:02:16 PM",
      "body": "Yes I did transactions on bitcoin Core!How can I find those change addresses in Core?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 09:08:38 PM",
      "body": "hosseinimr93.I suspected that there were some private keys which I missed to export from Core.If so, it would explain something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "September 25, 2022, 09:12:03 PMLast edit: September 26, 2022, 10:28:16 AM by Saint-loup",
      "body": "Quote from: Gorilla22 on September 25, 2022, 09:08:38 PMhosseinimr93.I suspected that there were some private keys which I missed to export from Core.If so, it would explain something.I didn't see you have exported your private keys one by one by making a dumpprivkey on each address. Why haven't you made a dump of your whole wallet in one time by using dumpwallet ? It's easier, faster and you would be sure to get all the addresses of your wallet at least. I hope you have missed some addresses, it would add some extra coins to your balance even if it wouldn't explain the strange transaction from 2017 that you don't remember.dumpwallet \"filename\"Arguments:1. filename    (string, required) The filename with path (absolute path recommended)Result:{                        (json object)  \"filename\" : \"str\"     (string) The filename with full absolute path}Examples:> bitcoin-cli dumpwallet \"test\"https://bitcoincore.org/en/doc/22.0.0/rpc/wallet/dumpwallet/Quote from: Gorilla22 on September 25, 2022, 09:33:02 PMThis is a great idea with dumpwallet!But what file name must be a \"filename\"?Is it wallet.dat file with full path? No it's just the name you want to give to your dump file and eventually its path if you want to create it in another directory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 09:33:02 PM",
      "body": "This is a great idea with dumpwallet!But what file name must be a \"filename\"?Is it wallet.dat file with full path?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 09:49:24 PM",
      "body": "Wow!It's a huge list!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 09:53:00 PM",
      "body": "Is it necessary to import the whole list to Electrum?Or just to choose only change addresses?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 09:59:50 PM",
      "body": "Is there a way to find out which addresses from that list are worth to import? :-)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 25, 2022, 10:04:29 PM",
      "body": "Quote from: Gorilla22 on September 25, 2022, 09:53:00 PMIs it necessary to import the whole list to Electrum?If you don't know which of them are funded and which of them are empty, you can import all the private keys.Quote from: Gorilla22 on September 25, 2022, 09:53:00 PMOr just to choose only change addresses?You didn't answer the question I asked in my previous post.Have you ever made any transaction with your wallet?If no, there is no need to import private key of change addresses. All of them are empty.If yes, you can check those transactions in a block explorer, find the change address and import their private keys into electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gorilla22",
      "created_time": "September 25, 2022, 10:51:06 PM",
      "body": "hosseinimr93,Yes I was making transactions from Core.Actually, I understand now it is not a good way to switch to Electrum.But now, after I have tried this, I want to experiment further to see how it all works :-)Btw, will it work if I delete this Electrum and set up a new one, importing all necessary private keys into it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 25, 2022, 10:59:41 PM",
      "body": "Quote from: Gorilla22 on September 25, 2022, 10:51:06 PMYes I was making transactions from Core.So, it's possible that you have bitcoin in your change address(es). In one of your previous posts, you said that you imported private keys of your receiving addresses. That's probably why you didn't get the correct balance on electrum. You missed change addresses.Quote from: Gorilla22 on September 25, 2022, 10:51:06 PMBtw, will it work if I delete this Electrum and set up a new one, importing all necessary private keys into it?Yes, you can create as many as wallets you want. Nothing stops you from doing that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}