{
  "id": "topic_5402954",
  "title": "Don Pedro Dinero",
  "author": "Don Pedro Dinero",
  "created_time": "June 17, 2022, 09:54:13 AM",
  "content": "https://www.reuters.com/markets/europe/bridgewater-bets-67-billion-against-european-stocks-2022-06-16/QuoteBridgewater Associates has placed at least $6.7 billion in bets against European stocks, according to data group Breakout Point, in a sign that the hedge fund firm may be pessimistic about companies on the continent.Using Bridgewater's public disclosures, Breakout Point calculated that the Connecticut-based fund has bet against 21 European companies so far this week, in sectors ranging from finance to energy. <...>\"When it comes to magnitude of short-selling, we don't recall any other money manager coming close to this, except for Bridgewater itself,\" said Breakout Point, adding that the hedge fund founded by billionaire Ray Dalio had similar bets back in first quarter of 2018 and 2020.I am not surprised by this movement because within the generalized fall in the stock market, I believe that European companies in general are weaker than those in the US. We will see how this turns out because if he wins the short bets, it can unleash more selling panic in the markets. It reminds me to some extent, but with some differences, of George Soros' bet against the British pound.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402954",
  "comments": [
    {
      "author": "el kaka22",
      "created_time": "June 17, 2022, 06:49:51 PM",
      "body": "Looking at the recession upcoming soon, this one isn't really a big \"smart\" move.I mean it is smart because he would make money from it, but it is not something we can't see coming from a mile away.Even today, I can tell you that stocks of European companies will fall down drastically in the next year. Do I have money to use it like that? Of course not, so I can't really take advantage of it, the amount of money I have would only be enough for depositing my money into a broker account that allows shorting it, and not have any money left to actually short it. But if you are rich like this guy, it is no-brainer to short the stock market because next year will be bloody for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 18, 2022, 03:13:45 PM",
      "body": "Quote from: el kaka22 on June 17, 2022, 06:49:51 PMEven today, I can tell you that stocks of European companies will fall down drastically in the next year. Do I have money to use it like that? Of course not, so I can't really take advantage of it, the amount of money I have would only be enough for depositing my money into a broker account that allows shorting it, and not have any money left to actually short it. But if you are rich like this guy, it is no-brainer to short the stock market because next year will be bloody for sure.You'd need some millions of dollars floating around somewhere in a bank to make at least a paltry sum out of that.This is not an ethical thing to do, but these are hedge funds, and its the only way they'll survive, so nothing much we can do about it. Usually its the hedge fund managers who profit out of crises at the expense of everyone else anyway.It's making me wonder just how bad next year is going to be, its definitely not \"economy-collapsing stuff\", as I pointed out in another thread, but its probably something by which to short cryptocurrency prices next year, if only buy buying up USDT (after the market recovers from the inflation shock in a few months of course).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "June 19, 2022, 08:22:29 AM",
      "body": "Hedge funds? But what about the money that is invested by common peeps on the grounds of big organization performing good in the market. There were even better odds for European stocks to survive through this inflated market. Actually by putting 6.7 billions against these stocks, Ray is making sure that these stocks will fall for sure and this will create negative buzz in the market and nothing else. Upcoming recession? That would be added force to collapse the whole European economy for these companies. Does anyone feel bad for other Share holders?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 19, 2022, 10:58:23 AM",
      "body": "I do not think that this money will put pressure on the European market, forcing people to liquidate their money, but it will cause the beginners to panic, which may lead collectively to an increase in predictions of a recession, and from it there is a collapse in European stocks, especially since the winter season is coming and it seems that the economic situation will increase together if the inflation problems increase (Rising energy prices, supply chains) and the policies of raising interest rates (quantitative tightening) did not succeed in curbing inflation.Let's see how it goes but I don't think it's the perfect time to bet money on things that change so quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "June 20, 2022, 08:03:00 PM",
      "body": "Interestingly enough european stock indexes began trending upward. Around the time this news story was published.I hope an announcement is made when Ray Dalio cashes out or cancels his short positions. If only to make it easy to check for a market reaction.On a fundamental level, wheat shortages and high gas prices should converge to significantly reduce disposable income. It should translate to reduced consumer spending in markets and a downtrend. But market trends over the past 15 years have been abnormal to say the least. Multi billion dollar fortunes have recently been wiped out by market volatility.QuoteBill Hwang Had $20 Billion, Then Lost It All in Two DaysApril 7, 2021The fast rise and even faster fall of a trader who bet big with borrowed money.https://www.bloomberg.com/news/features/2021-04-08/how-bill-hwang-of-archegos-capital-lost-20-billion-in-two-daysWhat if Ray Dalio's short positions were wrecked in a similar fashion? Tesla short sellers were said to have lost $4 billion. Large quantities of wealth are being destroyed as an everyday occurrence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 20, 2022, 10:31:02 PM",
      "body": "It sounds like he placed the shorts in US Dollars, which is not just a bet on a drop in equities, but also a bet on the US Dollar. He seems to think that the global recession will hurt equities and strengthen the dollar so he’s placing this massive bet to benefit from both of those scenarios. I doubt he’s worried about short term movements either. This is probably a 6-12 month trade and I wouldn’t be surprised if he makes a billion dollars in profit from it while everyone else watches their net assets drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 21, 2022, 03:25:34 AM",
      "body": "Very strange to go all short this late in the bear market. Seems like a bottom is fairly close anytime soon. Why place these huge bearish bets right now?From what I can tell. Since he is shorting banks and energy, those most likely have held up pretty well recently, especially energy. So I guess it makes sense in one way. But I still think that the perfect short was about a year ago and not now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 21, 2022, 03:37:17 AM",
      "body": "Quote from: OgNasty on June 20, 2022, 10:31:02 PMIt sounds like he placed the shorts in US Dollars, which is not just a bet on a drop in equities, but also a bet on the US Dollar. He seems to think that the global recession will hurt equities and strengthen the dollar so he’s placing this massive bet to benefit from both of those scenarios. I doubt he’s worried about short term movements either. This is probably a 6-12 month trade and I wouldn’t be surprised if he makes a billion dollars in profit from it while everyone else watches their net assets drop. He'd been that strategic for most of his business that most of his assets are allocated to Chinese companies. There is a drawback to his current bet because EU countries could be quitting to be part of the policy not to buy Russian gas. If this somehow sway other EU countries to do the same, he is not going to benefit. We don't know what made him decide though but this is Ray Dalio who sees the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 21, 2022, 05:45:24 AM",
      "body": "Quote from: Hydrogen on June 20, 2022, 08:03:00 PMInterestingly enough european stock indexes began trending upward. Around the time this news story was published.I hope an announcement is made when Ray Dalio cashes out or cancels his short positions. If only to make it easy to check for a market reaction.<...>Interesting but I don't see the European stock market as very bullish, and I think that in general Europe is going to bear the brunt of this whole crisis. It has no fossil fuels and energy policy is going to make everything even more expensive. This has repercussions for companies, because the higher the cost or the lower the profit, or they have to raise prices to customers, and customers are not always willing or able to bear a rise. Besides, as heterogeneous as the European Union is, it is a very heterogeneous market.In the end, nobody knows how Dalio's bet will turn out, but it seems to me that it makes sense, and the fact that the stock market rises for a couple of days does not invalidate it.Translated with www.DeepL.com/Translator (free version)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "June 21, 2022, 08:05:20 AM",
      "body": "Not a bad trade in my opinion. European stocks are already underperforming and now with all sanctions against Russia the companies in Europe will be hit the the hardest. The cheap energy from Russia played a big role in the profitability of European companies. Compared to North America, Europe is much more dependent on Russia. The aftermath of the war in Ukraine will be felt in Europe in many more years. Unfortunately there isn't much we can do than invest internationally and try to diversify away from Europe. Ray Dalio is a great hedge fund manager, I have been following him for 10 years and read his books. He is usually right with calling out his big trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}