{
  "id": "topic_5438250",
  "title": "Cee2",
  "author": "Cee2",
  "created_time": "February 05, 2023, 04:55:08 PM",
  "content": "For anyone who has attempted/completed to create an NFT collection, what were the difficulties with this?I’m especially looking for answers outside of building a community.This is for research purposes and I’m trying to better understand the inefficiencies for the current NFT process.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438250",
  "comments": [
    {
      "author": "Blitzboy",
      "created_time": "February 05, 2023, 07:56:56 PM",
      "body": "A fantastic method to express your creativity and bring your artwork or other digital assets to life is by creating an NFT collection. However, as you have previously said, there may be some challenges along the way.I've seen that many creators struggle with the technical side of things. It might be challenging for some people to learn enough about blockchain technology and smart contracts to create an NFT collection. Additionally, minting NFTs and listing them on a marketplace may take time and be difficult, particularly for people who are unfamiliar with the cryptocurrency industry.The expense of starting an NFT collection is another difficulty. If you're assembling a sizable collection, the cost of minting NFTs may soon mount up since fees are sometimes paid in the form of gas or other cryptocurrencies. In addition, developing a successful NFT collection requires spending money on marketing and promotions, which adds to the difficulty of the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NFTmetria",
      "created_time": "February 06, 2023, 02:11:52 AM",
      "body": "One of the main difficulties encountered with creating an NFT collection is the lack of knowledge about blockchain technology and cryptocurrency. Additionally, creating digital assets from scratch can be a time-consuming process, especially when it comes to selecting and designing artwork for your tokens. Furthermore, setting up a secure wallet for asset storage, as well as dealing with unfamiliar terms such as 'gas fees', can also present challenges. That being said, once you understand the steps required to create an NFT collection, the process becomes much easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "February 06, 2023, 08:45:41 AM",
      "body": "Earning popularity I guess would be the biggest problem. Many artists have tried to engage with NFT industry. I do personally know some of them. I myself creates artwork such as portraits but I did not mind engaging into it if it would be artwork alone. One biggest reason is being popular for your project to be sold to audiences. There are already existing concepts which also adds to the struggle. Showing something new is not an easy thing to do because not everything new on our naked eyes would be interesting to the majority. In terms of Project concepts, it is the same whether it has utilityor not. But this is not to encourage those who are planning to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "February 06, 2023, 02:55:51 PM",
      "body": "Quote from: Cee2 on February 05, 2023, 04:55:08 PMFor anyone who has attempted/completed to create an NFT collection, what were the difficulties with this?I’m especially looking for answers outside of building a community.This is for research purposes and I’m trying to better understand the inefficiencies for the current NFT process.There is no inefficiencies in the NFT process. The inefficiencies are in the market. Now we have multiple free AI tools that can generate images for you without any knowledge of graphics design. Then You can put them into MATIC blockchain to list in a NFT marketplace like Opensea. That's it! Very efficient and simple process but good luck with finding a buyer. Focus your research on how to sell NFTs rather than the process of creating them. That will be financially beneficial for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 06, 2023, 03:48:06 PM",
      "body": "Quote from: Cee2 on February 05, 2023, 04:55:08 PMFor anyone who has attempted/completed to create an NFT collection, what were the difficulties with this?I’m especially looking for answers outside of building a community.This is for research purposes and I’m trying to better understand the inefficiencies for the current NFT process.Major problem was to produce graphics without any AI. Other then that i had no problems what so ever when i tested to create one, except the community you already mentioned. There are ridiculously many educational videos in youtube and articles describing step by step how different kind of collections/reveals are made. And tons of hosting sites that have done almost everything for you. I am pretty sure even ChatGPT could give you clear instructions on how to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "February 06, 2023, 04:31:29 PM",
      "body": "Creating is easy.Can only cost you maybe 1$ with Polygon Network and you don't have to have programer skill, you can created on \"Open-Sea\" by free just payed the transaction-blockchain. I think the problem is not creating.But getting popularity, as you know (NFTs is f*cking dead) already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cee2",
      "created_time": "February 07, 2023, 05:20:10 PM",
      "body": "Interesting responses so far.My perspective is that currently NFT=Art Collections I think there is an opportunity to move away from this association of NFT and Art to NFT=Any Asset.This of course will requires changes to the current infrastructure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "February 08, 2023, 12:37:39 PM",
      "body": "Quote from: Cee2 on February 07, 2023, 05:20:10 PMMy perspective is that currently NFT=Art Collections I think there is an opportunity to move away from this association of NFT and Art to NFT=Any Asset.This of course will requires changes to the current infrastructure. I think some people actually think of NFT = Any Asset, and not just art. I reckon most catered NFTs were art because, well, it was by far the easiest to make since it didn't need anything at all in terms of usabilty, since, well, it's art (hence the creation of monkeys). Some pay-to-play games use the concept of NFT to give their users unique in-game assets that they can use to play after all. Well I guess the biggest idea for NFT being used in games is with the \"metaverse\" thing people wanted so they can trade any asset to whatever game connected to it, but without a proper infrastructure for it, I don't think it's going to ever work (nor do I think the gaming industry ever needs to adopt it really).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "February 08, 2023, 01:41:52 PM",
      "body": "If what you mean is really \"creating\" it from scratch it will requires a certain level of technical expertise, such as knowledge of blockchain and smart contract programming but there are websites like open sea where you could like generate your NFT for small amount of fee. But the challenge are on marketing and distribution of the NFT collection. Establishing a strong community and network of buyers and collectors is key to the success of the collection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hildentine",
      "created_time": "February 08, 2023, 06:05:23 PM",
      "body": "I think its need a very hard work because if anyone create there own nft so they will definitely need a back support and unique idea if those nft are uses in future and the project future are bright so definitely people show interest in this project otherwise why people buy those nft which are not particularly use in future and not any future plans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "February 08, 2023, 06:58:37 PM",
      "body": "Quote from: Cee2 on February 05, 2023, 04:55:08 PMThis is for research purposes and I’m trying to better understand the inefficiencies for the current NFT process.NFT technology allows people to interact with each other regardless of location and exchange or trade digital assets, but there is no such ecosystem yet.Therefore, most projects like play and earn, or study and earn, or go and earn, resemble a financial pyramid. When the influx of new participants falls, the NFT, project tokens, also become cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "February 08, 2023, 09:57:29 PM",
      "body": "Quote from: wajik-tempe on February 08, 2023, 01:41:52 PMIf what you mean is really \"creating\" it from scratch it will requires a certain level of technical expertise, such as knowledge of blockchain and smart contract programming but there are websites like open sea where you could like generate your NFT for small amount of fee. But the challenge are on marketing and distribution of the NFT collection. Establishing a strong community and network of buyers and collectors is key to the success of the collection.With the rise of AI technology and it's availability to public. People are using AI technology to make it as NFT and generate some revenue from it just like what you said. I also agree that the main challenge of it is the distribution and how will you make people trade it just like other NFT in the market. This is where NFT projects put a lot of efforts, They are doing unique catchy marketing strategy to make people buy and trade their NFT for you to make a revenue from it. I think you should offer somehow unique product in NFT market, People are sick and tired on those AI generated arts which will certainly die after sometime as the founder doesn't do much effort in building the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 08, 2023, 10:01:48 PM",
      "body": "Quote from: Cee2 on February 07, 2023, 05:20:10 PM-cut-I think there is an opportunity to move away from this association of NFT and Art to NFT=Any Asset.-cut-Sure, but this could be anything from tokenization to a whole new protocol to whole new layer 1. And that would be whole another level of difficult.I am assuming you have already read studies about owning rights and moving them between people via blockchain. That needs a new approach to digital identity and i believe that adoption for that could be coming soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "February 08, 2023, 10:10:43 PM",
      "body": "Quote from: Cee2 on February 05, 2023, 04:55:08 PMFor anyone who has attempted/completed to create an NFT collection, what were the difficulties with this?I’m especially looking for answers outside of building a community.This is for research purposes and I’m trying to better understand the inefficiencies for the current NFT process.I myself is an artist but never attempted to creat my own NFT. The biggest reason why? You'll most likely going to struggle selling your own artwork at a most reasonable price regardless of how creative it was. You'll probably need someone, a known artist perhaps, who can create value to your artwork on your behalf and build your portfolio from scratch. But then again, finding these are the most hardest challenges you'll face along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "February 08, 2023, 11:13:34 PM",
      "body": "I really wanted to make one that was for fun reasons, not money making, I had one aim, whatever cost it was, it should cover that and that's it, I do not need to make a single dime out of it and the other aim was to get it all sold as quickly as possible. Which is why I considered making it just one dollar, and if I sold 10k of them, it would be 10k raised, not a lot in NFT period, because people made millions by selling their NFT during the same time. However, I never had the money for it, so I couldn't do it. The problem was that it requires a great capital if you want to do it, and specially a lot if you are not a designer or coder or maybe even both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "February 09, 2023, 03:45:01 AM",
      "body": "Quote from: avikz on February 06, 2023, 02:55:51 PMQuote from: Cee2 on February 05, 2023, 04:55:08 PMFor anyone who has attempted/completed to create an NFT collection, what were the difficulties with this?I’m especially looking for answers outside of building a community.This is for research purposes and I’m trying to better understand the inefficiencies for the current NFT process.There is no inefficiencies in the NFT process. The inefficiencies are in the market. Now we have multiple free AI tools that can generate images for you without any knowledge of graphics design. Then You can put them into MATIC blockchain to list in a NFT marketplace like Opensea. That's it! Very efficient and simple process but good luck with finding a buyer. Focus your research on how to sell NFTs rather than the process of creating them. That will be financially beneficial for you. It is disappointing it has come to this, artists were supposed to use NFTs as a way to market their digital works to others, and instead we got nothing but lazy scammers producing digital images without any value through AI while trying to sell them for a fortune.It is no wonder that NFTs have such a bad reputation, and if anything it keeps getting worse as I doubt scammers will ever stop and they will keep flooding the NFT market with those images.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "February 09, 2023, 07:07:20 PM",
      "body": "To actually build a good NFT project that people can recognize requires expertise in image design and expertise in blockchain networks and smart contracts. because it is not easy to make NFT projects that conform to standards.Defining blockchain platforms and networks because There are several blockchain platforms and networks available for creating and selling NFTs,such as Ethereum, Binance Smart Chain, Polygon, etc. Decide on the platform that best fits your goals and project concept.Creating an NFT project can be a complex process and requires technical and creative skills. Therefore, working with a team of professionals and experienced in this field can help ensure the success of your NFT project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cee2",
      "created_time": "February 11, 2023, 12:36:24 PM",
      "body": "Quote from: o48o on February 08, 2023, 10:01:48 PMQuote from: Cee2 on February 07, 2023, 05:20:10 PM-cut-I think there is an opportunity to move away from this association of NFT and Art to NFT=Any Asset.-cut-Sure, but this could be anything from tokenization to a whole new protocol to whole new layer 1. And that would be whole another level of difficult.I am assuming you have already read studies about owning rights and moving them between people via blockchain. That needs a new approach to digital identity and i believe that adoption for that could be coming soon.Agreed, I think this will make the movement of assets easier. This is why I joined the project in my signature because I'm hoping that they can address these issues. I visualize an eBay type of marketplace with a bigger category of assets other than art, games and memberships. Also what is essential is to make the tokenization of any asset easy for everyone and anyone.On the digital identity part I posted a thread discussing this https://bitcointalk.org/index.php?topic=5439458.0I mean even in the real world you usually need a notary for a lot of official things. This could be solved via smart contracts but you need to know that you're interacting with someone genuine.It would be great if you could post more about you thoughts on digital identity in this other thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}