{
  "id": "topic_5404673",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "June 30, 2022, 05:37:56 PMLast edit: June 30, 2022, 08:57:44 PM by Disruptivas",
  "content": "A DARPA encomendou da Trail of Bits  uma pesquisa sobre quais seriam as maiores vulnerabilidades das criptomoedas em relação a centralização e vetores de ataques que podem comprometer as criptomoedas. A pesquisa foi publicada a poucos dias e realmente trás dados super relevantes para discutirmos. Na pesquisa, são analisados 5 possíveis vetores de centralização:-Centralização das autoridades: quantas entidades precisam ser corrompidas pro sistema colapsar?-Centralização do consenso: algum player/quantos controlam o poder de consenso da rede?- Motivações da centralização: como os participantes são desincentivados a agir contra a rede?- Topologia da centralização: quão resistente os algoritmos são?- Centralização da rede: os nós estão geograficamente próximos? O que ocorria se um país resolvesse filtrar o trafego DLT?-Centralização do software: bugs nos softwares comprometeriam a rede? Não sei a pesquisa tem um objetivo de ajudar a melhorar ou a ajudar o setor a afundar, mas.....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404673",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "June 30, 2022, 08:37:47 PMLast edit: June 30, 2022, 08:48:06 PM by Paredao",
      "body": "Rafaela, tem um errinho na url da imagem que vc postou, corrige lá. Ando meio em falta com você. Vejo que vc tem postado muitos assuntos interessantes e eu não tenho meritado-os como deveria. Darei uma olhada e merita-los. Acredito que com isso vc seja promovida de ranking. Será a primeira \"membra heroína\" da nossa aba local. Parabéns e continue com seu ótimo trabalho. Abs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 30, 2022, 09:02:05 PM",
      "body": "Opaaa, arrumei aqui, obrigada por me avisar. Eu não tinha visto a mensagem aqui, mas havia visto a chuva de merits pelo telegram e tinha acabado de escrever te agradecendo no tópico geral que contabiliza quantos merits faltam para cada membros. Mas fica aqui mais um obrigada do meu lado e gostei bastante do título de \"membra heroína'' kkkkkk e ainda tenho esperança que até me tornar Hero apareça alguma outra companheira por aqui.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 02, 2022, 11:32:33 AM",
      "body": "Eu vejo essa pesquisa, como interessante e até pode vir a ser benéfica para o setor.Nada melhor de avaliar os potenciais problemas, mesmo antes que eles surgem, de modo a serem comutados na melhor maneira possível.Alem disso, poderão fazer com que o ecossistema melhor e se torne mais útil e de maior confiança.Que pontos é que destacariam desse relatório?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 06, 2022, 12:54:21 AM",
      "body": "Quote from: Disruptivas on June 30, 2022, 05:37:56 PMA DARPA encomendou da Trail of Bits  uma pesquisa sobre quais seriam as maiores vulnerabilidades das criptomoedas em relação a centralização e vetores de ataques que podem comprometer as criptomoedas.Eu vi essa matéria, e só não fiquei impressionado porque é algo que todos nós já sabemos, mas preferimos virar o rosto e negar que isso possa ser um problema... principalmente o fato da mineração estar extremamente concentrado em dois grandes players.Vou responder uma das perguntas que me parece ser a mais importante:Quotecomo os participantes são desincentivados a agir contra a rede?O fato de estarem dando um tiro no próprio pé, quando isso ocorrer o Bitcoin perde seu valor e ninguém irá ganhar nada! Mas o problema existe, é real, apesar de ser extremamente difícil de ser resolvido.Adoção em massa e incentivo dos governos na mineração, talvez seja a saída.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 06, 2022, 07:06:03 AM",
      "body": "Quote from: alegotardo on July 06, 2022, 12:54:21 AMEu vi essa matéria, e só não fiquei impressionado porque é algo que todos nós já sabemos, mas preferimos virar o rosto e negar que isso possa ser um problema... principalmente o fato da mineração estar extremamente concentrado em dois grandes players.Vou responder uma das perguntas que me parece ser a mais importante:Quotecomo os participantes são desincentivados a agir contra a rede?O fato de estarem dando um tiro no próprio pé, quando isso ocorrer o Bitcoin perde seu valor e ninguém irá ganhar nada! Mas o problema existe, é real, apesar de ser extremamente difícil de ser resolvido.Adoção em massa e incentivo dos governos na mineração, talvez seja a saída.O problema é essa concentração continuar aumentar. Principalmente agora, com esta desvalorização e aumento do custo da energia. Esses players poderão aproveitar para aumentar a sua capacidade de mineração. E depois, quando esses dois players tiverem mais de 50% da capacidade de mineração?A mineração do Bitcoin devia ser mais espalhada e não tão concentrada. Mas, também fica difícil investir-se $15k num equipamento ASIC, e suportar toda a despesa, durante quase 2 anos, para recuperar o investimento.Mas a questão que se coloca é: o que se pode fazer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "July 06, 2022, 03:53:50 PM",
      "body": "Parabéns por virar hero member Disruptivas!a grande sacada da bitcoin e outras criptos foi conseguir alinhar os incentivos de forma que faz mais sentido contribuir com a rede do que tentar sabotá-laisso abre algumas dúvidas (além das que já estão aqui) pro futuro, por exemplo:será que um dia não fará mais sentido contribuir?será que a rede do btc se sustentaria sem os incentivos atuais à mineração, só com as taxas do protocolo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 06, 2022, 04:45:33 PM",
      "body": "Quote from: Lucasgabd on July 06, 2022, 03:53:50 PMa grande sacada da bitcoin e outras criptos foi conseguir alinhar os incentivos de forma que faz mais sentido contribuir com a rede do que tentar sabotá-laisso abre algumas dúvidas (além das que já estão aqui) pro futuro, por exemplo:será que um dia não fará mais sentido contribuir?será que a rede do btc se sustentaria sem os incentivos atuais à mineração, só com as taxas do protocolo?Teoricamente sim. Porque será espectável que o valor do Bitcoin seja suficientemente alto para que a recompensa e taxas por bloco, sejam compensatório para a mineração. Ou o numero de transações será suficientemente altas para as taxas compensarem.Se irá acontecer? Não sabemos. Mas, com base no histórico, conforme a dificuldade vai aumentado e o custo de mineração, o valor da moeda sobe.Para a maioria dos mineradores, ainda continua a compensar minar ao preço atual, mesmo ganhando menos claro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 07, 2022, 02:33:08 PM",
      "body": "Quote from: joker_josue on July 06, 2022, 04:45:33 PMQuote from: Lucasgabd on July 06, 2022, 03:53:50 PMa grande sacada da bitcoin e outras criptos foi conseguir alinhar os incentivos de forma que faz mais sentido contribuir com a rede do que tentar sabotá-laisso abre algumas dúvidas (além das que já estão aqui) pro futuro, por exemplo:será que um dia não fará mais sentido contribuir?será que a rede do btc se sustentaria sem os incentivos atuais à mineração, só com as taxas do protocolo?Teoricamente sim. Porque será espectável que o valor do Bitcoin seja suficientemente alto para que a recompensa e taxas por bloco, sejam compensatório para a mineração. Ou o numero de transações será suficientemente altas para as taxas compensarem.Se irá acontecer? Não sabemos. Mas, com base no histórico, conforme a dificuldade vai aumentado e o custo de mineração, o valor da moeda sobe.Para a maioria dos mineradores, ainda continua a compensar minar ao preço atual, mesmo ganhando menos claro.Acho que nesse momento,  que na prática será bem antes de 2140 e lá pra 2040, as taxas serão bem mais altas.Provavelmente a maioria das transações vai ocorrer off chain, em segundas camadas como a lightning.  E apenas grandes balanços serão feitos on chain. Existem muitas possibilidades. Hoje a recompensa por bloco já é bem inferior a 50btc iniciais e ainda é muito lucrativo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 07, 2022, 04:27:23 PM",
      "body": "Quote from: bitmover on July 07, 2022, 02:33:08 PMAcho que nesse momento,  que na prática será bem antes de 2140 e lá pra 2040, as taxas serão bem mais altas.Provavelmente a maioria das transações vai ocorrer off chain, em segundas camadas como a lightning.  E apenas grandes balanços serão feitos on chain. Existem muitas possibilidades. Hoje a recompensa por bloco já é bem inferior a 50btc iniciais e ainda é muito lucrativo.Isso mesmo.E não podemos esquecer que a dificuldade é ajustada para que o ritmo de mineração seja sempre o mesmo. Ou seja, se 50% dos mineradores desligarem as maquinas por não ser rentável, os outros 50% passa a ganhar quase dobro com a mineração, passando compensar a mineração. Digamos que é um sistema de auto regulamentação, para tudo funcionar continuamente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 07, 2022, 05:08:36 PM",
      "body": "Quote from: joker_josue on July 07, 2022, 04:27:23 PMQuote from: bitmover on July 07, 2022, 02:33:08 PMAcho que nesse momento,  que na prática será bem antes de 2140 e lá pra 2040, as taxas serão bem mais altas.Provavelmente a maioria das transações vai ocorrer off chain, em segundas camadas como a lightning.  E apenas grandes balanços serão feitos on chain. Existem muitas possibilidades. Hoje a recompensa por bloco já é bem inferior a 50btc iniciais e ainda é muito lucrativo.Isso mesmo.E não podemos esquecer que a dificuldade é ajustada para que o ritmo de mineração seja sempre o mesmo. Ou seja, se 50% dos mineradores desligarem as maquinas por não ser rentável, os outros 50% passa a ganhar quase dobro com a mineração, passando compensar a mineração. Digamos que é um sistema de auto regulamentação, para tudo funcionar continuamente.Lembrando que isso acontece não de forma imediata.A cada 2016 blocos, aproximadamente 15 Dias, a dificuldade é recalculada para que nos próximos 15 dias sejam minerados 2016 blocos.Ou seja, se houver um corte subto no hashrate no 7o dia,  vamos ficar 7 dias com cada bloco demorando muito mais até o próximo ajuste.E o próximo ajuste vai levar em conta a média dos 15 dias anteriores, podendo ainda ficar difícil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 07, 2022, 09:49:16 PM",
      "body": "Quote from: Disruptivas on June 30, 2022, 05:37:56 PMA DARPA encomendou da Trail of Bits  uma pesquisa sobre quais seriam as maiores vulnerabilidades das criptomoedas em relação a centralização e vetores de ataques que podem comprometer as criptomoedas. A pesquisa foi publicada a poucos dias e realmente trás dados super relevantes para discutirmos. Na pesquisa, são analisados 5 possíveis vetores de centralização:-Centralização das autoridades: quantas entidades precisam ser corrompidas pro sistema colapsar?-Centralização do consenso: algum player/quantos controlam o poder de consenso da rede?- Motivações da centralização: como os participantes são desincentivados a agir contra a rede?- Topologia da centralização: quão resistente os algoritmos são?- Centralização da rede: os nós estão geograficamente próximos? O que ocorria se um país resolvesse filtrar o trafego DLT?-Centralização do software: bugs nos softwares comprometeriam a rede? Não sei a pesquisa tem um objetivo de ajudar a melhorar ou a ajudar o setor a afundar, mas.....Esse estudo foi completamente debunked:https://www.swanbitcoin.com/fact-check-darpa-funded-report-on-blockchain-centralization/Leiam com atenção porque a maioria do que é dito nesse link é enganador, fora de contexto ou quase absurdo, tendo em conta os recursos necessários! É para esquecer!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}