{
  "id": "topic_5408031",
  "title": "metaplefinance",
  "author": "metaplefinance",
  "created_time": "July 29, 2022, 10:41:54 AM",
  "content": "Metaple, a DeFi project, has recently announced really exciting referral and bonuses programs for all its existing and new users. Metaple is a Decentralized Finance Project running on Binance Smart Blockchain and it is aimed to help users to multiply their income.Metaple is trying to provide the most powerful finance solution for crypto enthusiasts and traders, who over the years are facing many problems in traditional financial services and looking for solutions.Metaple is helping people move beyond traditional financial services, which typically restrict access based on geography, wealth status, and age.Recently, the company also launched Play to Earn Crypto Platform — MetaMojo. This gaming platform will allow you to earn a lot by playing games on the crypto platform. Some of the great games currently listed on this platform are American Roulette, Blackjack, Heads or Tails, and Horse Racing.Meta Mojo aims to empower gamers around the world to participate in these games and earn from their skills. Its official website is live and there are some exciting options and features that you will be amazed to know.However, Play-to-earn games and features are not the only things that are making this project exciting. The company recently announced bonuses and referral programs.As per received updates users can claim 100 credits every 24 hours, along with it the user can also get credit on crypto wallet connect, and wins of referred users.More details about the bonuses and referral program is provided below.BonusesYou can claim 100 credits every 24 hours.Referral programRefer your friends to our casino and get bonus credits. You will get the following bonuses for referred users.User signs up — 100 credits (referred user will also get 50 bonus credits)User loses a game — 10% of net loss in creditsUser wins a game — 10% of net win in creditsOther bonusesGet 10% of the net loss back when you lose more than 1000 credits in a single game.Get 10% of the net win back when you win more than 1000 credits in a single game.To win the credits you just have to copy the link (https://metamojo.ai?ref=49) and share with your friends, family and followers. With these reward programs users can earn something extra without much effort.Meta Mojo platform is live and people can join and use their skill to win good rewards. These extra bonuses and referral rewards are like extra cherry on the cake. So don’t waste your time and start referring your friends and followers to keep earning for a very long time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408031",
  "comments": []
}