{
  "id": "topic_5434735",
  "title": "mx12.levins",
  "author": "mx12.levins",
  "created_time": "January 14, 2023, 06:25:28 PMLast edit: January 17, 2024, 01:48:25 PM by mx12.levins",
  "content": "\"Limited Edition Artwork: \"Shadows and Hues\" - A Tribute to the Bitcoin Community\"Hello Bitcointalk community member and Bitcoin art collectorI am an artist who has been creating bitcoin art since 2017. My latest creation, \"Shadows and Hues,\" The price for this piece is BTC= + ~$55 for shipping to the US + ~$18 for shipping to the EU + LOADING(you can load it yourself)Payment address: 3HdtPk1ASvJ4YzKP6Jo34j67iXRsfoZpew1.2.3.4.5.6.7.8.9.10.11.12.ArtworkLimited Edition: Limited to 12 pieces.Security Boost: Satodime securely attached to the frame.Dimensions: Measures 44.6 x 64.6 cm.Material: Printed on Alu-Dibond brushed aluminum.Printing Method:Utilizes a 6-color UV-direct printing method, ensuring suitability for outdoor use.The artwork might look a little different because the QR code area will feature Satodime.As there have been no sales so far, I am still editing and adding things.Hello BitcoinTalk community,It's been a tough time for all of us in the crypto space,with many of us experiencing losses due to recent events. However, as the Greek philosopher said,\"Everything happens for a reason.\" I believe that this is an opportunity for something bigger,and even if the cards are dealt differently, they will always hold value.I am excited to announce the release of my latest limited edition artwork,\"Shadows and Hues\". This collection is a tribute to the resilience and determination of the Bitcoin community.Each piece is a unique representation of the struggles and triumphs that we have faced as a community.I hope that this artwork brings a smile to your face and serves as a reminder that we are all in this together.Thank you for your continued support of the Bitcoin community. We are strong together!  ---------------------------------Feel Free to visit Mx12.Levins Bitcoin Art Threadhttps://bitcointalk.org/index.php?topic=5362071.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434735",
  "comments": [
    {
      "author": "MoparMiningLLC",
      "created_time": "January 15, 2023, 06:00:48 AM",
      "body": "love it! glws - I need more btc to buy more art!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "January 17, 2024, 02:03:34 PM",
      "body": "Hey guys, bumping this post because I still need to list this one in my art thread. I also wanted to mention some changes, such as loading, as there will be a Satodime attached. I'm not sure about the amount, I think there will not be any amount mentioned on this artwork. If there have already been sales, then they could be lucky because it makes it more unique. For this type of artwork, like the Panthera https://bitcointalk.org/index.php?topic=5469006.0 artwork I created, you can add things to make each edition unique, and there is no turning back.As we know, I have launched a couple of auctions lately, and there is a sale for my 1 of 1 original pieces of my journey. The first one, SOLD https://bitcointalk.org/index.php?topic=5478722.0 An auction of my second original and the first one this year is happening right now - https://bitcointalk.org/index.php?topic=5481670.0 What I want to share is that the third artwork of this kind will be a sketch I am finalizing. This will also be framed like those two 1 of 1 artworks  Have fun, guys! It's crazy how much of a labyrinth I have gone through with these posts, sales, auctions, lotteries, and art threads in this forum. It's growing and growing, nice to be here. I can't believe that I found this space. Can't wait for one day to organize something like the mx12.art conference.Sneak peek!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "January 18, 2024, 12:01:50 PM",
      "body": "Sneak peek! Process! BTC Quote from: mx12.levins on January 17, 2024, 02:03:34 PMHey guys, bumping this post because I still need to list this one in my art thread. I also wanted to mention some changes, such as loading, as there will be a Satodime attached. I'm not sure about the amount, I think there will not be any amount mentioned on this artwork. If there have already been sales, then they could be lucky because it makes it more unique. For this type of artwork, like the Panthera https://bitcointalk.org/index.php?topic=5469006.0 artwork I created, you can add things to make each edition unique, and there is no turning back.As we know, I have launched a couple of auctions lately, and there is a sale for my 1 of 1 original pieces of my journey. The first one, SOLD https://bitcointalk.org/index.php?topic=5478722.0 An auction of my second original and the first one this year is happening right now - https://bitcointalk.org/index.php?topic=5481670.0 What I want to share is that the third artwork of this kind will be a sketch I am finalizing. This will also be framed like those two 1 of 1 artworks  Have fun, guys! It's crazy how much of a labyrinth I have gone through with these posts, sales, auctions, lotteries, and art threads in this forum. It's growing and growing, nice to be here. I can't believe that I found this space. Can't wait for one day to organize something like the mx12.art conference.Sneak peek!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunnybwoy",
      "created_time": "January 18, 2024, 03:27:32 PM",
      "body": "Amazing and I can definitely relate to the art because I was affected  by this cold scam so will definitely try to add this to my collection of your artwork!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}