{
  "id": "topic_5400222",
  "title": "lionheart78",
  "author": "lionheart78",
  "created_time": "May 26, 2022, 06:14:44 AM",
  "content": "Does anyone remember OneCoin? It was one of the biggest scams in 2017.  Its founder Dr. Ruja Ignatova has been added to Europe's most wanted people.  She was accused of stealing around $5B from investors back in 2017.[1] She disappeared after bagging such huge amount.  The European for Law enforcement cooperation, Europol had offered up to €5000 (which I think is too small for such big case)If ever you are wondering what Onecoin is, here is a brief history about it[1].Launched last 2014 with the promise of it as Bitcoin KillerHad solicited an investment from 175 countries Was identified as Ponzi scheme after 3 years of operation Was found out that it has no blockchain Investors bought €30,000,000 of the worthless coin in 2016  In 2019, OneCoin lawyer Mark Scott was found guilty by the US District Court in Manhattan of conspiracy to commit money laundering and bank fraud.For more news about OneCoin scam accusations, you can check:https://www.coindesk.com/tag/onecoin/Justice may be slow but I wish to see more news like this on the internet.  The authority pursuing people involved in Crypto scams.  I wonder when will the authority announce the founder of Terra guilty of fraud  .[1] https://www.cryptogamblingnews.com/news/onecoin-founder-added-to-europes-most-wanted-list/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400222",
  "comments": [
    {
      "author": "TravelMug",
      "created_time": "May 26, 2022, 06:23:43 AM",
      "body": "Remember this, even some of my friends are urging me about this coin in 2017, but I said no. Because that time I was inexperienced and I was lucky I didn't bite on it. So obviously they lost their money on this scam and it made me realized that there are a lot of scammers in crypto sphere.Nevertheless, even if I'm not a victim, I wanted to see the justice being served on this case and hopefully Ruja Ignatova could be caught sent to jail.As for Terra, if I'm not mistaken, Do Kwon is already under investigation by the S. Korean government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "May 26, 2022, 07:30:16 AM",
      "body": "Quote from: TravelMug on May 26, 2022, 06:23:43 AMAs for Terra, if I'm not mistaken, Do Kwon is already under investigation by the S. Korean government.Do Kwon was asked to appear before the Korean legislative assembly and I like it that he was summoned. And if he is found guilty he should be sent to prison without any waste of time. Enough of scams in this industry. It is killing the faith of people in cryptos.And yes I remember Onecoin. I heard of it in this forum when I joined here. Alot of us newbies thought it was next to bitcoin. But like you, I did not invest in it then too because I had no money, and not because i knew it was a scam. Then I never knew my left from my right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "May 27, 2022, 07:25:52 AM",
      "body": "In today's age and time, I do not believe that people could be hiding and nobody could find them. The only reason people may not be found is the fact that they are not looked for that carefully. USA literally found a guy in a dirt in the ground in the other side of the world. Finding some coin scammer would be fairly simple compared to that if they are looking for her.Right now, it became a bit easier because Most Wanted list means that she will be looked for in the long run and will be using a lot more resource to find her. What was the point of it all? You could have 100+ billion dollars, if you can't spend it and live a great life, then why would you get it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}