{
  "id": "topic_5410414",
  "title": "MoparMiningLLC",
  "author": "MoparMiningLLC",
  "created_time": "August 18, 2022, 07:54:43 PM",
  "content": "https://bitcointalk.org/index.php?topic=5410318.0based on the above thread, and that Smoothie is selling them in rolls - I have asked him if he would set some rolls aside while I gather funds. This is to provide the availability to those interested in getting a set but are not wanting to get a full roll.Quote4-COIN SETSrandomly selected MATCHING # ROLLS of 20 of all FOUR COIN types (80 coins total)PRICE = 0.18 BTCThis puts the cost at .009 per set - the sets will be unfunded. Shipping will be handled once I have them in hand and will vary per individual based on whether they are in the US or international.Please post below how many sets you are interested in and then send in payment to the following address: bc1qn37ly2yjla0thlnfsverzezrvxtxdsyvecp4es DO NOT SEND PAYMENT TO ANY OTHER ADDRESS EVEN IF YOU RECEIVE A DM FROM MEplease also include your txn id or send it to me in a DM",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410414",
  "comments": [
    {
      "author": "MoparMiningLLC",
      "created_time": "August 18, 2022, 07:54:52 PM",
      "body": "moparminingllc - 1markzellers - 2hookzup1 - 2pinky1234 - 1MrMojoRising26 - 22stout - 2est2013 - 1total sets requested: 11expressed interest but has provided no qtytweetious - ?steeley - ?yodasRedRocket - ?Crytocanuk - ?Frank Alpencoin - ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tweetious",
      "created_time": "August 18, 2022, 08:29:26 PM",
      "body": "I would like 1 set please. Could you please indicate which design you will choose for the rainbow coins? (Personally speaking I prefer D - but I will be totally fine with what the majority aggres on-)Edit: Did smoothie agreed on putting aside a 4-coins set? (just double checking, lol)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hookzup1",
      "created_time": "August 18, 2022, 08:51:07 PM",
      "body": "I think the group buy is for the 4 roll set so would be split up into 4 coin sets (1 of each variety) for roughly .05 each 🤔",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agrawas",
      "created_time": "August 18, 2022, 09:10:21 PM",
      "body": "Quote from: Hookzup1 on August 18, 2022, 08:51:07 PMI think the group buy is for the 4 roll set so would be split up into 4 coin sets (1 of each variety) for roughly .05 each 🤔I think Mopar is planning for a group buy for unfunded coins.. If you or others are interested in funded coins, we can do another set of 4 funded rolls that will be .05BTC per set.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hookzup1",
      "created_time": "August 18, 2022, 09:16:56 PM",
      "body": "They all must be funded to face before they get shipped out so I don't think unfunded coins is an option",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Steeley",
      "created_time": "August 18, 2022, 09:22:47 PM",
      "body": "MoparThanks for being willing to coordinate the group buy. This is work and I am grateful. I want to see what Smoothie decides on the 10 coin set. If he offers that I will want to get this (one of every coin loaded).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "August 18, 2022, 09:25:06 PM",
      "body": "Yes these are for unfunded if interest is sufficient could do one funded set and one unfunded - i am driving and will update op In the end - I was trying to make this a simple process - with his op he stated it was “random” but matching - I assume the “random” is the finish",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tweetious",
      "created_time": "August 18, 2022, 09:36:01 PM",
      "body": "Quote from: MoparMiningLLC on August 18, 2022, 09:25:06 PMYes these are for unfunded if interest is sufficient could do one funded set and one unfunded - i am driving and will update op In the end - I was trying to make this a simple process - with his op he stated it was “random” but matching - I assume the “random” is the finishI assumed the \"random\" is the number (ie random matching number), not the finish/design since smoothie explicitly posted the following example:Code:Example order #2:Matching numbered sets = YESONE Roll of of 20 x 0.01 BTC Nickel plated Brass coins  ONE Roll of 20 x 0.01 BTC RAINBOW Nickel Plated Brass coins  (DESIGN B) NEW ONE Roll of 20 x 0.01 BTC Brass coinsONE Roll of 20 x 0.01 BTC RAINBOW Brass coins (DESIGN B) NEW",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptogreatdane",
      "created_time": "August 18, 2022, 09:40:32 PM",
      "body": "Ill take 2 sets please",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "August 18, 2022, 09:44:08 PM",
      "body": "Gotcha - will scrap this thread and start a whole new one when I am not between red lights lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}