{
  "id": "topic_5404802",
  "title": "Len Saldua",
  "author": "Len Saldua",
  "created_time": "July 01, 2022, 03:42:15 PM",
  "content": "Just noticed the price action is unusually bad lately. Not sure if it's related to anything that it's happening in the project ? To me this was always one of the blue chips in gaming.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404802",
  "comments": [
    {
      "author": "asriloni",
      "created_time": "July 02, 2022, 01:22:25 PM",
      "body": "Quote from: Len Saldua on July 01, 2022, 03:42:15 PMJust noticed the price action is unusually bad lately. Not sure if it's related to anything that it's happening in the project ? To me this was always one of the blue chips in gaming.You must also see the bitcoin chart. All of coins in the crypto market are dumping so hard right now due to the bitocin. It's not only illuvium but a good project like PYR was also getting dumped badly due to the bearish market trend that is happening right now. That's a common problem during the bearish market. The game from illunivum is not yet playable and it's still in the development. I hope that in a few years market will be very bullish again soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "July 02, 2022, 04:20:56 PM",
      "body": "I just heard and found out about this project, I was surprised to see the price history of their token. The ATH of $ILV is around $2.8K while the current price is only around $115. The most likely thing from this price drop is the reduced interest of people to invest there.In the title of your topic, you write \"Anyone know if Illuvium is playable yet ?\", honestly I don't know, if you invest in this project, you should know everything there, including the game that can be played or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 02, 2022, 07:07:19 PM",
      "body": "Quote from: Len Saldua on July 01, 2022, 03:42:15 PMJust noticed the price action is unusually bad lately. Not sure if it's related to anything that it's happening in the project ? To me this was always one of the blue chips in gaming.Most of the tokens depend on native blockchain, and since the number of cryptocurrency users has decreased, and therefore their impact was stronger than the rest of the sectors.Proof of Stake coins are better than decentralized in terms of speed and performance, but they fail to maintain their value in the long run.Therefore, we note that the corrections that came are strong, and that Ethereum is not in the best condition for the price to go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "July 12, 2022, 01:58:15 PM",
      "body": "Two reasons I would invest in Illuvium even during this bear market:The game is a legit AAA game, with a very clear roadmap and market.The team behind it is top notch, and not just 2 or 3 people, but well over 100 including many talented designers and coders. I would add that you could stake Illuvium for 500% apy as recently as last year, but I'm sure it's a bit less now. Also, don't know if that is still happening as hardly anyone is talking about it. Funny how everyone was talking about it when ILV was over $1000...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "July 12, 2022, 05:21:11 PM",
      "body": "Quote from: Len Saldua on July 12, 2022, 01:58:15 PMI would add that you could stake Illuvium for 500% apy as recently as last year, but I'm sure it's a bit less now. Also, don't know if that is still happening as hardly anyone is talking about it. Funny how everyone was talking about it when ILV was over $1000...that didn't seem to be real for me. The development progress was not so fast like what you have sad if it has hundred of workers. Those people who have been staking when the price was around 1k already lost a lot. Is it still relevant to stake for now? yes it is but the capital gain may say the reverse thing once bitcoin will be going down again. The bottom will become the safe point to stake caused by it was reducing the potential of loosing your capital since it already reached the bottom price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 12, 2022, 06:02:51 PM",
      "body": "Quote from: Len Saldua on July 12, 2022, 01:58:15 PM-snip-Have you hear the news?NFTs trend is over, we have already reached the peak based on the google trend. If you research just based on how many teams in the project, did you know you can easily hire people? as long they're qualified for the duty.A roadmap, doesn't guarantee anything. Have you seen from 2017-now ? how many project died even with a good roadmap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 12, 2022, 08:53:05 PM",
      "body": "After ATH at $1,900, the current price of $29 looks like a tempting investment. But the question is whether this play-to-eran project will be as successful and popular as an investment in the future. As we know, the P2E industry is going through bad times, and even the industry's flagship Axie Infinity remains extremely unclaimed and losing value. In fact, right now it only makes sense to invest in this project for the most hardcore fans and for the amount they wouldn't mind losing. Personally, I would refrain from investing in the p2e industry at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}