{
  "id": "topic_5464501",
  "title": "Minecache",
  "author": "Minecache",
  "created_time": "August 25, 2023, 03:39:31 AM",
  "content": "Although I used to think that before the bull season really arrived, we would have another dump waiting for us. But I believe there will be no new bottom for bitcoin, we already have the low for this bear season, and that was the $15k set last year. Recently, there has been a lot of speculation about bitcoin dropping to 12k$-8k$ before the bull season arrives and I stumbled across this article. I want to know what you guys think and why you believe bitcoin will not drop to 12k$.Personally, I also don't believe bitcoin will drop below $15k. And I think we have a chance to buy cheap and don't miss it.QuoteBitcoin is not Going to $12k 🚨Here is why : - 93% of all Bitcoin has now been mined.- World's largest asset manager Blackrock files for Bitcoin spot ETF- Mysterious wallet accumulated $3 Billion worth $BTC In just 3 months- Europe gets its first Spot Bitcoin  ETF - Only 6.3% Of Total Bitcoin Supply Left On Exchanges- Bitcoin Halving in just 8 months- Bitcoin supply shock inevitableThis could be the Final Shakeout/Manupulation before the real Bull Run begins. Next 2-3 months are going to be Important!Don't miss the second chance. Act smart Source: https://twitter.com/thescalpingpro/status/1694058998092439603",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464501",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "August 25, 2023, 04:46:50 AM",
      "body": "I don’t think it’ll drop that low because there is pretty much no sellers left. Most people who bought at $50k thinking we would get $1M already sold by the time FTX tanked. It tried to go lower but there just wasn’t any sellers except short sellers who all had massive losses when we rallied. We just need to be patient because it’s still summer and the markets are very illiquid. Most likely by October or November we will get some movement and hopefully in the right direction. However keep in mind the global economy is not good. If we get a recession then they won’t be good for bitcoin or crypto at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "August 25, 2023, 06:20:19 AM",
      "body": "There are certain institution that can actually support Bitcoin at the price of $20k, but anything can happen and the whales are playing with the market silently, $12k might happen but let's be more positive this time because we are already experiencing the longest bear market with cryptomarket. What's the reason to panic right now? I see the price  holding to the price of $26k, this is a good sign that the support is stronger that the seller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "August 25, 2023, 06:36:06 AM",
      "body": "Well I do also agree with you with this. I do not think price of Bitcoin will ever fall down to 12k ever again. But we do not know this for sure. We are seeing alot of fud in the news about Bitcoin. And all it will take is for something bad to come out about a major exchange like Binance or Coinbase and will see more losses. But I do not think it will happen and we will stay about 25k per coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 25, 2023, 07:37:55 AM",
      "body": "Quote from: Minecache on August 25, 2023, 03:39:31 AM- 93% of all Bitcoin has now been mined.- World's largest asset manager Blackrock files for Bitcoin spot ETF- Mysterious wallet accumulated $3 Billion worth $BTC In just 3 months- Europe gets its first Spot Bitcoin  ETF - Only 6.3% Of Total Bitcoin Supply Left On Exchanges- Bitcoin Halving in just 8 months- Bitcoin supply shock inevitable\"- 93% of all Bitcoin has now been mined.\" - So coins like BNB which are already 100% minted and even deflationary should have infinite evaluation?\"- World's largest asset manager Blackrock files for Bitcoin spot ETF\" he already have exposure to bitcoin price change by owning 8% of all MSTR shares. So this etf migh be a take profit time for him.\"- Mysterious wallet accumulated $3 Billion worth $BTC In just 3 months\" - it could be the idea of ​​snoop dog and his stoned mind. The fact that someone could afford to buy btc for $ 3 billion does not mean that the market is doomed to increase. Well Snoop Dog net worth is around $200M but you get my point right?\"- Europe gets its first Spot Bitcoin  ETF \" IMO bitcoin does not need ETF. Its not a regular commodity that is hard to store/transfer and ETF solve many issues. Being excited about bitcoin ETF is like being excited that at the moment when cars began to replace horse-drawn carriages, someone was excited that the latest generation of cars would have a container for horse food.\"- Only 6.3% Of Total Bitcoin Supply Left On Exchanges\" fractional reserve allert\"- Bitcoin Halving in just 8 months\" - halvings have much lower fundamential impact on price than before. Quote from: Tytanowy Janusz on October 27, 2022, 08:53:31 AM1st halving was important. It reduced monetary inflation from 25% to 12%. Thats a big deal. Second halving decreased monetary inflation from 9% to 4,5%. Now we are getting closer and closer to the 4th halving that will reduce bitcoin monetary inflation from like 1.5% to 0.7%. Both numbers are negligible compared to 8% official CPI in US, 10% in EU or 80% in countries like Turkey. So my bet is that halvings fundamental impact on bitcoin price is getting lower and lower with every next halving in oppose to macro data, FED decisions, interest rates, recessions etc. Bitcoin will be more like an asset that act sometimes like gold on steroids sometimes like sp500 on steroids rather than it will fallow \"bubble x days before each halving scheme\"\"- Bitcoin supply shock inevitable\" - assuming demand constantly increases.It's not that I reject the possibility of BTC pump. My investment capital is on the up side too, but I wrote my post to warn all incorrigible optimists that the future may be less colorful than it looks. And it is worth approaching the investment calmly, don't yolo rush all in, so that you do not have to sell everything at the very bottom if the next bull run will be in 7 years not 2 and you are out of money to leave from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "August 25, 2023, 10:14:53 AM",
      "body": "Quote from: mich on August 25, 2023, 06:36:06 AMWell I do also agree with you with this. I do not think price of Bitcoin will ever fall down to 12k ever again. But we do not know this for sure. We are seeing alot of fud in the news about Bitcoin. And all it will take is for something bad to come out about a major exchange like Binance or Coinbase and will see more losses. But I do not think it will happen and we will stay about 25k per coin.Yes, hopefully it will last and won't drop beyond $12k.A lot of manipulators will make the price go down wanting a cheap price so they can buy a lot of coins and sell them when the Bullrun comes. Binance and Coinbase are big exchanges, if they get FUD like what happened to Binance.us which has a legal dispute with SEC, it will have a bad impact and make the crypto price crash suddenly. We will see the Halving happen soon in the next year, and that will be the start of the Bullrun to reach the new ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WatChe",
      "created_time": "August 25, 2023, 11:32:32 AM",
      "body": "Quote from: adaseb on August 25, 2023, 04:46:50 AMI don’t think it’ll drop that low because there is pretty much no sellers left. Most people who bought at $50k thinking we would get $1M already sold by the time FTX tanked. It tried to go lower but there just wasn’t any sellers except short sellers who all had massive losses when we rallied. We just need to be patient because it’s still summer and the markets are very illiquid. Most likely by October or November we will get some movement and hopefully in the right direction. However keep in mind the global economy is not good. If we get a recession then they won’t be good for bitcoin or crypto at all. TBH there is no way to predict future price of Bitcoin. Price is not moving from 26k$ and it may be a new stable price of Bitcoin. Previously we saw Bitcoin staying on 30K$ for over a month. There is every possibility for Bitcoin to go down from this point and vice versa. We need to be open for bidirectional price swing of Bitcoin at every stage of market. As far as current dip is concerned, there is nothing much to worry as price correction is normal in every market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "August 25, 2023, 12:05:09 PM",
      "body": "Quote from: Minecache on August 25, 2023, 03:39:31 AM-snip-Personally, I also don't believe bitcoin will drop below $15k. And I think we have a chance to buy cheap and don't miss it.I agree that the bottom will not be below $15k like it has been in the last year although a certainty about price is not there. That means it can happen and it can not.Given that the price rises and falls depending on supply and demand, it is still unlikely that the owner of the asset will sell all of their holdings without regard to the profit factor that will be obtained.Like you said, if the bitcoin price chart continues to move downwards it will be a very good opportunity to buy.It will indeed be burdensome for the holders if the current situation continues for the next time that has the potential for panic-selling, but the heavy rain will also stop and the sun will rise to brighten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 25, 2023, 12:19:09 PM",
      "body": "I thought 12k was definitely possible when we were under 20k. I think we are too close to the halving for a lower bottom now though. It would take a real black swan event to hit 12k. I mean it’s possible but very unlikely. We are out of the peak bear market now, you can call this an accumulation zone, just sitting in a relatively tight range, boring chopping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "August 25, 2023, 12:53:03 PM",
      "body": "12k usd is very low according to me. I mean Bitcoins might fall till 20k usd, but if it falls below that, then I am sure some whales will buy the coins and hence the demand to accumulate it will increase. Then instead of falling, the price will go up. If you ask me, then this bear market is an opportunity to be honest. Accumulate as many coins as you can in this low price and hold. Then sell when the price booms up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "August 25, 2023, 01:11:31 PM",
      "body": "Quote from: Minecache on August 25, 2023, 03:39:31 AMAlthough I used to think that before the bull season really arrived, we would have another dump waiting for us. But I believe there will be no new bottom for bitcoin, we already have the low for this bear season, and that was the $15k set last year. Recently, there has been a lot of speculation about bitcoin dropping to 12k$-8k$ before the bull season arrives and I stumbled across this article. I want to know what you guys think and why you believe bitcoin will not drop to 12k$.I share the same thoughts with you. I think we've actually seen the last bottom of the bottom for the bearish season and that's $15k, there's no way Bitcoin is going to take a dive to $8k. So, if there are persons still dreaming and hoping for this to happen, I don't think it's going to be feasible. It is just the normal market condition that dragged the price to $25.8k which might be expected or not, but I believe the market will soon turn green, and the price will retrace back to $30k. With the Bitcoin halving just less than a year from now, I only expect some kind of price spike before the bull season takes off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onecall123",
      "created_time": "August 25, 2023, 01:29:54 PM",
      "body": "nah! Absolutely not!I'm getting the sense of a usual bear market atmosphere. Personally, I'm not convinced that Bitcoin will go under $20k, but it looks like there's an opportunity to accumulate at a lower price. This is the moment between market lows and bullish. Bull markets make people rich, but become wealthy in bear markets. We should not allow the bottom to not only drop, but take the benefits as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "August 25, 2023, 02:04:11 PM",
      "body": "Quote from: Minecache on August 25, 2023, 03:39:31 AMAlthough I used to think that before the bull season really arrived, we would have another dump waiting for us. But I believe there will be no new bottom for bitcoin, we already have the low for this bear season, and that was the $15k set last year. To my mind it is already the lowest in this cycle even now it is still far away at that point but more manipulation news about speculation that says bitcoin fell deeper but in my mind it is not so, it remains last year which became the center of its lows.Quote from: Minecache on August 25, 2023, 03:39:31 AMRecently, there has been a lot of speculation about bitcoin dropping to 12k$-8k$ before the bull season arrives and I stumbled across this article. I want to know what you guys think and why you believe bitcoin will not drop to 12k$.Sure that it was already on the verge of a decline last year, but I wouldn't be skeptical because we all have faith in bitcoin which holds that the price will not be more than $10k this even I consider the news that continues to be heralded so that more people panic while the whales can buy at the bottom again.We prove how bitcoin moves down or up. I am optimistic upwards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "August 26, 2023, 07:34:21 AM",
      "body": "Although I don't believe Bitcoin will drop below $15k or up to $12k, but it could happen when there is more negative news that can make people panic. People's panic can get bigger if they read or find other negative news related to crypto, especially Bitcoin.People who have just joined Bitcoin and have no self-control in reading the news need to be made aware of this. They can be so easily swayed by the words or tweets of people they think are “crypto experts” that they will immediately believe them. And this condition will be exacerbated when they immediately sell their Bitcoin and decide to get out of the market.Even if they were aware, they could use that moment of deep dips to be able to buy more Bitcoins. Bitcoin's journey will become even more interesting towards the end of this year as there will be more shocks for the Bitcoin market. We have to tighten our belts so we can get through it well. Keep your Bitcoin HODL and accumulate at a low price to get more Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 26, 2023, 08:57:36 AM",
      "body": "Quote from: DeathAngel on August 25, 2023, 12:19:09 PMI thought 12k was definitely possible when we were under 20k. I think we are too close to the halving for a lower bottom now though. It would take a real black swan event to hit 12k. I mean it’s possible but very unlikely. We are out of the peak bear market now, you can call this an accumulation zone, just sitting in a relatively tight range, boring chopping.We need to understand that in the cryptocurrency industry, there is no price that is impossible to attain, be it upwards or downwards. For instance, if the price is at 25k, there is no guarantee that panic will not take the price to 20k. If the price gets to 20k, there is no guarantee that panic will not take it to 15k and if at 15k,  there is no assurance that panic will not take it to12k or 10k. That is how it is, there is always FUD to drag the price more downward and there is always FOMO to pull the price upwards. Personally, I think 12k is too far low for bitcoin. If by chance bitcoin gets to 12k, it means that there is every possibility that bull run will not happen in the next halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "August 26, 2023, 08:59:22 AM",
      "body": "Going down to 20k is impossible, let alone up to 12k, that's even more impossible. Currently there are many smart investors because the decline that occurred in my opinion is a healthy decline, and does not make them panic sell.and although some still panic sell when the price of Bitcoin drops, they may still be very new to the industry. And this is natural because that's what we experienced at that time, and in the end we won't panic when the Bitcoin price drops and instead get into the habit of buying more Bitcoin because that's the best discount. So things like that are what they will feel because it is something new and it will be their experience that will not be repeated, so it is unlikely that the price of Bitcoin will drop that far given the ever-increasing demand.This drop is the best moment to collect more Bitcoins, and save them for the long term to make a satisfying profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "August 26, 2023, 09:04:13 AM",
      "body": "Quote from: mich on August 25, 2023, 06:36:06 AMWell I do also agree with you with this. I do not think price of Bitcoin will ever fall down to 12k ever again. But we do not know this for sure. We are seeing alot of fud in the news about Bitcoin. And all it will take is for something bad to come out about a major exchange like Binance or Coinbase and will see more losses. But I do not think it will happen and we will stay about 25k per coin.Negativity on major exchanges is not affecting the Bitcoin price as negatively as it used to. This is good news for Bitcoin. At the same time, the reason why this news doesn't affect Bitcoin is because Bitcoin has savvy investors. Maybe the reason why the price isn't going up is because they can't get Bitcoin down to the price they want. So they may not be collecting the amount of Bitcoin they want.I don't think the price will go below 20,000. We have to be patient. Bitcoin will go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WatChe",
      "created_time": "August 26, 2023, 10:27:22 AM",
      "body": "Quote from: Nrcewker on August 25, 2023, 12:53:03 PM12k usd is very low according to me. I mean Bitcoins might fall till 20k usd, but if it falls below that, then I am sure some whales will buy the coins and hence the demand to accumulate it will increase. Then instead of falling, the price will go up. If you ask me, then this bear market is an opportunity to be honest. Accumulate as many coins as you can in this low price and hold. Then sell when the price booms up.Whenever there is a dip we have so many negative speculations about Bitcoin that price is going very low and we have also seen that all such speculations have gone wrong till date. I don't know why there is so much negativity in market after there is small price correction. See price of Bitcoin is very much stable at 26K and there is very little chance that price drop below 25k$ or 26k$. Its time to put your faith in Bitcoin and avoid all the FUD spread in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "August 26, 2023, 11:12:29 AM",
      "body": "Quote from: goaldigger on August 25, 2023, 06:20:19 AMThere are certain institution that can actually support Bitcoin at the price of $20k, but anything can happen and the whales are playing with the market silently, Institutions can be whales too, so we shouldn't expect them to support bitcoin if it drops to $20k, and maybe they are the ones looking to push bitcoin down even more.Quote from: goaldigger on August 25, 2023, 06:20:19 AM$12k might happen but let's be more positive this time because we are already experiencing the longest bear market with cryptomarket. If we look at the 4-year cycle of the market, we still have a long way to go, we are only 2/3 of the way there. Quote from: goaldigger on August 25, 2023, 06:20:19 AMWhat's the reason to panic right now? I really want to know the thoughts of those who believe bitcoin will drop to $12k, because I can't think of any reason.Quote from: goaldigger on August 25, 2023, 06:20:19 AMI see the price  holding to the price of $26k, this is a good sign that the support is stronger that the seller. When bitcoin was trading at 30k for a long time, and if I remember correctly, bitcoin was sideways for almost 8 weeks before falling, and many people thought the same as you. People believed that $30k would be unbreakable but eventually, bitcoin dropped to $26,000. We can be optimistic not to be subjective with the current market situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "August 26, 2023, 12:03:46 PM",
      "body": "For me, we have reach the bottom already for this bear market when we go down to $15,500 last year. The only what that we might see another lowest low is that if we have another black swan even like Terra Luna and the FTX collapse.So far the dip that we have has something to do with Elon Musk (as first speculated), or some bad timing in the Chinese market causing a huge dump.But hopefully, there will be no black swan event this year, thus we might not see the price going below $20k at least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}