{
  "id": "topic_5422036",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "November 17, 2022, 10:56:30 PM",
  "content": "QuoteMortgage volumes at Wells Fargo slowed further in recent weeks, leaving some workers idle and sparking concerns that the lender will need to cut more employees as the U.S. housing slump deepens.The bank had about 18,000 loans in its retail origination pipeline in the early weeks of the fourth quarter, according to people with knowledge of the company’s figures. That is down as much as 90% from a year earlier, when the Covid pandemic-fueled housing boom was in full swing, said the people.Employees are on edge after the bank began cutting workers in April and internal projections point to more departures.Mortgage volumes at Wells Fargo slowed further in recent weeks, leaving some workers idle and sparking concerns the lender will need to cut more employees as the U.S. housing slump deepens.The bank had about 18,000 loans in its retail origination pipeline in the early weeks of the fourth quarter, according to people with knowledge of the company’s figures. That is down as much as 90% from a year earlier, when the Covid pandemic-fueled housing boom was in full swing, said the people, who declined to be identified speaking about internal matters.The U.S. housing market has been on a roller coaster in recent years, taking off in 2020 thanks to easy-money policies and the adoption of remote work, and slowing down this year as the Federal Reserve boosted rates. Homebuyers have been squeezed and the pace of refinancing has plummeted as borrowing costs surged to more than 7% for a 30-year loan from about 3% a year earlier. And rates may climb further as the Fed is expected to boost its benchmark rate again Wednesday.The situation has pressured the home loan industry, particularly firms like Rocket Mortgage that thrived on loan refinancings, and is expected to lead to consolidation among newer nonbank players that rushed to serve customers after most U.S. banks receded from the market.Among the six biggest U.S. banks, Wells Fargo has historically been the most reliant on mortgages. But that has begun to change under CEO Charlie Scharf, who has said that the bank is looking to shrink the business and focus primarily on serving existing customers.Early warningIn October, the bank warned investors that the housing market could slow further after saying that mortgage originations fell nearly 60% in the third quarter.“We expect it to remain challenging in the near term,” CFO Mike Santomassimo told analysts Oct. 14. “It’s possible that we have a further decline in mortgage banking revenue in the Q4 when originations are seasonally slower.”Employees are on edge after the bank began cutting workers in April and internal projections point to more departures. Local news outlets have reported when Wells Fargo offices have been required to disclose impending job cuts in a municipality.The ranks of mortgage loan officers, who mainly earn commissions from closing deals, is expected to drop to under 2,000 from more than 4,000 at the start of the year, according to one of the people. Many salespeople haven’t closed a single loan in recent weeks, this person said.Another person said that most of the exits have been voluntary as bankers sought other opportunities, making departures and staffing levels hard to predict.“The changes we’ve recently made are the result of the broader rate environment and consistent with the response of other lenders in the industry,” a Wells Fargo spokesman said in a statement. “We regularly review and adjust staffing levels to align with market conditions and the needs of our businesses.”The bank said last month that its total workforce shrank by about 14,000 people in the third quarter, a 6% decline to 239,209 employees.Wells Fargo shares are down about 2% since the start of the year.https://www.cnbc.com/2022/11/02/wells-fargo-mortgage-staff-brace-for-layoffs-as-us-loan-volumes-collapse.html....Also related:QuoteWarren Buffett Exits Wells Fargo And Buys Stake In Its Rival BankBerkshire Hathaway Inc (NYSE: BRK-B) bought $3 billion worth of shares in Citigroup Inc (NYSE: C) in Q1, giving the group a stake of about 2.8%, according to filings with regulators.The investment came as Berkshire sold the remainder of its position in Wells Fargo & Co (NYSE: WFC), a rival bank that had been a staple in Buffett’s portfolio for more than three decades, Financial Times reported.At the start of 2022, Warren Buffett, Berkshire’s chief executive, plowed $51.1 billion into the market as global stocks sagged due to Federal Reserve, supply chain disruptions, strong inflation, and the war in Ukraine.Berkshire ended 2021 with a near-record $146.7 billion cash pile. Citigroup has slid more than 21% this year.Citi also warned of losses of up to $3 billion tied to Russia.Related: Citigroup In Talks With Potential Buyers For Russia Retail Ops: Bloomberg.Berkshire bought $7.7 billion worth of shares in oil and gas company Occidental Petroleum Corporation (NYSE: OXY) and boosted its stake in Chevron Corporation (NYSE: CVX)Price Action: C shares traded higher by 5.35% at $50 premarket on the last check Tuesday.https://finance.yahoo.com/news/warren-buffett-exits-wells-fargo-112402820.htmlIt looks as if a big housing price correction could be on the way. If loan and mortgage numbers are anything to go by. For volumes to decline that significantly implies residents are having difficulty affording rent and mortgage payments. Stocks being what they are, even Warren Buffett appears to be having difficulty finding places to stash his considerable wealth. Buffett sold his holdings in Wells Fargo to buy Citigroup bank instead. But citibank is warning of losses tied to russia and is known for losing value in 2022.Wouldn't it be ironic if a scenario arises where Warren Buffett would have achieved better ROI on his portfolio had he invested in crypto instead? Considering the high volatility of the current market. And the unpredictable nature of supply chain disruptions and the ukraine crisis having disproportionately negative effects on business. It certainly is not a farfetched scenario that Buffett might actually lose wealth in 2022. Assuming he hasn't already. I think most long term stock players are behind in this bear market to recession. Will we live to see crypto outperform stocks?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422036",
  "comments": [
    {
      "author": "avikz",
      "created_time": "June 12, 2023, 04:30:07 PM",
      "body": "Warren Buffet is a smart old man and has a huge experience in the financial world. So he just sold out his Wella Fargo portfolio and entered into Citi group which holds a much diverse loan book. Even though the market cap of Well Fargo is bigger than Citi, it has diversified it's risks better. Nonetheless, the world is going into a recession for sure. The housing market will see a huge decline worldwide. Many other mortgage based companies have started firing their workforce. Better.com has done it again. Don't know what's waiting for us in 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "June 12, 2023, 08:18:13 PM",
      "body": "Quote from: avikz on June 12, 2023, 04:30:07 PMWarren Buffet is a smart old man and has a huge experience in the financial world. So he just sold out his Wella Fargo portfolio and entered into Citi group which holds a much diverse loan book. Even though the market cap of Well Fargo is bigger than Citi, it has diversified it's risks better. Nonetheless, the world is going into a recession for sure. The housing market will see a huge decline worldwide. Many other mortgage based companies have started firing their workforce. Better.com has done it again. Don't know what's waiting for us in 2024. Yep, the pain threshold of the mortgage rate for developed countries is at the level of about 5%, and with the growth of key rates, it has already been overcome or is close to that in all EU countries, the USA and the UK. There is some time lag, for example in the UK fixed rate mortgages are recalculated after 2 or 5 years, but there is no time lag for new mortgages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 13, 2023, 04:46:48 AM",
      "body": "I read this post and was confused until i realized that I got bumped from November. Because I remember reading this story before a few months ago.Either way, it’s common sense why this is happening. Prices of homes are almost at record highs and interest rates are almost at 20 decades highs. So who exactly wants to get an expensive mortgage? No one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 13, 2023, 11:10:08 AM",
      "body": "The real estate market always reacts badly to global crises. The reason is banal - strongly developed lending for the sale of real estate, which is highly susceptible to the risks of reduced solvency of the population, regarding the repayment of loans. Today's crisis (Kovid, the terrorist war unleashed by Russia, the global energy crisis, the problems of the global economies) - all this has led to a decrease in income and solvency of the population. And expectedly affected the gigantic market of real estate liabilities.  I assume that the solution to the problem will coincide with a recovery from the global world crisis, and it will take 2-3 years (an optimistic forecast)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 13, 2023, 03:21:53 PM",
      "body": "I mean when the interest rates increase this much, what did people expected? You can't buy a 30 year house mortgage with 7-10% rates, that's just way too much, and some even offer as high as 15-20% depending on your credit score.It was a lot better before the inflation and FED raising the rates, and that meant there was a period in history where people would buy 25 year mortgages with 0.99% rate, can you believe that? I would buy 10 houses for that rate lol, well technically I can't but I would definitely sell my house and get 3-4 houses worth my house and just rent them out and hope that would be enough (would be screwed on months where I can't get rent though). So loans are not going to be taken by anyone at these rates just yet, we are going to wait it to go down again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slapper",
      "created_time": "June 14, 2023, 11:09:55 AM",
      "body": "Quote from: el kaka22 on June 13, 2023, 03:21:53 PMI mean when the interest rates increase this much, what did people expected? You can't buy a 30 year house mortgage with 7-10% rates, that's just way too much, and some even offer as high as 15-20% depending on your credit score.It was a lot better before the inflation and FED raising the rates, and that meant there was a period in history where people would buy 25 year mortgages with 0.99% rate, can you believe that? I would buy 10 houses for that rate lol, well technically I can't but I would definitely sell my house and get 3-4 houses worth my house and just rent them out and hope that would be enough (would be screwed on months where I can't get rent though). So loans are not going to be taken by anyone at these rates just yet, we are going to wait it to go down again.It's a daunting era for homebuyers navigating these extremely interest rates. Envisage being saddled with a 7-10% mortgage, not to mention 15-20%? It's quite dauntingDon't view the 0.99% era with undue nostalgia. That period, while apparently serene, bred its own issues, didn't it? Didn't it lay the groundwork for overborrowing and fiscal woes?Your plan to buy multiple homes at low rates and rent them is innovative, but isn't it fraught with dangers? What about periods of vacancy or sudden repair bills?Although a wait-and-see policy on loans seems sensible now, isn't it vital to note the economy's fluidity?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}