{
  "id": "topic_5449445",
  "title": "Bureau",
  "author": "Bureau",
  "created_time": "April 19, 2023, 01:37:30 PM",
  "content": "As we all know Bisq provides P2P trading for Bitcoin and has BTC/INR pair. The problem is on that pair we have zero request either to buy or sell Bitcoin. So, how can we solve this problem? I found a solution to it which might have been hidden or lost on this board. As I feel we do not have many users active on our board. Otherwise someone might have actually talked about it. I was going through all the sub boards and found there was a topic started by @elevates. I guess no one noticed it, I assume it was to encourage everyone to use Bisq. I am quoting the thread below. I feel it would help Indians who are aware of Bitcoin or other crypto but doesn't have a clue about a platform which can hide their identity completely. Start trading on Bisq if you want to save taxIn my opinion you never know when suddenly the government would say \"your earning from bounty, airdrop and other income is to be taxed at the rate of 30 percent.Thanks.P.S - Please ignore my typo and mispell.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449445",
  "comments": [
    {
      "author": "elevates",
      "created_time": "April 19, 2023, 01:44:27 PM",
      "body": "I created that thread in the month of March. I have received zero application regarding it. I assumed that none of my Indian brothers & sisters are interested in saving money from tax. I also feel this might be an issue of less active members. Although compared to what this board was in February we did increase the activity. I also feel if we are able to get Bisq up with your post, then we would have more sellers than buyers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "April 20, 2023, 02:14:21 PM",
      "body": "Quote from: elevates on April 19, 2023, 01:44:27 PMI created that thread in the month of March. I have received zero application regarding it. I assumed that none of my Indian brothers & sisters are interested in saving money from tax. I also feel this might be an issue of less active members. Although compared to what this board was in February we did increase the activity. I also feel if we are able to get Bisq up with your post, then we would have more sellers than buyers. Till now I don't see any response on that thread after creating this topic. This is hilarious as everyone wants to trade on P2P exchanges with no KYC. They have full believe that the seller/ buyer is not someone who is being tracked by NIA or CBI for illegal activities. The faith is so deep that they forgot that the local bank account used to send money in INR might not be of someone illegal and that it is being tracked. What you did was to give confidence to those who might be still using a local exchange and feared about the same.Still zero traction on your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "April 20, 2023, 02:18:28 PM",
      "body": "Not a big issue. I did not think so deepnwhile posting that topic. What I wanted was to help others who were not happy with the tax. Thanks to you and the clarification given by webtricks I think it is okay if none of our members post a reply. Thanks once again for creating awareness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}