{
  "id": "topic_5463111",
  "title": "tw0.625",
  "author": "tw0.625",
  "created_time": "August 13, 2023, 11:18:33 AM",
  "content": "Would the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463111",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 13, 2023, 11:22:24 AM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  Satoshi is worth Nobel Prize in economics. People know Ethereum founders and most other altcoins. They are not in prison today but they are reputed people and celebrities.Satoshi did not commit any crime but helped the world to discover blockchain which is useful all over the world as of today. He deserves Nobel prize in economics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 13, 2023, 11:33:28 AM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  Both of them is what will happen to him,because if the problem and head ache that bitcoin has put the government into by making people to see that fiat is not to be trusted or relied on. 1. He will be put to jail because the government must have called him to give them access to be able to manipulate bitcoin,that is making a back door for access and if he refuses, this is where the problem will start from. He might have been killed by now.2. He will be given a noble price is the government allows him to live freely amongst citizens,because what he created gives financial freedom to people,if they can give altcoins devs noble prizes. Satoshi own will be more than a noble price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "August 13, 2023, 11:45:04 AM",
      "body": "I don't think there is any law that can be use to put Satoshi in jail, and there is no motive to for the US Government to throw satoshi in jail. Bitcoin is decentralized, Satoshi has no control over it. What more likely to happened is that he will be hunted by cartel or mafia so they can take his supposedly 1M Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big kid",
      "created_time": "August 13, 2023, 11:59:09 AM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  Why exactly the US? Maybe he's not there. I think this is one of many reasons why he will never reveal himself. Too many people, including big ones, will want to ask him questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "August 13, 2023, 12:05:54 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? What reason could the government put him in jail? If they can do it with Satoshi, why don't they put Vitalik Buterin or CZ in jail? I don't think they will put him in jail but instead they will make him work for them with his wits. But whatever theory is put forward, it won't happen because I believe he will never appear again. It is good for him as well as for the future of bitcoin, Bitcoin would be more perfect without Satoshi even though he is the creator of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 13, 2023, 12:10:25 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  I do not think Satoshi would ever reveal his identity ever. If he does, for sure he’ll be a priority target of various governments and banks.Worse is that the criminals will do a massive hunt on Satoshi if he were able to reveal himself in the future. They might force him to hand over his “keys of the kingdom” and take advantage of the entire Bitcoin network. We do not even know if Satoshi still exists until today. For sure the halving period was already programmed by him the day it was deployed and cannot be stopped until the last BTC is mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "August 13, 2023, 12:11:24 PM",
      "body": "Quote from: icalical on August 13, 2023, 11:45:04 AMI don't think there is any law that can be use to put Satoshi in jail, and there is no motive to for the US Government to throw satoshi in jail. Bitcoin is decentralized, Satoshi has no control over it. What more likely to happened is that he will be hunted by cartel or mafia so they can take his supposedly 1M Bitcoin. He would owe back taxes on the coins he mined",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 13, 2023, 01:03:19 PM",
      "body": "Good and bad things can happen in that case. Big institutions are already thriving on the concept of blockchain and Bitcoin either separately, sideways, or together. There is no way such VIP will be arrested just right away and there is no reason because he just created a technology and it's being used by various organizations today and this also includes various government authorities. If they come to an agreement of arresting Satoshi then they would have to shut down all their official operations that run on a blockchain and may take down every CEO and owner of the crypto project around the world. I think happening of this has got really tiny chance. If it does then the public would stand against this decision and there would be riots everywhere from the fans of Satoshi/bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "August 13, 2023, 01:12:53 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  Did you read the article about Craig Wright? Actually, he is Craig False and he is not a Satoshi Nakamoto, he is an Aussie liar.Quote from: _act_ on August 13, 2023, 11:22:24 AMSatoshi is worth Nobel Prize in economics. People know Ethereum founders and most other altcoins. They are not in prison today but they are reputed people and celebrities.Satoshi did not commit any crime but helped the world to discover blockchain which is useful all over the world as of today. He deserves Nobel prize in economics.He worth it but he may not get it because for majority of people, Bitcoin is seen as evil, a currency that's used to fund terrorism and illegal activities, governments try to make it look appear like this, so, while it's true that he didn't commit any crime and if anything, really helped the world to discover blockchain technologies and made steps that gave us possibility to integrate decentralized system, no, he won't get a Nobel Prize in economics, at least in near future (let's assume he appears). But I'm afraid he is dead or if not, his appearance will be the news of the century.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "August 13, 2023, 01:47:53 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  There is no reason for the government to imprison him, Satoshi did nothing wrong, he never asked anyone to use Bitcoin, the fact that Bitcoin began to be adopted in parts of the world voluntarily. Satoshi will win the Nobel Prize in Economics, even more than that. Bitcoin issued by Satoshi is very useful for the whole world, the convenience offered by Bitcoin has exceeded other institutions issued by the government. If Satoshi reveals his identity, the government will send representatives to learn more about blockchain from him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 13, 2023, 01:54:34 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 12:11:24 PMQuote from: icalical on August 13, 2023, 11:45:04 AMI don't think there is any law that can be use to put Satoshi in jail, and there is no motive to for the US Government to throw satoshi in jail. Bitcoin is decentralized, Satoshi has no control over it. What more likely to happened is that he will be hunted by cartel or mafia so they can take his supposedly 1M Bitcoin. He would owe back taxes on the coins he minedIt depends if Satoshi is a US citizen or not. US has a lot to file case against Satoshi in case he is a US citizen and I doubt Satoshi will reveal himself if he is indeed from US.Quote from: legendbtc on August 13, 2023, 12:05:54 PMWhat reason could the government put him in jail? If they can do it with Satoshi, why don't they put Vitalik Buterin or CZ in jail?Because Vitalik and CZ is not from US. The only reason why CZ is having trouble with US Sec is because he accepts US customer to his exchange. US Sec jurisdiction is not globally and they can't sue anyone that is not their citizen or doesn't operate under their jurisdiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "August 13, 2023, 01:57:45 PM",
      "body": "QuoteSatoshi revealed his identity...Some click bait, well played  For a second  thought we were back with Craig Wright at the helm of the topic Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  I don't think it's as easy as it sounds to just arrest anyone out of the blues, especially that he isn't a US citizen ..Besides on what grounds would this arrest be based on?? Is he some terrorist or international criminal...don't think so!! Let the man enjoy his freedom!!!Btw, arresting Satoshi will be as good as arresting any car manufacturer's CEO because one of its car brands was involved in a heist or something which doesn't even make any sense, you break the law using BTC...you are on your own!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "August 13, 2023, 01:58:23 PM",
      "body": "Quote from: dimonstration on August 13, 2023, 01:54:34 PMQuoteHe would owe back taxes on the coins he minedIt depends if Satoshi is a US citizen or not. US has a lot to file case against Satoshi in case he is a US citizen and I doubt Satoshi will reveal himself if he is indeed from US.Quote from: legendbtc on August 13, 2023, 12:05:54 PMWhat reason could the government put him in jail? If they can do it with Satoshi, why don't they put Vitalik Buterin or CZ in jail?Because Vitalik and CZ is not from US. The only reason why CZ is having trouble with US Sec is because he accepts US customer to his exchange. US Sec jurisdiction is not globally and they can't sue anyone that is not their citizen or doesn't operate under their jurisdiction.This precisely proves that Satoshi is a US citizen. In any other case, he would most likely have revealed his identity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "August 13, 2023, 03:44:13 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 01:58:23 PMQuote from: dimonstration on August 13, 2023, 01:54:34 PMQuoteHe would owe back taxes on the coins he minedIt depends if Satoshi is a US citizen or not. US has a lot to file case against Satoshi in case he is a US citizen and I doubt Satoshi will reveal himself if he is indeed from US.Quote from: legendbtc on August 13, 2023, 12:05:54 PMWhat reason could the government put him in jail? If they can do it with Satoshi, why don't they put Vitalik Buterin or CZ in jail?Because Vitalik and CZ is not from US. The only reason why CZ is having trouble with US Sec is because he accepts US customer to his exchange. US Sec jurisdiction is not globally and they can't sue anyone that is not their citizen or doesn't operate under their jurisdiction.This precisely proves that Satoshi is a US citizen. In any other case, he would most likely have revealed his identity.If that's the case, Satoshi will certainly change nationality that has nothing to do with the US country This would make him unable to be prosecuted by the US government.But I didn't think Satoshi would reveal his identity. What did he do it for? Money, popularity or seeking the thrill that he is the real Satoshi?Satoshi will remain anonymous, and we only know who he really is once he tells the world that he is the real Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "August 13, 2023, 03:57:22 PM",
      "body": "Am very sure Satoshi would win a Nobel price for the remarkable success of the BTC cryptocurrency. Since his idea enforced the creation of other decentralized coins, it would cause a serious cause for concern if any government were to arrest him for having such a brilliant idea and seeing it to implementation and adoption. I hardly doubt this would happen because the name Satoshi is more of an acronym rather a real identity of an individual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "August 13, 2023, 04:12:01 PM",
      "body": "Most likely neither of those two options would happen.  I do hope that Satoshi identity never gets revealaed as I think its one of the (many) advantages Bitcoin has over  other cryptocurrencies and I honestly don't understand why bitcoiners like to deal with that subject. I mean, majority of bitcoiners thought about it at one point (most likely when they just got into it) but other than that, I see no point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "August 13, 2023, 04:26:56 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  Why they will? As if not many business benefits of his creation, also just like other said altcoin creators are still there and wasn't imprisoned. Even the creator of monero which is a privacy coin that many uses for alleged crimes is still there and was employed on some company. Satoshi getting a nobel prize is a huge possibility but it dont think will matter to him/her anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "August 13, 2023, 05:27:53 PM",
      "body": "Quote from: tw0.625 on August 13, 2023, 11:18:33 AMWould the US authorities put him in prison? Or would he win the Nobel Prize in Economics?Or both options?  Why should the US put Satoshi in prison? He never did anything illegal, he just created something, that's it. If what Satoshi created was somehow illegal probably many countries would have already banned it several years ago but nothing happened except in some countries with particular governments like China or some middle eastern countries. I just don't understand why people keep thinking that bitcoin is somehow illegal or wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "August 13, 2023, 05:37:23 PM",
      "body": "Quote from: Ale88 on August 13, 2023, 05:27:53 PMWhy should the US put Satoshi in prison? He never did anything illegal, he just created something, that's it. If what Satoshi created was somehow illegal probably many countries would have already banned it several years ago but nothing happened except in some countries with particular governments like China or some middle eastern countries. I just don't understand why people keep thinking that bitcoin is somehow illegal or wrong.He would owe back taxes on the coins he mined",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}