{
  "id": "topic_5400638",
  "title": "oj010209",
  "author": "oj010209",
  "created_time": "May 29, 2022, 06:18:41 PM",
  "content": "Has the next bitcoin halving have to be close to 4 yrs or it could skip 4 yr cycle to any other number. Is that mathematically possible  ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400638",
  "comments": [
    {
      "author": "bitbollo",
      "created_time": "May 29, 2022, 06:25:56 PM",
      "body": "Each halving should take in place after 210000 blocks.Each block is produced in 10 minutes, and this time its adapted to guarantee always 10 minutes as time of production each 2016 blocks.That's why you will have so far this prediction of 4 years for each halving (maybe some days as difference more or less).Actually is been estimated for 17 March 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 29, 2022, 06:53:32 PM",
      "body": "Quote from: oj010209 on May 29, 2022, 06:18:41 PMHas the next bitcoin halving have to be close to 4 yrs or it could skip 4 yr cycle to any other number. Is that mathematically possible  ?Bitcoin halving will occur at every 210000 block hight, not every 4 years. But, because transaction is 10 minutes on average in which new block is mined, this should take appropriately 4 years to reach the next 210000 block height. Mining hashrate can increase or reduce in a way the 10 minute average block mined can be affected, but this is correct at every 2016 blocks in which the mining difficulty is adjusted in a way new blocks are mined every10 minutes on average.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 29, 2022, 06:54:58 PMLast edit: May 29, 2022, 07:08:03 PM by hosseinimr93",
      "body": "All previous halvings occurred in less than 4 years and the next halving will be probably the same. The first halving occurred in 3 years, 10 months, 25 days after genesis block.The second halving occurred in 3 years, 7 months, 11 days after fist halving.The third halving occurred in 3 years, 10 months, 2 days after second halving. At the time I am writing this post, 108,469 blocks have been mined after third halving. These blocks have been mined in 747 days, 23 hours and 30 minutes. This means that every block has been mined in 9 minutes and 55 seconds on average. So, the next having will probably occur in less than 4 years too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "May 30, 2022, 02:04:45 AM",
      "body": "Quote from: oj010209 on May 29, 2022, 06:18:41 PMHas the next bitcoin halving have to be close to 4 yrs or it could skip 4 yr cycle to any other number. Is that mathematically possible  ?Bitcoin tracks time in a different way than what we're used to. Instead of seconds, or years, etc, Bitcoin uses blocks. Time started in Genesis, when the first block was mined by Satoshi Nakamoto. Then, miners all around the world started trying to find the next block. Once one block is found, time increases in one unit. This is block-time.You can see different events expressed in block-time here: https://timeinblocks.comEach halving event is expressed in block-time, so every 210,000 blocks the new reward era starts, with half the rewards from the previous era.Also worth noting, every 2016 blocks the difficulty is re-calibrated so that, on average, new blocks are found roughly every 10 minutes.If you're interesting in reading more about Bitcoin and time, I recommend you to read this: Bitcoin is time: https://dergigi.com/2021/01/14/bitcoin-is-time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 30, 2022, 02:19:29 AM",
      "body": "4 years is only estimation and exact halving days will be sooner or later than 4 years, from days to months. You can check dates of previous three halvingsQuotePast halving event datesThe first halving event occurred on the 28th of November, 2012 (UTC) at block height 210,000The second halving event occurred on the 9th of July, 2016 (UTC) at block height 420,000The third halving event occurred on the 11th of May, 2020 (UTC) at block height 630,000Additionally, there is a Bitcoin Block Reward Halving Countdown from https://www.bitcoinblockhalf.com/ as well as other sites. It's reasonable to see different estimations from different sites  https://coinmarketcap.com/halving/bitcoin/https://www.coingecko.com/en/explain/bitcoin_halvinghttps://www.buybitcoinworldwide.com/bitcoin-clock/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 30, 2022, 03:46:17 AM",
      "body": "My understanding is that the rules on Bitcoin is cast in stone. The arithmetic which was translated into codes is beyond alteration. So I guess that is not mathematically possible. However, the mathematical formula on Bitcoin halving indicates 210,000 blocks, and not 4 years, before the reward is divided into two. That is hard-coded. That's not gonna change. And since Bitcoin moves in blocks and not days and years, there's no definite time when the halving occurs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 30, 2022, 03:55:44 AM",
      "body": "Quote from: bitbollo on May 29, 2022, 06:25:56 PMEach block is produced in 10 minutes, wrongQuote from: Charles-Tim on May 29, 2022, 06:53:32 PMBut, because transaction is 10 minutes on average..the 10 minute average block wrongQuote from: Charles-Tim on May 29, 2022, 06:53:32 PMbut this is correct at every 2016 blocks in which the mining difficulty is adjusted in a way new blocks are mined every10 minutes on average.correct(though emphasis is on the 2016 blocks per fortnight, not the 'blocks per 10min')..halvings RULE occur every 210,000 blocksthe math and RULE of the blocks is where its attempts to average 2016 blocks every fortnight. by adjusting the difficulty to make it easier or harder to make 2016 blocks a fortnight.separately in human interpretation(but not in codified rule)on average this then for HUMAN easy to describe conversation(but not the hard rule). is then described(but not the hard rule) of 4 years per halving and 10min per blockso although the '10 minute' philosophy is not exact. and the '4 year' philosophy is not exact. nothing can break the rules of the 2016blocks per 14 day average. thus there is no 'skipping' a halving. there is just a possible delay/acceleration of the exact date of the halvingbut this delay/acceleration is not whole years/decades of delay/acceleration of halving. its more like hours/days weeks delay/acceleration of halving date",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "May 30, 2022, 03:57:56 AM",
      "body": "Quote from: Darker45 on May 30, 2022, 03:46:17 AMMy understanding is that the rules on Bitcoin is cast in stone. The arithmetic which was translated into codes is beyond alteration. So I guess that is not mathematically possible. However, the mathematical formula on Bitcoin halving indicates 210,000 blocks, and not 4 years, before the reward is divided into two. That is hard-coded. That's not gonna change. And since Bitcoin moves in blocks and not days and years, there's no definite time when the halving occurs. There are theoretical scenarios in which a halving would take longer than 4 years though.For example, the current difficulty is very high, and it gets adjusted every 2016 blocks. So, imagine that something huge happens and somehow all ASICs on earth are no longer working for whatever reason. If you only have more primitive miners, and a small amount of them, you still need to mine those 2016 blocks or whatever was left to actually re-calibrate the difficulty.If that change in difficulty is massive, then it would take much longer than roughly 2 weeks to get to the difficulty re-calibration, potentially years. An event like that would delay the halving, so it would happen later than the expected 4 years.Note that this is pretty much never going to happen, but it's technically possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 30, 2022, 04:14:51 AM",
      "body": "Quote from: nullama on May 30, 2022, 03:57:56 AMThere are theoretical scenarios in which a halving would take longer than 4 years though.For example, the current difficulty is very high, and it gets adjusted every 2016 blocks. So, imagine that something huge happens and somehow all ASICs on earth are no longer working for whatever reason. If you only have more primitive miners, and a small amount of them, you still need to mine those 2016 blocks or whatever was left to actually re-calibrate the difficulty.If that change in difficulty is massive, then it would take much longer than roughly 2 weeks to get to the difficulty re-calibration, potentially years. An event like that would delay the halving, so it would happen later than the expected 4 years.Note that this is pretty much never going to happen, but it's technically possible.current difficulty: 29,897,409,688,833with a max drop of 75% / fortnight. would take 23 fortnights to drop to difficulty of: 1meaning the 'delay' if all asics stopped and things went back to CPU mining of a difficulty of 1 would take a little over 10 months. again this is not where we would see a 'skipping' of a halving where it misses a whole 4 year cycle. just a delay of about a year or less from its estimated previous date",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojengonggu",
      "created_time": "May 30, 2022, 04:27:32 AM",
      "body": "Quote from: nullama on May 30, 2022, 03:57:56 AMQuote from: Darker45 on May 30, 2022, 03:46:17 AMMy understanding is that the rules on Bitcoin is cast in stone. The arithmetic which was translated into codes is beyond alteration. So I guess that is not mathematically possible. However, the mathematical formula on Bitcoin halving indicates 210,000 blocks, and not 4 years, before the reward is divided into two. That is hard-coded. That's not gonna change. And since Bitcoin moves in blocks and not days and years, there's no definite time when the halving occurs. There are theoretical scenarios in which a halving would take longer than 4 years though.For example, the current difficulty is very high, and it gets adjusted every 2016 blocks. So, imagine that something huge happens and somehow all ASICs on earth are no longer working for whatever reason. If you only have more primitive miners, and a small amount of them, you still need to mine those 2016 blocks or whatever was left to actually re-calibrate the difficulty.If that change in difficulty is massive, then it would take much longer than roughly 2 weeks to get to the difficulty re-calibration, potentially years. An event like that would delay the halving, so it would happen later than the expected 4 years.Note that this is pretty much never going to happen, but it's technically possible.That's what all of us are afraid of when the halving lasts up to 4 years, so that's a very long time we are waiting for so that investors will take another step to a safer place, for example they go to stocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 30, 2022, 04:44:59 AM",
      "body": "Quote from: oj010209 on May 29, 2022, 06:18:41 PMHas the next bitcoin halving have to be close to 4 yrs or it could skip 4 yr cycle to any other number. Is that mathematically possible  ?I think its possible. The cycle continues to 4 years since the investors are only few of the population on the entire world but if we're going up to billions accessing the crypto market, the 4 year cycle may be ignored when the billions of us continue buying while we all know the only way to get out of inflation thru the continues printing is thru buying BTC. And not just buying but merchants all over including the stores around the corner are accepting BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "May 30, 2022, 07:01:52 AM",
      "body": "It would happen next 2 years 2024 from now and it would not skip at all, it was already on the algorithm to proceed with the halving no matter what. That year gonna be exciting to look forward too because it is the next cycle of bull seasons and for sure its gonna be a happy year for us in the crypto industry. For now, we have to render and survive the bearish market seasons and accumulate more assets while in dip market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "May 30, 2022, 07:25:04 AM",
      "body": "It's estimated to happen within the next 2 years earlier than May and I don't think that it's possible that a 3/4 year scheduled cycle can be skipped.Quote from: bittraffic on May 30, 2022, 04:44:59 AMI think its possible. The cycle continues to 4 years since the investors are only few of the population on the entire world but if we're going up to billions accessing the crypto market, the 4 year cycle may be ignored when the billions of us continue buying while we all know the only way to get out of inflation thru the continues printing is thru buying BTC. And not just buying but merchants all over including the stores around the corner are accepting BTC.He's asking about the technicality of halving and not about its effect with billions of investors. And what I think that you're talking about is the bull run that comes every cycle after the halving.Just for the reference to OP and anybody: https://www.bitcoinblockhalf.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 30, 2022, 07:57:34 AM",
      "body": "Quote from: bittraffic on May 30, 2022, 04:44:59 AMI think its possible. The cycle continues to 4 years since the investors are only few of the population on the entire world but if we're going up to billions accessing the crypto market, the 4 year cycle may be ignored...............The (approximately) four year halving period has been programmed in bitcoin's code and has nothing to do with number of investors. Whether people buy bitcoin or not, whether mining power increases or decreases, the block reward is reduced by 50% after every 210,000 blocks (which is estimated to take 4 years).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 30, 2022, 01:27:32 PM",
      "body": "Quote from: franky1 on May 30, 2022, 03:55:44 AMthe math and RULE of the blocks is where its attempts to average 2016 blocks every fortnight.I mean, if we are going to pedantic, then the rule is actually targeting 2015 blocks per 2 weeks because of an error in the code.Quote from: franky1 on May 30, 2022, 04:14:51 AMmeaning the 'delay' if all asics stopped and things went back to CPU mining of a difficulty of 1 would take a little over 10 months.This is incorrect and nullama is correct. If all ASICs stopped, then we would still be mining at the current difficulty with a vastly reduced hashrate until we could hit the the next retargeting. This could take months or even years depending on just how low the new hashrate is, just to hit the first retargeting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "May 31, 2022, 04:14:21 PM",
      "body": "Its not exact because of the time it takes to re-adjust the difficulty, but its quite close regardless. A success IMO. There have been things like China kicking miners out and it wasn't a big deal. Whatever occurs, happens gradually enough to never be a problem.Just like blocks are roughly found every 10 minutes, the halving occurs roughly every 4 years.Unless its a cataclysmic event where internet or electricity is gone but then you would be more worried about actually surviving it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "May 31, 2022, 04:41:18 PM",
      "body": "Quote from: oj010209 on May 29, 2022, 06:18:41 PMHas the next bitcoin halving have to be close to 4 yrs or it could skip 4 yr cycle to any other number. Is that mathematically possible  ?Is it mathematically possible for such a bad luck streak that the having takes 8 years instead of 4?  Sure.  Is it realistically possible?  No.  Maybe some sort of solar flare taking out the electronics on earth could put blocks on hold, or maybe the government bans Bitcoin and ISPs shut down all crypto activity on their networks.  That might cause a delay in solving blocks until a solution could be widespread.  If any of these things happen though, Bitcoin would probably be worthless, so you'd have other things to worry about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}