{
  "id": "topic_5468498",
  "title": "OcTradism",
  "author": "OcTradism",
  "created_time": "September 29, 2023, 01:21:54 AM",
  "content": "Bitcoin was created by Satoshi Nakamoto and its genesis block was mined on 3 January 2009 since that its adoption has been growing very exponentially and with some given charts, you can see its outperform many others in history like the Internet.The projection is Bitcoin will get 1 billion users within half of a time which was needed for Internet to get that milestone.WillyWoo has a Bitcoin inflation chart the visually displays a sharp decline of Bitcoin monetary inflation and its future supply. With bigger adoption, more demand and less future supply as it can be seen the inflation chart, price has to move up in future.If you are still worry about it, The bullish case for Bitcoin will wipe out your fear and uncertainty.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468498",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 29, 2023, 04:56:51 AM",
      "body": "As much as I am bullish on bitcoin, I don't think it will reach 100% or near 100% adoption, as is the case with the internet today. I think it will be more like gold, that everyone has, has had, or knows someone who has some gold, but not everyone owns gold, even a little bit of it. It will be the same with bitcoin. That adoption will grow a lot I am sure, and that we are at an early stage, despite the feeling that many of us have of being late, too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 29, 2023, 06:21:36 AM",
      "body": "are the first 2 charts (rate of adoption and trust/time) based on any data or are they just wishful drawings by the author?Overall, an interesting thread and thanks for sharing the data. As an element for discussion, I would like to ask the question whether the Internet is appropriate to compare to Bitcoin, because it must be remembered that the Internet needed infrastructure to develop (cables, modems, network cards). Bitcoin only needs an app on your phone to start using it. So it should come as no surprise that what took the internet 7.5 years took Bitcoin only 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "September 29, 2023, 06:24:04 AM",
      "body": "Quote from: Don Pedro Dinero on September 29, 2023, 04:56:51 AMAs much as I am bullish on bitcoin, I don't think it will reach 100% or near 100% adoption, as is the case with the internet today.Nothing is perfect in life. Not Internet, not Bitcoin, not gold, not anything from governments and their centralized governance. I don't expect a rosy future with perfect adoption for Bitcoin like 100% rate, it's unrealistic belief that I don't have in my mind.QuoteI think it will be more like gold, that everyone has, has had, or knows someone who has some gold, but not everyone owns gold, even a little bit of it. It will be the same with bitcoin. That adoption will grow a lot I am sure, and that we are at an early stage, despite the feeling that many of us have of being late, too.I agree with you and it is good if everywhere on this planet, people can at least know about Bitcoin. Like something they can read, hear and see everywhere by locals or on media. That is good enough and we don't actually need everyone on the planet to use bitcoin. It is impossible because with many options, some will not choose bitcoin like we are all know about gold but not all of us actually have ever own gold or make any investment or exchange with gold.Quote from: Tytanowy Janusz on September 29, 2023, 06:21:36 AMare the first 2 charts (rate of adoption and trust/time) based on any data or are they just wishful drawings by the author?The first chart is general, you can get the idea from this article. I attached links of those images from source tweets. It is from the tweet.Innovation adoption curveThe second chart is not based on any data, just imagination to explain with time, Bitcoin will be stronger.In the article (published as a book too), the chart is used with idea of Lindy effect. You can google search and read about Lindy effect that explains if something can survive with time, a longer survival it has, a likely stronger Lindy effect and Bitcoin is on that direction.Lindy effect or Lindy's lawQuoteOverall, an interesting thread and thanks for sharing the data. As an element for discussion, I would like to ask the question whether the Internet is appropriate to compare to Bitcoin, because it must be remembered that the Internet needed infrastructure to develop (cables, modems, network cards). Bitcoin only needs an app on your phone to start using it. So it should come as no surprise that what took the internet 7.5 years took Bitcoin only 4Did you miss that Bitcoin network and blockchain must have some physical inputs like ASICs (miners), not only nodes, and other infrastructures for mining farms to be a lively network and blockchain?I think it's fair enough to say both Internet and Bitcoin network must have physical infrastructures to operate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 29, 2023, 06:43:52 AM",
      "body": "Quote from: OcTradism on September 29, 2023, 06:24:04 AMDid you miss that Bitcoin network and blockchain must have some physical inputs like ASICs (miners), not only nodes, and other infrastructures for mining farms to be a lively network and blockchain?I think it's fair enough to say both Internet and Bitcoin network must have physical infrastructures to operate.It's good that you brought this up. there will be no misunderstandings. Is it possible for the number of bitcoin users to grow 10x without an increase in the number of asic miners? Theoretically yes. Bitcoin's computing power defends it against attacks, but the number of bitcoin transactions per second does not depend on the computing power of miners. There is no system that would physically stop a new user from joining the network. If you wanted to have the Internet in 2000, you had to wait until they installed cable. If you want to use bitcoin in 2023, just download the application, you don't have to wait for a miner to launch a new mining unit especially for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 29, 2023, 01:15:35 PM",
      "body": "Quote from: OcTradism on September 29, 2023, 01:21:54 AMThe projection is Bitcoin will get 1 billion users within half of a time which was needed for Internet to get that milestone.~snip~I would call it just one kind of optimism under the question mark as to how realistic something like that is at all. Comparing Bitcoin with the internet or gold doesn't make much sense to me personally, because gold is something that has been an integral part of human history for thousands of years and people have always seen it as something valuable, of course in the last hundred or more years much more than before.The internet, on the other hand, is something that enables people to communicate, perform various tasks, have fun, among other things, and is actually emerging as one of the basic human needs nowadays.Let's ask ourselves where is Bitcoin in that story? From 2009 to today, research shows that somewhere around 2% of people globally own Bitcoin, which brings us to some 150 million people (although I think that number is much lower). Therefore, we are still quite far from a billion, and the process of \"adaptation\" within the framework of decentralization is going very slowly, considering that the authorities generally have a negative attitude towards Bitcoin because it represents nothing but competition to them.What I want to say is that the internet is a completely different story and is no longer (if it ever was) an alternative, but it is considered that everyone should have access to it - and such an initiative has never existed when it comes to Bitcoin, and I don't believe that will ever exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 29, 2023, 02:22:38 PM",
      "body": "Quote from: Lucius on September 29, 2023, 01:15:35 PMQuote from: OcTradism on September 29, 2023, 01:21:54 AMThe projection is Bitcoin will get 1 billion users within half of a time which was needed for Internet to get that milestone.~snip~I would call it just one kind of optimism under the question mark as to how realistic something like that is at all. Comparing Bitcoin with the internet or gold doesn't make much sense to me personally, because gold is something that has been an integral part of human history for thousands of years and people have always seen it as something valuable, of course in the last hundred or more years much more than before.The internet, on the other hand, is something that enables people to communicate, perform various tasks, have fun, among other things, and is actually emerging as one of the basic human needs nowadays.Let's ask ourselves where is Bitcoin in that story? From 2009 to today, research shows that somewhere around 2% of people globally own Bitcoin, which brings us to some 150 million people (although I think that number is much lower). Therefore, we are still quite far from a billion, and the process of \"adaptation\" within the framework of decentralization is going very slowly, considering that the authorities generally have a negative attitude towards Bitcoin because it represents nothing but competition to them.What I want to say is that the internet is a completely different story and is no longer (if it ever was) an alternative, but it is considered that everyone should have access to it - and such an initiative has never existed when it comes to Bitcoin, and I don't believe that will ever exist.Bitcoin may not be as common as gold or the internet, but does it have value? You stated delayed adaptation and official doubt were harmful. This may be a benefit since it allows us time to consider whether decentralization and authority can coexist.Not many people use Bitcoin, but didnt the internet start that way? Remember that even the internet started as a niche utility and spread globally. The current use of Bitcoin is slow, but that wont last. It has time to improve, fit in, and find its place in our environment because the tech is young.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 29, 2023, 02:34:12 PM",
      "body": "The infographic says bitcoin is set to get 1 billion users by 2025, however there is a difference between having a billion bitcoin users and a billion internet users. Using bitcoin could also be counted as just owning a bitcoin without making a transaction in the process, however an internet user can just be counted as someone who is connected to the internet or has their browser open and is ready to do a search, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "September 29, 2023, 02:39:53 PM",
      "body": "Quote from: OcTradism on September 29, 2023, 01:21:54 AMBitcoin was created by Satoshi Nakamoto and its genesis block was mined on 3 January 2009 since that its adoption has been growing very exponentially and with some given charts, you can see its outperform many others in history like the Internet.The projection is Bitcoin will get 1 billion users within half of a time which was needed for Internet to get that milestone.WillyWoo has a Bitcoin inflation chart the visually displays a sharp decline of Bitcoin monetary inflation and its future supply. With bigger adoption, more demand and less future supply as it can be seen the inflation chart, price has to move up in future.If you are still worry about it, The bullish case for Bitcoin will wipe out your fear and uncertainty.Bitcoin will always remain that same volatile cryptocurrency we know it to have always been and despite the market sentiments of all time we do have whereby the price go dip, we still experience the breaking forth limit over the resistant for the market to pump and we keep having all time high each time we are over each stage of halving, next season will not be an exception, the market will rise and the demand as well and the value also increases, bitcoin is not a currency to begin to fear on missing out because it has always been consistent in this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "September 29, 2023, 03:14:59 PM",
      "body": "I don't think the internet should be used as a comparison to Bitcoin in this context. They're not similar at all. Bitcoin wouldn't exist without the internet so for this context can't compare. Bitcoin can be compared with fiat currency and gold. There's a relationship between the adoption of the Internet and the adoption of Bitcoin. If the internet had not been adopted like it is today, Bitcoin would have seen very little adoption too. Also, Bitcoin will never see the level of adoption that the internet has seen. I don't see that happening, maybe in another lifetime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "September 30, 2023, 04:04:35 AM",
      "body": "Quote from: Alpha Marine on September 29, 2023, 03:14:59 PMI don't think the internet should be used as a comparison to Bitcoin in this context. They're not similar at all. Bitcoin wouldn't exist without the internet so for this context can't compare. Internet won't exist if there is no electricity and if there is no access to Satellite Internet like what SpaceX is providing for Ukraine. Do you see your thinking is not logic at all.No single thing can exist and operate well without relationship with others including Internet and Bitcoin so your thinking is weak here.QuoteBitcoin can be compared with fiat currency and gold. You can compare them if you want to do this but if you want to say, it is not similar enough to compare with each other, it's true too.Quote from: NotATether on September 29, 2023, 02:34:12 PMThe infographic says bitcoin is set to get 1 billion users by 2025, however there is a difference between having a billion bitcoin users and a billion internet users. Using bitcoin could also be counted as just owning a bitcoin without making a transaction in the process, however an internet user can just be counted as someone who is connected to the internet or has their browser open and is ready to do a search, etc.Thank you for bringing this.I know and the methodology and criteria to identify Bitcoin users are unknown. Like we can not know what Bitcoin address belong to who and one person can have many Bitcoin wallets, many Bitcoin addresses.The comparison is roughly and it is helpful to create positive thinking about future of Bitcoin, impression on how it grows. I don't think I need exact number and comparison here but truth is the comparison is not an exact one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xampeuu",
      "created_time": "September 30, 2023, 05:30:16 AM",
      "body": "the bullish case for bitcoin makes it easier for bitcoin to become known to the wider public, if there is a bullish season it will produce new successful people, and they can be an example for others to also adopt bitcoin, so that more and more people need it, and this can increase demand so that the price becomes higher, but before adopting it, of course having knowledge is the main capital so that you don't regret it in the end",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 30, 2023, 08:00:36 AM",
      "body": "On what basis was Bitcoin compared to global growth, gold, or the Internet, and what prevents us from comparing it with Apple, the stock market, or even the prices of real estate and products such as eggs and onions? If we make all these comparisons, we may not find that Bitcoin is in the process of growth, and even comparing it to the dollar has major flaws. Bitcoin is unique, and when you compare it, the comparison must be with something similar, such as cryptocurrencies, or comparing its growth with something unique at the moment of its launch, such as websites in their infancy or a new technology in the process of growth, and even this comparison does not necessarily mean that the price will rise.In Bitcoin, we cannot know the number of real users. All we can track is the number of addresses, and our best guess is that we will get them from the database of the central platforms. This base does not represent the number of Bitcoin users, but it may represent the minimum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 30, 2023, 10:24:21 AM",
      "body": "Quote from: Blitzboy on September 29, 2023, 02:22:38 PMBitcoin may not be as common as gold or the internet, but does it have value? You stated delayed adaptation and official doubt were harmful. This may be a benefit since it allows us time to consider whether decentralization and authority can coexist.There is no doubt that Bitcoin has a value that is clearly expressed on the market at all times, but there is also another value that is not measured in dollars or euros, but in the possibilities that Bitcoin provides to those who know how to use it in the right way. Most of the people with whom I had the opportunity to talk about Bitcoin over the years still think that it is some kind of internet scam, most of those who bought it as an investment see it only as a tool for making profit, and a minority experience it as a decentralized cryptocurrency.For each of them, the \"value\" in the context of Bitcoin is completely different, and also if the values of the internet or gold are included in the same story.Quote from: Blitzboy on September 29, 2023, 02:22:38 PMNot many people use Bitcoin, but didnt the internet start that way? Remember that even the internet started as a niche utility and spread globally. The current use of Bitcoin is slow, but that wont last. It has time to improve, fit in, and find its place in our environment because the tech is young.Why didn't many people use the internet when it appeared? Well, to begin with, computers were expensive, there were no smartphones or infrastructure that would bring the internet to people. Does Bitcoin have that problem today? Of course not, because anyone with a smartphone and internet access can download a free BTC wallet, create their own seed and buy BTC in any way that suits them best.If you take all that into account, then it is clear that in a year or two or even more than that, we cannot expect that the number of real Bitcoin users will increase by x10 if we take into account that today there are between 100 and 150 million users globally, although this is only an assumption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "September 30, 2023, 11:09:37 AM",
      "body": "Quote from: Lucius on September 29, 2023, 01:15:35 PMQuote from: OcTradism on September 29, 2023, 01:21:54 AMThe projection is Bitcoin will get 1 billion users within half of a time which was needed for Internet to get that milestone.~snip~I would call it just one kind of optimism under the question mark as to how realistic something like that is at all. Comparing Bitcoin with the internet or gold doesn't make much sense to me personally, because gold is something that has been an integral part of human history for thousands of years and people have always seen it as something valuable, of course in the last hundred or more years much more than before.The internet, on the other hand, is something that enables people to communicate, perform various tasks, have fun, among other things, and is actually emerging as one of the basic human needs nowadays.Let's ask ourselves where is Bitcoin in that story? From 2009 to today, research shows that somewhere around 2% of people globally own Bitcoin, which brings us to some 150 million people (although I think that number is much lower). Therefore, we are still quite far from a billion, and the process of \"adaptation\" within the framework of decentralization is going very slowly, considering that the authorities generally have a negative attitude towards Bitcoin because it represents nothing but competition to them.What I want to say is that the internet is a completely different story and is no longer (if it ever was) an alternative, but it is considered that everyone should have access to it - and such an initiative has never existed when it comes to Bitcoin, and I don't believe that will ever exist.A similar thought came to mind after seeing the chart where they are comparing Gold, internet and Bitcoin altogether. Bitcoin is an innovative technology and it has the potential to touch unimaginable milestone but it hasn't become a basic human needs. Gold is natural and that can not be cloned or made possible to create a better alternative of it. On the other hand bitcoin was invented by a human and through technological advancement something better could emerge in the future. We cannot deny the fact. They have already been trying this to achieve for a very long time thats why we are seeing already 1000 new blockchain was created after bitcoin till now.Another fact is that most people who own even a small amount of bitcoin don't know how to use it. Most of the bitcoin owners consider it a store of value like gold, or an asset to make profits. Most of them don't care about decentralization and that is why we saw people use banking channels to on-ramp and off-ramp to bitcoin due to a lack to any convenient methods to use it as true decentralized money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "October 01, 2023, 07:53:40 AM",
      "body": "Quote from: Yamane_Keto on September 30, 2023, 08:00:36 AMOn what basis was Bitcoin compared to global growth, gold, or the Internet, and what prevents us from comparing it with Apple, the stock market, or even the prices of real estate and products such as eggs and onions? If we make all these comparisons, we may not find that Bitcoin is in the process of growth, and even comparing it to the dollar has major flaws.With whatever ways and criteria you use for comparison, Bitcoin actually has good growth and you can not find anything to prove it has not grown since 2009.The argument only can be whether Bitcoin has a best, fastest growth rate in history in comparison with other things like Internet, gold, stocks, real estates. I don't need to have a consensus agreement from all people on it, because it is impossible to have everyone accepts Bitcoin as well as have same thinking about it. But agree or disagree, the fact is always fact, Bitcoin has been growing a lot since 2009. It does not need to be compared with other things as figures of bitcoin used addresses, on-chain transaction volume, trading volume are already enough show its growth.Quote from: Lucius on September 30, 2023, 10:24:21 AMWhy didn't many people use the internet when it appeared? Well, to begin with, computers were expensive, there were no smartphones or infrastructure that would bring the internet to people. Does Bitcoin have that problem today? Of course not, because anyone with a smartphone and internet access can download a free BTC wallet, create their own seed and buy BTC in any way that suits them best.Requirements to use bitcoin through a non custodial wallet is not big like to have a computer, Internet in like 1990s or 2000s. Today to have a smart phone is no longer a lucrative asset like 10 years ago and it is more accessible for more people.However, it is still challenge for some people who have difficulty in finance and in some nations like in Africa continent, having access to the Internet is still challenging for the poor and where with war conflicts and battles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 01, 2023, 10:16:13 AM",
      "body": "These so-called curves are a matter of scale and perspective. It's easy to misrepresent the situation this way and to argue for various incompatible positions.It's impossible to know how far-reaching Bitcoin adoption will be. We might be near a start, but it can easily be somewhere around the peak.It also misses important differences. Gold is something many people own but don't actively use, unless it's jewellery or something. The Internet is something people don't own but actually use, and tons of people use it every day for many hours. Bitcoin is more mysterious in that regard and somewhere in the middle, since it can be used, but sometimes people just own it, much like gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "October 02, 2023, 10:47:57 AM",
      "body": "Quote from: kryptqnick on October 01, 2023, 10:16:13 AMThese so-called curves are a matter of scale and perspective. It's easy to misrepresent the situation this way and to argue for various incompatible positions.It's impossible to know how far-reaching Bitcoin adoption will be. We might be near a start, but it can easily be somewhere around the peak.It also misses important differences. Gold is something many people own but don't actively use, unless it's jewellery or something. The Internet is something people don't own but actually use, and tons of people use it every day for many hours. Bitcoin is more mysterious in that regard and somewhere in the middle, since it can be used, but sometimes people just own it, much like gold.You brought an interesting opinion.I never thought of it before. Owning but don't use. Using but don't own longer than need to use it. In between both owning and using it at the same time, it's Bitcoin. It's an interesting opinion and shows that Bitcoin is flexible enough for daily use and it can help Bitcoin to gain more adoption. It also explains how Bitcoin can have faster adoption than Gold or Internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 02, 2023, 11:32:53 AM",
      "body": "Quote from: Alpha Marine on September 29, 2023, 03:14:59 PMI don't think the internet should be used as a comparison to Bitcoin in this context. They're not similar at all. Bitcoin wouldn't exist without the internet so for this context can't compare. Bitcoin can be compared with fiat currency and gold. I do agree with you on this, and I'll add that the comparison is incongruent in the sense that we can't buy and accumulate the internet but we can do so with bitcoin, and gold.There's no transactional technicality or a rise and fall in price value with the internet, but all these are common with bitcoin and gold.  Etc.QuoteThere's a relationship between the adoption of the Internet and the adoption of Bitcoin. If the internet had not been adopted like it is today, Bitcoin would have seen very little adoption too. Also, Bitcoin will never see the level of adoption that the internet has seen. I don't see that happening, maybe in another lifetime.If we're to be frank with our expectations on bitcoin as bitcoin maximalists we'll all agree that the level of adoption and usage the internet has acquire for itself over the years since it's invention it's one of the invention that's next to non in terms of adoption and bitcoin for me is still in it's nursery stage and therefore has many decades to cover to gain such enormous adoption as the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "October 02, 2023, 12:19:37 PM",
      "body": "Quote from: Lida93 on October 02, 2023, 11:32:53 AMQuote from: Alpha Marine on September 29, 2023, 03:14:59 PMI don't think the internet should be used as a comparison to Bitcoin in this context. They're not similar at all. Bitcoin wouldn't exist without the internet so for this context can't compare. Bitcoin can be compared with fiat currency and gold. I do agree with you on this, and I'll add that the comparison is incongruent in the sense that we can't buy and accumulate the internet but we can do so with bitcoin, and gold.There's no transactional technicality or a rise and fall in price value with the internet, but all these are common with bitcoin and gold.  Etc.Although the comparison between bitcoin and the internet is inappropriate, what the OP is saying is that bitcoin has similar importance to the internet. Maybe people will be skeptical and skeptical about bitcoin, but eventually everyone will need bitcoin. Let us put the value aside, and look at the importance of both, clearly both have some similarities. The world today cannot lack the internet and in the future bitcoin may be the same.Quote from: Lida93 on October 02, 2023, 11:32:53 AMQuoteThere's a relationship between the adoption of the Internet and the adoption of Bitcoin. If the internet had not been adopted like it is today, Bitcoin would have seen very little adoption too. Also, Bitcoin will never see the level of adoption that the internet has seen. I don't see that happening, maybe in another lifetime.If we're to be frank with our expectations on bitcoin as bitcoin maximalists we'll all agree that the level of adoption and usage the internet has acquire for itself over the years since it's invention it's one of the invention that's next to non in terms of adoption and bitcoin for me is still in it's nursery stage and therefore has many decades to cover to gain such enormous adoption as the internet.Everything is just in its infancy, a revolution that changes the world takes a lot of time and can last hundreds of years, we should not rush to assert anything when bitcoin is only 14 years old.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}