{
  "id": "topic_5468105",
  "title": "shohag999",
  "author": "shohag999",
  "created_time": "September 26, 2023, 12:03:15 AM",
  "content": "I use a buy sell bot into tradingview.Is enough for trading?any special method to prevent loss in crypto market?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468105",
  "comments": [
    {
      "author": "mk4",
      "created_time": "September 26, 2023, 01:10:27 AM",
      "body": "Your post sounds like:I started a restaurant in California.Is enough for business?any special method to prevent loss in business?We can't give any answers because:1. We don't know what bot you're using2. We don't know what indicators/strategies you're using3. We don't know what pairs you're actually trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 26, 2023, 01:21:07 AM",
      "body": "do you fully understand trading?If you are using bots without understanding the true science of trading then don't do it, you will not grow you need basic knowledge. Besides, trading bots today cannot be fully trusted, especially if you use free trading bots. Try to list what bots you want to use.There is really no specific method, you just need to understand how the bot works and what you need to know to trade. I saw some trading bots on Tradingviewhttps://tradingview.com/scripts/tradingbot/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "September 26, 2023, 08:29:25 AM",
      "body": "Quote from: shohag999 on September 26, 2023, 12:03:15 AMI use a buy sell bot into tradingview.Is enough for trading?any special method to prevent loss in crypto market?Well yes depends on how you use it. There's a MA bot on Tradingview telling you to buy or sell on any specific level. Most use it alone, some add something to it like Volume divergence or RSI overbought and oversold. The main thing is, it's not a matter of which one does work for the other traders. What works for me might not work for others. I might have a working strategy but you won't follow it because it doesn't fit your idea of trading. It is about what works for your own niche and interest.You will only know it does work for you when you have a data. So it's also about hardwork and efficiency of work. That's also how you will build confidence in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "September 26, 2023, 09:46:15 AM",
      "body": "Quote from: shohag999 on September 26, 2023, 12:03:15 AMI use a buy sell bot into tradingview.Is enough for trading?any special method to prevent loss in crypto market?First and foremost, it is a given that you will not lose money when trading. Second, your assertions are insufficient to address your question at hand. You omitted to describe the type of trading bot; perhaps it is an AI bot. Do you simply let the trading bot do what you do because you are too lazy to trade yourself?I believe it would be better if you simply used the funds you bought for the trading bot for the copy trading that is offered in Mexc, Bitget, and other places if you feel physically sluggish while trading here in cryptocurrency or Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "September 26, 2023, 09:50:51 AM",
      "body": "Quote from: taufik123 on September 26, 2023, 01:21:07 AMdo you fully understand trading?If you are using bots without understanding the true science of trading then don't do it, you will not grow you need basic knowledge. Besides, trading bots today cannot be fully trusted, especially if you use free trading bots. Try to list what bots you want to use.There is really no specific method, you just need to understand how the bot works and what you need to know to trade. I saw some trading bots on Tradingviewhttps://tradingview.com/scripts/tradingbot/Plus if OP expects that he'll get a profitable script to run a bot, he'll obviously be very VERY disappointed. I'm confident that the scripts being sold or shared around in the internet are NOT profitable. Because why would anyone sell or share his/her Golden Goose? Sharing his/her own trading strategy would open it to a counterstrategy that would make it stop being profitable.The market is also dynamic from cycle to cycle. A currently profitable strategy might not be profitable during another phase of the cycle. But as Bitcoin investors, how do we formulate a counterstrategy for that? Simple, just HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "September 26, 2023, 11:12:37 AM",
      "body": "Quote from: shohag999 on September 26, 2023, 12:03:15 AMI use a buy sell bot into tradingview.Is enough for trading?any special method to prevent loss in crypto market?You didn't explain in details the kind of bot you used for your trading, even though you trade manually their is every tendency that you will lose, because in trading two things are involved in trading, either you lose or you gain, some people like you prefer using bot applications for trading in which the bot applications can disappoint you at any given point in time, so therefore their is no assurance from my perspective that with bot you can prevent lose in trading but you will have a limitations of lose and also have a limitations of getting profit when you use bot applications to trade but in the aspect of you getting prevented not to lose that means everyone who is into trading wouldn't have be using manual to trade since bot can prevent losing in trading. My advice for you is that you have to ensure you understand or comprehend the rudiments of Trading manually and also bot before venturing into Trading with large amounts of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "September 26, 2023, 11:48:59 AM",
      "body": "Quote from: shohag999 on September 26, 2023, 12:03:15 AMI use a buy sell bot into tradingview.Is enough for trading?any special method to prevent loss in crypto market?I came in with the same assumptions as the others. Before people do something, they usually understand because they have knowledge about the types of tools used, including bots, in trading. IMO, you just say that you are already using bots and ask the community is it enough?This will confuse the community.Trading using bots and trading manually, there will be profits and losses. The most important thing is the method and strategy in trading to minimize trading risks.Using bots cannot guarantee that you will always be on the lucky side in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 26, 2023, 01:31:23 PM",
      "body": "Using a bot doesn't guaranteed your asset is secured or doesn't mean you won't lose your trade, at the main time it will help to control your stop lose but it doesn't guaranteed that your asset is secure why because the bot may malfunction and trade against your choice causing a serious damage to your account which you can't bear. Normally anyone who is venturing into trading newly are not encouraged to start using bots rather should developed themselves on how to trade by their selves rather than exploring bots to their trading account. Sometimes it's very risky and if you actually fund heavily and its malfunction then be rest assured that your equity could get drained by the bot whenever there seems to be technical issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 26, 2023, 03:09:34 PM",
      "body": "Quote from: Wind_FURY on September 26, 2023, 09:50:51 AMPlus if OP expects that he'll get a profitable script to run a bot, he'll obviously be very VERY disappointed. I'm confident that the scripts being sold or shared around in the internet are NOT profitable. Because why would anyone sell or share his/her Golden Goose? Sharing his/her own trading strategy would open it to a counterstrategy that would make it stop being profitable.The market is also dynamic from cycle to cycle. A currently profitable strategy might not be profitable during another phase of the cycle. But as Bitcoin investors, how do we formulate a counterstrategy for that? Simple, just HODL.That's good, basic logic. Someone would not give away their money-making machine for free and without any deductions. They must have given a bot script that has been modified so that it is not more powerful than the original, let alone a free bot.There are many cases of bot users who end up complaining about the performance of the bot used, even though it is paid, and see how the bot will work if the market is not good, is in a critical period. HODL is the best way to be able to make big profits in the long run with minimal risk without the need to pay attention to the constantly changing charts. It is not wrong to use trading bots, what is wrong is when they are trusted completely without having any limitations, or warning signs of basic knowledge. Even new investors with fresh money enter using bots, and it will be a delicious meal for the hungry market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asyakashi",
      "created_time": "September 26, 2023, 07:08:11 PM",
      "body": "Using a trading bot does not mean avoiding losses. bots are useful for you in carrying out trading actions. they help you look for signals on a basic basis (not that it's one hundred percent accurate). then they trade as best as they can as robots. It is still possible that losses will occur. some robots even have to provide a stop loss feature otherwise they will lose more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 26, 2023, 11:27:40 PM",
      "body": "Basing your question OP, it looks like you don't have much knowledge about trading. I suggest you thoroughly learn how to trade before you think about even using trading bots. The idea of trading bots is to automate your trading strategyIn trading, expect losses at any point. If you fear losses, do not trade at all, then because trading is all about taking risk and managing the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "September 27, 2023, 10:29:38 AM",
      "body": "Quote from: taufik123 on September 26, 2023, 03:09:34 PMQuote from: Wind_FURY on September 26, 2023, 09:50:51 AMPlus if OP expects that he'll get a profitable script to run a bot, he'll obviously be very VERY disappointed. I'm confident that the scripts being sold or shared around in the internet are NOT profitable. Because why would anyone sell or share his/her Golden Goose? Sharing his/her own trading strategy would open it to a counterstrategy that would make it stop being profitable.The market is also dynamic from cycle to cycle. A currently profitable strategy might not be profitable during another phase of the cycle. But as Bitcoin investors, how do we formulate a counterstrategy for that? Simple, just HODL.That's good, basic logic. Someone would not give away their money-making machine for free and without any deductions. They must have given a bot script that has been modified so that it is not more powerful than the original, let alone a free bot.There are many cases of bot users who end up complaining about the performance of the bot used, even though it is paid, and see how the bot will work if the market is not good, is in a critical period. HODL is the best way to be able to make big profits in the long run with minimal risk without the need to pay attention to the constantly changing charts. It is not wrong to use trading bots, what is wrong is when they are trusted completely without having any limitations, or warning signs of basic knowledge. Even new investors with fresh money enter using bots, and it will be a delicious meal for the hungry market.Plus it's the same with paid trading courses, trading books, and paid trading groups. Why would a truly profitable trader teach anyone how to be better at trading? If everyone become a better trader, then that would mean lesser profit for the winning traders because for every loser, there's a winner. Less losers = less winners. Although, there are good books about trading, such as \"The Market Wizards\" books and other classic trading books like \"Reminiscences of a Stock Operator\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "September 27, 2023, 12:18:45 PM",
      "body": "Quote from: shohag999 on September 26, 2023, 12:03:15 AMI use a buy sell bot into tradingview.Is enough for trading?any special method to prevent loss in crypto market?Trading bots are made for people who doesn't know how to trade. But I believe that it works best to people really know how to trade but doesn't have enough time. If you're just relying your trade in bot, in the long run your funds might get liquidated. It's because the market will not always do the way it did before, sometimes the market are difficult to understand so that if you let your bot running in this situation it will just risk your capital. That's why for me, it's best to have knowledge in trading if you want to use bot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 27, 2023, 12:55:10 PM",
      "body": "Quote from: shohag999 on September 26, 2023, 12:03:15 AMI use a buy sell bot into tradingview.Is enough for trading?any special method to prevent loss in crypto market?You should explain what type of bots you are using and your strategy for trading. I am not sure if TradingView supports trading bots, as I know it is an indicator-heavy platform. If you are using any third-party platform like 3commas, then be careful about its security. There was already some security concern about this type of 3rd party application, though they can be useful because of their variety of bots and other features.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "September 27, 2023, 08:54:46 PM",
      "body": "OP, it seems you wanted to make a straight-to-post topic, but unfortunately it's not well informative, and just like the first comment describes, I am also of the same opinion with him: before you can get better advice on your topic, make it more constructive and add more contents to the topics.Altogether, since you are talking about using bots in your trading, I will advise that you should at least know the basics of trading, make sure you know how to trade manually on your own to make profit before you can apply any sort of bot; otherwise, you will experience more loss. But if you know how to trade on your own, even when you use a bot, you should be able to decide which one is more profitable, either you or the bot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 27, 2023, 09:56:27 PM",
      "body": "Quote from: Wind_FURY on September 27, 2023, 10:29:38 AM-snip-I'm the type of person who doesn't really enjoy reading books and only sees visually. learn from various sources. But reading books like the trading book \"The Market Wizard\" so it's a pretty good way. Although there are many private trading courses that provide trading classes and various kinds of trading tips, it will not be the place to produce new traders. Traders are not only judged by how they trade, but the psychology of trading is the main reason why trading can lose and gain because psychology is very influential. The final result is also determined by trading psychology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "September 28, 2023, 09:01:24 PM",
      "body": "First of all you have not made your point clearly.  You didn't say which bot you are using. And how much you understand about trading is also unclear. If you don't have a complete idea about trading, then I would say not to use bots.  If you use the bot without knowing its proper usage, you can face a lot of loss.  There are several types of bots.  The pros and cons depend on which one you use.  But I would say to use your intelligence instead of using bots in trading, trust yourself.  How much better will a robot understand?  I don't think boter will work on your sense.  Bots can often invest in places where you are not interested in investing.  But then the matter will no longer be in your hands.  Above all I would say if you make your point clear then you can be helped in the right way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 28, 2023, 11:40:33 PM",
      "body": "Quote from: taufik123 on September 27, 2023, 09:56:27 PMTraders are not only judged by how they trade, but the psychology of trading is the main reason why trading can lose and gain because psychology is very influential. The final result is also determined by trading psychology. If OP also believes that he lacks the judgment to execute his trading strategy, maybe using a bot is not a bad idea. Then again he told too little to make meaningful suggestions specific to his context. On the other hand, running a bot and understanding technical analysis is also different. He definitely needs more than just clicking a \"run\" button if he wants to use a bot.Quote from: |MINER| on September 28, 2023, 09:01:24 PMHow much better will a robot understand?  I don't think boter will work on your sense.  Bots can often invest in places where you are not interested in investing.  But then the matter will no longer be in your hands.  AFAIK most trading bots allow users to customize the settings. Unless OP uses a terrible bot on a terrible exchange, he should be able to set-up a cut-loss setting/trailing stop or something similar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 29, 2023, 10:29:10 AM",
      "body": "Quote from: joniboini on September 28, 2023, 11:40:33 PMIf OP also believes that he lacks the judgment to execute his trading strategy, maybe using a bot is not a bad idea. Then again he told too little to make meaningful suggestions specific to his context. On the other hand, running a bot and understanding technical analysis is also different. He definitely needs more than just clicking a \"run\" button if he wants to use a bot.-snip-Technical analysis is the foundation and running a bot requires trading knowledge. No matter what form a trading Bot takes, it cannot be run by simply clicking the \"Run\" button. There are some Bot adjustments that can be made. But I don't know if the OP wants to use a fully automatic BOT without making any settings anymore. The use of Bots is not a bad idea when the strategy is no longer reliable or used to help make trading work less burdensome and relieve stress on trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}