{
  "id": "topic_5462615",
  "title": "Al-Qisaer",
  "author": "Al-Qisaer",
  "created_time": "August 09, 2023, 08:21:11 AM",
  "content": "شريت عملة قبل 10 اشهر صار قيمتها التقريبي 300 مليار السيولية قليله في العملة وابغا ابيعها لو 2 ميلون دولار هل في طريقة ؟؟",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462615",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "August 09, 2023, 08:54:27 AM",
      "body": "300 مليار دولار أما ماذا؟ ما هي هذه العملة وعلى أي منصة موجودة؟ إذا لم يكن هناك سيولة على العملة فلاتتعب نفسك، على الاغلب شيتكوين لا قيمة لها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Al-Qisaer",
      "created_time": "August 09, 2023, 09:06:01 AM",
      "body": "BUGSBUNNY  بان كيك سواب",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 09, 2023, 05:33:03 PM",
      "body": "أخي هذه عملة سكام ، انظر إلى السيولة في الصورة حوالي 0.17$ !!!!يعني لا أمل لك في بيعها                          مؤكد أن هذه العملة من نوع سحب البساط يعني يرفعون سعرها ثم يقومون بسحب كل السيولة ويتركون المشترين غير قادرين على البيع. على كل حال اتركها للزمن في المحفظة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 09, 2023, 11:57:56 PM",
      "body": "للأسف اخي، كلام الأخ يحيى صحيح.العملة التي لديك ليس لها أي قيمة و لا يمكنك بيعها نظرا لكونه لا يوجد أي شخص يرغب في شرائها. ارجو ان لا تكون قد استمرت مبلغا كبيرا فيها و لم تشتري كميات كبيرة منها.في المرة القادمة حاول أن تبحث أكثر قبل الاستثمار في اي عملة لتفادي الوقوع ضحية لمثل هؤلاء المتحيل ين.هناك قسم للعملات البديلة يمكنك أن تطرح فيه استفسارات و تسأل عن أي عملة قبل الاستثمار فيها حتى يقوم الأخوة مساعدتك و ربما تنبيه ان كانت هناك أي علامات لامكانية التحيل.بالتوفيق لك.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "August 10, 2023, 12:14:43 AM",
      "body": "Quote from: khaled0111 on August 09, 2023, 11:57:56 PMهناك قسم للعملات البديلة يمكنك أن تطرح فيه استفسارات و تسأل عن أي عملة قبل الاستثمار فيها حتى يقوم الأخوة مساعدتك و ربما تنبيه ان كانت هناك أي علامات لامكانية التحيل.بالتوفيق لك. للأسف هو بالفعل قد طرح الاستفسار في قسم العملات البديلة اليوم وفي أقسام مختلفة لطلب المشورة بعد فوات الأوان ولمحاولته وجود مشتر يشترى الكمية التي لديه من هذه العملة بهذا السعر الضخم لأنه بالفعل قد قام بشرائها منذ شهور عديدة لهذا أتمنى أن يكتسب خبرة ويجرى أبحاثه ولا يتردد في طلب المشورة قبل القيام بأي قرار استثماري المرة القادمة، وخاصة في العملات الميمية، صاحب الموضوع الآن ليس لديه خياراً إلا الاحتفاظ بهذه العملة الإحتيالية وتجاهلها تماماً فإنه لا يستطيع نقلها أو بيعها فهي عملة لا قيمة لها ولا أعتقد أنه من الممكن أن تكتسب سيولة في المستقبل أو أن  يستطيع استرداد المبلغ الذي قام بشرائها فيها لأن سيولة العملة الآن قد قام منشؤها المحتالين بسحبها تماماً وأموال المستثمرين بها وسحبوا البساط من أسفلهم. حزين لخسارته وأتمنى أن يكون قد تعلم الدرس ولا يقوم بشراء أي عملة تم ترويجها في تويتر أو من قبل أي مؤثر.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}