{
  "id": "topic_5464080",
  "title": "chigo",
  "author": "chigo",
  "created_time": "August 21, 2023, 08:38:09 PM",
  "content": "assalamualaikum, saya sangat tertarik membuat topik ini karena tak sengaja membaca berita heboh ini dan merasa was was dengan kenaikan harga beras yang mungkin saja akan terjadi jika negara negara pengekspor bahan pokok seperti beras menghentikan ekspor mereka terutama di indonesia karena negara kita masih bergantung pada ekspor beras dari negara lainnya.QuoteLarangan Ekspor Beras India, Bikin Perut Keroncongan di Banyak NegaraKeputusan India melarang ekspor beras dengan alasan kepentingan domestik ternyata memiliki dampak global. Dunia masih tergantung pada beras, termasuk Indonesia, yang produksinya tahun ini terganggu El Nino. Kini harga beras dunia pun terkerek naik.Baca Lebih:https://www.inilah.com/larangan-ekspor-beras-india-bikin-perut-keroncongan-di-banyak-negarauntuk agan agan sekalian yang ingin memantau pergerakan harga komoditi bisa lihat di situs ini, namun harga nya bisa berbeda dengan yang ada di pasar swalayan.Pantau disini: http://infoharga.bappebti.go.id/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464080",
  "comments": [
    {
      "author": "Juse14",
      "created_time": "August 21, 2023, 10:22:01 PM",
      "body": "Quote from: chigo on August 21, 2023, 08:38:09 PMassalamualaikum, saya sangat tertarik membuat topik ini karena tak sengaja membaca berita heboh ini dan merasa was was dengan kenaikan harga beras yang mungkin saja akan terjadi jika negara negara pengekspor bahan pokok seperti beras menghentikan ekspor mereka terutama di indonesia karena negara kita masih bergantung pada ekspor beras dari negara lainnya.QuoteLarangan Ekspor Beras India, Bikin Perut Keroncongan di Banyak NegaraKeputusan India melarang ekspor beras dengan alasan kepentingan domestik ternyata memiliki dampak global. Dunia masih tergantung pada beras, termasuk Indonesia, yang produksinya tahun ini terganggu El Nino. Kini harga beras dunia pun terkerek naik.Baca Lebih:https://www.inilah.com/larangan-ekspor-beras-india-bikin-perut-keroncongan-di-banyak-negarauntuk agan agan sekalian yang ingin memantau pergerakan harga komoditi bisa lihat di situs ini, namun harga nya bisa berbeda dengan yang ada di pasar swalayan.Pantau disini: http://infoharga.bappebti.go.id/Cukup heran jika Indonesia sebagai negara agraris dan memiliki tanah yang subur ditambah dengan lahan pertanian yang cukup luas, akan tetapi hasil pertaniannya masih belum cukup untuk memenuhi kebutuhan masayarakat dan memenuhi cadangan pangan pemerintah sehingga harus melakukan impor dari negara lain. Yaa.. tapi inilah Indonesia tanahnya subur dan kaya raya tapi masyakatnya kurang sejahtera.Menurut saya, terkait kebijakan negara India tentang pelarangan impor beras, tidak terlalu mengkhawatirkan dan tidak usah membuat kita menjadi gelisah karena kebijakan tersebut. Dan perlu kita ketahui bahwa India bukanlah negara satu-satunya yang melakukan impor beras ke indonesia. India hanyalah salah satunya dan India bukan pula pemasok terbesar terhadap kebutuhan beras negara kita. Untuk saat ini pasokan beras terbesar untuk Indonesia diperoleh dari negara tetangga yaitu Thailand dan Vietnam. bahkan pemerintah kita sudah dari jauh-jauh hari, menentukan untuk mengakhiri kontrak Impor beras dari India",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "August 22, 2023, 04:31:37 AM",
      "body": "Quote from: chigo on August 21, 2023, 08:38:09 PMassalamualaikum, saya sangat tertarik membuat topik ini karena tak sengaja membaca berita heboh ini dan merasa was was dengan kenaikan harga beras yang mungkin saja akan terjadi jika negara negara pengekspor bahan pokok seperti beras menghentikan ekspor mereka terutama di indonesia karena negara kita masih bergantung pada ekspor beras dari negara lainnya.Waalaikumsalam, Harga suatu produk, apa pun itu jenisnya, berdasar pada basic economic yaitu Supply dan Demand, apa pun itu, jika supply terbatas dan permintaan banyak, harga pasti naik. Produksi beras di Indonesia tidak mencukupi kebutuhan hidup rakyatnya sendiri, oleh karena itu, pemerintah meng-impor beras dari negara lain. Sehingga kalau negara peng-impor beras men-stop pengirimannya, tentu membuat supply jadi terbatas, sedangkan permintaan tetap sehingga jelas akan membuat harga beras naik.Untuk mengatasinya, pemerintah harus tetap menyamakan supply seperti sebelumnya. bagaimana pun caranya, mau mereka mencari impor dari negara lain, atau pun produksi sendiri. Sebenarnya lebih bagus berdikari, tapi ya pemerintah harus benar-benar fokus mensejahterahkan petani dan bikin mereka nyaman hdup walau pencariannya hanya bertanam padi. Kalau sekarang kan petani malah harus bersaing dengan beras impor, jelas sulit, karena apa pun mahal, baik itu pupuk, bibit dan segala macam kebutuhannya.Negara Indonesia ini masih berkiblat ke negara barat, padahal negara barat itu minim sumber daya sehingga apa apa kebutuhan mereka harus impor, sedangkan Indonesia, sumber daya banyak, tanah subur, hijau, basah, tropis, sampeyan tanam kayu pun bakal jadi pohon tanpa diapa-apain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "August 24, 2023, 10:53:08 AM",
      "body": "Quote from: chigo on August 21, 2023, 08:38:09 PMassalamualaikum, saya sangat tertarik membuat topik ini karena tak sengaja membaca berita heboh ini dan merasa was was dengan kenaikan harga beras yang mungkin saja akan terjadi jika negara negara pengekspor bahan pokok seperti beras menghentikan ekspor mereka terutama di indonesia karena negara kita masih bergantung pada ekspor beras dari negara lainnya.Saya tidak terkejut dengan berita semacam ini karena dari apa yang saya lihat (khususnya untuk negara kita Indonesia), para warga negara Indonesia tidak akan kelaparan atau kesulitan untuk mendapatkan beras sebagai makanan pokok mereka sehari-hari karena sawah dan ladang yang ada di negara kita Indonesia masih lumayan banyak sehingga hasil panen dan produksi beras di Indonesia masih lumayan banyak dan hal itu masih cukup membuat para masyarakat Indonesia untuk mendapatkan beras dengan harga yang tidak mahal. Apalagi kalau sebagian para penduduk Indonesia yang ada di desa-desa dan pinggiran kota masih sangat senang untuk bertani dan bercocok tanam demi bisa mengonsumsinya serta menghasilkan uang dari pekerjaan mereka. Jadi berita itu mungkin tidak akan begitu terpengaruh untuk negara kita Indonesia, kecuali untuk negara-negara yang produksi berasnya masih sangat kecil atau negara-negara yang sawah dan ladang mereka tidak bisa di fungsikan lagi untuk bercocok tanam om.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "August 24, 2023, 11:40:03 AM",
      "body": "Quote from: CageMabok on August 24, 2023, 10:53:08 AMSaya tidak terkejut dengan berita semacam ini karena dari apa yang saya lihat (khususnya untuk negara kita Indonesia), para warga negara Indonesia tidak akan kelaparan atau kesulitan untuk mendapatkan beras sebagai makanan pokok mereka sehari-hari karena sawah dan ladang yang ada di negara kita Indonesia masih lumayan banyak sehingga hasil panen dan produksi beras di Indonesia masih lumayan banyak dan hal itu masih cukup membuat para masyarakat Indonesia untuk mendapatkan beras dengan harga yang tidak mahal. Apalagi kalau sebagian para penduduk Indonesia yang ada di desa-desa dan pinggiran kota masih sangat senang untuk bertani dan bercocok tanam demi bisa mengonsumsinya serta menghasilkan uang dari pekerjaan mereka. Jadi berita itu mungkin tidak akan begitu terpengaruh untuk negara kita Indonesia, kecuali untuk negara-negara yang produksi berasnya masih sangat kecil atau negara-negara yang sawah dan ladang mereka tidak bisa di fungsikan lagi untuk bercocok tanam om.saya sering membeli kebutuhan pokok rumah tangga terutama beras, saat ini harga beras di tempat saya sekitar 14 ribu rupiah, itu kualitas yang menengah padahal 2 bulan lalu kalo saya tidak salah harga beras yang biasa saya beli hanya sekitar 11500 rupiah, itu berarti harga nya naik beberapa persen, ketika saya tanya ke pedagang langganan saya alasan di balik kenaikan beras ini dia mengatakan beras lagi payah di dapat, musim kemarau dan lain sebagainya namun saya tidak yakin apakah alasan itu tepat.indonesia sejauh ini masih ketergantungan dengan pasokan beras dari luar bahkan untuk daging sapi saja masih ketergantungan dari australia. di indonesia sawah cukup luas namun sudah banyak petani yang tidak lagi berniat menanam sawah karena alasan upah yang di dapat tidka sebanding dengan apa yang mereka keluarkan.jika semua negara negara yang mendistribusikan beras mereka ke indonesia menghentikan distribusi mereka maka saya yakin harga beras di indonesia akan menyentuh level tinggi dan banyak warga yang pasti akan beralih makan singkong, wkwkwk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chigo",
      "created_time": "August 24, 2023, 02:21:56 PM",
      "body": "Quote from: Chikito on August 22, 2023, 04:31:37 AMQuote from: chigo on August 21, 2023, 08:38:09 PMassalamualaikum, saya sangat tertarik membuat topik ini karena tak sengaja membaca berita heboh ini dan merasa was was dengan kenaikan harga beras yang mungkin saja akan terjadi jika negara negara pengekspor bahan pokok seperti beras menghentikan ekspor mereka terutama di indonesia karena negara kita masih bergantung pada ekspor beras dari negara lainnya.Waalaikumsalam, Harga suatu produk, apa pun itu jenisnya, berdasar pada basic economic yaitu Supply dan Demand, apa pun itu, jika supply terbatas dan permintaan banyak, harga pasti naik. Produksi beras di Indonesia tidak mencukupi kebutuhan hidup rakyatnya sendiri, oleh karena itu, pemerintah meng-impor beras dari negara lain. Sehingga kalau negara peng-impor beras men-stop pengirimannya, tentu membuat supply jadi terbatas, sedangkan permintaan tetap sehingga jelas akan membuat harga beras naik.Untuk mengatasinya, pemerintah harus tetap menyamakan supply seperti sebelumnya. bagaimana pun caranya, mau mereka mencari impor dari negara lain, atau pun produksi sendiri. Sebenarnya lebih bagus berdikari, tapi ya pemerintah harus benar-benar fokus mensejahterahkan petani dan bikin mereka nyaman hdup walau pencariannya hanya bertanam padi. Kalau sekarang kan petani malah harus bersaing dengan beras impor, jelas sulit, karena apa pun mahal, baik itu pupuk, bibit dan segala macam kebutuhannya.setuju dengan pendapat agan, pemerintah sejauh ini belum berhasil mengendalikan supply komoditi indonesia sama seperti hal nya berita tentang petani garam di cirebon yang rame rame membuang garam mereka ke jalanan di karenakan harga garam yang sebelumnya menyentuh rp 6000/kg sekarang ini malah anjlok ke harga tidak sampai rp 1000/kg.dari sini aja kita bisa tahu bahwa pemerintah tidak memberikan solusi yang baik unutk para petani dan juga hanya beberapa pihak saja yang di untungkan,, seperti tengkulak atau importir karnea mereka membeli garam murah dari cirebon lalu menjual nya ke daerah daerah yang masih tinggi harga garamnya.selama pemerintah tidak berupaya keras dalam mengontrol supply dari masing masing komoditi yang ada di indonesia maka saya ragu indonesia dapat berdikari terhadap kebutuhan dasar seperti beras dan lainnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "August 24, 2023, 02:32:33 PM",
      "body": "Quote from: Chikito on August 22, 2023, 04:31:37 AMNegara Indonesia ini masih berkiblat ke negara barat, padahal negara barat itu minim sumber daya sehingga apa apa kebutuhan mereka harus impor, sedangkan Indonesia, sumber daya banyak, tanah subur, hijau, basah, tropis, sampeyan tanam kayu pun bakal jadi pohon tanpa diapa-apain.Indonesia memang kaya dengan sumber daya alamnya yang melimpah ruah. Namun sayangnya kita belum sanggup untuk mengelola dengan sepenuhnya tentang sumber daya yang kita miliki, sehingga negara kita lebih memilih untuk menjual atau mengekspor nya dalam keadaan mentah, lalu kita membeli nya lagi dalam bentuk barang jadi dengan harga yang begitu mahal. Dan ketika indonesia berusaha untuk mengelola SDM-nya dan mengimpor dalam bentuk yang sudah jadi, hal ini selalu mendapatkan jegalan dari negara luar. Dan kita bisa lihat sendiri bagaimana indonesia selalu kalah dalam sidang WTO karena mendapatkan serangan dari negara barat.Hal ini ditambah dengan selera masyarakat yang memilih untuk membeli produk impor dibandingkan produk lokal yang dimana hal ini membuat perusahaan lokal menjadi bangrut karena tidak mampu bersaing dengan prosuk luar negeri.Quote from: CageMabok on August 24, 2023, 10:53:08 AMSaya tidak terkejut dengan berita semacam ini karena dari apa yang saya lihat (khususnya untuk negara kita Indonesia), para warga negara Indonesia tidak akan kelaparan atau kesulitan untuk mendapatkan beras sebagai makanan pokok mereka sehari-hari karena sawah dan ladang yang ada di negara kita Indonesia masih lumayan banyak sehingga hasil panen dan produksi beras di Indonesia masih lumayan banyak dan hal itu masih cukup membuat para masyarakat Indonesia untuk mendapatkan beras dengan harga yang tidak mahal. Yaa benar sekali dan saya setuju dengan anda. selain itu masyarakat kita tidak terlalu tergantung dengan beras karena masih banyak bahan pokok makanan yang mengadung karbohidrat seperti singkong dan yang lainnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "August 25, 2023, 02:14:46 PM",
      "body": "Ini sebetulnya topik yang sangat menarik, tapi kok judulnya malah harga komoditi secara general. Harusnya diskusi harga beras, yang udah jelas lagi hot sekarang ini. India dan Thailand membatasi ekspor mereka gegara gagal panen dari berita surat kabar pagi ini (atau kemarin lupa). Ini bakal ngepump harga beras kalau produksi beras lokal tidak bisa mencukupi... ironis di Indonesia ga bisa swasembada beras.IMO ga usah khawatir akan kelangkaan beras, nanti kalau harganya udah menggiurkan, para petani lokal akan mulai beralih nanam beras dan menggenjot produksi biar cuan. Kemudian harga beras turun... udah gitu terus rumusnya... Apalagi varietas padi macam-macam dan ada yang waktu dari tanam sampai panen sangat singkat (4 kali panen dalam 1 tahun). Jadi kalau langka ya paling kurleb 3 bulan. Selama itu ganti makan roti anget dulu aja",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "August 26, 2023, 04:13:36 PMLast edit: August 26, 2023, 04:50:01 PM by komisariatku",
      "body": "Quote from: mu_enrico on August 25, 2023, 02:14:46 PM...ironis di Indonesia ga bisa swasembada beras.Kenapa Indonesia tidak swasembada beras? karena pemerintah tidak melindungi para petani padi. Dari yang pernah saya dengar, bahwa pemerintah memiliki 3 tanggungjawab utama untuk masyarakatnya:1. Tanggung jawab keamananTerkait masalah keamanan, pemerintah sudah menjaminnya dan berusaha membuat kemanan untuk masyarakat melaluia TNI dan POLRI2. Tanggung jawab pelayanan publikTerkait masalah ini pemerintah juga suda mejalankannya melalui ASN3. Tanggung jawab panganHal ini belum bisa dilaksanakan oleh pemerintah. Harusnya pemerintah menjamin pangan untuk rakyatnya, jika pemerintah belum sanggup sendiri maka perlu menjalin kerja sama dengan petani padi, mungkin pemerintah melindungi para petani yang gagal panen, memberikan harga beli padi yang masuk akal (bisa gunakan subsidi agar padi memiliki harga yang cukup bagus tetapi beras tetap murah) jadi petani tidak tekorQuote from: mu_enrico on August 25, 2023, 02:14:46 PMIMO ga usah khawatir akan kelangkaan beras, nanti kalau harganya udah menggiurkan, para petani lokal akan mulai beralih nanam beras dan menggenjot produksi biar cuan. Kemudian harga beras turun... udah gitu terus rumusnya... Apalagi varietas padi macam-macam dan ada yang waktu dari tanam sampai panen sangat singkat (4 kali panen dalam 1 tahun). Jadi kalau langka ya paling kurleb 3 bulan. Selama itu ganti makan roti anget dulu aja Nah ini yang paling menarik, kebiasaanya selalu begitu. saat mau tanam harganya naik selangit giliran panen harganya anvur lebur... wkwkwk. Untuk masalah beras/padi, ada kabar tetang badai el nino yang akan memperparah hasil bumi karena iklim akan naik dan menimbulkan kekeringanhttps://www.cnbcindonesia.com/research/20230720105205-128-455805/cuaca-panas-el-nino-sumber-malapetaka-bumi-tahun-iniDuh, saya orang indonesia asli gan, kalau udah makan roti berapa bungkuspun menurut saya itu belom makan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "August 26, 2023, 04:31:04 PM",
      "body": "Quote from: komisariatku on August 26, 2023, 04:13:36 PMNah ini yang paling menarik, kebiasaanya selalu begitu. saat mau tanam harganya naik selangit giliran panen harganya anvur lebur... wkwkwk. Untuk masalah beras/padi, ada kabar tetang badai el nino yang akan memperparah hasil bumi karena iklim akan naik dan menimbulkan kekeringanBadai El-Nino udah ada dari jaman ane masih muda dulu gan:QuoteEl Niño events of 1982-83 and 1997-98 were the most intense of the 20th century. During the 1982-83 event, sea-surface temperatures in the eastern tropical Pacific were 7.8-12.8° C (9-18° F) above normal.Sumur: https://education.nationalgeographic.org/resource/el-nino/Ane ga inget dulu ada kelangkaan beras, keknya tiap hari makan nasi dari dulu  Ga usah khawatir akan hal ini, apalagi kita hidup di Indonesia yang lahan pertanian masih sangat banyak. Kalau nanti beneran sulit dapet beras ya nyari jagung, singkong, dan banyakin setok mie instan. Penderitaan ini masih mending daripada dulu jaman COVID yg ga boleh keluar rumah, jaga jarak, pake masker, dsb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marcous",
      "created_time": "August 26, 2023, 06:08:24 PM",
      "body": "Quote from: Juse14 on August 21, 2023, 10:22:01 PMQuote from: chigo on August 21, 2023, 08:38:09 PM~snip~Cukup heran jika Indonesia sebagai negara agraris dan memiliki tanah yang subur ditambah dengan lahan pertanian yang cukup luas, akan tetapi hasil pertaniannya masih belum cukup untuk memenuhi kebutuhan masayarakat dan memenuhi cadangan pangan pemerintah sehingga harus melakukan impor dari negara lain. Yaa.. tapi inilah Indonesia tanahnya subur dan kaya raya tapi masyakatnya kurang sejahtera.Menurut saya, terkait kebijakan negara India tentang pelarangan impor beras, tidak terlalu mengkhawatirkan dan tidak usah membuat kita menjadi gelisah karena kebijakan tersebut. Dan perlu kita ketahui bahwa India bukanlah negara satu-satunya yang melakukan impor beras ke indonesia. India hanyalah salah satunya dan India bukan pula pemasok terbesar terhadap kebutuhan beras negara kita. Untuk saat ini pasokan beras terbesar untuk Indonesia diperoleh dari negara tetangga yaitu Thailand dan Vietnam. bahkan pemerintah kita sudah dari jauh-jauh hari, menentukan untuk mengakhiri kontrak Impor beras dari IndiaSaya merasakan hal yang sama, cukup mengherankan apabila kita di hadapkan pada fakta bahwa harus melakukan impor beras dari Negara luar. Saya tidak sepenuhnya yakin, bahwa Idonesia kekurangan kebutuhan pokok yang satu ini (beras). Mungkin saja produksi dalam Negeri terlalu banyak di Ekspor keluar, dan otomatis wilayah seperti perkotaan akan kekurangan suplay yang cukup.Pergerakan harga di pasaran sangat bervariasi saya lihat, tentu akan berbeda-beda dengan wilayah lainnya. Faktor yang paling berpengaruh adalah karena Inflasi, dan faktor lainnya adalah harga bibit, pupuk dan obat-obatan seperti vitamin sangat mahal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "August 27, 2023, 07:36:53 AM",
      "body": "Quote from: marcous on August 26, 2023, 06:08:24 PMSaya merasakan hal yang sama, cukup mengherankan apabila kita di hadapkan pada fakta bahwa harus melakukan impor beras dari Negara luar. Saya tidak sepenuhnya yakin, bahwa Idonesia kekurangan kebutuhan pokok yang satu ini (beras). Mungkin saja produksi dalam Negeri terlalu banyak di Ekspor keluar, dan otomatis wilayah seperti perkotaan akan kekurangan suplay yang cukup.Sepengetahuan ane sih menang iya, kebutuhan konsumsi beras di tanah air ini cukup tinggi dibanding negara lain. Oleh karena itu pemerintah indonesia mengimpor-nya. Kalau ane pikir, untuk apa juga jauh-jauh beli beras di luar negeri kalau di dalam negeri bisa mensejahterahkan rakyatnya sendiri. Oleh karena itu Impor, karena pasokan sangat kurang, rakyat indonesia lebih memilih berdagang dari pada bertani, karena prospek uang lebih banyak berputar di berdagang dari pada bertani.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "August 27, 2023, 09:31:34 AM",
      "body": "Quote from: marcous on August 26, 2023, 06:08:24 PMSaya merasakan hal yang sama, cukup mengherankan apabila kita di hadapkan pada fakta bahwa harus melakukan impor beras dari Negara luar. Saya tidak sepenuhnya yakin, bahwa Idonesia kekurangan kebutuhan pokok yang satu ini (beras). Mungkin saja produksi dalam Negeri terlalu banyak di Ekspor keluar, dan otomatis wilayah seperti perkotaan akan kekurangan suplay yang cukup.Pergerakan harga di pasaran sangat bervariasi saya lihat, tentu akan berbeda-beda dengan wilayah lainnya. Faktor yang paling berpengaruh adalah karena Inflasi, dan faktor lainnya adalah harga bibit, pupuk dan obat-obatan seperti vitamin sangat mahal. Jangankan untuk mengekspor pangan untuk kebutuhan dalam negeri pun belum memadai. hal ini bukan dikarenakan tanah yang kita miliki tidak subur, melainkan hal ini dikarenakan petani indonesia masih belum mampu menyerap kemajuan teknologi terbarukan untuk meningkatkan kualitas dan kuantitas produksi pangan Indonesia. Yang berbeda jauh dengan negara jepang yang walaupun mereka hanya memilki lahan yang sedikit dan tanah yang tidak cukup subur seperti Indonesia. Namun dengan sistem pertanian yang mumpuni mereka mampu menjawab kebutuhan pangan dalam negeri.Untuk memenuhi kebutuhan pupuk dan vitamin tanaman Indonesia masih harus melakukan impor. dan hal inilah yang membuat sebagian petani Indonesia mengeluh karena harga pupuk yang terus meroket dan kebutuhan akan pupuk semakin meningkat dan sementara prosuduksi hasil pangan tidak seimbang dengan modal yang dikeluarkan dan ditambah dengan harga pangan yang rendah hal ini menjadi kesulitan dan tantangan tersendiri bagi petani Indonesia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "August 27, 2023, 09:32:15 AM",
      "body": "Quote from: blue Snow on August 27, 2023, 07:36:53 AMQuote from: marcous on August 26, 2023, 06:08:24 PMSaya merasakan hal yang sama, cukup mengherankan apabila kita di hadapkan pada fakta bahwa harus melakukan impor beras dari Negara luar. Saya tidak sepenuhnya yakin, bahwa Idonesia kekurangan kebutuhan pokok yang satu ini (beras). Mungkin saja produksi dalam Negeri terlalu banyak di Ekspor keluar, dan otomatis wilayah seperti perkotaan akan kekurangan suplay yang cukup.Sepengetahuan ane sih menang iya, kebutuhan konsumsi beras di tanah air ini cukup tinggi dibanding negara lain. Oleh karena itu pemerintah indonesia mengimpor-nya. Kalau ane pikir, untuk apa juga jauh-jauh beli beras di luar negeri kalau di dalam negeri bisa mensejahterahkan rakyatnya sendiri. Oleh karena itu Impor, karena pasokan sangat kurang, rakyat indonesia lebih memilih berdagang dari pada bertani, karena prospek uang lebih banyak berputar di berdagang dari pada bertani.Mengimpor beras dari negara tetangga bukan berarti pasokan beras di tanah air mulai berkurang, petani Indonesia masih sangat produktif, di berbagai pulau masyarakat Indonesia khususnya di pedesaan masih mengandalkan pendapatan dari hasil pertanian. Jika hasil panen melimpah mungkin Indonesia tidak perlu mengimpor beras karena persediaan beras yang diproduksi di lahan pertanian yang ada di berbagai pulau masih mencukupi untuk kebutuhan pokok, tetapi jika para petani gagal panen tidak masalah pihak pemerintah mengimpor beras dari negara luar.Pemerintah harus lebih memperhatikan nasib para petani dengan memberi fasilitas pada mereka agar produksinya lebih meningkat, impor beras akan membunuh nasib para petani karena harga beras yang di produksi petani semakin murah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gaza13",
      "created_time": "August 27, 2023, 03:03:08 PM",
      "body": "Quote from: chigo on August 21, 2023, 08:38:09 PMuntuk agan agan sekalian yang ingin memantau pergerakan harga komoditi bisa lihat di situs ini, namun harga nya bisa berbeda dengan yang ada di pasar swalayan.Pantau disini: http://infoharga.bappebti.go.id/Harga yang Om tunjukan itu jelas berbeda, harga tersebut , Daftar harga komoditi ditingkat petani per 27 Agustus 2023 11:50:14.http://infoharga.bappebti.go.id/harga_komoditi_petani/?wilayah=&komoditiKalau menurut ane Harga tersebut harga petani ke tengkulak ini ibaratnya sebagai arisan berantai untuk mendapatkan keuntungan yang berkali kali lipat. Tengkulak kembali menjual hasil dari petani kembali ke pasar pasar tradisional , Seharusnya pemerintah hadir untuk mengatasi hal seperti ini, jangan ada turunan berantai dengan meningkatnya harga komoditas tersebut sampai ke konsumen (rakyat), cukup pemerintah saja yang ambil alih, hasil petani langsung dijual ke badan atau lembaga yang di tunjuk oleh pemerintah menyerap hasil petani , dengan begitu petani mendapatkan hasil yang di inginkan tidak terus menerus merugi pas hasil panen Ya Apalagi musim kemarau seperti sekarang ini , pemerintah pusat wajib menginstruksikan ke setiap kepala daerah,yang mempunyai potensi lumbung besar komoditas seperti Padi , untuk memperhatikan petani seperti pupuk dan membuat saluran air (Irigasi).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "August 28, 2023, 11:46:55 AM",
      "body": "lengkah pemerintah sekarang untuk bisa mengatur harga beras itu dirasa tidak maksimal oleh masyarakat karena bagaimana mungkin negara agraris yang konon katanya sangat subur namun masih mengimport begitu banyak beras dari luar negeri. pemerintah seperti mau tidak mau memperluas produksi beras di dalam negeri, hanya karena beberapa masalah saja yang dimana seharusnya itu bisa di selesaikan oleh pemerintah dan para sarjana di negeri ini.padahal jika dimaksimalkan saja, potensi dalam negeri untuk menghasilkan beras itu sangat bagus dan mungkin saja negera kita akan bisa menghentikan import beras dan bahkan mengekspornya ke negera lain. namun itu kembali lagi ke pemerintahnya, karena jika tidak ada solusi yang baik dari pemerintah mau sampai kapanpun itu indonesia akan tetap mengimport beras atau bahan pokok lainnya dari negara lain untuk pemenuhan konsumsi dalam negeri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dewiana",
      "created_time": "September 17, 2023, 03:18:05 PM",
      "body": "Quote from: Chikito on August 22, 2023, 04:31:37 AMQuote from: chigo on August 21, 2023, 08:38:09 PMassalamualaikum, saya sangat tertarik membuat topik ini karena tak sengaja membaca berita heboh ini dan merasa was was dengan kenaikan harga beras yang mungkin saja akan terjadi jika negara negara pengekspor bahan pokok seperti beras menghentikan ekspor mereka terutama di indonesia karena negara kita masih bergantung pada ekspor beras dari negara lainnya.Waalaikumsalam, Harga suatu produk, apa pun itu jenisnya, berdasar pada basic economic yaitu Supply dan Demand, apa pun itu, jika supply terbatas dan permintaan banyak, harga pasti naik. Produksi beras di Indonesia tidak mencukupi kebutuhan hidup rakyatnya sendiri, oleh karena itu, pemerintah meng-impor beras dari negara lain. Sehingga kalau negara peng-impor beras men-stop pengirimannya, tentu membuat supply jadi terbatas, sedangkan permintaan tetap sehingga jelas akan membuat harga beras naik.Untuk mengatasinya, pemerintah harus tetap menyamakan supply seperti sebelumnya. bagaimana pun caranya, mau mereka mencari impor dari negara lain, atau pun produksi sendiri. Sebenarnya lebih bagus berdikari, tapi ya pemerintah harus benar-benar fokus mensejahterahkan petani dan bikin mereka nyaman hdup walau pencariannya hanya bertanam padi. Kalau sekarang kan petani malah harus bersaing dengan beras impor, jelas sulit, karena apa pun mahal, baik itu pupuk, bibit dan segala macam kebutuhannya.Negara Indonesia ini masih berkiblat ke negara barat, padahal negara barat itu minim sumber daya sehingga apa apa kebutuhan mereka harus impor, sedangkan Indonesia, sumber daya banyak, tanah subur, hijau, basah, tropis, sampeyan tanam kayu pun bakal jadi pohon tanpa diapa-apain.Sangat menarik terkait hal ini, saat ini masyarakat mulai was was untuk mengatasi hal ini pemerintah belum ada respon yang cepat. Hasil panen dibeli dari masyarakat murah tapi harga beras mahal dari itu kita lihat bahwa adanya permainan kotor dipasar, dipegang oleh orang-orang yang kaya, semestinya pemerintah mengambil kebijakan taktis kalau perlu beras impor terus biar masyarakat indonesia walau kurang pendapatan tapi makan wajib ada apalagi makanan pokok nasi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "September 19, 2023, 02:05:15 AM",
      "body": "Quote from: Dewiana on September 17, 2023, 03:18:05 PMQuote from: Chikito on August 22, 2023, 04:31:37 AMQuote from: chigo on August 21, 2023, 08:38:09 PMassalamualaikum, saya sangat tertarik membuat topik ini karena tak sengaja membaca berita heboh ini dan merasa was was dengan kenaikan harga beras yang mungkin saja akan terjadi jika negara negara pengekspor bahan pokok seperti beras menghentikan ekspor mereka terutama di indonesia karena negara kita masih bergantung pada ekspor beras dari negara lainnya.Waalaikumsalam, Harga suatu produk, apa pun itu jenisnya, berdasar pada basic economic yaitu Supply dan Demand, apa pun itu, jika supply terbatas dan permintaan banyak, harga pasti naik. Produksi beras di Indonesia tidak mencukupi kebutuhan hidup rakyatnya sendiri, oleh karena itu, pemerintah meng-impor beras dari negara lain. Sehingga kalau negara peng-impor beras men-stop pengirimannya, tentu membuat supply jadi terbatas, sedangkan permintaan tetap sehingga jelas akan membuat harga beras naik.Untuk mengatasinya, pemerintah harus tetap menyamakan supply seperti sebelumnya. bagaimana pun caranya, mau mereka mencari impor dari negara lain, atau pun produksi sendiri. Sebenarnya lebih bagus berdikari, tapi ya pemerintah harus benar-benar fokus mensejahterahkan petani dan bikin mereka nyaman hdup walau pencariannya hanya bertanam padi. Kalau sekarang kan petani malah harus bersaing dengan beras impor, jelas sulit, karena apa pun mahal, baik itu pupuk, bibit dan segala macam kebutuhannya.Negara Indonesia ini masih berkiblat ke negara barat, padahal negara barat itu minim sumber daya sehingga apa apa kebutuhan mereka harus impor, sedangkan Indonesia, sumber daya banyak, tanah subur, hijau, basah, tropis, sampeyan tanam kayu pun bakal jadi pohon tanpa diapa-apain.Sangat menarik terkait hal ini, saat ini masyarakat mulai was was untuk mengatasi hal ini pemerintah belum ada respon yang cepat. Hasil panen dibeli dari masyarakat murah tapi harga beras mahal dari itu kita lihat bahwa adanya permainan kotor dipasar, dipegang oleh orang-orang yang kaya, semestinya pemerintah mengambil kebijakan taktis kalau perlu beras impor terus biar masyarakat indonesia walau kurang pendapatan tapi makan wajib ada apalagi makanan pokok nasi.Tidak juga, saya denger pemerintah kedepan akan membeli beras petani dengan harga 11 ribu. Kalau hal tersebut diterapkan sekarang, efek yang dihasilkan tidak akan instant hari ini. Mungkin butuh waktu setelahnya, karena sekarang juga lagi musim kemarau, banyak sawah yang kekeringan di beberapa lumbung beras seperti Cianjur dan Lampung. Oleh karena itu, sebisa mungkin pemerintah melakukan upaya operasi pasar yang banyak dilakukan di daerah-daerah. Dan, mungkin juga ini bau politik, karena di satu sisi menteri pertaniannya orang Nasdem, sedangkan calon yang diusung partai tersebut itu Anti Tesis dengan pemerintahan sekarang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "September 19, 2023, 08:39:29 AM",
      "body": "Saat ini harga beras melambung cukup tinggi bahkan sudah berlangsung beberapa minggu belakangan ini, di tempat saya dengan masyarakat yang berprofesi sebagai petani sedikit mengalami kesulitan karena tidak bisa bercocok tanam karena kesulitan mendapat air. Update per hari ini harga beras biasanya di tempat saya dijual per 15kg dengan kualitas standar seharga 220k. Namun ada juga penjualan secara eceran namun saya belum update harga dijual per KG nya bisa menyentuh berapa. Saat ini belum ada tindakan dari pemerintah untuk membuat harga beras jadi stabil, biasanya kami membeli beras dengan porsi packingan 15kg seharga 170k hingga 180k, namun hampir dua bulan belakangan ini harga naik cukup drastis ditengah kesulitan ekonomi akibat gagal panen dalam beberapa tahun ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drinpalatarok",
      "created_time": "September 19, 2023, 12:43:17 PM",
      "body": "Quote from: Juse14 on August 21, 2023, 10:22:01 PMQuote from: chigo on August 21, 2023, 08:38:09 PMQuoteLarangan Ekspor Beras India, Bikin Perut Keroncongan di Banyak NegaraKeputusan India melarang ekspor beras dengan alasan kepentingan domestik ternyata memiliki dampak global. Dunia masih tergantung pada beras, termasuk Indonesia, yang produksinya tahun ini terganggu El Nino. Kini harga beras dunia pun terkerek naik.Dengan ada kebijakan negara lain seperti ini seharusnya pemerintah indonesia mempersiapkan lumbung pangan yang baru untuk menjadi swasembada pangan. Membuka keran ekspor adalah kebijakan yang hanya menguntungkan sebagian kelompok tapi kalau membuka lahan pertanian baru akan mensejahterakan petani indonesia membuka lapangan kerja yang baru dan daya beli mensyaratkan meningkat. Permasalahan pangan bukan lah hal yang baru yang dihadapi oleh pemerintah indonesia, siapapun yang jadi presiden kebijakan yang di ambil harus lah kebijakan yang berlandaskan kesejahteraan rakyat bukan kepentingan kelompok tertentu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}