{
  "id": "topic_5450311",
  "title": "cryptomaniac_xxx",
  "author": "cryptomaniac_xxx",
  "created_time": "April 26, 2023, 11:13:52 PM",
  "content": "Anyone heard this news? What's your take on this? It's this the beginning of the downfall of the NFT market or can we say that it will still survived till the next bull run?QuoteOpenSea, one of the largest NFT marketplaces, has been hit particularly hard, with its valuation now facing a significant cut by one of its most prominent investors, Tiger Global. According to a recent report by The Information, Tiger Global, a $13 billion tech-focused venture fund, recently disclosed that its equity in OpenSea has dropped from $126.8 million to $30.2 million, representing a 76% drawdown. The firm became one of the largest investors in OpenSea when the NFT platform raised $300 million during a Series C round earlier last year. https://zycrypto.com/key-opensea-investor-cuts-platforms-valuation-by-75-as-global-nft-sales-plummet/For me though, I'm not surprised, we are still the bear market, although it seems that majority of the coins are bouncing back, I still one big reason for the sudden downfall of the NFT market is the obvious bearish trend.And that's how the market works as we all know it, sooner or later the hype will die down a bit, like the P2E model. So we will see if NFT can live or continue to exists till the next bull run. It will be the ultimate test for this market, in my opinion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450311",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "April 27, 2023, 01:20:21 AM",
      "body": "NFTs are here to stay and the companies that invested in Opensea sees that too. The real question here is if Opensea can remain as the top platform for NFTs in the years to come. If Tiger Global thinks otherwise then thay are likely to pull out and take the loss. The article already mentioned about increased competition as one reason for the decline in sales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 27, 2023, 02:16:42 AM",
      "body": "The loss of one investor does not mean the death of the platform, especially if the developers continue to make it attractive.NFT is a technology that will stay with us, but the exaggerated inflation during the past months made it more valuable than its current value, so I would not be surprised if we witnessed continuous corrections during the coming months.But I am sure that NFT will remain with us for several years, or at least until the wave of pumping during the next four years.Are there real competitors to OpenSea?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "April 27, 2023, 02:34:50 AM",
      "body": "Quote from: cryptomaniac_xxx on April 26, 2023, 11:13:52 PMAnyone heard this news? What's your take on this? It's this the beginning of the downfall of the NFT market or can we say that it will still survived till the next bull run?QuoteOpenSea, one of the largest NFT marketplaces, has been hit particularly hard, with its valuation now facing a significant cut by one of its most prominent investors, Tiger Global. According to a recent report by The Information, Tiger Global, a $13 billion tech-focused venture fund, recently disclosed that its equity in OpenSea has dropped from $126.8 million to $30.2 million, representing a 76% drawdown. The firm became one of the largest investors in OpenSea when the NFT platform raised $300 million during a Series C round earlier last year. https://zycrypto.com/key-opensea-investor-cuts-platforms-valuation-by-75-as-global-nft-sales-plummet/For me though, I'm not surprised, we are still the bear market, although it seems that majority of the coins are bouncing back, I still one big reason for the sudden downfall of the NFT market is the obvious bearish trend.And that's how the market works as we all know it, sooner or later the hype will die down a bit, like the P2E model. So we will see if NFT can live or continue to exists till the next bull run. It will be the ultimate test for this market, in my opinion.They're buying the top  It is obvious though considering the overall NFT volume has significantly decreased from its peak, which inevitably leads to a drop in the valuation of these marketplaces. I believe that NFTs are here to stay. When Bitcoin and other alts inevitably reach new ATH in the next couple of years, we'll likely see NFT volume rising as well. I agree with @Yogee; the real question is whether OpenSea will still be relevant by then.Quote from: Husires on April 27, 2023, 02:16:42 AMAre there real competitors to OpenSea?Yeah, there are alternative platforms that offer unique selling points for Ethereum NFT marketplaces. Since February 2023, OpenSea has been dethroned as the top NFT marketplace on Ethereum. The top spot (by volume) is now held by Blur, which offers a rewards system in the form of their $BLUR tokens. However, such a reward system may not be sustainable in the long run, as we have seen with LooksRare.Meanwhile, on other blockchains like Solana, the landscape is entirely different. OpenSea doesn't have a presence there at all, with most of the market share being taken up by native marketplaces like MagicEden and Tensor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "April 27, 2023, 02:54:45 AM",
      "body": "Quote from: cryptomaniac_xxx on April 26, 2023, 11:13:52 PMAnyone heard this news? What's your take on this? It's this the beginning of the downfall of the NFT market or can we say that it will still survived till the next bull run?The NFT technology is here and will be here. The NFT marketplaces not only OpenSea will be here, will exist with us. However, weak NFT projects, weak NFT marketplaces will be killed by the market, cryptocurrency community selection naturally. Only strong projects and strong NFT marketplaces will survive through bear market, crisis and can develop more.QuoteFor me though, I'm not surprised, we are still the bear market, although it seems that majority of the coins are bouncing back, I still one big reason for the sudden downfall of the NFT market is the obvious bearish trend.And that's how the market works as we all know it, sooner or later the hype will die down a bit, like the P2E model. So we will see if NFT can live or continue to exists till the next bull run. It will be the ultimate test for this market, in my opinion.I believe NFT technology is a branch of blockchain technology like Proof of Work, Smart contracts and they will be here. Like many people accused Ethereum as a scam altcoin and their blockchain, technology, ERC-20 are paradise for smaller scam altcoins. I agree to disagree, Ethereum is not scam and you can not blame on its smart contracts as other developers from scam altcoin projects use their ERC-20 chain and Ethereum smart contracts to scam investors.Do we blame Alfred Nobel because Putin decided to send his army to invade Ukraine? It is not a right accusation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dr.hopkins",
      "created_time": "April 27, 2023, 05:02:10 AM",
      "body": "I think the NFT market will survive, but it will definitely need to adapt and evolve to stay relevant. Maybe we'll see more emphasis on utility and real-world applications, rather than just hype and speculation. Only time will tell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "woez",
      "created_time": "April 27, 2023, 05:24:10 AM",
      "body": "Realted The latest news about OpenSea investors slashing their valuation by 75% is not surprising considering the current bearish trend in the NFT market if I look at it since the market has experienced significant growth, it is inevitable that the hype will die down eventually, as seen in the P2E model.I think the real test for the NFT market is its ability to survive until the next bull run and for investors to be sure to remain careful and aware of market fluctuations, as investment values can change quickly. However, this does not mean a downturn in the NFT market, as it may rebound in the future with new innovations and developments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "April 27, 2023, 03:49:29 PM",
      "body": "Unfortunately for NFT investors I think they are just a fad. The ICO craze of the 2017 bull run fizzled out, lots of investors lost a lot of money. I see the same situation with NFT’s, I mean really they are crap aren’t they. You ‘own’ a JPG on the blockchain, imo the biggest load of nonsense so far in crypto. People were wash trading against themselves, artificially inflating the price of NFT’s, hoping some rich gullible guys would pay stupid money for them.I think it’s over for NFT investors, they have peaked & will never again see the highs of 2021. Maybe there will be dead cat bounces here & there but imo the NFT craze is over. It will be something else in the next bull run. Never get married emotionally to investments. If you see a way to get in & out making lots of money then do it. Don’t expect NFT’s to get another crazy run up though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "April 27, 2023, 04:22:12 PM",
      "body": "I have a feeling OpenSea will lose its top spot as time goes by, the thing about the Crypto space is that you are either in or out, the Blur team too is from the US I believe and they decided to launch a token, OS stick to their strategy when they have no real rival, one thing I have learned about this space is that people only follow the money, the liquidity and volume is now on Blur, show them the money and they will jump ship.I believe we have not hit to Top of NFT hype and more NFT marketplace are going to be launched with time and this is going to continue to eat into their market share and profit unless they restrategize",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 27, 2023, 04:43:47 PM",
      "body": "That's a lot of losses for them. They should have sold their shares on them when it's on the top days of NFTs.Quote from: cryptomaniac_xxx on April 26, 2023, 11:13:52 PMSo we will see if NFT can live or continue to exists till the next bull run. It will be the ultimate test for this market, in my opinion.They might do something about this for them to at least get a break even. That's a lot of money that they've invested and I guess just like most of us, they've invested through the hype and didn't anticipate this happening. With the scenes that we've seen on this market, every trend has its end and there will be a new one that shall emerge while forgetting the former. Maybe they should just take the losses before it bears more losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "April 28, 2023, 03:58:06 AM",
      "body": "The downfall of NFT market has started long ago and for genuine reasons. Some people started matching those computer generated images with the real life images drawn by great painters, some other people got excited about it and rushed to the NFT market. Now they are understanding that these image have no value and no one is willing to buy anymore crap in the name of NFTs. That's it! It lasted shorter than ICO boom and many other hypes in the market. Opensea being the pioneer of NFT marketplace is also facing the heat. That was bound to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "April 28, 2023, 01:14:26 PM",
      "body": "Quote from: cryptomaniac_xxx on April 26, 2023, 11:13:52 PMAnyone heard this news? What's your take on this? It's this the beginning of the downfall of the NFT market or can we say that it will still survived till the next bull run?QuoteOpenSea, one of the largest NFT marketplaces, has been hit particularly hard, with its valuation now facing a significant cut by one of its most prominent investors, Tiger Global. According to a recent report by The Information, Tiger Global, a $13 billion tech-focused venture fund, recently disclosed that its equity in OpenSea has dropped from $126.8 million to $30.2 million, representing a 76% drawdown. The firm became one of the largest investors in OpenSea when the NFT platform raised $300 million during a Series C round earlier last year. If i am reading this quote correct, then this only means, that Tiger Global has reduced their equity in OpenSea by 76%, so i would guess they have sold some of their shares to some other investors? So if i understand this correctly, then this does not mean that the valuation of OpenSea as a company is now 76% lower than before. Therefore i don't really think that this has this big of an impact to OpenSea itself and to the NFT market as a whole.Of course part of the truth is that like 95% of all NFT's are totally useless and just created to make some quick buck, but still i think NFT will not go away. They are here to stay and will always be a part of the crypto space now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rampagoe004",
      "created_time": "April 28, 2023, 01:43:21 PM",
      "body": "Currently Opensea is the best platform to trade NFTs. But right now the market is in a bear market and I honestly think the NFT is a project that has bubbled up. The prices of assets on NFTs have been too inflated around 2020-2022 so I think this is a market adjustment that is happening to NFT platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "firesurfer",
      "created_time": "April 28, 2023, 02:22:17 PM",
      "body": "I'm not surprised to see Opensea valuations drop. We are in a bear market, the money flow is being blocked.The NFT market is becoming much quieter than before. Perhaps more efforts will be needed to improve technology and user attraction policies. There are more competing platforms and that's a barrier for Opensea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "April 28, 2023, 06:16:41 PM",
      "body": "Depends on the reason though, we are talking about a drop that probably resulted by selling right? If that is the case then that is not valuation, that is their share in it and that makes sense. Look at the sentence, it doesn't say they dropped the valuation of the company, their equity in it dropped from 126 million to 30 million, it's THEIR equity that dropped, so it is not really a big deal.However, it is also true that opensea probably has a lot less valuation, for a simple reason that we saw NFT being a lot more important for a while and the prices were high and opensea made so much money, this was back in bull period. Nowadays, it doesn't get that much money and volume so it is not making that much money anymore and that is the issue, and could cause valuation drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Weezenhofnar",
      "created_time": "April 28, 2023, 06:50:11 PM",
      "body": "An investor recently slashed OpenSea's valuation by 75%, which may indicate concerns about the sustainability of the platform's growth and the potential impact of regulatory changes on its business model. It's important for investors to consider such factors when evaluating the long-term viability of any investment opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "April 28, 2023, 07:15:09 PM",
      "body": "Quote from: firesurfer on April 28, 2023, 02:22:17 PMI'm not surprised to see Opensea valuations drop. We are in a bear market, the money flow is being blocked.The NFT market is becoming much quieter than before. Perhaps more efforts will be needed to improve technology and user attraction policies. There are more competing platforms and that's a barrier for Opensea.They are facing competition they did not had before, while the bull market is still far away and there is also some skepticism towards NFTs which was not there before, so it is reasonable that OpenSea is facing some issues as they no longer have all the circumstances on their favor as they did some time ago, can they return back to their previous glory? This is difficult to know as I doubt that NFTs will attract the same attention they attracted before as simply too many people lost money with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eaLiTy",
      "created_time": "April 28, 2023, 07:35:11 PM",
      "body": "Quote from: cryptomaniac_xxx on April 26, 2023, 11:13:52 PM~For me though, I'm not surprised, we are still the bear market, although it seems that majority of the coins are bouncing back, I still one big reason for the sudden downfall of the NFT market is the obvious bearish trend.The hype behind NFT market has subsided and the projects that started releasing the sporting NFT are not unique either as they started collaborating with different projects and hence you cannot expect the same valuation and hence anyone who purchased them thinking that that it would be unique will not be getting the same valuation and with issues like that, it is highly unlikely the project token will rally either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "April 28, 2023, 08:30:25 PM",
      "body": "Quote from: cryptomaniac_xxx on April 26, 2023, 11:13:52 PMAnyone heard this news? What's your take on this? It's this the beginning of the downfall of the NFT market or can we say that it will still survived till the next bull run?QuoteOpenSea, one of the largest NFT marketplaces, has been hit particularly hard, with its valuation now facing a significant cut by one of its most prominent investors, Tiger Global. According to a recent report by The Information, Tiger Global, a $13 billion tech-focused venture fund, recently disclosed that its equity in OpenSea has dropped from $126.8 million to $30.2 million, representing a 76% drawdown. The firm became one of the largest investors in OpenSea when the NFT platform raised $300 million during a Series C round earlier last year. https://zycrypto.com/key-opensea-investor-cuts-platforms-valuation-by-75-as-global-nft-sales-plummet/For me though, I'm not surprised, we are still the bear market, although it seems that majority of the coins are bouncing back, I still one big reason for the sudden downfall of the NFT market is the obvious bearish trend.And that's how the market works as we all know it, sooner or later the hype will die down a bit, like the P2E model. So we will see if NFT can live or continue to exists till the next bull run. It will be the ultimate test for this market, in my opinion.I expect the value to drop even more.  I don't see the bubble of nfts being able to survive.  Crypto is one thing but things got a bit out of control in terms with pricing.  I think there's a future for nfts and opensea is a great platform for them but it might have been one of them bubbles that will take awhile to take hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "April 28, 2023, 09:59:12 PM",
      "body": "Quote from: Weezenhofnar on April 28, 2023, 06:50:11 PMAn investor recently slashed OpenSea's valuation by 75%, which may indicate concerns about the sustainability of the platform's growth and the potential impact of regulatory changes on its business model. It's important for investors to consider such factors when evaluating the long-term viability of any investment opportunity.This could be an indication that NFTs are going down, and their future will still be at risk. As we can see, the over hyped NFTs are already over, investors are now looking for a project that have a utility in this market, though this is just a valuation and we know that anyone can have their own valuation. NFTs still young though, they can still improve it and I believe, next bull run will matter to them, they should be able to rise again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}