{
  "id": "topic_5456974",
  "title": "Wiwo",
  "author": "Wiwo",
  "created_time": "June 20, 2023, 11:08:25 AM",
  "content": "My people I say make I bring this update here sake of say for some time we discuss about binance cryptcucrency exchange and sec issues in the local board and the general forum, and how the Nigeria Securities and exchange commission faulted the operation of binance Nigeria subsidiary as illegal and unregistered.The Sec we're right because, in a recent update from the exchange CEO  ZHAO distancing binance.com from binance Nigeria,  that means all the while the cryptocurrency exchange called binance Nigeria is a scam even though there have not been reports of them exiting with traders' balance for those you stars up bitcoin and other coins on the exchange. I have not used binance Nigeria before and I believe most members of this forum apart from newbies will already know the real binance exchange from the scam exchange called binance Nigeria. My question now is,  is have you ever used binance Nigeria to trade either bitcoin or other coins before,  if yes do you have a balance on the crypto exchange I mean the binance Nigeria subsidiary? Follow up on the news: https://www.channelstv.com/2023/06/18/binance-ceo-moves-against-binance-nigeria-calls-firm-scammer-entity/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456974",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 20, 2023, 11:28:08 AM",
      "body": "Nigeria SEC tag binance operations illegalBinance Nigeria Limited is a Scam Entity- CZQuote from: Wiwo on June 20, 2023, 11:08:25 AMMy question now is,  is have you ever used binance Nigeria to trade either bitcoin or other coins before,  if yes do you have a balance on the crypto exchange I mean the binance Nigeria subsidiary?Continue reading the main topic, there are further discussion there. Discussion like this: https://bitcointalk.org/index.php?topic=5455927.msg62427637#msg62427637 by Cryptomultiplier.It is better for us to stay on a single topic regarding this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 20, 2023, 11:43:26 AM",
      "body": "Quote from: Charles-Tim on June 20, 2023, 11:28:08 AMIt is better for us to stay on a single topic regarding this.Boss I just noticed that now,  thanks for sharing it and pointing me to it,  I also have followed up with the news and the old thread,  but I thought this new development about the binance Nigeria cryptocurrency exchange as illegal coming from the CEO of binance itself. All the same,  I will lock the the thread right away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}