{
  "id": "topic_5455803",
  "title": "iUNeIV",
  "author": "iUNeIV",
  "created_time": "June 09, 2023, 12:27:56 AM",
  "content": "Bonjour,Bitcoin-pool.info est un site web qui propose des tutoriels pour les débutants dans le domaine du minage. Sur ce site, vous trouverez différentes méthodes de minage, telles que l'utilisation du CPU, du GPU, du FPGA et de l'ASIC. L'objectif est de vous familiariser avec les bases et de mieux comprendre les enjeux du monde du Proof-of-Work (POW). Le site est constamment mis à jour et en évolution.Le site :  Bitcoin-Pool.info P.s Je travaille sur le site quand j'ai du temps libre. Oui, pas d'excuse",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455803",
  "comments": [
    {
      "author": "paid2",
      "created_time": "June 10, 2023, 03:52:57 PM",
      "body": "Quote from: iUNeIV on June 09, 2023, 12:27:56 AMP.s Je travaille sur le site quand j'ai du temps libre. Oui, pas d'excuse Ouais en effet y'a encore du boulot, mais c'est toujours cool de lire de la vulgarisation.Quote En 2018, j'ai créé un pool de minage qui a fonctionné pendant deux ans et demi. Malheureusement, en raison de problèmes d'hébergement, j'ai dû arrêter le pool. C'était quoi ta pool ?Sinon, la page : https://bitcoin-pool.info/CPU.html et en particulier la section \"Le tutoriel sous Linux\", il manque des choses.Tu ne mentionnes pas les Huge pages / 1GB pages, qui est un intérêt majeur de XMRig sous Linux : https://xmrig.com/docs/miner/hugepagesQuand tu vois la difficulté de Monero par exemple, une augmentation de 1 à 3% du hashrate est toujours bonne à prendre.De même, tu écris \"12) $ ./xmrig\". Si tu veux un rendement optimal, soit tu es en root (ce que les commandes écrites dans ton article ne mentionnent pas) soit tu lances \"sudo ./xmrig\", sinon ton hashrate sera bridé (tu as même un message qui te le dis normalement quand tu lances xmrig sans les droits de superutilisateur)Le lobbyiste pro-Linux qui est en moi a un peu pleuré en voyant que tu utilisais putty via Windows, mais bon, chacun ses choix  Toujours pour le même article, si ton public c'est les débutants, tu pourrais peut être proposer un article sur les P2P pools ? C'est un peu le nerf de la guerre pour certains algo, surtout si tu t'intéresses au CPU mining ; et beaucoup de débutants sont perdus avec ça.Bonne continuation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iUNeIV",
      "created_time": "June 14, 2023, 12:59:12 AM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on June 10, 2023, 03:52:57 PMQuote from: iUNeIV on June 09, 2023, 12:27:56 AMP.s Je travaille sur le site quand j'ai du temps libre. Oui, pas d'excuse Ouais en effet y'a encore du boulot, mais c'est toujours cool de lire de la vulgarisation.Quote En 2018, j'ai créé un pool de minage qui a fonctionné pendant deux ans et demi. Malheureusement, en raison de problèmes d'hébergement, j'ai dû arrêter le pool. C'était quoi ta pool ?Sinon, la page : https://bitcoin-pool.info/CPU.html et en particulier la section \"Le tutoriel sous Linux\", il manque des choses.Tu ne mentionnes pas les Huge pages / 1GB pages, qui est un intérêt majeur de XMRig sous Linux : https://xmrig.com/docs/miner/hugepagesQuand tu vois la difficulté de Monero par exemple, une augmentation de 1 à 3% du hashrate est toujours bonne à prendre.De même, tu écris \"12) $ ./xmrig\". Si tu veux un rendement optimal, soit tu es en root (ce que les commandes écrites dans ton article ne mentionnent pas) soit tu lances \"sudo ./xmrig\", sinon ton hashrate sera bridé (tu as même un message qui te le dis normalement quand tu lances xmrig sans les droits de superutilisateur)Le lobbyiste pro-Linux qui est en moi a un peu pleuré en voyant que tu utilisais putty via Windows, mais bon, chacun ses choix  Toujours pour le même article, si ton public c'est les débutants, tu pourrais peut être proposer un article sur les P2P pools ? C'est un peu le nerf de la guerre pour certains algo, surtout si tu t'intéresses au CPU mining ; et beaucoup de débutants sont perdus avec ça.Bonne continuationSalut,J'ai commencé à miner du bitcoin en début 2016 avec un petit ASIC (spondoolies-tech SP20) après cela, je me suis intéressé par les pools de minage. En 2018, j'avais trouvé un fournisseur de VPS avec un bon petit setup (8core/8threads, 8 GB RAM et 1 TO pour seulement 22 euros/mois). J'ai fait fonctionner le serveur pendant deux ans et demi. Suite à cela, j'ai eu des problèmes avec mon fournisseur. Donc le pool était rendu dead. J'avais réussi à garder le nom de domaine. Cette année, j'ai eu un problème avec (afnic.fr) sur le fait que mon nom de domaine étais en .fr et je n'habite pas en Europe. Donc, pour cela en .infoMerci de m'informer de ce sujet. Je vais faire les modifications nécessaires pour le tutoriel (XMRig)Je veux faire des tutoriels via Linux sans utiliser putty, est-ce que pour le mieux des débutants, c'est utiliser Ubuntu ou bien Debian ?Je sais qu'Ubuntu n'est pas vraiment aimée par la communauté de Linux.Après, avoir fini de faire des articles sur le CPU Win/Linux. Je serais intéressé par ton idée de parler des pools P2P.Bientôt, je vais avoir plus de temps !!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "June 14, 2023, 05:58:32 PM",
      "body": "Quote from: iUNeIV on June 14, 2023, 12:59:12 AMJe veux faire des tutoriels via Linux sans utiliser putty, est-ce que pour le mieux des débutants, c'est utiliser Ubuntu ou bien Debian ?Je sais qu'Ubuntu n'est pas vraiment aimée par la communauté de Linux.Après, avoir fini de faire des articles sur le CPU Win/Linux. Je serais intéressé par ton idée de parler des pools P2P.Bientôt, je vais avoir plus de temps !!! Concernant le choix Ubuntu / Debian, cela n'a pas trop d'impact lorsqu'on se concentre sur le mining.Debian est peut être un peu moins begginer-friendly (même si la version non-free l'est pour l'installation / l'exécution de certains drivers pour certains hardwares précis) donc Ubuntu (ou Ubuntu-server) pourrait être un meilleur choix si tu t'adresses aux débutants. Dans tous les cas Ubuntu est basé sur Debian, utilise aussi APT et .deb, donc les commandes seront les mêmes avec l'un ou l'autre. La communauté Linux est un peu fâchée avec Ubuntu parce qu'il inclue de firmwares non libres. Il y a aussi ce choix d'imposer le gestionnaire de paquets snap qui a été mal pris par une partie de la communauté il y a quelques temps. Tout ça n'a pas trop d'importance pour le mining, hors question de principes. (et globalement, tant que c'est stable et rentable, les miners s'en foutent des principes   )Perso j'utilise Debian pour mes ordis personnels, et tous mes servers qui minent XMR ont Debian-server (c'est la version sans GUI) comme OS. Utiliser Ubuntu-server ne changerait rien en soi, c'est juste que j'ai des habitudes de petit vieux. Si je devais faire des tutoriels pour débutants, dans le but de miner via XMRig, je conseillerai Xubuntu. L'environnement de bureau (XFCE) est plus léger et bouffera moins de ressources que Ubuntu avec Gnome ou autre. Lubuntu (bureau LXDE) est cool aussi, mais il semble qu'il n'est plus mis à jour. Openbox est un meilleur environnement, plus léger mais beaucoup moins facile à prendre en main pour des débutants.Si tu veux une stabilité optimale et gratter quelques H/s en minant un CPU-coin, tu installes Ubuntu, Debian, ou Xubuntu. Tu télécharges XMRig et configures ton config.json comme d'habitude, depuis l'environnement de bureau classique. Une fois que tout est prêt, tu te mets dans le TTY, comme ça tu libères un peu de ressources en enlevant ton interface graphique, et tu lances ton \"sudo ./xmrig\" depuis le TTY. Pour y accéder tu fais Ctrl+Alt+F1 (ou F2, F3, F4, F5, F6 peu importe) et pour en sortir Ctrl+Alt+F7.De plus, si tu as par exemple lancé ton Xmrig dans TTY F1, rien ne t'empêche d'ouvrir TTY F2 en parallèle et de lancer BPYtop. Cela te permettra de surveiller les températures de ton CPU et l'usage network/CPU/Ram, pour être sur que tout est ok, et aussi kill certaines tâches inutiles pour libérer plus de ressources.À bientôt !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}