{
  "id": "topic_5437848",
  "title": "flyingcarpet",
  "author": "flyingcarpet",
  "created_time": "February 02, 2023, 09:01:19 PM",
  "content": "Size yakınımın başına gelen bir başarısızlık(!) hikayesinin aynısını yaşamış olan bir kişinin yayınladığı konuşmayı anlatmak ve izletmek istiyorum. Yakın zamanda benzer bir durum karşısında kalan ve tedxte konuşma yapan bir arkadaşı paylaşıcam. Bu konuşmayı dinlemeseydim paylaşmak aklıma gelmezdi. Vidyodan öne çıkan bazı cümlelere yer vericem.Akademisyen olmak için 3 tane sınava girmek gerekiyor. ALES, yabancı dil ve lisans ortalaması. Bunların hepsinde derece yapan bir insan düşünün. Birinci mülakata giriyor eleniyor. İkinciye giriyor eleniyor. Derken 4-5-6-7.Bütün mülakatlarını birincilikle bitiren ama elenen birini düşünün.Behçet dediler \"mal mısın?\" Ara bul adamını gir kadroya.Üzerinde eşofmanla mülakata giren bir kişi geliyor ve kapıdan geçen genel sekretere BABİŞKO diye sesleniyor. Bu insanların onca yıllık çalışmalarının sonucu \"bir babişko asumanın başrol olduğu bir tiyatro oyununda arkada dekor olmakmış!\"Sizden ricam eğer bir gün makam sahibi olursanız hak edenin hakkını yemeyin. Biz bazı şeyleri değiştirmezsek kimse değiştirmez. Bir yerlere geldiğimizde onlar gibi olmayalım. Lütfen önce bu özeti izleyin sonra uzun vidyoya geçin.https://www.instagram.com/reel/CoCzSzPLqcN/?igshid=MWI4MTIyMDE%3DUzun halihttps://www.youtube.com/watch?v=czotJvJxWHU",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437848",
  "comments": [
    {
      "author": "judas",
      "created_time": "February 02, 2023, 10:04:26 PM",
      "body": "Maalesef devlette yapılan mülakatların tamamı bu şekilde en basitinden bugün hakim-savcı olmak için yazılı sınava girseniz sözlü mülakatlarda torpil aramanız gerekiyor bunu herkes biliyor ve herkes bildiği için yok böyle bir şey demek yerine eskiden de böyleydi demekle yetiniyorlar.Bu ülkede ne zaman eskiden daha kötüydü argümanı yerine nasıl düzeltebiliriz argümanı gelirse ancak o zaman düzelebiliriz ancak ben bunu pek mümkün görmüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "February 03, 2023, 08:50:25 AM",
      "body": "O kadar güzel anlatmış ki videoda durumu. Bilgisi, o iş için kalitesi olmayan birileri sırf tanıdık diye kadro sahibi oluyor. Kadro aldıktan sonra neyi anlatacak neyi geliştirecek kime bir şeyler katacak. Birinin puanı 90’dır gidin 85’i alın o da en azından uygundur gözüyle bakılabilsin. Ama tüm ortalamaları yüksek olan başvuru sahiplerinin mülakatlarda aldıkları komik puanlar elenmelerine sebep oluyor. Her işimizde böyle malesef. Bu konuşmayı daha önceden dinlemiştim ve gerçekten değişmesi gereken bir konuyu ele almış. Hatırlattığınız ve başkalarının görmesini sağladığınız için teşekkürler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "February 03, 2023, 01:52:46 PM",
      "body": "Türkiyede liyakatsizlik en güzel bu hikayeyle anlatılabilirdi, bu hikayeyi daha önce de duymuştum, instagramda izledim galiba, doğru söylüyor çocuk ayrıca bu arkadaş yds ve aleste derece yapmış bir arkadaş, girdiği her mülakata birincilikle giriyordu diye hatırlıyorum, Türkiyede böyle, Babişko Asuman günün birinde gönderilir belki ama onu biz göremeyiz,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "February 03, 2023, 02:48:38 PM",
      "body": "Bu tür haberlere alışmadınız mı daha?Maalesef Türkiye’de vasıfa değer biçilmiyor.Değer biçilen şey vasıfsız insanların kimin adamı olduğu.Neyi yadırgıyorsunuz ki?Başbakanları hatırlayın, şimdiki ekonomi bakanına bakın, Merkez Bankası başkanlarına bakın hangisi doğru da bu olay doğru olsun?Türkiye’de yeniden reform şart.Puana göre hak ediliş, sağlık raporu ile belgeleme ile herkes hak ettiği yere puanıyla girebilmeli.Mülakat torpil demek",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "February 04, 2023, 09:28:09 PM",
      "body": "Maalesef çok doğru. Bunun örneklerine çok sefer acı içinde şahit oldum. Sadece devlette değil, neredeyse her yerde var. Dünyanın en büyük şirketlerinin Türkiye ofislerinde işe alınmada bile yapılıyor Türkiye'de. Herkes bi tanıdığını alıyor. Bizim şirkete başka bir birimdeki müdürün kızı alındı. Kız rezalet ama sıfır bilgi sıfır mühendislik, en azından excel bilmiş olsa tamam diyeceğim ama excel bile bilmiyor. Başka bi konuda ise geçen doktora gittik. 3-4 kişi bekliyoruz, mesainin bitmesine az var. Orta yaşlarda bi çift geldi, profesöre muayene olmaya geldik dediler. Sekreter randevularını sordu ve maalesef randevusuz alamayacaklarını söyledi. Kadın da bizi işte Ahmet bey gönderdi, bu da kartı, hocayı görebileceğimizi yardımcı olacağını söyledi dedi. Tamam ben bi hocaya sorayım dedi sekreter ve sanırım bizden sonra onları aldı. Eğer diğer bekleyen hastaları alamadıysa büyük haksızlık. Eğer benim önüme geçseydi ve beni almasalardı çok büyük olay çıkarırdım. Ama bu sefer de doktor gıcık olup bakmayabilirdi mesela. İşe alımdan böyle konulara, ne olursa olsun haksızlık yapmak açıkça büyük oçluğu bence. Emeğinizin yendiğini görürseniz çıldırıyorsunuz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}