{
  "id": "topic_5406746",
  "title": "Pmalek",
  "author": "Pmalek",
  "created_time": "July 18, 2022, 05:54:08 PM",
  "content": "I just thought of something interesting while bumping one of my threads. Bitcointalk rents out advertising space, right? We also have a news field on top where important announcements are made. Usually, it's about the latest Bitcoin Core release. How great would it be if the forum made available some room to advertise a thread with a list of users who would be interested in advertising (via signatures, avatars, or personal texts) Bitcoin services for free?! Obviously, I am not talking about the usual casinos and stuff like that. I am talking about new projects or software developed by individuals who don't have the resources to pay for advertising. We as a community could do that and not charge them anything.If ad space is asking too much, I understand. How about if the news field mentioned that thread and had a link to it?Wouldn't this also be a great way to maybe attract some new Bitcointalk users - the right kind? People creating something of value and looking to get more exposure. We would obviously have to advertise the fact that we are willing to advertise good Bitcoin community projects outside of this forum. Social media like Reddit, Discord, Twitter, and other online communities. For that, we will need the help of people using those sites who have good-standing accounts/profiles and are willing to help.How would this work?1. We create a thread (I can do that) with a simple question asking forum members if they are willing to advertise Bitcoin projects for free? The thread would point to this discussion. Users can then make themselves available and mention if they want to offer their signature space, avatars, and/or personal text for this purpose.There are people here that aren't part of paid signature campaigns and some who are but don't need their avatars and/or text field. 2. A user comes along and introduces their idea on the forum. If people like it, they offer the person free advertising. In exchange, whatever service and/or project gets developed has to be announced on Bitcointalk as well, have its own thread here with support, and maybe some special promotions or deals for Bitcointalk members. That way, the person who gets free advertisement also gives something back to the community.3. The last step would be to create the signature and avatar and come up with a decent personal text message. We have people who offer these services here. We just have to see how much they would want for their work and if they would be willing to do it for free. Something simple that doesn't take too much time. Is this something we can create here to benefit the Bitcoin ecosystem? One problem I see here is that maybe there aren't that many projects that would meet our criteria to be advertised. Obviously, comments and suggestions are welcome.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406746",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "July 18, 2022, 08:02:50 PM",
      "body": "The way I see it, this doesn't have to be a forum generated service, and it's unlikely it will be. I can hardly see the admin creating room for a list of free advertisers on the forum.This can be purely community generated; As you said, a user can create a thread for this, maybe in services section and willing users can indicate. After this, there would be a consensus on what projects to be promoted and for how long. Personally, I also don't see if this would be practical or sustainable.Anyone who wishes to wear a signature, but is not interested in joining a paid campaign, can always select a business or charity of their choice to advertise. The only limitation to this is that, their preferred project may not have a forum signature design.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 19, 2022, 01:45:54 AM",
      "body": "Quote from: Pmalek on July 18, 2022, 05:54:08 PM1. We create a thread (I can do that) with a simple question asking forum members if they are willing to advertise Bitcoin projects for free? The thread would point to this discussion. Users can then make themselves available and mention if they want to offer their signature space, avatars, and/or personal text for this purpose.There are people here that aren't part of paid signature campaigns and some who are but don't need their avatars and/or text field. You can create yours with very special objectives as you said or you can bring them to my topic[Overview] Bitcointalk Services from Bitcointalk MembersIt was not created with too narrow and specific objectives like what you're discussing but I included some free services there, yours and xhomerx10 who makes cool hats in Wall Observer thread.In general, I think a community-led thread is good enough. Moderators will not have time to moderate, edit and update info if forum has a child board and a thread for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 19, 2022, 09:28:33 AM",
      "body": "Quote from: Upgrade00 on July 18, 2022, 08:02:50 PMThe way I see it, this doesn't have to be a forum generated service, and it's unlikely it will be. I can hardly see the admin creating room for a list of free advertisers on the forum. I did message theymos about it and there is something he would be willing to do to help out if needed. I will quote his message here if he agrees with that. I PMed him and asked about it. Quote from: Upgrade00 on July 18, 2022, 08:02:50 PMThis can be purely community generated; As you said, a user can create a thread for this, maybe in services section and willing users can indicate. Not everyone will be able to find that and it can get confusing for new forum members to go looking through the services section. How would they even know that someone would be willing to do that unless they hear the announcement somewhere or see a post about it on a different forum or social media, for example? Quote from: tranthidung on July 19, 2022, 01:45:54 AM<Snip> Great thread! Thanks for doing that. Here is the thing though. This is the first time I see it. And I am a regular and someone who uses Bitcointalk every day. Maybe if you hadn't linked to it, I still wouldn't have learned about it. Sure, it's just 3 days old, but still. I am not that active in that particular part of the forum, but I go there sometimes. Now, imagine if your thread was mentioned in a forum ad or the news field? People would discover it in greater numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 19, 2022, 03:49:09 PM",
      "body": "Quote from: Pmalek on July 18, 2022, 05:54:08 PMHow great would it be if the forum made available some room to advertise a thread with a list of users who would be interested in advertising (via signatures, avatars, or personal texts) Bitcoin services for free?!I have no idea how this would work in everyday forum life, but you could create poll and ask people to vote if they are interested in having something like this.Like with everything else, this could also be abused, so I would be very careful introducing this in correct way not allowing to advertise some suspicious projects or scams.Quote from: Pmalek on July 18, 2022, 05:54:08 PMThe last step would be to create the signature and avatar and come up with a decent personal text message. We have people who offer these services here. We just have to see how much they would want for their work and if they would be willing to do it for free. Something simple that doesn't take too much time. I am not sure about signatures that probably need more time for creating, but it's not that hard for anyone to create simple avatars in photoshop, and some designers could probably help if needed.I remember someone started a cool idea for editing BestChange avatars so many people created their own custom versions.Quote from: Pmalek on July 18, 2022, 05:54:08 PMIs this something we can create here to benefit the Bitcoin ecosystem? One problem I see here is that maybe there aren't that many projects that would meet our criteria to be advertised. Obviously, comments and suggestions are welcome.It can have beneficial if people are interested in discussion about specific Bitcoin related project, but I would include anything related with bitcointalk forum.We can already see people are wearing advertisement for managers, and this can be applied for anything else including marketplace, for example if I want to sell or buy something.Let's say if I want to buy or sell new laptop, smartphone or bitcoin asic miner, I could add that in my profile with link to specific topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 19, 2022, 05:59:51 PM",
      "body": "Quote from: dkbit98 on July 19, 2022, 03:49:09 PMI have no idea how this would work in everyday forum life, but you could create poll and ask people to vote if they are interested in having something like this. That's one possibility. That way I could check if the community is interested in advertising a service for free during times when they are not in signature/avatar campaigns or are generally not interested in taking part in paid promotions for whatever reasons.Quote from: dkbit98 on July 19, 2022, 03:49:09 PMLike with everything else, this could also be abused, so I would be very careful introducing this in correct way not allowing to advertise some suspicious projects or scams. That danger is always there. New coins and tokens would definitely not be considered. The person would have to make a post and introduce their service/website and let Bitcointalk know how it works and what they are planning to create. With enough questions and answers, I think we would get a good understanding of what it is.Quote from: dkbit98 on July 19, 2022, 03:49:09 PMIt can have beneficial if people are interested in discussion about specific Bitcoin related project, but I would include anything related with bitcointalk forum.We can already see people are wearing advertisement for managers, and this can be applied for anything else including marketplace, for example if I want to sell or buy something.Let's say if I want to buy or sell new laptop, smartphone or bitcoin asic miner, I could add that in my profile with link to specific topic. Yeah, it doesn't even have to be a specific service or website, it can be an ad for the marketplace on Bitcointalk as the location for exchanging various coins or buying physical goods for Bitcoin. It might draw in some new people willing to trade, but it might also attract scammers and make things even worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 19, 2022, 06:19:51 PM",
      "body": "Sounds like a good idea, but it was already implemented. I remember that there were some free signature campaigns that used to raise charitable money or help people spend Merits for art and other campaigns.There is no objection to advertising your campaign and making people wear signatures for free, and therefore there is no objection to creating topics that encourage that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 19, 2022, 06:32:05 PM",
      "body": "Quote from: Pmalek on July 18, 2022, 05:54:08 PMObviously, comments and suggestions are welcome.For projects like preev.com, bitcoinpricecalc.com who does not have any interest to make it a money machine but to give back to the community, this is a good idea to help them. Problem will start when there will be conflict of interests among forum users when some will not get the opportunity, they will think it was unjustified for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 19, 2022, 06:35:58 PM",
      "body": "Quote from: Upgrade00 on July 18, 2022, 08:02:50 PMAnyone who wishes to wear a signature, but is not interested in joining a paid campaign, can always select a business or charity of their choice to advertise. The only limitation to this is that, their preferred project may not have a forum signature design.accept this kind of approach to everything that the OP presented. I agree that the forum could be a little more friendly towards new prospective projects, surely there are ways to make better use of this community for them.I don't expect anyone to leave a (well) paid signature campaign for the free promotion of something new. Most of the good posters and most active members have been in long-term campaigns for a long time. I think that the number of users who are free and want to wear signatures for free is too small. too small to adapt the forum to them.it is easy for us from a comfortable position (from a well-paid campaign) to encourage others to carry the advertisement for free.Quote from: Pmalek on July 19, 2022, 05:59:51 PMQuote from: dkbit98 on July 19, 2022, 03:49:09 PMLike with everything else, this could also be abused, so I would be very careful introducing this in correct way not allowing to advertise some suspicious projects or scams. That danger is always there. New coins and tokens would definitely not be considered. The person would have to make a post and introduce their service/website and let Bitcointalk know how it works and what they are planning to create. With enough questions and answers, I think we would get a good understanding of what it is.I believe that it will be very difficult to reach a consensus here, on what is acceptable or good enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 19, 2022, 07:24:09 PM",
      "body": "The idea of giving some freehand to projects that could lit the crypto space isn't out of hand but there are a lot of questions to this and most of them is contained in your third paragraph.Quote from: Pmalek on July 18, 2022, 05:54:08 PMIf ad space is asking too much, I understand. How about if the news field mentioned that thread and had a link to it?Clearly we have a news filed and I supposed its working very well and I perhaps your proposal would be maybe a subboard or pinned post that carries these projects. Just maybe posting your service thread on the service board is also so promotional strategy that comes without any financing but, having people to wear them for free would be something most users wouldn't want as, you stick out a lot in advertising some projects. When it comes to creating a free ads space for this on the forum, it's likely not going to be seen on this rarely updated SMF forum software perhaps we could expect that in the new forum software but the questions becomes of exploitation as, * Every developer would try to reap from the opened window. I mean, why should I pay when I can get it for free right?* How do you determine a genuine broke guy with an idea from a financially capable one in an anonymous space?Quote from: Pmalek on July 18, 2022, 05:54:08 PMWouldn't this also be a great way to maybe attract some new Bitcointalk users - the right kind? I don't think the form gives more concern to the I flux of users here over time but still, we do okay.* How do you come to the right kind conclusion on a forum that doesn't moderate scams but just sticks its moderation to its rules.I mean, the right kind kind could go rogue and that been after the damage have been done by promotions like we saw in BitLucy.That won't tell so well of the forum because, we ran it free as forum supported or endorsed and that even puts the project ahead of many paid offers. Consequently, would make users ignore other options and search out for a forum endorsed promotion.Quote from: Pmalek on July 18, 2022, 05:54:08 PMPeople creating something of value and looking to get more exposure. We would obviously have to advertise the fact that we are willing to advertise good Bitcoin community projects outside of this forum. Social media like Reddit, Discord, Twitter, and other online communities. For that, we will need the help of people using those sites who have good-standing accounts/profiles and are willing to help.* Sure this isn't so much for something your not exactly on  the team?As a matter of necessity, non profit oriented projects should fit best to benefit from this initiative if it ever comes to light.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 19, 2022, 08:38:38 PM",
      "body": "Quote from: Pmalek on July 18, 2022, 05:54:08 PMOn a general note, your idea is indeed a good one, but I highly doubt its workability, this is due to various issues and concerns which i will pen down below.... QuoteThere are people here that aren't part of paid signature campaigns and some who are but don't need their avatars and/or text field. It is indeed true that some users on the forum aren't part of signature campaigns, but this users are not really active if you check, don't you think this set of users coming out to offer free advertising to a project wouldn't really give the project that much exposure since the users in question are not active?And speaking of those that might want to offer their Avatar and personal text, how many are they? is it really worth the effort?.QuoteA user comes along and introduces their idea on the forum. If people like it, they offer the person free advertising.This will only end up being another way scammers and fraudsters going to use to get free advertising on the forum, and you know what? its not just going to be walking away with free advertising, they are also going to be walking away with money belonging to many forum members, and this, honestly wont be cool. QuoteIs this something we can create here to benefit the Bitcoin ecosystem? One problem I see here is that maybe there aren't that many projects that would meet our criteria to be advertised. Like I said before, the idea is good and would really be a good way of supporting new projects, but this might not work if stringent/strict rules are not put in place that will deter scammers and fraudsters from using the program as a means of advertising their fake project and finding more victims to scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 20, 2022, 06:39:31 AM",
      "body": "This is actually a brilliant idea, as it will exposed us to more crypto projects and software that could be of good use to us as nobody can tell yet. And it will be nice if authors of good books about cryptocurrency are also given chance to advertise there books.Quote from: Pmalek on July 18, 2022, 05:54:08 PM2. A user comes along and introduces their idea on the forum. If people like it, they offer the person free advertising. In exchange, whatever service and/or project gets developed has to be announced on Bitcointalk as well, have its own thread here with support, and maybe some special promotions or deals for Bitcointalk members. That way, the person who gets free advertisement also gives something back to the community.And that's good as it will expose more people to the bitcointalk forum, because am sure is not everybody who is into crypto who knows about this forumQuote3. The last step would be to create the signature and avatar and come up with a decent personal text message. We have people who offer these services here. We just have to see how much they would want for their work and if they would be willing to do it for free. Something simple that doesn't take too much time. And by doing so, help to provide jobs to those who offer services on the forum even thou the charges won't be much.And I would have suggest that for a project to be eligible for free advert, it has to be scrutinized and ensure its not a scam, and like 2 trusted members on the forum can be selected to do that job so that the work load not be much on you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 20, 2022, 09:28:56 AM",
      "body": "I mentioned previously that I mentioned this idea briefly to theymos, and here is what he said about it. I am sharing his entire quote but I would like to emphasize the last thing he said:Quote from: theymos on July 19, 2022, 12:52:52 AMI feel like the thing with people doing free signature ads etc. will not be very popular. You could try it, but I don't want to promote it right now.QuoteObviously, I am not talking about the usual casinos and stuff like that. I am talking about new projects or software developed by individuals who don't have the resources to pay for advertising. We as a community could do that and not charge them anything.For this sort of thing, I might be willing to give them a factoid slot, especially if the thing-to-be-advertised doesn't make any money. BPIP has several free factoid slots, for example. If an appropriate service appears, please create a topic in Meta about giving it a factoid slot.Thanks.  Quote from: BitcoinGirl.Club on July 19, 2022, 06:32:05 PMProblem will start when there will be conflict of interests among forum users when some will not get the opportunity, they will think it was unjustified for them. There is no perfect system and you can't make everyone happy. You can try your best to stay neutral and professional though. Ultimately, each person should have the right to promote what they believe is right or better. Quote from: examplens on July 19, 2022, 06:35:58 PMI don't expect anyone to leave a (well) paid signature campaign for the free promotion of something new. Most of the good posters and most active members have been in long-term campaigns for a long time. I think that the number of users who are free and want to wear signatures for free is too small. too small to adapt the forum to them.it is easy for us from a comfortable position (from a well-paid campaign) to encourage others to carry the advertisement for free. That's not something I expect either. It could be something that posters who aren't in a paid campaign would be interested in. Let's take ChipMixer as an example. This campaign doesn't require their participants to wear avatars and personal texts. I am sure that some of them would be willing to wear an avatar or text for free as they have done in the past as well. With that in mind, you get good good posters that have room to promote other services as well.Quote from: Smartvirus on July 19, 2022, 07:24:09 PMClearly we have a news filed and I supposed its working very well and I perhaps your proposal would be maybe a subboard or pinned post that carries these projects. Not a new sub-board. It's complicated enough with the ones we have.  Quote from: Smartvirus on July 19, 2022, 07:24:09 PM* Every developer would try to reap from the opened window. I mean, why should I pay when I can get it for free right?* How do you determine a genuine broke guy with an idea from a financially capable one in an anonymous space? These are legitimate questions and concerns. That's why we have discussions like this one to find the best solutions. Quote from: Smartvirus on July 19, 2022, 07:24:09 PM* Sure this isn't so much for something your not exactly on  the team? Sorry, I didn't understand what you are asking here.Quote from: Fivestar4everMVP on July 19, 2022, 08:38:38 PMAnd speaking of those that might want to offer their Avatar and personal text, how many are they? is it really worth the effort? Like dkbit98 mentioned in his post, I can always create a poll and ask. But the results can be totally fake and people could lie intentionally. We might not know for sure until such a campaign starts. Quote from: Fivestar4everMVP on July 19, 2022, 08:38:38 PMThis will only end up being another way scammers and fraudsters going to use to get free advertising on the forum, and you know what? its not just going to be walking away with free advertising, they are also going to be walking away with money belonging to many forum members, and this, honestly wont be cool. You are thinking about some type of fundraising. That would surely not be something I would advertise. If someone wants to donate to a project, it's their responsibility to research what it's about and not trust me or anyone else just because we are advertising it. It's the same thing as with the casino ads you see. You are not just gonna deposit money in one unless you have checked their history to make sure they don't have a tendency to scam their players.Quote from: CryptoHeadlineNews on July 20, 2022, 06:39:31 AMAnd I would have suggest that for a project to be eligible for free advert, it has to be scrutinized and ensure its not a scam, and like 2 trusted members on the forum can be selected to do that job so that the work load not be much on you I am surely not a scam hunter nor do I plan to spend my days inspecting everything there is. There are many people who like that sort of thing and are good at it and they can do it if they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "July 20, 2022, 09:43:15 AM",
      "body": "You just convince scammer to come here because there is a free advertising campaign running in this forum.Instead of helping those people to have free advertisement why not create a free thread group which other people can volunteer to participate then those businessman who want to avail the project need to pay and the payments will go directly to theymos wallet address use on auction for sure this will help more the forum and it will be beneficial to all users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 20, 2022, 12:13:52 PM",
      "body": "Quote from: avp2306 on July 20, 2022, 09:43:15 AMInstead of helping those people to have free advertisement why not create a free thread group which other people can volunteer to participate then those businessman who want to avail the project need to pay and the payments will go directly to theymos wallet address use on auction for sure this will help more the forum and it will be beneficial to all users.The whole point of OP is to help bitcoin projects giving a free advertising.QuoteYou just convince scammer to come here because there is a free advertising campaign running in this forum.I do not think members are not smarter enough to sport the scammers. If someone wants to misuse it then they will have difficult time. There are genuine projects that need help and they will be the priority.Quote from: Pmalek on July 20, 2022, 09:28:56 AMQuote from: BitcoinGirl.Club on July 19, 2022, 06:32:05 PMProblem will start when there will be conflict of interests among forum users when some will not get the opportunity, they will think it was unjustified for them. There is no perfect system and you can't make everyone happy. You can try your best to stay neutral and professional though. Ultimately, each person should have the right to promote what they believe is right or better. It's possible when a group of users or individual will give their time voluntarily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 20, 2022, 12:20:38 PM",
      "body": "Quote from: avp2306 on July 20, 2022, 09:43:15 AMInstead of helping those people to have free advertisement why not create a free thread group...  What in God's name is a \"free thread group?\"Quote from: avp2306 on July 20, 2022, 09:43:15 AMwhich other people can volunteer to participate then those businessman who want to avail the project need to pay Pay? Didn't you say in your previous sentence that the \"thread group\" is free? So the \"businessmen\" need to pay a fee in the \"free thread group\" for what exactly? For promotion? How is that different from a classic signature campaign? I am trying to give legitimate projects (if we can find such) some free promotion. I don't want to create some free group to collect money.  Quote from: avp2306 on July 20, 2022, 09:43:15 AMand the payments will go directly to theymos wallet address use on auction for sure this will help more the forum and it will be beneficial to all users. The forum doesn't need financial aid. Bitcointalk has millions of dollars worth of Bitcoin. What would be auctioned off? \"Free thread group\" t-shirts and other merchandise? Maybe a \"free thread group\" physical Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 22, 2022, 09:43:56 AM",
      "body": "Many Bitcoiners are advocating for the use of decentralized exchanges instead of centralized ones, and rightly so. Since one of the most popular ones is Bisq, how would the community feel about promoting Bisq for free by wearing a signature, avatar, or a personal text for a while. It's not really the thing I had in mind when I started this topic, which was supposed to be about promoting new projects, but I feel like it's still a good idea.I don't remember ever seeing an ad for Bisq anywhere and I don't think they pay much attention to marketing. Before I create a poll to see how interested people would be in advertising something for free, I would like to hear what you think about having Bisq as the first project?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 22, 2022, 04:56:31 PM",
      "body": "Quote from: Pmalek on July 20, 2022, 09:28:56 AMQuote from: Smartvirus on July 19, 2022, 07:24:09 PM* Sure this isn't so much for something your not exactly on  the team? Sorry, I didn't understand what you are asking here.I guess what I was trying to say is, \"sure this isn't so much for something your not directly on the team?\".Apparently, it won't be a one man thing vouching for services that could surface on the proposed advert space, perhaps it might come through some pool voting of some sort as we do often on the forum but, won't it be so much to actually stick put your neck whe you aren't directly on the development team? I mean, a project could turn out to be a scam at any point, even legitimate once and you never can tell of projects having back doors and shits like that until the damage begins to manifest and then, we would have ourselves to blame. Am just saying!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 23, 2022, 07:22:48 AM",
      "body": "Quote from: ETFbitcoin on July 22, 2022, 11:30:58 AMI think it's fine idea as long as it has decent design/text, but i have small concern since it'd be unofficial promotion. Concerns in what way? Do you mean there will be a lack of interest in promoting something in this way?Quote from: Smartvirus on July 22, 2022, 04:56:31 PMI guess what I was trying to say is, \"sure this isn't so much for something your not directly on the team?\". Nice, repeat it a second time in the same way. That makes it much clearer. Quote from: Smartvirus on July 22, 2022, 04:56:31 PMI mean, a project could turn out to be a scam at any point, even legitimate once and you never can tell of projects having back doors and shits like that until the damage begins to manifest and then, we would have ourselves to blame. Am just saying! You can say the same thing about any service or campaign that is currently running on the forum. Anything we advertise right now (you, me, and everyone else) can in theory turn into a scam. There is no difference if you are getting paid for the promotion or not. You shouldn't advertise known scams, but no one has a Magic 8 ball to see what will happen in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "July 23, 2022, 12:01:50 PM",
      "body": "In my opinion, this idea makes sense and would be a great way to support new projects, but there's one glaring problem: who is going to decide what projects make it in? How will they be selected?There are a number of scammers in the industry who will just try to take peoples money away, and to get rich off of this. If this is used for the success of new projects, then it has to be done right. I'm hopeful that we can come up with a way for people to provide feedback and in turn, make the decision for new projects to be accepted. But I'm not sure how we would accomplish this.Quote from: Pmalek on July 23, 2022, 07:22:48 AMQuote from: Smartvirus on July 22, 2022, 04:56:31 PMI mean, a project could turn out to be a scam at any point, even legitimate once and you never can tell of projects having back doors and shits like that until the damage begins to manifest and then, we would have ourselves to blame. Am just saying! You can say the same thing about any service or campaign that is currently running on the forum. Anything we advertise right now (you, me, and everyone else) can in theory turn into a scam. There is no difference if you are getting paid for the promotion or not. You shouldn't advertise known scams, but no one has a Magic 8 ball to see what will happen in the future.It is true, but there is a difference. Current signature campaigns cost money, and scammers generally can't afford or don't want to spend money on promotion. There were some exceptions, of course, such as Yobit, 1xbit and similar scams. However, this has been handled with a negative trust for the participants since they received financial benefits from promoting scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}