{
  "id": "topic_5433117",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "January 05, 2023, 12:20:24 PM",
  "content": "Events in the last few weeks have drastically affected bitcoin price as the price of bitcoin has struggled to remain around $16k with heavy resistance to push above 20k in the last few days into 2023.Since the FTX and LuNA crises started Bitcoin has struggled to retain its previous price before the attack which was around 25k-30 benchmarks.The question now is with the current bitcoin price outlook what is the possible bitcoin January price outlook you can speculate on based on your personal market analyses?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433117",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "January 05, 2023, 12:56:28 PM",
      "body": "Bitcoin price, January. $20000 or above possible?Bitcoin was not up to $22000 during FTX implosion. Bitcoin price was over $30000 or even $40000 during Luna and UST crash, that was when bitcoin crashed to $17600 before it increased to $25000 and decreased to $18000 like that like repeatedly. It was around $21000 before the FTX implosion that crashed it below $15600.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davian144",
      "created_time": "January 05, 2023, 01:23:41 PM",
      "body": "Quote from: Ojima-ojo on January 05, 2023, 12:20:24 PMThe question now is with the current bitcoin price outlook what is the possible bitcoin January price outlook you can speculate on based on your personal market analyses?Today the Bitcoin price almost touched $ 17K, and if in the next few days the Bitcoin price can still bounce up. It's likely that it will pass $17K and will even be very close to $18K, as I'm hesitant to say more than that right now. This is caused by the slow movement of Bitcoin prices in the market for higher levels so I only believe in the price range of $ 17K - $ 18K in the near future. What do you think about @OP ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "January 05, 2023, 01:26:35 PM",
      "body": "Sorry to say this is just beginning of the year and from my own understanding there wouldn't be any much different between last year and this year price of bitcoin, the main target would be like maybe after it's circle next year then we could greatly experience a dynamic change which would likely result to another ATH. So for this year expect bitcoin to be hovering and dangling around $16k to $25k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minor Miner",
      "created_time": "January 05, 2023, 01:37:04 PM",
      "body": "The market is giving a positive signal, and we are seeing the green color we haven't seen in a long time, but the Fuds about DGC and Gemini are still spreading in the market, so I don't have many expectations. My prediction is that if bitcoin can recover, then chances of bitcoin hitting the 18k$ before falling again. According to my predictions for Q1, I think we are going to have another red quarter, and I think we'll bottom out this bear season in Q1 of 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 05, 2023, 01:40:48 PM",
      "body": "Quote from: Adbitco on January 05, 2023, 01:26:35 PMSorry to say this is just beginning of the year and from my own understanding there wouldn't be any much different between last year and this year price of bitcoin, the main target would be like maybe after it's circle next year then we could greatly experience a dynamic change which would likely result to another ATH. So for this year expect bitcoin to be hovering and dangling around $16k to $25k.I have sane view to as yours I believe it will struggle from now till like middle of the year and would be around 20k less, then I believe a bullish period might happen during the last quarter of the year because as at then people might looking towards the 2024 halving and more accumulation will take place then. This might take bitcoin price towards 30k or so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "January 05, 2023, 01:52:39 PM",
      "body": "Own personal analysis base on how the economy is? It might get worst. It's not like we are feeling rich again just like how it is 3 years ago before the pandemic came. No buyers mean no demand, no demands mean no price hike. I'd rather stick with that kind of expectation than be mad about rushing the value to go up. It will happen but I just don't feel it yet. There's no big player trying to buy loads of Bitcoin now. Maybe they are waiting for another big dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "January 05, 2023, 01:57:23 PM",
      "body": "Quote from: Adbitco on January 05, 2023, 01:26:35 PMSorry to say this is just beginning of the year and from my own understanding there wouldn't be any much difference between last year's and this year's price of bitcoin, the main target would be that maybe after its circle next year then we could greatly experience a dynamic change which would likely result to another ATH. So for this year expect bitcoin to be hovering and dangling around $16k to $25k.You are right most bitcoin speculator is all pointing to the same time cycle and alit of hype have been put into the next bitcoin halving but what we should be well aware of is that, there is no certainty as to when the price of bitcoin will witness a significant increase after the halving.But certainly, we should expect a new all time high in that event, and bitcoin will reach and surpass that block.But from 2023-2024 when the price of bitcoin will rise, there will be alot of price changes in the market and so many events will affect the price of bitcoin to either pull it up or press down the price further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "January 05, 2023, 02:42:52 PM",
      "body": "Quote from: Ojima-ojo on January 05, 2023, 12:20:24 PMThe question now is with the current bitcoin price outlook what is the possible bitcoin January price outlook you can speculate on based on your personal market analyses?I may have to stop for a moment to see and speculate and predict the crypto market, especially Bitcoin, maybe we have seen that there are various speculations that will appear in 2023, but I remain in my stance for the development of crypto this year.I think speculation and prediction is not good for me, maybe, i have been in crypto for many years, if i guide speculation always i lose, I consider that currently Bitcoin is on the verge of a bear market, most likely in my understanding a bull market will occur, but not now, for that I have the principle to invest as much as possible without being limited, I think that's the right step, rather than me having to be confused by the current Bitcoin speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "January 05, 2023, 03:20:39 PM",
      "body": "Quote from: Ojima-ojo on January 05, 2023, 12:20:24 PMEvents in the last few weeks have drastically affected bitcoin price as the price of bitcoin has struggled to remain around $16k with heavy resistance to push above 20k in the last few days into 2023.Since the FTX and LuNA crises started Bitcoin has struggled to retain its previous price before the attack which was around 25k-30 benchmarks.The question now is with the current bitcoin price outlook what is the possible bitcoin January price outlook you can speculate on based on your personal market analyses?I too agree than FTX and Luna crises made a lot of impact on Bitcoins. Due to this many investors instead of holding their coins, sold it. Now as there were more sell orders then buy orders, this lead Bitcoins to go down in the prices. If we see the last week, then Bitcoins really tried hard to get out of the price segment by breaking the resistance, but still it was not at all good to be honest. Now everyone is just holding the coins and hoping for some positive signs. January is the time when BTC needs to prove his capabilities. Let’s hope for the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "January 05, 2023, 04:08:56 PM",
      "body": "I'm not going to make excessive speculation at this time, I'm more focused on buying bitcoins that will be held for the long term, so I won't make this analysis frustrating if I keep thinking about it, but one thing, of course, I expect any positive trend this January.I saw in some recent articles that bitcoin will experience an increase at the beginning of this year allowing it to penetrate $ 20k, but this is still too far because currently it is still stuck at $ 16k and it is difficult to reach $ 17k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 05, 2023, 04:17:04 PM",
      "body": "Unless we see a solid signal by breaking $17k resistance it remains very hard to predict the market. But there is a good chance that we are going to see a very boring market in the first week or two of January since this is just the start of the year and markets are still cold and in their winter sleep. After that we can look at the world economy to decide which direction is more likely to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "January 05, 2023, 07:05:33 PM",
      "body": "Historically, January has always been a bad month for cryptocurrencies, so it seems to me that this year the situation will be the same as usual. Although I expect that we will see growth this year, but most likely it will not happen at the beginning of the year. The main thing is to leave all negative events behind and not to have new collapses with big companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "January 05, 2023, 07:25:00 PM",
      "body": "Even then there we are seeing a resistance on between 16k to 17k but it is still very hard to say what is going to happen next in market because market signals condition are still very unstable. Because as you can see in the last couple of days, whenever we get a slight pump, it's been dumping again.So I think even though there is some resistance built up at 16k and 17k, I still think it will not pump much, which will be around 16/17.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "January 05, 2023, 07:45:32 PMLast edit: January 05, 2023, 11:44:40 PM by JoyMarsha",
      "body": "After the Luna and FXT event, which drove the price of bitcoin to $16k–$17k+, there has been no encouraging news in the crypto world that would skyrocket the bitcoin price at least. Since then, the price of bitcoin has been fluctuating between $17k and below for months, and it hasn't touched $20k yet. Because of no positive news yet in the crypto market of recent that can trigger the bitcoin price, am speculating that the price of bitcoin will hang around between $16k and $17k throughout the end of January.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "January 05, 2023, 08:01:10 PM",
      "body": "Quote from: pooya87 on January 05, 2023, 04:17:04 PMUnless we see a solid signal by breaking $17k resistance it remains very hard to predict the market. But there is a good chance that we are going to see a very boring market in the first week or two of January since this is just the start of the year and markets are still cold and in their winter sleep. After that we can look at the world economy to decide which direction is more likely to go.We have seen Bitcoin trying to reach the $17k even today before it dropped down to around $16800 and it has been hovering around that price since then, but seeing that speculating Bitcoin price has truly become a boring task since the market volatility have become relatively stable for a while now. But in the coming days we may see some level of changes in the price of Bitcoin and if all things being equal we should see a more uptrend movement soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "January 05, 2023, 08:45:40 PM",
      "body": "Quote from: $crypto$ on January 05, 2023, 04:08:56 PMI'm not going to make excessive speculation at this time, I'm more focused on buying bitcoins that will be held for the long term, so I won't make this analysis frustrating if I keep thinking about it, but one thing, of course, I expect any positive trend this January.I saw in some recent articles that bitcoin will experience an increase at the beginning of this year allowing it to penetrate $ 20k, but this is still too far because currently it is still stuck at $ 16k and it is difficult to reach $ 17k.Excessive speculations can be a waste of time since the price can still move as opposed to what we are speculating but you can not go wrong with buying and holding a Bitcoin. The price can fall but it will always bounce back so you still earn no matter what.If there is only one thing that I can't agree with you for now then that is my prediction about this January is negative because the price of BTC is still the same. You know when it is positive if it started the first week even with some minor recoveries but no that didn't happen. Reaching $17k isn't that hard because it's only $1k away from the current price but $20k rather although it is possible since we already get there before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "January 05, 2023, 08:46:38 PM",
      "body": "Quote from: Ojima-ojo on January 05, 2023, 12:20:24 PMThe question now is with the current bitcoin price outlook what is the possible bitcoin January price outlook you can speculate on based on your personal market analyses?Ranging below $16k and then up to $20k. This is for the month of January and that's what I think what might happen because with a long stability for its price, that's quite fearing for me as I've seen the same scene before when it's not moving a lot and then a sudden fall has came.No one knows exactly how it's going to be at the end of this month. But, if some unexpected big news comes then it'll again be dependable on how good or bad it is, the impact will be there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "January 05, 2023, 09:02:53 PM",
      "body": "Quote from: Adbitco on January 05, 2023, 01:26:35 PMSorry to say this is just beginning of the year and from my own understanding there wouldn't be any much different between last year and this year price of bitcoin, the main target would be like maybe after it's circle next year then we could greatly experience a dynamic change which would likely result to another ATH. So for this year expect bitcoin to be hovering and dangling around $16k to $25k.The behaviour of Bitcoin last year would also be similar to this year and if care is not taken the worse my happen this year than last year. This is why we must always be vigilant in the market not to relax and be carried away.Talking about the January price projection, if there are no bad news that always arise from exchanges or war between Nations we can be sure that bitcoin will likely torch 18000 dollars in this January which will likely build up to 20,000 dollars before march of this year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "January 05, 2023, 09:18:55 PM",
      "body": "Quote from: KingsDen on January 05, 2023, 09:02:53 PMThe behaviour of Bitcoin last year would also be similar to this year and if care is not taken the worse my happen this year than last year. This is why we must always be vigilant in the market not to relax and be carried away.When you talk about market cycle the behaviour of two years may be similar but the price of Bitcoin in both years can not be the same, because of some peculiar incidence that happened in both years.Take the FTX crisis for an instant, that incident alone affected the entire cryptocurncy market significantly, but we can assume the same in this year as the year just started and a lot of things will happen along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}