{
  "id": "topic_5471067",
  "title": "Zanab247",
  "author": "Zanab247",
  "created_time": "October 20, 2023, 03:56:25 PM",
  "content": "It was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place. If the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending for investors to use the period to earn more incomes from their investment and to plan well ahead of another bear to come. If this new increase turn to temptation in the crypto market by turning back to dumping again which are some of the things investors don't want to experience in this season because, it will cause Many losses to investors. Do you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471067",
  "comments": [
    {
      "author": "EL MOHA",
      "created_time": "October 20, 2023, 04:05:42 PM",
      "body": "This move could possible be traced to the third case win by ripple against SEC as I read today or the continuous assurance that approval of ETF would be done before this year ends. But regardless, this doesn’t seems like bull run yet to me till bitcoin finds a support on the $30000 Margin and continues to move. We once had the bitcoin almost passing $32000 in march and we all expected at least a mini bull run but it didn’t happen. So this time I am not going to be tempted again. But should it increase to the price I set to sell some then I might consider selling but right now I am all in holding stage till the real bull happens after halving next year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "October 20, 2023, 04:37:58 PM",
      "body": "Quote from: EL MOHA on October 20, 2023, 04:05:42 PMthis doesn’t seems like bull run yet to me till bitcoin finds a support on the $30000 Margin and continues to move. We once had the bitcoin almost passing $32000 in march and we all expected at least a mini bull run but it didn’t happen. So this time I am not going to be tempted again. But should it increase to the price I set to sell some then I might consider selling but right now I am all in holding stage till the real bull happens after halving next year Yeah, the currency chart shows a multiple top around 30k level which scary and at the same time promising since this can turn to a massive bullrun once the wall that denying Bitcoin to move forward suddenly break since the price will open up for much higher high.I’m really not comfortable if the price stays and make a support at 30K since we witness a lot of time that the price slide whenever it’s sideways on this level. I hope 35K above is the safe spot to consider this another bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 20, 2023, 05:02:30 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place. If the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending for investors to use the period to earn more incomes from their investment and to plan well ahead of another bear to come. If this new increase turn to temptation in the crypto market by turning back to dumping again which are some of the things investors don't want to experience in this season because, it will cause Many losses to investors. Do you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.This could be a bullish trend. Why not? If people now start investing in bitcoin, seeing the current price jump, this will further spur the growth of the bitcoin and, accordingly, investors for new purchases, creating an avalanche effect.Is this the start of a bullish trend? I think it is too early for this and I assume that this sudden jump in price will be followed by an equally sudden drop.There are always temptations in the crypto market, but in the case of the bitcoin, why should investors have any regrets? Even if the price rolls back below $29k in the near future, do you think this is a reason to regret? Of course not. This is a reason to be patient and wait until the price of bitcoin goes up again and then the investment will pay off with interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "October 20, 2023, 05:17:51 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place.This is not a temptation but you can choose to personally call it so, bitcoin have reach $30,000 within few days back, it went back as far as $27,000 before it decided to remain here with $29,500 which we also believe should sooner move up more because we are getting more closer to a bull market season than we have been on the dip market season, if you follow the market very well, you would have seen this coming from the weekly candles observed, though we cannot accurately predict bitcoin market but this is part of the normal expectations to see the market rising after a prolonged dip.Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIf the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending The actual pattern this may come in through remain unclear to many investors, don't be that surprised that coming month may be for dip before we could continue with the bull gradually, everything is not done all of a sudden, there's nothing impossible for this period as you can discover that bitcoin is over $30,000 before the next day, this is not what is being manipulated, it's demand and supply determines the market price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "October 20, 2023, 05:45:28 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place. If the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending for investors to use the period to earn more incomes from their investment and to plan well ahead of another bear to come. If this new increase turn to temptation in the crypto market by turning back to dumping again which are some of the things investors don't want to experience in this season because, it will cause Many losses to investors. Do you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.People always call October Uptober and this is what is happening now.I don't know how some people when the bull run happens always say \"is this a real bullrun\" I don't think it's the full extent because there are other factors that cause it, about other investors' expectations depending on how they deal with it, is it for a moment or long term? Any long-term investor will definitely not think about this and will see how bitcoin travels in a year, of course it's all part of the halving process next year.Regarding the temptation, it means they just want to get a short time profit, I simply think about how they sell it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "October 20, 2023, 05:46:33 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMDo you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.For Bitcoin investors the price rise past $29K is not a surprise. Those who are looking at today's price spike are looking to find out what happened to make Bitcoin's price pass $29K.Investors who have spent a long time in the market will not be reckless in selling Bitcoin when price changes are still far from the target. As the Bitcoin price increases to $30K, investors are increasingly eager to hold if the ability to increase the number of Bitcoins does not exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "October 20, 2023, 07:43:02 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place.Does it really matter if the price reaches 29-30K and we see over 35K next week? Will this mean that the bull run has begun, and we cannot now go straight up towards the all time high ?In case the price of Bitcoin dumps again from 29K, does it mean that there is no bull run? Both of these theories are wrong because a bull market is not something that we shall never dump and the prices can go in a straight upward direction. We can reach 40K and then again dump to 30K, will this mean that we are in a bear market?I think that we have seen the bear market bottom at 15800-16K and now we are in a bull market since then. Yes, there will be corrections all the way, so we should be ready for the pump and dump of the bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Winterfrost",
      "created_time": "October 20, 2023, 07:45:19 PM",
      "body": "You shouldn't be surprised about this if you have followed the market for long. Just some few weeks ago the price was as low as 25k to 28k. An before then the price fell from 30k- 29k and then to the price which it picked up back to 30k. This is the high volatility nature of Bitcoin to move from different prices so fast. I wont call this bull run because I am not certain of it this one of the things Bitcoin do and those who dont understand quickly gets ready to sell. If eventually it starts dropping gradually the panic sellers will sell too. Definitely the price now will put a smile on the face of many investors and there will be hope to expect a bull run but the opposite might be the case. To me I dont see Bitcoin going above 30k instead it will play around the 28k to 30k price for a while before any upward or downward movement may occur. Am only speculating am not certain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danadc",
      "created_time": "October 20, 2023, 07:52:25 PM",
      "body": "Quote from: m2017 on October 20, 2023, 05:02:30 PMQuote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place. If the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending for investors to use the period to earn more incomes from their investment and to plan well ahead of another bear to come. If this new increase turn to temptation in the crypto market by turning back to dumping again which are some of the things investors don't want to experience in this season because, it will cause Many losses to investors. Do you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.This could be a bullish trend. Why not? If people now start investing in bitcoin, seeing the current price jump, this will further spur the growth of the bitcoin and, accordingly, investors for new purchases, creating an avalanche effect.Is this the start of a bullish trend? I think it is too early for this and I assume that this sudden jump in price will be followed by an equally sudden drop.There are always temptations in the crypto market, but in the case of the bitcoin, why should investors have any regrets? Even if the price rolls back below $29k in the near future, do you think this is a reason to regret? Of course not. This is a reason to be patient and wait until the price of bitcoin goes up again and then the investment will pay off with interest.  Well, the temptation in the market can be paid dearly, because I really want Bitcoin to go up a lot and I buy just waiting for it to continue going up even more and it could go down, so if I don't buy in time I can lose, many expect the price to go down. price to buy, and what is smarter and can happen, it may be that everyone is waiting for the price at $30k and it goes down to $25k, and there they can buy, but if they buy at $27k and it does not go up but falls it can give a very low emotional effect, so this is what has to be avoided and if that happens, what you have to have is a lot of patience because it will increase, there is no doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 20, 2023, 08:03:15 PM",
      "body": "The BTC ETF seems like giving hope to those investors waiting only for something to happen. And then there's SEC giving up the XRP lawsuit which is sort of a signal for those guys. Now whether this is just a fake bull run again or not it doesn't matter since those investors get in to hold. I'm hoping this is the start of a bull run after all the halving is just months away and it seems like stimulus is coming once again. Signs are telling investors BTC will save us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 20, 2023, 08:14:08 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place. If the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending for investors to use the period to earn more incomes from their investment and to plan well ahead of another bear to come. If this new increase turn to temptation in the crypto market by turning back to dumping again which are some of the things investors don't want to experience in this season because, it will cause Many losses to investors. Do you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.It's not yet the bull run. While it did touched $30k, this still gives the thought that it can still be lower in the next weeks or months before this year ends. This might be the sign that we're about to enter the bull run but that's what I think that we're not yet there. There will be indicators that will show and will push the market into the actual bull run when it's there. One indicator is the approval of the Bitcoin ETFs, no news yet but it's likely that they're just putting it all together so that the timing will be perfect with the Bitcoin halving on est. March or April 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "October 20, 2023, 08:18:35 PM",
      "body": "There's a theory I heard a few times. When the crowd screams that it's a bull run, it usually is a fakeout.The real bull run comes when price goes up and the crowd says \"i bet it's not this time, this must be another fakeout.\"A good example of this was 2019 when price went up and crashed again and when it came back up people were so tired of more than 2 years of bear market they failed to notice it. When they keep telling you that it's going to go down again, when they scream at you that 16k was not the bottom and bitcoin has to go to 10k before it comes back up, that's when you know the bottom is in and the bull run is on the way. That's my take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "October 20, 2023, 08:44:11 PM",
      "body": "I would refrain from passing judgements whether these are signals for bullrun or one more bull trap because in the past we have often seen bull run usually starts during last quarter of the year and looking at the market movement and it's coincidence with what's happening between SEC and XRP this can be considered as a signal of bullrun but we have often been bull trapped so it would be better to wait for some more time and set up a target for BTC like $40k or $35k and if it crosses these marl then we can review the market again and decide whether it's a bull run or not because BTC has been fluctuating between $25k and $30k for a while now hence only based on these fluctuations we cannot blindly consider as bull run. It would be better to wait for a while instead of FOMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 20, 2023, 08:51:55 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place. If the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending for investors to use the period to earn more incomes from their investment and to plan well ahead of another bear to come. If this new increase turn to temptation in the crypto market by turning back to dumping again which are some of the things investors don't want to experience in this season because, it will cause Many losses to investors. Do you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.This is a miner relief rally. Study fall 2015 to spring 2016 pre 1/2 ing we went from 400 usd to 770 usd then slide to 660 usd right at the 1/2 ing. So to match we go to 45-48k then drop to about 38 k right at the 1/2 ing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "October 20, 2023, 09:26:24 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to me this morning seeing the market price increasing above $29k that made me to asked this question, if it's real for bull market to happen in this month of October or is just a temptation that will make people to release their BTC to the market before the massive bull will take place. If the price of BTC can reach this level $29k at this time, show that real bull will take place next month of November till next year ending for investors to use the period to earn more incomes from their investment and to plan well ahead of another bear to come. If this new increase turn to temptation in the crypto market by turning back to dumping again which are some of the things investors don't want to experience in this season because, it will cause Many losses to investors. Do you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.No one really knows because this market has been always that totally random or there's no way on telling on which way it would go whether this recent jump or increase in price is the start of that bullish run or simply to those ordinary days that we do have and making out some movement with few % which it turns out to be normal. It is really just that people who had been get used to minimal movement that we had experience several months ago which on the time that the price had made out some movement something like this then it turns out to be that something big. Yes, i cant really deny that even myself considered to be that long time crypto enthusiast but with the recent movement did raise up some question on whats the current news that we do have in the market on why it do move like that?Investment or trading decisions would really actually vary or would really be that depending on you whether you would really be holding your position or would really be trying out to hedgewith those minimal movements or would really be having that positive results or profits then securing profits will really be always that recommended on doing so.Always stick with your own ways and methods as long you do make that advantage then this what matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "October 20, 2023, 09:58:17 PM",
      "body": "Quote from: aylabadia05 on October 20, 2023, 05:46:33 PMQuote from: Zanab247 on October 20, 2023, 03:56:25 PMDo you think this is a real bull that will lead to investors expectation? Or is just a temptation that will make people to rush to the market to sell and regret at the end? What is your opinion.For Bitcoin investors the price rise past $29K is not a surprise. Those who are looking at today's price spike are looking to find out what happened to make Bitcoin's price pass $29K.Investors who have spent a long time in the market will not be reckless in selling Bitcoin when price changes are still far from the target. As the Bitcoin price increases to $30K, investors are increasingly eager to hold if the ability to increase the number of Bitcoins does not exist.This could be the start, but of course we have to break the resistance first and it can happen any time as Bitcoin can easily pump high especially if the hype becomes more effective. Again, try to look at Bitcoin as a whole and you can see the possible scenario. My only worry about this is that, the world economy is still not doing good and the threat of war is rising, so this pump can be temporary only but of course let’s all hope that this war will not result into a World War 3, let’s pray that US will not declare war after the attacked to their US base.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "October 20, 2023, 10:15:39 PM",
      "body": "I think it is early to tell whether this is the real bull run or just a bull trap since there is a valid reason why the Bitcoin market is in an uptrend today.  The latest news about the XRP case may have affected the Bitcoin market reason why it increased its price today.  I hope this will be the start of the real bull run but I am afraid that the news about XRP is not enough to sustain the hype.  Let us see if there is another series of good news about cryptocurrency in the next few days, if there is none, there will be a problem in sustaining the uptrend of Bitcoin, and might probably become another bull trap before the halving event happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "October 20, 2023, 10:52:51 PM",
      "body": "Honestly, it could be a bull without being the bull you think it is. While it could go as high as over 30k+ easily at this point, even reach 32k as well, which would be considered a bull, you may think that we have started to ascend and we will see 68k+ in a few months, then yeah you are going to be upset because I do not think that will happen anytime soon. I think its going to be a little different and should be considered like its not a big deal, could be a bit higher than what it is right now but that doesn't mean that we are going to end up with a huge return. Just assume that it may go up, but not go up to 40k+ levels, that is not coming anytime soon if you ask me and could be next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 20, 2023, 11:02:15 PM",
      "body": "Quote from: Zanab247 on October 20, 2023, 03:56:25 PMIt was a great surprised to ...//...::,,,Surprise?, why $30k surprises you.This year we have had +$30k several times, I have a Topic where I check the maximums for each month, also the minimums, whatever, the question is why we have not maintained the +$30k.Price Max-Min2023|month|high (day)|low (day)||January|$23,919(29) |$16,521(1)||February|$25,134(16) |$21,460(1)||March|$28,803(22) |$19,628(10)|| April|$31,005(14) |$27,070(24)||May|$29,628(5) |$26,182(24)||June|$31,106(23) |$24,871(15)||July|$31.290(13) |$29.266(22)|| August|$30,030(8) |$25,984(22)||Sept.|$27,176(19) |$25,007(11)||Oct.|$30,035*(20) |$26,561*(11)|*partial october, 2023.Then, looking at the historical data is a guide to possibilities, but they are not the truth. What we can do with that data is simply speculate and make our decisions on action based on that.2022:Oct: $20,938(26) | $18,319(13)|Table data: author famososMuertos link=https://bitcointalk.org/index.php?topic=5332730.msg63027504#msg63027504Data: CMC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}