{
  "id": "topic_5463657",
  "title": "fuer44",
  "author": "fuer44",
  "created_time": "August 18, 2023, 03:34:51 AM",
  "content": "Sebelumnya mohon maaf, apakah ini thread yang benar atau tidak. Jadi saya selama ini mencari nomor verifikasi india untuk keperluan verifikasi di sebuah marketplace untuk berjualan online. Kemarin di thread service, saya hanya menemukan beberapa negara saja seperti kanada, dan U.K.Mungkin disini ada teman teman yang bisa membantu, entah anda yang menyediakan layanan tersebut, atau anda bisa membawa saya ke website terpercaya untuk mendapatkan layanan verifikasi nomor india tersebut. Dari beberapa bulan yang lalu pun saya mencari di situs yang ada di internet namun tidak ada yang valid.Terimakasih atas bantuannya",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463657",
  "comments": [
    {
      "author": "rat03gopoh",
      "created_time": "August 18, 2023, 02:23:44 PM",
      "body": "Ini gan beberapa layanan virtual number yg pernah dipos diforum ini. Legit tidaknya, riset sendiri https://bitcointalk.org/index.php?topic=5214781.0https://bitcointalk.org/index.php?topic=5211656.0https://bitcointalk.org/index.php?topic=5381073.0https://bitcointalk.org/index.php?topic=5265897.0https://grizzlysms.com/countries/indiaSemuanya menerima pembayaran kripto.Kalo buat bisnis jangka panjang atau bakal nyimpen duit banyak, kayaknya terlalu beresiko beli VN. Situs-situs semacam ini bisa berhenti tiba-tiba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "August 19, 2023, 12:03:38 AM",
      "body": "Quote from: fuer44 on August 18, 2023, 03:34:51 AMMungkin disini ada teman teman yang bisa membantu, entah anda yang menyediakan layanan tersebut, atau anda bisa membawa saya ke website terpercaya untuk mendapatkan layanan verifikasi nomor india tersebut. Dari beberapa bulan yang lalu pun saya mencari di situs yang ada di internet namun tidak ada yang valid.Sebelumnya aku mau bertanya, keperluannya untuk verifikasi doang atau kontinyu terus menerus mau dipakai?. Kalau cuma verifikasi dan sekali pakai doang, kamu bisa memakai layanan nomor telepon online seperti ini: https://online-sms.org/id/free-phone-number-917428723247 Dulu itu aku pernah juga daftar-daftar untuk jualan online di negara lain, yaitu OLX negara Brazil, jadi sebelum lanjut aku harus verifikasi no telp asal negara tersebut. Karena cuma sebatas verifikasi doang, jadi kupakailah nomor telepon online yang hanya received SMS sekali. Selanjutnya tidak diminta lagi semisal untuk OTP atau keperluannya selanjutnya.Tapi kalau kontinyu dan mau dipakai terus menerus, kamu bisa ngikutin saran post dari atas ane.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 21, 2023, 07:32:34 AM",
      "body": "Saya lihat agan udah nyari nomor India dari bulan April atau bahkan lebih lama lagi. Jadi penasarn apakah marketplace itu khusus untuk orang India saja atau marketplace internasional? Apa tidak ada alternatifnya misalnya menggunakan marketplace yang lain?Alternatif lain selain virtual number, agan bisa bikin thread di sub-board India untuk meminta salah satu membernya membeli nomor buat agan. Tentunya ini juga ada risikonya dan tidak semua orang bakal mau, tapi bisa dicoba. Jangan lupa pake escrow kalau tidak mau ditipu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "August 23, 2023, 02:26:13 AM",
      "body": "Quote from: rat03gopoh on August 18, 2023, 02:23:44 PMIni gan beberapa layanan virtual number yg pernah dipos diforum ini. Legit tidaknya, riset sendiri https://bitcointalk.org/index.php?topic=5214781.0https://bitcointalk.org/index.php?topic=5211656.0https://bitcointalk.org/index.php?topic=5381073.0https://bitcointalk.org/index.php?topic=5265897.0https://grizzlysms.com/countries/indiaSemuanya menerima pembayaran kripto.Kalo buat bisnis jangka panjang atau bakal nyimpen duit banyak, kayaknya terlalu beresiko beli VN. Situs-situs semacam ini bisa berhenti tiba-tiba.apakah pembayaran hanya via kripto gan? tidak bisa lewat paypal atau mungkin rekeing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "August 23, 2023, 02:30:35 AM",
      "body": "Quote from: Sarah Azhari on August 19, 2023, 12:03:38 AMQuote from: fuer44 on August 18, 2023, 03:34:51 AMMungkin disini ada teman teman yang bisa membantu, entah anda yang menyediakan layanan tersebut, atau anda bisa membawa saya ke website terpercaya untuk mendapatkan layanan verifikasi nomor india tersebut. Dari beberapa bulan yang lalu pun saya mencari di situs yang ada di internet namun tidak ada yang valid.Sebelumnya aku mau bertanya, keperluannya untuk verifikasi doang atau kontinyu terus menerus mau dipakai?. Kalau cuma verifikasi dan sekali pakai doang, kamu bisa memakai layanan nomor telepon online seperti ini: https://online-sms.org/id/free-phone-number-917428723247 Dulu itu aku pernah juga daftar-daftar untuk jualan online di negara lain, yaitu OLX negara Brazil, jadi sebelum lanjut aku harus verifikasi no telp asal negara tersebut. Karena cuma sebatas verifikasi doang, jadi kupakailah nomor telepon online yang hanya received SMS sekali. Selanjutnya tidak diminta lagi semisal untuk OTP atau keperluannya selanjutnya.Tapi kalau kontinyu dan mau dipakai terus menerus, kamu bisa ngikutin saran post dari atas ane.Sekali pakai gan, misalnya hari ini saya butuh 1 nomer verifikasi untuk open toko, kalau sudah selesai ya sudah. Tapi misalnya besok atau lusa saya butuh lagi untuk open toko lagi, saya butuh nomer baru lagi. Kalau dulu marketplace nya masih bisa memakai nomer indonesia, namun sekarang sudah susah. Jadi saya cari alternatif lain menggunakan negara lain dan india adalah negara paling potensial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "August 23, 2023, 02:34:31 AM",
      "body": "Quote from: joniboini on August 21, 2023, 07:32:34 AMSaya lihat agan udah nyari nomor India dari bulan April atau bahkan lebih lama lagi. Jadi penasarn apakah marketplace itu khusus untuk orang India saja atau marketplace internasional? Apa tidak ada alternatifnya misalnya menggunakan marketplace yang lain?Alternatif lain selain virtual number, agan bisa bikin thread di sub-board India untuk meminta salah satu membernya membeli nomor buat agan. Tentunya ini juga ada risikonya dan tidak semua orang bakal mau, tapi bisa dicoba. Jangan lupa pake escrow kalau tidak mau ditipu.Marketplace nya internasional gan, namun akhir akhir ini jika mendaftar menggunakan negara indonesia sering berakhir dengan akun suspend. Nah, 2 tahun lalu saya pernah menggunakan india (tentu dengan bantuan vpn) dan itu sangat easy dan legit sekali. Namun muncul kebijakan baru lagi dalam 1 tahun terakhir, bahwa untuk mendaftar sebagai negara india, diharuskan mengisi nomer telepon india untuk menerima sms verifikasi.Saya juga pernah berfikir untuk melakukan kontak dengan orang india seperti yang agan sarankan. Tapi jujur saja, saya masih sedikit ragu, jika misalnya bayar di depan dan nomer tidak valid. Jika membayarnya di belakang (artinya selesai verifikasi baru membayar) saya siap saja membayarnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "August 23, 2023, 02:48:43 AM",
      "body": "Terima kasih semuanya, ini sangat membantu dan saya sedang mencobanya satu per satu. Maaf karena telat membalas dalam beberapa hari lalu, tapi saya berharap masih bisa meminta bantuan kalian semua jika mengalami kesulitan dalam melakukan atau mencari nomor verifikasi india.Sekali lagi terimakasih agan agan semua  Catatan: jika ada pertanyaan lebih lanjut lagi atau pembahasan yang lebih lanjut terutama mengenai marketplace, silahkan kontak saya via telegram @fuer44",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "August 23, 2023, 01:32:53 PM",
      "body": "Quote from: fuer44 on August 23, 2023, 02:26:13 AMapakah pembayaran hanya via kripto gan? tidak bisa lewat paypal atau mungkin rekeing?Kalo paypal keknya ga ada. Aneh memang mengingat payment app paling populer justru ga dicantumin. Mungkin Paypal punya batasan sendiri kalo dipake buat beli VN. Pake rekening bisa, asal bertanda Visa (CCs bank lokal indo notabene udah support visa).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "August 24, 2023, 02:41:08 AM",
      "body": "Quote from: rat03gopoh on August 23, 2023, 01:32:53 PMQuote from: fuer44 on August 23, 2023, 02:26:13 AMapakah pembayaran hanya via kripto gan? tidak bisa lewat paypal atau mungkin rekeing?Kalo paypal keknya ga ada. Aneh memang mengingat payment app paling populer justru ga dicantumin. Mungkin Paypal punya batasan sendiri kalo dipake buat beli VN. Pake rekening bisa, asal bertanda Visa (CCs bank lokal indo notabene udah support visa).Makasih infonya bang.Oh iya bang, apakah ada saran vpn gratis yang menjangkau semua negara? kebetulan milikku belum saya perpanjang lagi hehe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "August 25, 2023, 01:20:58 AM",
      "body": "Quote from: joniboini on August 21, 2023, 07:32:34 AMSaya lihat agan udah nyari nomor India dari bulan April atau bahkan lebih lama lagi. Jadi penasarn apakah marketplace itu khusus untuk orang India saja atau marketplace internasional? Apa tidak ada alternatifnya misalnya menggunakan marketplace yang lain?Kalau setahuku, seperti di negara Indonesia ini saja, berjualan itu bebas. Tidak ada ikatan harus orang Indonesia atau berada di wilayah Indonesia untuk berjualan Online. Ini pernah kutemui di toko online shopee, soalnya aku pernah beli barang di toko tersebut, yang ternyata penjualnya bukan dari Indonesai, tapi di negara Taiwan. Agak kaget juga, barang yang ku beli langsung dikirim dari negara sana, untung dibawah 50 ribu, jadi tidak ada bea masuk cukai dari kemenkeu. Mungkin OP bisa mencoba terlebih dahulu cara di atas, langsung masuk saja dengan ID dan Notelp Indonesia untuk mendaftar di toko online Indonesia, kali aja bisa dan ACC.Quote from: fuer44 on August 24, 2023, 02:41:08 AMapakah ada saran vpn gratis yang menjangkau semua negara? kebetulan milikku belum saya perpanjang lagi hehe  Mungkin kamu bisa pakai browser Opera, di sana sudah include juga free VPN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "August 25, 2023, 11:39:41 AM",
      "body": "Quote from: Sarah Azhari on August 25, 2023, 01:20:58 AMQuote from: joniboini on August 21, 2023, 07:32:34 AMSaya lihat agan udah nyari nomor India dari bulan April atau bahkan lebih lama lagi. Jadi penasarn apakah marketplace itu khusus untuk orang India saja atau marketplace internasional? Apa tidak ada alternatifnya misalnya menggunakan marketplace yang lain?Kalau setahuku, seperti di negara Indonesia ini saja, berjualan itu bebas. Tidak ada ikatan harus orang Indonesia atau berada di wilayah Indonesia untuk berjualan Online. Ini pernah kutemui di toko online shopee, soalnya aku pernah beli barang di toko tersebut, yang ternyata penjualnya bukan dari Indonesai, tapi di negara Taiwan. Agak kaget juga, barang yang ku beli langsung dikirim dari negara sana, untung dibawah 50 ribu, jadi tidak ada bea masuk cukai dari kemenkeu. Mungkin OP bisa mencoba terlebih dahulu cara di atas, langsung masuk saja dengan ID dan Notelp Indonesia untuk mendaftar di toko online Indonesia, kali aja bisa dan ACC.Quote from: fuer44 on August 24, 2023, 02:41:08 AMapakah ada saran vpn gratis yang menjangkau semua negara? kebetulan milikku belum saya perpanjang lagi hehe  Mungkin kamu bisa pakai browser Opera, di sana sudah include juga free VPN.Kalau pasar lokal memang banyak bang dan itu mudah, banyak juga yang menyarankan. Namun target pasar saya bukan di indo, di lokal indo susah laku. Jualannya desain (soft file) yang dikirim tidak ada barang fisik yang di kirimkan. sedangkan harga jualnya diatas $5. Jadi saya tetap berusaha ke marketplace global tersebut agar bisa laku.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "August 26, 2023, 04:13:25 AM",
      "body": "Quote from: fuer44 on August 25, 2023, 11:39:41 AMKalau pasar lokal memang banyak bang dan itu mudah, banyak juga yang menyarankan. Namun target pasar saya bukan di indo, di lokal indo susah laku. Jualannya desain (soft file) yang dikirim tidak ada barang fisik yang di kirimkan. sedangkan harga jualnya diatas $5. Jadi saya tetap berusaha ke marketplace global tersebut agar bisa laku.Maksudku itu bukan jualan di Indo tapi marketnya yang di luar. Kalau kamu pernah lihat orang luar negeri jualan di shopee, itu sama kasusnya. Artinya kamu tetap jualannya di online shop (misal di India). Jadi, yang begini ini paling cuma verifikasi nomor telepon di awal. Apa lagi cuma soft file tanpa ada barang fisik yang harus dikirim dari Indonesia.Quote from: fuer44 on August 25, 2023, 11:39:41 AMJualannya desain (soft file) yang dikirim tidak ada barang fisik yang di kirimkan. sedangkan harga jualnya diatas $5. Jadi saya tetap berusaha ke marketplace global tersebut agar bisa laku.Aku ingat dulu pernah jualan di market luar menggunakan selly.gg (sekarang bernama: https://selly.io), kalau pakai web tersebut, kamu tidak perlu verif nomor telepon lagi, Digital good (soft file) tersebut akan otomatis terkirim jika konsumen membayar di toko kamu. Artinya, kamu bisa titip jualan kamu di mana-mana, tidak hanya di India, malah bisa menjangkau ke seluruh dunia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "September 13, 2023, 03:20:13 PM",
      "body": "aku mencoba yang free, kok gak ada yang bisa ya bangsaat saya masukkan yang berawalan +91 ada notice (number too long)sedangkan jika +91 saya ganti dengan angka 0 ada notice (number too short)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}