{
  "id": "topic_5457725",
  "title": "RioBlemz",
  "author": "RioBlemz",
  "created_time": "June 27, 2023, 06:25:13 AM",
  "content": "Hello everyone!I'm new here and happy to be part of this community, hopefully, to gain more knowledge about BTC and cryptocurrency, hope I'm in the right place. I'm still trying to study how things work here.Please, I would like to get your advice. Thanks, everyone.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457725",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "June 27, 2023, 06:35:17 AM",
      "body": "Welcome to bitcointalk.orgFirst of all I would recommend you read the rule and regulations of the forum so as to avoid making mistake that will cost you your account.here's the link: Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQNext would be for you to read and learn more about bitcoin and crypto so as to be able to engage in discussions here in the forum.Mastering Bitcoin (GitHub)The Internet of MoneyMastering the Lightning NetworkMastering EthereumBeginners & Help EncyclopediaJust take your time to go through those links above, and if you come across anything that you don't understand make sure you use the search option to see if there is a thread that did the explanation of that stuff and if you don't see any you can create your thread and ask the question there.[Guide] Searching effectively",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Liliana1304",
      "created_time": "June 27, 2023, 06:54:24 AM",
      "body": "If I might add to all Cantsay has said, that would be to try and be participatory here, develop a thick skin when criticism comes, because if you're not willing to be patient to learn so you can grow on here, criticisms can make you run for the hills! Hehe, I'm just kidding. But the point is try to adhere to the rules he dropped a link to and you'd grow, provided you also make quality posts and are not in a hurry to increase in ranks just so you can join a sig campaign cause it could put a damper when the merits aren't forthcoming. Welcome to the forum and enjoy the ride!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 27, 2023, 07:16:15 AM",
      "body": "Hello Rio, you're definitely in the right place to understand and know more about Bitcoin and cryptocurrencies. As an additional to what cantsay have said, since you're already on this board. You can check what's on the stickied or the topics that are at the top of this section which you'll see it immediately upon visiting this section. One topic there that I suggest you to read is:Newbies - Read before posting",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 27, 2023, 07:25:29 AM",
      "body": "Visit meta and beginners and help and read the pinned or sticky threads that are there. From there you will understand more about this forum and also about bitcoin wallet. You will also read some online papers, but be careful because not everything that is online are true or completely true.If you visit this forum daily, reading and contributing in discussion, you will know more about bitcoin. Among the pinned threads, make sure you read this about bitcoin: [General] Bitcoin Wallets - Which, what, why?You can also read this about bitcoin online like on investopedia: https://www.investopedia.com/terms/b/bitcoin.aspMake sure you read the forum rules. I do not have to provide the forum rules link because someone has already given you the link in one of the above posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "June 27, 2023, 08:04:08 AM",
      "body": "To succeed on this forum you need to take the rules and regulations seriously, that's the first step to avoid getting banned or getting painted with red paint. Do not copy-paste from any online sources and if you must for any reason, always provide the original link, and avoid plagiarism at all costs.If you can do these then you have found a home on this forum.After that, all you need is a normal contribution on the forum, and engage in different discussions but it's not a must, only contribute if you have something useful to say.Bring in new ideas that can help other members on the forum or help forum members solve some problems that are facing in the crypto space. You are welcome.Outhue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "June 27, 2023, 08:06:34 AM",
      "body": "Welcome on board mate, you wouldn't regret to be part of this big community. Feel free to navigate round the forum to see boards of your interest and contribute on only topics that you have knowledge on. Plagiarism is a big offense here and leads to ban of account. Other forum member that commented above have given you all the articles that will help you last and grow in the forum. You should also make your own research from google to be sure of what you are reading. Read more for good understanding and post less,because knowledge is gotten by reading. This is a lovely community and feel free to ask questions,as we have experts in the forum that will answer you.Enjoy the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "June 27, 2023, 08:13:22 AM",
      "body": "Read and follow the rules pinned on every board. Stay active and avoid joining any bounty campaign untill you rank up to Full Member. If you are good on any topic then start a thread on the respective board and write engaging content. Getting to succeed here is not that tough if you know the path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 27, 2023, 08:14:17 AM",
      "body": "Quote from: Liliana1304 on June 27, 2023, 06:54:24 AMIf I might add to all Cantsay has said, that would be to try and be participatory here, develop a thick skin when criticism comes, because if you're not willing to be patient to learn so you can grow on here, criticisms can make you run for the hills! Hehe, I'm just kidding. But the point is try to adhere to the rules he dropped a link to and you'd grow, provided you also make quality posts and are not in a hurry to increase in ranks just so you can join a sig campaign cause it could put a damper when the merits aren't forthcoming. Welcome to the forum and enjoy the ride!!Good advice op, but i think newbies are not aware of the Sig campaigns because when I was new here i was only interested in joining Bounty campaigns, and i always thought why these guys are putting these images, i never thought to join the Sig campaign because i thought its a work for high-class members and only the owners of this forum could hire those. (haha), well at the start i did not read many threads so, i had many wrong ideas about working on this forum.The point is, this forum becomes fun for those who try to learn from it while enjoying the new ideas and opinions of many members, but it will become a burden and boring for those who just want to earn money by writing meaningless content. (well, i should change the topic as it is not related to OP's one). For op, Cantsay has already shared some useful links, but let me clarify some for you in a short summary.You can increase your rank here like currently you are a newbie but you can take it to Full member, or At any rank.You should familiarize yourself with the trust system.You should interact with conversations and share your ideas, never be afraid to share ideas that you doubt might be wrong to some extent. because nothing can be 100% sure so keep learning by sharing undoubtful information. But do not do this intentionally. Now, it depends on the OP, to which way, he/she wants to interact with this forum which basically is all about cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 27, 2023, 08:42:46 AM",
      "body": "Quote from: Faisal2202 on June 27, 2023, 08:14:17 AMGood advice op, but i think newbies are not aware of the Sig campaigns because when I was new here i was only interested in joining Bounty campaigns, and i always thought why these guys are putting these images, i never thought to join the Sig campaign because i thought its a work for high-class members and only the owners of this forum could hire those. (haha), well at the start i did not read many threads so, i had many wrong ideas about working on this forum.Now, it depends on the OP, to which way, he/she wants to interact with this forum which basically is all about cryptocurrency. I saw myself. I also came here because of the bounty, and I didn't understand why people write so much while others \"work\". Yes, I then thought that bounty was a job, and I didn’t go to any other sections at all. But it's good that I realized in time that I was going the wrong way.OP, this is a forum primarily intended to communicate and discuss topics about cryptocurrencies. Many come here with financial motivation, but this is only an addition to the fact that here you can get very good knowledge, which will soon come in handy in many areas.So take the time to read, discuss, and maybe share what you know and do. The forum will be friendly to you. You can’t even imagine how you can understand from the texts of people how interested they are in knowledge or, on the contrary, see slyness and falsehood.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 27, 2023, 08:54:46 AM",
      "body": "Quote from: lovesmayfamilis on June 27, 2023, 08:42:46 AMI saw myself. I also came here because of the bounty, and I didn't understand why people write so much while others \"work\". Yes, I then thought that bounty was a job, and I didn’t go to any other sections at all. But it's good that I realized in time that I was going the wrong way.OP, this is a forum primarily intended to communicate and discuss topics about cryptocurrencies. Many come here with financial motivation, but this is only an addition to the fact that here you can get very good knowledge, which will soon come in handy in many areas.So take the time to read, discuss, and maybe share what you know and do. The forum will be friendly to you. You can’t even imagine how you can understand from the texts of people how interested they are in knowledge or, on the contrary, see slyness and falsehood.OMG, i just cannot believe that you are also involved in bounties. it must be a good story to listen of how did you shift your interests from bounties to interaction with members in topics. As, for me, my story is very short, i started to take an interest in Article Campaigns, and when my first article got accepted and it awarded me huge money. I was like on the moon (hehe). And then i started to take participation in article campaigns and after that, i came to know about local boards and found that there is my country too here.So, after writing some posts there, i found it interesting as my own people (which means people from the same country) are here. which really motivated me and the story doesn't finish here. Now, i am working as a Content writer (as a freelancer), how did i get into this field? from writing posts on here. And yet i am still a pro learner and trying to achieve more skills. Now i think i can write any article related to the crypto field and i have found my niche (which is the most difficult task for everyone in the Content writing field).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "June 27, 2023, 09:03:28 AM",
      "body": "Quote from: RioBlemz on June 27, 2023, 06:25:13 AMHello everyone!I'm new here and happy to be part of this community, hopefully, to gain more knowledge about BTC and cryptocurrency, hope I'm in the right place.Definitely you're in the right place to learn more about crypto and to improve your knowledge on how to trade, the finest traders are all on this Forum, ask questions and you'll never be disappointed, your contributions will help make this Forum move forward.Quote I'm still trying to study how things work here.Please, I would like to get your advice. Like I said ask questions and you get all you need, since you're new on this Forum there's nothing to worry about but be mindful of things you do so that you won't fail or break the rules and regulations guiding this great Forum. Bitcointalk is not a place for jokes so you take it seriously, and be patient too, it will help in so many ways.And one more thing, you're highly welcome to  BITCOINTALK .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "June 27, 2023, 09:07:12 AM",
      "body": "The moment you catch a glimpse of what bitcoin is about by glancing on the contents in the links presented here, your success starts and with persistency and consistency you'll learn more that means extra success. And the knowledge can be acknowledged with the merits users send to your quality posts, an insignia that your contribution is valuable to readers. Don't forget to follow rules and don't run to artificial intelligence for help. When reading any crypto article, pen down some slogans you don't understand and ask it here in the forum or research if a thread already exists about it, go through the responses, to learn easily and advance your knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 27, 2023, 09:24:32 AMLast edit: June 27, 2023, 09:36:23 AM by Dunamisx",
      "body": "Alot of people have advised you on this aspect being a newbie and what can help you grow here which is part of what you needed to pay cognitive attention to in other to make your stay worthwhile, try to read the links provided, create time to learn from other experienced members of this forum, be active and most importantly do not plagiarize, if you do a copy and paste act you will get banned permanently, here are other additional links to help you learn more and better.bitcoin historyhttps://bitcointalk.org/index.php?topic=5438353.0posting etiquetteshttps://bitcointalk.org/index.php?topic=5184741.0everything you need to know about forum rank, activities and merits.https://bitcointalk.org/index.php?topic=2766177.0Beginners and Help Encyclopediahttps://bitcointalk.org/index.php?topic=5364418.0#post_point118",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "June 27, 2023, 09:28:15 AM",
      "body": "Quote from: RioBlemz on June 27, 2023, 06:25:13 AMI'm new here and happy to be part of this community, hopefully, to gain more knowledge about BTC and cryptocurrency, hope I'm in the right place. I'm still trying to study how things work here.Please, I would like to get your advice. Like interacting in real life that there are things that must be considered so that we can be well received in the surrounding environment and there are things that must be avoided so that they don't hate us.If we have children or we are children, there are definitely rules that we must obey. Likewise in this forum there are rules.The goal is to increase knowledge about Bitcoin and crypto in general, by reading more articles on Google and in other browsers we can get it, but we can get this knowledge [Bitcoin and cryptocurrency] by joining this forum.You will get lots of tips and the Beginners board is the favorite board for many beginners, including me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "June 27, 2023, 10:16:49 AM",
      "body": "Quote from: Sexylizzy2813 on June 27, 2023, 09:03:28 AMyou're highly welcome to  BITCOINTALK .Welcome the newbie with this welcome message.Quote from: Faisal2202 on June 27, 2023, 08:14:17 AMYou should familiarize yourself with the trust system.LoyceV's Beginners guide to correct use of the Trust systemPersonally I don't think newbies should pay much attention on Trust system in early days. If they are here as newbies to learn, they should firstly focus on forum rules, learning knowledge about Bitcoin, practicing with wallets, addresses. As newbies, I don't think they will abruptly involve in trading with other members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 27, 2023, 10:26:17 AM",
      "body": "Quote from: RioBlemz on June 27, 2023, 06:25:13 AMHello everyone!I'm new here and happy to be part of this community, hopefully, to gain more knowledge about BTC and cryptocurrency, hope I'm in the right place. I'm still trying to study how things work here.Please, I would like to get your advice. Thanks, everyone. Here is a discussion forum just like so many other discussion forums you will see online, but the difference is the major thing that is being discussed here is Bitcoin and for you to fit into the conversation that happens here, you need a good knowledge of Bitcoin. When you have the good knowledge of Bitcoin, you can join any type of conversation in any board and by so doing, you will enjoy your stay in this forum and you will have a tremendous growth. Many people have sent you a links were you can learn about bitcoin. I will advise you to used them so that you will not lack information to discuss in the forum. There's no more thing, here is a forum and not a company or an association.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 27, 2023, 10:30:03 AM",
      "body": "Quote from: dzungmobile on June 27, 2023, 10:16:49 AMPersonally I don't think newbies should pay much attention on Trust system in early days. If they are here as newbies to learn, they should firstly focus on forum rules, learning knowledge about Bitcoin, practicing with wallets, addresses. As newbies, I don't think they will abruptly involve in trading with other members.Personally i think it is important for a newbie to get familiarize with Trust system if he/she wants to be succeed on this platform. You said, it is not and crypto knowledge is important but as the op's intentions are related to succeed on this platform not in crypto sphere. No doubt knowledge of crypto industry is as necassary as water for life, to stay successful on this forum but trust system is also as necassary.Like, what if the OP didn't know about negative feedback (trust) and fall prey to that scammer who already been tagged as red (negative). So, to be successful and to stay on this platform for longer period of time, it is necassary for everyone to get familiar with trust feedback, trust list and trust depth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "June 27, 2023, 10:52:27 AM",
      "body": "Quote from: RioBlemz on June 27, 2023, 06:25:13 AMHello everyone!I'm new here and happy to be part of this community, hopefully, to gain more knowledge about BTC and cryptocurrency, hope I'm in the right place. I'm still trying to study how things work here.Please, I would like to get your advice. Thanks, everyone. What success do you mean? Like staying here for long years or earning money thru different ways available in this forum? You should set your own target on what are those things you like to improve, but before that you can start to read the forum rules here.https://bitcointalk.org/index.php?topic=703657.0The you can also read up the pinned threads on sections where you visit since those are very helpful for you if you want to gather informations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 27, 2023, 10:58:28 AM",
      "body": "Quote from: RioBlemz on June 27, 2023, 06:25:13 AMHello everyone!I'm new here and happy to be part of this community, hopefully, to gain more knowledge about BTC and cryptocurrency, hope I'm in the right place. I'm still trying to study how things work here.Please, I would like to get your advice. Thanks, everyone. Welcome to the forum, @Cantasy already dropped some links that will be very useful to you and I hope you read them. I have seen many newbies make mistakes that cost them their accounts, some abandon their account because they don’t seem to be getting merits. My advice to you is don’t be in a haste, build your account slowly…merits and ranks are things you will surely achieve if you’re committed. Find your interests in the forum and grow it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}