{
  "id": "topic_5441662",
  "title": "olvin",
  "author": "olvin",
  "created_time": "March 01, 2023, 06:36:31 AM",
  "content": "I got a backup wallet.dat file of bitcoin core having some coins in it.I opened it at notepad ++Saw gibberish words writing unable to understand. Mistakenly, I deleted some words from that file. Now the bitcoin core show that the wallet.dat file has got corrupted and is unable to open it.Is there any way to recover it, repair it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441662",
  "comments": [
    {
      "author": "mk4",
      "created_time": "March 01, 2023, 06:39:17 AM",
      "body": "Do you have a previous backup of your operating system? You might be able to do a rollback to the date before you try to edit the file. Do some research on what the steps are as I haven't used Windows for a while now (which I assume you are using).As for the random gibberish, well, you're not really meant to see some words on that file.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 01, 2023, 06:47:17 AM",
      "body": "If you are using Windows, right click on the wallet file and click on 'Restore Previous Versions'. That should be able to restore the wallet back to the previous version. On other OS, there should be a way to restore back previous version too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "olvin",
      "created_time": "March 01, 2023, 06:51:14 AM",
      "body": "Ok got it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "March 01, 2023, 07:04:44 AM",
      "body": "1) You can try to restore a previous version of wallet file by right-clicking on it and choosing \"Restore Previous Versions\" option. For detailed instructions, visit this page https://support.microsoft.com/en-us/windows/recover-lost-or-deleted-files-7bf065bf-f1ea-0a78-c1cf-7dcf51cc8bfc 2) Check this location for previous backups for the same file: C:\\Users\\<user>\\AppData\\Roaming\\Notepad++\\backup3) If you have file versioning enabled, go to backup folder and search for a timestamp before the moment you made a change. You can enable timestamped backups in Settings > Preferences > Backup by selecting \"Verbose backup\". It will protect you from accidential overwrites in the future.4) Also try this:Quote from: https://www.minitool.com/data-recovery/repair-notepad-files-windows-001.htmlHow to Recover Overwritten Notepad FileSome users complained that they had written over a text file on their PC (accidentally saved over the notepad file). Any file recovery program can’t help them recover the file on this occasion. How can they restore overwritten text file? In fact, the information from the previous versions of a notepad file is saved in a file in the Windows system; but it is \"hidden\" by default.How to use the hidden files to recover overwritten text file:    Open File Explorer.    Navigate to the folder that contains the overwritten notepad file.    Select View from the menu bar.    Click Options from its submenu.    Choose Change folder and search options from the drop-down list.    Select View tab.    Select Show hidden files, folders, and drives to display hidden files and directories.    Click Apply and OK button to confirm changes.    Open the hidden files in the same directory; one of them is the exact copy of the previous version of your overwritten file.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "olvin",
      "created_time": "March 01, 2023, 08:15:06 AM",
      "body": "Quote from: witcher_sense on March 01, 2023, 07:04:44 AM1) You can try to restore a previous version of wallet file by right-clicking on it and choosing \"Restore Previous Versions\" option. For detailed instructions, visit this page https://support.microsoft.com/en-us/windows/recover-lost-or-deleted-files-7bf065bf-f1ea-0a78-c1cf-7dcf51cc8bfc 2) Check this location for previous backups for the same file: C:\\Users\\<user>\\AppData\\Roaming\\Notepad++\\backup3) If you have file versioning enabled, go to backup folder and search for a timestamp before the moment you made a change. You can enable timestamped backups in Settings > Preferences > Backup by selecting \"Verbose backup\". It will protect you from accidential overwrites in the future.4) Also try this:Quote from: https://www.minitool.com/data-recovery/repair-notepad-files-windows-001.htmlHow to Recover Overwritten Notepad FileSome users complained that they had written over a text file on their PC (accidentally saved over the notepad file). Any file recovery program can’t help them recover the file on this occasion. How can they restore overwritten text file? In fact, the information from the previous versions of a notepad file is saved in a file in the Windows system; but it is \"hidden\" by default.How to use the hidden files to recover overwritten text file:    Open File Explorer.    Navigate to the folder that contains the overwritten notepad file.    Select View from the menu bar.    Click Options from its submenu.    Choose Change folder and search options from the drop-down list.    Select View tab.    Select Show hidden files, folders, and drives to display hidden files and directories.    Click Apply and OK button to confirm changes.    Open the hidden files in the same directory; one of them is the exact copy of the previous version of your overwritten file.But my problem is - Few days back I deleted those words from the wallet.dat file, saved the file at computer and also uninstalled the notepad++Now I remember I did mistake, so in order to check it again, I installed notpad++ and opened the file. In this case how can i get the previous version of the file restored? Or is there any way to atleast get the private key from the corrupted file.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 01, 2023, 09:13:57 AM",
      "body": "Quote from: olvin on March 01, 2023, 08:15:06 AMOr is there any way to atleast get the private key from the corrupted file.The file is encrypted, all characters seen can not be interpreted. It is always advisable to backup your master private key instead because Bitcoin Core does not support seed phrase. Wallet file can corrupt to the extent that you may not be able to restore it to its original version, but keys backup can never fail unless you misplace it and did not see it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 01, 2023, 01:46:44 PM",
      "body": "Quote from: olvin on March 01, 2023, 06:36:31 AMIs there any way to recover it, repair it.Try to run \"salvage\" on a copy of that wallet using Bitcoin Core's bitcoin-wallet tool.The result will depend on the deleted parts, if the (encrypted) master key is intact, it should be able to restore it to a usable state.Follow this post to use the command:Quote from: nc50lc on January 12, 2022, 03:03:08 AMTry Bitcoin Core's bitcoin-wallet tool's \"salvage\".\"bitcoin-wallet\" is in the \"bin\" folder inside Bitcoin Core's installation directory (where bitcoind and bitcoin-cli are located).To use it, open Terminal, cd to the directory where bitcoin-wallet is.Then use the command (provide the full path to the wallet.dat file):Code:bitcoin-wallet --wallet=\"E:\\Folder\\wallet.dat\" salvageIt wont return with any response (unless it failed) but you will see a backup file (wallet.dat.xxxxx.bak) where the wallet.dat is located.The new wallet.dat is the \"salvaged\" wallet.If you don't know how to \"cd\" (change directory), simply type cd \"path_to_the_directory\" in your Command Prompt window, in this case bitcoin core's bin folder.e.g. (Windows default): cd C:\\Program Files\\Bitcoin\\bin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}