{
  "id": "topic_5466033",
  "title": "franky1",
  "author": "franky1",
  "created_time": "September 07, 2023, 06:52:59 PM",
  "content": "source: https://uk.pcmag.com/news/130187/know-your-datas-worthso a 56+yo hispanic person earning under $20k, their general data is worth $0.09so a 20yo middle eastern person earning $130k, their general data is worth $1.31data can also be worth more if specific demographs also have data that relates to an industry/product interest of the data buyer. EG a SCI-FI movie fans data would be worth more to a company that sells SCI-FI merch/entertainment products",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466033",
  "comments": [
    {
      "author": "Accardo",
      "created_time": "September 07, 2023, 11:10:46 PMLast edit: September 07, 2023, 11:23:35 PM by Accardo",
      "body": "Our personal data is meant to be protected, but, unfortunatly there is a market for it. Advertising companies pay so much for people's data, look at the total amount per demography, those are high amounts. Among the sold datasets include DNAs. It's weird that people's DNA get sold to advertising industry giants. Hence, the companies in control of the datasets, collaborate with advertisers to target a pool of audiences that love specific or different kinds of products. What matters to them is targeting the exact audience for the products using their DNA, which reveals the type of products a family likes, diversifying to any member of the family. The market is boosting and top tech giants use this kind of marketing for different reasons. The data or DNA owners don't authorize these transactions, their data sold for cents or millions. That's very risky to the owners of the sold DNA and other sensitive information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "September 08, 2023, 01:13:16 AM",
      "body": "Considering the data of a user on an app can be sold for as little as under a dollar, one can only imagine the sheer number of user data being sold to various organizations and also on a regular basis. These social media platforms repeatedly affirm on how they’re all about user privacy and how they care about ours only to go ahead to sell off tits bit of information about loads of users using their platform. These information being sold may seem not important and even harmless but harmless information collected overtime, when put together, could become valuable and potentially harmful.   Going through the article, I came upon the phrase; “If you're not paying, then you're the product”. I then thought about how I’m not paying Elon to use Twitter and I chuckled quietly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "September 08, 2023, 01:20:15 AM",
      "body": "For sure, lots of people will say too low on this, but that's the sign that you would be selling your personal data. Our data should have no money value as we need to protect it, but right now I've seen a lot of people, mostly in my country, ready to sell their identity to whomever needed it as long as they were paid. Recently this year, I saw a thread from our country forum that they will pay about $10 for filling out a form that contains your ID and personal data, and surprisingly, a lot of people do it, even using their parents identities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "September 08, 2023, 01:49:38 AM",
      "body": "Quote from: xSkylarx on September 08, 2023, 01:20:15 AMRecently this year, I saw a thread from our country forum that they will pay about $10 for filling out a form that contains your ID and personal data, and surprisingly, a lot of people do it, even using their parents identities.With bounty hunters, personal data are not their concerns. They can accept all KYC types if by that they can receive tokens. Do those tokens worth anything, $1 or $10? I don't know and bounty hunters don't mind too. They KYC first and hope to receive tokens then hope those tokens have value.Coinbase Learning rewards with Personal Information Verification requirements is an example. Small rewards but lose your personal data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martinex",
      "created_time": "September 08, 2023, 02:13:51 AM",
      "body": "A presentation of data that has value because it is real, it can be collected at an expensive survey cost, so it is valuable and not free. and For business people, data is really needed to carry out a survey or some type of activity for development, well, what's sad is that sometimes personal data in some countries is still considered normal and not very meaningful, but the case is different from KYC on a platform. I remember that during the Covid period there was quite a lot of patient data that fell out of nowhere or was bought and sold, I also didn't understand where it was going.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "September 08, 2023, 02:20:05 AM",
      "body": "Quote from: MusaMohamed on September 08, 2023, 01:49:38 AMQuote from: xSkylarx on September 08, 2023, 01:20:15 AMRecently this year, I saw a thread from our country forum that they will pay about $10 for filling out a form that contains your ID and personal data, and surprisingly, a lot of people do it, even using their parents identities.With bounty hunters, personal data are not their concerns. They can accept all KYC types if by that they can receive tokens. Do those tokens worth anything, $1 or $10? I don't know and bounty hunters don't mind too. They KYC first and hope to receive tokens then hope those tokens have value.Coinbase Learning rewards with Personal Information Verification requirements is an example. Small rewards but lose your personal data.That's because there is a cash prize for doing KYC. For bounty hunters, they get tokens for free and keep the tokens in the hope that the tokens will explode someday.And those of us who do KYC on centralized exchanges do it too, right? That means it's the same as them because we hope to be able to use all the features on the exchange to make money, including its trading.So we will easily provide personal data to carry out KYC because there is a reward in the form of money, tokens or other things. There is no need to consider other problems because they are each person's responsibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "September 08, 2023, 02:48:44 AM",
      "body": "I remember being so curious as to how different sites and apps are able to know what I'm doing online and what I'm currently interested in as they give accurate advertisements and recommendations every time. Thanks to one of my professors back in college, that's when I found out that businesses collect and sell our data. And seeing OP's post now, it seems like they are getting a lot from it. Hence, I thought everyone should know about the different types of consumer data that businesses collect. According to Max Freedman of Business News Daily, there are four types of consumer data that businesses collect. The first one is our Personal Data which are personally identifiable information like IP address, Social Security number, gender, and the like. The second is called the Engagement Data which pertains to details regarding an individual's interaction with a website, apps, pages, and ads. The next type is called Behavioral Data, which includes purchase history, user's repeated actions online, and (sometimes) even mouse movement. Lastly, there is Attitudinal Data which is about an individual's satisfaction, desirability, and purchase criteria for a product, website, and other online shenanigans. To know more about these and other things relating to businesses collecting data and what they do to it, you may visit this link: https://www.businessnewsdaily.com/10625-businesses-collecting-data.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 08, 2023, 03:42:47 AM",
      "body": "As they say, data is the new oil.That's why most of these huge tech companies are drowing themselves to these data and they're earning if not millions to billions on this one while acquiring those for free.Aside from the business that they're having, they're taking our data and sells it to the advertisers. It's a win win for them but what can we do if they're offerring free service which most likely all about social media and communication?It is unavoidable when our data has been floating even with our telcos, they've got us already even without stepping on the web.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 08, 2023, 04:09:45 AM",
      "body": "May I ask for the source of this data that you have presented? I would like to use it in one of my presentations for my employer. There's an ongoing debate I am having with my boss about something similar so the source will immensely help me. Data is the new oil! The digital marketers live on the data and patterns. But corporates who hold such data usually sells it at a much higher price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "September 08, 2023, 06:14:03 AM",
      "body": "I'll spoil the idyll of worrying about private data a bit Do you honestly worry so much, and keep your data as a secret ? Phone number, e-mail, full name, passport number ? Do you really think that this is critical information ? And do you really think that this information is not available before it was sold on the darknet? Then I have very bad news for you All this information is available to those who may need it - government registries, tax office, banks,.... - they all have this data and access to it ! Don't get your hopes up about the secrecy of this data That's why I can't understand what the problem with the BASIC data is ? I understand - data on illnesses, account numbers and passwords, private correspondence, etc. But the BASIC data that we ourselves leave everywhere all the time - why are you so worried about it ? In my country, for example, the registers of vehicle and real estate owners are OFFICIALLY open, and I don't see anything wrong with that!Yes, and I have doubts about the data on gradation by income - do those who sell have information to the accounts of persons in their database ?  If there is - the question is not to those who sell, but to those who leak this information to banks ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 08, 2023, 06:50:54 AM",
      "body": "I think the use-case for the data are very important, because you derive profits from the targets that you are identifying with this data mining. Let's take the whole \"faucet\" era as an example and what ended their reign in the Crypto currency scene...So, back in the day.... loads of Crypto faucets popped up like mushrooms and all of them were funded from Advertisement income. The sites went crazy to gain as much traffic as possible to receive more advertisement income....but it all ended in a \"Bang\" ...when the advertisement companies analyzed the traffic and realized that most of the traffic that were coming from these sites was worthless for marketing purposes. How can you pay for traffic, when you have millions of people that are clicking a button to get a fraction of a cent... every hour? Is this the target consumer for products and services that you want to sell with those advertisements? These companies want to target potential customers with a lot of money to spend.... and they pay premium prices for information on those type of targets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 08, 2023, 07:42:02 AM",
      "body": "Quote from: MusaMohamed on September 08, 2023, 01:49:38 AMQuote from: xSkylarx on September 08, 2023, 01:20:15 AMRecently this year, I saw a thread from our country forum that they will pay about $10 for filling out a form that contains your ID and personal data, and surprisingly, a lot of people do it, even using their parents identities.With bounty hunters, personal data are not their concerns. They can accept all KYC types if by that they can receive tokens. Do those tokens worth anything, $1 or $10? I don't know and bounty hunters don't mind too. They KYC first and hope to receive tokens then hope those tokens have value.Coinbase Learning rewards with Personal Information Verification requirements is an example. Small rewards but lose your personal data.Dark sites today sell complete information, including credit card numbers and more. But no matter how surprising it may sound to some, many independently disseminate information about themselves, providing documents left and right.In addition, surfing the Internet also comes under the surveillance of advertising and tracking trackers, which an ignorant person who does not expect any tricks does not know how to get rid of.I can say more: Bounty hunters are not so naive as to provide their data to bounty programs where client verification is required. The Internet is full of telegram channels where people’s data can be purchased in batches by country and gender.Therefore, whenever you leave your data, you can expect that someday a loan will be issued in your name, which you will have to repay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "September 08, 2023, 08:38:41 AM",
      "body": "Quote from: franky1 on September 07, 2023, 06:52:59 PMso a 56+yo hispanic person earning under $20k, their general data is worth $0.09The cost of data for people in this category is cheap because companies will not like to spend more money on people who are close to retirement. These set of people are no longer that productive so their earnings might keep decreasing which might also affect their spending. Meanwhile, firms will always like to associate with long-term customers, and people between the age of 20-40 will be the ideal target. This group of young people is still active and can earn more, which means the firm will pay more to get their data.Quoteso a 20yo middle eastern person earning $130k, their general data is worth $1.31The worth of data can also be determined by how easy or difficult it is to get the data. It has been observed that male in the Middle East are very conscious of their data because they live secret lives. So getting their data is difficult, which makes the cost higher. Also, many of them have high incomes so they will be targeted by firms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 08, 2023, 09:14:56 AM",
      "body": "Is there a way that data cost is also related to status or profession? Like are these class of people sort after more or not because if they are, I think the data value could be higher. So with the research you did, could you determine if doctors, lawyers, engineers are better placed in data urgency than those of unskilled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "September 08, 2023, 09:23:28 AM",
      "body": "I used to take surveys of various levels of importance, mostly low level quick survey (xbox points and such like) however I was once offered a thousand dollars just to fill out a 20 minute survey on my shopping preferences.   Somehow the survey company believed I was earning half a million a year or something silly like that and made this offer, I did not realize in time or I might have answered appropriately in order to qualify for the survey payment.  Half way through the survey they realized yes this guy is actually poor and thanked me for my time and closed the question answer session, zero compensation because I was too honest unfortunately.   Im not sure why they thought I was so rich, if I had half a mil earnings I would not waste 20 minutes of my scarce highly valuable spare time on really painful questions so boring especially when payment being delivered is so fragile.Demographics alters alot of things for advertising, some parts of the economy do not ever watch TV.  Often this is young people, up and coming target markets.  If you can supply data on people off the radar, its going to become alot more worthwhile.  This data worth sounds like general search engine stuff, non specific not much insight.  I dont have specifics but a crypto blockchain is related this, they give data on customers and payments for using their browser etc. occurs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "September 08, 2023, 09:53:51 AM",
      "body": "Quote from: Gozie51 on September 08, 2023, 09:14:56 AMIs there a way that data cost is also related to status or profession? Like are these class of people sort after more or not because if they are, I think the data value could be higher. So with the research you did, could you determine if doctors, lawyers, engineers are better placed in data urgency than those of unskilled.In my opinion, it depends on the data buyer's needs. In the realm of the internet, data transactions are closely tied to the advertising industry, which we often encounter on blogs, social media, marketplaces, and elsewhere. Targeted advertising yields a higher conversion rate compared to non-targeted ads.Professionals like doctors, engineers, or individuals in various occupations certainly possess data of different qualities compared to the average person. In the field of medicine, for instance, there's a natural inclination toward products related to healthcare. Thus, data categorization can become even more precise when processed by professional platforms.Another example is data that becomes more valuable when you come across someone with a keen interest in sports. In such cases, sports brands would be interested in acquiring this data to present sports-related product offers to those who share an interest in sports.One piece of data can be utilized by multiple companies, which is why data has become a valuable asset in today's digital world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 08, 2023, 09:54:32 AM",
      "body": "Quote from: xSkylarx on September 08, 2023, 01:20:15 AM Recently this year, I saw a thread from our country forum that they will pay about $10 for filling out a form that contains your ID and personal data, and surprisingly, a lot of people do it, even using their parents identities.For advertising companies, detailed data such as KYC is actually not that important. All they do is capture data/history of your interaction while connected to the internet via cookies. It doesn't violate any privacy rules at allMaybe such detailed data is a bit expensive in different markets like the dark web.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "September 08, 2023, 10:18:24 AM",
      "body": "At this point I don't believe anything said by a company, institution or government regarding data protection for users because it is bullshit. Even now, user data is still widely traded in online forums and usually the data is still fresh, which means it has just been hacked or sold by irresponsible parties.Indeed, this is the risk for us as users, of course our identity, activities and various data about us are valuable and are very vulnerable to being traded, and we as users cannot do anything about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 08, 2023, 06:38:34 PM",
      "body": "Kind of disappointing numbers for those who were making plans on how to live on selling their data to some companies!I never understood why some thought that their internet usage behavior was worth that much, when you're on a budget and 10 cents in price difference is enough to change your buying habits why would a company pay even one cent for it? I did make a few of my friends angry when I asked them calmly and smiling, who the hell do you think you are that your data would be worth more than $10 bucks when that's all the money you have in your pocket?Companies need to make a profit, if they would pay millions just to find out that the one thousand guys they get all the info on them have little or no intention of buying or using any of their products how would that work out?Besides, I don't understand this fear of company x knowing I'm interested in product y?So, what are they going to do show me add of product Z and I'm going to act like a moron and buy it just because I saw an ad? Quote from: STT on September 08, 2023, 09:23:28 AMI used to take surveys of various levels of importance, mostly low level quick survey (xbox points and such like) however I was once offered a thousand dollars just to fill out a 20 minute survey on my shopping preferences.   Somehow the survey company believed I was earning half a million a year or something silly like that and made this offer, I did not realize in time or I might have answered appropriately in order to qualify for the survey payment.  Half way through the survey they realized yes this guy is actually poor and thanked me for my time and closed the question answer session, zero compensation because I was too honest unfortunately. A perfect example of how somebody making the minimum wage should not be that concerned Bentley Motors Limited has acquired his browing data habits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}