{
  "id": "topic_5415971",
  "title": "Majestic-milf",
  "author": "Majestic-milf",
  "created_time": "October 04, 2022, 11:51:58 PM",
  "content": "It's no news of Elon's penchant for acquisition and it didn't shock the public when he came out in April to propose a bid to buy Twitter for a whooping $44bn; It seemed doable after all he was rich and a bit impulsive. But news had it that the billionaire at the last minute decided to renege on his offer, citing claims that Twitter had falsified records on the number of accounts on the platform. But surprisingly, Monday Eve, there seemed to be a change of plans as Elon decided to revisit the deal after months long battle in court and probably, the final decision may not be in his favor hence the move. Compared to Facebook and TikTok, Twitter seems to be less favorable but has for long being the opinion ground for the likes of Elon and ex president Donald Trump. Although the latter was banned from the platform. Prior to the purchase of Twitter, in April, $8.5bn shares in Tesla was sold, while in May, $7bn was lined from investors while in Aug, another $7bn shares of Tesla was sold all in preparation  Twitter link A good turn of events for Twitter as they are close to closing the deal. Elon has good plans for the social network as he believed that before going back on the deal initially, he could have 500 million users daily and rake in $13.2bn as revenue come 2025. Tall order or can it be achieved?  https://www.nytimes.com/2022/10/04/technology/elon-musk-twitter-deal.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415971",
  "comments": [
    {
      "author": "spectre71",
      "created_time": "October 05, 2022, 01:07:16 AM",
      "body": "Good news for Twitter investors, But the staff is pretty much toast. Bunch SF based woke tards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 05, 2022, 06:26:47 AM",
      "body": "Personally, I don't expect the final verdict of the court or out-of-court settlement (as the case may eventually be) to be in his favour. I have known him as a man of questionable character even when everyone in the world appreciates him, I do appreciate his successes though. He should not expect to be playing immaturely with formal dealings. Maybe he now sees where the judgment is heading, he is now acknowledging what he should have done months ago instead of trying to destroy the image of Twitter and claiming they are not sincere.This is good news to the buyers of Twitter's stocks this week, I guess more is to be witnessed soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 05, 2022, 06:31:26 AM",
      "body": "Quote from: Majestic-milf on October 04, 2022, 11:51:58 PMA good turn of events for Twitter as they are close to closing the deal. Elon has good plans for the social networkI am not that much certain that this is good for Twitter. Elon seems to have a quite simplistic idea about what freedom of speech means and this will most probably be conflicting with what Twitter had until now.Will this be better or worse? I don't know yet, but I expect that at start it will probably leave some people disappointed (both those who will be surprised Trump gets his account back and those hoping the FUD and fake news will be eradicated instantly - or at all). Also many are expecting crypto payments over Twitter, but this means obeying regulation and much more strict KYC, so, again, too much hopium.I would not be surprised that also various troll armies will no longer get punished (freedom of speech, you know). And probably the bots will not be so easy to eradicate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "October 05, 2022, 06:58:34 AM",
      "body": "Quote from: Majestic-milf on October 04, 2022, 11:51:58 PMCompared to Facebook and TikTok, Twitter seems to be less favorable but has for long being the opinion ground for the likes of Elon and ex president Donald Trump. Now, believe me I'm happy Twitter is being bought by someone so ostensibly pro-free speech as Elon Musk, but man....I would have busted one in my pants if he'd purchased Youtube instead.  As far as social media platforms go, Twitter is extremely popular and one that IMO needs to be overhauled.  But seeing as how I don't use it and do watch videos on YT quite a bit, it would have probably made creators on that site a lot less skittish about what they say and what topics they can and can't cover.But still I'm pleased with this.  Maybe soon Twitter will become less of a left-wing stronghold, but we'll see.  Elon Musk is not only impulsive, he's unpredictable, so it's anyone's guess as to what changes are going to be made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 05, 2022, 07:20:44 AM",
      "body": "Quote from: spectre71 on October 05, 2022, 01:07:16 AMGood news for Twitter investors, But the staff is pretty much toast. Bunch SF based woke tards.Elon's going to try but will ultimately fail at fixing Twitter, and it's really Twitter's fault for becoming a cesspool for all national intelligence agencies in the first place. Since he can't possibly stand against all these governments at once, somebody needs to make the Twitter killer. No need to worry about Facebook because they are busy killing themselves with the abortive Metaverse initiative. Youtube will also die a swift death at the hands of TikTok.Ubiquitous computing is the future, not VR/AR. Xerox discovered that decades ago but decided to sit on it for reasons which don't concern us. The sooner somebody realizes this, the faster Web 2.0 will die (and Web 3.0 emerges).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 05, 2022, 08:06:24 AM",
      "body": "Well, I know one thing....Elon Musk loves Crypto currencies ....and he will most definitely encourage Crypto content on Twitter if he eventually buy it. We have seen a lot of these large social media platforms ..banning Crypto currency advertising, because it was either too expensive to filter the genuine content from the scams or the masters behind the scenes.. pushed their own agenda.  Let's hope his stand on Crypto currencies will stay the same ...and that he will allow \"freedom\" for legitimate Crypto currency projects to flourish on the Twitter platform. I really hope he does not change this platform to a \"subscription\" service only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 05, 2022, 09:05:08 AM",
      "body": "Well, I just hope that he'll clean it up as most social medias, mostly in Twitter it's full of propaganda and I hope that he'll able to maintain neutrality for its platform.With this purchase, I'm now looking at the money that he'll pay for this acquisition will be put into some good projects that Jack Dorsey has been working on.I just hope that whatever proposal has been made for some additional features that has the past management of Twitter is planning, those good additional features that are related to crypto, he'll continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "October 05, 2022, 09:35:02 AM",
      "body": "Quote from: Kakmakr on October 05, 2022, 08:06:24 AMWell, I know one thing....Elon Musk loves Crypto currencies ....and he will most definitely encourage Crypto content on Twitter if he eventually buy it. We have seen a lot of these large social media platforms ..banning Crypto currency advertising, because it was either too expensive to filter the genuine content from the scams or the masters behind the scenes.. pushed their own agenda.  Let's hope his stand on Crypto currencies will stay the same ...and that he will allow \"freedom\" for legitimate Crypto currency projects to flourish on the Twitter platform. I really hope he does not change this platform to a \"subscription\" service only.  I don't think so. One thing that Elon loves is money and himself.Some of the things he did in the space include posting bitcoin related pictures and memes on twitter to let people know that he's buying, waiting for the crowd to follow his steps and then selling and posting false accusations towards bitcoin and bitcoin community. Telling everyone that Tesla would accept bitcoin, then cancelling the deal. I think he was mainly responsible for the dump from 58k to 41k because at that exact moment Musk posted his rant about bitcoin using too much energy and told the world that Tesla wouldn't accept it unless it's green... He's a good businessman but he's not fighting for your freedom or trying to help you make money. He wants to make money at all cost which includes throwing you under the bus and he wants more freedom for himself, even at the cost of your freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "October 05, 2022, 10:50:37 AM",
      "body": "Quote from: darkangel11 on October 05, 2022, 09:35:02 AMQuote from: Kakmakr on October 05, 2022, 08:06:24 AMWell, I know one thing....Elon Musk loves Crypto currencies ....and he will most definitely encourage Crypto content on Twitter if he eventually buy it. We have seen a lot of these large social media platforms ..banning Crypto currency advertising, because it was either too expensive to filter the genuine content from the scams or the masters behind the scenes.. pushed their own agenda.  Let's hope his stand on Crypto currencies will stay the same ...and that he will allow \"freedom\" for legitimate Crypto currency projects to flourish on the Twitter platform. I really hope he does not change this platform to a \"subscription\" service only.  I don't think so. One thing that Elon loves is money and himself.Some of the things he did in the space include posting bitcoin related pictures and memes on twitter to let people know that he's buying, waiting for the crowd to follow his steps and then selling and posting false accusations towards bitcoin and bitcoin community. Telling everyone that Tesla would accept bitcoin, then cancelling the deal. I think he was mainly responsible for the dump from 58k to 41k because at that exact moment Musk posted his rant about bitcoin using too much energy and told the world that Tesla wouldn't accept it unless it's green... He's a good businessman but he's not fighting for your freedom or trying to help you make money. He wants to make money at all cost which includes throwing you under the bus and he wants more freedom for himself, even at the cost of your freedom. That's the thing Elon Musk loves making money and one thing that he will do is to promote as much as he can on Twitter, especially crypto-related things. I don't think that he'll try to limit's people freedom of speech on Twitter as it will also affect him profit wise. However, what concerns me is his huge ego and there's a high possibility that he'll try to throw everyone under the bus just as what he already did before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moeda",
      "created_time": "October 05, 2022, 07:49:42 PM",
      "body": "Quote from: Majestic-milf on October 04, 2022, 11:51:58 PMIt's no news of Elon's penchant for acquisition and it didn't shock the public when he came out in April to propose a bid to buy Twitter for a whooping $44bn; It seemed doable after all he was rich and a bit impulsive. But news had it that the billionaire at the last minute decided to renege on his offer, citing claims that Twitter had falsified records on the number of accounts on the platform.It seems that Elon Musk is too ambitious to buy the entire media platform. If the media platform is controlled by one person, of course the world is no longer free from freedom of speech. Even if the deal goes smoothly, it's certainly not good news. I don't want this world to be controlled by one person. Regardless of our individual perception of Elon Musk. To me that's something negative. As the simplest example, if Elon Musk likes Dogecoin, and he doesn't like Bitcoin, then the whole media will hashtag (#) about Dogecoin, and do a takedown on Bitcoin. I gave the example of crypto because I don't want to talk about politics and the broader economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "October 05, 2022, 10:03:07 PM",
      "body": "Quote from: Moeda on October 05, 2022, 07:49:42 PMIf the media platform is controlled by one person, of course the world is no longer free from freedom of speech. Even if the deal goes smoothly, it's certainly not good news. I don't want this world to be controlled by one person. I think presently Twitter has rules and regulations for customers and terms and conditions that is whet guide the freedom of speech. A single person or Elon musk is not able to do so by limiting someone from communication but the terms and condition will do that on the offence we can see Donald Trump as the example because he went against T&C of Twitter.Quote from: Moeda on October 05, 2022, 07:49:42 PM As the simplest example, if Elon Musk likes Dogecoin, and he doesn't like Bitcoin, then the whole media will hashtag (#) about Dogecoin, and do a takedown on Bitcoin. I gave the example of crypto because I don't want to talk about politics and the broader economy.This is about his business and what he like to do or promote. If he is # for dogecoin  and people going with him to that it is not his making because he didn't make it force to anybody to follow him , this is different and not like controlling what someone says or do in twitter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "October 05, 2022, 11:05:33 PM",
      "body": "Quote from: Kakmakr on October 05, 2022, 08:06:24 AMI really hope he does not change this platform to a \"subscription\" service only.  There's no such freedom if you will set this platform for a subscription only even if they accept cryptocurrency, so I think Elon will not make this one and probably focus first more on cleaning the twitter which reject many facts. It's finally good to settle this issue and hopefully Elon will really introduce good crypto instead of a meme token, let's see their next step with this one and see what will be the big change in the Twitter platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "October 05, 2022, 11:10:17 PM",
      "body": "Quote from: samcrypto on October 05, 2022, 11:05:33 PMQuote from: Kakmakr on October 05, 2022, 08:06:24 AMI really hope he does not change this platform to a \"subscription\" service only.  There's no such freedom if you will set this platform for a subscription only even if they accept cryptocurrency, so I think Elon will not make this one and probably focus first more on cleaning the twitter which reject many facts. It's finally good to settle this issue and hopefully Elon will really introduce good crypto instead of a meme token, let's see their next step with this one and see what will be the big change in the Twitter platform. Yeah there is no way that Elon is going to start making it a subscription service.  If any of these social media outlets ever try making it something that you have to pay for, most everyone is just going to leave. They already make an extreme amount of money by all the ads they run alone.  I personally don't have much hope or I should say faith in Elon making twitter better.  I think he's an ego maniac and just wanted to buy it because he can and want's the attention.  Hope I'm wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "October 05, 2022, 11:24:54 PM",
      "body": "In theory, twitter is a large tech corporation. Can anyone think of a technical feature they have added over the last 5 years aside from support for more characters in tweets.It could be safe to say twitter is a tech company that doesn't do any actual tech. What twitter's CEO and employees do remains a mystery. As they do not appear to be in the process of updating twitter or rolling out new features.We have recently seen facebook try to deploy their next generation platform in the form of metaverse. Now it appears that Elon Musk will try to do the same using twitter as a foundation:QuoteElon Musk: \"Buying Twitter is an accelerant to creating X, the everything app.\"https://twitter.com/elonmusk/status/1577428272056389633Twitter could have good growth potential. There haven't been many attempts to improve on the standard model of social media. And of course you know Elon isn't afraid to try.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 05, 2022, 11:58:56 PM",
      "body": "Quote from: Hydrogen on October 05, 2022, 11:24:54 PMIn theory, twitter is a large tech corporation. Can anyone think of a technical feature they have added over the last 5 years aside from support for more characters in tweets.It could be safe to say twitter is a tech company that doesn't do any actual tech. What twitter's CEO and employees do remains a mystery. As they do not appear to be in the process of updating twitter or rolling out new features.We have recently seen facebook try to deploy their next generation platform in the form of metaverse. Now it appears that Elon Musk will try to do the same using twitter as a foundation:QuoteElon Musk: \"Buying Twitter is an accelerant to creating X, the everything app.\"https://twitter.com/elonmusk/status/1577428272056389633Twitter could have good growth potential. There haven't been many attempts to improve on the standard model of social media. And of course you know Elon isn't afraid to try.As far as I know, the biggest last update that I'm familiar with is launching their own in-app live video streaming, and that is like 2016-2017. And they are lucky that up to this day, they are still standing eventhough not much has change in their platform.And so let's see how Elon will improved Twitter after he acquires is, specially the security as we all know that it has been a target for many hacking groups. Also, that it is being used by crypto enthusiast all over the world, hopefully Elon will have to prioritized those tweets, either positive or negative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samfrombaltimore",
      "created_time": "October 06, 2022, 01:47:08 AM",
      "body": "Reminds me of the time Elon said if the UN World Food Programme gave him a plan for how they could spend it, he'd give them $6 billion USD.They called his bluff, and presented him with a plan.He never paid up.Luckily, this time, Twitter brought in the lawyers to get him to put up or shut up.https://www.abc10.com/article/news/verify/business-verify/elon-musk-indicated-2021-to-donate-6-billion-to-fighting-solving-world-hunger-if-un-met-conditions/536-cad0e59e-775d-4c3d-a309-b3ef93379a71",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 06, 2022, 03:23:49 AM",
      "body": "Quote from: Kakmakr on October 05, 2022, 08:06:24 AMWell, I know one thing....Elon Musk loves Crypto currencies ....and he will most definitely encourage Crypto content on Twitter if he eventually buy it. We have seen a lot of these large social media platforms ..banning Crypto currency advertising, because it was either too expensive to filter the genuine content from the scams or the masters behind the scenes.. pushed their own agenda.  Let's hope his stand on Crypto currencies will stay the same ...and that he will allow \"freedom\" for legitimate Crypto currency projects to flourish on the Twitter platform. Elon loves to troll about crypto. He puts a meme coin first in his list, loves Dogecoin more than the rest of the coins. He sold a good amount of his Bitcoin holdings. He removed Bitcoin from Tesla's accepted payment options because of a misunderstanding of Bitcoin's energy consumption. He either fell to FUD or was acting based on wrong information. So I'm not sure if Twitter would be a lot better in Elon's hands than in Jack's hands. And I surely wouldn't hope that Elon's stand on cryptocurrency stays. I'd rather that he just keeps his mouth shut as far as crypto is concerned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "October 06, 2022, 04:16:43 AM",
      "body": "Quote from: samcrypto on October 05, 2022, 11:05:33 PMQuote from: Kakmakr on October 05, 2022, 08:06:24 AMI really hope he does not change this platform to a \"subscription\" service only.  There's no such freedom if you will set this platform for a subscription only even if they accept cryptocurrency, so I think Elon will not make this one and probably focus first more on cleaning the twitter which reject many facts. It's finally good to settle this issue and hopefully Elon will really introduce good crypto instead of a meme token, let's see their next step with this one and see what will be the big change in the Twitter platform. To me it seems impossible Elon will try to make Twitter a service for which you need to pay a subscription to use it at all, if he did that then people will just abandon Twitter massively as soon as that announcement was made, now we will have to see what changes he implements once he buys Twitter, because while some of the things he wants to achieve sound good in theory the question is how is he going to achieve them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 06, 2022, 04:55:25 AM",
      "body": "Elon is a business predator but a strong supporter of internet freedom and cryptocurrency. So personally I think this takeover would have been a blessing for the people who believes in free speech and internet freedom. So I am a little disappointed that deal is now called off. We probably would have seen a very different Twitter if Elon could become the owner of Twitter. But no worries! Better luck next time!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}