{
  "id": "topic_5505745",
  "title": "anarkiboy",
  "author": "anarkiboy",
  "created_time": "August 10, 2024, 11:59:07 AM",
  "content": "I have seen this happening in at least three recent movies where main characters are refusing payment in crypto and additionally calling it scam/bullshit.In one of the movies (can't remember the title) \"hackers\" told they don't want any crypto bullshit scam, they want payment in gold (LOL).Below is an example from The Instigators (2024) I have watched yesterday (movie sucked):Example:https://i.postimg.cc/J7Yh08vF/1-m.jpg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5505745",
  "comments": [
    {
      "author": "C10H15N",
      "created_time": "August 10, 2024, 12:07:09 PM",
      "body": "Pedowood is well known for using its position as an entertainment content provider to push economic and political ideologies (propaganda) upon the ignorant masses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 10, 2024, 12:12:01 PM",
      "body": "I thought this thread was going to be more about how the movie industry just killed a bunch of streaming sites, despite it having nothing to do with crypto directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitLeap",
      "created_time": "August 10, 2024, 12:14:15 PM",
      "body": "Quote from: anarkiboy on August 10, 2024, 11:59:07 AMI have seen this happening in at least three recent movies where main characters are refusing payment in crypto and additionally calling it scam/bullshit.In one of the movies (can't remember the title) \"hackers\" told they don't want any crypto bullshit scam, they want payment in gold (LOL).Below is an example from The Instigators (2024) I have watched yesterday (movie sucked):Example:https://i.postimg.cc/J7Yh08vF/1-m.jpgIs this movie important and has a positive or negative impact on the market? No, even this movie gets a bad rating of 6/10 which means no one can give it a plus point. Besides, there are many movies about bitcoin, documentaries that are much more historical in nature.There is nothing wrong with the main character's statement, because indeed there are quite a few cryptos that end in fraud. But if he says specifically bitcoin, of course the main character doesn't really understand how it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anarkiboy",
      "created_time": "August 10, 2024, 12:14:44 PMLast edit: August 10, 2024, 09:31:24 PM by Mr. Big",
      "body": "Quote from: NotATether on August 10, 2024, 12:12:01 PMI thought this thread was going to be more about how the movie industry just killed a bunch of streaming sites, despite it having nothing to do with crypto directly.It's about propaganda.Quote from: bitLeap on August 10, 2024, 12:14:15 PMIs this movie important and has a positive or negative impact on the market? No, even this movie gets a bad rating of 6/10 which means no one can give it a plus point. Besides, there are many movies about bitcoin, documentaries that are much more historical in nature.There is nothing wrong with the main character's statement, because indeed there are quite a few cryptos that end in fraud. But if he says specifically bitcoin, of course the main character doesn't really understand how it works.It doesn't matter if the movie is good or bad or that few cryptos are scams, they are trying to create image in viewers mind that cryptocurrencies in general are not to be trusted and are worthless scams.Putting this propaganda in movies will have some effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 10, 2024, 12:44:26 PM",
      "body": "are we really surprised? I mean, there have been a lot of shows where Bitcoin is mentioned in a bad light(being used in illegal activities), despite that Bitcoin adoption is still increasing. I know the concern you might have about it but it's 2024 people know are BS and things that are mentioned there should not be taken seriously.if you are curious about shows where Bitcoin was mentioned, here's a thread that has a list of shows where Bitcoin is mentioned [Collection Thread] Series and films in which Bitcoin (or Altcoins) appear",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "August 10, 2024, 12:46:04 PM",
      "body": "Quote from: anarkiboy on August 10, 2024, 12:16:18 PMQuote from: bitLeap on August 10, 2024, 12:14:15 PMIs this movie important and has a positive or negative impact on the market? No, even this movie gets a bad rating of 6/10 which means no one can give it a plus point. Besides, there are many movies about bitcoin, documentaries that are much more historical in nature.There is nothing wrong with the main character's statement, because indeed there are quite a few cryptos that end in fraud. But if he says specifically bitcoin, of course the main character doesn't really understand how it works.It doesn't matter if the movie is good or bad or that few cryptos are scams, they are trying to create image in viewers mind that cryptocurrencies in general are not to be trusted and are worthless scams.Putting this propaganda in movies will have some effect.Cryptocurrency has been around for the past 15 years and there have been millions of bad propaganda about it but as we can all see, it is still growing today and becoming more and more widely accepted. The biggest barrier we have ever encountered is the government, but we have also conquered them, they have recognized our existence and legitimacy. Therefore, movies or junk information spread on the internet no longer affects or damages the reputation of cryptocurrencies. Of course, there will still be people who hate cryptocurrency for some silly reason but that's not a concern because you can't please everyone. Even if you treat everyone well, there will always be people who are jealous or envious of you. So you don't need to worry and just ignore those things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 10, 2024, 02:25:56 PM",
      "body": "Quote from: anarkiboy on August 10, 2024, 11:59:07 AMI have seen this happening in at least three recent movies where main characters are refusing payment in crypto and additionally calling it scam/bullshit.In one of the movies (can't remember the title) \"hackers\" told they don't want any crypto bullshit scam, they want payment in gold (LOL).Since this is a movie and also a character role being acted upon, i may not totally disagrees with such because some were already part of those that raised series of campaigns as against the use of bitcoin and this is not their first attempt, but in the example shown above from OP, this is not a life experience, instead a film acted upon, which renders it as not a live experience or event on what has happened, bitcoin has been wrongly talked about on several occasions before this, and now the criminals were even going against it acceptance for their evil acts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelockg",
      "created_time": "August 10, 2024, 02:53:53 PM",
      "body": "Quote from: anarkiboy on August 10, 2024, 11:59:07 AMI have seen this happening in at least three recent movies where main characters are refusing payment in crypto and additionally calling it scam/bullshit.In one of the movies (can't remember the title) \"hackers\" told they don't want any crypto bullshit scam, they want payment in gold (LOL).Below is an example from The Instigators (2024) I have watched yesterday (movie sucked):Example:https://i.postimg.cc/J7Yh08vF/1-m.jpgif we start to talk about movies and skits even in my country where Bitcoin has been used as a medium of payment, I doubt I will be able to exhaust the list. We just have to accept the reality that it's not everyone that will accept Bitcoin or crypto and go on to speak good about it.  It's just unfortunate that we are literally living in a circle where bost persons in the Bitcoin space try to speak low of those investing in gold and other asset while those that aren't interested in Bitcoin do same by speaking I'll of Bitcoin. I can't remember the thread but one of us here once made a statement that, If you Google search people that do the strangest thing you that is unimaginable, you will still find them and that's how broad and all encompassing the world is. You've got the right to spew out whatever you want to and that's totally up to you but that doesn't in any way make it true or mean that it's reasonable in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "August 10, 2024, 03:06:14 PM",
      "body": "Quote from: anarkiboy on August 10, 2024, 11:59:07 AMI have seen this happening in at least three recent movies where main characters are refusing payment in crypto and additionally calling it scam/bullshit.In one of the movies (can't remember the title) \"hackers\" told they don't want any crypto bullshit scam, they want payment in gold (LOL).Below is an example from The Instigators (2024) I have watched yesterday (movie sucked):Example:https://i.postimg.cc/J7Yh08vF/1-m.jpgIt really doesn't matter because the movie has only 6.2 IMDB rating and you said that the movie sucked anyway.Movies are just for entertainment. Bitcoin has come a long way and now that big institutions have started holding it I don't think such dialogues in movies matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "August 10, 2024, 04:16:06 PM",
      "body": "It's a low hanging fruit and all that the film industry is concerned about is reinforcing certain mindset in people. This is for a very good reason, with a preconceived notion or certain perception of an issue, it makes it more relatable to the viewers when they view a film that is at most an hour or two long. It doesn't matter what they say, all that it matters is that the viewers are able to immediately get the point that they're making.You make it seem like they're intentionally attacking crypto, or that they have something against us. That isn't true and it is more about how the psychology of movie-watchers work and how filmmakers are looking to optimize that. It's naive to think of it in a one-dimension perspective without considering what's really important to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "August 10, 2024, 04:18:29 PM",
      "body": "Bitcoin has been exposed to negative comments from many parties since its first launch until now, many say it is a scam, a fraud, and many other negative things. But whatever they say about Bitcoin does not hinder the development of Bitcoin - we can even see how Bitcoin remains attractive in the eyes of many people and more than that, many countries have opened their doors wider for Bitcoin. From that alone we can conclude that the propaganda they make about Bitcoin will not change people's views easily and they are just wasting their energy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 10, 2024, 04:38:26 PM",
      "body": "Quote from: anarkiboy on August 10, 2024, 11:59:07 AMI have seen this happening in at least three recent movies where main characters are refusing payment in crypto and additionally calling it scam/bullshit.In one of the movies (can't remember the title) \"hackers\" told they don't want any crypto bullshit scam, they want payment in gold (LOL).I never saw a movie where they said they don't want to get paid in crypto but I did see movies where they said they accept crypto and they like this option most. So that means what happens in movies not going to happen in real life. Movies are old and in their timeline, the crypto part might not have a good contribution and that's why they are thinking accordingly even in movies.I don't really know what the reason could be but we can't do anything about what they are showing in movies but if a traditional person is watching these movies and not into crypto yet will definitely move away from crypto and that's not a good thing. That's why I also believe that movies cast the wrong lessons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 10, 2024, 04:58:00 PMLast edit: August 10, 2024, 05:23:56 PM by Z-tight",
      "body": "I believe there have also been movies or shows that portrayed BTC in good light, so i disagree that there is an attack on BTC by the movie industry. Maybe the director of the movie you are talking about does not like BTC or he believes what the mainstream media publishes about BTC. It is not really important in the overall scheme of things, just the way so many people have thought BTC to be a scam all these years, but it has not affected the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "August 10, 2024, 07:26:08 PM",
      "body": "Hollywood has a bad habit of leaning on lazy stereotypes instead of doing their homework.  I get that crypto is still mysterious to a lot of folks, but come on - at least make an effort at understanding it before taking cheap shots.  The truth is crypto adoption is booming no matter how behind-the-times those movie tropes are.  I guess screenwriters think picking on crypto makes them seem cutting-edge somehow? Really though it just shows that they are out of ideas and out of touch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "August 10, 2024, 07:49:27 PM",
      "body": "Bitcoin is constantly under attack from different sides, but so is free speech. Do you remember how youtube was demonetizing videos that mentioned the pandemic, or used the word covid? How google was limiting your ability to search for crypto related sites?Do you remember the smear campaign they launched to make people think bitcoin is bad for the environment? Nowadays they're trying to put people who say something they don't want to be said in jail. For instance in the UK they want to make social media companies to police content and arrest people responsible for something that they call misinformation. This means that if you don't believe in the government narrative and express that in social media, you may be arrested. In other words, if we have covid and they say vaccines are safe, but you tell people they are not, you're going to get silenced. Bitcoin is something they fear because if you hold BTC they cannot freeze your accounts and starve you, like they did to protesters in Canada. Protect your freedom!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "August 10, 2024, 07:58:11 PM",
      "body": "Quote from: anarkiboy on August 10, 2024, 11:59:07 AMI have seen this happening in at least three recent movies where main characters are refusing payment in crypto and additionally calling it scam/bullshit.In one of the movies (can't remember the title) \"hackers\" told they don't want any crypto bullshit scam, they want payment in gold (LOL).Below is an example from The Instigators (2024) I have watched yesterday (movie sucked):Example:https://i.postimg.cc/J7Yh08vF/1-m.jpgI think this was just more playing off of the fact that crypto has been seen as synonymous with scams and a their with a very risky job as is would rather have physical gold. It definitely makes their job a lot harder tho payment in Bitcoin should have been fine lmao",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DiMarxist",
      "created_time": "August 10, 2024, 08:16:09 PM",
      "body": "Those are some of the ways the haters are using it to discredit bitcoin in their movies. And those movies, the producers are against bitcoin so they use those means to campaign against bitcoin but the pro bitcoin is vet high that those things do not move bitcoin anymore again. But instead making it to be made re stronger.I have also watched movies that the characters supported bitcoin to be used in the company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "August 10, 2024, 09:09:20 PM",
      "body": "Can you imagine if people wrote off the internet as only a tool for criminals just because it enabled some sketchy stuff? Obviously crypto has way more potential.  It kinda bums me out that movies and shows keep portraying it so narrowly.  Just feeds into peoples' misconceptions, right? I dunno I just think we need some more nuanced takes.  The black and white crypto bad thing feels pretty outdated.  People could stand to learn about the real-life possibilities instead of just seeing the same ol' crime thriller plot recycled again.  But hey, I guess complex messages dont sell theater tickets or whatever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "August 10, 2024, 10:09:47 PM",
      "body": "I'd ignore that kind of movie but there have been a lot as well that I have watched that they've inserted Bitcoin but didn't attack it and said that it's kind of sort of a thing in the future. In the film industry, they can make illegal into legal, fantasy into reality, and anything that the director and writer, however, they want to dictate the description of Bitcoin or anything into their films. Some series that I've watched in the Netflix did mentioned Bitcoin many times and they didn't even said anything mocking about it although sort of quite fun and comedic but still not that negative at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}