{
  "id": "topic_5415343",
  "title": "radjie",
  "author": "radjie",
  "created_time": "September 29, 2022, 12:04:22 PM",
  "content": "In the current bear market conditions, we can see which projects are able to survive and maximize the coins that have been launched without losing their value.  Usually their strong team and developers are able to deal with any situation by carrying out marketing strategies or promoting coins that have been created so as not to lose the interest of investors and trading activities in them will not die.  what do you think about the benefits of a bear market besides taking the opportunity to make a purchase? bearish market will be strong evidence to determine a really promising project in the future",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415343",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "September 29, 2022, 01:40:45 PM",
      "body": "Quote from: radjie on September 29, 2022, 12:04:22 PMwhat do you think about the benefits of a bear market besides taking the opportunity to make a purchase? bearish market will be strong evidence to determine a really promising project in the futureAside from purchasing cheap prices, people can actually tried out some of the projects platform and see it foe themselves the relevance of their project. Most projects dont have use cases and only been active on trading and you are not gonna put your money on that unless they showcase their worth. Remember a blockchain project should have application on which their platform can be use to various means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 29, 2022, 01:46:40 PM",
      "body": "Most of the project is going along with Bitcoin during bearish market but most of the strong project usually recover huge percentage than Bitcoin during minor correction and that’s the best time to determine quality project and not on the actual bearish market that everyone is falling. Some project is not falling hard because they only have small trading volume and small token holders so the decrease percentage is not a good basis to spot good project because some them hard along with Bitcoin if there’s a strong bearish sentiment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "September 29, 2022, 02:07:35 PM",
      "body": "Quote from: radjie on September 29, 2022, 12:04:22 PMIn the current bear market conditions, we can see which projects are able to survive and maximize the coins that have been launched without losing their value.  Usually their strong team and developers are able to deal with any situation by carrying out marketing strategies or promoting coins that have been created so as not to lose the interest of investors and trading activities in them will not die.  what do you think about the benefits of a bear market besides taking the opportunity to make a purchase? bearish market will be strong evidence to determine a really promising project in the futureThe bear season is a big challenge for all developers and project owners. The decline of their demand leading to price decreases makes them hard to survive the situation. And it is was really hard and hopeless especially if they are not legit, have no working product, and no community. That is why we saw a lot of dead projects during the bear season and it was not a surprise as these are those projects that are simply created for scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 29, 2022, 02:46:25 PM",
      "body": "Yeah you're correct, that's why Bitcoin is never become a dead coin even though Bitcoin already faced bear market for multiple times. While the other shitcoins and new projects will rekt since they can't find any investors who want to invest on their project.Another thing Satoshi or other developer didn't even suggest anyone to buy Bitcoin, but people are willing to buy it which mean they're trust Bitcoin. I don't find any other project which can compete against Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "September 29, 2022, 02:53:27 PM",
      "body": "The bear market has indirectly selected decent and unfit alt coins to invest. But the bear market often causes new projects to be delayed. but when the market is bearish scam projects become more and more.but for me bearish market is useful to test my mentality in my daily trading. and the bear market this time really added a new experience for me. even thanks to this bear market I found a better day trading strategy.I don't invest long term in altcoins. and only invest long term in bitcoin. I only use altcoins as a means of my daily trading and short-medium-term investment.perhaps another benefit of the Bear market is that it has brought in new investors who are trying to accumulate coins from the floor price. because in fact many people are waiting for a bear market to come. and they dare not enter when the market is still bullish. and now a bear market is happening. and the proof is that the number of bitcoin holders is increasing. the same goes for altcoins. although many are also out of crypto. but there are a lot of people who come so the bear market is more like selecting everyone in this area. and I believe those who survive will be the winners when the market recovers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 29, 2022, 03:59:55 PM",
      "body": "Another thing that you can get in a bearish market, probably be the quality of project that you would see. For example, if you have a project that has survived the bear market, then you would have probably found a gem in which that you are just waiting for it to blow up an increase in terms of the demand that it has.It could also serve you also as a determination point, whether you would want to stay in the crypto community or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "September 29, 2022, 07:14:54 PM",
      "body": "If I understand your question correctly, then undoubtedly the advantages of the projects that will survive during this period will be that they are really important both for users and for the crypto industry as a whole. And old projects that already have a good base will offer their improved use cases and new developments in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "September 29, 2022, 07:55:58 PM",
      "body": "Quote from: radjie on September 29, 2022, 12:04:22 PMIn the current bear market conditions, we can see which projects are able to survive and maximize the coins that have been launched without losing their value.  Usually their strong team and developers are able to deal with any situation by carrying out marketing strategies or promoting coins that have been created so as not to lose the interest of investors and trading activities in them will not die.  what do you think about the benefits of a bear market besides taking the opportunity to make a purchase? bearish market will be strong evidence to determine a really promising project in the futureFor new coins there is not really any kind of advantage on facing a bear market, a bear market decreases the interests that investors may have on investing on new coins and this plays against the possibility of their coin developing quite rapidly, and that is not the only problem, one of the biggest problems for them is that during a bear market even good projects can collapse as regardless of what they do, their plans for the future or how good is their coin their project can still disappear because at that point investors are in a state of panic and will not invest in new projects no matter what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "September 29, 2022, 08:56:43 PM",
      "body": "Quote from: radjie on September 29, 2022, 12:04:22 PMIn the current bear market conditions, we can see which projects are able to survive and maximize the coins that have been launched without losing their value.  Usually their strong team and developers are able to deal with any situation by carrying out marketing strategies or promoting coins that have been created so as not to lose the interest of investors and trading activities in them will not die.  what do you think about the benefits of a bear market besides taking the opportunity to make a purchase? bearish market will be strong evidence to determine a really promising project in the futureOr which one is doing to die? And for those who want to gamble and take the risk then they can choose their favorite altcoin and invest on them and see how it goes.But for those who want a 'safe haven', maybe those that are listed in the top 10 is a good investment opportunity already. I mean they have been in the market since the last bear market and they all survived. So if I'm a investors who doesn't want to complicate things and have a good sleep at night, then that's where I will be going in this bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 29, 2022, 10:14:38 PM",
      "body": "The bear market helps in flashing shitcoins, meaning it helps the market to remove of unwanted projects.  It serves as a tool to purge and clean the market.  Most of the incapable project will get delisted or shut down. Aside from the opportunity to buy, it also shows which of the project has capable marketers and developers that have the ability to keep the project afloat despite of the harsh condition of the market.Quote from: South Park on September 29, 2022, 07:55:58 PMFor new coins there is not really any kind of advantage on facing a bear market, a bear market decreases the interests that investors may have on investing on new coins and this plays against the possibility of their coin developing quite rapidly, and that is not the only problem, one of the biggest problems for them is that during a bear market even good projects can collapse as regardless of what they do, their plans for the future or how good is their coin their project can still disappear because at that point investors are in a state of panic and will not invest in new projects no matter what.I think otherwise, having a bear market makes investors browse the market for a potential new project that can grow more than the established altcoin when the bull market comes.  So the bear market is another opportunity for new coins to have the attention of investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "September 29, 2022, 11:20:18 PM",
      "body": "Quote from: radjie on September 29, 2022, 12:04:22 PMIn the current bear market conditions, we can see which projects are able to survive and maximize the coins that have been launched without losing their value.  Usually their strong team and developers are able to deal with any situation by carrying out marketing strategies or promoting coins that have been created so as not to lose the interest of investors and trading activities in them will not die.  what do you think about the benefits of a bear market besides taking the opportunity to make a purchase? bearish market will be strong evidence to determine a really promising project in the futureYou are saying that the bear market helps us know which coins and projects are good? During the bear market, almost all altcoin crashes very badly. This doesn't mean that the coins and projects aren't good one. To find out which projects are good, read the white paper, see what they are trying to achieve, see what problems they are trying to solve or if they have anything new to offer. Look at team and the community. A strong community means a good project (not talking about those \"to the moon community\").",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "September 29, 2022, 11:43:06 PM",
      "body": "Quote from: radjie on September 29, 2022, 12:04:22 PMIn the current bear market conditions, we can see which projects are able to survive and maximize the coins that have been launched without losing their value.  Usually their strong team and developers are able to deal with any situation by carrying out marketing strategies or promoting coins that have been created so as not to lose the interest of investors and trading activities in them will not die.  what do you think about the benefits of a bear market besides taking the opportunity to make a purchase? bearish market will be strong evidence to determine a really promising project in the futureWell first of all i think that in general a bear market is always a bad thing, at least for those people that were already owning cryptocurrencies before the bear market hit. Of course when the bear market is here there is nothing that we (i am talking about normal users that are not super rich and that have no influence) can change about it, so we have to live with it and maybe even use the opportunities that a bear market is offering.Like you already said a bear market is a good time to invest into projects that are already big and established. At the moment you can get Cosmos for around 12$ or Polkadot for a little more than 6$. If you believe that those project will be doing well in the long term future, then i think those prices are  good to enter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kaplusha0",
      "created_time": "September 30, 2022, 12:26:25 AM",
      "body": "I completely agree with you, the bear market shows which projects will survive and which will disappear. It requires a strong team, a fundamental idea, and a close-knit community that believes in the project. Now we are in a deep bear market, and I have chosen the fundamental Amulet Protocol project for myself. It is a decentralized risk protection protocol for the Rust-based ecosystem initially deployed on Solana.I am convinced that Amulet Protocol has a future because you cannot build a long-lasting profitable project without risk insurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "September 30, 2022, 01:01:48 AM",
      "body": "Quote from: Kaplusha0 on September 30, 2022, 12:26:25 AMI completely agree with you, the bear market shows which projects will survive and which will disappear. It requires a strong team, a fundamental idea, and a close-knit community that believes in the project. Now we are in a deep bear market, and I have chosen the fundamental Amulet Protocol project for myself. It is a decentralized risk protection protocol for the Rust-based ecosystem initially deployed on Solana.I am convinced that Amulet Protocol has a future because you cannot build a long-lasting profitable project without risk insurance. Thank you for shilling your project, but we currently have dozens of potential top projects and their prices are heavily discounted suitable for buy so we don't need to add any new projects here. During a bear market, investing in a new project is a bad idea and it would be unwise to develop a new project during bear season. The bear market doesn't have much hype, it's mostly a scam so most investors will be very restrained and timid when it comes to putting their money in. Even the king of the bitcoin market is still facing a severe downturn, influenced by the macroeconomic situation, so it is not wise to invest in a new project at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 30, 2022, 01:19:46 AM",
      "body": "Quote from: Tony116 on September 30, 2022, 01:01:48 AMQuote from: Kaplusha0 on September 30, 2022, 12:26:25 AMI completely agree with you, the bear market shows which projects will survive and which will disappear. It requires a strong team, a fundamental idea, and a close-knit community that believes in the project. Now we are in a deep bear market, and I have chosen the fundamental Amulet Protocol project for myself. It is a decentralized risk protection protocol for the Rust-based ecosystem initially deployed on Solana.I am convinced that Amulet Protocol has a future because you cannot build a long-lasting profitable project without risk insurance. Thank you for shilling your project, but we currently have dozens of potential top projects and their prices are heavily discounted suitable for buy so we don't need to add any new projects here. During a bear market, investing in a new project is a bad idea and it would be unwise to develop a new project during bear season. The bear market doesn't have much hype, it's mostly a scam so most investors will be very restrained and timid when it comes to putting their money in. Even the king of the bitcoin market is still facing a severe downturn, influenced by the macroeconomic situation, so it is not wise to invest in a new project at this time.True that. New projects will be an unwise thing to do whereas in the bear market the prices of the best projects we have seen in the bull market have all plunged as well. So why invest in new projects that may not even be listed on exchanges when there are great projects already at a discounted price?Just pick the top 10-20 coins you see in the CMC or better yet get BTC alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "September 30, 2022, 03:08:55 AM",
      "body": "Quote from: bittraffic on September 30, 2022, 01:19:46 AMQuote from: Tony116 on September 30, 2022, 01:01:48 AMQuote from: Kaplusha0 on September 30, 2022, 12:26:25 AMI completely agree with you, the bear market shows which projects will survive and which will disappear. It requires a strong team, a fundamental idea, and a close-knit community that believes in the project. Now we are in a deep bear market, and I have chosen the fundamental Amulet Protocol project for myself. It is a decentralized risk protection protocol for the Rust-based ecosystem initially deployed on Solana.I am convinced that Amulet Protocol has a future because you cannot build a long-lasting profitable project without risk insurance. Thank you for shilling your project, but we currently have dozens of potential top projects and their prices are heavily discounted suitable for buy so we don't need to add any new projects here. During a bear market, investing in a new project is a bad idea and it would be unwise to develop a new project during bear season. The bear market doesn't have much hype, it's mostly a scam so most investors will be very restrained and timid when it comes to putting their money in. Even the king of the bitcoin market is still facing a severe downturn, influenced by the macroeconomic situation, so it is not wise to invest in a new project at this time.True that. New projects will be an unwise thing to do whereas in the bear market the prices of the best projects we have seen in the bull market have all plunged as well. So why invest in new projects that may not even be listed on exchanges when there are great projects already at a discounted price?Just pick the top 10-20 coins you see in the CMC or better yet get BTC alone.A bear market is a great time to invest in a project because the price is low, and the opportunity to make a profit is high. And this is because it is easier to buy when prices are low, and the growth potential is higher when the market returns to bullruns.but doing analysis and research is something every savvy investor should do as many new projects may not necessarily develop when the market recovers, and if the old and top projects are definitely promising because they have previous footprints, why choose new projects which have no previous footprint and although it looks promising. That's not a guarantee to stay involved as most new projects end up unprofitable and even end up being scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rugrats",
      "created_time": "September 30, 2022, 03:47:44 AM",
      "body": "Quote from: Kaplusha0 on September 30, 2022, 12:26:25 AMI completely agree with you, the bear market shows which projects will survive and which will disappear. It requires a strong team, a fundamental idea, and a close-knit community that believes in the project. Now we are in a deep bear market, and I have chosen the fundamental Amulet Protocol project for myself. It is a decentralized risk protection protocol for the Rust-based ecosystem initially deployed on Solana.I am convinced that Amulet Protocol has a future because you cannot build a long-lasting profitable project without risk insurance. Your project is a decentralized hedging protocol this idea sounds great but now what will you do to assure us that your project will be risk free. I checked the website of the project, it is quite prominent when there are a lot of VCs investing in. But that's still not enough to say that this is a potential project so we need to observe the project for a while before making a decision. This project also hasn't released the token yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cloudfir3e",
      "created_time": "September 30, 2022, 06:35:36 AM",
      "body": "Crypto and blockchain projects are where a lot of new innovations emerge.The projects that were present also competed to provide solutions to various problems faced by the community, both in the data sector, financial services, and business.from a wide range of crypto and blockchain related projects, a large selection of interesting and potentially profitable cryptocurrency asset projects.In today's market conditions, we must carefully observe the projects that will be entered for investment, not forgetting to also find out the history of the project whether it is feasible or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GatotKaca",
      "created_time": "September 30, 2022, 06:45:19 AM",
      "body": "Quote from: rugrats on September 30, 2022, 03:47:44 AMQuote from: Kaplusha0 on September 30, 2022, 12:26:25 AMI completely agree with you, the bear market shows which projects will survive and which will disappear. It requires a strong team, a fundamental idea, and a close-knit community that believes in the project. Now we are in a deep bear market, and I have chosen the fundamental Amulet Protocol project for myself. It is a decentralized risk protection protocol for the Rust-based ecosystem initially deployed on Solana.I am convinced that Amulet Protocol has a future because you cannot build a long-lasting profitable project without risk insurance. Your project is a decentralized hedging protocol this idea sounds great but now what will you do to assure us that your project will be risk free. I checked the website of the project, it is quite prominent when there are a lot of VCs investing in. But that's still not enough to say that this is a potential project so we need to observe the project for a while before making a decision. This project also hasn't released the token yet.if there are a lot of VCs that support it, I think it's good enough to start the project. that means there is a communication effort with other projects to market their new project. this is important I think. but indeed it is not enough for a new project to get investors to run the project.After all, that preparation is done, it is important to see their market response. is it good to be developed or still small enthusiasts? this will certainly affect their long-term marketing strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}