{
  "id": "topic_5441265",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "February 25, 2023, 11:41:16 PM",
  "content": "https://twitter.com/BitcoinMagazine/status/1629573858104582144Source: https://nymag.com/intelligencer/2023/02/gary-gensler-on-meeting-with-sbf-and-his-crypto-crackdown.htmlIs Gensler \"our guy\" now?How do anti-altcoiners feel about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441265",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "February 26, 2023, 08:57:12 AM",
      "body": "Assuming that the news is confirmed, as I have searched the internet and I only see as sources the two that you put, which come from newspapers, it seems logical to me and that is what suits us bitcoiners. It suits us because it does not mix Bitcoin with shitcoins, so the message that there are 20-odd thousand shitcoins that are essentially different than Bitcoin has a strong support. Also, it seems logical to me because of the very nature of bitcoin.Whether he is our guy or not will have to be seen over the years, not just from this statement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "February 26, 2023, 12:51:17 PM",
      "body": "Vitalik Buterin and his patrons laugh softly on the sidelines",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 26, 2023, 02:19:20 PM",
      "body": "Quote from: pawel7777 on February 25, 2023, 11:41:16 PMIs Gensler \"our guy\" now?How do anti-altcoiners feel about this?I would answer you with a counter question - can \"our\" man be someone who works for the US government and according to the guidelines of that same government? The article you linked also states that this man worked for Goldman Sachs for 20 years, and after all that time he is certainly not inclined to any ideas like Bitcoin.The only thing I agree with him on is the following statement : Quote“I don’t think there’s much economic use for a micro-currency, and we haven’t seen one in centuries,” Gensler said. “Most of these tokens will fail, because the question is about these economics. What’s the ‘there’ there?”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 27, 2023, 05:12:02 AM",
      "body": "I saw a video on Twitter several months ago last year where it was SEC Chair Gary Gensler Answers Congressional Question: \"Help us understand the difference between a commodity and a stock in the crypto world?\"Gensler answered with the meaning that: Bitcoin is the only one that we consider a basic investment commodity like gold and oil. As for the rest of the cryptocurrencies, they are all like stocks.I don't know if this is the same video they're talking about now, or if it's a new one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "March 01, 2023, 09:39:58 PM",
      "body": "Quote from: Lucius on February 26, 2023, 02:19:20 PMI would answer you with a counter question - can \"our\" man be someone who works for the US government and according to the guidelines of that same government? The article you linked also states that this man worked for Goldman Sachs for 20 years, and after all that time he is certainly not inclined to any ideas like Bitcoin.Well, there's no denying that there are quite a few die-hard bitcoiners even on this forum who almost seems to root for SEC to declare all other cryptos (especially ETH) as securities to cripple their market share. This goes to show how easy it is to lose the sense of the original purpose and swap principles for tribalism and the desire for financial gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 02, 2023, 10:07:04 AM",
      "body": "This is a political issue. The SEC will regulate the entire crypto market, and they do not need bitcoin, because it is possible that bitcoin will have problems. There are a lot of reasons for this, from large consumption of electricity to a threat to national security.Sometimes even I do not understand how many Chinese, Korean, Russian and other companies first try to comply with the norms of the SEC and then the laws of their countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "March 02, 2023, 12:34:09 PM",
      "body": "Quote from: zasad@ on March 02, 2023, 10:07:04 AMThis is a political issue. The SEC will regulate the entire crypto market, and they do not need bitcoin, because it is possible that bitcoin will have problems. There are a lot of reasons for this, from large consumption of electricity to a threat to national security.Sometimes even I do not understand how many Chinese, Korean, Russian and other companies first try to comply with the norms of the SEC and then the laws of their countries.How exactly is the SEC going to regulate the entire crypto market? Do you really believe that that is somehow possible? What about DeFi? How is SEC going to deal with that, or the cryptos which are already considered securities by the SEC itself? I am not going to worry about the SEC. Nothing but hot air and empty threats. They only go after centralized businesses, if they can. Everything else is unenforceable as with current laws.Enforcing laws fully against crypto would take a global dictatorship. Nothing less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "March 02, 2023, 10:05:57 PM",
      "body": "Quote from: goldkingcoiner on March 02, 2023, 12:34:09 PMHow exactly is the SEC going to regulate the entire crypto market? Do you really believe that that is somehow possible? What about DeFi? How is SEC going to deal with that, or the cryptos which are already considered securities by the SEC itself? I am not going to worry about the SEC. Nothing but hot air and empty threats. They only go after centralized businesses, if they can. Everything else is unenforceable as with current laws.Enforcing laws fully against crypto would take a global dictatorship. Nothing less.But you need a centralised business to be able to trade crypto for fiat and the other way around. Even with stablecoins, there are central entities that hold the deposits that back the coins.So SEC don't really care about DeFi but they could get you when you want to cash out.The major argument for overregulation is that it could put the entire sector outside of US to more friendlier countries, with US citizens just trading there bypassing US laws. But if all of the top countries become strict on crypto - that could be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 03, 2023, 02:59:05 PM",
      "body": "Quote from: goldkingcoiner on March 02, 2023, 12:34:09 PMQuote from: zasad@ on March 02, 2023, 10:07:04 AMThis is a political issue. The SEC will regulate the entire crypto market, and they do not need bitcoin, because it is possible that bitcoin will have problems. There are a lot of reasons for this, from large consumption of electricity to a threat to national security.Sometimes even I do not understand how many Chinese, Korean, Russian and other companies first try to comply with the norms of the SEC and then the laws of their countries.How exactly is the SEC going to regulate the entire crypto market? Do you really believe that that is somehow possible? What about DeFi? How is SEC going to deal with that, or the cryptos which are already considered securities by the SEC itself? I am not going to worry about the SEC. Nothing but hot air and empty threats. They only go after centralized businesses, if they can. Everything else is unenforceable as with current laws.Enforcing laws fully against crypto would take a global dictatorship. Nothing less.A very simple example. The most dangerous criminal is in prison (sarcasm) and Sam Bankman-Freed is free.Tornado Cash Developer to Stay in Jail as Dutch Trial Continueshttps://finance.yahoo.com/news/tornado-cash-developer-stay-jail-170223628.htmlThere are very few talented developers, and they are not ready to live all their lives in Afghanistan or Russia and in those countries where they are not arrested by American intelligence services.Wait a few years and you will see how large defi projects will have white lists and KYC providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}