{
  "id": "topic_5447239",
  "title": "DrBeer",
  "author": "DrBeer",
  "created_time": "April 02, 2023, 11:46:29 AM",
  "content": "The largest crypto exchange in the world, Binance, is going through hard times. The American regulator sued her, management was caught lying about working in China, and analysts found out that the exchange was donating to the Russian army.The US Commodity Futures Trading Commission (CFTC) filed a lawsuit on March 27 against Binance Holdings Ltd and its CEO Changpeng Zhao. The lawsuit alleges that the exchange violated the rules for trading derivatives, writes Bloomberg.The regulator said that Binance was required to register properly many years ago, but did not do so. The lawsuit alleges that the crypto exchange “disregarded applicable federal laws by facilitating the expansion of Binance’s U.S. customer base because it was beneficial to it.”https://www.bloomberg.com/news/articles/2023-03-27/crypto-exchange-binance-sued-by-us-cftc-for-alleged-derivatives-rule-lapsesThis time, the accusations look more severe, plus the \"darling\" of previously unresolved problems. What is your opinion - what are the prospects for the development of the conflict and the impact on the crypto market?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447239",
  "comments": [
    {
      "author": "Lorence.xD",
      "created_time": "April 02, 2023, 12:03:15 PM",
      "body": "Quote from: DrBeer on April 02, 2023, 11:46:29 AM What is your opinion - what are the prospects for the development of the conflict and the impact on the crypto market?From your information stated OP, all I can say is that if the issue is true regarding to the unregistered company and illegal transactions then it Binance would be facing a lot of problems. However, I think the users of Binance would still remain the same as they are not affected from it. Maybe if Binance shut down even for a month, it might have an impact to the market since some traders and investors only use Binance. Binance as a known app for crypto they would eventually do something asap about the given issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "April 02, 2023, 12:29:31 PM",
      "body": "Funny thing that Binance had been in this FUD situations before and they always come victorious. We all know that behind this was one man for sure is SBF that wanted to see CZ to see the downfall like FTX did. The SEC became a greedy institution wanted to crypto crypto as they badly wants but in the end they will not succeed like they did to XRP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "April 02, 2023, 12:39:00 PM",
      "body": "Here's what really worries me in this case:if earlier everything conditionally rested on \"tax\" issues, today it is a violation of the rules of the game in the global financial market, a violation of obligations to the United States, and sponsorship in essence of terrorism. Such a package of accusations can create real difficulties for binance, whose weight in the crypto market is very large. For example, the consequence of the development of the problem may be, let's say - sanctions on the BNB protocol, and the entire BNB network - simply the SEC will prohibit official exchanges from supporting transactions in this network under threat of punishment. This will obviously have a very negative impact on Binance and the crypto market as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "April 02, 2023, 01:02:48 PM",
      "body": "The lawsuit against Binance is currently worrying many as everyone wonders what will happen to their deposits if the allegations are proven. Because we have known for a long time that Binance is one of the most popular and reliable Crypto Exchanges and everyone has deposited their money with great trust.I also have some money deposited here so my question is what will happen to everyone's money if the allegations against Binance are proven. Can those who have deposited money in this exchange withdraw their money?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 02, 2023, 01:14:04 PM",
      "body": "Quote from: DrBeer on April 02, 2023, 12:39:00 PMHere's what really worries me in this case:if earlier everything conditionally rested on \"tax\" issues, today it is a violation of the rules of the game in the global financial market, a violation of obligations to the United States, and sponsorship in essence of terrorism. Such a package of accusations can create real difficulties for binance, whose weight in the crypto market is very large. For example, the consequence of the development of the problem may be, let's say - sanctions on the BNB protocol, and the entire BNB network - simply the SEC will prohibit official exchanges from supporting transactions in this network under threat of punishment. Is there a bail on this thing? I guess that if there is, BNB can easily get away from it. We've been seeing these chasing of issues from different exchanges within their US jurisdictions and they always get some resolution out of it.Quote from: DrBeer on April 02, 2023, 12:39:00 PMThis will obviously have a very negative impact on Binance and the crypto market as a whole.If this goes deeper, there's for sure that it will be a big problem for them and this will give a lot of worry to their customers including me. But as of now, I'm still neutral on it but ready to pull out my funds there if urgent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 02, 2023, 01:20:17 PM",
      "body": "I avoided interacting with the Binance cryptocurrency exchange for a very long time.  I didn't really like that Binance is a centralized exchange.  Of course, I understood that Binance is a very popular project and many interesting events are taking place on this platform.  However, for some reason, I avoided registering on this platform.  However, I recently bought a BNB token.  And since then, I have been reading more and more information materials about potential problems in this ecosystem.  Binance has a very well thought out international organizational structure.  This structure combines legal and illegal elements.  It seems that the management of Binance is using every opportunity to make a profit.  Previously, this did not bother anyone, everyone understood that some entrepreneurs work in a gray zone and this is normal.  However, now the world has changed dramatically.  Now regulators make many decisions based not on economic, but purely political considerations.  Probably, the leadership of Binance is forced to cooperate with the special services of different countries, and this significantly increases the risk of criminal prosecution of the management of the cryptocurrency company and the presentation of property claims to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 02, 2023, 01:49:51 PM",
      "body": "Quote from: Litzki1990 on April 02, 2023, 01:02:48 PMI also have some money deposited here so my question is what will happen to everyone's money if the allegations against Binance are proven. Can those who have deposited money in this exchange withdraw their money?If you're worried then I suggest you start withdrawing now. If you don't have other platforms to trade, maybe it is time to consider looking for an alternative. Whether or not they will users to withdraw after they got fined is a different question. My guess is they will allow users to withdraw, assuming they still plan to run their business normally in other regions and avoid backlash/negative image. Unless they do some dumb shits that prevent them from processing users' withdrawals, I don't think they will just close and run away.Quote from: Smartprofit on April 02, 2023, 01:20:17 PMHowever, now the world has changed dramatically.  Now regulators make many decisions based not on economic, but purely political considerations. Probably, the leadership of Binance is forced to cooperate with the special services of different countries, and this significantly increases the risk of criminal prosecution of the management of the cryptocurrency company and the presentation of property claims to it.Hard to tell how much political interest contribute to the recent fines and prosecution, but I do agree that it should contribute to some extent, especially after the recent bank runs. There are so many spin articles trying to blame crypto for the bank collapses, so it is understandable that they enforce this further by suing other entities. At the end of the day, all of this doesn't matter if you never use a centralized platform in the first place, so I guess people should look into P2P alternatives from now on. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "April 02, 2023, 02:23:26 PM",
      "body": "Quote from: Smartprofit on April 02, 2023, 01:20:17 PMI avoided interacting with the Binance cryptocurrency exchange for a very long time.  I didn't really like that Binance is a centralized exchange.  Of course, I understood that Binance is a very popular project and many interesting events are taking place on this platform.  However, for some reason, I avoided registering on this platform.  However, I recently bought a BNB token.  And since then, I have been reading more and more information materials about potential problems in this ecosystem.  Binance has a very well thought out international organizational structure.  This structure combines legal and illegal elements.  It seems that the management of Binance is using every opportunity to make a profit.  Previously, this did not bother anyone, everyone understood that some entrepreneurs work in a gray zone and this is normal.  However, now the world has changed dramatically.  Now regulators make many decisions based not on economic, but purely political considerations.  Probably, the leadership of Binance is forced to cooperate with the special services of different countries, and this significantly increases the risk of criminal prosecution of the management of the cryptocurrency company and the presentation of property claims to it.I agree that very often, companies follow the path of the saying \"money does not smell\" or \"pecunia non olet\" (c) the Roman emperor Vespasian.But is there any common sense? At a minimum, there should be some kind of \"stop limit\" in trying to make money everywhere, in any way, in any way. This is a direct path towards the border, beyond which there is already illegal reality. And having accelerated strongly, you can simply not have time to slow down - and by inertia cross this line. If everything is there, as the accusations sound, it seems that you need to be careful with deposits and storage of assets on Binance ....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "April 02, 2023, 02:45:25 PM",
      "body": "Quote from: DrBeer on April 02, 2023, 11:46:29 AMThe largest crypto exchange in the world, Binance, is going through hard times. The American regulator sued her, management was caught lying about working in China, and analysts found out that the exchange was donating to the Russian army.Are these donations from Binance's clients or the firm? Individuals or companies might decide to donate to Russia through Binance due to Krelim's disconnection from the international banking system. It shouldn't be just an allegation to give the company a bad name, I hope they have evidence to back their claims.QuoteThe US Commodity Futures Trading Commission (CFTC) filed a lawsuit on March 27 against Binance Holdings Ltd and its CEO Changpeng Zhao. The lawsuit alleges that the exchange violated the rules for trading derivatives, writes Bloomberg.The regulator said that Binance was required to register properly many years ago, but did not do so. The lawsuit alleges that the crypto exchange “disregarded applicable federal laws by facilitating the expansion of Binance’s U.S. customer base because it was beneficial to it.”The timing of this suit is very suspicious. Binance claimed that it has been cooperating and working with the US government to ensure that all issue is resolved amicably. I am suspecting that the recent fall in some major banks in The US and Switzerland damaged the goodwill of the conventional banking system and the government also wants to give the crypto space a bad name to discourage people from pulling out of banks and investing in the crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "April 02, 2023, 03:30:12 PM",
      "body": "This one looks tough and worrisome, I don't know if binance will be able to get out of this one, I never knew that this whole thing is this big, if Binance is caught with genuine proof then we should be preparing for a new leg down, I know that people using binance for trading won't be affected as this is not the case of using users funds like FTX but damn, these people mean business, they want Binance dealt with by all means. If you still have some funds on binance exchange, now is the time to start moving them out, what is coming could be shocking and unexpected, I wish the Binance team a victory on this one, it's not going to be an easy defeat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "April 02, 2023, 03:58:44 PM",
      "body": "I think it is difficult to predict the exact impact of this event on the crypto market, as it depends on the severity of the accusations and the actions taken by Binance to deal with them. The allegations made by the US CFTC are very serious, and if proven true, could result in significant fines or penalties for Binance.However, it is possible that this event could lead to a loss of confidence in Binance and cause users to switch to other exchanges, potentially affecting trading volume and market prices. It is also possible that this development could lead to increased oversight and regulation of the industry as a whole.I take it that events like these highlight the importance of regulatory compliance in the crypto industry, and the potential risks of operating in a largely unregulated space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 02, 2023, 06:32:13 PM",
      "body": "Quote from: DrBeer on April 02, 2023, 02:23:26 PMQuote from: Smartprofit on April 02, 2023, 01:20:17 PMI avoided interacting with the Binance cryptocurrency exchange for a very long time.  I didn't really like that Binance is a centralized exchange.  Of course, I understood that Binance is a very popular project and many interesting events are taking place on this platform.  However, for some reason, I avoided registering on this platform.  However, I recently bought a BNB token.  And since then, I have been reading more and more information materials about potential problems in this ecosystem.  Binance has a very well thought out international organizational structure.  This structure combines legal and illegal elements.  It seems that the management of Binance is using every opportunity to make a profit.  Previously, this did not bother anyone, everyone understood that some entrepreneurs work in a gray zone and this is normal.  However, now the world has changed dramatically.  Now regulators make many decisions based not on economic, but purely political considerations.  Probably, the leadership of Binance is forced to cooperate with the special services of different countries, and this significantly increases the risk of criminal prosecution of the management of the cryptocurrency company and the presentation of property claims to it.I agree that very often, companies follow the path of the saying \"money does not smell\" or \"pecunia non olet\" (c) the Roman emperor Vespasian.But is there any common sense? At a minimum, there should be some kind of \"stop limit\" in trying to make money everywhere, in any way, in any way. This is a direct path towards the border, beyond which there is already illegal reality. And having accelerated strongly, you can simply not have time to slow down - and by inertia cross this line. If everything is there, as the accusations sound, it seems that you need to be careful with deposits and storage of assets on Binance ....It is very difficult to run a business in compliance with all the rules.  Especially when it comes to such an innovative area as cryptocurrencies.  The purpose of a business is to make a profit.  Accordingly, if you start your business in a gray zone, in areas that have not yet been regulated by regulations, then your strategy is aggression and expansion.  You need to take a monopoly place in this field of activity and earn a lot of money.  Then you have a chance to negotiate with everyone, formalize a completely legal business and create a legendary technology company.  But initially there will be many pitfalls on the way of your ship.  We are all law-abiding people here, but there is a suspicion that having earned a very large amount of money, you can lobby for those laws that will protect your interests.  And if you do not manage to earn enough money and lobby for the laws you need, then the existing laws will be turned against you ... There is a suspicion that many businessmen have faced this, and only a few managed to successfully maintain their business, turning it into a top super company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 02, 2023, 07:01:38 PM",
      "body": "I think that it is common to find some problems in the current market of exchanges, after all exchanges are banks for crypto currency, so some of the sins of the traditional banking system can migrate to this new sector.The fact they are attacking Binance this hard, it is because (unlike the traditional banks) it represents new kind of assets which the government cannot regulate or control in a effective way.Binance is supposed to be careful and try not to break any laws, people are already concerned because of what happened to FTX, and if liquidity moves out, their problems will only get bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "April 02, 2023, 07:18:01 PM",
      "body": "Why am I seeing this as politics?  Isn't it confusing when Binance had been announcing that they are doing their best to comply with the US regulation.  Aside from that why is it that SEC is not the one suing Binance, or the IRS or the institution that is responsible for anti-terrorism law if they have evidence stated by @OP.Isn't this issue has something to do with FTX demise?  Either the goal is political or to squeeze money from Binance, it is really troublesome for the Binance users and it may affect the entire crypto market due to Binance being the largest trading platform of cryptocurrency if the case escalated and Binance failed to fix it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "April 02, 2023, 07:18:42 PM",
      "body": "It could be a problem if Binance do not follow the guidelines of security and exchanges. They seem to be evading the taxes and also having brittle securities in the accounting sheet. Since for any exchanger it’s important they follow the plotted SEC & CFTC guidelines, Binance was found guilty on that part but there is a catch. They could get released from the given appeal if they are warned about it and CEO does pay off the taxes as per the terms. I believe state jury Rearden will allow such exemption considering it could cause catastrophic loss to the market and investors around US. If that sentiment got accepted then Binance is done for good otherwise we will follow another shockwave of bitcoin fall after FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "April 02, 2023, 08:00:07 PM",
      "body": "These revelations, concerning as they are, especially if proven true, is not enough to completely hold them down and lose the trust of billions of their active customers, especially when you consider the exhibition they displayed after consecutive bank runs are made against them, only for the people to find out that they are telling the truth when they say they can't be taken down by bank runs. So the case may roll along, CZ might get incarcerated or fined if found guilty of committing such alleged offenses, and yes they may lose a significant amount of their stakeholders and userbase in the process, since that's been the usual trend in the cryptocurrency world anyway ever since bitcoin became big, but I doubt Binance will fall to its knees and surrender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "April 02, 2023, 08:01:37 PMLast edit: April 02, 2023, 08:11:48 PM by TimeTeller",
      "body": "Quote from: panganib999 on April 02, 2023, 08:00:07 PMThese revelations, concerning as they are, especially if proven true, is not enough to completely hold them down and lose the trust of billions of their active customers, especially when you consider the exhibition they displayed after consecutive bank runs are made against them, only for the people to find out that they are telling the truth when they say they can't be taken down by bank runs. So the case may roll along, CZ might get incarcerated or fined if found guilty of committing such alleged offenses, and yes they may lose a significant amount of their stakeholders and userbase in the process, since that's been the usual trend in the cryptocurrency world anyway ever since bitcoin became big, but I doubt Binance will fall to its knees and surrender. They may lose their US-based customers but I think they won't go down like FTX.With such requirements, I don't think CZ was just sleeping not to consider those requirements.I don't know if they are just looking for some loopholes under Binance US operations. Now, they are saying that the exchange broke the American derivatives rules. Then, what's next?As Binance US is a separate business from the binance main platform, their business will still continue.However, we can understand if some will pull out their investments from the exchange for security purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "April 02, 2023, 08:33:43 PM",
      "body": "Not worried about them not being registered - they intentionally kept it that way for years but complied with ample pressure by the government. Not worried about them being called out by CFTC - they have been in similar waters years before.What worries me is that they don't have any major competitors and they are just eating up the market share like a lion eating his lunch for himself. Without any competition, Binance will just do whatever the hell it wants given enough time and we, as registered users, may take the hit eventually. I'm not really a fan of CZ's way of handling things and harsh takes on reality, but they just created a business model that works and that dominates, and I'm afraid no one will ever come to that level anymore and we'll have less options. Quote from: TimeTeller on April 02, 2023, 08:01:37 PMThey may lose their US-based customers but I think they won't go down like FTX.With such requirements, I don't think CZ was just sleeping not to consider those requirements.I don't know if they are just looking for some loopholes under Binance US operations. They are constantly trying to avoid US regulations for a while now, and made another entity different from Binance Global to handle US operations. I don't think it's much of a problem to CZ at this point in time given his exchange's reach, but if he doesn't want to lose grip on his US customers he definitely need to do something to not get these types of lawsuits from the US gov't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "April 02, 2023, 08:44:04 PM",
      "body": "Quote from: Litzki1990 on April 02, 2023, 01:02:48 PMThe lawsuit against Binance is currently worrying many as everyone wonders what will happen to their deposits if the allegations are proven. If they're worried, maybe it would be a good idea to take custody of their funds and finally become a real holder of cryptocurrencies, not a holder by proxy like they are now.QuoteBecause we have known for a long time that Binance is one of the most popular and reliable Crypto Exchanges and everyone has deposited their money with great trust.Someone who deposits money with a third party with great trust must be lacking the ability to do some basic critical thinking. When you hand your money over to someone for safekeping you better know that person well. If you don't, you better hold something that belongs to that person that can be used as collateral.QuoteI also have some money deposited here so my question is what will happen to everyone's money if the allegations against Binance are proven. Can those who have deposited money in this exchange withdraw their money?Don't take unnecessary risk. There's more than one exchange, you know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}