{
  "id": "topic_5436978",
  "title": "Dzigie",
  "author": "Dzigie",
  "created_time": "January 27, 2023, 09:54:27 AM",
  "content": "1974'de nesillerinin tükendiği zannedimiş ama fotokapanlara tekrar yakalanmışlar. Avcılardan korumak için yaşadıkları bölgeler gizli tutuluyormuş.  Fotokapana yakalanan görüntülerhttps://twitter.com/VahitKirisci/status/1618524200230350848 Anadolu Leoparı hakkında kısa videohttps://youtu.be/lRWVyHnA71Q",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436978",
  "comments": [
    {
      "author": "Phoenix Anka",
      "created_time": "January 27, 2023, 10:02:45 AM",
      "body": "İnşallah avcılar görmezler. Doğa harikası bir leopar koruma altına alınmalı. Koruma altına derken alıp hayvanat bahçesinde sergilemek değilde doğal yaşam alanında habitatında koruma altına almak lazım. Yoksa bizim insanımız ilk fırsatta bu güzelim hayvanları öldürür. Doğal yaşam alanında insandan uzakta olduğu sürece herhangi bir şeye ihtiyaç duymadan kendileri yaşar. İnşallah sayılarının zamanla arttığına da şahit oluruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "January 27, 2023, 11:25:02 AM",
      "body": "Boyu çok bi uzun geldi bana. Normal Leoparlar da o boyda mı acaba. Anadolu Leoparımıza özgü bi durum mu yoksa 1,5 metrelik boyu. Ortalama Türk insanının boyu 1,7 metre. 20 cm kısa sadece. Ortalamayı düşüren pek çok kişi ile nerdeyse aynı boya sahip.  Ay bi düşündüm de canavar gibi bi şey canlandı gözümde. Ormanda karşılaşsam ne yaparım diye düşündüm. Ayılara karşı ölü taklidi yapın tavsiyesi var. Hoş o da gerçek mi bilmiyom. Ama Leopara ölü taklidi yapmak tutmaz bana kalırsa. Koşarak kaçsam benden hızlı koşar. Ağaca tırmansam benden hızlı tırmanır. Sayıları azalmasın. Ama çoğalmasın da mümkünse.  Gerçi ben ormana gitmem. Ama onlar şehre inebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "catcontain",
      "created_time": "January 27, 2023, 02:37:35 PM",
      "body": "Direk bok varmış gibi hemen haberini yapmışlar. Şu nesillerinin tükenme tehlikesinin tam olarak ortadan kalkmasını bekleyin resmen eşeğin aklına karpuz kabuğu sokmaktır bu! Yaşadıkları bölgeyi avcılardan gizli tutmaya çalışmak tamam güzelde en iyi yöntem duyurmamaktır. Aklına koyan insan önce Çatalhöyük tarihine bakar buradaki insanların göç hareketlerine bakar ve menzili geniş tutar üç aşağı beş yukarı bir yer bulur zor değil ki bu ya...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "January 27, 2023, 05:33:36 PM",
      "body": "Avcılardan korumak için! Eline silah alan, belge alan, avcıyım diye çıkıyor ya ona da deli oluyorum. Nesil bilmez usül bilmez şimdi bu muazzam canlıyı bulduklarında ne olduğuna bile bakmadan sıkacak olan o kadar çok bilinçsiz kişi var ki. Bir canlıyı korumak hele ki nesli tükenmiş zannedilen ve sonradan ortaya çıkmış bir canlıyı koruyabilmek bir çok şeyden daha değerli olmalı. Sırf kullandıkları beş para etmez facebooklarına fotoğraf atabilmek için yazık etmeseler bari.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "January 31, 2023, 06:51:10 AM",
      "body": "bence fotokapana yakalanan leoparı paylaşarak doğru bir iş yapmışlar. aksi takdirde o leopar bir yerde doğal koşullar altında ölse idi, saçma sapan iftiralar atmak için hazır kıtada bekleyen malum kesime gün doğardı. şuan ise yüzde yüz takip altında olduğu için doğal koşullar altında ölse bile sebebini mevcut şeffaflık içinde iyi-kötü biliyor olacağız.bu olaylardan çok önce bu gibi muhabbetler hakkında kafamda hep tilkilikler dönerdi. :) mesela bir yerden leopar alsalar, biraz anadolu leoparına benzeyen bir leopar alsalar ve onu doğaya salsalar derdim kendi kendime... :) elbette laboratuvar ortamında söz konusu tür incelendiğinde birtakım tespitler yapılabilir belki ama; peki ya laboratuvar ortamında bir inceleme söz konusu olmazsa!!?? :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "January 31, 2023, 07:24:36 PM",
      "body": "Neredeyse 50 yıldır soyu tükendiği düşünülüyormuş bu bana biraz garip geldi. Bir insanoğlu fark etseydi muhtemelen bu nadide canlıyı 2023’te tekrar görememiş olacaktık. Hayvan oldukça sağlıklı da görünüyor umarım kendi doğasında olabildiğince iyi bir yaşamı olur kendisinin ve ailesinin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}