{
  "id": "topic_5419643",
  "title": "dimonstration",
  "author": "dimonstration",
  "created_time": "November 06, 2022, 04:48:51 PM",
  "content": "Recently, CZ released a series of tweets stated that Binance will start to liquidate there FTT token from there orderbook as part of there parting ways to FTX exchange since there announcement last year. They are doing it in batch since the liquidity on the orderbook is not sufficient to absorbed all there tokens on a decent price.I’m sensing a price dump on FTT here like what happened on Luna and I’m sure this will create a ripple effect on crypto in general since this are the battle of 2 largest crypto exchange. Quote from: czAs part of Binance’s exit from FTX equity last year, Binance received roughly $2.1 billion USD equivalent in cash (BUSD and FTT). Due to recent revelations that have came to light, we have decided to liquidate any remaining FTT on our books. Will crypto market will be affected again like what happened during Luna sell off?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419643",
  "comments": [
    {
      "author": "cabron",
      "created_time": "November 06, 2022, 05:08:15 PM",
      "body": "FTX is a big exchange but its token has a low volume. He must be holding a lot since it's presale. It's very undermining that he has to announce thier dump plans actually. It's either he has already done dumping his FTT or he plans to buy more which he just wants holders to sell.They are competitors but I think the better for him to understand and monitor his closest competitor more if he holds FTT than abandoning. This way he can check whats going to FTX closely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "November 06, 2022, 05:12:59 PM",
      "body": "Quote from: cabron on November 06, 2022, 05:08:15 PMFTX is a big exchange but its token has a low volume. He must be holding a lot since it's presale. It's very undermining that he has to announce thier dump plans actually. It's either he has already done dumping his FTT or he plans to buy more which he just wants holders to sell.They are competitors but I think the better for him to understand and monitor his closest competitor more if he holds FTT than abandoning. This way he can check whats going to FTX closely.Sam of FTX did the same on Binance last year after announcing they are pulling out there share on Binance. Base on CZ tweet, They are just starting to sell off there tokens slowly until they complete to liquidate all there tokens. This is surely a retaliation on Sam action towards Binance that’s why he is announcing this info on public to create panic on FTT holders since they are now not a business anymore.Sam needs to counter this by providing liquidity to support the price from sliding off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 06, 2022, 05:24:05 PM",
      "body": "*their FTT tokensThis can’t be good news. I’m hearing rumors that the market cap of FTT is about 5 billion dollars higher than makes any sense. No doubt Binance selling so much over an extended period of time is going to have a negative effect on FTT’s value. I just hope we won’t be seeing another Luna situation, which the smoke is starting to appear on the horizon. Watch out for the fire and steer clear…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moeda",
      "created_time": "November 06, 2022, 06:13:57 PM",
      "body": "In these two days the price of the FTT coin started to fall with a market cap of less than -8%. Perhaps what was happening right now was part of the effect that was conveyed by Changpeng Zhao. Nonetheless, I'm sure the FTT price won't be a dump like Luna's. This is a different case with Luna. We all know what happened to Luna, and who did it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "istiak2277",
      "created_time": "November 06, 2022, 07:04:35 PM",
      "body": "Quote from: dimonstration on November 06, 2022, 04:48:51 PMRecently, CZ released a series of tweets stated that Binance will start to liquidate there FTT token from there orderbook as part of there parting ways to FTX exchange since there announcement last year. They are doing it in batch since the liquidity on the orderbook is not sufficient to absorbed all there tokens on a decent price.I’m sensing a price dump on FTT here like what happened on Luna and I’m sure this will create a ripple effect on crypto in general since this are the battle of 2 largest crypto exchange. Quote from: czAs part of Binance’s exit from FTX equity last year, Binance received roughly $2.1 billion USD equivalent in cash (BUSD and FTT). Due to recent revelations that have came to light, we have decided to liquidate any remaining FTT on our books. Will crypto market will be affected again like what happened during Luna sell off?It may not affect other markets anyway but the FTT market pair was dumped right after that tweet. CZ is very clever and he is clearly using his influence to put pressure on his competitors. He already said that this sell of will continue for the next 2-3 months so that it won't affect the market badly. Right after that almenda tweeted that they will buy all those FTT per token 22$ in price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 06, 2022, 07:19:56 PM",
      "body": "It now makes sense to me why FTX is going to be offering their own stablecoin. I thought they were going to raise a ton of funds in order to buy the bottom here and send us upward. However, it now looks like they’ve gotten themselves into a leveraged mess with their FTT token and are likely looking to bail themselves out using funds from offering a stablecoin. I hope they can be successful, otherwise FTX collapsing would definitely send us downward to that $13K everyone has been eyeballing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "November 06, 2022, 07:50:28 PM",
      "body": "Quote from: cabron on November 06, 2022, 05:08:15 PMFTX is a big exchange but its token has a low volume. He must be holding a lot since it's presale. It's very undermining that he has to announce thier dump plans actually. It's either he has already done dumping his FTT or he plans to buy more which he just wants holders to sell.They are competitors but I think the better for him to understand and monitor his closest competitor more if he holds FTT than abandoning. This way he can check whats going to FTX closely.You got it right!I dont easily make myself believe that he would just simply be dumping these tokens despite on having low volume, considering that its one of its competitors then it would really be that ideal on accumulatingcoins as much as he could(You know what i mean).You could easily able to notice it out that every delisting or dumping then there's no such thing about special proclamation or announcement on doing so, but thats only into those tokenswho arent really that interesting for him but for this one? Its not something surprising that he would be putting up some emphasis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 06, 2022, 08:34:16 PM",
      "body": "The speculations board is for bitcoin speculation and this topic goes to the Altcoin Discussion. FTX token has dumped $2 already and there's one tweet and maybe that woman Caroline is from FTX too that said and replied that they're willing to buy all of those FTT that CZ has @ $22 each.That's really going to give them some hard time to see its value go down because we know how influential CZ is and even without him announcing it, that's a lot of money in FTT that they'll dump into batches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "November 06, 2022, 08:36:52 PM",
      "body": "Quote from: dimonstration on November 06, 2022, 04:48:51 PMWill crypto market will be affected again like what happened during Luna sell off?This will be FUD or bad news among cryto speculators, so the correlation will have an impact on crypto prices for a while. However traders will sell to avoid losses, this will have little impact in the short term.I don't really know if this is the most likely reason for the rivalry between the two exchanges, but of course since binance liquidated FTT the trading volume of FTT has dropped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 06, 2022, 08:52:58 PM",
      "body": "It's better that CZ announced it, otherwise a lot of us would be clueless on the situation until it's over. Anyway, that's a lot for the market to absorb, and seeing that it's still not done and FTT already lost a considerable amount on its spot value, this might be another Luna situation, only we were told ahead of time of what's happening. Hopefully FTX can turn this around, though for sure it will be hard since tjat's a lot to begin with. $2.1B is no joke.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mame89",
      "created_time": "November 06, 2022, 09:17:47 PM",
      "body": "I saw a leak from the ftx team they said relax on carolina's twitter account, because they have a 10b reserve in finance to be able to restore things that are not good right now. these two markets have almost the same strength despite being superior to binance, I believe this declining FTT coin can quickly return to its previous price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "November 06, 2022, 09:25:47 PM",
      "body": "Quote from: dimonstration on November 06, 2022, 04:48:51 PMRecently, CZ released a series of tweets stated that Binance will start to liquidate there FTT token from there orderbook as part of there parting ways to FTX exchange since there announcement last year. They are doing it in batch since the liquidity on the orderbook is not sufficient to absorbed all there tokens on a decent price.Well i don't know about the connections between FTX and Binance but it seems like Binance invested into FTX some time ago or they would not have that many FTT tokens i guess. I am not a big fan of binance in general, simply for the fact that they are slowly but surely becoming very dominating in the crypto space and it is never a good thing if one company is dominating a whole industry sector. A few weeks ago Binance announced that they would no longer support USDC as a stablecoin on their exchange even though it is the second largest stablecoin and also a very reliable one, but of course it is managed by coinbase which is a competitor of Binance so they delisted it and now the same with the sell-off of the FTT token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "November 06, 2022, 11:44:51 PM",
      "body": "FTX has too many premined token that being used as collateral. I saw that this tweet was not even FUD https://twitter.com/DU09BTCBinance was only securing his position from possible scenario that might happen like luna. binance doesn't wanna let all of its investment has gone like luna and that's why CZ has been deciding to liquidate all of FTT acquired by investing into FTX at the early phase. Alameda research may also possible to be liquidated as well in the future if bad scenario would happen with it. I have been also withdrawing all of my money from FTX. Im only saving small amounts of money in FTX.It seems like that there are so many manipulation in the crypto. This turns me to be doubt with future of FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}