{
  "id": "topic_5462731",
  "title": "frogx",
  "author": "frogx",
  "created_time": "August 09, 2023, 10:51:25 PMLast edit: August 10, 2023, 02:08:39 AM by frogx",
  "content": "Sorry if this is in the wrong category.Question - does LTC have the same Timelock protocol as BTC?I regularly time-lock my BTC using <coinb.in>. I noticed that this tool is also compatible for LTC, but does time-lock follow the same process as BTC?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462731",
  "comments": [
    {
      "author": "frogx",
      "created_time": "August 10, 2023, 02:08:22 AM",
      "body": "Can someone please verify that this transaction has been completely signed properly, and that it will be broadcasted automatically after block 2615000?https://live.blockcypher.com/ltc/tx/eca83c2d39f42e81f3fd1479e6e18624c24a518b53a9f814393bfc8111a3023d/Why is this transaction not showing up on other block explorers?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 10, 2023, 05:10:46 AM",
      "body": "Yeah Litecoin has a timelock feature and you did it correctly, your transaction will be included on the 2,615,000 block, currently the latest block is 2,524,276, the difference is 90,724. The average of Litecoin's block is 2.5 minutes, so it's expected you will receive the coins after next 5 months.Each block explorer has their own rule, some not include time lock transaction due to it's still long, some not include unconfirmed transaction etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "frogx",
      "created_time": "August 10, 2023, 06:10:34 AM",
      "body": "Quote from: Apocollapse on August 10, 2023, 05:10:46 AMYeah Litecoin has a timelock feature and you did it correctly, your transaction will be included on the 2,615,000 block, currently the latest block is 2,524,276, the difference is 90,724. The average of Litecoin's block is 2.5 minutes, so it's expected you will receive the coins after next 5 months.Each block explorer has their own rule, some not include time lock transaction due to it's still long, some not include unconfirmed transaction etc.Thanks for your response, I appreciate it.Are you 100% sure though? Is Blockcypher the only explorer that shows time locked transactions? Because i tried 10 other explorers and it did not come up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "frogx",
      "created_time": "August 11, 2023, 12:39:12 AMLast edit: August 11, 2023, 09:26:02 AM by Mr. Big",
      "body": "Well, the transaction got removed from the block explorer now. It's back in MVjFqmkLrY4Hnpbr12AC6tAL1w8hRFYypu. I'm going to assume I did it right, and that I can keep safely sending funds to MVjFqmkLrY4Hnpbr12AC6tAL1w8hRFYypu, and that it will be unlocked at block 2615000.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}