{
  "id": "topic_5469775",
  "title": "knowngunman",
  "author": "knowngunman",
  "created_time": "October 09, 2023, 04:10:14 PM",
  "content": "Security is everyone's responsibility and it has become very necessary and paramount to protect ourselves from cyber attacks as we engage ourselves online on a daily basis. As technology is advancing and improving is the same way hackers are also advancing in their methods by using different social engineering. This is not the first time something like this is being discussed in the forum but I think it's necessary to be bringing it up on a timely basis in order to keep us abreast. Let quickly brush on the following techniques use by hackers and how to protect yourself from them.PhishingSmishingVishingPhishing is a type of cybersecurity attack which happens when malicious actors send messages (email to be precise) pretending to be a friend or a company so as to  steal information or corrupt their devices.Example of PhishingThis unfortunate love story started in the Philippines in the year 2000 and was delivered with the subject line I Love You along with instructions to read the attached email. The virus was tracked to an email address registered to an apartment in Manila, which led to Onel de Guzman. He created the Love Bug virus, not thinking it would reach as many people as it did.Within 24 hours of releasing the virus, it had spread across the world.Remember that it can be in form of link too and not necessarily need to be a file.Smishing is similar to phishing just because it has a common goal. However, it uses deceptive text messages to manipulate victims into giving out sensitive personal information such as bank account details, credit card numbers and login credentials.Example of SmishingI have decided to call this lookalike walmart attack because their aim is to portray themselves as those big firms who you probably have transactions with, in other to trick you into believing they are rewarding you. At times, you can still get messages like this even if you have never used their services before. Sometimes, some amateur attackers just send these messages at random.Vishing is very similar to phishing with the exception that this uses phone calls. This is a manipulative practice of making phone calls or voice messages pretending to be from well known companies in order to make individuals to reveal personal information, such as bank details and credit/debit card numbers and more.Example of VishingHave you ever received a phone call, telling you your account has issues and the person you are talking to is a supposed customer service agent? That is Vishing. They pretend that they are from the banks or other institutions that houses your private information. Their aim, is to get those data off you and use it in dangerous ways.How do we protect ourselves from being a victim of these attacks?The simple way to avoid these attacks are by following the preventive measures which may include:Don’t ever click on SMS or email you are sent from unknown sources. Go to the company's website for verification by typing their URL.Check the names of the sender and most importantly, the links too. Does it make sense for a reputable organization to use bit.ly? Ask yourself that amidst others.Never share private information over the phone. Its better you meet with the company physically to confirm.Verify the number of the so called company that is calling you. Check their website or the internet to confirm if the numbers correlate. However, know that, numbers too can be cloned, so it’s better to just stick with not sharing sensitive information over online or phone call.Always download your apps from playstore or apple store for android and apple device respectively because a malware named trojan can be embedded inside those Apps you download from untrusted sources. Better safe than sorry.Do not visit sites that starts with Https because these are sites that are not secured with Tls(Transport Layer Security) or as it was previously known, Ssl (No more in use). Secured sites url should start with https.A compilation of these tips and more on cyber security can be read via this documents",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469775",
  "comments": [
    {
      "author": "goxcraft",
      "created_time": "October 09, 2023, 06:56:56 PM",
      "body": "Scammers are creating new ways to scam the innocent people. With more modern technology scammers are adapting to new methods. Although the method you mentioned is kind of old but they are still in use and effective. Thousand of dollars are lost to these scammers daily. Some months ago, I was almost scammed by a clipboard virus. Basically this virus replaces the original sending address with a phishing address. As a result all funds goes to an entirely different address. And it cannot be undone. I don't know how I got infected. Maybe I downloaded some things or clicked suspicious links. After the incident I started using, sandbox, VM type of software, to test new things or links if I were unsure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChicksX",
      "created_time": "October 09, 2023, 07:52:31 PM",
      "body": "Quote from: goxcraft on October 09, 2023, 06:56:56 PMScammers are creating new ways to scam the innocent people. With more modern technology scammers are adapting to new methods. Although the method you mentioned is kind of old but they are still in use and effective. Thousand of dollars are lost to these scammers daily. Some months ago, I was almost scammed by a clipboard virus. Basically this virus replaces the original sending address with a phishing address. As a result all funds goes to an entirely different address. And it cannot be undone. I don't know how I got infected. Maybe I downloaded some things or clicked suspicious links. After the incident I started using, sandbox, VM type of software, to test new things or links if I were unsure.Did you run a malware/virus check and find anything? We hear of these clipboard style virus' often, but with modern security OS' and security software it seems unlikely to receive one unless someone  is a victim of a phishing attack. For this reason taking absolute care around anything cryptocurrency related is vital. So it's good you've taken some measures to prevent this in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "October 09, 2023, 08:03:34 PM",
      "body": "Quote from: goxcraft on October 09, 2023, 06:56:56 PMSome months ago, I was almost scammed by a clipboard virus. Basically this virus replaces the original sending address with a phishing address. As a result all funds goes to an entirely different address. And it cannot be undone. I have heard of these clipboard virus used by scammers, I’m not a technical expert but I always make sure I double check the wallet address I’m sending bitcoins to just to be sure I’m not making a silly mistake that will cost me. People who mostly are a victim of this scam are those who copy sending addresses without cross checking. this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 09, 2023, 09:20:23 PM",
      "body": "Quote from: goxcraft on October 09, 2023, 06:56:56 PMI don't know how I got infected. Maybe I downloaded some things or clicked suspicious links. After the incident I started using, sandbox, VM type of software, to test new things or links if I were unsure.It is basically impossible to be 100% certain that your device is free from malware or any other type of attack, thus you should hodl your funds offline, only keep a small amount of funds in a hot/online wallet because such funds are susceptible to being hacked and stolen. Quote from: ChicksX on October 09, 2023, 07:52:31 PMDid you run a malware/virus check and find anything? We hear of these clipboard style virus' often, but with modern security OS' and security software it seems unlikely to receive one unless someone  is a victim of a phishing attack.Open source and security-based operating systems are great to use, but mind you that if your device is online, you cannot be sure it is completely free from malware and other forms of attack, even if you use such OS', thus your assets should be stored offline in a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "October 09, 2023, 09:57:21 PM",
      "body": "Quote from: goxcraft on October 09, 2023, 06:56:56 PMScammers are creating new ways to scam the innocent people. With more modern technology scammers are adapting to new methods. Although the method you mentioned is kind of old but they are still in use and effective. Thousand of dollars are lost to these scammers daily. New developments are coming due to the advanced technology age. As people adopt new technologies to improve their privacy and secure their assets and other valuable information online, scammers are also working hard to bridge the new technological ways that have been discovered. That is why we need to be very cautious with our privacy online.QuoteSome months ago, I was almost scammed by a clipboard virus. Basically this virus replaces the original sending address with a phishing address. As a result all funds goes to an entirely different address. And it cannot be undone. I don't know how I got infected. Maybe I downloaded some things or clicked suspicious links. After the incident I started using, sandbox, VM type of software, to test new things or links if I were unsure.Malware attacks are very bad, and you will be wondering their source; mostly, they are gotten through the visitation of anyhow links that are unofficial while trying to download or install some software on your devices, and sometimes through email spam messages.With or without a malware virus on your device, always double-check your bitcoin address before sending bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "October 09, 2023, 10:47:56 PM",
      "body": "Quote from: goxcraft on October 09, 2023, 06:56:56 PMSome months ago, I was almost scammed by a clipboard virus. Basically this virus replaces the original sending address with a phishing address. As a result all funds goes to an entirely different address. And it cannot be undone. I don't know how I got infected. Maybe I downloaded some things or clicked suspicious links. After the incident I started using, sandbox, VM type of software, to test new things or links if I were unsure.AFAIK downloading cracked version of paid applications, downloading softwares from untrustworthy sources or websites, clicking links in emails from unknown sources, trojans are some of the ways your computer could have been possibly infected. Glad to know you were able to noticed that your copied address has been replaced by a clipboard malware but you might want to reconsider your browsing habits. Whenever a transaction is about to be carried out, it's very important to always crosscheck some of the digits of the copied address against the address on the sending tap before confirming the transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "October 09, 2023, 11:02:19 PM",
      "body": "Aside from knowing the list stated by @OP, there are other kind of threat online. Threat like malware and ransomware are rampantly infecting victims.  One of the recent news in my country is the Philhealth being hacked through backdor malware that enable the hacker to control the system. This is one of the example of the ransomware and said to be infected through the device of one of its staff working at home.So aside from being on lookout for Phishing, Vishing and Smishing, one should also tighten their internet security for possible data hack.  Installing anti-malware  or internet cyber security can greatly help to avoid this king of attacks.Most importantly, avoid clicking unknown links.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "October 09, 2023, 11:17:24 PM",
      "body": "0 days also exist. So sometimes it's possible to get hacked simply for opening an image let's say, which should not be an attack vector normally. For instance the .webp exploit had it so users could get exploited simply by opening a webp image sent to them. Thankfully it was patched by major If someone is looking to store significant amounts of cryptocurrency, it's always best to store it in a way that doesn't involve an internet connection. Cold wallets exist. And if you for some reason need a computer to do something it can also be non-networked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 09, 2023, 11:31:05 PM",
      "body": "Quote from: BitDane on October 09, 2023, 11:02:19 PMMost importantly, avoid clicking unknown links.That's the most important and always verify what you click.Actually, there are too many of them, a kind of cyber attack that we should know and even here in the forum that still happened.  The same case in the Electrum hack attack, called pop-up scam, it's involves deceptive pop-up windows on websites or app, often claiming that the user's computer is infected or need to update to a higher version in order to proceed with the transaction which is the result in downloading malicious software.In my country, this smishing scam attempt is very common, yesterday I received a text message that my bank account was compromised, but while reading the text message I knew it was a scam attempt because I don't have an account on the bank that the text said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "October 10, 2023, 12:04:20 AM",
      "body": "Quote from: knowngunman on October 09, 2023, 04:10:14 PMHow do we protect ourselves from being a victim of these attacks?We always often hear a sentence: Don't Trust, Verify. Even the sentence does tend to be bitcoin, but if you study it carefully that sentence is very useful to remind us not to easily believe in something in the world. We are humans who are sometimes careless and forget about something which can make us lose something important. Because of that if I receive something via email, Chat, SMS, or anything on the gadget, I have to check it 1st if that message is safe from viruses, or any kind of malware. I never click on any links from messages even if the links look clean and trust. I will definitely ask and find out the purpose until I'm really sure that link is safe. Sometimes, If the link is useless for me, I never click it even if it's safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "October 10, 2023, 01:16:39 AM",
      "body": "Don't be careless when you are online and click on any link you see. You will not be phished if you are careful on the Internet.Security checklist[LEARN & EARN] Phishing Quizzes - Beginners & Experts[Tutorial] How To Report Phishing Email & Create Auto Delete Filter - Gmail UserTool For Catch Phishing likehttps://dnstwister.report/https://www.phishtank.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "October 10, 2023, 09:56:25 AM",
      "body": "Quote from: MusaMohamed on October 10, 2023, 01:16:39 AMDon't be careless when you are online and click on any link you see. You will not be phished if you are careful on the Internet.It doesn't matter how careful you get you'll still get phishing emails. It might be too much but they'll still come. Scammers work very hard. It doesn't have to be just emails, social media accounts also receive phishing messages. They send all forms of intriguing messages. It could be an investment, to invest in a particular project, or a way to make money online. You just have to know that you shouldn't click on these links and don't take those kinds of messages seriously. You can block numbers and emails that send phishing messages to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 10, 2023, 11:56:46 AM",
      "body": "Ensure your devices have up to date antivirus software & operating systems. Use strong and unique passwords for each online account. Always be cautious of suspicious emails, messages or requests for personal information & never click on unfamiliar links or download files from untrusted sources. Obviously back up your important data and enable two factor authentication whenever possible. Be mindful of the info you share online & adjust privacy settings to limit access to your personal data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunkieMiner",
      "created_time": "October 11, 2023, 06:56:23 PM",
      "body": "These attacks sometimes come through the anti-virus app that you are running through your Laptop or PC. I'm aware of that because this happened to me many times, When I was running an Anti-Virus app on my laptop, so there my all data was hacked into the laptop because it suddenly got the passwords that were through the malicious links. And I turned off my laptop when I again opened it there was nothing on the laptop, the data were something else, i.e malicious things. Also, never try to open spam links through your email or any other app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "October 11, 2023, 08:40:51 PM",
      "body": "Well, I want to appreciate your effort to always remind the community on their safety and I always take my safety very seriously especially  On the internet and on the cryptocurrency industry this is because any funds lost or stolen in the cryptocurrency industry can’t be recovered and adding to all you’ve listed is phishing links and people should always try as much as possible to avoid clicking on any random link from the internet especially from exchanges and I’m saying this from my personal experience and ordeal and I wouldn’t want anyone to also fall victim of such cheap scam and also learn how to treat everyone and everything as a suspect as long as the internet is concerned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 11, 2023, 08:49:00 PM",
      "body": "Quote from: knowngunman on October 09, 2023, 04:10:14 PMSecurity is everyone's responsibility and it has become very necessary and paramount to protect ourselves from cyber attacks as we engage ourselves online on a daily basis. If we tirelessly work towards having the best security safety of our bitcoin asset then we are going to remain a difficult puzzle for the hackers to solve the means through which they can use to have access to us and penetrate in, we are in most cases responsible for allowing them to attack us because we unknowingly creates some loopholes that serves as entry point for them to launch an attack, henceforth we need to be very careful with how we appear online and things we do on various websites visited, these alone may reduce our chances of being scammed as well if we give attention to them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 11, 2023, 09:14:37 PM",
      "body": "Constant safety reminder keeps you abreast and puts you in the know of possible and potential security attack on you. As time goes on and as technology evolve, scammers are always going sophisticated too. I too for once take a proper check on my accounts to note any lapses so I could put it in other because that is the only way to stay safe and always protected online. Once in a while do a routine check for updates as regards your privacy and security features.Newbies are the most target of these scammers and most of the newbies fall sheepishly to their scams and hacks  causing them huge losses which they never believe they could lose just like that without any remedy of getting it back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "October 11, 2023, 09:56:51 PM",
      "body": "This is very informative, this just made me remember a buddy, i told to make use of authenticator on all his online account he created, in the past which for a second it was as if i knew he never heard of AUTHENTICATOR before so along the line i had to show and direct him on how to get it done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "October 12, 2023, 04:23:21 AM",
      "body": "Quote from: SatoPrincess on October 09, 2023, 08:03:34 PMQuote from: goxcraft on October 09, 2023, 06:56:56 PMSome months ago, I was almost scammed by a clipboard virus. Basically this virus replaces the original sending address with a phishing address. As a result all funds goes to an entirely different address. And it cannot be undone. I have heard of these clipboard virus used by scammers, I’m not a technical expert but I always make sure I double check the wallet address I’m sending bitcoins to just to be sure I’m not making a silly mistake that will cost me. People who mostly are a victim of this scam are those who copy sending addresses without cross checking. this  Yeah, It's all over everywhere, clipboard virus used to take away people's funds unknowingly. The causes of such a virus is downloading apps recklessly to our device, where we hold crypto. It's crucial we mind the app downloaded to our devices as they could contain malware. There is an increase in security breach on the internet. Checking the address isn't all needs to be done. Maybe someday we won't be able to go through the address properly, before forwarding the funds. I'd suggest that users after noticing an attack like that. Taking away irrelevant apps or files from our device is encouraged. However, attackers have multiple means to con internet users, especially in the cryptocurrency niche. Aside from the techniques exposed by OP, the list goes on and on. But, phishing is one dangerous method, and it could be dangerous, when we are not observant of the URL of the site we visit. This kind of scam isn't simple to notice initially, that's why people still fall for it. Those other methods are relevant, but can be suspicious at a point, depending on the scam player.  Calling people claiming to be their financial institution can stair suspicions, if the receiver understands the trick. The scammers phone number may not be similar to that of the institution and the professionalism may not match that of an employed customer care in the institution. Most institutions, boldly announce that they don't call or ask for sensitive information from their customers. Unless the user doesn't follow diligent research process, the could fall victim for such a scam. Unlike phishing, it's just so difficult to notice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}