{
  "id": "topic_5398942",
  "title": "donlogan22222222222",
  "author": "donlogan22222222222",
  "created_time": "May 16, 2022, 09:19:13 PM",
  "content": "I am attempting to mix some coins and am really struggling. I have read a lot of positive feedback on Chipmixer so decided to give it a try with a little tester first. I used the following Onion URL:http://chipmixorflykuxu56uxy7gf5o6ggig7xru7dnihc4fm4cxqsc63e6id.onionWhen I deposited my coins it told me shortly thereafter that You have donated 0.709 mBTC which is 100.0% of your deposit. Thank you!I did not make the decision to donate any coins and none arrived in my wallet.I opened a new session on a clearnet browser and the receiving address was the same as the other session. This confused me as I believed I had done due diligence and that particular Onion address has been shared many times on this very forum (and elsewhere) as being legitimate.I also found this Onion URL which from what I can tell also appears to be illigitimatehttp://chipmixs2qgisuu6gu4uqpdy4edtnzdalzlhbins2ua5pexwjdkcacad.onionI see Chipmixer get excellent feedback but am losing a bit of heart due to all of the scam sites around. Can someone please direct me to the genuine Chipmixer site?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398942",
  "comments": [
    {
      "author": "jackg",
      "created_time": "May 16, 2022, 09:35:27 PMLast edit: June 12, 2022, 12:34:56 PM by jackg",
      "body": "Chipmixer's smallest chipsize is 0.001btc, it's stated quite clearly on the deposit page afaik.I think this means you can deposit 0.291mbtc to the same address to get your 1mbtc chip but I'm not sure if that's still the case.You can double check their onion url under this post in the right hand side (right click and copy link) - edit they look the same",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "donlogan22222222222",
      "created_time": "May 16, 2022, 09:38:26 PM",
      "body": "Thanks for the info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 16, 2022, 09:49:39 PMLast edit: May 16, 2022, 10:00:01 PM by Bitcoin_Arena",
      "body": "Quote from: jackg on May 16, 2022, 09:35:27 PMChipmixer's smallest chipsize is 0.001mbtc, it's stated quite clearly on the deposit page afaik.The minimum is 0.001 BTC not mBTC. Anything less than that will be considered a donationWhich chipmixer clearnet link did you use to access the second onion link? Chipmixer.com has been offline for a while nowPlease beware that there are so make scam or clone chipmixer links out thereThis was the announcementQuote from: ChipMixer on April 25, 2022, 11:38:49 PMStatus.com is disabled and will be disabled for now. .onion is working and not affected.If you have active session and you have used .com - do not wait till it get enabled. Learn how to use Tor Browser and restore session over .onion.Onion address is http://chipmixorflykuxu56uxy7gf5o6ggig7xru7dnihc4fm4cxqsc63e6id.onion/Now almost every link you can find with google is scam.Quote from: donlogan22222222222 on May 16, 2022, 09:19:13 PMWhen I deposited my coins it told me shortly thereafter that You have donated 0.709 mBTC which is 100.0% of your deposit. Thank you!I did not make the decision to donate any coins and none arrived in my wallet.Please read the FAQs. Everything is written there >>>QuoteWhat will happen if I send less than lowest chip?Since we don't have chips lower than 0.001 BTC, your deposit will be treated as donation. Be aware that if you send 0.0015 BTC, you will receive one 0.001 BTC chip. Sending 0.0015 BTC twice will result in two 0.001 BTC chips.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 16, 2022, 10:13:53 PM",
      "body": "How did you find the address of the chipmixer belowCode:http://chipmixs2qgisuu6gu4uqpdy4edtnzdalzlhbins2ua5pexwjdkcacad.onionI tried to search but it seems no one yet shared this URL?So be careful that the link is a fake or scam Chipmixer. Only the first onion link that you posted above is legit.And about your problem, it seems that you didn't understand the instruction before you deposited it?Code:Minimum amount is 0.001 BTC with 0.001 BTC increments.Depositing 1.2345 BTC will result with 1.234 BTC funds.Depositing 0.1249 BTC will result with 0.124 BTC funds.Depositing 0.1240 BTC will result with 0.124 BTC funds.For transactions under 20 BTC we require 1 confirmation. For higher amounts we require 6 confirmations.You will see that text near the deposit address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "May 16, 2022, 10:24:29 PM",
      "body": "Quote from: donlogan22222222222 on May 16, 2022, 09:19:13 PMI am attempting to mix some coins and am really struggling. I have read a lot of positive feedback on Chipmixer so decided to give it a try with a little tester first. Since I assume you're using a throw away account through TOR so maybe you would give a truthful reason without a worry, could I ask you to share the reason you decided to mix these coins through Chipmixer?  Quote from: donlogan22222222222 on May 16, 2022, 09:19:13 PMWhen I deposited my coins it told me shortly thereafter that You have donated 0.709 mBTC which is 100.0% of your deposit. Thank you!I'm sure Chipmixer appreciates your donation.  Was there any fine print warning you that you were about to donate any amount under the threshold or were you expected to read their terms of service?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 16, 2022, 10:43:51 PM",
      "body": "Quote from: OgNasty on May 16, 2022, 10:24:29 PMWas there any fine print warning you that you were about to donate any amount under the threshold or were you expected to read their terms of service?There is information about the minimum amount on the deposit page. I am not sure how OP missed it, especially given that he was using the service for the first. Fees and minimum deposits are usually one of the things one first looks out for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "May 17, 2022, 12:00:43 AM",
      "body": "Quote from: donlogan22222222222 on May 16, 2022, 09:19:13 PMI also found this Onion URL which from what I can tell also appears to be illigitimateIt's a phishing link, so avoid it. The scammer is the same behind chipmixer.cn.com, chipmixer.is and chippmixer.com and a few onion links. I guess he's in love with Chipmixer, with so many clones. The asshole often uses the same email address chipmix@protonmail. comQuote Can someone please direct me to the genuine Chipmixer site?the best place is here https://bitcointalk.org/index.php?topic=1935098.0and you can avoid all the sites listed here https://bitcointalk.org/index.php?topic=5381839.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 17, 2022, 08:11:24 AM",
      "body": "Quote from: jackg on May 16, 2022, 09:35:27 PMI think this means you can deposit 0.291mbtc to the same address to get your 1mbtc chip but I'm not sure if that's still the case.I don't think so. From the FAQ:Quote from: http://chipmixorflykuxu56uxy7gf5o6ggig7xru7dnihc4fm4cxqsc63e6id.onion/faqSince we don't have chips lower than 0.001 BTC, your deposit will be treated as donation. Be aware that if you send 0.0015 BTC, you will receive one 0.001 BTC chip. Sending 0.0015 BTC twice will result in two 0.001 BTC chips.In terms of having the same deposit address across different sessions: This is normal if you restore your session from your session token. If you want a new deposit address, then generate a new session. You can combine deposits from different sessions together using the vouchers which ChipMixer provides.If you were shown the same deposit address on two different sessions, then you are almost certainly using scam sites. The real clearnet ChipMixer link has been offline for a couple of weeks due to attacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "donlogan22222222222",
      "created_time": "May 17, 2022, 02:57:31 PM",
      "body": "I managed to mix my coins and used the \"Sweep to another address\" function. The addresses on my independent wallet I chose to send to are listed alongside a \"pending\" state and a private key. I understand that there can be a delay of up to twenty-four hours but it has been around seventeen thus far and with it being the first time I have used Chipmixer I am starting to worry that something may not have went as it should. There are Private Keys listed but I do not know whether I need them for this particular transaction or not.I appreciate these may be rather rudimentary questions but I haven't used this kind of mixer before and would be very thankful for some guidance or advice on whether this is normal or what I should do next. Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 17, 2022, 03:06:48 PM",
      "body": "First of all, ChipMixer have been operating for years, their forum account has 100% positive feedback (https://bitcointalk.org/index.php?action=trust;u=1003345), and they have never scammed a single satoshi, so try not to worry too much. If you have asked ChipMixer to send your funds to your own address, then you do not need to use the private keys. You just need to continue to wait and the transaction will process in due course.If you want to change your mind and would rather make a transaction yourself right now, then you can take the private keys for your chips and import them in to a wallet of your choice (most people on this forum would recommend Electrum), and then make a transaction from those private keys to your own address and broadcast it immediately. Note that if you do choose to do this, then there is an additional risk since you are copying raw private keys on to your own computer and so there is a potential for some malware to steal them. You should ensure your computer is clean and free from malware, and make sure you verify the Electrum download before using it: [GUIDE] How to Safely Download and Verify Electrum [Guide]There is also the possibility that ChipMixer have already broadcast the transaction, but it is currently unconfirmed and waiting in the mempool to be mined. You will be able to tell this if you look up the address you are trying to receive coins to in a block explorer such as https://mempool.space and see any incoming unconfirmed transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 17, 2022, 05:16:11 PM",
      "body": "Quote from: donlogan22222222222 on May 17, 2022, 02:57:31 PMI managed to mix my coins and used the \"Sweep to another address\" function. The addresses on my independent wallet I chose to send to are listed alongside a \"pending\" state and a private key.Have you used Electrum wallet for this?Sweeping private keys from Electrum wallet is transaction you are making and it's not related with Chipmixer.I don't know exact time you did sweep, but it's possible that mempool was full so you need to wait until this clears, like for any other bitcoin transactions.Pending means that transaction is unconfirmed and you can check that transaction in blockchain explorer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 17, 2022, 05:49:40 PM",
      "body": "Quote from: dkbit98 on May 17, 2022, 05:16:11 PM-snip-No, he's talking about the sweep function built in to the ChipMixer site. If you don't want to export the private keys yourself, then you can ask ChipMixer to sweep the coins from all your chips to an address you provide. Your transaction will be added to the sweep queue, will display as \"pending\" on the ChipMixer site, and usually processed within 24 hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}