{
  "id": "topic_5522495",
  "title": "nullama",
  "author": "nullama",
  "created_time": "December 12, 2024, 08:31:51 AM",
  "content": "On December 11th, 2024, Mayor Ken Sim introduced a motion to the council of the City of Vancouver titled \"Preserving of the City's Purchasing Power Through Diversification of Financial Reserves – Becoming A Bitcoin Friendly City\", available here: https://council.vancouver.ca/20241211/documents/cfscA3.pdfIn that motion, the Mayor requested a report to be made by the end of the first quarter of 2025 to investigate the potential risks and benefits of including Bitcoin as part of the savings of the City of Vancouver to fix the problems of inflation.He goes on to list El Salvador, Lugano, and others, as successful examples of Bitcoin adoption, and he quoted Satoshi Nakamoto's white paper in the motion.And it ends with this:I think many cities and countries around the world are waking up to this reality. Fiat is losing traction, and Bitcoin is getting everywhere.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5522495",
  "comments": [
    {
      "author": "betswift",
      "created_time": "December 12, 2024, 08:36:27 AM",
      "body": "Wouldn't say that the fiat is losing it due to it being the first thing people use and think about first and foremost - but what you described is truly a welcomed development.In the years to come, cities and countries alike will see through the fud about BTC and get it themselves. And that's great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 12, 2024, 08:40:05 AM",
      "body": "Accepting taxes and fees in BTC - sounds like something even a bit bigger than the reserves.Great news ahead for Vancouver, in my opinion. And for the overall adoption of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "December 12, 2024, 08:58:07 AM",
      "body": "Looks like they're being serious about this matter. Unlike proposal by other government, this one mention possibility to accept Bitcoin as payment method. Although using El Salvador of example of successful Bitcoin adaption feels weird when El Salvador president claim it's below his hope[1].[1] https://cryptonews.com/news/bitcoin-hasnt-had-the-widespread-adoption-we-hoped-for-el-salvador-president/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "December 12, 2024, 09:28:56 AM",
      "body": "Quote from: fikrett on December 12, 2024, 08:40:05 AMAccepting taxes and fees in BTC - sounds like something even a bit bigger than the reserves.Great news ahead for Vancouver, in my opinion. And for the overall adoption of BTC. It could very well be the way that they accumulate those Bitcoin reserves, by letting people pay taxes and fees in Bitcoin.That way they would not have to pay any fees as the sender is the one paying the miner fees.We will see how they plan to do this when they release their report in the first quarter of 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "December 12, 2024, 09:37:10 AM",
      "body": "Quote from: ABCbits on December 12, 2024, 08:58:07 AMLooks like they're being serious about this matter. Unlike proposal by other government, this one mention possibility to accept Bitcoin as payment method. Although using El Salvador of example of successful Bitcoin adaption feels weird when El Salvador president claim it's below his hope[1].[1] https://cryptonews.com/news/bitcoin-hasnt-had-the-widespread-adoption-we-hoped-for-el-salvador-president/Wonderful news.This year's end and the next one in line is going to spark BTC and discussions about it like no other, in my opinion.And that's truly great to see BTC being adopted on so many different scales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 12, 2024, 09:48:25 AM",
      "body": "I think bitcoin's value in the upcoming months while they consider this motion will be the deciding factor for moving forward and accepting payments in bitcoin in one way or the other. We know that a much more crypto-friendly administration is taking office in USA and everyone expects bitcoin's price to increase further, which it probably will. But if it starts falling after the inauguration due to unfavorable events, such as bitcoin not being accepted as a strategic reserve in the US, I am pessimistic that the report in Vancouver will be positive. For the sake of Bitcoin and all of us, let's hope that doesn't happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "December 12, 2024, 10:03:54 AM",
      "body": "Quote from: Pmalek on December 12, 2024, 09:48:25 AMI think bitcoin's value in the upcoming months while they consider this motion will be the deciding factor for moving forward and accepting payments in bitcoin in one way or the other. We know that a much more crypto-friendly administration is taking office in USA and everyone expects bitcoin's price to increase further, which it probably will. But if it starts falling after the inauguration due to unfavorable events, such as bitcoin not being accepted as a strategic reserve in the US, I am pessimistic that the report in Vancouver will be positive. For the sake of Bitcoin and all of us, let's hope that doesn't happen.Right, Trump winning the election has it's domino effect now, even before he officially sit. WE have seen a lot of countries, or just a city really going full on Bitcoin or crypto. Whether having it in their balance sheet or just like Vancouver, trying to be a Bitcoin friendly city.And this could trickle as well to other well known cities around the world, specially those who have been frequented by tourists. And with that, Bitcoin could be the currency of those who travelled around the globe, very easy to transaction and it's obviously borderless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "December 12, 2024, 10:07:59 AM",
      "body": "Quote from: ABCbits on December 12, 2024, 08:58:07 AMLooks like they're being serious about this matter. Unlike proposal by other government, this one mention possibility to accept Bitcoin as payment method. Although using El Salvador of example of successful Bitcoin adaption feels weird when El Salvador president claim it's below his hope[1].The mayor is an investor in Coinbase Global INC, which is why he is aware of Bitcoin. Leaders who are aware of Bitcoin will always know the benefits of holding it and will always try to convince others. What we are witnessing is just the beginning I am wondering how many cities of states in the US will become Bitcoin-friendly after Donald Trump is in office.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "December 12, 2024, 12:00:22 PM",
      "body": "Quote from: ABCbits on December 12, 2024, 08:58:07 AMAlthough using El Salvador of example of successful Bitcoin adaption feels weird when El Salvador president claim it's below his hope.I think it's a matter of perspective or data selection. They probably look at the numbers of users instead of the penetration/adoption rate, and judge that 10k users are good enough to support their plan. As long as the data they look at is verifiable I think there's no problem with them saying El Salvador is a success. Regardless of their reasoning, hopefully, this will be a success so more governments will be open to accepting crypto as a payment method on a limited scale. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "December 12, 2024, 12:14:33 PM",
      "body": "Quote from: pakhitheboss on December 12, 2024, 10:07:59 AMQuote from: ABCbits on December 12, 2024, 08:58:07 AMLooks like they're being serious about this matter. Unlike proposal by other government, this one mention possibility to accept Bitcoin as payment method. Although using El Salvador of example of successful Bitcoin adaption feels weird when El Salvador president claim it's below his hope[1].The mayor is an investor in Coinbase Global INC, which is why he is aware of Bitcoin. Leaders who are aware of Bitcoin will always know the benefits of holding it and will always try to convince others. What we are witnessing is just the beginning I am wondering how many cities of states in the US will become Bitcoin-friendly after Donald Trump is in office.I think the proportion would be up to 40% to 60%, 40% being pro-crypto.That's of course, my estimate - but I think most of the states won't be so pushy to adapt and make something out of BTC.Fortunately, we've got enough time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 12, 2024, 12:18:55 PM",
      "body": "Quote from: Jating on December 12, 2024, 10:03:54 AMQuote from: Pmalek on December 12, 2024, 09:48:25 AMI think bitcoin's value in the upcoming months while they consider this motion will be the deciding factor for moving forward and accepting payments in bitcoin in one way or the other. We know that a much more crypto-friendly administration is taking office in USA and everyone expects bitcoin's price to increase further, which it probably will. But if it starts falling after the inauguration due to unfavorable events, such as bitcoin not being accepted as a strategic reserve in the US, I am pessimistic that the report in Vancouver will be positive. For the sake of Bitcoin and all of us, let's hope that doesn't happen.Right, Trump winning the election has it's domino effect now, even before he officially sit. WE have seen a lot of countries, or just a city really going full on Bitcoin or crypto. Whether having it in their balance sheet or just like Vancouver, trying to be a Bitcoin friendly city.And this could trickle as well to other well known cities around the world, specially those who have been frequented by tourists. And with that, Bitcoin could be the currency of those who travelled around the globe, very easy to transaction and it's obviously borderless.Many people around the world are really into doing something good with BTC - and that can only put a smile on our faces.I hope for this trend to continue as we push forward into Trump's term for real - let him not screw things up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "December 12, 2024, 12:44:33 PM",
      "body": "Quote from: pakhitheboss on December 12, 2024, 10:07:59 AMQuote from: ABCbits on December 12, 2024, 08:58:07 AMLooks like they're being serious about this matter. Unlike proposal by other government, this one mention possibility to accept Bitcoin as payment method. Although using El Salvador of example of successful Bitcoin adaption feels weird when El Salvador president claim it's below his hope[1].The mayor is an investor in Coinbase Global INC, which is why he is aware of Bitcoin. Leaders who are aware of Bitcoin will always know the benefits of holding it and will always try to convince others. What we are witnessing is just the beginning I am wondering how many cities of states in the US will become Bitcoin-friendly after Donald Trump is in office.Not surprised that the mayor of Vancouver, is an investor in cryptocurrency so he definitely knows the potentials of Bitcoin and I hope that they adopt it as their city's reserve. This year has been huge for Bitcoin, the friendly approach towards it by Donald Trump, during the US election and his win of the presidential election has been obviously bullish for Bitcoin, so I'm looking at greater things for Bitcoin in 2025. I believe that not only Vancouver city, but many other cities and counties at large will adopt Bitcoin in their reserves. Bitcoin awareness and adoption is spreading rapidly, in the near future I see a lot of adoption by individuals, institutions, cities and counties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 12, 2024, 12:47:14 PM",
      "body": "It's all sunshine and rainbows but I worry that the euphoria will end as soon as something bad linked to crypto currencies happens, like some exchanges failing. Then the sentiment might flip on its head and become one of fear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "December 12, 2024, 12:57:26 PM",
      "body": "Quote from: Kelward on December 12, 2024, 12:44:33 PMNot surprised that the mayor of Vancouver, is an investor in cryptocurrency so he definitely knows the potentials of Bitcoin and I hope that they adopt it as their city's reserve. This year has been huge for Bitcoin, the friendly approach towards it by Donald Trump, during the US election and his win of the presidential election has been obviously bullish for Bitcoin, so I'm looking at greater things for Bitcoin in 2025. I believe that not only Vancouver city, but many other cities and counties at large will adopt Bitcoin in their reserves. Bitcoin awareness and adoption is spreading rapidly, in the near future I see a lot of adoption by individuals, institutions, cities and counties.He has asked the employees to start investing in Bitcoin and he is the Mayor, who is trying to promote Bitcoin in Canada. I would say he is using his power to influence the citizens to adopt and invest in Bitcoin in his city with this new law. Bitcoin is the reserve currency for anyone thinking about alternate investing options. Next year we will see many counties or states/cities that will be supporting/promoting Bitcoin globally. It is just the beginning wherein we will see a massive adoption of Bitcoin and some countries declaring it as an alternative currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "December 12, 2024, 01:08:33 PM",
      "body": "Quote from: NotATether on December 12, 2024, 12:47:14 PMIt's all sunshine and rainbows but I worry that the euphoria will end as soon as something bad linked to crypto currencies happens, like some exchanges failing. Then the sentiment might flip on its head and become one of fear.It would depend on where they custody their coins.Any countries should custody their coins by themselves instead of relying to centralized exchanges, just like El Salvador who hold in their cold wallet. Hence when FTX was bankrupt, it didn't stop Nayib Bukele to accumulating Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoWODL",
      "created_time": "December 12, 2024, 02:14:18 PMLast edit: December 12, 2024, 02:45:14 PM by cryptoWODL",
      "body": "The preparations made to make the city of Vancouver a bitcoin friendly city, Or the proposal to make the city a Bitcoin friendly city has already been passed. The proposal was originally proposed by Vancouver Mayor Ken Sim on December 11. After they accepted the proposal, 6 of the 11 councilors accepted their proposal and two councilors did not accept the proposal to make Vancouver a Bitcoin-friendly city. Out of 11 councillors, remaining three councilors were absent. Vancouver passes motion to become a ‘Bitcoin-friendly city’Quote from: Kelward on December 12, 2024, 12:44:33 PMBitcoin awareness and adoption is spreading rapidly, in the near future I see a lot of adoption by individuals, institutions, cities and counties. Bitcoin adoption is already spreading rapidly. As an example, the Canadian city of Vancouver is currently preparation up to become a Bitcoin-friendly city. A few days ago the Kenyan Fire Brigade added Bitcoin to it's balance sheet. Marathon (MARA) Company They also started buying Bitcoin this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 12, 2024, 04:20:22 PM",
      "body": "Quote from: nullama on December 12, 2024, 08:31:51 AMHe goes on to list El Salvador, Lugano, and others,... How is the current economic situation in El Salvador and those countries you just mentioned? We have been waiting to seen El Salvador first bitcoin city but not yet out. So any other bitcoin City that is coming is not something new we have been expecting one since. And all what we need is for all the countries to adopt bitcoin and let businesses accept bitcoin so that all those nonsense fiat banks doing will stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "December 13, 2024, 07:38:58 AM",
      "body": "Quote from: NotATether on December 12, 2024, 12:47:14 PMIt's all sunshine and rainbows but I worry that the euphoria will end as soon as something bad linked to crypto currencies happens, like some exchanges failing. Then the sentiment might flip on its head and become one of fear.I am not too sure about that.Bitcoin has a long history now, and most people already have seen all those articles and realized that they were just not true.Bitcoin is simply a better money. And cities around the world are starting to realize this.The massive inflation we are seeing these days is basically painting a great picture for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "December 13, 2024, 07:46:49 AM",
      "body": "Quote from: nullama on December 12, 2024, 08:31:51 AMI think many cities and countries around the world are waking up to this reality. Fiat is losing traction, and Bitcoin is getting everywhere.it is only the mayor that was pushing the city to be involved with bitcoin and not the prime minister so i would give my respects to the mayor for standing up with what he thinks would be the best for his city if not the entire country then he would do anything to push his country forward they just need to hope that the rest of country follows suit and make the entire country crypto friendly",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}