{
  "id": "topic_5418340",
  "title": "LionsSlots7777",
  "author": "LionsSlots7777",
  "created_time": "October 25, 2022, 10:18:36 PM",
  "content": "🔥LionSlots777🦁Fair BNB Casino. Play and Win!  ✔️Licensed Software.✔️Fair system.✔️Fast deposit/withdrawals via MetaMask.✔️Accept BNBTest your luck!👉🏼 Play our games and win big time! https://lionslots777.io/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418340",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 25, 2022, 10:32:49 PM",
      "body": "Just visited the website, but I haven't signed up yet. I read the terms of service, but there is no talk about KYC or AML policy. Does this mean that KYC verification won't ever be requested from any player using your casino?Please consider purchasing copper membership so that you can make a much better Announcement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AB de Royse777",
      "created_time": "October 26, 2022, 02:40:40 PMLast edit: October 26, 2022, 03:13:50 PM by Royse777",
      "body": "Quote from: LionsSlots7777 on October 25, 2022, 10:18:36 PMhttps://lionslots777.ioIf you are an official for the casino then I will suggest the same as above user, Buy a copper membership which will allow you to post image. Then post a nice ANN instead of this simple text based contents.I am guessing, you have not study your competitors on the forum yet. Everyone wants visually attractive contents. If you have your own designer then ask them to design you an ann however if you don't then feel free to contact me, I can help you in ANN design and bitcointalk marketing.PS: It's not only me but there are many professionals we have in bitcointalk who can help you in any service you need. Check this out: [Overview] Bitcointalk Services from Bitcointalk Members",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LionsSlots7777",
      "created_time": "October 26, 2022, 09:41:16 PM",
      "body": "Quote from: Bitcoin_Arena on October 25, 2022, 10:32:49 PMJust visited the website, but I haven't signed up yet. I read the terms of service, but there is no talk about KYC or AML policy. Does this mean that KYC verification won't ever be requested from any player using your casino?Please consider purchasing copper membership so that you can make a much better Announcement.We can request KYC information. Please check the Terms of use and AML pages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 27, 2022, 11:26:27 PM",
      "body": "Quote from: LionsSlots7777 on October 26, 2022, 09:41:16 PMWe can request KYC information. Please check the Terms of use and AML pages.Perhaps you just recently made a modification because on that day I read through the terms and didn't see any mention of KYC or any link to the AML policy. But it's all fine, no big deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}