{
  "id": "topic_5402568",
  "title": "Get-Paid.com",
  "author": "Get-Paid.com",
  "created_time": "June 14, 2022, 12:19:52 PMLast edit: June 16, 2022, 07:13:41 AM by Get-Paid.com",
  "content": "Edit: The betting slip is HEREThe US Open starts in 2 days.Let's say you use a BetFair account in order to lay Golf players that have virtually almost 0 chance to win. (odds of 300 to 1 or more).If you can't use BetFair you can use OrbitX for example:https://www.orbitxch.com/customer/sport/3(See also a guide here - How to use BetFair from anywhere)Now,You deposit a quite large amount of €5400 and you start laying the players with the high odds, literally:Kurt Kityama - 900 to 1 - €6.00Patrick Rodgers - 870 to 1 - €6.20Thorbjorn Olesen - 810 to 1 - €6.66Scott Stallings - 650 to 1 - €8.30Wyndham Clark - 620 to 1 - €8.70Harris English - 650 to 1 - €8.30Joel Dahmen - 700 to 1 - €7.70Matthew NeSmith - 640 to 1 - €8.50Beau Hossler - 630 to 1 - €8.60Taylor Montgomery - 580 to 1 - €9.30Kevin Kisner - 510 to 1 - €10.60Erik Van Rooyen - 530 to 1 - €10.20Branden Grace - 530 to 1 - €10.20Lanto Griffin - 490 to 1 - €11.00Cameron Tringale - 490 to 1 - €11.00Denny Mccarthy - 540 to 1 - €10.00Adri Arnaus - 500 to 1 - €10.80Sam Horsfield - 470 to 1 - €11.50Adam Hadwin - 480 to 1 - €11.25Mackenzie Hughes - 470 to 1 - €11.50Victor Perez - 490 to 1 - €11.00Stewart Cink - 500 to 1 - €11.00Kevin Na - 420 to 1 - €12.80Lucas Herbert - 430 to 1 - €12.55Phil Mickelson - 490 to 1 - €11.00Francesco Molinari - 430 to 1 - €12.55Thomas Pieters - 390 to 1 - €13.80Alex Noren - 360 to 1 - €15.00Sepp Straka - 380 to 1 - €14.20Tom Hoge - 340 to 1 - €15.80Luke List - 310 to 1 - €17.40K.H. Lee - 370 to 1 - €14.60Brian Harman - 300 to 1 - €18.00Sergio Garcia - 300 to 1 - €18.00Marc Leishman - 320 to 1 - €16.85Ryan Fox - 300 to 1 - €18.00Gary Woodland - 270 to 1 - €20So by doing this you risk €5400 in order to win €439So you make a profit of 8% approx. on your investment, but it's almost risk free.What do you think about it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402568",
  "comments": [
    {
      "author": "swogerino",
      "created_time": "June 14, 2022, 12:34:15 PM",
      "body": "Quote from: Get-Paid.com on June 14, 2022, 12:19:52 PMThe US Open starts in 2 days.Let's say you use a BetFair account in order to lay Golf players that have virtually almost 0 chance to win. (odds of 300 to 1 or more).If you can't use BetFair you can use OrbitX for example:https://www.orbitxch.com/customer/sport/3(See also a guide here - How to use BetFair from anywhere)Now,You deposit a quite large amount of €5400 and you start laying the players with the high odds, literally:Kurt Kityama - 900 to 1 - €6.00Patrick Rodgers - 870 to 1 - €6.20Thorbjorn Olesen - 810 to 1 - €6.66Scott Stallings - 650 to 1 - €8.30Wyndham Clark - 620 to 1 - €8.70Harris English - 650 to 1 - €8.30Joel Dahmen - 700 to 1 - €7.70Matthew NeSmith - 640 to 1 - €8.50Beau Hossler - 630 to 1 - €8.60Taylor Montgomery - 580 to 1 - €9.30Kevin Kisner - 510 to 1 - €10.60Erik Van Rooyen - 530 to 1 - €10.20Branden Grace - 530 to 1 - €10.20Lanto Griffin - 490 to 1 - €11.00Cameron Tringale - 490 to 1 - €11.00Denny Mccarthy - 540 to 1 - €10.00Adri Arnaus - 500 to 1 - €10.80Sam Horsfield - 470 to 1 - €11.50Adam Hadwin - 480 to 1 - €11.25Mackenzie Hughes - 470 to 1 - €11.50Victor Perez - 490 to 1 - €11.00Stewart Cink - 500 to 1 - €11.00Kevin Na - 420 to 1 - €12.80Lucas Herbert - 430 to 1 - €12.55Phil Mickelson - 490 to 1 - €11.00Francesco Molinari - 430 to 1 - €12.55Thomas Pieters - 390 to 1 - €13.80Alex Noren - 360 to 1 - €15.00Sepp Straka - 380 to 1 - €14.20Tom Hoge - 340 to 1 - €15.80Luke List - 310 to 1 - €17.40K.H. Lee - 370 to 1 - €14.60Brian Harman - 300 to 1 - €18.00Sergio Garcia - 300 to 1 - €18.00Marc Leishman - 320 to 1 - €16.85Ryan Fox - 300 to 1 - €18.00Gary Woodland - 270 to 1 - €20So by doing this you risk €5400 in order to win €439So you make a profit of 8% approx. on your investment, but it's almost risk free.What do you think about it? That \"almost risk free\" is what I don't like.If you have chosen all the players and this is an arbitrage bet then it is a sure win and it is a great strategy but if you have not chosen all the players this means no matter you have chosen the majority of the players you still have someone out and if this someone wins the tournament you lose 5400 EUR which is not a small amount and this is not a great strategy.Not worth trying if this second option is the case,if it is the first you have chosen every player taking part on this tournament and it is a sure arbitrage bet then go ahead since you will get a minimum of 439 EUR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 14, 2022, 12:44:55 PM",
      "body": "Quote from: swogerino on June 14, 2022, 12:34:15 PMThat \"almost risk free\" is what I don't like.If you have chosen all the players and this is an arbitrage bet then it is a sure win and it is a great strategy but if you have not chosen all the players this means no matter you have chosen the majority of the players you still have someone out and if this someone wins the tournament you lose 5400 EUR which is not a small amount and this is not a great strategy.Not worth trying if this second option is the case,if it is the first you have chosen every player taking part on this tournament and it is a sure arbitrage bet then go ahead since you will get a minimum of 439 EUR.No, these are not all the players who play in the tournament, but these are all the players with odds of 300 to 1 or more.In Bet365 the one with the lowest odds is GaryWoodland with fixed odds of 141.You are basically betting none of these super-high-odds players is going to win the tournament.The winner is quite likely going to come out of the ones with odds of 50 to 1 or less, pre-match.Of course, there can always be a surprise, but the chances of that happening are quite slim. Those players get super high odds for a reason - their chances of winning are extremely low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "June 14, 2022, 07:36:02 PM",
      "body": "Quote from: swogerino on June 14, 2022, 12:34:15 PM.../Q/...:::That \"almost risk free\" is what I don't like.If you have chosen all the players and this is an arbitrage bet then it is a sure win and it is a great strategy but if you have not chosen all the players this means no matter you have chosen the majority of the players you still have someone out and if this someone wins the tournament you lose 5400 EUR which is not a small amount and this is not a great strategy.Not worth trying if this second option is the case,if it is the first you have chosen every player taking part on this tournament and it is a sure arbitrage bet then go ahead since you will get a minimum of 439 EUR.It is a freebet, an additional benefit to the deposit, though  knowing other conditions if they exist is important, anyway, the deposit range is not among my deposit estimates, but if it is were and there were no additional conditions is not bad at all.Quote from: Get-Paid.com on June 14, 2022, 12:44:55 PM.../Q/...::...//..,,,Of course, there can always be a surprise, but the chances of that happening are quite slim. Those players get super high odds for a reason - their chances of winning are extremely low.That's the best part, believe me I like golf but betting for a golf major is hard, in fact the variance is high in regular PGA tournaments, I don't want to mention you in the big 4 tournaments (Majors).That same variance benefits you in the randomness of the candidates, that is to say, golf undoubtedly has its favorites, but in golf as in no other sport, the odds can only be a guide rather than a betting reality. You have to follow the game of these guys or their streak situations, even personal.From that point of view,  any of them are candidates despite their bad odds and looking with tweezers at that list, for example, Phil Mickelson last year had very bad odds and won the PGA Championship against all odds, in fact He is the oldest player to win a tournament in that category.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "June 14, 2022, 08:31:07 PM",
      "body": "Quote from: Get-Paid.com on June 14, 2022, 12:19:52 PMThe US Open starts in 2 days.Let's say you use a BetFair account in order to lay Golf players that have virtually almost 0 chance to win. (odds of 300 to 1 or more).If you can't use BetFair you can use OrbitX for example:https://www.orbitxch.com/customer/sport/3(See also a guide here - How to use BetFair from anywhere)Now,You deposit a quite large amount of €5400 and you start laying the players with the high odds, literally:So by doing this you risk €5400 in order to win €439So you make a profit of 8% approx. on your investment, but it's almost risk free.What do you think about it? It's an interesting idea but golf tends to be a highly competitive game and requires a lot of consistency to get into these late game competitions. If your bet is for the player to win and these are the far outliers then they have almost no chance which is why the odds are so high. Running with this idea, you could maybe translate it across into horse racing, particularly in combination with offers that run around big events to get better returns. You'd have to do a lot of hunting around, but you tend to see a few more upsets happening in this type of betting - it's incredibly easy for horses to have a bad day, or for a horse to fall and take down a pack of favorites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "June 15, 2022, 12:03:09 AM",
      "body": "The only issue is that every single bet still needs to be matched and I don't have much experience when it comes to betting exchanges as I tend to use bookies on nearly all of my bets but if that's easy to deal with then I guess it's worth going for. With those long-shot odds, I feel like one of them could end up as a winner. Also, I checked the orbit exchange that you linked and it seems like there's a minimum bet of 7 in all markets so some of the golf players on the list might have to be removed or adjust their stakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 15, 2022, 05:58:02 AM",
      "body": "Quote from: ralle14 on June 15, 2022, 12:03:09 AMI feel like one of them could end up as a winner. Also, I checked the orbit exchange that you linked and it seems like there's a minimum bet of 7 in all markets....1) If you really feel one of them can end up as a winner you can do the opposite - deposit €400 - €500 and back the ones you like - you would win 10-20 times your stake, depends how big is your risk.2) The min. stake is €6 so if you lay €5400 against 900 to 1 then you risk €5400 to win €6 (on a player that is virtually next to none in terms of winning) There is enough liquidity in the market for all of them, if I were to guess I'd say the ones with odds of 50 to 1 or less - one of them will win this.Golf is about a lot of things other than randomality, it's how the player hits the ball in crazy weather, how much practice he makes, and so on ... those who can afford more (who have deep pockets) have better chances here, that's how it normally works (to a certain extent of course).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 15, 2022, 08:40:09 AM",
      "body": "The same strategy could be adopted in any kind of event with many players (likewise an horse race - Cheltenham's Gold Cup)...But it can't work! Because you can spend MUCH MUCH more to cover all players/runners ... and if you get a win you can just recover your bet/money risked. Or otherwise you're hoping for certain underdog to make a big win! It's an huge risk. I will not take it If you don't play ALL players/runners you have a point of failure. Maybe it can work a couple of times, maybe you can have a lucky bet, but this is an huge risk to get a defeat / big loss and of course this is not a sure bet or an arbitrage that can really work. If this is was really a working strategy, many gamblers with big pockets were already betting huge amount of money  with this strategy....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "June 15, 2022, 10:56:07 AM",
      "body": "Quote from: Get-Paid.com on June 14, 2022, 12:19:52 PMSo by doing this you risk €5400 in order to win €439So you make a profit of 8% approx. on your investment, but it's almost risk free.What do you think about it? In every means of getting freedom, there's always a price to pay but this is what I called gambling without knowing the rules because the funds used to bet to prevent the risk will create more chance of winning, and the last time I check the risk aspect of gambling is what creates the fun and the buzz.It is clear that any gamblers who used the formation you said probably don't know what she's doing because it is better to face the truth than hiding from it.Gambling and risk are pals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 15, 2022, 04:40:26 PM",
      "body": "Quote from: suzanne5223 on June 15, 2022, 10:56:07 AMGambling and risk are pals.There is no free money in gambling but judging by history - these kind of bets are value bets, not the opposite.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "June 15, 2022, 04:51:45 PM",
      "body": "With that much investment won't you be making more money in day trading in some cryptocurrencies? At the same time you won't have a perfect system since this would essentially be a mathematical evaluation which is very different from the real world examples and risks, therefore at the end of the day you would have to make sure it's not risky and even if one players accidently looses would have the whole percentage go up and down. I do not think this is valuable at all, this is much like martingale which might sound good in theory but in practical might not be a good option. Do let me know if you try it, I am really interested to see what happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 16, 2022, 04:35:28 AM",
      "body": "Quote from: fiulpro on June 15, 2022, 04:51:45 PMDo let me know if you try it, I am really interested to see what happens. Of course.Now in live betting, if one of those who are 100 to 1 (ish) hit 500 to 1 in live - you can lay them as well for extra €10 each.Expected profit here is €600 approx.Risk: €5,350",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 16, 2022, 04:54:40 AM",
      "body": "I don't know much about sports betting but I am interested in the fact that skilled players can win in the long run. I will follow the thread to see how it works out for you. Quote from: fiulpro on June 15, 2022, 04:51:45 PMI do not think this is valuable at all, this is much like martingale which might sound good in theory but in practical might not be a good option. I think it has nothing to do with martingale.Quote from: Get-Paid.com on June 16, 2022, 04:35:28 AMExpected profit here is €600 approx.Risk: €5,350I haven't stopped to crunch the numbers. Do you mean that based on the bets and odds you will bet €5,350 and the expected profit value is €5,950?What happens is that with such low odds you will have to place quite a few bets of that kind to win any bet. And then you have to take into account the variance. I hope you have a good bankroll to withstand several rounds of this type without winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 16, 2022, 06:47:18 AM",
      "body": "Quote from: Poker Player on June 16, 2022, 04:54:40 AMDo you mean that based on the bets and odds you will bet €5,350 and the expected profit value is €5,950?Yes, exactly.However, during the tournament, players such as Seamus Power (90 to 1) might hit 500 to 1 in the exchange (due to poor performance and very slim chances of winning) - so if it feels right you can lay them as well €5400 against 500 to 1 is about €11 profit. This is just an estimate.Jason Kokrak is definitely a threat but his past performance in the US open hasn't been great. Still, laying him might lead to some swings, he could definitely hit the 50 to 1 odds during the tournament, it's even likely.Anyway,This kind of betting activity is basically predicting that the winner would come from a group containing more than the top 40 players in the world.If you want to be greedy and bet the winner would come from the top 20 players in the world then your potential profit would be higher, but it's good to remember it's always better to be safe than sorry.The oddsmakers have been quite spot-on in the past years with their odds on favorites, it's amazing how Jordan Spieth is 26 to 1, seems like quite a lot of value, he plays in his home turf, literally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 16, 2022, 11:43:11 AM",
      "body": "The tournament has started.Those of you who like to do some arbitrage - some players who were 1000 to 1 are now trading as 600 to 1.There is no doubt why this kind of tournament brings a lot, a lot of trading opportunities - the angle presented here is only one single way of looking at trading this event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 16, 2022, 05:10:19 PMLast edit: June 16, 2022, 05:46:20 PM by Get-Paid.com",
      "body": "Potential profit is now €650 and should be a bit up by tomorrow.Now here's a tip for you:Brian Harman was at fixed odds of 175 to 1 and 250 to 1 in the exchange.Now trading at 80 to 1 in the exchange.If you can lay - now it's the time. Get €70 profit for laying this one.MarathonBet btw is offering 151 on Harman if you believe he could scoop it, more than twice the price of the exchange:https://www.marathonbet.com/en/betting/Golf+-+10",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "June 16, 2022, 09:22:32 PM",
      "body": "Quote from: Get-Paid.com on June 15, 2022, 04:40:26 PMQuote from: suzanne5223 on June 15, 2022, 10:56:07 AMGambling and risk are pals.There is no free money in gambling but judging by history - these kind of bets are value bets, not the opposite.Yes, there's no free money in gambling, and thats the reason the risk involved is the price to pay. Judging by history, the strategy betting you illustrate may prove product but not in the way where gamblers have to risk €5400 in order to win €439 which not to be a profitable concept and I believe it better take my chances with the game risk because it may be my lucky day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "June 16, 2022, 11:05:42 PM",
      "body": "This is a statistics debate revolving around the frequency of how often big underdogs won the US open in golf.Betting underdogs might be a viable strategy in MMA where some events result in greater than 50% of underdog bets cashing.What you're looking for with this approach is a sport and niche area where underdogs historically have very high statistics for pulling upsets. Identifying specific conditions and scenarios for underdogs winning also helps.Matchmakers in MMA and the UFC often try to setup matches where the public doesn't see underdog upsets coming. The judging criteria is also in question recently. That could be a good place to look.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 17, 2022, 03:40:41 AM",
      "body": "Quote from: suzanne5223 on June 16, 2022, 09:22:32 PMnot in the way where gamblers have to risk €5400 in order to win €439 which not to be a profitable conceptAt the moment the potential profit is going to be €712, and this was just 1 way of looking at it.Adam Hadwin who was trading around 500 to 1 is now trading at 30 to 1, so if you waited with your bankroll before starting it you can lay him now for close to €200.Joel Dahmen who was trading 900 to 1 before the event is now 90 to 1 = €60.You can also go against Jordan Spieth now (2+ after the 1st round) who is 120 to 1 so it would bring in another close to €50 of profits - but for me a rule of thumb is to not go against those who opened with low odds before the event.See this:https://sports.yahoo.com/us-open-betting-adam-hadwin-was-100-1-to-be-the-first-round-leader-014506212.htmlYahoo had an article about how Hadwin was 100 to 1 to be the 1st round leader - so big odds can win - but this is about the winner by Sunday which requires from the underdogs to remain consistants for 4 days - that's the hard part in Golf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "June 17, 2022, 03:57:11 AM",
      "body": "Quote from: Hydrogen on June 16, 2022, 11:05:42 PMMatchmakers in MMA and the UFC often try to setup matches where the public doesn't see underdog upsets coming.It could be interesting what you said, as if there is more to it than just the game alone.The current leader, Adam Hadwin, has a tee time around 8am in the morning (more cloudy & windy), whilst the favorite Rory McIlroy is going to do so around 1pm, so 1pm (sunny) is definitely more comfortable than 8am and Hadwin also was among the ones golfing in the evening yesterday i.e. they make it tight for him and more under pressure.The 2nd favorite, Jon Rahm, is also scheduled for 1pm, whilst Justin Thomas gets 7am.You can try to make some assumptions from these - in the end of the day these players are the ones who need to bring in their A game in order to win.Also check this out:The bookmakers believe Gary Woodland (81 to 1 now) has a good chance to perform better than Hadwin in the 2nd round - yet they leave Hadwin as 6 to 1 (!!!) chances to keep on being the leader after the 2nd round.btw MarathonBet for instance doesn't even have Hadwin listed as a potential winner - you can have \"Others on request\".Does it tell you who makes money from all this in the end of the day?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}