{
  "id": "topic_5409528",
  "title": "Wiwo",
  "author": "Wiwo",
  "created_time": "August 11, 2022, 06:37:21 PM",
  "content": "As the gap for Bitcoin adoption in the African Largest country Nigeria 🇳🇬 and also referred to as, Giant of Africa Nigeria get widening. Nigeria is among highest country in cryptocurrency trading volume, Next to countries like the United States 🇺🇸. Even though the government have not made a public announcement of cryptocurrency adoption.A large number of Nigeria 🇳🇬 citizens are now aware of the fact that Bitcoin proffered best solution as an alternative currency. PHCN the body responsible for energy control and collection of power revenue Bills and Pre-paid customers, have adopted Bitcoin and other cryptocurrencies for payment of energy consumption in Nigeria.More reading and source: https://thecryptobasic.com/2022/08/10/nigerians-can-now-pay-their-utility-bills-with-bitcoin/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409528",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "August 11, 2022, 06:45:27 PM",
      "body": "But I thought Nigerian government was explicity against the use of Bitcoin within the country?I recall watching on Youtube some Nigerian politicians claiming that Bitcoin adoption had hurt the trust in their national currency.And there were some imposed frictions by the banks so people could not transact with Bitcoin and other Cryptocurrency so easily?Of course, I am aware that Bitcoin cannot be declared illegal and expect people to abandon it so easily, but I assumed anti-Bitcoin measures were enforced there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 11, 2022, 06:55:35 PM",
      "body": "Quote from: Hispo on August 11, 2022, 06:45:27 PMthere were some imposed frictions by the banks so people could not transact with Bitcoin and other Cryptocurrency so easily?Of course, I am aware that Bitcoin cannot be declared illegal and expect people to abandon it so easily, but I assumed anti-Bitcoin measures were enforced there. That sanctioning was on the banks.prior to the sanctioning from the Central bank against banks direct involvement to Bitcoin transaction, some commercial banks in Nigeria we're involved in Bitcoin direct transactions services such banks like Access banks and Union Bank of Nigeria. But aside from that Nigerians are still involved in Bitcoin/cryptocurrency activities such as p2p trading without and harassment or fear, so many cryptocurrencies Ads run on the National TVs and that leads us to the conclusion that Nigeria 🇳🇬 still have flexible approach to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "August 11, 2022, 07:08:56 PM",
      "body": "Here's to hoping many more energy providers follow suit. Honestly, when Bitcoin can be easily used for essentials like groceries, and mortgage/rent, I believe there's not much stopping adoption for Bitcoin then. People will with time come to terms with it, learn about it, and it'll come somewhat nature, especially if we can simplify it for the layman a little more.We'll probably see bank services move to cryptocurrencies which does defeat some of the point, but I'm not entirely against that, since I understand some people prefer to have people looking after their money, than trusting themselves. Definitely not for me, but I can see the use case. If the government, banks, and crypto can somewhat integrate it'll be good for adoption. Obviously, I'm hoping most users will go the route of managing their own money though, but its hard to see it catch on at this point. Paying for rent, and energy bills would be a huge step though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Esther C",
      "created_time": "August 11, 2022, 07:09:34 PM",
      "body": "Quote from: Wiwo on August 11, 2022, 06:37:21 PMAs the gap for Bitcoin adoption in the African Largest country Nigeria 🇳🇬 and also referred to as, Giant of Africa Nigeria get widening. Nigeria is among highest country in cryptocurrency trading volume, Next to countries like the United States 🇺🇸. Even though the government have not made a public announcement of cryptocurrency adoption.A large number of Nigeria 🇳🇬 citizens are now aware of the fact that Bitcoin proffered best solution as an alternative currency. PHCN the body responsible for energy control and collection of power revenue Bills and Pre-paid customers, have adopted Bitcoin and other cryptocurrencies for payment of energy consumption in Nigeria.https://i.ibb.co/GQwTW8M/Screenshot-2022-0811-192035-11zon.jpgMore reading and source: https://thecryptobasic.com/2022/08/10/nigerians-can-now-pay-their-utility-bills-with-bitcoin/Utility bills? Nigeria? Bitcoin as it is, is currently banned in Nigeria. It is not acceptable to be found trading cryptocurrency. So the idea of Bitcoin moving from being banned and unacceptable to a legal currency would not be a walk in the park. Achievable but but steep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "August 11, 2022, 08:16:42 PM",
      "body": "Quote from: Wiwo on August 11, 2022, 06:37:21 PMPHCN the body responsible for energy control and collection of power revenue Bills and Pre-paid customers, have adopted Bitcoin and other cryptocurrencies for payment of energy consumption in Nigeria.With all the said and done, i believe the country Nigeria is getting closer by turning a new leave on it initial approach on cryptocurrency in general, if they can start with the adoption of bitcoin specifically then it will increases the more chances to believing in its delivery capacity in receiving payment, i could remember some fee months back when it introduces new regulations on crypto related activities that pave more ways for the use of bitcoin within the country but still yet remained stiveneck on it adoption, but it legality is also a plus advantage on the citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "August 11, 2022, 08:50:01 PM",
      "body": "Quote from: Wiwo on August 11, 2022, 06:37:21 PMPHCN the body responsible for energy control and collection of power revenue Bills and Pre-paid customers, have adopted Bitcoin and other cryptocurrencies for payment of energy consumption in Nigeria.I see this and I wonder if its the same Nigeria that seems very unwelcome when they see a crypto application on your gadget! Well things have been changing a lot lately with people taking it up with authorities on various social media's and the agencies being encouraging on how civilians rights should be respected and directives on how to handle certain situations.As unbelievable as it may seem and am yet to believe until I successfully pay for utility bill with crypto, am not so excited of the news yet. Who knows, this could be some ay to track account and people that uses crypto within the nation.It would be something if this change actually come around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "August 11, 2022, 08:53:44 PM",
      "body": "Quote from: Wiwo on August 11, 2022, 06:37:21 PMAs the gap for Bitcoin adoption in the African Largest country Nigeria 🇳🇬 and also referred to as, Giant of Africa Nigeria get widening. Nigeria is among highest country in cryptocurrency trading volume, Next to countries like the United States 🇺🇸. Even though the government have not made a public announcement of cryptocurrency adoption.A large number of Nigeria 🇳🇬 citizens are now aware of the fact that Bitcoin proffered best solution as an alternative currency. PHCN the body responsible for energy control and collection of power revenue Bills and Pre-paid customers, have adopted Bitcoin and other cryptocurrencies for payment of energy consumption in Nigeria.More reading and source: https://thecryptobasic.com/2022/08/10/nigerians-can-now-pay-their-utility-bills-with-bitcoin/This is actually possible just like the way other merchants like Access, Opay, and Moneypoint are operating as points of sales to facilitate users to purchase an electric unit without going through the company but I'm skeptical about how this Finance protocol intends to settle PHCN.PHCN is not a single company, we have AEDC, IBDEC, JEDC, BEDC and many more, if the users pay bitcoin to purchase units from Manilla Finance, how are they going to settle the electric distribution companies because they don't recognise Bitcoin as legal assets in the country, I'm even afraid more when the government want to kick against this kind of idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "August 11, 2022, 09:04:09 PM",
      "body": "Quote from: Hispo on August 11, 2022, 06:45:27 PMBut I thought Nigerian government was explicity against the use of Bitcoin within the country?I recall watching on Youtube some Nigerian politicians claiming that Bitcoin adoption had hurt the trust in their national currency.And there were some imposed frictions by the banks so people could not transact with Bitcoin and other Cryptocurrency so easily?Of course, I am aware that Bitcoin cannot be declared illegal and expect people to abandon it so easily, but I assumed anti-Bitcoin measures were enforced there. Yes Anti-Bitcoin measures were implemented but no was stood up to enforce them. Nigeria is one the few countries in the world where laws are been made to hunt the masses not for the betterment of the nation. Nigerian attended this status of one of the highest countries with large volume of cryptocurrency trading because of high inflation rate and devaluation of our local currency. it is sad the Nigerian government has turned blind eyes to this because the keep most of their reserve in foreign currencies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 11, 2022, 09:29:44 PM",
      "body": "but, right now, can they actually pay without getting in trouble? reading the previous posts it seems that bitcoin is banned in Nigeria and reading the article, although they have added the option of being able to pay with cryptocurrency it seems that it would still be risky to do so because the PHCN is hoping that the regulators will loosen their rules so the Nigerian citizen can pay without getting in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "August 12, 2022, 08:13:13 AM",
      "body": "Bitcoin payment is quite easy to implement and at some point, government agencies that are scheduled with the responsibility of collecting tax will adopt measures in which the balance that is collected in the best possible way, and energy is one of those sources. Countries are beginning to take income tax on digital currencies such as Bitcoin and the rest, if the government has approved that agency to allow bills to be paid using digital currency it will give a more flexible payment option to taxpayers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 12, 2022, 09:13:36 AM",
      "body": "Quote from: Wiwo on August 11, 2022, 06:55:35 PMThat sanctioning was on the banks.prior to the sanctioning from the Central bank against banks direct involvement to Bitcoin transaction, some commercial banks in Nigeria we're involved in Bitcoin direct transactions services such banks like Access banks and Union Bank of Nigeria. But aside from that Nigerians are still involved in Bitcoin/cryptocurrency activities such as p2p trading without and harassment or fear, so many cryptocurrencies Ads run on the National TVs and that leads us to the conclusion that Nigeria 🇳🇬 still have flexible approach to Bitcoin.And, if sanctions are on the banks how is the payment going to the utility providers?I've read the whole interview and it looks like he is definitely trying to avoid answering thi s with useless walls of text:https://nairametrics.com/2022/08/10/nigerians-can-now-pay-utility-bills-with-crypto-rutherford-atayobo-ceo-manilla-finance/QuoteIn a heavily regulated environment like Nigeria, where banks are banned from processing crypto-related transactions, how does it hope to achieve this?The Manilla Finance platform does not rely on traditional banking services for its operation as we are not routing scripts or API’s through conventional financial solutions. We earnestly yearn that regulators will relax some of the restrictions to enable Nigeria to participate in the global digital economy devoid of bottlenecks. It will be an action we believe will greatly impact the Nigerian economy positively since digital currency adoption has gone through the roof since the last bull run. More are entering the space and already taking suitable positions as the blockchain world anticipates the mother of all bull markets come 2024/25. <6 lines of not saying a thing>Meanwhile, even if Nigerians or users in every country where we are going to operate decide to use the application for payment of bills, all returns are ploughed back to the original service providers through fiat. So, our services do not really write off the use of fiat, it simply provides an outstanding and faster alternative – cryptocurrency.I fail to understand this, you don't ditch fiat but you use an alternative, this is simply something that is impossible, as you can't use an alternative without actually ditching the first choice, that's what an alternative is, and somehow you magically change cryptos into fiat and you pay the companies with what? A truckload of cash and you pay one by one each bill at a PayPoint machine?QuoteThese restrictions make switching directly from crypto to fiat difficult and this automatically makes our product a welcome development because what we are building provides users with the rare opportunity of paying for the multiple services we offer without recourse to the local currency. So, if you take crypto and you deal with fiat, it's not the same?What magic does that app summons to use and not use a system at the same time?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uang_kartal",
      "created_time": "August 12, 2022, 09:30:29 AM",
      "body": "Nigeria had time to make me frown with the news of the policy against the adoption of bitcoin. But I feel if this news came it was the result of another collaboration. I agree with other friends, whether it's any institution or banking, it is a good role to play. If it becomes a currency there are still pros and cons in some countries if it becomes a means of payment to facilitate the need for state contributions, in my opinion it will relieve because some communities will feel at home if this goes on even though it takes time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 12, 2022, 09:54:29 AM",
      "body": "This is really a great move by PHDCN it is indeed spreading the max adoption of bitcoin. Hope for other sector of service providers to accept bitcoin such like the DStv, Gotv, Stronge, Startime and many more to ease us and reduce the hassle from queuing on our local currencies. I met other local stores that accepted Bitcoin for shopping was very excited seeing that one can buy with cryptocurrency.I believe after the presidential Election come 2023 there will be a revolution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "August 12, 2022, 01:55:55 PM",
      "body": "Quote from: Adbitco on August 12, 2022, 09:54:29 AMI believe after the presidential Election come 2023 there will be a revolutionAre you about to elect a new leader in your country, it's funny how you talk about election and anticipate revolution at the same time. If the country is about to go in for presidential election then why calling for revolution which only leads to a total forceful change of government and its institutions. Let me not deviate from the topic of discussion as it borders on Bitcoin payment which should be a favorable payment alternative to the fiat currency. Utility payment is one of the taxes citizens pay more often so the need for effective and easy alternative options is a welcome development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gabbie2010",
      "created_time": "August 12, 2022, 02:18:47 PM",
      "body": "Quote from: acroman08 on August 11, 2022, 09:29:44 PMbut, right now, can they actually pay without getting in trouble? reading the previous posts it seems that bitcoin is banned in Nigeria and reading the article, although they have added the option of being able to pay with cryptocurrency it seems that it would still be risky to do so because the PHCN is hoping that the regulators will loosen their rules so the Nigerian citizen can pay without getting in trouble. Truly cryptocurrency is banned in Nigeria the article looks suspicious to me because the Central Bank of Nigerian CBN being the apex and regulator of all banks had notified all the commercial banks to freeze any account that had done any crypto related transactions, if a transactions is processed and remarked as crypto transaction that account will be frozen, however I was surprised to read the article about PHCN adoption of Bitcoin as a means of payment of utility bills contrary to the government non acceptance of Bitcoin, personally I won't advice any subscriber to start payment now so as not to get into trouble but rather wait till the government makes a new statement on crypto related transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "August 12, 2022, 03:42:38 PM",
      "body": "Quote from: Wiwo on August 11, 2022, 06:37:21 PMAs the gap for Bitcoin adoption in the African Largest country Nigeria 🇳🇬 and also referred to as, Giant of Africa Nigeria get widening. Nigeria is among highest country in cryptocurrency trading volume, Next to countries like the United States 🇺🇸. Even though the government have not made a public announcement of cryptocurrency adoption.A large number of Nigeria 🇳🇬 citizens are now aware of the fact that Bitcoin proffered best solution as an alternative currency. PHCN the body responsible for energy control and collection of power revenue Bills and Pre-paid customers, have adopted Bitcoin and other cryptocurrencies for payment of energy consumption in Nigeria.More reading and source: https://thecryptobasic.com/2022/08/10/nigerians-can-now-pay-their-utility-bills-with-bitcoin/If this you have said is genuine to go by then that's a welcomed development as others would follow suit. Though Nigerian government I have heard of has not really made any comment in respect to sanctioning Crypto currency but rather kept mute over it for long now but however, I heard the Nigerian national assembly I on the verge of passing a bill in respect to that and I pray it scales through for them. Though there are many Nigerians in the blockchain industry and are really ready to take this course serious in sensitizing their fellow Nigerians and mostly the government and law makers on the benefits of blockchain adoption and integration into the system. I pray this works out fast and good for Nigerians.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 12, 2022, 04:22:18 PM",
      "body": "Quote from: gabbie2010 on August 12, 2022, 02:18:47 PMTruly cryptocurrency is banned in Nigeria the article looks suspicious to me because the Central Bank of Nigerian CBN being the apex and regulator of all banks had notified all the commercial banks to freeze any account that had done any crypto related transactions, if a transactions is processed and remarked as crypto transaction that account will be frozenIs it truly banned in Nigeria? Or not officially legal yet?In countries where cryptocurrency is not offically legal, people and services built for crypto trading, exchanging will not leave information of bank transfer that it is exchanged for crypto.In addition, some trade partners can intentionally or mistakenly include it in bank transfer detail. So how the bank and government can double check and verify that it is correct. If a trade partner (scammer) want to play bad, it is one of attack on your bank account. But banks can not rely only on one side to judge about your account and move seriously to freeze it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "August 12, 2022, 04:30:06 PM",
      "body": "That's a start. When BTC becomes a means for every day payments, than we can have mass adoption. Until then BTC and crypto will only be considered an investment, and when it's only and investment, then it's left to the ones who have the means to invest, and that's not everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Imran232",
      "created_time": "August 12, 2022, 04:56:39 PM",
      "body": "Quote from: Wiwo on August 11, 2022, 06:37:21 PM<..................>Wow, this is great that now they accept bitcoin in electricity bills. I really wanted to have this experience in my life too. But I don't know when these things will be possible in my country. Because I pay my electricity bill with mobile banking, in this process, I have to spend some tax too, like I need to convert from crypto to cash. But if I can pay with crypto direct, then I just need to pay from my wallet direct, which is only a one-time blockchain network fee. Let's wait for the time when I can use the same experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}