{
  "id": "topic_5414520",
  "title": "Cryptornd",
  "author": "Cryptornd",
  "created_time": "September 22, 2022, 05:00:26 PM",
  "content": "1. Hopium2. Degen mode3. unrealistic expectations4. short term view1. Hopiumpropaganda online is huge. ridiculous price targets of a coin from fake influencers make them feel better about their investment. better not to listen to them and keep a own view of the market.2.degen mode don't  buy a coin because someone else advised or made money. when i ask people about their investment in crypto most of them actually don't know any fundamentals of it.do the proper research or stick to the average results everyone is halving.3. unrealistic expectationsDon't get manipulated by profits you see online. 100k profits on a  trading account or a sport car.  you will never achieve that with your $1000 account. understand that and be real with you.4.  short term view the real wealth in crypto is made only by founders or holders , not by traders. even if you trade for rest of your life , you will never outperform the guy who bought bitcoin and Ethereum 5 years ago. analyze the data and don't be greedy. long term matters.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414520",
  "comments": [
    {
      "author": "Doan9269",
      "created_time": "September 22, 2022, 06:02:29 PM",
      "body": "OP your advice sounds weird and can make one loose hope on investment, also you're more focused on crypto and here is bitcoin discussion that has to be precise with anything dealing with bitcoin while excluding other crypto, most of your advice are not strictly on bitcoin, moreso how can you say those making it in crypto are the founders, well i may admit that partially but that's not how things work with bitcoin here, if your center of focus is about crypto in general then altcoins discussion will be a better board for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jesselui",
      "created_time": "September 22, 2022, 06:16:55 PM",
      "body": "There are people who abuse the excitement of such people. Especially in social media, there are people who use inexperienced people to get their own invested coins. You shouldn't trust such people, folks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzy887",
      "created_time": "September 22, 2022, 06:53:27 PM",
      "body": "5. Cheated by greed.Beginners may not understand where and how to invest in Bitcoin at first. Scam fraudsters are then greedy for their profits, and that's when they unknowingly invest in scam sites and fall prey to fraudsters.But they should remember that they are new here. First get good knowledge about bitcoin and then invest in bitcoin. And when you gain good knowledge about Bitcoin, don't fall for a scammer.6. Patience Newbies tend to lose their natural patience. They think they can get rich quick by investing in Bitcoin. And so they invest in Bitcoin but when the price of Bitcoin goes down they lose patience and they think that Bitcoin will never come back.Just as it is important for beginners to acquire knowledge about Bitcoin, patience is very important when investing in Bitcoin.If you can hold on to investing in Bitcoin for the future, you can profit. Those who invested in Bitcoin in 2014 know 'anything is possible with patience'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 22, 2022, 07:38:08 PM",
      "body": "Quote from: Cryptornd on September 22, 2022, 05:00:26 PM3. unrealistic expectationsDon't get manipulated by profits you see online. 100k profits on a  trading account or a sport car.  you will never achieve that with your $1000 account. understand that and be real with you.These influencers that are flexing their profits or an individual are showing their profits. But they don't want people to know their losses, I guess a wise person would only believe that person if they're honest with everything which includes the losses.But, for individuals, it's better not to share any details of what they do especially in profit because they won't know who's trying to catch them personally with those flexing and it could go wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 22, 2022, 08:35:06 PM",
      "body": "Quote from: Cryptornd on September 22, 2022, 05:00:26 PM4.  short term view the real wealth in crypto is made only by founders or holders , not by traders. even if you trade for rest of your life , you will never outperform the guy who bought bitcoin and Ethereum 5 years ago. analyze the data and don't be greedy. long term matters.All the points mentioned makes sense, but I want to specifically throw my weight on this number 4 which I totally agree with.Indeed, holders always win at the end, it doesn't matter how much a trader is making as profit everyday, I have practically experienced this, I was ones a committed and consistent day trader before the 2017 bull run, before the bull run started, I was able to buy as much as 0.08 bitcoin as a go and sell in the next minutes for profit, but then, when the bull started, I missed out because I wasn't holding any bitcoin and also, I could no longer afford my normal 0.08 bitcoin at a go anymore.To add, I will advice you @op, next time you make a post in this board, make sure to focus on Bitcoin and bitcoin related matters only, else a post like this will end up being moved to off topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rendravolt",
      "created_time": "September 22, 2022, 08:58:50 PM",
      "body": "I often see newbies who are excited when they find out about bitcoin or cryptocurrencies in various places, they even don't hesitate to brag to many people that they are the best in understanding crypto. But in reality they are just ordinary people who also often fail and expect high expectations in the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lalabotax",
      "created_time": "September 22, 2022, 09:33:34 PM",
      "body": "Quote from: Cryptornd on September 22, 2022, 05:00:26 PM3. unrealistic expectationsDon't get manipulated by profits you see online. 100k profits on a  trading account or a sport car.  you will never achieve that with your $1000 account. understand that and be real with you.This term, many newbies are taped on these unrealistic expectations. Why? Because they want instant profits that make them rich quickly. And moreover, there are influencers who are influencing them through hype projects, promising them that the project is very promising and will be to the moon very soon. This is exactly a damn shit influencer. We have seen that numerous projects with that kind of promise will finally fall down and die because they will be actually failed after the pump. Many smart investors will directly sell their coins when the price is pumped, and the newbies will still keep the coins because they believe in the influencers. The result? Of course, they will lose their money due to the dead projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "September 22, 2022, 09:38:02 PM",
      "body": "3. unrealistic expectationsI should be saying this to be the most common which if we are still that a newbie then we do really have those kind of expectations and even thinking that we would really be makingourselves rich in no time but once you do step your foot into this market then realizations do begins.Those hopes and expectations would vanish into thin airbecause once you do experience the real thing  then you would definitely be able to realize on whats the real deal.As the time progresses then you would really eventually learn and deal up on whats the behavior of the market and realize that making money is never been easy in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "September 22, 2022, 10:31:29 PM",
      "body": "Quote from: Cryptornd on September 22, 2022, 05:00:26 PMthe real wealth in crypto is made only by founders or holders , not by traders. even if you trade for rest of your life , you will never outperform the guy who bought bitcoin and Ethereum 5 years ago. analyze the data and don't be greedy. long term matters.This just isn't true. Especially when some traders might trade at the beginning to build enough of a portfolio up, and then start holding when they've got to a certain amount. Although, if you're a good trader you can make some serious money, and users have. Much more than I'll ever be able to get holding Bitcoin. Unless, you're talking about the very long term, but I don't think I'm going to be alive to even seen that. I do agree with your other point, that you need a certain amount of starting capital to make trading work, but ultimately to benefit from holding in the medium to long term, you'll also need a decent starting capital. Obviously, this entirely depends on your goals, and what return you're expecting on your investment in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "September 22, 2022, 10:56:04 PM",
      "body": "Quote from: blockman on September 22, 2022, 07:38:08 PMQuote from: Cryptornd on September 22, 2022, 05:00:26 PM3. unrealistic expectationsDon't get manipulated by profits you see online. 100k profits on a  trading account or a sport car.  you will never achieve that with your $1000 account. understand that and be real with you.These influencers that are flexing their profits or an individual are showing their profits. But they don't want people to know their losses, I guess a wise person would only believe that person if they're honest with everything which includes the losses.But, for individuals, it's better not to share any details of what they do especially in profit because they won't know who's trying to catch them personally with those flexing and it could go wrong. Trading could really result into huge profits but it won’t happen instantly, as it could mean a lot of losses at first before you can hit jackpot in trading. However, I understand those people who are bragging their profits from trading, it’s only their own techniques to attract newbies into trading. But if you are wise enough, you will never believe in quick easy profits as trading with huge profits will only be achieved through hardwork and patience all throughout the years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 22, 2022, 10:58:03 PM",
      "body": "Quote from: Welsh on September 22, 2022, 10:31:29 PMQuote from: Cryptornd on September 22, 2022, 05:00:26 PMthe real wealth in crypto is made only by founders or holders , not by traders. even if you trade for rest of your life , you will never outperform the guy who bought bitcoin and Ethereum 5 years ago. analyze the data and don't be greedy. long term matters.I do agree with your other point, that you need a certain amount of starting capital to make trading work, but ultimately to benefit from holding in the medium to long term, you'll also need a decent starting capital. Obviously, this entirely depends on your goals, and what return you're expecting on your investment in the first place. In both cases it requires some good capital to survive and enter the market with a good position, let's say even if you are a long-term Bitcoin holder and do not enter the market with good capital even if you wait for a decade your return on investment will not exceed the amount of your capital no matter what Bitcoin price may be, same goes with trading the only thing is that trading have higher risk but can also give higher returns but holding have limited risk compared to trading but your profits will only come as a result of market uptrend condition when you hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "September 22, 2022, 11:41:38 PM",
      "body": "Newbie mostly easily courage to make an investment even though they don't have enough knowledge how does the crypto works and most of them just buy easily base on the opinion of other people which is they are tired to research and understand the coins roadmap and it is a red flag.Best thing recommend to newbies acquires some knowledge first before investing and seek help without having a money involve and focus on knowledge and helping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "September 22, 2022, 11:43:49 PM",
      "body": "Quote from: Wiwo on September 22, 2022, 10:58:03 PMQuote from: Welsh on September 22, 2022, 10:31:29 PMQuote from: Cryptornd on September 22, 2022, 05:00:26 PMthe real wealth in crypto is made only by founders or holders , not by traders. even if you trade for rest of your life , you will never outperform the guy who bought bitcoin and Ethereum 5 years ago. analyze the data and don't be greedy. long term matters.I do agree with your other point, that you need a certain amount of starting capital to make trading work, but ultimately to benefit from holding in the medium to long term, you'll also need a decent starting capital. Obviously, this entirely depends on your goals, and what return you're expecting on your investment in the first place. In both cases it requires some good capital to survive and enter the market with a good position, let's say even if you are a long-term Bitcoin holder and do not enter the market with good capital even if you wait for a decade your return on investment will not exceed the amount of your capital no matter what Bitcoin price may be, same goes with trading the only thing is that trading have higher risk but can also give higher returns but holding have limited risk compared to trading but your profits will only come as a result of market uptrend condition when you hold.In my opinion, if you don't want to get depressed comparing yourself to other holders.Better take care of your own crypto holdings and look for ways how to take advantage of the market. Just keep in mind that buy low, sell high. Hard to practice in real trading. But it just means, sell above your buying price.If you do believe on this market, you will not sell at a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "September 22, 2022, 11:52:06 PM",
      "body": "Very basic mistakes by newbiesFalling for false promises without analysing.Lack of patience to experience the growth.Lack of understanding about the market.Expecting overnight growth all the time.Finds it a way to make easy Money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "September 22, 2022, 11:57:02 PM",
      "body": "Maybe just 'invest what you can afford to lose' in the market?I think everything boils down to this adage. If we know that the money that we invested in the first place is at big risk. So we don't put too much expectations on it.  And the worst is that it can put a tool not just on your wallet, but on you mental healthy if you think you can get your money right away with huge profits in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "September 23, 2022, 12:07:32 AM",
      "body": "1,2,3 could be summarized as DYOR (Do your Own Research), for newbies this is really important. You just don't listen to Youtube influencer or someone you follow on Twitter or Insta and advise you to invest on certain coins because it's going to the moon. You really have to do a lot of leg work in crypto to be a millionaire. Others trade, take the risk, while majority of us who doesn't want to complicate things, invest, DCA and HODL as long as they can and then sell when they needed some funds for emergency and then keep on buying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 23, 2022, 12:31:35 AM",
      "body": "Quote from: Cryptornd on September 22, 2022, 05:00:26 PM3. unrealistic expectations(....)As this is the most common what I observe lately, there are a lot of reasons why newbies are behaving like this. The main reason for me is also social media or what they can see over the internet. For example on social media, their lot of popularity spreads hopium for people, especially newbies, and here the unrealistic expectation begins or it will just add up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "landheer",
      "created_time": "September 23, 2022, 12:35:08 AM",
      "body": "yes, that's how it is for beginners in crypto, and bitcoin. and I have also experienced that, but all of them will surely learn from their respective experiences, and indeed it is their right, for any purpose. so I always have a positive view of those who are beginners, because later if for example they fail, of course they will also learn from that experience, and learning from experience is a good lesson.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "September 23, 2022, 01:14:39 AM",
      "body": "Quote from: GreatArkansas on September 23, 2022, 12:31:35 AMQuote from: Cryptornd on September 22, 2022, 05:00:26 PM3. unrealistic expectations(....)As this is the most common what I observe lately, there are a lot of reasons why newbies are behaving like this. The main reason for me is also social media or what they can see over the internet. For example on social media, their lot of popularity spreads hopium for people, especially newbies, and here the unrealistic expectation begins or it will just add up.I have the same thoughts, someone that has unrealistic expectations is setting himself up to failure, after all no matter how successful they are on their bitcoin investments they are always going to come up short if their expectations are out of place.So it is important that before we make any kind of investment we have a realistic idea of how much money we can actually make, so when we get it we can recognize this fact and be grateful about the profits that we are getting instead of letting our greed take control of ourselves and then take a bad decision because of it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}