{
  "id": "topic_5439545",
  "title": "l_",
  "author": "l_",
  "created_time": "February 12, 2023, 06:26:45 AM",
  "content": "Hi, I'd like to make a tokens list for BTCRecover that contains every possible combination of usable ascii characters to brute force a wallet password...So far I have+ ^%1,9inI realize I can make the second integer in that code larger to brute force more passwords, and that it only contains lower case, uppercase letters and all digits...I want to also include all special characters that are usable in a Bitcoin password. I don't know what all the characters are that are usable though, maybe someone could help me out with that as well.It doesn't matter how long it takes. I just want a complete list of all possible passwords up to a defined length. This is mainly for testing purposes, but also just to be thorough when attempting to brute force.Cheers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439545",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "February 12, 2023, 09:14:43 AM",
      "body": "The complete table of ASCII characters is a good start.But: I think you're going in the wrong direction. If you want any chance to recover a password, you should narrow it down instead of trying to search more.Quote from: l_ on February 12, 2023, 06:26:45 AMI want to also include all special characters that are usable in a Bitcoin password. I don't know what all the characters are that are usable though, maybe someone could help me out with that as well.I haven't tested it, but I guess it's not limited to ASCII only.QuoteIt doesn't matter how long it takes.128 possibilities times 12 characters at 1 trillion calculations per second barely takes half a million years",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "February 12, 2023, 11:23:56 AMLast edit: February 12, 2023, 11:35:39 AM by o_e_l_e_o",
      "body": "Quote from: l_ on February 12, 2023, 06:26:45 AMSo far I have+ ^%1,9inIf that is the only line your tokens file, then you need neither the + nor the ^.%1,9in will try every combination of lowercase letters, uppercase letters, and digits, between 1 and 9 characters long.If you want to try every possible ASCII character, then you would use %1,9q instead. This includes the full list of 95 printable ASCII characters (including lowercase, uppercase, digits, symbols, and space).If you want to add line feeds, carriage return, and tabs, then instead use %1,9P.If you want to expand beyond the 95 printable ASCII characters (such as to letters with diacritics or non-ASCII symbols), then you should use %1,9ic, and then specify all your custom characters using the command --custom-wild characters.In terms of valid characters, you are looking at pretty much the full UTF-8 character set, which is thousands upon thousands of characters, including Greek and Cyrillic letters, CJK characters, mathematical operators, and even random symbols such as ⛄ and ⛅.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}