{
  "id": "topic_5405173",
  "title": "NFTplay",
  "author": "NFTplay",
  "created_time": "July 04, 2022, 06:39:27 PM",
  "content": "I really didnt expect that something like this can happen in 2022 and it gives me more urge to share the story and awful experience i had with 1xbit gambling site (https://1xbit1.com). Everything can be supported by screens of conversation, tx ids on blockchain and others. I have nothing to hide and everything to show.Even when i am not a fan of lawsuits or sharing \"Business\" information publicly, attitude of 1xbit gave me no other choices than to share this with everyone who could also get affected and scammed just like I got.On 3rd of June, 11:00pm UTC i created an account and got my id (several numbers as usual) and created my passport. Shortly after that I deposited 4000 USDT as TRC20 The transaction was credited shortly after i did the deposit.I decided to bet on WNBA match with odds approximately 1.65 with total amount of 4000 USDT. Important to say that the max amount to bet was around 16,000 USDT so I did bet way lower than max limit.The match went well and my match was successful and i won the bet. Shortly after I received my winnings (total 6592 USDT) i decided to withdraw whole amount to my TRC20 USDT address. You can see from the screenshots that whole winning amount was credited to my account without any problem. However, shortly after that my withdrawal was declined (no reason specified).I woke up in the morning (i submitted a withdrawal and went to sleep while the withdrawal was supposed to arrive to my provided address) and realized i dont have the money in my address. Therefore i tried to log into my account only to find out the username and password doesnt work. My account was simply disabled and no reason given.I then tried to reach out to live support to check what the problem is and how to access my account. I was told to send a message to security department (email) which i did.After i explained my problem i was told that the company DECIDED TO STOP ANY COLLABORATION WITH ME DUE TO VOLATIONG T&C. No other specifics were given. I was also told (check screens) that i can withdraw deposited amount only (thank god, really appreciate you @1xbit just stole my 2650 usd and not even the 4000 usd deposited).I tried to find out how i violated the T&C, however no other answers were provided by the 1xbit company. I am sure i havent violated anything. Therefore i consider the match that was in the end voided as a pure robbery by 1xbit and i am ready to take a legal action.If you want to provide some kind of service you must play by rules and fair. Everyone is your friend (in gambling) when youre losing money. Once you start winning, hidden T&C are being shown to you to excuse any unfair play by the casinos and gambling sites.I am a witness and victim of this pure steal and robbery and can not this let go without any action. Even if this saves one person from not using 1xbit i will be glad.Feel free to switch on notifications as i will provide updates whenever 1Xbit answers or about the legal action that will take place.Same text will be shared on Twitter, Review servers and also will be switched on as Twitter ads to reach relevant audience so more people can stop using this scam service called 1xbit.If 1xbit decides to reward me and pays what they owe i will update this thread and state that everything has been sorted. Until then, the ads will run infinitely.Best regards,https://i.imgur.com/7rkzGU3.pnghttps://i.imgur.com/ix8NYbG.pnghttps://i.imgur.com/vrQRkgO.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405173",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 04, 2022, 07:04:17 PM",
      "body": "Quote from: NFTplay on July 04, 2022, 06:39:27 PM Until then, the ads will run infinitely.This is just another number. No one is going to show any interest in your thread unfortunately. We are bored to see accusations against 1xbit. There are many of them on this scam accusation board. I am interested to know why did you decide to join their website. More precisely how did you find them first?Sorry for your lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 04, 2022, 08:11:50 PM",
      "body": "Can I know why have you chosen 1Xbit? Those gamblers using 1Xbit deserve it, I will not surprise even if they scam your capital as well. A lot of accusations have been created against 1xbit with the same scam methods. You won means you violate their terms and conditions. You lose means you are following their Terms and Conditions. Even if you search on Google you would discover much negative feedback. But people come here after being deceived. If you deposit to a well-known scam gambling site, means we can't help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 05, 2022, 05:35:31 AM",
      "body": "Quote from: NFTplay on July 04, 2022, 06:39:27 PMOn 3rd of June, 11:00pm UTC i created an accountThat casino has scam accusations for many many months. If you went on to still create an account there after so many red flags, crying now is a bit late.As said, most may even ignore the topic since we've seen far too many like this.If you indeed get on with legal actions (I have my doubts, since most probably the company is not registered in a \"western\" country, or at all) and have success, then you can come and tell the others how to do it; that would be useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 05, 2022, 05:48:55 AM",
      "body": "Quote from: BitcoinGirl.Club on July 04, 2022, 07:04:17 PM I am interested to know why did you decide to join their website. More precisely how did you find them first?Quote from: The Cryptovator on July 04, 2022, 08:11:50 PMCan I know why have you chosen 1Xbit? I don't know the specific reason for the OP, what I do know is that they invest a lot in advertising. They even appear in Mycellium and Blockchair. But if you just google it, you'll see ads and fake reviews in their favour. This forum is not visible enough to counteract that, and on top of that they are tolerated because scams are not moderated here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 05, 2022, 10:13:34 AM",
      "body": "1xBit is a terrible site with an awful gambling reputation that you can easily find by doing some research on this forum. Since you are brand-new, you are probably not aware of it. I wish you found this forum before you decided to deposit to their casino. Btw, how did you find it just now and not before?Quote from: NFTplay on July 04, 2022, 06:39:27 PMOn 3rd of June, 11:00pm UTC i created an account and got my id (several numbers as usual) and created my passport. This part of your post is a bit confusing to me. What do you mean you got an ID made up of several numbers as usual? What does \"as usual\" mean? Have you ever registered an account with 1xBit in the past?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 05, 2022, 01:18:41 PM",
      "body": "We don't know anymore how to warn people not to gamble on the 1xbit site, what other way should we do to make people aware that 1xbit is prone to fraud.@NFTplay, a case like yours has happened several times to 1xbit users, they refuse payment when you win, there's not much we can help here, besides you stop gambling on the 1xbit site and if you still want to gamble, play on a site that is fair and responsible for its users.I can't understand it, even though there are so many accusations against 1xbit, there are always victims of fraud who are harmed, whether it's the user's own fault, without considering gambling sites before registering and depositing or indeed they lure big games and bonuses, realize, gambling bettors, 1xbit can make you cry at any time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 05, 2022, 09:51:27 PM",
      "body": "I will echo this again... I hope it now makes sense to you. it's why I hate the 1xbit scam with passion.Quote from: logfiles on June 30, 2022, 09:11:42 PMThis is what i keep telling peopleWith on 1xbit, when you deposit money and lose it, there won't be any “TOS” violated, but make a mistake of winning a huge amount. All of a sudden, your account gets locked, and they say you violated the ToS, which they never even mention.In other word, 1xbit is designed to make sure a player can never profit from them. If you want huge winnings that you can withdraw. Avoid this scam called 1xbitThere are so many accusations against 1xbit, and I wonder how you ended up using the casino minus reading reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 05, 2022, 11:40:14 PMLast edit: July 06, 2022, 11:14:43 AM by Slow death",
      "body": "Quote from: NFTplay on July 04, 2022, 06:39:27 PMI really didnt expect that something like this can happen in 2022if you had taken the time to research this site, you would have realized that this site is the biggest scam in the history of online casinos, they have a vast ramifications of scam sites, they are a real scam machine. I'm sorry for your loss, my advice:1 - look for a lawyer and report your case to the police2 - when you want to use a casino, search long before",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "July 06, 2022, 08:27:29 AM",
      "body": "Quote from: NFTplay on July 04, 2022, 06:39:27 PMI really didnt expect that something like this can happen in 2022 and it gives me more urge to share the story and awful experience i had with 1xbit gambling site (https://1xbit1.com). Everything can be supported by screens of conversation, tx ids on blockchain and others. I have nothing to hide and everything to show.What made you think that something like this cannot happen in 2022 what industry you are in for you to think that these things are unlikely 1XBIT has a lot of complaints and almost daily their new complaints not only from 1XBIT, the worse thing that can happen is thinking that its safe to put money on projects that you are not diligently research always DYOR.QuoteEven when i am not a fan of lawsuits or sharing \"Business\" information publicly, attitude of 1xbit gave me no other choices than to share this with everyone who could also get affected and scammed just like I got.You should that's the right thing to do let people know your bad experience so they will not experience the same thing, sharing is caring.QuoteIf 1xbit decides to reward me and pays what they owe i will update this thread and state that everything has been sorted. Until then, the ads will run infinitely.You're lucky if you get it, but there are some instances where player get their deposit but not their winnings, I advise that even if they refund you, you still marked this thread as a scam complaint, if you won fair, its just right to get your winning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 06, 2022, 08:52:04 AM",
      "body": "Quote from: Chahan on July 05, 2022, 08:45:00 PMIf I decide to deposit an amount as high as 4k$ I at least check if the site is legit.The smallest search would let alarm bells ring like crazy.When you see a brand everywhere for years, you start to trust it. You do not feel to do much research. 1xbit is everywhere. I have no idea how they get it even in on ground display board in football matches. Having your brand in on ground display costs several hundred thousand USD. It's not only the money, you need to provide them legal papers too. But 1xBit is doing it from months and years. The forum, ask gambler or any other website can not harm them much. I think the victims need to take them in the court and the legal authority help to shut the site down. Only then we will not see anymore victim from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 07, 2022, 01:58:50 PM",
      "body": "Quote from: BitcoinGirl.Club on July 06, 2022, 08:52:04 AMThe forum, ask gambler or any other website can not harm them much. I think the victims need to take them in the court and the legal authority help to shut the site down. Only then we will not see anymore victim from them.All the victims should form a group and launch a class suit, 1XBIT have huge money to advertise and pay people they can continue to do what they are doing.The people they've scammed have proof and evidence, they just need to band themselves if they have whales that can help them put his people to trial then we'll have a chance to shut down 1XBIT, we can only warn people but to stop them from scamming more people a court order is the one to do this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 07, 2022, 02:57:39 PM",
      "body": "Quote from: coin-investor on July 07, 2022, 01:58:50 PMAll the victims should form a group and launch a class suit, 1XBIT have huge money to advertise and pay people they can continue to do what they are doing.Unfortunately it seems not realistic to me. The only possible way will be someone to start a massive campaign against them. It will obviously need a fund. Someone who is responsible and trusted can monitor the campaign / project. But I do not think anyone will be much interest to do so, even a lot of gamblers are fine to lose their hard earned money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "July 07, 2022, 03:00:31 PM",
      "body": "We won’t even know how he found out about this scam gambling site until he let us know. He may just be a victim of its scattered advertisements in various corners where it can be placed just like the aforementioned explorers. He may also have just been drawn to fake reviews or highlight promotions without first knowing the overall background of this site. They probably have a lot of money from what they stole and they are stealing. Even if they end up shutting down their website, they won't lose the way to create a new one.That is what is happened to those who are in a hurry and do not practice first or even find out if it is trustworthy or if there is no trace of fraud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 07, 2022, 07:35:38 PM",
      "body": "Quote from: Wapfika on July 07, 2022, 03:04:54 PMA social media post campaign might be a good start to exposed this scam exchange. We just need to make it trend so that the public can see what’s the cause.Still one will need a lot of FREE time to invest. 1st you need to check every users in the forum and anywhere else who were victim of 1xbit. This will take you a long time. Once you have xxx number of users then launch a social campaign, maybe a Facebook and twitter page. Give efforts to viral a hashtag together to make awareness. It's just a lot of work to do and patience is needed too. It sounds impossible but it is doable. Finding all the victims and collecting their contact could be a good start. Question is who will take this project and give his free time for this non-profit initiative?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lilacthrow123",
      "created_time": "July 07, 2022, 08:30:18 PM",
      "body": "Isn’t that casino unlicensed? So they can pretty much just choose to pay you or not. Idk why anyone would play there. Sorry you lost your winnings",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 07, 2022, 09:28:09 PM",
      "body": "Quote from: Lilacthrow123 on July 07, 2022, 08:30:18 PMIsn’t that casino unlicensed? A lot of crypto casino do not have license or just have CURACAO licensing. Many users really don't care to contact the licensing provider i guess because they do not want to go and file a case to reveal their identity. Since crypto payments are not reversible they can not report the merchant too for a refund. It's one of the benefit crypto casinos enjoys unfortunately.QuoteIdk why anyone would play thereAnonymity is one of the good reason including many others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 07, 2022, 11:22:55 PM",
      "body": "Quote from: Text on July 07, 2022, 03:00:31 PMWe won’t even know how he found out about this scam gambling site until he let us know. He may just be a victim of its scattered advertisements in various corners where it can be placed just like the aforementioned explorers. He may also have just been drawn to fake reviews or highlight promotions without first knowing the overall background of this site. They probably have a lot of money from what they stole and they are stealing. Even if they end up shutting down their website, they won't lose the way to create a new one.That is what is happened to those who are in a hurry and do not practice first or even find out if it is trustworthy or if there is no trace of fraud.Maybe because of the explosive advertisements of 1xbit to different platforms such as youtube. There is many youtubers who have a good amount of subscribers who where sponsored by this 1xbit casino. Some of those youtubers really push people to deposit by giving them referrals and to good to be true bonuses. This is why I push myself to comment on every video where I can see 1xbit casino promotion. We can't do anything about victims ignorance in searching if a casino is reputable, Information is available in the internet   There are hundreds of victims of that casino right now and we currently have others who's case aren't being resolve or 1xbit doesn't want to resolve because of it's nature in scamming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "July 07, 2022, 11:35:11 PM",
      "body": "Quote from: abel1337 on July 07, 2022, 11:22:55 PMQuote from: Text on July 07, 2022, 03:00:31 PMWe won’t even know how he found out about this scam gambling site until he let us know. He may just be a victim of its scattered advertisements in various corners where it can be placed just like the aforementioned explorers. He may also have just been drawn to fake reviews or highlight promotions without first knowing the overall background of this site. They probably have a lot of money from what they stole and they are stealing. Even if they end up shutting down their website, they won't lose the way to create a new one.That is what is happened to those who are in a hurry and do not practice first or even find out if it is trustworthy or if there is no trace of fraud.Maybe because of the explosive advertisements of 1xbit to different platforms such as youtube. There is many youtubers who have a good amount of subscribers who where sponsored by this 1xbit casino. Some of those youtubers really push people to deposit by giving them referrals and to good to be true bonuses. This is why I push myself to comment on every video where I can see 1xbit casino promotion. We can't do anything about victims ignorance in searching if a casino is reputable, Information is available in the internet   There are hundreds of victims of that casino right now and we currently have others who's case aren't being resolve or 1xbit doesn't want to resolve because of it's nature in scamming. And the sad part, they will only come here once screwed by the site.But that's an expensive lesson for anyone. I don't think he will make the same mistake again.Now that the OP is here in the forum, he can find a lot more reputable casinos in the gambling board. I believe 1xbit really does have a lot of ads outside this forum, even most of the review sites are giving them a good rating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "July 08, 2022, 12:09:25 AM",
      "body": "Quote from: TimeTeller on July 07, 2022, 11:35:11 PMQuote from: abel1337 on July 07, 2022, 11:22:55 PMQuote from: Text on July 07, 2022, 03:00:31 PMWe won’t even know how he found out about this scam gambling site until he let us know. He may just be a victim of its scattered advertisements in various corners where it can be placed just like the aforementioned explorers. He may also have just been drawn to fake reviews or highlight promotions without first knowing the overall background of this site. They probably have a lot of money from what they stole and they are stealing. Even if they end up shutting down their website, they won't lose the way to create a new one.That is what is happened to those who are in a hurry and do not practice first or even find out if it is trustworthy or if there is no trace of fraud.Maybe because of the explosive advertisements of 1xbit to different platforms such as youtube. There is many youtubers who have a good amount of subscribers who where sponsored by this 1xbit casino. Some of those youtubers really push people to deposit by giving them referrals and to good to be true bonuses. This is why I push myself to comment on every video where I can see 1xbit casino promotion. We can't do anything about victims ignorance in searching if a casino is reputable, Information is available in the internet   There are hundreds of victims of that casino right now and we currently have others who's case aren't being resolve or 1xbit doesn't want to resolve because of it's nature in scamming. And the sad part, they will only come here once screwed by the site.But that's an expensive lesson for anyone. I don't think he will make the same mistake again.Now that the OP is here in the forum, he can find a lot more reputable casinos in the gambling board. I believe 1xbit really does have a lot of ads outside this forum, even most of the review sites are giving them a good rating.There is a high chance that those reviews as well are paid just to make 1xbit clean.Sorry for the loss OP, but now that you are here already, you can find many and more reputable gambling sites here. 1xbit really is an expert when it comes to scamming gamblers and still, there are many who are trying to bet on their platform which is unfortunate, but there is nothing we can do. There are numerous warnings here already, but the problem is it is only here, and you always see the advertisements of 1xbit everywhere outside Bitcointalk. Many more will be scammed by this scam site in the future for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}