{
  "id": "topic_5465515",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "September 03, 2023, 02:47:21 PM",
  "content": "QuoteKuCoin says crypto adoption is high in Turkey, as observed in other nations struggling with rapid inflation.https://decrypt.co/154724/republic-of-turkey-crypto-adoption-half-kucoinInteresting to see how people in Turkey are preferring Crypto over fiat to save themselves from the inflation. According to this article, crypto adoption has increased from 40 percent to 52 percent of the Turkish population over the last year and a half.In June this year, Turkey's Inflation was reported at 38.2% and it's currently 47.83% in August.https://tradingeconomics.com/turkey/inflation-cpiI am sure for the people, Crypto is surely a bless.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465515",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "September 03, 2023, 02:53:37 PM",
      "body": "Dunno, this number seems grossly overexaggerated to me, as they usually are when it comes to crypto adoption. I mean, I would love if its true, but I honestly doubt that 50% of people in Turkey owns crypto, and if you check the article Kucoin based that number on survey on 500 people only.Looking forward to hear whta out members from Turkey has to say about this, do they have a feling that half the people around them owns crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 03, 2023, 03:01:17 PM",
      "body": "This statistics is BS, Turkey is a country of over 85m people, and you ask just 500 people what their opinion of crypto is, and you use that to draw conclusion that half of the people in Turkey now own crypto. Kucoin are probably doing this to atract attention to themselves, it has to be some sort of marketing strategy.It is difficult to get statistics on the number of people using crypto in a particular region, but this one is a very weak attempt that does not in anyway paint the actual picture, Kucoin is just picking numbers out of a hat and making an exaggerated conclusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "September 03, 2023, 03:06:26 PM",
      "body": "This will be a good news if what you have written and the source of the news is true but I think there could be some atom of fallacy in it. I don't really know much about Turkey but if that's true then Turkey as a country could have been part of the countries that have high numbers of cryptocurrency users. Maybe the adoption of crypto users in Turkey may keep increasing but I don't think half of the citizens are crypto users looking at the graph of countries with users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 03, 2023, 03:13:25 PM",
      "body": "They have chosen crypto over fiat due to high inflation. It seems overexaggerated but not impossible at all and I can see why. They are losing their wealth every day due to inflation and they need to find an alternative. There isn't any better alternative that is more convenient than crypto so if the number is not 50% I think it is more than 30% already. We have seen how Venezuelans, Sri Lankans, and Jordanians were using crypto as their payment system and the thing is most of them are not amazed by the innovation. They are forced to use crypto because there isn't any better alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 03, 2023, 03:18:53 PM",
      "body": "Quote from: DVlog on September 03, 2023, 03:13:25 PMThey are forced to use crypto because there isn't any better alternative.If we talk about alternative, old generation will say gold is the best option.I think most of them convert their fiat into physical or digital gold, some of them buy crypto might be for diversification or making quick profit. Maybe the last donation when they get nature disaster through crypto make them aware of crypto existence and think it has a value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 03, 2023, 03:20:05 PM",
      "body": "If Turkey or any other country is experimenting such a degree of inflation, then it is not surprising people is opting to move their saving off their local currency in favor of Bitcoin or stablecoins, it is matter of common sense: nobody wishes to lose their wealth, not matter how relatively high or low it is.On the other hand, assuming most of people in inflationary economics seek to buy centralized stablecoins on centralized exchanges, it means that in terms of adoption it is good, but in decentralization spread it is not significant. I would dare to say only a fraction of those who started by buying USDT or USDC will eventually move some of their money into non custodial wallets in form of a truly decentralized coin as Bitcoin is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 03, 2023, 03:20:12 PM",
      "body": "Quote from: Rikafip on September 03, 2023, 02:53:37 PMDunno, this number seems grossly overexaggerated to me, as they usually are when it comes to crypto adoption. I mean, I would love if its true, but I honestly doubt that 50% of people in Turkey owns crypto, and if you check the article Kucoin based that number on survey on 500 people only.Quote from: Z-tight on September 03, 2023, 03:01:17 PMThis statistics is BS <...>Quote from: Wakate on September 03, 2023, 03:06:26 PMThis will be a good news if what you have written and the source of the news is true but I think there could be some atom of fallacy in it. Quote from: DVlog on September 03, 2023, 03:13:25 PMThey have chosen crypto over fiat due to high inflation. It seems overexaggerated but not impossible at all and I can see why. I share your scepticism, my friends, especially if the study is based on such a small sample as I have put in bold. I would like to see the method of selection of respondents because we already know that statistics can be cooked and KuCoin is interested in headlines like that. In any case I am sure that in Turkey the adoption is high due to the very high inflation they have been suffering for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 03, 2023, 03:27:55 PM",
      "body": "It's just a research survey and it doesn't hold by any means by exact total numbers of their population. When the article say +50% it only means that those are the number of adult people who can manage to hold crypto/finance. But actually it's a good news no matter the number is as long it is uptrend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 03, 2023, 03:33:43 PM",
      "body": "Quote from: Rikafip on September 03, 2023, 02:53:37 PMDunno, this number seems grossly overexaggerated to me, as they usually are when it comes to crypto adoption. I mean, I would love if its true, but I honestly doubt that 50% of people in Turkey owns crypto, and if you check the article Kucoin based that number on survey on 500 people only.Looking forward to hear whta out members from Turkey has to say about this, do they have a feling that half the people around them owns crypto. It only means there are just above 250+ people who responded to the survey and who do own some coins which Kucoin also picked to join the survey.  But why is Kucoin's rep in the last paragraph talking about their country's Digital Lira?Muslims afaik are not very friendly to crypto, I remember there are a few threads about it in this forum itself and Turkey's population is more than 90% Muslim. You can already tell the numbers won't add up. My country also has an inflation issue which is more than 15% already since Covid 19. None so far is talking about the adoption of crypto but basically more are using our CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 03, 2023, 03:35:04 PM",
      "body": "Quote from: Don Pedro Dinero on September 03, 2023, 03:20:12 PMI would like to see the method of selection of respondents because we already know that statistics can be cooked and KuCoin is interested in headlines like that. After reading that article once again, I don't think that there was any survey al all and instead and they just pulled that 50% number out of their ass. Number I believe even less is that \"47% of crypto investors are females between 18-30\". Imho, this is nothing but marketing. Quote from: Don Pedro Dinero on September 03, 2023, 03:20:12 PMIn any case I am sure that in Turkey the adoption is high due to the very high inflation they have been suffering for a long time. It might be high compared to other countries, but I seriously doubt that real percentage is anywhere close to a double digit number, let alone 50%. Quote from: bittraffic on September 03, 2023, 03:33:43 PMMuslims afaik are not very friendly to cryptoI didn't get that impression at all, judging by the local boards of countries with predominantly muslim population.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 03, 2023, 03:35:35 PM",
      "body": "It's a flawed survey and the size of the sample is not enough for a country with close to 90 million population. While it's good to see the growing interest from the people to adopt cryptocurrency because of the sky high inflation. But I believe if the inflation keeps on increasing, a lot more people will eventually become interested in cryptocurrency and alternatives like Gold and Silve. It's a net positive news!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 03, 2023, 04:01:54 PM",
      "body": "Think about it: there aren't even enough funded Bitcoin addresses in existence for half the population of Turkey to own one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "September 03, 2023, 04:07:53 PM",
      "body": "Quote from: Z-tight on September 03, 2023, 03:01:17 PMThis statistics is BS, Turkey is a country of over 85m people, and you ask just 500 people what their opinion of crypto is, and you use that to draw conclusion that half of the people in Turkey now own crypto. Kucoin are probably doing this to atract attention to themselves, it has to be some sort of marketing strategy.It is difficult to get statistics on the number of people using crypto in a particular region, but this one is a very weak attempt that does not in anyway paint the actual picture, Kucoin is just picking numbers out of a hat and making an exaggerated conclusion.A sample of 500 people will not in any way represent the entire Turkish population. They also didn't state the demographic spread of the respondent and there was no data analysis method. Adoption of cryptocurrencies will be very high in Turkey due to the fall of the lira and the high literacy rate in Turkey but 52% is a mere assumption. Even in the US where there is high crypto awareness and the presence of many notable crypto-related firms, a report claims that only 21% of adults in the US own cryptocurrencies as of last year. Maybe Kucoin has other intentions for this statistical hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 03, 2023, 04:47:21 PM",
      "body": "It makes sense and is sad that Turkey is using crypto. When hyperinflation makes even everyday needs too expensive to buy, people naturally look for other protection. And since cryptocurrencies provide a safe haven from bad money management, the rise in their use is both expected and a good thing.The statistics are more than just numbers; they show that people are losing faith in their government and are pleading for financial stability. It sends a clear message to the world: when things get hard, people change and adapt. If only more countries would learn from this and work with crypto instead of against it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 03, 2023, 04:51:43 PM",
      "body": "The basis of their survey is depicted here:https://www.kucoin.com/blog/more-than-half-of-Turkish-adults-invest-in-cryptoWhilst the full public survey resides here (pdf on a Google drive, so I’ll place it in code markers):Code:https://drive.google.com/file/d/18uoc4-PJmZ36K9ub8UIdacc_OnjS7ajn/view - Google DriveDisregarding (for now) the full content of the survey, the first aspect to look into is the methodology, being as follows as per their words state in the full report:QuoteThis survey report is based on a total sample of 550 adult crypto investors aged 18 to 60 in Turkey. Crypto users are defined as those who currently own or have invested in crypto over the past six months. Survey respondents were polled online from May 5th to May 12th, 2023. The data presented in this report are based on the survey conducted by KuCoin using SurveyMonkey Audience.Later on, a foot note on a chart also indicates that:Quote*The incidence rate of crypto investors 52% is estimated based on screening around 1058 Turkish adults and identifying 550 crypto investors among them to complete the survey.Turkey’s polulation is close to 86M people. Looking at a recent breakdown of the population's pyramid structure, I’s say that roughly 60% of the total polulation falls into the age range of the survey (close to 52M people). Playing around with their sample size calculator ,the sample size used for the survey should suffice (those alleged miracles of statistics), … but …. The key is that the survey panel has to be spared, non-biased and representative.This latter factor is the key, and I’m not really convinced that it is met. The 1058 Turkish adults were selected using SurveyMonkey Audience (as per their own description). SurveyMonkey allows one to conduct a survey using their panel data (for a cost). The people that conform the panel are generally volunteers that get paid to fill in a survey when contacted to do so (see https://paidfromsurveys.com/surveymonkey-rewards-review# for example). This creates a first stage of potential bias, as the abstact profile is that of those with a certain technological degree of knowledge, willing to do stuff (i.e. surveys) online. I’d confront that to a random set of 1.058 people chosen at an average market. The latter should prove to be more heterogeneous in profile and knowledge (or lack off).To contrast, another survey stated that figure in 2022 was of around 5,5%, whilst Statista set the figure at 47% for 2023, which backs KuCoin’s results ...In any case, the figure 52% figure does seem overly high, and it is difficult to assimilate as a fact to be taken for granted without questioning the potential bias of the survey panel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "September 03, 2023, 05:29:42 PM",
      "body": "Quote from: Die_empty on September 03, 2023, 04:07:53 PMQuote from: Z-tight on September 03, 2023, 03:01:17 PMThis statistics is BS, Turkey is a country of over 85m people, and you ask just 500 people what their opinion of crypto is, and you use that to draw conclusion that half of the people in Turkey now own crypto. Kucoin are probably doing this to atract attention to themselves, it has to be some sort of marketing strategy.It is difficult to get statistics on the number of people using crypto in a particular region, but this one is a very weak attempt that does not in anyway paint the actual picture, Kucoin is just picking numbers out of a hat and making an exaggerated conclusion.A sample of 500 people will not in any way represent the entire Turkish population. They also didn't state the demographic spread of the respondent and there was no data analysis method. Adoption of cryptocurrencies will be very high in Turkey due to the fall of the lira and the high literacy rate in Turkey but 52% is a mere assumption. Even in the US where there is high crypto awareness and the presence of many notable crypto-related firms, a report claims that only 21% of adults in the US own cryptocurrencies as of last year. Maybe Kucoin has other intentions for this statistical hype.It's also good that we encourage others in bitcoin adoption but bot as when we are not true about the actual fact of the situation on ground, Turkey is a country with less population compared to some other developed countries, not only that, we look at the religious beliefs and their population statistics as an overall assessment while looking into the case of present situation, the population is far lower to in terms of bitcoin adoption and yet among these bitcoin users lies some who are into other cryptocurrencies together with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "September 03, 2023, 06:07:48 PM",
      "body": "It makes sense now, it's just a research survey. I was actually confused that how can this number be the actual number of Crypto Investors as Turkey has a population of 85 million, that means according to them, approx 43 million people are using Crypto. This number can't be real at all. I mean what a way to sell their news and make it a clickbait, good job Decrypt team. I mean by this logic, there are more than 700 million people already using Crypto if follow this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "September 03, 2023, 06:15:17 PM",
      "body": "Quote from: Z-tight on September 03, 2023, 03:01:17 PMThis statistics is BS, Turkey is a country of over 85m people, and you ask just 500 people what their opinion of crypto is, and you use that to draw conclusion that half of the people in Turkey now own crypto. Kucoin are probably doing this to attract attention to themselves, it has to be some sort of marketing strategy.It is difficult to get statistics on the number of people using crypto in a particular region, but this one is a very weak attempt that does not in anyway paint the actual picture, Kucoin is just picking numbers out of a hat and making an exaggerated conclusion.The point for Kucoin to overhype the number of people who have adopted bitcoins in the country  is to draw attention to their exchange among the citizen of the country who are still yet to adopt bitcoins for them to know that they are being left behind by their fellow citizens. The current population of Turkey is 85,893,889 as of Sunday, September 3, 2023 reference. Half of the population is 42,946,944, and that is a lot still. I do not believe the report. They would have said that the number of people who own crypto is now getting closer to half of the entire population, not half already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 03, 2023, 06:18:03 PM",
      "body": "Everyone calling is bs?It's elephant combined with dino combined with Godzilla s****!QuoteThe percentage of crypto investors among the Turkish population aged 18 to 60 has increased by 12% in the last 18 months, rising from 40% in November 2021 to 52% in May 2023, despite the market condition.By 2025 we're going to have 102% of the population owning crypto!Quote from: DdmrDdmr on September 03, 2023, 04:51:43 PMThis latter factor is the key, and I’m not really convinced that it is met. The 1058 Turkish adults were selected using SurveyMonkey Audience (as per their own description). SurveyMonkey allows one to conduct a survey using their panel data (for a cost). The people that conform the panel are generally volunteers that get paid to fill in a survey when contacted to do so (see https://paidfromsurveys.com/surveymonkey-rewards-review# for example). This creates a first stage of potential bias, as the abstact profile is that of those with a certain technological degree of knowledge, willing to do stuff (i.e. surveys) online. I love how DdmrDdmr probably spent more time on digging data for his reply than the guys doing the survey!So, the bais strats from here:QuoteTurkey’s internet penetration rate stood at 82.0 percent of the total population at the start of 2022.50% of  82% that might have been able to take the survey is not 50, it's 40, let's further trim that down to the ones that are not only using it for whatsapp or texting? Should we also add a few 1-3% that think they own crypto when instead they've invested in a Ponzi scheme or cloud mining scam?But raw numbers only, it's a bit ridiculous, it would mean 52 million people owning crypto, all this while we have 40,726,369 addresses with more than $1 worth of Bitcoin in the whole chain. Even if we quadruple that by adding eth or other shitcoins, it's still ridiculous.Quote from: bittraffic on September 03, 2023, 03:33:43 PMMuslims afaik are not very friendly to crypto, I remember there are a few threads about it in this forum itself and Turkey's population is more than 90% Muslim. Muslims in Turkey are not all Taliban-style Muslims, judging a whole population by the predominant religion is the bulletproof way to get it wrong, Congo, Romania, and Brazil all have more than 90% Christians, what else do they have in common?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}