{
  "id": "topic_5422488",
  "title": "onko",
  "author": "onko",
  "created_time": "November 21, 2022, 05:08:58 PM",
  "content": "Arkadaşlar selamlar, herkese sağlıklı haftalar.Aramızda bilgisi olan, daha önce benzer durumla karşılaşmış olan veya bu konularda bilgi sahibi olabilecek bir tanıdığı olan arkadaşımız var diye sizlerden benim için önemli bir konu hakkında fikir almak istiyorum. Yardımcı olabilecek olanlara şimdiden gerçekten çok teşekkürler.İnternet üzerinde biliyorsunuz ki 0532 xxx 1907 tadında özel numaralar, kimisi 5.000₺ kimisi 500.000₺ civarında fiyatlara satılabiliyor. Ben de eski yaptığım işten hala arayan soranlar olduğu için, 15 senelik hattımı değiştirmek istiyorum. Bu yüzden de güzel bir numara alayım, onu kullanırım istedim. Sahibinden com'da bulduğum bir numara için vatandaşla iletişime geçtim, fiyatta anlaştık ve \"uygunsanız bugün gelip devir işlemlerini yapalım ve satın alayım\" dedim. O da uygun olduğunu, ancak Turkcell'de bu satacağı numara değil de, farklı bir kıytırık numaradan dolayı kara listeye alındığını, diğer hatlarından da işlem yapabilmesi için Turkcell'e dilekçe göndermesi gerektiğini belirtti (kontörlü hat'a kontör yüklemeyince hat kapanır ve 250₺ karşılığında bir sene içerisinde tekrar aktif edilebilir bunu ben de yaşadım. Bu hat kontörlüde bekliyormuş ve kontör yüklemeyi unuttuğundan dolayı hattı tekrar aktif etmek için bile dilekçe verip öyle açtırdım dedi). Bu sabah \"dilekçeyi Turkcell'e gönderdim, bir iki güne dönüş yapıyorlar genelde\" dedi, ben de \"o zaman hazır olunca siz haber verirsiniz\" diyerek sohbeti kapayıp beklemeye geçtim. Şimdi olayla ilgili kritik noktalar şu şekilde;- Hattın ona ait olduğunu gösteren e-devlet ekran görüntülerini benimle paylaştı.- Bu hat adına daha öncesinde yapacağı işlemler için gönderdiği dilekçeyi de, Turkcell'den gelen yanıtın da ekran görüntülerini iletti.- \"İstersen farklı bir operatöre hattı taşıyıp oradan da devir yapabiliriz\" diye belirtti.- Birkaç tane TİM sahibi arkadaşımla görüştüğümde; hat sahibi kara listedeyse zaten hattı farklı operatöre devredemez, devir oluyor ise sorun yaşamazsın diye belirtti. Çünkü Turkcell'e gidip sen hattı devir alıp ödemeyi adama yapsan da, ilerleyen dönemde \"bu numaranın eski sahibi hat ticareti yapıyor, bu da aynı şekilde\" diyerek aldığın hattı da bloke edebilirler, paran da yanar diye uyardı.- Kısacası, \"hocam senin içine nasıl rahat yatacak ise o şekilde ilerleyelim ben hepsine uygunum, yeter ki alırken için rahat olsun\" diyerek benim yönlendirmeme de izin verdi.Şimdi olayın çerçevesi bu şekildeyken, benzer durumla karşılaşan kimse var mı aramızda acaba? Hattı güvenli bir şekilde alabilmem mümkün mü ve mümkünse nasıl bir yol izlemeliyim? Farklı operatörlere aktarıp oradan satın alsam, Turkcell'de kara listede olması farklı operatörlerden devir aldığım hattı ileride etkiler mi?PS: \"Başka hat mı yok, iptir et başka bak\" tavsiyesi lütfen vermeyin dostlar  Almak istediğim hat bu ve sadece parayı kaptırıp sorun yaşamamak için nasıl bir yol izlemeliyim onu bilmiyorum ve fikirleriniz önemli olabilir. Bu tarz numaraları alıp satan arkadaşlar da genelde bu numara piyasalarını bildikleri için \"abi o numara mimli zaten, hiç bulaşma\" veya \"iyi fiyata vermiş, kaçırma o hat temiz adam dolandırıcı değil\" de diyebilir gibime geliyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422488",
  "comments": [
    {
      "author": "meser#",
      "created_time": "November 21, 2022, 05:57:47 PM",
      "body": "Kara listeye alınma sebebi sadece hatta kontör yüklememe sebebi pek mantıklı gelmiyor açıkcası bana hocam. Onu geçtim birşekilde paçayı ele verip hat iptaline gidilmesi durumu çok kötü olacaktır. Nitekim 15 sene sonra o güzelim numarayı alıp çevrenize dağıttığınızda ve 3-5 gün sonra ulaşılamadığında fiyakayı çizdirmiş gibi olacaksınızdır. Birde şöyle bir durum var birçok bayi özel numara satışı yapıyor. Hatta bazıları bu özel ve güzel numaraları ellerinde tutarak camlarında reklamını yapıyor. Sırf bayi olmaları bu hakkı veriyorken diğerlerine neden yasal bir işlem hakkı tanınıyor? Böyle düşününce hat ticareti yapan kişiye bir işlem yapılması da gerekir yani sizin hat ticareti yapacak sayıda adınıza kayıtlı hat olmazsa böyle bir durumda dava ederek hem numarayı geri alabilir hemde tarafınıza yapılan hat ticareti yapıyor addetmesine bağlı olarak tazminatta alabilirsiniz. Açıkçası arkadaşın söylemleri bana birazcık dolandırıcılık eylemi gibi geldi tabi size gösterdiklerini resim olarak attıysa bu kanı yı daha da güçlendirecektir nitekim photoshopla değiştirerek göstermiş olabilir. Açıkcası sizin yerinizde olsaydım böyle bir ticarete devam etmezdim. Birçok yeni hat alımında gsm operatör bayileri numara seçmenize yardımcı olabilmekte bundan ötürü oralarda bir şansımı denerdim. Bunların dışında camında özel numara satışı yaptığını belirten gsm bayilerine de danışmanız en akılcı sonucu verecektir nitekim onlar her gün bu tarz işlerin içerisindedir. Bu eylemin kötüye kullanılması gibi bir durum kulaktan kulağa oyunu gibi kendi aralarında dolanacaktır ve bilgi sahibi olacaklardır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onko",
      "created_time": "November 21, 2022, 06:13:31 PM",
      "body": "Quote from: meser# on November 21, 2022, 05:57:47 PMKara listeye alınma sebebi sadece hatta kontör yüklememe sebebi pek mantıklı gelmiyor açıkcası bana hocam. Onu geçtim birşekilde paçayı ele verip hat iptaline gidilmesi durumu çok kötü olacaktır. Nitekim 15 sene sonra o güzelim numarayı alıp çevrenize dağıttığınızda ve 3-5 gün sonra ulaşılamadığında fiyakayı çizdirmiş gibi olacaksınızdır. Birde şöyle bir durum var birçok bayi özel numara satışı yapıyor. Hatta bazıları bu özel ve güzel numaraları ellerinde tutarak camlarında reklamını yapıyor. Sırf bayi olmaları bu hakkı veriyorken diğerlerine neden yasal bir işlem hakkı tanınıyor? Böyle düşününce hat ticareti yapan kişiye bir işlem yapılması da gerekir yani sizin hat ticareti yapacak sayıda adınıza kayıtlı hat olmazsa böyle bir durumda dava ederek hem numarayı geri alabilir hemde tarafınıza yapılan hat ticareti yapıyor addetmesine bağlı olarak tazminatta alabilirsiniz. Açıkçası arkadaşın söylemleri bana birazcık dolandırıcılık eylemi gibi geldi tabi size gösterdiklerini resim olarak attıysa bu kanı yı daha da güçlendirecektir nitekim photoshopla değiştirerek göstermiş olabilir. Açıkcası sizin yerinizde olsaydım böyle bir ticarete devam etmezdim. Birçok yeni hat alımında gsm operatör bayileri numara seçmenize yardımcı olabilmekte bundan ötürü oralarda bir şansımı denerdim. Bunların dışında camında özel numara satışı yaptığını belirten gsm bayilerine de danışmanız en akılcı sonucu verecektir nitekim onlar her gün bu tarz işlerin içerisindedir. Bu eylemin kötüye kullanılması gibi bir durum kulaktan kulağa oyunu gibi kendi aralarında dolanacaktır ve bilgi sahibi olacaklardır. Meser hocam çok teşekkürler yorumunuz için. kara listeye alınma sebebi kontör değil, yıllar önce ailesinden ona devredilen bir hat ve onun borçlarını ödememe yüzünden olduğunu söyledi. Bir sene boyunca kontör yüklenmeyen hatlar (benim de eski hattımı boşta bekletmek için kontörlüye çevirip kenarda tutmuşluğum vardı) iptal oluyor ve sizden çıkıyor. Ve tekrar geri almak için bir sene içerisinde Turkcell'e gidip 250₺ ödeyerek açtırıyorsunuz, bu olayı ben şahsen yaşadım. O da aynı konu için \"gitmeme rağmen kara listede olduğum için onu bile açtırmadılar, yine dilekçe yazıp o şekilde geri alabildim\" dedi. Yani kara liste olayı yüzünden bu arkadaşın Turkcell hatlarıyla ilgili işlemlerinin çoğu kısıtlanmış durumda bahsettiğine göre.Dediklerinize katılıyorum ayrıca, muhtemelen bu vatandaş da özel numara kovalayıp hat satan birisi. Defalarca yapmışsa da Turkcell kara listeye almış olabilir (öyle ailevi bir sorundan dolayı borçlardan karar listeye alınmış olması bana da inandırıcı gelmedi). Ancak dediğim gibi numaraya gerçekten sahip olmak istiyorum, sadece sonrasında Turkcell otomatik bloke etmesin ya da bu vatandaşın \"benim kimliğim ile hattı devretmişler haberim yoktu\" deyip dava falan açmasından çekiniyorum.Bayilere de gidince sıfır güzel numaralı hatları zaten amerika vizesi alır gibi alıyorsunuz. \"6161 vereyim kardeşim sana 48.000'e bırakırız, sonu 0000 var özel biraz o da 90.000₺ olur, garantisi benim kardeşim\" modunda geçiyor sohbetler. Özellikle araplar burada da piyasayı saçma sapan hale getirmişler. Bir milyona, yüzlerce bin liralara satılan o kadar numara gördüm/duydum ki bu araştırmaları yaparken, ev fiyatları gibi telefon numara fiyatlarını da yükseltmişler ne yazık ki.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 21, 2022, 06:23:08 PM",
      "body": "Quote from: onko on November 21, 2022, 06:13:31 PMQuote from: meser# on November 21, 2022, 05:57:47 PMKara listeye alınma sebebi sadece hatta kontör yüklememe sebebi pek mantıklı gelmiyor açıkcası bana hocam. Onu geçtim birşekilde paçayı ele verip hat iptaline gidilmesi durumu çok kötü olacaktır. Nitekim 15 sene sonra o güzelim numarayı alıp çevrenize dağıttığınızda ve 3-5 gün sonra ulaşılamadığında fiyakayı çizdirmiş gibi olacaksınızdır. Birde şöyle bir durum var birçok bayi özel numara satışı yapıyor. Hatta bazıları bu özel ve güzel numaraları ellerinde tutarak camlarında reklamını yapıyor. Sırf bayi olmaları bu hakkı veriyorken diğerlerine neden yasal bir işlem hakkı tanınıyor? Böyle düşününce hat ticareti yapan kişiye bir işlem yapılması da gerekir yani sizin hat ticareti yapacak sayıda adınıza kayıtlı hat olmazsa böyle bir durumda dava ederek hem numarayı geri alabilir hemde tarafınıza yapılan hat ticareti yapıyor addetmesine bağlı olarak tazminatta alabilirsiniz. Açıkçası arkadaşın söylemleri bana birazcık dolandırıcılık eylemi gibi geldi tabi size gösterdiklerini resim olarak attıysa bu kanı yı daha da güçlendirecektir nitekim photoshopla değiştirerek göstermiş olabilir. Açıkcası sizin yerinizde olsaydım böyle bir ticarete devam etmezdim. Birçok yeni hat alımında gsm operatör bayileri numara seçmenize yardımcı olabilmekte bundan ötürü oralarda bir şansımı denerdim. Bunların dışında camında özel numara satışı yaptığını belirten gsm bayilerine de danışmanız en akılcı sonucu verecektir nitekim onlar her gün bu tarz işlerin içerisindedir. Bu eylemin kötüye kullanılması gibi bir durum kulaktan kulağa oyunu gibi kendi aralarında dolanacaktır ve bilgi sahibi olacaklardır. Meser hocam çok teşekkürler yorumunuz için. kara listeye alınma sebebi kontör değil, yıllar önce ailesinden ona devredilen bir hat ve onun borçlarını ödememe yüzünden olduğunu söyledi. Bir sene boyunca kontör yüklenmeyen hatlar (benim de eski hattımı boşta bekletmek için kontörlüye çevirip kenarda tutmuşluğum vardı) iptal oluyor ve sizden çıkıyor. Ve tekrar geri almak için bir sene içerisinde Turkcell'e gidip 250₺ ödeyerek açtırıyorsunuz, bu olayı ben şahsen yaşadım. O da aynı konu için \"gitmeme rağmen kara listede olduğum için onu bile açtırmadılar, yine dilekçe yazıp o şekilde geri alabildim\" dedi. Yani kara liste olayı yüzünden bu arkadaşın Turkcell hatlarıyla ilgili işlemlerinin çoğu kısıtlanmış durumda bahsettiğine göre.Dediklerinize katılıyorum ayrıca, muhtemelen bu vatandaş da özel numara kovalayıp hat satan birisi. Defalarca yapmışsa da Turkcell kara listeye almış olabilir (öyle ailevi bir sorundan dolayı borçlardan karar listeye alınmış olması bana da inandırıcı gelmedi). Ancak dediğim gibi numaraya gerçekten sahip olmak istiyorum, sadece sonrasında Turkcell otomatik bloke etmesin ya da bu vatandaşın \"benim kimliğim ile hattı devretmişler haberim yoktu\" deyip dava falan açmasından çekiniyorum.Bayilere de gidince sıfır güzel numaralı hatları zaten amerika vizesi alır gibi alıyorsunuz. \"6161 vereyim kardeşim sana 48.000'e bırakırız, sonu 0000 var özel biraz o da 90.000₺ olur, garantisi benim kardeşim\" modunda geçiyor sohbetler. Özellikle araplar burada da piyasayı saçma sapan hale getirmişler. Bir milyona, yüzlerce bin liralara satılan o kadar numara gördüm/duydum bu araştırmaları yaparken, ev fiyatları gibi telefon numara fiyatlarını da yükseltmişler ne yazık ki.O zaman geriye noter huzurunda devretmek kalır hocam aranızda devir sözleşmesi de yapın ve deyin devir sonrası oluşabilecek her türlü hukuki sorundan satıcı X kişisi mesuldür  Şakası bir yana hattın devredilebilir hale geldiği noktaya kadar bekleyin hatırlatmama gerek yok ancak kapora mapora falan kaptırmazsınız hat numarası ne kadar güzel olursa olsun  Onun dışında kendi aranızda hat devrine dair bir sözleşme hazırlayın kesinlikle ve bu el yazısı ile olsun içeriği belirleyin ve iki nüsha olsun sizde kalacak olan nüshayı o el yazısı ile yazsın onda kalacak olanı da siz yazın. Bu imzaları atarkende videoya kayıt almak istediğinizi belirtin nedeni sorarsa da benim kimliğim ile hattı devretmişler haberim yoktu\" deyip dava falan açmasından çekindiğinizi belirtin. Bunun dışında size gösterdiği evrakları resim olarak değil ekran kaydı olarak sorgulamasıyla kaydedip göndersin. Ögeyi denetle ya da photoshop çakallığından kurtulmuş olursunuz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onko",
      "created_time": "November 21, 2022, 07:14:38 PM",
      "body": "Quote from: meser# on November 21, 2022, 06:23:08 PMO zaman geriye noter huzurunda devretmek kalır hocam aranızda devir sözleşmesi de yapın ve deyin devir sonrası oluşabilecek her türlü hukuki sorundan satıcı X kişisi mesuldür  Şakası bir yana hattın devredilebilir hale geldiği noktaya kadar bekleyin hatırlatmama gerek yok ancak kapora mapora falan kaptırmazsınız hat numarası ne kadar güzel olursa olsun  Onun dışında kendi aranızda hat devrine dair bir sözleşme hazırlayın kesinlikle ve bu el yazısı ile olsun içeriği belirleyin ve iki nüsha olsun sizde kalacak olan nüshayı o el yazısı ile yazsın onda kalacak olanı da siz yazın. Bu imzaları atarkende videoya kayıt almak istediğinizi belirtin nedeni sorarsa da benim kimliğim ile hattı devretmişler haberim yoktu\" deyip dava falan açmasından çekindiğinizi belirtin. Bunun dışında size gösterdiği evrakları resim olarak değil ekran kaydı olarak sorgulamasıyla kaydedip göndersin. Ögeyi denetle ya da photoshop çakallığından kurtulmuş olursunuz. Teşekkür ettim hocam, bunun hukuki açıdan ilerleyen süreçte doğabilecek olan olumsuz sonuçlarda ne kadar etkili olabileceğini avukat bir arkadaşım ile tartışayım ben en iyisi. Yorumlar için ayrıca teşekkürler!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}