{
  "id": "topic_5415186",
  "title": "romero121",
  "author": "romero121",
  "created_time": "September 28, 2022, 08:12:24 AM",
  "content": "Guys down to the official tweet from Vitalik about the release of his Book Proof Of Stake there is a scam account that resembles same as Vitalik's official Twitter account. If you watch closely you can easily find the difference. The scammer have described about a 100,000 ETH as a celebration of merge. Please be careful and don't loss your ethereum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415186",
  "comments": [
    {
      "author": "Kemarit",
      "created_time": "September 28, 2022, 08:34:43 AM",
      "body": "Thanks, I haven't check this one out yet but we all know that this scammers are going to used this one. And it just make sense of this criminals to take advantage because ETH and Vitalik is on the social media and other news because of the ETH Merge.And hopefully no gullible crypto enthusiast will fall for this. We've seen a lot of fake giveaways from Elon Musk during his height as a so called crypto influencer to Vitalik today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 28, 2022, 09:31:09 AM",
      "body": "I don't know if it's a bot or real users, but they're replying the scammer tweet like it's genuine lol. Actually it's already clear the difference is from their twitter username, smart people wouldn't get trapped by this particular scam.I search @rolmeda real name is Rafael Olmeda, who is him? if his account doesn't get hacked, I think he will go to the jail if there's many report created and the police obviously can get his personal information considering social media have low privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "September 28, 2022, 09:36:45 AM",
      "body": "I think this is a common thing where many verified Twitter accounts are hacked and turned into vitalik.buterin accounts to create fake giveaways with 100,000 ETH to be distributed, this is very illogical and how can there be a giveaway of that size, but somehow scammers have to stay alert for any scams, whereas verified accounts usually have a lot of followers so the target of scammers is their followers who don't know anything and try to do it, that's what we need to realize that it's all a scam.There is one thread from @ajiz138 about scams with verified Twitter. Fake Giveaway Ethereum: by using the blue tick (verification) on his Twitter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 28, 2022, 11:01:48 AM",
      "body": "Blue tag is really a mess especially the one who handle it is a professional scammer. Maybe twitter should be attentive on users who are impersonating some popular users like Vitalik cause this can harm investors money through such post. Also I cant be fool with such followers like that. Vitalik has million followers and this one is not. Better to restrict accounts caught imitating or copying others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 29, 2022, 02:08:29 PM",
      "body": "I am sorry but this is such an easy thing to see that if you are still falling for it, maybe you need to fall for it to learn better? At the end of the day I have never got fooled by these before, but let's assume I could back in the day when they first started, but now?Now, we are talking about something that is insanely common and people are still falling for it, this is known now and it is common enough that even newbies know about it, and you still feel like it could be real? In that case you should be staying away from it. Back in the day, they would even get names close to Vitalik as well, nowadays their username is totally different at least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "September 29, 2022, 02:39:47 PM",
      "body": "People like him is the reason why Vitalik has changed his name before like \"not giving ethereum\" sort of like that name.It's too sad that there are still people that fall for this scam.They don't hover through the details on only sees the number. Well, these people will learn the lesson the hard way if they don't improve themselves like reading the very simple hint that it's a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "September 29, 2022, 04:23:01 PM",
      "body": "Oh yeah this scam, nothing new. In fact I’m so used to it that if someday Real vitalik publishes such giveaway then also I won’t believe it.   It’s like I have switched on ignore butting for 100,000 ETH on the Twitter. There is no point in believing in such stuff and I am sadden if anyone or even a noob is falling for such trap. First thing first, this is internet world where nobody sees no one and it’s literally net of trap! If there is any positive news, like even if some celebrity is giving birth then these scammers will turn that news into profit making machine. By the time scams are exposed many people get scammed. Better self learn and keep teaching others to stay away from these.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "September 29, 2022, 04:50:29 PMLast edit: October 10, 2022, 08:09:48 PM by usekevin",
      "body": "It’s seems to be hacked twitter account of the vitalik.The give away must be scam to get some money from the bounty hunters.Now a days many twitter accounts was get hacked and sold among the investors.Some fake company investing in this fake and hacked accounts ,to scam other bounty hunters.You made a good initiative of sharing the good information.It’s scam way to get other people money by sending little amount send to get the Give away.Why you are get into the trap by the scambugs.Now online platform are tried to scam people very easy with short period of time.Learning is essential one,you can learn from my words.If you don’t want to scam from online,you should have the habit of Listening other words.Then you may skip from the Loss.It was damn sure,it was the scam thread.So don’t get try of even one dollars on this.1$ is enough to eat for a lunch in many countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "September 29, 2022, 04:55:17 PM",
      "body": "I was honestly baited on the photo on my first glance, I just noticed the username because of the red box. Scammers are improving nowadays and they seem using blue check accounts to imitate others. This is like an upgraded version of the twitter Elon Musk copycat scams that are doing the same thing which is giveaways. I'm not fond of joining these kind of too good to be true offers in social media but I'm sure someone can possibly fall in the scammers hand by just having these blue checks on their username.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "September 29, 2022, 05:40:08 PM",
      "body": "Quote from: Jawhead999 on September 28, 2022, 09:31:09 AMsmart people wouldn't get trapped by this particular scam.Doesn't mean, everyone are not gonna falling to scam.Did you know, 90% Of CryptoCurrency User is Newbie while the 10% is someone who already aware about Crypto. Comparing to that, we still have many user who don't know how to protect and etc.Nothing wrong to warning people, however the scammer now is cleaver using \"Verified\" account to Impersonate. Makes success scam chance more higher",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 29, 2022, 05:54:31 PM",
      "body": "Quote from: $crypto$ on September 28, 2022, 09:36:45 AMI think this is a common thing where many verified Twitter accounts are hacked and turned into vitalik.buterin accounts to create fake giveaways with 100,000 ETH to be distributed, this is very illogical and how can there be a giveaway of that size, but somehow scammers have to stay alert for any scams, whereas verified accounts usually have a lot of followers so the target of scammers is their followers who don't know anything and try to do it, that's what we need to realize that it's all a scam.There is one thread from @ajiz138 about scams with verified Twitter. Fake Giveaway Ethereum: by using the blue tick (verification) on his TwitterA similar scam on Twitter has recently become widespread. And if you conduct your own research, you can easily establish that this account has been hacked and is being used for fraud. But a beginner, when he sees a free distribution and a photo of Vitalik, does not want to think and as a result loses his money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "September 29, 2022, 06:05:25 PM",
      "body": "Quote from: romero121 on September 28, 2022, 08:12:24 AMGuys down to the official tweet from Vitalik about the release of his Book Proof Of Stake there is a scam account that resembles same as Vitalik's official Twitter account. If you watch closely you can easily find the difference. The scammer have described about a 100,000 ETH as a celebration of merge. Please be careful and don't loss your ethereum.Well thanks for the warning OP. I think though that this warning is mostly relevant for people that are pretty new to the crypto space, because everyone else that has at least a few weeks of experience in this space knows already that the crypto world is full of scammers and shillers. You always need to check the account name on twitter as you have outlined and this is not only true for twitter but also for telegram. People can choose the display name that they like and there can be thousands of the same nickname at the same time, but your account name has to be unique. Always be careful guys and never give away your private key to anyone and never connect your wallet to a linked website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samuraijin",
      "created_time": "September 29, 2022, 07:38:01 PM",
      "body": "not only on twitter but even on facebook this kind of fraud still works, their way of working is like bots that work automatically when the targeted account makes a tweet or post, they immediately come to share the information and link, right now i see these scammers active on telegram also i think they are still doing this do they often succeed in deceiving people, so they continue to be eager to improve their working skills everywhere every day, maybe some people also already know they are scammers, but whatever it is it is very important you make this thread so beginners can avoid this kind of scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 29, 2022, 08:46:43 PM",
      "body": "Quote from: romero121 on September 28, 2022, 08:12:24 AMGuys down to the official tweet from Vitalik about the release of his Book Proof Of Stake there is a scam account that resembles same as Vitalik's official Twitter account. If you watch closely you can easily find the difference. The scammer have described about a 100,000 ETH as a celebration of merge. Please be careful and don't loss your ethereum.Every giveaway, especially if its a big amount should be checked and double-checked, we have seen this happens so many times on Youtube, on Telegram and every time there's a big event, whenever there are big events or big news expect a big manipulation and imitation by scammers, this is not 2012 where developers can be so generous airdropping their own tokens, especially if the token already has values, the Cryptocurrency industry is a place where you should always do diligence and moderating your greed, forget about FOMO do the right thing, research and research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "September 29, 2022, 09:01:16 PM",
      "body": "I see this a lot while treading in Twitter. It also happens in Facebook wherein an official news article page would post then a fake clone of the page would comment out. If the page would do giveaways anyways, they could just do it in another post. When I see a supposed official page comment out on their own post, I sometimes get a lot suspicious from it and I never click any sort of links from the comment for obvious purposes let alone if Telegram link was given, lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 29, 2022, 09:19:26 PM",
      "body": "Quote from: isaac_clarke22 on September 29, 2022, 09:01:16 PMI see this a lot while treading in Twitter. It also happens in Facebook wherein an official news article page would post then a fake clone of the page would comment out. If the page would do giveaways anyways, they could just do it in another post. When I see a supposed official page comment out on their own post, I sometimes get a lot suspicious from it and I never click any sort of links from the comment for obvious purposes let alone if Telegram link was given, lol.This happened already before and this is not new though scammer account now are already verified which is too alarming especially if newbies will see such offer. I never become a victim of this since I don’t believe that they will double your money if you send some to them, that’s an old trick that we should always be careful to deal with. Not an official twitter account, not an official announcement then it’s a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 29, 2022, 11:32:47 PM",
      "body": "Impersonating is rampant in every social media platform, and anyone falling for this obvious scam must learn how to read and differentiate things.  They should also play the game called spot the differences in order to heighten their observation ability.Quote from: ryzaadit on September 29, 2022, 05:40:08 PMQuote from: Jawhead999 on September 28, 2022, 09:31:09 AMsmart people wouldn't get trapped by this particular scam.Doesn't mean, everyone are not gonna falling to scam.Did you know, 90% Of CryptoCurrency User is Newbie while the 10% is someone who already aware about Crypto. Comparing to that, we still have many user who don't know how to protect and etc.Nothing wrong to warning people, however the scammer now is cleaver using \"Verified\" account to Impersonate. Makes success scam chance more higherTrue, even though this kind of scam is too obvious, many people still fall for this kind of scam, reason why scammers continuously use this scheme to trap people.  Many of them are newbies who are blinded by greed and in a haste to take the chance to get in on the fake airdrop.Quote from: abel1337 on September 29, 2022, 04:55:17 PMI was honestly baited on the photo on my first glance, I just noticed the username because of the red box. Scammers are improving nowadays and they seem using blue check accounts to imitate others. This is like an upgraded version of the twitter Elon Musk copycat scams that are doing the same thing which is giveaways. I'm not fond of joining these kind of too good to be true offers in social media but I'm sure someone can possibly fall in the scammers hand by just having these blue checks on their username. Scammers are performing better than the actual project's marketing scheme.  They are far more observant in the market and tend to exploit anything that will bait people into their scammy schemes.  These scammers are also well versed on how the crypto works and mimic them in order to bait unwary and naive newbie investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "September 29, 2022, 11:52:54 PM",
      "body": "I don't know but are there really people that will be believed in this shit?Even newbies can use their common sense to sense that this kind of promotion is not a legit one. I don't find being a newbie is a reason to fall into this trap.Newbies are not that dumb. They can understand the difference between shit and not even though they are new to the crypto world. Maybe people are just greedy and honestly, even experienced ones are risking on that giveaway even though they know that's not legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rugrats",
      "created_time": "September 30, 2022, 03:58:25 AM",
      "body": "The best thing is to always be skeptical about all giveaway events, always check them all on social media before joining, don't be too hasty for fear of missing out. Scammers always take advantage of the big events of some famous coins to scam. The people who often fall into the trap are mostly newbies because they lack the knowledge to distinguish what is a scam from what is real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}