{
  "id": "topic_5452820",
  "title": "a298b112",
  "author": "a298b112",
  "created_time": "May 15, 2023, 02:55:45 PM",
  "content": "For some reason, maybe I just don't know why, lately I see very low trading volume for BTC in Binance. I've quickly checked other exchanges, they are also do not have more volume comparing let's say 1.5 month ago. So why do you think volume is so lo and what does it mean for the market? Is there more and more people hodling or something else going on there?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452820",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "May 15, 2023, 06:02:16 PM",
      "body": "No one knows why trading volume is pretty low but I think it's because no news could influence traders to buy or sell and I don't see any events that could impact the trading volume.Or maybe it's due to recent events mothers Day and pizza day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 15, 2023, 06:18:01 PM",
      "body": "There could be many factors to think of but one of it is that it's possible that the typical traders are just quite off and don't want to trade lately. Like it's better not to trade at all at these times and will just wait for what's going to happen for Bitcoin.No one will actually ever know the main reason why volumes have gone low lately. But, it's not going to be the same as that, just like people that are in the business. Sometimes, it's a good time and sometimes it's seen that the market is slack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 15, 2023, 07:34:40 PM",
      "body": "Quote from: a298b112 on May 15, 2023, 02:55:45 PMFor some reason, maybe I just don't know why, lately I see very low trading volume for BTC in Binance. I've quickly checked other exchanges, they are also do not have more volume comparing let's say 1.5 month ago. So why do you think volume is so lo and what does it mean for the market? Is there more and more people hodling or something else going on there?Dear op, have you not heard about the Ordinal problem that has caused many transactions to wait for so long even with the high fees? This has discouraged transaction makers to avoid making transactions in BTC even i have read a topic on this platform where a member shared his story of \"How he stopped accepting payment in BTC due to a High fee problem\". If you are not familiar with this issue then i recommend you to read this topic which might clear things up for you. -->\"Why BTC Transactions Fees are Skyrocketing? \".Like, the fee for one transaction has reached around 32$ which is unbearable for every sector that was accepting BTC as payment or sending salaries in BTC. As this problem is slower than before so we might see more volume in the coming days. If this ordinal problem again congested the Meme pool then it might decrease the trading volume of BTC. This will again affect the price of BTC and there is one more positive way to take it all as good, which is, when those airdrop hunters (investing a hell lot of money in these BRC-20 tokens) will face the consequences of losing money then those who made a hell lot of money by selling these BRC-20 tokens will definitely going to buy BTC again and this will again boost the trading volume of it and you will be happy again. Quote from: greengrassis on May 15, 2023, 07:17:57 PMIt seems to me that everyone has their own point of view on this situation. Trading is designed for that, in fact. At one moment one point of view is triggered, at another moment another.This is not a hallucination this is facts and everyone will say the same as OP said when they will see the numbers. As trading volume is really decreased due to the fee problem and this fee problem caused Binance to cease withdrawals for temporarily in the past few days (i don't remember the exact date now but you will definitely find some news on it).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "May 15, 2023, 08:38:17 PM",
      "body": "When there are large trading volumes on the market, this tells us that the price of the coin is more fair.If the price is not confirmed by trading volume, then  then we will see either a bearish trend with an increase in trading volume, or a bullish trend with an increase in volumes.Fees on the Bitcoin blockchain have already declined and therefore BRC-20 tokens should not have a strong impact on trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "May 15, 2023, 08:50:12 PM",
      "body": "Could it be because Binance paused withdrawals? They have been doing this on and off and updating for their LN integration AFAIK.It could also be because of the high transaction fee which we have been avoiding to send BTC as well. Or the market is really displaying the data where BTC is now less and less being traded as more holders and keeping on private wallets. Yup many investors seem to be preparing for their halving and they are hodling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "May 15, 2023, 09:22:25 PM",
      "body": "Quote from: a298b112 on May 15, 2023, 02:55:45 PMFor some reason, maybe I just don't know why, lately I see very low trading volume for BTC in Binance. --I've quickly checked other exchanges, they are also do not have more volume comparing let's say 1.5 month ago. So why do you think volume is so lo and what does it mean for the market? Is there more and more people hodling or something else going on there?There's no way on knowing on whats the actual reason on why we do have this kind of low volume and it would really be giving out some significant possible event just because we've seen it.Just like on what others been saying above that it might really just that buyers and sellers doesnt really like to trade up or make out some activity on that particular time. Does it meanbearish or bullish? There's no way on knowing that on where it would be going.This is some article saying about Trading volume. This is an old link or article but somewhat significant for you to look athttps://www.rediff.com/money/special/trading-volume-what-it-reveals-about-the-market/20090703.htmIt would be pertaining into some market strength and taking up some actions according to the current volume that we are seeing might be low but potentially could be having some breakout.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "May 15, 2023, 09:57:15 PM",
      "body": "There are things I notice in trading that there is a high value but a low volume that is obtained every day in the market and there is also a low coin value but a very high volume every day.      It just means that it is difficult to take the risk to trade with low volume or liquidity because there are very few buyers and sellers in that coin. Because the aggressive movement of a coin is an advantage over this low volume practically speaking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "May 15, 2023, 10:45:01 PM",
      "body": "Quote from: a298b112 on May 15, 2023, 02:55:45 PMSo why do you think volume is so lo and what does it mean for the market? Is there more and more people hodling or something else going on there?Well, if at all there is a low trading volume for bitcoin at the moment, I personally do not see it as something to be concerned about, bitcoin as well as the entire crypto currency space is still relatively young,  the market is still growing and I believe there are time volume must be low, simply because it's not the whole world trading the bitcoin market, Infact, we currently have less than 10% of the entire world population in crypto today, so low trading volume at this essential time the market is still growing is absolutely nothing to worry about..And again, another reason could be that investor are buying and holding bitcoin in anticipation of a bull market next year, as we all know that bitcoin halving is very close already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 16, 2023, 12:51:58 AM",
      "body": "Quote from: a298b112 on May 15, 2023, 02:55:45 PMFor some reason, maybe I just don't know why, lately I see very low trading volume for BTC in Binance. It means the market is lack of fuel for its movements. Whales tend to close their positions, close their positions and have yet opened new positions. Retail investors, traders are uncertain, not yet greed but is in panic mood that the market will be dumped soon. Together they combined and made a low trading volume.It is not a good time for you to trade when a next trend is unclear.However, if you want to DCA, you can consider to accumulate more bitcoin. If price goes lower, you can continue DCA with part of your salary and savings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "May 16, 2023, 03:21:53 AM",
      "body": "One reason I could think of is that the traders don't feel like trading yet and mostly observing each other's movements. Another reason would be the problems of the bitcoin network right now which makes the users of Bitcoin hesitant (if not entirely incapable) of moving their bitcoins form one wallet or one exchange to another. This is a bad thing in my opinion and until this issue about bitcoin gets resolved I think that the volume on every exchange will probably remain on the same levels more or less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 16, 2023, 04:05:20 AM",
      "body": "The volume is low due to a shortage of market makers. Hence why there are more and more spikes and wicks that’s we see everyday.After FTX many went out of business. And it got worse when Silvergate and Signature went down. Then last week Jump trading ended up quitting the business.Hence there is more volatility due to less liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 16, 2023, 04:29:13 AM",
      "body": "I think it's pretty simple: low volume --> fewer people are interested in trading --> the market is likely to be highly more volatile.Low trading volume can't necessarily give you better odds in knowing what direction a certain asset is likely to move towards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "May 16, 2023, 04:41:55 AM",
      "body": "Quote from: safar1980 on May 15, 2023, 08:38:17 PMWhen there are large trading volumes on the market, this tells us that the price of the coin is more fair.If the price is not confirmed by trading volume, then  then we will see either a bearish trend with an increase in trading volume, or a bullish trend with an increase in volumes.Fees on the Bitcoin blockchain have already declined and therefore BRC-20 tokens should not have a strong impact on trading.There are many ways in which we could interpret the low volume for bitcoin, probably one of the most simple explanations we could give is that maybe there is not a lot of interest in trading bitcoin at the moment, and speculators are using their money to trade other coins.If that was the case then we could see this on the charts of other coins as an increase on their volume as well, but if the altcoin market also presented a decrease on their volume this could indicate that people are preferring to hold their coins for the long term, while the traders simply do not find the current conditions attractive to trade at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "May 16, 2023, 08:10:46 AM",
      "body": "In my opinion, there is what we called sessions in trading. In forex, trading sessions are very important because the market volatility is so high and most traders are interested to trade only with sessions. There are traders who only trades london session, and there are also who want New York session only. I believe that these sessions are working with Bitcoin nowadays, because base on my backtest, usually with that sessions the volume were so high. Other than that, whales and market makers are not just buy Bitcoin randomly, they also analyze the market before they invest or trade because they don't want to lose money like us, they're here to earn as well. So if the market is not tradeable for them, they don't trade. And that's why there some hours or days Bitcoin volumes are so low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irhact",
      "created_time": "May 16, 2023, 08:32:49 AM",
      "body": "Quote from: Similificator on May 16, 2023, 03:21:53 AMOne reason I could think of is that the traders don't feel like trading yet and mostly observing each other's movements. Another reason would be the problems of the bitcoin network right now which makes the users of Bitcoin hesitant (if not entirely incapable) of moving their bitcoins form one wallet or one exchange to another.Your first reason should be the reason why we're recording low volume. We're in a bear market and trading activities usually drops massively during this period as traders trading the spot market knows the charts mightn't matter as it's emotions that rules during this period. People sell out of fear of the market dumping immediately they see a dip and buy when they see any small renounced. The Bitcoin high fees shoudn't have cause it because active traders already have their funds on the exchanges that they're using to trade and traders normally keep their profits made in stablecoin so they don't lose if the market dump and they can easily transfer in seconds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "May 16, 2023, 09:28:48 AM",
      "body": "Quote from: a298b112 on May 15, 2023, 02:55:45 PM-snip-So why do you think volume is so lo and what does it mean for the market? Is there more and more people hodling or something else going on there?To find out why and why behind the current low trading volume, if you refer to the demand and supply theory, the market is currently unstable.IMO, it could be caused by the lack of interest of traders to carry out trading activities. It could also be due to the influence of high Bitcoin transaction fees some time ago or it could be because big players are trying to manipulate the market.The fear of losing money in the midst of a market situation where it is not known where it will move can also affect traders in buying and selling activities because they are very careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tmara",
      "created_time": "May 16, 2023, 09:34:38 AM",
      "body": "I'm  certain the interpretation lies mainly on the current market situation, both bulls and bears are totally uncertain on which direction btc would take. Which probably made lots of traders to be on the side line, watching the market rather than trading 🤔",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "May 16, 2023, 11:01:07 AM",
      "body": "Quote from: wxa7115 on May 16, 2023, 04:41:55 AMQuote from: safar1980 on May 15, 2023, 08:38:17 PMWhen there are large trading volumes on the market, this tells us that the price of the coin is more fair.If the price is not confirmed by trading volume, then  then we will see either a bearish trend with an increase in trading volume, or a bullish trend with an increase in volumes.Fees on the Bitcoin blockchain have already declined and therefore BRC-20 tokens should not have a strong impact on trading.There are many ways in which we could interpret the low volume for bitcoin, probably one of the most simple explanations we could give is that maybe there is not a lot of interest in trading bitcoin at the moment, and speculators are using their money to trade other coins.If that was the case then we could see this on the charts of other coins as an increase on their volume as well, but if the altcoin market also presented a decrease on their volume this could indicate that people are preferring to hold their coins for the long term, while the traders simply do not find the current conditions attractive to trade at all.I have no idea how traders stop trading bitcoin and start trading altcoins. But what altcoins do they trade? I don't have any ideas.Maybe traders are waiting for prices to drop and have decided not to trade, but in the altcoin market, I do not see a better situation for trading.If the price of bitcoin falls, then the prices of altcoins will also go down and most likely much more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "May 16, 2023, 03:34:09 PM",
      "body": "Quote from: BitMaxz on May 15, 2023, 06:02:16 PMOr maybe it's due to recent events mothers Day and pizza day.Why will the trading volume decrease on the occasion of International Mother's Day or Pizza Day? A drop in trading volume means a drop in Bitcoin buying and selling. Is this the reason people refrained from buying or selling their bitcoins this month because they only bought two pizzas for 10,000 bitcoins this month?  Now the reason for the decrease in trading volume may be the volatility of the market. Because there is a lot of volatility in the market recently, investors may be holding back their investments at the moment, or another reason may be that many people are holding their bitcoins due to the possibility of a rise in the price of bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}