{
  "id": "topic_5432405",
  "title": "Dzwaafu11",
  "author": "Dzwaafu11",
  "created_time": "December 30, 2022, 04:24:07 PM",
  "content": "I'm new here who have much interest on bitcoin I hope the legendary member will help us the newbie for more discussion about the forum and more on the rules and regulations of the forum",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432405",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "December 31, 2022, 07:10:07 AM",
      "body": "You are welcome to BTT my brother, and I hope you are a Nigerian because this board is dedicated to Nigerians only. And of course, there are many rules guiding the forum that you and any other new members should strictly adhere to. These rules have been guiding my path and doings, and I know you would be just fine with them.In this forum, one thing that should be ringing in your head is 'quality,' if your posts are quality, you would not have any issues here. Mind you, merits and activities are needed for you to rank up in positions. However, with quality posts, you will get your ranks as and when due. So nothing to be worried about. The beginning might not be encouraging though, but with time, you will get acquainted with the community and will be just fine. I started just in July this year, and I am doing fine, so I believe you can too.Without wasting your time, please feel free to check the links below, they should be of help to you.Main rules/guides of the forum (Unofficial): https://bitcointalk.org/index.php?topic=703657.0Ranking up: https://bitcointalk.org/index.php?topic=2818350.0 & https://bitcointalk.org/index.php?topic=178608.msg1861412#msg1861412Merit Statistics: https://bitcointalk.org/index.php?action=merit;statsSpecifically for newbies: https://bitcointalk.org/index.php?topic=1689727.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 31, 2022, 10:55:17 AM",
      "body": "Quote from: Dzwaafu11 on December 30, 2022, 04:24:07 PMI'm new here who have much interest on bitcoin I hope the legendary member will help us the newbie for more discussion about the forum and more on the rules and regulations of the forum This your thread is a nice thread but we already have your content thread so there is no need to have the same thread twice in a board. So I will want you to delete this thread. ,I believed you can read and write, before nyou create a thread, u v 2 read, Brainboss created a thread for that purpose. Naija Novice Hangout {Newbies introduction & Orientation} Thread. delete your thread.Delete this one and make comment there 👆",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}