{
  "id": "topic_5463718",
  "title": "Agbamoni",
  "author": "Agbamoni",
  "created_time": "August 18, 2023, 05:02:21 PM",
  "content": "Bitcoin has captured the center of attention, especially with the younger generations showing keen interest in it. Yet, there are those who believe that teaching older individuals about it might not be a wise investment of time. However, we must ponder: does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463718",
  "comments": [
    {
      "author": "usekevin",
      "created_time": "August 18, 2023, 05:16:56 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PMBitcoin has captured the center of attention, especially with the younger generations showing keen interest in it. Yet, there are those who believe that teaching older individuals about it might not be a wise investment of time. However, we must ponder: does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin. Bitcoin had a capacity to make the poor to rich,So the old people will have a good savings in their old ages.So they can multiple the money by using the cryptocurrency investment.Now the bitcoin price was in the bear market,So the old people can inverse in the bitcoin for the good profit.The old people can adapt the market changes because of the experience due to their ages.Some old people will not accept any new investments using their money and try to hold money in term of fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "August 18, 2023, 05:19:50 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PMBitcoin has captured the center of attention, especially with the younger generations showing keen interest in it. Yet, there are those who believe that teaching older individuals about it might not be a wise investment of time. However, we must ponder: does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin. I think it is worthwhile to teach anyone about BTC but it is as important to NOT compel them.The problem with most is that they tend to compel and force people to listen about something that is somehow technical. With this, people tend to lose their focus and they also tend to show no attention at all. Again, it is better to teach someone who is already interested in a subject; compared to someone who is not interested at all though they may show signs of being attentive.Let us face it- cryptocurrencies and BTC is a complex process which will take some time in order for its foundation to be grasped. If people are showing signs of curiosity, then by all means teach them. But if you force them into something that they are not interested in the first place, then better avoid forcing them to learn it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 18, 2023, 05:40:19 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PMBitcoin has captured the center of attention, especially with the younger generations showing keen interest in it. Yet, there are those who believe that teaching older individuals about it might not be a wise investment of time. However, we must ponder: does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin. No knowledge is wasted, no matter who the information is shared with, but most times we just need to know who we actually want to educate about a particular thing, be it bitcoin or whatever. If the person finds what you are sharing with him or her interesting and wants to know more, then age should not be a barrier. I still believe that no matter what age someone is, they are still entitled to learn about bitcoin and make their own decision about it; it's just a matter of what they plan to do with the information that will be provided. If it's on the aspect of using it to get wealthy, then bitcoin might be out of reach for older people, as they might not be alive when their investment will yield a good profit.But aside from the fast profit-making aspect, the older people can still use bitcoin as a means of reserving funds for their children and grannies; they can still equally get involved in setting up some mining farms or rigs, which can benefit them depending on the cost of electricity in their base area; and they can also implement accepting bitcoin as a means of payment in their businesses if they have any. So if you have the opportunity to teach any older person who has an interest in learning, do it with an open hand and don't mind what people might say about that. It costs nothing to teach, as it's just some of your time you are sacrificing and the knowledge you are transferring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 18, 2023, 05:42:49 PM",
      "body": "Bitcoin doesn't have any age restriction and limitation in as much as they are open to learn anything that is of bitcoin then they are good to go provided that they wants to acquire the knowledge. Some people thought that teaching old people about bitcoin is a waste of knowledge but to me I can term it to be a kind of widespread because involving them also helps to promotes the progression of bitcoin, which I know too well that after they might have finished learning they don't mind ventured into holding some bitcoin.Let us try our best to make sure everyone around that has the interest about bitcoin should be thought since we are the representatives and this forum is another cool place for one to learn and get routed into bitcoin knowledge and all that concerns bitcoin advancement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "August 18, 2023, 05:49:52 PM",
      "body": "Yes, as long as they have the will to learn about it. But if it is just because this industry is on trend, and they are only focused with the possible outcome, then it's a no for me. If the case is old people having monthly pensions to invest without any other means of income, then don't. This industry or technology is indeed a profitable asset but let us help them prioritize things first. They're old and mostly are having medicinal maintenance, they should not take the risk in exchange for a chance to earn profit and rather just focus on their health expenses. Also, they would be more likely just waiting for profit afterwards and since this market is full of inconsistencies, then they might eventually fall with false hopes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lousie9",
      "created_time": "August 18, 2023, 06:13:03 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PMwhether it's worthwhile to educate older generations about bitcoin. I don't think there is anything wrong with teaching or educating the older generation about Bitcoin. Even though they are from the older generation, that doesn't mean they don't have the right to be taught and follow developments in this all-digital world.The older generation doesn't mean they can't understand the development, right? Even though it is possible to teach the older generation it will require more patience but as long as we teach Bitcoin to someone who is interested or someone who is not against Bitcoin, even if they belong to the older generation it will not be in vain, because sharing knowledge that is well it will never go to waste.In this era of all-digital development, whoever they are and from whatever background they come from, young or old, all have the right to learn or even be taught about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btcchamp88",
      "created_time": "August 18, 2023, 06:28:21 PM",
      "body": "Yes, I think it's good to learn something from older people,but I think for many (including younger people) bitcoinand cryptocurrency is a very complicated topic.I would only recommend this if someone is already familiar with computers and the internet BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "August 18, 2023, 06:38:47 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PM does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin. If they are interested then why not. It’s not about the age but rather the interest and willingness of someone to learn because a person that doesn’t have any bits of interest on Bitcoin no matter what his age is useless because he will never cherish what was taught to him. On the other hand, It’s easy to teach someone that show interests to learn because they will always find way to manage on learning it.I have a 75 year old grandma that ask me to teach her how to use phone so that he can call us whenever we are away. She manage to learn even after a long time of practice because she really wants to connect with us when we are away. I get this ideology base on my own experience on dealing with old age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "August 18, 2023, 06:42:07 PM",
      "body": "It's worth to teach bitcoin to people who are ready to hear it. Regardless of the age or the status. You can teach and preach about bitcoin all day long but if people aren't keen on hearing what you say, let alone following what you want them to do so they can set themselves up for success through bitcoin, your efforts will be for nothing. That's why I don't advocate for \"teaching a specific demographic about bitcoin\", since it limits the amount of people who would be willing to learn about bitcoin altogether. Instead push for campaigns and education programs that are free for everyone, regardless of race, age, or status so people who want to get on it could invest their time without being blocked off by limitations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "August 18, 2023, 06:50:16 PM",
      "body": "Yes, it is. There is nowhere it is specified in the white paper of Bitcoin that, Bitcoin is meant for the younger generation, not for the older generation. It was made clear that Bitcoin has no barriers or age restrictions to it. Everyone is free to utilize it in their daily lives(another means of payment), have it as a store of value, or invest in it as the case may be if they are ready to take the risk involved. Getting the old generation into bitcoin is what is to be handled intellectually, knowing the level of intelligence and the emotional balance of the old person you want to bring into bitcoin investment. Does he understand the digital era we are in now, that everything is been digitalized? That you can now transact and run your business from your home and make gains. If he or she does understand the digital era we are in now, I think it will be worthwhile to tell the old individual the need to invest in bitcoin so that they can have some of their assets stored in bitcoin for the next generation to come",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "August 18, 2023, 06:52:44 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PMBitcoin has captured the center of attention, especially with the younger generations showing keen interest in it. Yet, there are those who believe that teaching older individuals about it might not be a wise investment of time. However, we must ponder: does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin. There's nothing wrong with teaching older people about bitcoin technology. What is wrong is trying to persuade or compel them to learn about it when they have no interest. You can only counsel them about it and give them the benefits and drawbacks until they decide to join voluntarily; you cannot force them to join. People believe that older people have a shallow brain and cannot understand things easily because their brains are no longer sharp, but little do they know that if you don't want to mine bitcoin, having a basic understanding of it and paying attention to your privacy and security is sufficient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "August 18, 2023, 06:58:50 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PMBitcoin has captured the center of attention, especially with the younger generations showing keen interest in it. Yet, there are those who believe that teaching older individuals about it might not be a wise investment of time. However, we must ponder: does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin. Why not I think we have lots of guys here who are also Bitcoin enthusiast that age wise they are advance and a perfect example will be one of the forum most active member @jetcash. For me I would teach and enlighten anyone who has interest on Bitcoin not minding the generation because Bitcoin is actually for all being that it's main purpose it's to create financial freedom for all @ decentralization",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "August 18, 2023, 06:59:01 PM",
      "body": "Quote from: btcchamp88 on August 18, 2023, 06:28:21 PMI would only recommend this if someone is already familiar with computers and the internet BTCI agree with you. This whole idea could become quite complicated if you attempt to teach someone who isn't familiar with the internet or anything related to online business. As you mentioned, Bitcoin technology is quite complex, and teaching an older person about Bitcoin might take a significant amount of time, especially since older individuals might face challenges in learning due to physical limitations. And yes, there are many older people, like @JetCash, in the Bitcoin community who have made substantial contributions. So, I believe that teaching older people is not a problem, as long as they can read and understand. Bitcoin doesn't have age restrictions and anyone, regardless of age, can embrace it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 18, 2023, 07:04:42 PM",
      "body": "It depends greatly on what you mean by elderly (45 yo, 85 yo?), on that person's background (should have some computer related knowledge or at least not be afraid of them) and the willingness to learn about all this.This being said, there's no definitive yes/no answer to OP question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "August 18, 2023, 07:08:55 PM",
      "body": "It shouldn’t be a problem as long as it is not you shoving it down their throats and that they have interest in cryptocurrency. It will be much easier to communicate the subject with someone who is tech savvy and is open to exploring new ideas. Truth be told, we have had so many discussions about teaching bitcoin to children, and it seems now we are moving to teaching bitcoin to elderly people. Bitcoin has no age restrictions, everyone that uses money can learn about bitcoin. Bitcoin is a form of money, even though people mostly see the investment opportunity in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "August 18, 2023, 07:09:50 PM",
      "body": "Teaching other people about what Bitcoin is all about is not bad idea for me but not when they are getting to there extinct age which I see no reason for that because even there ability to learn faster might not worth it at all. Those adults that are still in there mid 40s and late 50s cam still learn what Bitcoin is all about which there is nothing bad with that. All we could do is to teach in a way they will be able to comprehend because there learning faculty might be that small and one will need to use more of videos to do that thma reading through several pages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 18, 2023, 07:13:53 PM",
      "body": "Why not? Saylor is already old. Cuban is already old. The old people are the ones who have money, they own properties and own businesses. Once they see it's beneficially necessary to use BTC then there is no reason for them not to learn it even just to send transactions. They don't even need to learn the technology itself but only learn how to use the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "August 18, 2023, 07:16:03 PM",
      "body": "Quote from: Agbamoni on August 18, 2023, 05:02:21 PMBitcoin has captured the center of attention, especially with the younger generations showing keen interest in it. Yet, there are those who believe that teaching older individuals about it might not be a wise investment of time. However, we must ponder: does it carry value? This conversation revolves around the question of whether it's worthwhile to educate older generations about bitcoin. Some elderly don't wanna touch new technology because they're in belief that it's not going to work for them. Like Warren Buffett, we all knew that he's a great investor and talks shit about Bitcoin. Thus, even if someone influential talks and convinces him about Bitcoin. He wouldn't mind to get to know more about it.But for some that's open on it, then the worth is there. The value is there and you just have to find someone that do have the interest in it. Maybe that's rare for some of the older people but what's the old age for you?We've got jet here and he's one of the rare people out there that set no boundaries of ages getting on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "August 18, 2023, 07:24:24 PM",
      "body": "The question of whether or not it is worth educating older generations about Bitcoin is one that I am sure many would say no to… But I would say that we should not automatically dismiss the idea of educating older people about new technologies financial.. Teaching seniors about Bitcoin can contribute to greater inclusion and understanding of these technologies. As the world moves towards digital, I think it is essential that all generations have at least a basic level of knowledge about current trends and future in the financial field on the other hand, as some commented, older people tend to have a saved capital of their life's work, therefore, they might be interested in diversifying their investments, so providing them with information about Bitcoin and its underlying technology would allow them to make informed decisions about if they want to participate in this constantly evolving market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}