{
  "id": "topic_5415967",
  "title": "theskillzdatklls",
  "author": "theskillzdatklls",
  "created_time": "October 04, 2022, 11:11:13 PMLast edit: October 24, 2022, 05:12:07 AM by theskillzdatklls",
  "content": "Elon purchased Twitter and claims it's part of Project X.Any thoughts on what this might mean in the realm of Bitcoin/crypto/web3, if any? Or just perhaps censorship in general as a theme?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415967",
  "comments": [
    {
      "author": "Vaskiy",
      "created_time": "October 04, 2022, 11:26:05 PM",
      "body": "Upon the Twitter response it looks like he have made plans of more features getting added to Twitter. It looks like he have planned something that could provide access to anything around through a single application. Maybe he's planning to take the position of Google as people reach it for every needs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "October 04, 2022, 11:33:42 PM",
      "body": "The big hope that I have is that it's blockchain based, which could be Bitcoin based or who knows, but ultimately web3 type technology where people physically own/control their identity, followers, media, etc. So that free market competition reigns supreme and people can exit and enter platforms as they please.That's my utopia. No idea if it's his vision at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "October 05, 2022, 12:11:29 AM",
      "body": "I don't see how you go about integrating crypto and web3 into Twitter in a way that is actually interesting to people. They had the NFT thing and I very rarely see people with hexagon profile pictures anymore. There aren't any web3 features that would get to use Twitter any more than I am right now or that would make me pay a monthly fee for these extra features. I would actually use it less if Twitter became a platform to promote shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "October 05, 2022, 12:27:58 AM",
      "body": "Elon is tripping towards the finish line here. He never intended on buying Twitter and wanted to bail out last minute after realizing he overpaid. Perhaps he was interested in completing the deal at a lower price, or wanted to drop the entire thing after he realized there wasn't a way to make it profitable to recoup his cash.My hope is a decentralized social media platform, the reality will be something much less. Twitter is beyond savable. If you've spent any time reading the content on the platform, the best course of action is nuking it entirely and starting from scratch. The bots, political astroturfing, algorithm manipulation are all too palpable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "takuma sato",
      "created_time": "October 05, 2022, 12:36:41 AM",
      "body": "Quote from: Vaskiy on October 04, 2022, 11:26:05 PMUpon the Twitter response it looks like he have made plans of more features getting added to Twitter. It looks like he have planned something that could provide access to anything around through a single application. Maybe he's planning to take the position of Google as people reach it for every needs  Yeah im guessing hes going for a decentralized internet browser, youtube alternative, gmail alternative, and social media. Of course, big quantitation marks would need to be put between decentralized since attempts at this have been pretty lame, see the steemit clusterfuck and other derivatives. If it needs it's own token, it will need to prove the game theory cannot be gamed as seen before. I don't see how Bitcoin fits in all of this beside implementing Lightning Network payments natively, that would be cool, however the Bitcoin blockchain is for Bitcoin transactions, not some Elon Musk experiment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 05, 2022, 01:11:28 AM",
      "body": "buying  twitter is an accelerant to creating Xwell yea if you buy a 150m users to can easily 'upgrade' them into a new app easier that starting a new app and trying to recruit people the old fashioned way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 05, 2022, 05:56:13 AM",
      "body": "Quote from: takuma sato on October 05, 2022, 12:36:41 AMIf it needs it's own token, it will need to prove the game theory cannot be gamed as seen before. I don't see how Bitcoin fits in all of this beside implementing Lightning Network payments natively, that would be cool, however the Bitcoin blockchain is for Bitcoin transactions, not some Elon Musk experiment.I wouldn't worry about it as he'll be using Dogecoin obviously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 05, 2022, 06:16:54 AM",
      "body": "Elon Musk with his loose month! I am not taking the guy seriously anymore. He likes to play on people's integrity, particularly ardent supporters who only hear go and come like puppies. He should do anything to Twitter as he likes if he eventually purchases it, and stop playing like a child as usual. I stopped taking the guy seriously when he speedily announced the buying of the microblogging app for $44B with $54.20 per share, only to take a turn and say he doesn't want the deal again as if they are in a banana republic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "October 05, 2022, 08:42:29 AM",
      "body": "Quote from: FinneysTrueVision on October 05, 2022, 12:11:29 AMI don't see how you go about integrating crypto and web3 into Twitter in a way that is actually interesting to people. They had the NFT thing and I very rarely see people with hexagon profile pictures anymore. There aren't any web3 features that would get to use Twitter any more than I am right now or that would make me pay a monthly fee for these extra features. I would actually use it less if Twitter became a platform to promote shitcoins.Nothing to do with NFTs for a web3 that matters. It doesn't matter if someone uses a monkey picture or not.The real purpose of a web3 is that you own your content (not your profile picture). That way, if you want to go from twitter to some as of yet unnamed platform, you can go there, all of your data and all of the platform exists elsewhere but on a different front-end.That is what creates real decentralization, real free market competition, real innovation, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Foxpup",
      "created_time": "October 05, 2022, 11:32:00 AM",
      "body": "As usual, Elon is taking a technology that already exists and acting like he invented it. As a Linux user, I already have an omnipresent app called X that's awful in every conceivable way but can't be fixed because of how deeply intertwined it is with every other app in existence. How will this new project be any different?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 05, 2022, 12:05:26 PM",
      "body": "Quote from: Foxpup on October 05, 2022, 11:32:00 AMAs usual, Elon is taking a technology that already exists and acting like he invented it. As a Linux user, I already have an omnipresent app called X that's awful in every conceivable way but can't be fixed because of how deeply intertwined it is with every other app in existence. How will this new project be any different?At least I can just blast X into pieces and make a new window system from scratch.Probably what's going to happen to Twitter except it gets blasted to pieces after some competing service is made from scratch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 05, 2022, 12:20:41 PM",
      "body": "Quote from: theskillzdatklls on October 05, 2022, 08:42:29 AMNothing to do with NFTs for a web3 that matters. It doesn't matter if someone uses a monkey picture or not.The real purpose of a web3 is that you own your content (not your profile picture). That way, if you want to go from twitter to some as of yet unnamed platform, you can go there, all of your data and all of the platform exists elsewhere but on a different front-end.That is what creates real decentralization, real free market competition, real innovation, etc.How do you think those ownership properties will be defined on a digital level?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "October 05, 2022, 12:30:17 PM",
      "body": "Quote from: nutildah on October 05, 2022, 12:20:41 PMQuote from: theskillzdatklls on October 05, 2022, 08:42:29 AMNothing to do with NFTs for a web3 that matters. It doesn't matter if someone uses a monkey picture or not.The real purpose of a web3 is that you own your content (not your profile picture). That way, if you want to go from twitter to some as of yet unnamed platform, you can go there, all of your data and all of the platform exists elsewhere but on a different front-end.That is what creates real decentralization, real free market competition, real innovation, etc.How do you think those ownership properties will be defined on a digital level?That's a very good question that has multiple viable answers.Having said that, personally speaking, I think the easiest way to do this is to attach any content owned by an individual to their wallet address via a content ID label. And to have the storage for all of the content done in a way that is distributed and anonymized by hosts.This way, blockchain has an identifier as to who owns what, but the bulk of the data storage isn't on the blockchain itself.There are other solutions that could be imagined up. But I think that's a reasonable enough solution for the medium term.As far as wallet control, this can be done one of two ways on this hypothetical social platform. Self-custody of private keys or outsourcing the work to companies. This way, for the vast majority of people that don't know what a private key is, nothing changes. And one could make the argument as to whether or not they truly own anything on a digital level then. But that's a different philosophical question to have, in my opinion. The important part / innovation / improvement for society is that the opportunity exists for individuals who care enough in the first place when it formerly did not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 05, 2022, 01:57:14 PM",
      "body": "Quote from: theskillzdatklls on October 05, 2022, 12:30:17 PMI think the easiest way to do this is to attach any content owned by an individual to their wallet address via a content ID label. And to have the storage for all of the content done in a way that is distributed and anonymized by hosts.This way, blockchain has an identifier as to who owns what, but the bulk of the data storage isn't on the blockchain itself.I kind of see what you're saying but how would items be transferred or sold from one account to another in a way that could be trustless and anonymous?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "October 05, 2022, 03:51:38 PM",
      "body": "Quote from: nutildah on October 05, 2022, 01:57:14 PMQuote from: theskillzdatklls on October 05, 2022, 12:30:17 PMI think the easiest way to do this is to attach any content owned by an individual to their wallet address via a content ID label. And to have the storage for all of the content done in a way that is distributed and anonymized by hosts.This way, blockchain has an identifier as to who owns what, but the bulk of the data storage isn't on the blockchain itself.I kind of see what you're saying but how would items be transferred or sold from one account to another in a way that could be trustless and anonymous?I don't know enough about blockchain technology to be able to answer this question sufficiently.That said, part of your question is a little bit weird. Because if I make a post on Facebook / Twitter/ YouTube etc, I cannot sell this post/content from Facebook to another user. That's not how the platforms work.What you own is the account, i.e. the Twitter log-in and all of it's posting history, followers, etc. And if you felt that you would rather take your business away from the Twitter front-end over to Twitter2, you could, because you own your assets and there's no loss in followers/content/anything, because it's just as visible on Twitter2 as it is on Twitter.Now, hypothetically, getting back to your question, could individual items / content IDs be sold off? Perhaps/probably? I guess that's a design question, you'd have to ask someone with more expertise than myself. But that's also very much not the point I was initially making nor how things presently work as I already said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 05, 2022, 05:37:51 PM",
      "body": "Quote from: theskillzdatklls on October 04, 2022, 11:11:13 PMElon purchased Twitter and claims it's part of Project X.Any thoughts on what this might mean in the realm of Bitcoin/crypto/web3, if any? Or just perhaps censorship in general as a theme?I don't think it means much for Bitcoin or web3, but likely crypto will receive a boost in the form of giving Doge a real usage case.  I imagine his everything app will be like Uber/DoorDash/Facebook/Robinhood/Tesla/(insert favorite news app here) all rolled in one.  You'll be able to order food and trade stocks from the same app you use to get your news and make social media posts.  You'll be able to see how many calories you've taken in and how much you've slept from the same app that calls your car to pick you up or monitor your home's electrical use.  All of this will likely be done on a Tesla phone and who knows, maybe it'll be free with subsidies (for lower bandwidth model) and not have a monthly service fee because it runs on free satellites.  I've actually been saying this will happen for a while now, so it's interesting to see Elon drop hints that it's under development.  By 2030, I expect that the Tesla phone will be as popular as the iPhone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 06, 2022, 01:42:39 AM",
      "body": "Quote from: theskillzdatklls on October 05, 2022, 03:51:38 PMNow, hypothetically, getting back to your question, could individual items / content IDs be sold off? Perhaps/probably? I guess that's a design question, you'd have to ask someone with more expertise than myself. But that's also very much not the point I was initially making nor how things presently work as I already said.\"Owning your own content\" implies that one should be able to do whatever they want with it, does it not?TBH the point I was getting at was there is already a blockchain-based technology in place to allow for this to transpire, which is NFTs.Edit: funny that this thread got moved to P&S but not entirely unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "October 06, 2022, 08:28:13 AM",
      "body": "Quote from: nutildah on October 06, 2022, 01:42:39 AMQuote from: theskillzdatklls on October 05, 2022, 03:51:38 PMNow, hypothetically, getting back to your question, could individual items / content IDs be sold off? Perhaps/probably? I guess that's a design question, you'd have to ask someone with more expertise than myself. But that's also very much not the point I was initially making nor how things presently work as I already said.\"Owning your own content\" implies that one should be able to do whatever they want with it, does it not?TBH the point I was getting at was there is already a blockchain-based technology in place to allow for this to transpire, which is NFTs.Edit: funny that this thread got moved to P&S but not entirely unpredictable.To break it down, perhaps that's possible.Presently, with any account almost anywhere in the world, you are renting your account, you do not own the account.I would like people to have the ability to own their account.Perhaps, it's possible, they could also piece off parts of their account. Sounds scientifically possible.Also yeah, I saw they moved it yesterday. I think if Elon were to do something blockchain related, there's a serious chance Bitcoin is involved. But maybe the overall doubt is too high so off it went.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xeon",
      "created_time": "October 06, 2022, 12:05:02 PM",
      "body": "Quote from: takuma sato on October 05, 2022, 12:36:41 AMim guessing hes going for a decentralized internet browser, youtube alternative, gmail alternative, and social media. Of course, big quantitation marks would need to be put between decentralized since attempts at this have been pretty lame, see the steemit clusterfuck and other derivatives. If it needs it's own token, it will need to prove the game theory cannot be gamed as seen before. I don't see how Bitcoin fits in all of this beside implementing Lightning Network payments natively, that would be cool, however the Bitcoin blockchain is for Bitcoin transactions, not some Elon Musk experiment.It would be weird, but it wouldn't be the first one to try it. If there are other social media places in the world, like twitter, instagram, tik tok etc etc, and then he wants to change the world by creating that \"x\" he is talking about, having twitter and implementing that to the idea would be a lot better.He could buy out like brave or something, and then buy out vimeo or something, basically the already there stuff, that way he would have a lot of people working on these things, he could buy out telegram or discord or whatever too, so with the chat app, and then he would be able to build them all together in a single thing, it's much better than creating a brand new one of each.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}