{
  "id": "topic_5456265",
  "title": "Newchanka",
  "author": "Newchanka",
  "created_time": "June 13, 2023, 11:13:22 PM",
  "content": "I really am no fan of Binance because I found their KYC annoying. What is not in doubt is that CZ is supposedly one of the most credible faces of crypto. How much harm do you think a Binance implosion would cause Bitcoin? Is the US a big threat to the coin market?https://www.cryptoinfowatch.com/a-former-sec-official-said-the-binance-ceo-and-others-may-face-criminal-charges-soon/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456265",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "June 13, 2023, 11:22:57 PM",
      "body": "Like you said, CZ is a big name in the crypto market, but what do you call a big name? He has been able to make his way to the top with his business ideas and amazing upgrades. I don't know how he did it, but for him to pilot his exchange to the top above all others existing before his, then I guess he deserves the big-name title.The US government is also a big name, as they are currently regarded as a world power. If they shut down Binance, which they can only do on their end, they can only shut it down in their country. So long as other countries are still in support of the exchange, it won't completely go down.And even if something happens and Binance completely goes out of business, one thing is for sure: the Bitcoin price will shake because it's among the exchanges that hold the highest Bitcoin trading volume, so such action will shake the market with a lot of panic selling, a huge number of withdrawals, and so on.But above any given action, there is nothing that's going to happen to the market that has not happened before, so nothing will appear new to us again. The Luna crash, FXT, and many other big incidents could have wiped out people's faith in crypto, but they didn't, so with or without Binance, Bitcoin will survive. With or without the US government's support, either negatively or positively, Bitcoin is not dying off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 13, 2023, 11:29:49 PM",
      "body": "Whether you like it or not, it's always a yes. Smaller hacked or shutdown exchanges always give a bad effect on the market, how much more on largest exchange?Shutting down of binance is highly unlikely to happen (for now) maybe on their US based offices/market, but it doesn't speak the same on the rest of their offices/market. But obviously it will have a mid to high bad effect on the market for some time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 13, 2023, 11:41:25 PM",
      "body": "Yes CZ and binance are actually a big brand in the crypto space, if we look at how much holdings of just bitcoin binance has it is over 500k bitcoin which is a large number that would affect the crypto market. But aside the fact that this saga is just a country subsidiary not the global one then it ban will have little effect. But let’s say it is even the entire binance shutdown then it will create panic as the largest exchange because some less knowledgeable people will have the wrong narrative that it will bring the end of cryptocurrency. But in all of these I think it will just be a month or less than panic and everything will fazes out. The only way a binance saga will have a long term effect on crypto market is only when it is hacked and the funds on it is stolen. This will scare people a lot because some or even many who I believe still have funds on it would have lost their funds. Aside hack, banning or shutting down will just be a little panic before People move there funds to another exchange again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "June 13, 2023, 11:59:12 PM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMI really am no fan of Binance because I found their KYC annoying. What is not in doubt is that CZ is supposedly one of the most credible faces of crypto. How much harm do you think a Binance implosion would cause Bitcoin? Is the US a big threat to the coin market?https://www.cryptoinfowatch.com/a-former-sec-official-said-the-binance-ceo-and-others-may-face-criminal-charges-soon/Binance implosion will really go a long way to affect the market of bitcoin but nothing is new to the cryptocurrency market again after other big incidents occurred and bitcoin is still standing firm and still continue to exist. CZ is a big name in crypto and also his exchange Binance also plays a vital role in the crypto market because of the large amount of bitcoin they hold in their possession. If anything happens to Binance, especially coming from the US government, the market will definitely be affected and we may witness some changes in the market for the time being. After a while, the market will regain its former status but this situation only affects those that their minds are not set into the market yet but are on alert when a negative news pose threat to the market. They panic to sell or withdraw their funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onset",
      "created_time": "June 14, 2023, 12:02:02 AM",
      "body": "If Binance as an exchange shuts down? Very bad outcome. All you have to do is study the outcome of previous hacks/shutdowns of what used to be the largest crypto exchanges at the time.If Binance collapses as in Binance Coin or the BNB chain? It’ll probably be the most massive crypto burst and cold winter in history. There’s no other way around it. There are currently thousands of alts sustained by BNB. It’d likely have the same effect as ETH collapsing and bringing its entire chain filled with shitcoins down with it. It’d be a terrifyingly massive arrow to crypto’s back.Of course, Bitcoin will do well. But probably only years after the collapse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "June 14, 2023, 12:05:08 AMLast edit: June 14, 2023, 12:43:49 AM by Hydrogen",
      "body": "Exchanges and marketplaces offering BTC support meeting their untimely demise have been a harsh reality of crypto since silk road and Ross Ulbricht in 2013.Those who are new to crypto will view binance as a \"new\" trend.Those of us who have been here know trends of BTC marketplaces being shut down as part of the bitcoin experience from the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "June 14, 2023, 12:09:59 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMIs the US a big threat to the coin market?They are trying to control the market, that much is certain. I don't think the end goal is to kill crypto altogether, I believe the US SEC is trying to gain a foothold before they start introducing rules, business partners, etc whether it is directly or indirectly. It might seem scary but this should not be the first time stuff like this happens. FTX went bankrupt just a few months ago, and the market is still doing healthy compared to the past. We might go even lower but that's just the nature of a very speculative market.At the end of the day having a less concentrated market that relies on one or two exchanges is good IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "June 14, 2023, 12:16:13 AM",
      "body": "I'd say there's always going to be an impact if relatively big exchanges shutdown, how big this is depends on how fast Binance goes under. If the process was relatively calm (yet determined already) I reckon most people are just going to move out of it and find a new exchange to set as the next big exchange people would use.I don't think its going to affect the market that badly though. Maybe we'd see a big change for a day or two but after that we should be relatively stable again. Well unless Binance goes rogue though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "June 14, 2023, 12:57:09 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMI really am no fan of Binance because I found their KYC annoying. What is not in doubt is that CZ is supposedly one of the most credible faces of crypto. How much harm do you think a Binance implosion would cause Bitcoin? Is the US a big threat to the coin market?https://www.cryptoinfowatch.com/a-former-sec-official-said-the-binance-ceo-and-others-may-face-criminal-charges-soon/First of all Binance is one thing, Binance US another, and that is a huge difference. If Binance US shuts down pretty much no one is going to care except eventually some Americans but I don't see why the market should collapse because of that. The SEC has no power to shut down or prohibit operations from the original Binance.If the original Binance fails/scams or whatever it's a difference story, for sure it'll have an important impact in the market but bitcoin will survive for sure, no doubts about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "June 14, 2023, 01:07:32 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMI really am no fan of Binance because I found their KYC annoying. What is not in doubt is that CZ is supposedly one of the most credible faces of crypto. How much harm do you think a Binance implosion would cause Bitcoin? Is the US a big threat to the coin market?Isn't it the harm has been done already? prices are already stagnant with the news that SEC filed a case against Binance and we have been trading in this sideways pattern, $25k-$26k.In case of Binance though exiting US, then maybe it will still have a impact, but I doubt that it will be huge. Maybe just a a few thousands of dollars. But then we've seen that bitcoin is so resilient with this kind of attacks and negative news that I don't see us recovering at the end of the year.It's not that Binance will have a similar Mt. Gox effect, that time only Mt. Gox is the exchange, unlike today wherein we have a lot of options to choose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stella Mese",
      "created_time": "June 14, 2023, 01:57:27 AM",
      "body": "as we know and feel, right now the price of btc is falling and what I know is the result and impact of the SEC suing binance, so I think if binance goes down fundamentally people will start not believing in bitcoin and crypto anymore. surely bitcoin will be wounded (price down). but there are a lot of exchanges so if there are only 1 or 2 exchanges, it certainly won't be a serious problem for bitcoin and crypto. yes, hopefully the bitcoin price will go back up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "June 14, 2023, 02:23:06 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMI really am no fan of Binance because I found their KYC annoying. What is not in doubt is that CZ is supposedly one of the most credible faces of crypto. How much harm do you think a Binance implosion would cause Bitcoin?If Binance goes down, cryptocurrency market will be hurt and fall down so Bitcoin will be affected too. However Bitcoin is Bitcoin and it can be traded on many exchanges, peer to peer too so if Binance goes down, there will be other exchanges for Bitcoin trading. It won't be hurt too long and Bitcoin is always Bitcoin, it won't die because of Binance that is only one of many exchanges where Bitcoin can be traded.QuoteIs the US a big threat to the coin market?Risk and opportunity but the USA will not kill cryptocurrency market. They are smart enough to not kill themselves and give opportunities to other competitive countries like China, Russia and European countries. They are flexible to change their polices with decentralized power in their national political system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "June 14, 2023, 02:45:07 AM",
      "body": "There are many Binance exchanges, we have the US, NZ, etc. The Binance.us is the exchange having an issue with the SEC due to some rules that were broken.If the exchange goes down, it will be the US exchange of Binance, not the whole Binance exchange and it will only lead to a dump in the price of the market but the market will recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "June 14, 2023, 02:45:57 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMHow much harm do you think a Binance implosion would cause Bitcoin? Is the US a big threat to the coin market?More generally, the US is a major influence on the global economy, so the crypto market isn't the only one that will be impacted but isn't really threatening in some cases.Currently, binance is the controller of the most dominant bitcoin traders, which indirectly they also assume the responsibility of trusting people, including non-binance users. If the term \"down\" that you mean interprets their failure to maintain their reputation, it will at least raise the fear of some groups and potentially disrupt the market situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "June 14, 2023, 02:53:41 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMI really am no fan of Binance because I found their KYC annoying. What is not in doubt is that CZ is supposedly one of the most credible faces of crypto. How much harm do you think a Binance implosion would cause Bitcoin? Is the US a big threat to the coin market?https://www.cryptoinfowatch.com/a-former-sec-official-said-the-binance-ceo-and-others-may-face-criminal-charges-soon/No. Bitcoin has seen the failure of many exchanges in its lifetime so far. If binance went under a new one would just emerge, but bitcoin's resiliency is really a testament to the purpose that it was created for and is meant to liberate us from the corrupt fiat banking system. The US has this whole crack down to crypto right now because it is considered a threat to its own world reserve currency status, but right now the US is really going to be responsible for losing that because right now we have generated more dollars these last few years than we have ever printed in history. Crazy stuff! Great for BTC though!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "June 14, 2023, 03:24:32 AM",
      "body": "Badly hurt in terms of what?The price would be definitely great affected in short term because most of people only know and hold their coins in Binance, but after that the price would be back and stable because everyone can still trade Bitcoin via P2P.Both of top exchange and US can affect Bitcoin price, but they don't have a way to completely shutdown Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "June 14, 2023, 04:05:12 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMI really am no fan of Binance because I found their KYC annoying. What is not in doubt is that CZ is supposedly one of the most credible faces of crypto. How much harm do you think a Binance implosion would cause Bitcoin? Is the US a big threat to the coin market?https://www.cryptoinfowatch.com/a-former-sec-official-said-the-binance-ceo-and-others-may-face-criminal-charges-soon/Hurt ? not only bitcoin but also those investors that expect profit in the next coming days but this is just temporary .Yes Binance is one of the biggest exchange but we knew that exchange is a business and there is always competition , while binance is there surely there will be more exchange to grow upon the fall of binance .Bitcoin leaves not only because binance is there and it is because we as bitcoin users support this.we can still purchase and use bitcoin even without this exchange .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 14, 2023, 05:09:35 AM",
      "body": "Quote from: Newchanka on June 13, 2023, 11:13:22 PMHow much harm do you think a Binance implosion would cause Bitcoin?Binance is just an exchange like every other centralized ones both the oes existing and the one that have ceased to exist because of hack or bankruptcy, Binance will do no harm to the bitcoin network in no way except your bitcoin with them that will suffer loss, why should you keep using or holding your bitcoin on centralized exchanges that can take away your coins anytime just like other exchanges has gone down in the past, it's current challenges is not an internal one but an external challenges with government regulations on their exchange in US, Which means it's not a global issue or concerns, the worst could be them relocating from US if they didn't arrived being in accord.Quote from: Newchanka on June 13, 2023, 11:13:22 PMIs the US a big threat to the coin market?Not at all, that's why bitcoin is a decentralized cryptocurrency, there's no manifestation of any central authorities over it market price or value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "June 14, 2023, 05:15:18 AM",
      "body": "Binance is essentially THE crypto empire of the world. It'd probably be good long term because then people would use a variety of exchanges instead of Binance totally dominating the exchange industry. But short term it'd be pretty disastrous if something happened to by far the dominant global exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}