{
  "id": "topic_5520196",
  "title": "OmegaStarScream",
  "author": "OmegaStarScream",
  "created_time": "November 21, 2024, 06:33:42 PMLast edit: November 21, 2024, 07:00:04 PM by OmegaStarScream",
  "content": "Gensler will step down as SEC Chair and depart from the agency entirely on Jan. 20, 2025, when President-elect Donald Trump starts his presidential term.Source: https://cointelegraph.com/news/sec-chair-gary-gensler-step-downI guess this was something everyone was expecting to happen after Trump's comments in the bitcoin's conference earlier this year. It would be interesting to see how the market is going to react.Thoughts on what to expect next as he's out of the picture? There were some talks that Trump is considering to assign Pro-crypto (Lawyer) Teresa Goody to lead the SEC.https://www.coindesk.com/policy/2024/11/19/trump-said-to-consider-crypto-lawyer-teresa-goody-guillen-to-lead-sec/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5520196",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "November 21, 2024, 07:10:16 PM",
      "body": "He became a lame duck the moment Donald Trump announced he would fire him on the first day of his presidency. This was expected. I heard that DJT doesn’t have the authority to do that (fire him) but it would be stupid for Gary to stay anyway. He made a wise decision. Good for him he saved himself from further embarrassment. Trump probably will replace him with a more crypto friendly dude and obviously that’s bullish news.Trump pump is only beginning.$1 million is the new target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 21, 2024, 07:56:22 PM",
      "body": "Quote from: mindrust on November 21, 2024, 07:10:16 PMTrump probably will replace him with a more crypto friendly dude and obviously that’s bullish news.Doing otherwise will be against his campaign promises and what is expected from him. 2025 will start good for bitcoin and cryptocurrency in general. We will see $100,000 before this year ends; the appointment of a crypto-friendly individual as SEC chair will set the momentum for the new year.Quote from: mindrust on November 21, 2024, 07:10:16 PMTrump pump is only beginning.Trump is looking like the chosen one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "November 21, 2024, 07:56:45 PM",
      "body": "Oh Gary , he probably knows what's coming and decided to do it honorably than to be forced out disgracefully. I applaud Trump for being very open about his intentions from the onset without mincing words. In my estimation I see this as a two-edged sword. On one end, Gary leaving is good and could take Bitcoin far far higher. On the other end of Trump makes the wrong hiring or appointment decision Bitcoin's price may drop at an instant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 21, 2024, 08:01:28 PM",
      "body": "Quote from: mindrust on November 21, 2024, 07:10:16 PMTrump probably will replace him with a more crypto friendly dude and obviously that’s bullish news.Trump pump is only beginning.$1 million is the new target.Hmm, that is what we were expecting from day one, but $1M hmm, do you think it's a good realistic target, I know I did post a similar kind of thread even months ago at the start of this year within 90 days but that was just a fan story based on some rough calculations.Now I do hope it will grow exponentially but $1M isn't that easy target to achieve for this cycle I'm still optimistic to the range of 120k to 160k almost.Quote from: Davidvictorson on November 21, 2024, 07:56:45 PMOh Gary , he probably knows what's coming and decided to do it honorably than to be forced out disgracefully. I applaud Trump for being very open about his intentions from the onset without mincing words. In my estimation I see this as a two-edged sword. On one end, Gary leaving is good and could take Bitcoin far far higher. On the other end of Trump makes the wrong hiring or appointment decision Bitcoin's price may drop at an instant.Haha so said ...Guys 1 mint pause for him and for his never return to SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "November 21, 2024, 08:33:23 PM",
      "body": "This is just as predicted, even as someone was arguing about how the law doesn't allow the commissioner to be removed or replaced by a president unless they have served their tenor completely. This is politics; even if the law doesn't permit the president to directly remove Gensler, there are still other ways of forcing his hand to resign on his own for his own peace. His resignation news just came earlier than expected. Let's see what the news will bring to the market, or can we already tag it to be part of the factor pushing bitcoin to the $100k level already?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 21, 2024, 09:20:17 PM",
      "body": "to be honest, i feel gensler is pro-bitcoin, but was being strangled(forced to toe the line) by elizabeth warren who is anti-bitcoin..i think removing elizabeth warren would be more advantageous to bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 21, 2024, 09:34:55 PM",
      "body": "Quote from: franky1 on November 21, 2024, 09:20:17 PMto be honest, i feel gensler is pro-bitcoin, but was being strangled(forced to toe the line) by elizabeth warren who is anti-bitcoin..i think removing elizabeth warren would be more advantageous to bitcoinyeah she’s pretty much a quack 🦆 . her trans ⚧️ stand is terrible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "November 21, 2024, 09:50:46 PM",
      "body": "That's a good news overall for the crypto community, Donald Trump will really play some important step to help Bitcoin, and this is going to be one of it. Donald even give Elon the power to lead DOGE department and that's also something which meme coin lovers find helpful. He's quite strategic when it comes to naming because DOGE (Department of Government Efficiency) sounds 100% similar to DogeCoin and meme lovers got cue that they wanted to heard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "November 21, 2024, 09:52:54 PM",
      "body": "Trump has started on those campaign promises, seems like.  Doubt Gary left that spot voluntarily - likely got a nudge from the Trump camp. Market is already bracing for big changes and its going to be interesting to see how things play out once Gensler is officially out.If Teresa Goody is really in the running to take over the SEC, could mean a whole new ballgame crypto-wise.  Bein pro-crypto and all she might go easier on us.  That would be a relief after feeling all that regulatory pressure.  But lotta unknowns still.  but if Trump follows through with his plans, we might see a more favorable environment for crypto innovation and less regulatory uncertainty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 21, 2024, 10:51:24 PM",
      "body": "Trump's vision of making US the crypto capital of the world would boost the growth of Bitcoin. The likes of Gary were great in spreading FUD and his services are not needed in this regime. However, the president will add up more fresh changes, since he listens to the bitcoiners that surround his team. Bitcoin is permeating the US and it'll be wrong to assume Trump is doing it to pay back, instead he loves the technology and wants to contribute to the growth of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "November 21, 2024, 11:42:42 PM",
      "body": "Gary Gensler said last week at a possible departure from his position during remarks at the 56th Annual Securities Regulatory Conference at the New York Law School. In what seemed like a farewell speech, he said, “It has been a great honor to serve with them and to ensure that our capital markets remain the best in the world.”My understanding of American tradition is that the SEC chairman always resigns after a new candidate wins the presidency, and the president can propose a new name to the Senate for confirmation without having the power to remove him directly. Also, Gensler’s resignation as SEC director does not mean he will give up his entire role at the SEC, as he can remain an advisor. Anyone with more accurate information can correct me, since there have been no previous dismissals and all have been resignations.Everyone seems optimistic about getting rid of Gensler, but there are no clear indications about who might take over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "finaleshot2016",
      "created_time": "November 22, 2024, 12:18:31 AM",
      "body": "This was definitely expected after all the anti-crypto moves Gensler has been pushing. With Trump stepping in and openly supporting Bitcoin earlier this year, it makes sense he'd want someone more aligned with that vision. If Teresa Goody gets the role, we might finally see some clarity and less hostility toward the crypto space.Markets could react positively to this, especially if it signals a more pro-crypto regulatory environment. I’m curious to see how this affects not just Bitcoin but altcoins and stablecoins too,could be a big shift coming next year and hoping that most of the countries will follow, especially my country PH.wagmi!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "November 22, 2024, 01:38:42 AM",
      "body": "I was hoping Uncle Gary would shut down the altcoin/shitcoin casino before he left. I thought he didn't do enough on that front.Gensler seemed to leave bitcoin alone for the most part and respected btc as the only digital commodity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 22, 2024, 02:41:09 AM",
      "body": "Quote from: Kavelj22 on November 21, 2024, 11:42:42 PMMy understanding of American tradition is that the SEC chairman always resigns after a new candidate wins the presidency, and the president can propose a new name to the Senate for confirmation without having the power to remove him directly. Also, Gensler’s resignation as SEC director does not mean he will give up his entire role at the SEC, as he can remain an advisor. Anyone with more accurate information can correct me, since there have been no previous dismissals and all have been resignations.i would go with using the NYBitlicence guy as a reference, when he stepped down he went straight into the private sector advising businesses how to be compliant with the regulations he created.also many politicians do back hand deals where he helps tailor regulation to help certain corporations have a foot forward whilst creating barriers of entry for competition.. and then when no longer a government agent he can claim a payment in the form of \"contracted advisor\".. so IF gensler accumulated many golden/crypto handshake deals with corporations over the years, he can retire happily and claim \"advisory\" contract payments from corporations he aided while in the SEC(as many politicians and government agents do)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 22, 2024, 02:44:49 AM",
      "body": "Quote from: franky1 on November 21, 2024, 09:20:17 PMto be honest, i feel gensler is pro-bitcoin, but was being strangled(forced to toe the line) by elizabeth warren who is anti-bitcoin..i think removing elizabeth warren would be more advantageous to bitcoinIf I recall it correctly, there was some sort of hype and optimism within the community when Gensler was nominated by Biden back in 2021. Here's a man who has knowledge and has in fact taught about blockchain, digital currencies, Bitcoin, and the like at MIT. Here's a man who seems fond of the rising financial technology and even shared stories about Satoshi and Pizza Day and whatnot with his students. Gensler isn't necessarily pro-Bitcoin, but he probably was open-minded and looks at things objectively. It's just that there are bigger policies in every administration and he has to abide with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "November 22, 2024, 03:08:09 AM",
      "body": "Quote from: OmegaStarScream on November 21, 2024, 06:33:42 PMGensler will step down as SEC Chair and depart from the agency entirely on Jan. 20, 2025, when President-elect Donald Trump starts his presidential term.It will be a little bit more than one year after Bitcoin Spot ETF Approval day in the USA, on 10 January 2024. It's time to review Gary Gensler's legacy in Bitcoin and cryptocurrency industry.Statement on the Approval of Spot Bitcoin Exchange-Traded Products.In the official statement in January this year, Gary Gensler did not show any happiness in the approvals on Bitcoin Spot ETF applications in the USA. He didn't want to approve these Bitcoin Spot ETFs, but he had to do it when he no longer was able to delay it longer.Some of his biggest failures is collapses of Terra and FTX and so far he has yet been charged by any responsibility as head of SEC. to protect US. citizens against scammers while during his term, he tried to sue many cryptocurrency companies in his homeland and somehow forced them migrating to other nations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "November 22, 2024, 03:48:30 AM",
      "body": "Quote from: Stalker22 on November 21, 2024, 09:52:54 PMIf Teresa Goody is really in the running to take over the SEC, could mean a whole new ballgame crypto-wise.  Bein pro-crypto and all she might go easier on us.  That would be a relief after feeling all that regulatory pressure.  But lotta unknowns still.  but if Trump follows through with his plans, we might see a more favorable environment for crypto innovation and less regulatory uncertainty.Just hoping that the speculation about the appointment of Teresa Goody is true. As a blockchain lawyer and former SEC attorney, she has the experience to run the commission. With a perceived pro-Bitcoin stance, her tenure will be more flexible and crypto-friendly.   Quote from: Davidvictorson on November 21, 2024, 07:56:45 PMOh Gary , he probably knows what's coming and decided to do it honorably than to be forced out disgracefully. I applaud Trump for being very open about his intentions from the onset without mincing words. In my estimation I see this as a two-edged sword. On one end, Gary leaving is good and could take Bitcoin far far higher. On the other end of Trump makes the wrong hiring or appointment decision Bitcoin's price may drop at an instant.This has been the tradition of the Chairpersons of the Security and Exchange Commission. Once there is a change of government, especially when a new party od coming in the head of SEC would have to resign. He would be remembered for his ceaseless attacks on the crypto industry. Uncle Gary is greatly cherished by the Biden government because he realized huge funds through fines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 22, 2024, 04:03:56 AM",
      "body": "This is the first wise decision Gensler has made in his career. He has always made bad decisions, attacked companies, and stifled the industry for no reason. But this time, he made a bold decision because he knows that he is no longer wanted by either President-elect Trump or the industry as a whole.I hope that Trump can find the right man (or woman) for this great job. This is not an easy task because the new president needs to find some kind of balance between creating an open environment for the industry, encouraging companies, and protecting users at the same time within the laws and regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 22, 2024, 04:37:31 AM",
      "body": "Quote from: OmegaStarScream on November 21, 2024, 06:33:42 PMThoughts on what to expect next as he's out of the picture? There were some talks that Trump is considering to assign Pro-crypto (Lawyer) Teresa Goody to lead the SEC.What a news! If anyone has any reservations about bitcoin reaching $100k then just throw that out of the window right now. This news will definitely pump bitcoin and cryptocurrencies that have been involved with SEC's lawsuits such as XRP (ripple). It actually has been doing well these past few days and this news might just intensify investors' demand for the coin. Maybe even set a new ATH while we're at it?Whatever happens, I am sure it is all positive for the industry and the community. This is only the start as Trump has not even done anything as a President officially yet. I am excited for the heights crypto can reach under Trump's presidency. It would seem like he really is serious about his pro bitcoin stance during his election campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}