{
  "id": "topic_5419640",
  "title": "denis.korablev",
  "author": "denis.korablev",
  "created_time": "November 06, 2022, 04:18:25 PM",
  "content": "Добрый день, сегодня решил поближе познакомиться с electrum, знакомство оказалось странным, после перевода тестовой транзакции, сумма автоматически (?) была переведена на другой адрес. для теста повторил на другом эккаунте - такая же ситуация. всего сделал 3 тестовых транзакции, и все три раза сразу создавались транзакции по выводу всей суммы. судя по всему так быть не должно  есть идеи как это можно объяснить?клиент electrum-4.3.2.exe  - standalone executable, скачан с оффсайта https://electrum.org/#downloadкошельки добавлены через import private key, комп чистый ничего лишнего не ставилось, антивирус-фаервол все на месте. переводы делались из bitcoin core клиентаhttps://i.postimg.cc/c41y7nC4/1.pngтранзакции  тутэккаунт 1https://www.blockchain.com/btc/address/1PqSBQ34vJRc6xWyXCm4BXwCY7YX5DuMG6эккаунт2https://www.blockchain.com/btc/address/1EvuuCxDT1JHR6CtnWw1RtPhmeU4axBwbKесть идеи как это можно объяснить?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419640",
  "comments": [
    {
      "author": "A-Bolt",
      "created_time": "November 06, 2022, 05:40:47 PM",
      "body": "Quote from: denis.korablev on November 06, 2022, 04:18:25 PMкошельки добавлены через import private keyМожно предположить, что импортированный вами приватный ключ скомпрометирован, то есть, известен не только вам.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "andy_pelevin",
      "created_time": "November 06, 2022, 06:14:36 PM",
      "body": "Quote from: denis.korablev on November 06, 2022, 04:18:25 PM...кошельки добавлены через import private key,...Как я понял, кошелёк пустой. Зачем в него импортировать старые ключи? Нужно сделать новый ключ и больше не использовать старые адреса. Если старые адреса привязаны к каким либо сервисам, то следует позаботиться об обновлении своих реквизитов в этих сервисах.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "denis.korablev",
      "created_time": "November 06, 2022, 06:29:41 PM",
      "body": "да, это может все объяснить. но в этом случае интересно, как это может быть технически реализовано. транзакции на вывод появились буквально в ту же секунду как пришел перевод, это явно было сделано не вручную. существует ли какой-то механизм отслеживания транзакций на адресе и автоматическое создание транзакции на вывод? интересно разобраться в ситуации. для эксперимента хочу попробовать импортировать этот ключ в биткоин коре на заведомо чистой линукс машине и сделать еще тестовый перевод. если транзакция на вывод также будет автоматически создана - значит кто-то как-то делает это извне. если ситуация не повторится, значит проблема была в виндовой машине или електрум клиенте.любопытно, что на мой взгляд увести ключи возможности не было, они были сгенерированы локально и сразу импортированы в электрум. ни в одном клиенте ранее эти ключи не использовались. пока наиболее логичным объяснением было бы использование \"плохого\" электрум клиента, но он с офсайта... Как предварительный итог - пользоваться электрумом желание пропало  но выяснить что же произошло - интересно, возможен вариант что и винда \"с закладкой\" т.к. устанавливалась с торрента>>Зачем в него импортировать старые ключи? Нужно сделать новый ключ и больше не использовать старые адреса.это был локально созданный vanity address, хотелось именно с ним поэкспериментировать. понимаю что нужно было делать новый ключ, это скорее был небольшой эксперимент, который для меня крайне неожиданно завершился )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A-Bolt",
      "created_time": "November 06, 2022, 07:18:21 PM",
      "body": "Quote from: denis.korablev on November 06, 2022, 06:29:41 PMсуществует ли какой-то механизм отслеживания транзакций на адресе и автоматическое создание транзакции на вывод? Разумеется, существует. Как только вы отправили транзакцию, она тут же, ещё до попадания в блок, попадает в мемпул и становится видна всем. При появлении вашей транзакции в мемпуле, злоумышленник отправляет свою транзакцию, которая отправляет биткойны из вашей транзакции на свой адрес. И ваша транзакция, и транзакция злоумышленника попадает в один и тот же блок, поэтому ваши биткойны даже не успевают появиться на балансе Electrum - они уже потрачены в том же самом блоке.Всё это можно автоматизировать при помощи Bitcoin Core и специально написанной программы. Bitcoin Core передаёт программе транзакции из мемпула, и, при появлении в мемпуле вашей транзакции, программа отправляет через Bitcoin Core свою транзакцию.    Quote from: denis.korablev on November 06, 2022, 06:29:41 PMэто был локально созданный vanity addressТак, может, всё дело не в Electrum, а в этом генераторе адресов? Дайте ссылку, откуда вы его скачали.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "November 07, 2022, 02:04:42 AM",
      "body": "Quote from: denis.korablev on November 06, 2022, 06:29:41 PMда, это может все объяснить. но в этом случае интересно, как это может быть технически реализовано. транзакции на вывод появились буквально в ту же секунду как пришел перевод, это явно было сделано не вручную. существует ли какой-то механизм отслеживания транзакций на адресе и автоматическое создание транзакции на вывод? интересно разобраться в ситуации. Практически все скомпрометированные приватные ключи, секретные фразы, \"брейн\" кошельки постоянно отслеживаются на предмет изменения баланса. Как только происходит транзакция, автоматически создается и вторая: с более высокой комиссией на адрес мошенника. Это никак нельзя обойти, нужно обязательно генерировать новые рандомные ключи. Ну или банально, вы наткнулись на фишинговое ПО, которое сненерировало уже скомпрометированный ключ. Но суть та же.Quoteпока наиболее логичным объяснением было бы использование \"плохого\" электрум клиента, но он с офсайта... Как предварительный итог - пользоваться электрумом желание пропало  С клиентом с официального сайта все в порядке, но только если вы сами проверили все подписи и самостоятельно убедились, что клиент подлинный. К тому же если локальный компьютер хоть раз взаимодействовал с внешней сетью, то его нельзя назвать безопасным: любой сгенерированный ключ нужно по умолчанию считать скомпрометированным.Quoteэто был локально созданный vanity address, хотелось именно с ним поэкспериментировать. понимаю что нужно было делать новый ключ, это скорее был небольшой эксперимент, который для меня крайне неожиданно завершился )Согласен с A-Bolt, дело скорее всего в софте, генерирующим vanity-адреса. Нет никакой гарантии, что выданный вам ключ не был заранее сгенерирован и хранился в базе мошенников или что он не пересылался куда-либо во время создания. С такими адресами нужно быть аккуратнее. Клиент должен быть хорошо известен, с открытым исходным кодом и проверять адрес нужно с тестовыми суммами.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "igor72",
      "created_time": "November 07, 2022, 11:47:54 AM",
      "body": "Заметил, что транзакции с этих разных \"аккаунтов\" отличаются версией, как будто разным софтом создавались. Дальше выяснилось, что и ключи в транзакциях были разного типа (сжатый и несжатый), возможно поэтому и версии разные. Похоже, что два адреса, с которых угнали монетки, созданы в разных программах, но автор об этом ничего не сказал.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}