{
  "id": "topic_5456001",
  "title": "ARCTICWALLET",
  "author": "ARCTICWALLET",
  "created_time": "June 11, 2023, 03:02:58 AM",
  "content": "What happened: I was looking for wallet instant of Atomic Wallet and found wallet called Arctic Wallet once installed and used for about a week all went fine but after deposit 800k TEZOS all my money gone the thing i remember is they offer me to backup my privatekey with them on their end and i agreed to this without knowing its risky so what i think its the wallet company steal my money i have contacted police and laws i will keep update on this case. by the way it happen to many users around i found at last 10 reports this week against CHANGEHERO/ARCTIC WALLETScammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=2589379 , https://bitcointalk.org/index.php?action=profile;u=2729645 , https://bitcointalk.org/index.php?topic=1139923.0Reference Link: Amount Scammed: 800k TEZ Payment Method: TEZOSProof of Payment: REPORTED TO LAWPM/Chat Logs: no anyAdditional Notes: I have reported all to law and police and cannot give more info, but i created this post to locate more people who surfing the same issue from CHANGE HERO and Arctic wallet",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456001",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "June 11, 2023, 03:31:10 AM",
      "body": "I don't know what you were thinking as to buy $0.5M of a shitcoin and stick them in a shit wallet. I hope at least your net worth is 100 times that amount.The link you put of https://bitcointalk.org/index.php?topic=5456001.0 is about Arctic Coin, not Arctic Wallet, although I guess they are related but the thread hasn't been updated for three years and to negative tag the OP is going to be useless.On trustpilot they have pretty good reviews, by the way and some could be bought but it would be weird if they were a scam and there weren't a few reviews indicating it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CypherMonk",
      "created_time": "June 11, 2023, 07:38:55 AM",
      "body": "Quote from: ARCTICWALLET on June 11, 2023, 03:02:58 AMWhat happened: I was looking for wallet instant of Atomic Wallet and found wallet called Arctic Wallet once installed and used for about a week all went fine but after deposit 800k TEZOS all my money gone the thing i remember is they offer me to backup my privatekey with them on their end and i agreed to this without knowing its risky so what i think its the wallet company steal my money i have contacted police and laws i will keep update on this case. by the way it happen to many users around i found at last 10 reports this week against CHANGEHERO/ARCTIC WALLETScammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=2589379 , https://bitcointalk.org/index.php?action=profile;u=2729645 , https://bitcointalk.org/index.php?topic=1139923.0Reference Link: Amount Scammed: 800k TEZ Payment Method: TEZOSProof of Payment: REPORTED TO LAWPM/Chat Logs: no anyAdditional Notes: I have reported all to law and police and cannot give more info, but i created this post to locate more people who surfing the same issue from CHANGE HERO and Arctic wallet Hey, I believe someone mentioned this yesterday here, if not you. It's important to add supporting evidence like screenshots of transactions when making scam accusations, otherwise, it just sounds like bullshit!I don't know what you are trying to do if you are the same person from yesterday. Providing evidence of the transaction will surely prove that what you are saying is correct. For your information, calling out a company without sufficient evidence will end up terribly for you.I personally think your scam accusation post is not enough!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "June 11, 2023, 02:13:29 PM",
      "body": "Your name showing that you are the owner or atleast promoters of ARCTIC WALLET. Your name should be Scam or other similar words like Arctic wallet scamQuote from: ARCTICWALLET on June 11, 2023, 03:02:58 AMWhat happened: I was looking for wallet instant of Atomic Wallet and found wallet called Arctic Wallet once installed and used for about a week all went fine but after deposit 800k TEZOS all my money gone the thing i remember is they offer me to backup my privatekey with them on their end and i agreed to this without knowing its risky so what i think its the wallet company steal my money i have contacted police and laws i will keep update on this case. by the way it happen to many users around i found at last 10 reports this week against CHANGEHERO/ARCTIC WALLETThis is another scam report but this time it's about wallet hack. first of all i wonder that still people are using this kind of shit wallet for holding big funds. we are scaring to hold more than 1k$ fund in Electrum wallet despite of open source and community trust.you backup your private key cloudly which is also dangerous and many users data revealed in this way, my personal wallet phrase compromised in this way. Now we cannot say that your fund are stolen by Arctic wallet team. you should provide all possible screenshot to make this useful for other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}