{
  "id": "topic_5465779",
  "title": "Smeet",
  "author": "Smeet",
  "created_time": "September 05, 2023, 05:34:53 PM",
  "content": "I've been in situations where I often forget my Wi-Fi password as it consists of complex characters and symbols i don't typically use.I recently learned of a way to figure out the wifi password if you happen to have a device connected already and just don't remember it.If you type \"netsh wlan show profile WIFISSID key=clear\" in your command prompt <- replace the WIFISSID with your Wifi name. It should spit out the wifi password key that is being used.Note: This does not require admin rights!Here's a screenshot of me figuring out my forgotten wifi password. Hope this helps anyone!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465779",
  "comments": [
    {
      "author": "sysoe",
      "created_time": "September 06, 2023, 08:39:32 AM",
      "body": "Pretty cool. Just tried it, and it works. It's always frustrating when you forget a complex Wi-Fi password, and this is a handy solution. Plus, the fact that it doesn't require admin rights makes it even more convenient. Thanks for sharing this tip!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "September 06, 2023, 09:52:32 AM",
      "body": "Shouldn't that information be private? Or Is it safe to post it on public forum? Unfortunately, couldn't go through it because of the moral problem of going through what is probably someone's private info that should be kept private with or without the owners consent.Consent should not be taken from people who are ignorant or don't understand what they are consenting to unless you are certain it will never be abused",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smeet",
      "created_time": "September 06, 2023, 02:55:11 PM",
      "body": "Quote from: Ucy on September 06, 2023, 09:52:32 AMShouldn't that information be private? Or Is it safe to post it on public forum? Unfortunately, couldn't go through it because of the moral problem of going through what is probably someone's private info that should be kept private with or without the owners consent.Consent should not be taken from people who are ignorant or don't understand what they are consenting to unless you are certain it will never be abusedI appreciate the concern, however i did censor out my username and WIFI SSID fields. The only sensitive information remaining is the password key which is meaningless without any other info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "September 08, 2023, 05:15:35 AM",
      "body": "Well for me my Wifi password is something I will never forget. It is my mothers birthday and my fathers birthday. And even though I do not speak with them.  It is still dates in my history that I will live with and always have to",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zenp",
      "created_time": "September 12, 2023, 01:22:50 PM",
      "body": "Quote from: Smeet on September 05, 2023, 05:34:53 PMI've been in situations where I often forget my Wi-Fi password as it consists of complex characters and symbols i don't typically use.I recently learned of a way to figure out the wifi password if you happen to have a device connected already and just don't remember it.If you type \"netsh wlan show profile WIFISSID key=clear\" in your command prompt <- replace the WIFISSID with your Wifi name. It should spit out the wifi password key that is being used.Note: This does not require admin rights!Great tip! I tend to use unique passwords for all my services and often forget my wifi password.Just wanted to add to your cmd promt that if you use the following code, you can get the same details for all your saved connections. Meaning you don't have to enter SSID name. This is helpful especially if your SSID name is long/complicated.Code:for /f \"skip=9 tokens=1,2 delims=:\" %i in ('netsh wlan show profiles') do @echo %j | findstr -i -v echo | netsh wlan show profiles %j key=clearinstead of:Code:netsh wlan show profile WIFISSID key=clear",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danilo Malaggay",
      "created_time": "September 15, 2023, 01:46:46 PM",
      "body": "Learning about wifi it’s not very hard it’s very eassy if you try with youtube videos just go youtube & search how to handle/setup wifi / router etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "September 15, 2023, 07:35:16 PM",
      "body": "It's not a new thing. It was always there. Anybody who has knowledge about command line/CMD/PowerShell/Terminal could do it. It would simply show the password of the wifi which was already connected before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jinx9975",
      "created_time": "December 15, 2023, 02:38:16 AM",
      "body": "WiFi 6E capable routers and devices first became available to consumers in 2021. However it is still early, and the amount of devices that can use WiFi 6E remains limited.Over the next 2-3 years, WiFi 6E adoption is expected to grow rapidly. So while it may not impact your home network today, WiFi 6E does represent the future of WiFi standards.The evolution continues! It will be interesting to see what new innovations WiFi 7 ends up introducing in the coming years when it eventually gets ratified and released.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 17, 2023, 01:59:01 AM",
      "body": "or more simply go into your network properties of a connected device and press ☑ show characters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "December 17, 2023, 02:20:05 AM",
      "body": "Quote from: Danilo Malaggay on September 15, 2023, 01:46:46 PMLearning about wifi it’s not very hard it’s very eassy if you try with youtube videos just go youtube & search how to handle/setup wifi / router etc.None of us said it was hard , but what OP did here is to share at least shortcut whenever we forgot our password that commonly happening specially to people like us who has tight password setup .and also never trust internet completely because sometimes what videos and people in internet tells you is also  trap to make you a victim.If you think that it is easy to set up then do it mate.________________________________________________OP thanks for this share , I always forget my Wifi lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}