{
  "id": "topic_5470090",
  "title": "mandown",
  "author": "mandown",
  "created_time": "October 12, 2023, 02:40:15 PM",
  "content": "Uzun zamandır pos'un doğru bir şeçim olmadığını forumda söylüyordum benim söylemimi ftx'in sahibi olan karaktersizin sevgiliside doğrulamış oldu. Düşünün  siz btc'nin fiyatını düşürmek istiyorsunuz ancak ftx'in sahibi düşürmek istiyor ve gidiyor insanları liq edebilmek için ağı durduruyor. Hatırlarmısınız bilmem solana ağı bir dönem feci anlamda sık sık duruyor veya yaptığınız işlemler gerçekleşmiyordu. Sebebinide anlamış olduk.QuoteBF'nin eski kız arkadaşı ve Alameda'nın CEO'su olan kadının mahkemedeki beyanı;- Solana merkezi bir coin miydi ?+ Evet, Solana VC blockchainiydi. İstediğimiz zaman açıp kapatabiliyorduk.- Hiç kapatma gereği duydunuz mu peki ?+ Evet, Long pozisyonu olan kullanıcıları likit etmek için yaptık.- Kim yapıyordu peki?+ FTX developerları...Kaynak :https://twitter.com/kriptogelisim/status/1712473031271215150Şimdi bir eksim tabiki pos'u savunacak aynı ağ üzerinde kurulmuş sadece 1 pc üzerinden veya dünya üzerinde birkaç konuma kurulmuş virtual machine'ler yani sanal pcler üzerinden istediğiniz kadar ürünü sanki merkezi değil gibi gösterebilirsiniz ve bunun maliyetide ciddi anlamda komik rakamlar birkaç dolarlık alacağınız rp4 bile rahatlıkla ağı koruyabiliyor sözde.Şimdi pos olayına inanılmaz derecede karşı biriyim her ne kadar eth tarafında validator olarak inanılmaz rakamlar görünüyor olsada acaba kaç tane gerçek anlamda farklı node var? Ağın %kaçı acaba kaç node üzerinde kurulu.Pos elektriksel maliyet çözümü gibi görünsede ucuz, kolay ve neredeyse kurumu zorunlu olan bir yapı geliştirilmedikçe bu pos denen şey şimdilik zararımıza bile olabilir.Kriptoya inancım tam ancak pos yeterli bir çözüm olduğunu kesinlikle düşünmüyorum forumda kaç kişi güvendiği ağa ait node kurup güvenliği sağlıyor? Çok enteresan bir konu bu ve çok su kaldıracak gibi duruyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470090",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "October 12, 2023, 07:01:04 PM",
      "body": "POS bir zincir asla POW konsensüs mekanizması ile çalışan bir zincir kadar merkeziyetsiz olamayacak. Olasılıksal olarak böyle bir ihtimal var görünüyor olsa bile sistemdeki herkesin iyi niyetli olması gerekiyor. Şu an POS konsensüs mekanizmasına sahip zincirler arasında ethereumun yaptığı POW başlangıçlı POS geçişi olsa bile premine olması, yatırımcılara sahip olması, çoğunluğun fikrine yön veren merkezi bir yapı tarafından yönetiliyor olması ve benzeri sebeplerle gerçek bir merkeziyetsizlik durumundan bahsetmek mümkün değil ki POS'lar arasında açık ara en merkeziyetsiz olan ethereum. İlgi bu kadar yoğunken POW bir zincirin bugün başlatıldığını varsayarsak onunda merkeziyetsizlikle ilgili çeşitli sıkıntılar yaşayacağı neredeyse kesin. Çünkü herkesin günlük hayattaki varlığı ve gücü eşit değil, şartları da değil. Bitcoin adına isterseniz doğru anda doğru yerde tohumlanmak deyin ister tesadüf deyin belki de olabilecek en iyi şartlarda ortaya çıktığı için bugün hepimiz güveniyoruz. Ethereumun teknolojik olarak ekosisteme kattıklarını bitcoinin benzer gelişim hızıyla katması mümkün değildi orası ayrı. En azından bir borsanın yada tek bir zümrenin doğrudan boyunduruğu altında olmadığı için solana, BSC gibi tamamen çok kısıtlı grupların güç sahibi olduğu zincirlerden ayrılıyor. Solana, Tron, BSC bunlar merkeziyetsiz olmayı bırakın eleştirdiğimiz bankalardan bile daha merkezi haldeler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 12, 2023, 08:46:28 PM",
      "body": "Quote from: Bthd on October 12, 2023, 07:01:04 PM-Ağacı kesen baltanın da sapı ağaçtandır derler. Bankaların bu piyasaya veremediği zararı bu coin ve tokenlar işte böyle veriyor. Pow ya da pos farketmiyor sonuç olarak o aradaki merkeziyetsizliği sağlayabilmek için çok ciddi bir fikir ayrılığı ya da fikir birliği (iyi yönde tabiki de  ) olması gerekiyor tam ortadaki dengeyi sağlayabilmek için. Silikon Vadisi dizisinde bir sahne vardı *SPOILER ALEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEERT*  yanlış hatırlamıyorsam sistemde %51'lik saldırı yaparak yeniden kod yazmaya çalışılırken bir oyun sayesinde götlerini kurtarmışlardı. Keza bu sahnede çinden farm yardımı ile %51'i ele geçirmeye çok yaklaşmışlardı. Yani demem o ki her sistem ya da method bir açık kapıya sahiptir ve o kapıdan sıkıntı vereceklerin geçme ihtimali her daim olacaktır. Ancak ölümü görüp sıtmaya razı olabiliyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 12, 2023, 10:13:10 PM",
      "body": "Quote from: meser# on October 12, 2023, 08:46:28 PMPow ya da pos farketmiyor sonuç olarak o aradaki merkeziyetsizliği sağlayabilmek için çok ciddi bir fikir ayrılığı ya da fikir birliği (iyi yönde tabiki de  ) olması gerekiyor tam ortadaki dengeyi sağlayabilmek için. Sistemin tasarımı tabiki fark ediyor hocam. %51'in fikir birliği sağlayabilmesi konusu zaten mevcut durumda standart paket gibi, dışına çıkan çok az zincir ve konsensüs mekanizması var. Mesele zincirde söz sahibi olabilmenin gerektiği şartlar noktasında değişiklik gösteriyor en fazla. Bitcoin için bir node kurmak isterseniz sıfıra yakın maliyetle kurarsınız yada madencilik yapmak istiyorsanız kimse sizi engellemez. Satoshi bugün dönse sadece sözleriyle insanları etkileyebildiği kadar zincir üzerinde bir hakimiyeti olabilir çünkü tasarım yaratıcıdan bağımsız yürüyecek şekilde tasarlanmış. Yada Satoshi bugün örnekteki gibi bitcoin zincirini durdurmak istese durduramaz. Bitcoin zincirine maliyeti yeterince uzun süre karşılayıp %51 saldırısı düzenleyerek tüm bitcoinleri kendisine alan bir kişi olsa bile kişinin elinde kalabilecek tek şey koca bir 0. En basitinden insanlar olayın olduğu tarihten hemen önceki bir tarihteki noktadan zinciri kopararak farklı forkları kullanmaya devam eder.POS türevlerinin çoğunda ise (örnekte eleştirilen solana yada BSC gibi) onaylayıcı olmak, zincirde söz sahibi olmak sert çizgilerle yaratıcı egemen gücün kuralları dahilinde belirleniyor. Kimin yapıp yapamayacağını doğrudan seçebilen zincirler mevcut ki aynı zamanda merkeziyetsiz olduklarını iddia edebilecek kadar da cüretkarlar. Ethereum için durum daha farklı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 13, 2023, 07:35:29 AM",
      "body": "Quote from: Bthd on October 12, 2023, 10:13:10 PMQuote from: meser# on October 12, 2023, 08:46:28 PMPow ya da pos farketmiyor sonuç olarak o aradaki merkeziyetsizliği sağlayabilmek için çok ciddi bir fikir ayrılığı ya da fikir birliği (iyi yönde tabiki de  ) olması gerekiyor tam ortadaki dengeyi sağlayabilmek için. Sistemin tasarımı tabiki fark ediyor hocam. %51'in fikir birliği sağlayabilmesi konusu zaten mevcut durumda standart paket gibi, dışına çıkan çok az zincir ve konsensüs mekanizması var. Mesele zincirde söz sahibi olabilmenin gerektiği şartlar noktasında değişiklik gösteriyor en fazla. Bitcoin için bir node kurmak isterseniz sıfıra yakın maliyetle kurarsınız yada madencilik yapmak istiyorsanız kimse sizi engellemez. Satoshi bugün dönse sadece sözleriyle insanları etkileyebildiği kadar zincir üzerinde bir hakimiyeti olabilir çünkü tasarım yaratıcıdan bağımsız yürüyecek şekilde tasarlanmış. Yada Satoshi bugün örnekteki gibi bitcoin zincirini durdurmak istese durduramaz. Bitcoin zincirine maliyeti yeterince uzun süre karşılayıp %51 saldırısı düzenleyerek tüm bitcoinleri kendisine alan bir kişi olsa bile kişinin elinde kalabilecek tek şey koca bir 0. En basitinden insanlar olayın olduğu tarihten hemen önceki bir tarihteki noktadan zinciri kopararak farklı forkları kullanmaya devam eder.POS türevlerinin çoğunda ise (örnekte eleştirilen solana yada BSC gibi) onaylayıcı olmak, zincirde söz sahibi olmak sert çizgilerle yaratıcı egemen gücün kuralları dahilinde belirleniyor. Kimin yapıp yapamayacağını doğrudan seçebilen zincirler mevcut ki aynı zamanda merkeziyetsiz olduklarını iddia edebilecek kadar da cüretkarlar. Ethereum için durum daha farklı.Bahsettiğiniz noktada haklısınız hocam benim dikkat çekmek istediğim nokta orada o merkeziyetsizliği sağlayabilmek adına ya sağlam bir fikir ayrılığı sağlayabilip ne sağ ne sol en iyisi orta yol dedirtmek ya da herkes aynı noktada topluluğun menfaati doğrultusunda karar alabilecek nitelikte iyimser olmaları gerektiği. Tabiki bitcoin gibi bir teknolojiyi %51'i eline alarak hakimiyet kurabilen insan eninde sonunda elinde sıfır kalacaktır. Hatta bir zamanlar gözlemlediğim ilk airdrop furyasında birçok token çıkartıp pumplayıp sonra elindeki sıfır değerdeki çöpleri millete kitleyen projeler vardı. Teorik olarak bakarsak bunlarda da aynı durum (Çoğunda pos olup hali hazırda mine edilmişlerin ufak bir kısmını airdrop olarak dağıtıp biraz alım emri vererek hacim oluştururlar )var ancak sözde merkezileştirilmemiş ama özde tek bir merkeziyete sahip. Bedava peynir var diyerek fare kapanına çekip ufak bir parça pump yemiyle millet cebine para girer ve güvenip projeye şöyle uçacak böyle kaçacak diye nidalar eder sonra güzelce millet hacim yaratınca tahtada yer alan alım miktarı kadarı satışa koyar ve sonra kayıplara karışır. Ha burada gizli %51 hakimiyet hesabını alıcılar görememiştir çok açık ortada ancak bedava peynir çoğu insanı kör edebilir. Nitekim bir gün önce tanesi 1$'a ulaşmak üzere olan token sabah bakmışsındır 0.00000001$ olmuştur. Sizin de dediğiniz gibi bitcoinin tasarımı ve satoshi abimizin ortaya koyduğu efor farklı kılıyor tamamen. Uçuk bir teori olacak belki de ama bitcoin belki de bu yüzden sürekli dolaşımda kalacak ama diğer yandan bitcoin killer diye lanse edilen projeler bu merkeziyet durumundan toz olup gidecekler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 13, 2023, 08:11:47 AM",
      "body": "Yarın ftx veya bnb ağının ansınızın durmayacağının veya merkezi gücün istediğini yapmayacağının bir garantisi varmı? Bunlar sözde merkezi olmayan ağlar değilmiydi? Şuna anlam veremiyorum eskiden ben eth ağı için node bile çalıştırdığım dönemler oldu ancak layer2 lerde mevcut durum ne bilen varmı? Bunlar nasıl merkeziyetsizliğe değer vererek iş yapıyor veya yapmaya devam edecek.Birkaç yıl öncesine kadar merkeziyetsizlik kriptoda en önemli konulardan biriydi ancak geldiğimiz noktada sadece ve sadece bu durumu btc sağlamaya devam etmekte.Eth merkeziyetsiz diyenlerde bana göre kendi hayal dünyalarını yaşıyor valide ettiğiniz node'ların bulunduğu ülkeler ne derse yeri gelecek onların o node'larda zorunlu dedikleri yapılacak siz oradan kaldırsanız bile bu bile bir zaman alacak.POW'da sorunsuz değil %51 olayı tamamen saçma daha fazla bir koruma gerekli. Nasıl yapılır bilmiyorum ama şuan piyasada madenciliği yapılan birkaç ghzlik güçlere %51 yapmak için öyle ahım şahım bir parada gerekmiyor. Daha önceden deneyimlediğim bir olay bu. %51'i yapacak adam ağı en az 1-2 ay öncesinden aslında ele geçirir 1 tane ekran kartı veya benzer bir düşük hash ile nodu ayakta tutarak o sürçteki bütün blockları kendi cüzdanına alır ve  diğer gücü o ağa aktif eder sonra %51 üstü bir durumdaysa ağı internete açar ancak 1 tane internet dışı node bırakmıştır işlemin tekrarı için ve tadaaa %51'i geçtiği an ağda yapılan 1 aylık işlemlerin tamamı silinir onun yaptığı işler kalır ve o ürünü borsaya yollar satar bu işlemi borsa anlayana kadar yapabilir. Bu pow yapısındaki en büyük sorundur. Aslında sözde soyulan kullanıcılar gibi görünsede aslında borsasın kasasıdır. Kullanıcıların varlıklarını koruması gereken borsadır. POW ve POS tek başına güvenli değil ancak pow ne kadar merkeziyetsizliğe yakın olsada pos'un yakından uzaktan alakası yoktur.  Örnek veriyorum lukso 40 milyon tokenın suan 2 milyonu stake edildi taş çatlasa 30 tane node var. Bumudur yani merkeziyetsizlik. 70k da validator var. Neden lukso diyorum sonuçta pos'ların tamamı bu yoldan geçiyor. Luksoyu birisi gidip 1.1 milyon alıp ağda istediği atı koşturabilir. O günden sonra ağ birinin eline geçer ve yatırımlar ve proje resmen ölür şimdi buradaki en büyük sorun %51 ele geçirildikten sonra nasıl ağ eski haline getirilecek. Sonuçta pos'dada %51 olayı olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 13, 2023, 09:04:45 AM",
      "body": "bnb ile ftx ya da solana'yı karıştırmamak gerekiyor bence çünkü kurumsallaşmış bir kriptodan bahsediyoruzbtc'de bile yüzde 50+1 imkanı varken (ki satoshi de bahsediyor makalesinde) oradaki durum daha çok anonim bir saldırı ihtimali ancak bnb ağında CZ ve binance var, daha önce ağı durdurup hack önlemişlerdi sanırım, her ne kadar merkeziyetsizlik için eksi de olsa işlerin düzgün yürümesi açısından iyi gibi görünüyordu. yani birinde fail belliyken diğerinde anonimlik ön planda, dolayısıyla yapılacak yanlış (!) bir hareket kuruma zarar verir, bu da bitcoin ağının ele geçirilip 0'lanmasından farksız üstelik cezai müeyyideler ile de karşılaşılması olası   btc liberalse bsc de karma ekonomik model diyebilirz  https://x.com/cz_binance/status/1578171072067031042?s=20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 13, 2023, 09:12:23 AM",
      "body": "@wolwoo buradaki sorun ağı durduran kişinin kontrolünde olması yarın adam farklı bir kontrat ile bnb mintlemeyeceğinin garantisi varmı? sözde limitli ama anahtar adamın elinde sorun sadece mintlemesi bie değil minti kim farkedecek? mint gibi nice sorun var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 13, 2023, 03:23:09 PM",
      "body": "Quote from: wolwoo on October 13, 2023, 09:04:45 AMbnb ile ftx ya da solana'yı karıştırmamak gerekiyor bence çünkü kurumsallaşmış bir kriptodan bahsediyoruzbtc'de bile yüzde 50+1 imkanı varken (ki satoshi de bahsediyor makalesinde) oradaki durum daha çok anonim bir saldırı ihtimali ancak bnb ağında CZ ve binance var, daha önce ağı durdurup hack önlemişlerdi sanırım, her ne kadar merkeziyetsizlik için eksi de olsa işlerin düzgün yürümesi açısından iyi gibi görünüyordu. yani birinde fail belliyken diğerinde anonimlik ön planda, dolayısıyla yapılacak yanlış (!) bir hareket kuruma zarar verir, bu da bitcoin ağının ele geçirilip 0'lanmasından farksız üstelik cezai müeyyideler ile de karşılaşılması olası   btc liberalse bsc de karma ekonomik model diyebilirz  https://x.com/cz_binance/status/1578171072067031042?s=20Binance ile FTX'in olaylarının ortaya çıkmadan önce dışarıdan görünür farkı neydi ? FTX daha kurumsal görünüyordu, ABD'de daha net bağlantılara sahipti. FTX merkez olarak Bahamaları kullanırken Binance'da ABD'de, İngiltere'de merkez kurma derdinde değildi Malta'ya demir atma peşindeydi.BTC için %51 matematiksel bir olasılık, bu demokrasi için de öyledir. Oturmamış demokrasilerde ülkeleri %51 ile diktatörler yönetebilir fakat BTC'yi yönetemezler. Orijinal zincirde bir güç %51 için çok büyük parasal yükü kabullenerek ele geçirse bile bir kaç saat/gün sonra oluşacak fork ile herkes olay öncesi yeni bir zincire geçeceği için kimse etkilenmez. Saldırganın elinde değersiz birimler kalır ki bu yüzden BTC için çok uzun zamandır bir %51 denemesi görmüyoruz. Demokrasilerde ise benzeri seçenek yok.BTC için Satoshi'nin kendisi, ilk yaratılışta yardımcı olan Hal Finney dirilip gelse ve diğerleri de bir arada %51 atmaya kalksalar zincirin yönetimini ele geçiremezler çünkü yönetim diye bir şey yok. BSC bir hack saldırısında kullanıcılarını korumak için yaptığı hareketi bir gün silah olarak da kullanabilir çünkü doğrudan görünmese dahi onaylayıcıları seçen yönetici modeli var. Paylaştığınız twitteki sorduk kelimesi şirketlerde patronun çalışanına şu dosyayı hazırlarmısınız sorusu kadar soru cümlesi sadece. Klasik bankadan zerre farkı yok ilaveten negatif yönlere sahip. Anlık hype değerlendirip karlılık dışında BSC kullanacak adamın kriptoyla en ufak ilişkisi yok demektir. BSC için merkeziyetsizlik tartışması yapmak bile bence abes. Solana'dan da bu yönüyle zerre farkı yok. Ne binance, ne BNB, ne BSC her biri kripto olamayacak kadar merkeziler ve ekosistemin gerçek bir parçası değiller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 13, 2023, 04:26:49 PM",
      "body": "Quote from: Bthd on October 13, 2023, 03:23:09 PMQuote from: wolwoo on October 13, 2023, 09:04:45 AMbnb ile ftx ya da solana'yı karıştırmamak gerekiyor bence çünkü kurumsallaşmış bir kriptodan bahsediyoruzbtc'de bile yüzde 50+1 imkanı varken (ki satoshi de bahsediyor makalesinde) oradaki durum daha çok anonim bir saldırı ihtimali ancak bnb ağında CZ ve binance var, daha önce ağı durdurup hack önlemişlerdi sanırım, her ne kadar merkeziyetsizlik için eksi de olsa işlerin düzgün yürümesi açısından iyi gibi görünüyordu. yani birinde fail belliyken diğerinde anonimlik ön planda, dolayısıyla yapılacak yanlış (!) bir hareket kuruma zarar verir, bu da bitcoin ağının ele geçirilip 0'lanmasından farksız üstelik cezai müeyyideler ile de karşılaşılması olası   btc liberalse bsc de karma ekonomik model diyebilirz  https://x.com/cz_binance/status/1578171072067031042?s=20Binance ile FTX'in olaylarının ortaya çıkmadan önce dışarıdan görünür farkı neydi ? FTX daha kurumsal görünüyordu, ABD'de daha net bağlantılara sahipti. FTX merkez olarak Bahamaları kullanırken Binance'da ABD'de, İngiltere'de merkez kurma derdinde değildi Malta'ya demir atma peşindeydi.BTC için %51 matematiksel bir olasılık, bu demokrasi için de öyledir. Oturmamış demokrasilerde ülkeleri %51 ile diktatörler yönetebilir fakat BTC'yi yönetemezler. Orijinal zincirde bir güç %51 için çok büyük parasal yükü kabullenerek ele geçirse bile bir kaç saat/gün sonra oluşacak fork ile herkes olay öncesi yeni bir zincire geçeceği için kimse etkilenmez. Saldırganın elinde değersiz birimler kalır ki bu yüzden BTC için çok uzun zamandır bir %51 denemesi görmüyoruz. Demokrasilerde ise benzeri seçenek yok.BTC için Satoshi'nin kendisi, ilk yaratılışta yardımcı olan Hal Finney dirilip gelse ve diğerleri de bir arada %51 atmaya kalksalar zincirin yönetimini ele geçiremezler çünkü yönetim diye bir şey yok. BSC bir hack saldırısında kullanıcılarını korumak için yaptığı hareketi bir gün silah olarak da kullanabilir çünkü doğrudan görünmese dahi onaylayıcıları seçen yönetici modeli var. Paylaştığınız twitteki sorduk kelimesi şirketlerde patronun çalışanına şu dosyayı hazırlarmısınız sorusu kadar soru cümlesi sadece. Klasik bankadan zerre farkı yok ilaveten negatif yönlere sahip. Anlık hype değerlendirip karlılık dışında BSC kullanacak adamın kriptoyla en ufak ilişkisi yok demektir. BSC için merkeziyetsizlik tartışması yapmak bile bence abes. Solana'dan da bu yönüyle zerre farkı yok. Ne binance, ne BNB, ne BSC her biri kripto olamayacak kadar merkeziler ve ekosistemin gerçek bir parçası değiller.üstad bsc tam merkeziyetsiz demedim görece bazı farklılıkları var dedim. Malta'ya taşınması da aslında (her ne kadar pek işe yaramazsa da) regülasyonlara dirençlilik kazanabileceği anlamına geliyor. paradoks var burada.CZ bsc ağını kontrol ediyor evet ama community karşısına alamaz, alırsa binance bnb bsc hepsi çöker.hatta bitcoin de çöker, örnek; mtgox. ha tekrar toparlanır btc orası ayrı ama özellikle fiyat açısından önce tüm kriptolar seri şekilde yara alır.şunu kabul edelim; binance eko sistemi gerek borsa gerek bsc tokenları (eth'ye göre bir sürü avantajı var) gerekse bnb coin ile bu piyasanın kolay kolay gözden çıkaramayacağı bir ekosistem. ne sistemin sahipleri ne kullanıcıları ne de istediği kadar ekosistemden uzak duranlar bunun çökmesini istemez çünkü herkes naneyi yer  tıpkı Satoshi'nin \"gücü ele geçiren bunu kötüye kullanamaz bu mantıkdışı olur\" demesi gibi..iki yol var ya bnb-bsc-cz yavaş yavaş ekosistemde erir ve gücü azalır ya da anlık cortlama ile pimi çekilmiş bomba gibi tüm kriptonun üzerinden geçer. kriptoya darbe vurmak için bir tool olarak seçilebilir. Ayrıca CZ tüm yumurtaları bir sepette tutmuyor uniswaptan binancedex'e pancake'ten irili ufaklı bir sürü projeye ortak ya da büyük yatırımcı pozisyonunda. yani istesek de istemesek de CZ-BNB kriptonun bir parçası, merkezi olsa da merkeziyetsizlik için kurumsallaşma vs ile çaba harcıyor. Demokrasi gibi zamanla gelişip tam merkeziyetsizlik kazanabilir, geçmişte erc20'den kendi ağına nasıl geçtiyse ileride belki başka düzenlemeler yapılabilir.not; bilgi anlamında sizlerle yarışamam sadece düşüncelerimi yazıyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 16, 2023, 12:54:41 PM",
      "body": "ilginçhttps://twitter.com/Tether_to/status/1713889235499983172?t=Ogce9djXMVQAoR8NSYhsGQ&s=19",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 16, 2023, 06:37:50 PM",
      "body": "Tether zaten durduruyordu ilk defa durdurduğu bir olay değil bu. Mesele ağ güvenliği. Birde şu savaş olayı iyice saçma bir hal almaya başladı her firma bir tarafı tutuyor kimsenin insanların öldüğünü umursadığı yok rantlar devam etmeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 17, 2023, 08:18:31 AM",
      "body": "Quote from: wolwoo on October 16, 2023, 12:54:41 PMilginçhttps://twitter.com/Tether_to/status/1713889235499983172?t=Ogce9djXMVQAoR8NSYhsGQ&s=19https://www.gazeteduvar.com.tr/hamasin-servetinde-kripto-para-ne-rol-oynuyor-haber-1642692",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 17, 2023, 11:05:36 AM",
      "body": "Quote from: wolwoo on October 17, 2023, 08:18:31 AMhttps://www.gazeteduvar.com.tr/hamasin-servetinde-kripto-para-ne-rol-oynuyor-haber-1642692Her zamanki hikaye. Sevmediğin şeyi terör örgütleriyle iliştir ve onunda kötü olduğunu iddia et durumu. Nesneler iyi yada kötü olmaz, iyi yada kötü kullanım insanlara ait. Bitcoin yada tetherden çok daha önceleri de terör örgütleri finanse ediliyordu. Kurallar genellikle sadece kurallara uyma eğilimindeki insanları bağladığı için hangi para birimi kullanılırsa kullanılsın sonuç değişmez.Tetherin dilediği cüzdanlardaki varlığı dondurma olayı zaten fiat paralarda karşı çıkılan durumlardan birisi. Suç diye tanımladıkları şeyin tanımını değiştirerek diledikleri cüzdanı dondurma yetkisine sahipler. Bu terör örgütleri için de geçerli, masum insanlar için de geçerli. Wikileaks olaylarında suçlunun hangi taraf olduğu gibi tamamen tanımlayıcının elindeki yetkiden kaynaklanıyor. Birileri de aynı şekilde İsrail devletinin yaptıklarının suö olduğunu iddia ederek varlıklarını dondurmak isteyebilir. Bugün yaptıklarına ses çıkarılamamasının tek sebebi kuralları koyan tarafta yer alıyor olmaları. Her türlü terör örgütü, insan öldüren herkes benim gözümde suçlu tanımının içerisinde yer almayı hak eder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "December 03, 2023, 07:24:46 PM",
      "body": "Mixerlere yapılan baskının bir sonraki olayı pos coinler olabilir yarın sabah amerikada veya herhangi bir ülkede çalıştırılan pos sayesinde gel gel şunun hesabını ver veya eğer pos çalıştırıyorsan şu.... contratlardan gelen işlemlere izin vermeyeceksin gibi garip taleplerde bile bulunabilirler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Secret++",
      "created_time": "March 14, 2024, 04:08:00 PM",
      "body": "PoW candır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kodmanyagha",
      "created_time": "July 05, 2024, 11:02:09 AM",
      "body": "Olaya hiç bu açıdan bakmamıştım, bu konu hakkaten önemli aslında.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "July 05, 2024, 12:50:32 PMLast edit: July 05, 2024, 01:06:58 PM by Lachrymose",
      "body": "Bir varlık fair-launch değilse PoW ya da PoS olması bir şey ifade etmez. Bitcoin'i BTC yapan şey o günün \"fair-launch\" modelinin herkesin evindeki bilgisayarla Bitcoin kazanabiliyor olmasıydı. Bugün aynı \"fair-launch\" modeli AoTheComputer gibi kripto paralarda yatırdığın stETH karşılığında \"AO\" kazanmanla da sağlanılabiliyor. Yani fair-launch varsa PoW da okey, PoS da ama fair-launch yoksa Solana PoW olsa ne fark eder. Bence asıl eleştiri \"low float, high fdv\" token ekonomisine olmalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theholycoin",
      "created_time": "July 18, 2024, 11:07:09 PM",
      "body": "Quote from: mandown on October 12, 2023, 02:40:15 PMUzun zamandır pos'un doğru bir şeçim olmadığını forumda söylüyordum benim söylemimi ftx'in sahibi olan karaktersizin sevgiliside doğrulamış oldu. Düşünün  siz btc'nin fiyatını düşürmek istiyorsunuz ancak ftx'in sahibi düşürmek istiyor ve gidiyor insanları liq edebilmek için ağı durduruyor. Hatırlarmısınız bilmem solana ağı bir dönem feci anlamda sık sık duruyor veya yaptığınız işlemler gerçekleşmiyordu. Sebebinide anlamış olduk.QuoteBF'nin eski kız arkadaşı ve Alameda'nın CEO'su olan kadının mahkemedeki beyanı;- Solana merkezi bir coin miydi ?+ Evet, Solana VC blockchainiydi. İstediğimiz zaman açıp kapatabiliyorduk.- Hiç kapatma gereği duydunuz mu peki ?+ Evet, Long pozisyonu olan kullanıcıları likit etmek için yaptık.- Kim yapıyordu peki?+ FTX developerları...Kaynak :https://twitter.com/kriptogelisim/status/1712473031271215150Şimdi bir eksim tabiki pos'u savunacak aynı ağ üzerinde kurulmuş sadece 1 pc üzerinden veya dünya üzerinde birkaç konuma kurulmuş virtual machine'ler yani sanal pcler üzerinden istediğiniz kadar ürünü sanki merkezi değil gibi gösterebilirsiniz ve bunun maliyetide ciddi anlamda komik rakamlar birkaç dolarlık alacağınız rp4 bile rahatlıkla ağı koruyabiliyor sözde.Şimdi pos olayına inanılmaz derecede karşı biriyim her ne kadar eth tarafında validator olarak inanılmaz rakamlar görünüyor olsada acaba kaç tane gerçek anlamda farklı node var? Ağın %kaçı acaba kaç node üzerinde kurulu.Pos elektriksel maliyet çözümü gibi görünsede ucuz, kolay ve neredeyse kurumu zorunlu olan bir yapı geliştirilmedikçe bu pos denen şey şimdilik zararımıza bile olabilir.Kriptoya inancım tam ancak pos yeterli bir çözüm olduğunu kesinlikle düşünmüyorum forumda kaç kişi güvendiği ağa ait node kurup güvenliği sağlıyor? Çok enteresan bir konu bu ve çok su kaldıracak gibi duruyor.Öncelikle bu mesajda acımasız olacağım için hepinizden peşinen özür dilerim ama yıllar sonra foruma girdim ve çıldırmak üzereyim. PoS'un merkeziyetsiz olmadığı iddiası, özellikle Satoshi'nin memleketindeki Bitcoinseverler derneğince yanlış anlaşılmasın ama bir bilgisayar mühendisi olarak bana gülünç geliyor. Ki sırf BtcTalk'tayız diye Bitcoin Bitcoin diye sayıklamak da geçmişi ilkeli arzulamanın ayrı bir formu. Emin olun Satoshi burada olsa o PoS'a cephe almak yerine daha iyi ve daha merkeziyetsiz hale nasıl getirilir onu konuşuyor olurdu ve durup burda onunla gururla kod yazardım daha iyi hale getirmek için. 2017 yılında buradaydım ben. Nerede o yazılımcılar, inovatörler? Şimdi her yer bir avam bir fanatik kitle. Ama sizler ne yapıyorsunuz? Her kahramanın arkasından gelen ilkel senaryonun bir benzerini yaşatıyorsunuz. Satoshi'nin inovatif fikirlerine tutunmak ve liberal inovasyona sarılmak yerine eskiye özlemle yanıp tutuşuyorsunuz. Ne zaman sardı forumu bu ilkel kabilecilik, biz sizcilik?1- Stake edenler, yüklü miktardaki paralarını sıfırlayacak kadar düşük zekalı mı? Ki kapital nadiren düşük zekalılardadır.2- Node çalıştıran öyle üç beş TX fee için falan değil on binlerce dolarlık yatırımlarını daha iyi bir güvence ile stake etmek için çalıştırıyor. Haliyle o her sayılı nodeun arkasında on binlerce dolar yatıyor ve aşırı kıymetli.3- PoS ağları fork yaşamıyor mu? Bir yerde milyonlarca dolar değerindeki fonlar tehdit altına düştüğünde konsensusun ikiye parçalanmayacağını mı sanıyorsunuz?4- Tabi siz hiç Segwit öncesi transfer yapmadınız. PoW, Segwit öncesi biz bir TX için ertesi günü beklerdik. PoS bunu dakikalara saniyelere düşürdü. Neyi kaybettiğinizi iddia ediyorsunuz anlayamıyorum.5- %51'miş... O servetin %1'ine sahip olun ve riske edin o zaman? Bir soru, neden Satoshi elindeki on binlerce Bitcoin'i satıp piyasayı erkenden göçertmedi? Milyon dolarını iki milyon dolar yapmak için kimse böyle bir risk almaz, ağ fonu ile domine edildiği anda gelecek bir fork ile ya yaptığı halt bir işe yaramaz ya da başarılı olur ve elinde 1 lira etmeyen on binlerce coin kalır. Gel şimdi 1 milyon dolarını yılda %3-5 verdiği halde minimal risk için FED faizine yatıran yatırımcının şu riski alışını izle. Çok değil $1000'ınızı başka bir $1000 dolar daha için riske edin desem hiç biriniz yanaşmazsınız.6- Tek bir konuda haklısınız dandik yeni çıkmış bir PoS ağında dedikleriniz yaşanabilir ama yine bu ağlar için de aynıları geçerli. $1000 dolarla domine edip bir $1000 daha alabileceğiniz küçük bir ağ bulduğunuzu var sayalım, ben blockchain yazılımcısıyım, gel bu ağdaki konsensusu ele geçirip paranı ikiye katlayayım desem bana bu parayı verir miydin? Paran 0 da olabilir $2000 da. Bolca iş yükü içeren gereksiz bir yazı tura oyunu gibi. Verirdim diyeniniz olursa sağlam merkeziyetsiz heads & tails oyunu biliyorum link verebilirim.He ama Solana konusunda haklısınız. Solana'dan da projesiz bir sürü saçma sapan meme tokendan da nefret ediyorum. Değer katmadıkları gibi kumarın garip bir formunun inşasına hizmet ediyorlar. Ama sorun asla PoS'da ya da yapılmış herhangi bir inovasyonda olmadı. Bununla ilgili spekülasyonculuğa veya komplo teorisyenliğini de hiç gerek yok. Sorun basitçe insanların cehaleti. Bir ağı kullanıyorsan o ağı öğreneceksin. Alt yapısını çalışma mekanizmasını dağıtıklığını teyit edeceksin. Etmeyenlere öğreteceksin. Solana ilk çıktığından bu yana kafama yatmadı zaten, hesap yapmıştım bi node açsam mı bu baya popüler oldu iyi TX fee bırakabilir diye, hesabıma göre şu an bütün Solana nodeları zarar ediyor. Zarar ettikleri halde çalıştırıyorlar. E peki değirmenin suyu nerden geliyor diye sormuştum kendi kendime ve o zamandan bu zamana tek imzam yoktur Solana ağında.Biraz sert konuştuğum için özellikle moderatörlerden özür dilerim ama hakaret, siyaset vs. forum kurallarına dikkat etmeye çalıştım elimden geldiğince ama birazcık rahatlamam için şarttı. Saygılarımla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 07, 2024, 10:39:01 AM",
      "body": "1. stake edenlerin parasını sıfırlayacak gibi bir argümanım yok.2. Node çalıştıran sözdemerkeziyetsizlik için çalıştırıyor her önüne gelende yeterli miktarda nakit olmadığı için tam olarak merkeziyetsizlik oluşamıyor örnek veriyorum btc'yi kendi evinizde kurabilir dışarıda herhangi bir pool'a veya node'a ihtiyaç olmadan kendi hash'inizle tamamen kendi local yapınızı kurabilirsiniz. 3 pow veya pos farketmez hepsi parçalanabilir ve bu olayda merkeziyetsizliğin önemini gösterir. 4. yapmadığımızı kim söylüyor? istenirse pow'dada kısa süredlerde işlem yapılabiliyor benzer birçok proje var.Solananın en büyük örneğini gördüğümüz halde hala pos'un nesini savunuyorsunuz anlam veremiyorum pos veya pow benim için ve bu konuda önemli olan merkeziyetsizlik yarın bir gün ülkeler benim ülkemde ... yı pos olarak çalıştırmak istiyorsan .... şartlarına uymak zorundasınız dediğinde pos'u nasıl savunacaksınız? al örnek veriyorum bu forumdahttps://bitcointalk.org/index.php?topic=5417551.0bir konu bunun hukumetler tarafından x cüzdanından gelen bakiyeyi sen onaylamayacaksın tarzı bir yaklaşım olursa? sonuçta ben evime o posu kurup merkeziyetsiz hale getiremiyorum sözde merkeziyetsiz bir pozisyonda.Şahsen sert falan konuşmadınız konunun ortasından konuşmayı bırak  söylediğimiz anlamadınız bile söylediğiniz konuların çoğu %51 saldırısı ile ilgili  ben diyorum merkeziyetsizlik sen diyorsun %51. Şahsen pow yapısında %51'i reel olarak deneyimlemiş biriyim.Binance chain yarın bir gün kardeşim ben bu işi artık yapamıyorum veya ... sunucularım için belli şartlar getirdiler dendiğinde ne demek istediğimi anlamış olacaksınız. POS yapısı sol, binance chain gibi ağlarda sözde merkeziyetsiz olarak çalışmakta bunu anlamak çok zor değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}