{
  "id": "topic_5467047",
  "title": "BitcoinGirl.Club",
  "author": "BitcoinGirl.Club",
  "created_time": "September 17, 2023, 01:53:58 AM",
  "content": "Quote from: Timelord2067 on September 14, 2023, 01:16:50 AMI've noticed a certain group have been DT distrusting users long after they are gone (or presumed to be gone) IIRC there was some question about some activity that Blaze was involved in... (but don't quote me on that as it looks to have occurred a very long time ago)This topic is inspired from the discussion happening on the other thread.. My understanding in general is when a user is not active for long time, not participating in the default trust system; we can consider not to vote for them [avoid both inclusion and exclusion]. Some possible plots can be as follows to understand the matter a little clear. I also think from a good discussion we may have even better understanding for the current feedback and default trust system.Satoshi came first in mind. The current default trust system is totally irrelevant for the account. [1.] The are no feedback given by him to anyone, [2.] He does not have anyone to perform a DT voting. The account is a great history but is not useful in DT system due to the inactivity. TMAN: [1.] Left many feedback [2.] Performed DT voting [3.] But not active anymore. It has been over three years now. Three years ago the forum environment and current environment is totally different. It changed a lot. A feedback left by him three years ago can be very inappropriate today. A good example is the feedback left for Best_Change.Bruno: [1.] Left many feedback [2.] Performed no DT voting [was he died before the new default trust system?] [3.] Not alive [RIP brother], of course inactive. Someone wanted to use his account and wanted to scam users but failed. Whatever the case is, I don't think having the account in Trust inclusion or even in Exclusion leaves any weight in the current system. Very similar for Zepher [RIP] too. He can not edit a feedback, give a feedback or remove a feedback. These accounts can not use the system at all.There are other users who are [1.] Active but not performing in DT voting however since they are active and somehow or greatly involved in trades or forum events having them in inclusion or exclusion is relevant.From the above scenarios understandably we can conclude that when a user is not active for long time, any feedback it left or received carry no weights or very less weights. After many years, the time has changed, a lot of things of the forum has changed; an old-inactive account is outdated to be in the trust or distrust setting.In my opinion this small detail will improve a lot of weight of the forum feedback system. The feedback and default trust system will look more appropriate than before.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467047",
  "comments": [
    {
      "author": "jokers10",
      "created_time": "September 17, 2023, 08:30:06 AM",
      "body": "Sometimes accounts of farmers tagged by those who left the forum become \"clean\" because DT members left and lose even DT2 status with time. And so we need catching abusers once more, because a farmer didn't left the forum and can find that fortunately for him some of his accs are being \"cleaned\".I think that having few outdated tags on a respected accounts is a lesser problem than that scammers and abusers will lose their red tags and will cheat again and again.So IMO it is good if some inactive for years accounts which were active in hunting on abusers previously are staying in DT2. We can stay warned about many abusers thanks to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "September 17, 2023, 09:42:25 AM",
      "body": "Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMFrom the above scenarios understandably we can conclude that when a user is not active for long time, any feedback it left or received carry no weights or very less weights. After many years, the time has changed, a lot of things of the forum has changed; an old-inactive account is outdated to be in the trust or distrust setting.It really still depends on the appropriateness of the trust ratings and whether they continue to stand the test of time. If a years-inactive account is still on DT2, its feedback carries the same weight as feedback left just today (unless we are going by the old trust system as still calculated by BPIP; in which case older ratings carry more weight than new ratings). If you disagree with some or the majority of feedback left by an inactive DT2 user, you should exclude them.Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMBruno: [1.] Left many feedback [2.] Performed no DT voting [was he died before the new default trust system?] [3.] Not alive [RIP brother], of course inactive. Someone wanted to use his account and wanted to scam users but failed. Whatever the case is, I don't think having the account in Trust inclusion or even in Exclusion leaves any weight in the current system. Very similar for Zepher [RIP] too. He can not edit a feedback, give a feedback or remove a feedback. These accounts can not use the system at all.Bruno only ever left 2 feedbacks and they were to his other accounts. He was against use of the trust system. Inclusion or exclusion of him is meaningless, much as it is for Satoshi, Hal or Cobra.Zepher is one such case where I excluded him because I felt many of his ratings were either no longer relevant or not good to begin with. He has not been on DT2 for quite some time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 17, 2023, 10:09:26 AM",
      "body": "I remember the worries when Lauda was first removed from DT: thousands of tagged users were suddenly \"set free\". And that's the problem with removing old inactive users: old inactive scammers can activate again.Then again, people should really do their own research instead of sending money to strangers on the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "September 17, 2023, 01:29:49 PM",
      "body": "Quote from: nutildah on September 17, 2023, 09:42:25 AM[...snip....]Here is where I was coming from. For example Bruno, many people distrusted his judgement but the person is no longer alive. Zepher is distrusted by many too. Same applies for him too. None of them will be leaving any more feedback to anyone anymore so there are nothing left to trust or distrust their judgement. They are above of all judgement.Quote from: LoyceMobile on September 17, 2023, 10:09:26 AMI remember the worries when Lauda was first removed from DT: thousands of tagged users were suddenly \"set free\". And that's the problem with removing old inactive users: old inactive scammers can activate again.In other words the feedback system looks isolated, depending on Lauda. it's not a good outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 17, 2023, 01:33:05 PMLast edit: September 17, 2023, 02:28:56 PM by philipma1957",
      "body": "hmm I am older 66 which means I have less time left then I did when I got here in 2012.Don't remove me when I am gone I would prefer to stay here with my trusts and distrusts left as they are.The forum is about 13 years old it will likely be here in 13 years.This chart says that in 13 years my odds of being edit Alive dead are 32.85%https://www.ssa.gov/oact/STATS/table4c6.htmlSo I kind of like to think I would be allowed to stay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "September 17, 2023, 04:03:49 PM",
      "body": "Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMFrom the above scenarios understandably we can conclude that when a user is not active for long time, any feedback it left or received carry no weights or very less weights. After many years, the time has changed, a lot of things of the forum has changed; an old-inactive account is outdated to be in the trust or distrust setting.Old reports still carry lots of weight and points users in what direction to check when looking for which users to trade with and which to beware of. The date a feedback was left is available for anyone reading it to see and decide what relevance to place on it. They can also check the reference for further information needed.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "September 17, 2023, 04:15:53 PM",
      "body": "Already posted my general opinion in that topic:Quote from: dragonvslinux on September 16, 2023, 05:04:01 PMsomeone's feedback doesn't become useless if they leave, it's still just as useful even if it won't be updated and therefore can become outdated. Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMThis topic is inspired from the discussion happening on the other thread.. My understanding in general is when a user is not active for long time, not participating in the default trust system; we can consider not to vote for them [avoid both inclusion and exclusion]. Some possible plots can be as follows to understand the matter a little clear. I also think from a good discussion we may have even better understanding for the current feedback and default trust system.I don't see including absent/left members in trust list as \"voting\" for them personally. This concept is reserved for reaching the threshold of inclusions to become eligible for DT1, or otherwise in relation to DT1 members voting directly. If they are no longer active, they aren't eligible for DT1, so it's therefore simply based on whether their feedback is trusted by default or not.Additionally when including inactive members this doesn't ever extend to their list of inclusions, in the way that it would be DT1 members producing votes for DT2 members, as inactive members can only be DT2 at most. So in this sense it's very much a \"limited vote\", one that is solely based on trusting their feedback, as their only personal inclusions and exclusions, or lack of, become irrelevant.Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMSatoshi came first in mind. The current default trust system is totally irrelevant for the account. [1.] The are no feedback given by him to anyone, [2.] He does not have anyone to perform a DT voting. The account is a great history but is not useful in DT system due to the inactivity. This is just an example or poor judgement from those who include a member who hasn't left any feedback. PS - Didn't you include my mobile account to your trust that hasn't left any feedback?? ...Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMTMAN: [1.] Left many feedback [2.] Performed DT voting [3.] But not active anymore. It has been over three years now. Three years ago the forum environment and current environment is totally different. It changed a lot. A feedback left by him three years ago can be very inappropriate today. A good example is the feedback left for Best_Change.This is an example of how feedback can become outdated, and if so, then sure the user can be removed from DT. But not based on his activity, simply the accuracy of feedback, regardless of who the member is.Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMThere are other users who are [1.] Active but not performing in DT voting however since they are active and somehow or greatly involved in trades or forum events having them in inclusion or exclusion is relevant.This I don't understand. Either their feedback is trusted or not to enter your inclusion list. Whether they have an trust list or not doesn't change the accuracy or that feedback either.Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMFrom the above scenarios understandably we can conclude that when a user is not active for long time, any feedback it left or received carry no weights or very less weights. After many years, the time has changed, a lot of things of the forum has changed; an old-inactive account is outdated to be in the trust or distrust setting.I guess you are trying to say old, maybe even outdated feedback carries no weight? If that's the case, then by this logic it's not that damaging to remain then? Personally I think for example a red tag is a red tag, whether it's from the past year or from many years ago. Sure someone reading it might give it more or less weight based on it's age, but otherwise whether the user remains active or not becomes less relevant imo. Personally I think what you are suggesting is an over complication of the trust system. You simply add users with accurate feedback, dead or alive. That's it.If you trust the judgement of a user less because they have left or died, then don't include them in your trust list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 17, 2023, 09:52:16 PM",
      "body": "Quote from: BitcoinGirl.Club on September 17, 2023, 01:53:58 AMwe can conclude that when a user is not active for long time, any feedback it left or received carry no weights or very less weights. After many years, the time has changed, a lot of things of the forum has changed; an old-inactive account is outdated to be in the trust or distrust setting.In my opinion this small detail will improve a lot of weight of the forum feedback system. The feedback and default trust system will look more appropriate than before.Well, I know that the inactive users aren't really doing anything on the forum currently but when they left the feedback then at that time they saw good or bad in someone's actions. We can't really underestimate their judgement if they aren't active anymore on the forum. Most of the users who aren't active currently may get online once again because sometimes the life tests us a lot and at those time we try to detach ourselves from the internet. I would say that if their trust or distrust was with a valid reason then it still carries a weight but it was only due to difference of opinion then those type or trust or distrust do not carry much weight. The members who aren't active still have played their role in forum when they were active however if it's for the betterment of the forum then surely it would be a good step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "September 18, 2023, 09:03:49 AM",
      "body": "Quote from: jokers10 on September 17, 2023, 08:30:06 AMSometimes accounts of farmers tagged by those who left the forum become \"clean\" because DT members left and lose even DT2 status with time. And so we need catching abusers once more, because a farmer didn't left the forum and can find that fortunately for him some of his accs are being \"cleaned\".I think that having few outdated tags on a respected accounts is a lesser problem than that scammers and abusers will lose their red tags and will cheat again and again.So IMO it is good if some inactive for years accounts which were active in hunting on abusers previously are staying in DT2. We can stay warned about many abusers thanks to them.I was originally going to say \"why remove legitimate opinions and feedback just because of inactivity?\"... But I do see the point, and it made me think of a cool solution that I am sure LoyceV or someone like him could easily tackle by building a tool something along the lines of: > Scrape all sent feedback left by people who were once in DT1 and got removed due to inactivity only> Find all members who currently aren't painted red out of this feedback> Current DT1's can go through the list and add a feedback if they choose to.Thoughts?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "September 18, 2023, 10:27:08 AM",
      "body": "Quote from: BenCodie on September 18, 2023, 09:03:49 AMI was originally going to say \"why remove legitimate opinions and feedback just because of inactivity?\"... But I do see the point, and it made me think of a cool solution that I am sure LoyceV or someone like him could easily tackle by building a tool something along the lines of: > Scrape all sent feedback left by people who were once in DT1 and got removed due to inactivity only> Find all members who currently aren't painted red out of this feedback> Current DT1's can go through the list and add a feedback if they choose to.Thoughts?It is a duplicated work. Of course you can duplicate someone else's tags and many DT members do so. But you are responding not for other's tags, but for your own and to leave an own duplicated tag the one should learn enough about the case for which a tag is left. So we'll face with a need for DT members to go through the tags again, additional work.So if are talking about the tags which are already became untrusted due to some DT member inactivity, it can be a good idea, we at least can learn how big could be the problem and where are its boundaries.But even if we can monitor tags becoming untrusted due to someone's inactivity, I don't think we should exclude good hunters from our trust lists (DT2) only because they are inactive. If their tags became inaccurate with time, it should be solved in case by case order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 18, 2023, 02:50:48 PM",
      "body": "Quote from: BenCodie on September 18, 2023, 09:03:49 AMit made me think of a cool solution that I am sure LoyceV or someone like him could easily tackle by building a tool something along the lines of: > Scrape all sent feedback left by people who were once in DT1 and got removed due to inactivity only> Find all members who currently aren't painted red out of this feedback> Current DT1's can go through the list and add a feedback if they choose to.Been there, done that. See [PRISON BREAK] Full list of users who lost their DT red trust from LaudaQuoteThoughts?It was a lot of work. You can't tag 2000 accounts just because someone else did the same, you'll have to actually check the evidence and decide per case whether or not they (still) deserve it. I'm not going to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "September 18, 2023, 03:05:59 PM",
      "body": "Quote from: LoyceV on September 18, 2023, 02:50:48 PMIt was a lot of work. You can't tag 2000 accounts just because someone else did the same, you'll have to actually check the evidence and decide per case whether or not they (still) deserve it. I'm not going to do that.Two thousand tags! I didn't left so many for all the time I'm here! It is a good example of why reconsidering all tags of any active DT member will be a huge problem by itself. It was done for years and DT members don't have so much spare time to waste it on useless work. 2000 tags! Reconsidering them is not what I ever plan to do. And I guess the majority of DT members will say the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 18, 2023, 03:38:03 PM",
      "body": "I think this should be taken case by case. I still trust Lauda, despite some differences with him, but he has performed excellently with tagging old scammers. And sometimes I even trust people who have not been around for a while, like @Johoe. Therefore, trust varies and not everyone trusts people just because they are reliable or because everyone adds them. (For example, most people add @theymos for nothing other than he is admin)In some cases, such as TMAN, despite the negative trust he left for BEST_CHANGE, this should not be the only reason for not trusting him.Quote from: philipma1957 on September 17, 2023, 01:33:05 PMhmm I am older 66 which means I have less time left then I did when I got here in 2012.Don't remove me when I am gone I would prefer to stay here with my trusts and distrusts left as they are.I trust you and as long as I am DT1 you will remain on that list (I hope others don't remove you)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 18, 2023, 04:18:16 PM",
      "body": "Quote from: philipma1957 on September 17, 2023, 01:33:05 PMhmm I am older 66 which means I have less time left then I did when I got here in 2012.Don't remove me when I am gone I would prefer to stay here with my trusts and distrusts left as they are.If Bitcointalk turns out to be as legendary as I hope it will be, our posts and trust feedback should still be here centuries from now. In about half a century, when the last of the current users stops posting and becomes inactive, they'll drop off DT1 and all their inclusions will become \"untrusted\". By then, the current scammers are inactive too, so the tags served their purpose and will only be part of history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 18, 2023, 05:19:30 PM",
      "body": "Quote from: BitcoinGirl.Club on September 17, 2023, 01:29:49 PMHere is where I was coming from. For example Bruno, many people distrusted his judgement but the person is no longer alive. Zepher is distrusted by many too. Same applies for him too. None of them will be leaving any more feedback to anyone anymore so there are nothing left to trust or distrust their judgement. They are above of all judgement.You can't really confirm if someone is going to come back in forum or not, even if they are dead.For example we had one well known DT member in our local board marlboroza and he was inactive for really long time, but then he made a post last month.Second example was another of our members that stopped writing for few months, and we started to speculate what happened to him, he came back and said that he had to take a break because of his personal life.There is no exact period to determine if someone is ''inactive'', really inactive or retired.Quote from: LoyceMobile on September 18, 2023, 04:18:16 PMIf Bitcointalk turns out to be as legendary as I hope it will be, our posts and trust feedback should still be here centuries from now. In about half a century, when the last of the current users stops posting and becomes inactive, they'll drop off DT1 and all their inclusions will become \"untrusted\". By then, the current scammers are inactive too, so the tags served their purpose and will only be part of history.I think things will change drastically in next half of century, I am not sure internet as we know it and bitcointalk will even exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 18, 2023, 06:16:35 PM",
      "body": "Quote from: dkbit98 on September 18, 2023, 05:19:30 PMI think things will change drastically in next half of century, I am not sure internet as we know it and bitcointalk will even exist. I'm sure the new forum software will still be expected any time soon in half a century",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 18, 2023, 06:24:20 PM",
      "body": "trust system is bullshit anyways.. when a bunch of ass kissers back up fellow liars, the system becomes pointlessthe point of bitcoin is to research, review, scrutinize, confirm and verify..  trust is what caused people to fall for all the fiat tricks, lies and scams",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 18, 2023, 07:03:48 PM",
      "body": "Quote from: hugeblack on September 18, 2023, 03:38:03 PMI think this should be taken case by case. I still trust Lauda, despite some differences with him, but he has performed excellently with tagging old scammers. And sometimes I even trust people who have not been around for a while, like @Johoe. Therefore, trust varies and not everyone trusts people just because they are reliable or because everyone adds them. (For example, most people add @theymos for nothing other than he is admin)In some cases, such as TMAN, despite the negative trust he left for BEST_CHANGE, this should not be the only reason for not trusting him.Quote from: philipma1957 on September 17, 2023, 01:33:05 PMhmm I am older 66 which means I have less time left then I did when I got here in 2012.Don't remove me when I am gone I would prefer to stay here with my trusts and distrusts left as they are.I trust you and as long as I am DT1 you will remain on that list (I hope others don't remove you)It is getting a bit harder to do the physical work I do mining ⛏️ but reading posting and looking at what others do is still something I want to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "September 18, 2023, 07:39:24 PM",
      "body": "Quote from: LoyceV on September 18, 2023, 06:16:35 PMQuote from: dkbit98 on September 18, 2023, 05:19:30 PMI think things will change drastically in next half of century, I am not sure internet as we know it and bitcointalk will even exist. I'm sure the new forum software will still be expected any time soon in half a century I have a feeling that even before the new forum software is released, it'll already be outdated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}