{
  "id": "topic_5399370",
  "title": "Monkey.Pizza",
  "author": "Monkey.Pizza",
  "created_time": "May 19, 2022, 03:39:58 PMLast edit: May 19, 2022, 03:56:13 PM by Monkey.Pizza",
  "content": "Hallo, mijn naam is Matthew en ik ben de CEO van Monkey Gastro Sp. z o.o. verantwoordelijk voor het project Monkey.PIZZAIk wil je kennis laten maken met een volledig nieuw ICO-project met een groot potentieel en gericht op de acceptatie van cryptocurrencies PRESALE begint 22.05.2022.De datum is niet toevallig, deze dag is weer een verjaardag, toen Laszlo Hanyecz twee pizza's kocht voor 10 000 BTC.Ons project betreft het bouwen van een restaurantketen PIZZA & PASTA. We willen niet alleen leunen op de Poolse gastromarkt, maar hebben ook vestigingen in heel Europa. Het oorspronkelijke concept van het restaurant is om twee zones te creëren, één in elk van hen \"FAST FOOD\" met zelfbedieningskiosken om te bestellen en een plaats om te serveren (bijv. Mc'Donald) en een tweede typische restaurantzone \"ITALIAN COUSINE\" met dienst.Het menu wordt verdeeld. Voor snelle afhaalmaaltijden is er een basis Italiaanse pasta met verschillende toppings en een paar soorten pizza's, ook in stukjes te koop. Er komen meer mogelijkheden en een uitgebreide menukaart voor mensen die besluiten om tijd in het restaurant door te brengen en langer op hun bestelling willen wachten. Zoals het een restaurant betaamt, zal het ook mogelijk zijn om alcoholische dranken te bestellen.Al met al wordt het een VERBETERD Mc'Donald's versie, alleen gebaseerd op PIZZA en BLOCKCHAIN Om sneller nieuwe panden te openen en ongeacht de effecten van de ICO, zullen we ook vertrouwen op het FRANCHISE-aanbod.Het idee werd geboren in 2019 en de start van de ICO zou in 2020 van start gaan. Helaas hadden we een epidemie gerelateerd aan COVID-19, dus besloten we het project uit te stellen.We hebben een token gemaakt UTILITY Monkey.PIZZA, en de belangrijkste functie ervan is:mogelijkheid om te betalen met een token voor bestellingen in restaurantstoegang tot het menu, alleen bedoeld voor tokenhoudersloyaliteitstekendeflatie tokenAlle Monkey.PIZZA geaccepteerd als betaalmiddel voor bestellingen, worden regelmatig verbrand zodat ze niet meer in omloop komen. Op de lange termijn zou dit moeten leiden tot een aanzienlijke stijging van de waarde van de tokens die nog in omloop zijn.Omdat tegenwoordig het belangrijkste is om op te vallen, zal het ook mogelijk zijn om bestellingen te betalen met populaire CRYPTOCURRENTIES  in elk restaurant.Tokens worden aan het einde van de ICO uitbetaald aan de portemonnee van beleggers, samen met het ontgrendelen van handel op beurzen en online wisselkantoren.Voor gebruikers hebben we voorbereid PARTNERPROGRAMMA en zal binnenkort beginnen AIRDROPWHITEPAPERhttps://monkey.pizza/wp-content/uploads/2022/05/WHITEPAPER_1.1_2022_Monkey.PIZZA_.pdf Meer informatie is te vinden op www.monkey.pizza [WELKOM OM TE REGISTREREN]We nodigen je ook uit om ons te volgen op:FACEBOOK https://www.facebook.com/monkeyypizzaTWITTER https://twitter.com/mnkypizzaTELEGRAM https://t.me/monkey_pizzaALLE UPDATES WORDEN VERPLAATST IN DEZE THREAD",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399370",
  "comments": []
}