{
  "id": "topic_5404235",
  "title": "froteb4",
  "author": "froteb4",
  "created_time": "June 27, 2022, 01:49:39 PM",
  "content": "Hi, I'm begginer so excuse me for this question who's, maybe stupid..Why the bitcoin price or other token isn't the same on crypto.com and binance ??Thank a lot dor your help",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404235",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "June 27, 2022, 01:53:12 PM",
      "body": "Because the traders in both platform are different. The price increases/decreases because of the traders like us. We are placing buy orders and some other people are placing sell order and vice-versa. That's why a little fluctuations between different exchange is possible. But the spread will not be high. If it happens, people will have the opportunity to have arbitrage on two different exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 27, 2022, 01:56:29 PM",
      "body": "Quote from: froteb4 on June 27, 2022, 01:49:39 PMHi, I'm begginer so excuse me for this question who's, maybe stupid..Why the bitcoin price or other token isn't the same on crypto.com and binance ??Thank a lot dor your helpYou can think on this: why potato prices are different at <insert supermarket 1> and <insert supermarket 2>?Difference in fees, liquidity do matter. Even more (somebody please correct me if I'm wrong), I think that crypto.com is an OTC exchanger, hence it tends to have wider spread (higher buy price and lower sell price).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "June 27, 2022, 02:05:58 PM",
      "body": "Theoretically, bitcoin or any other altcoins really don't have an actual price. Its the people who have different selling and buying price points or what you call the supply and demand that decides the price on a specific exchange which also makes the Arbitrage trading become possible. But that's another topic..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 27, 2022, 02:06:04 PM",
      "body": "The traders on one exchange are not the same as the traders on another exchange, exchanges have different order book, no exchange will have the same price, but the price are very similar. Even on exchanges offering spot and future trading. On the same particular exchange, spot traders are not the same as derivatives traders, bitcoin price on the same exchange for spot and future trading will also be different, but the price will be very similar with only little price difference.To generalize it, you can use sites like Coinmarketcap which aggregate the price of listed exchanges and give the average.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 27, 2022, 02:06:53 PM",
      "body": "Because different exchanges had a different amount of buy and sell orders, the factor that determine Bitcoin price is because of demand and supply which is no one is controlling. But centralized exchanges need to follow the regulation and they need to stick with a current average Bitcoin price, if there's no average price, many people can do arbitrage trading. If you want to see how Bitcoin price isn't 100% controlled you can check on P2P platform e.g. Bisq, hodl hodl, localcryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 27, 2022, 02:22:03 PMLast edit: June 27, 2022, 02:37:44 PM by mk4",
      "body": "I'm going to dumb this down a bit just in-case you don't get the other responses.The prices of bitcoin and other cryptocurrencies are slightly different from exchange to exchange are almost no different to the reason why the price of corn or other frequently bought/sold fruit/vegetable are slightly different from city to city.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "June 27, 2022, 03:14:28 PM",
      "body": "It's just because the price varies for these reasons on different crypto exchanges and that's what they called, trading arbitrage which all the above comments are true.very first the liquiditydemand and supplyFeesEven when you're looking at the crypto price on CMC, how can you be sure that the results are exactly accurate?They have different results because they calculate it based on the last traded price in the most prominent crypto exchanges which they got different results on different exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "froteb4",
      "created_time": "June 27, 2022, 06:13:45 PMLast edit: June 28, 2022, 01:39:23 PM by mprep",
      "body": "Quote from: Little Mouse on June 27, 2022, 01:53:12 PMBecause the traders in both platform are different. The price increases/decreases because of the traders like us. We are placing buy orders and some other people are placing sell order and vice-versa. That's why a little fluctuations between different exchange is possible. But the spread will not be high. If it happens, people will have the opportunity to have arbitrage on two different exchanges.than you for you great explicationthank you, ALL, for you great explication.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 27, 2022, 09:30:06 PM",
      "body": "Quote from: froteb4 on June 27, 2022, 01:49:39 PMWhy the bitcoin price or other token isn't the same on crypto.com and binanceYou need to understand first that those exchanges has their major aim on making profits, the service we enjoy from them doesn't come as easy as we'd thought about it, on each exchange lies a pool number of users from different parts of the globe and another thing to have in mind is the volatility in bitcoin price, the prices updates on every seconds regardless of time zone, now we can't expect checking on Binance and going to crypto.com yet comes with the same results, just the little time interval to navigate through the two can make a significant difference in their respective price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 28, 2022, 10:52:12 AM",
      "body": "Yet the biggest differences in prices can be seen if we take the examples of different countries, especially during times of high demand such as the bull market. If memory serves me well, sometime in late 2017 the price of 1 BTC was even about $5000 higher in South Korea or some neighboring country, so there were even some forum inquiries about how some plan to move there and take advantage of the situation.I think this is the case in some other countries that are under sanctions like Iran, and where there is little liquidity and people do not have too many choices than to buy through DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "June 28, 2022, 11:25:31 AM",
      "body": "Quote from: froteb4 on June 27, 2022, 01:49:39 PMHi, I'm begginer so excuse me for this question who's, maybe stupid..Why the bitcoin price or other token isn't the same on crypto.com and binance ??Thank a lot dor your helpVolume affect the spread of price on every exchange but actually if you try to look at it this is small difference only and you cannot assure if you buy on exchange where bitcoin is cheap you can sell it accurately at expensive price on other exchange. Many do arbitrage because of this but actually this doesn't guarantee that we can earn a profit if this came across on your mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "June 28, 2022, 12:00:00 PM",
      "body": "Quote from: froteb4 on June 27, 2022, 01:49:39 PMWhy the bitcoin price or other token isn't the same on crypto.com and binance ??There are buyers and sellers, takers and makers and market makers on different platforms.You can not find same price of Bitcoin on different exchanges. Difference of price among exchanges gives people to do arbitrage tradings.If you check Coinmarketcap, Coingecko and BitMEX, you will see they have definitions that price used on their platforms are average price from a basket of exchanges.BitMEX indicesQuoteBitMEX indices are composite, meaning that they are calculated using a number of data sources. BitMEX currently has 18 data sources: Binance, Bitfinex, Binance US, Bitstamp, Bittrex, Bybit, Cryptodotcom, Coinbase, FTX, Gateio, Gemini, Huobi, Itbit, Kraken, Kucoin, LBank, OKEx, Poloniex.Difference will be big when you see Bitcoin crashes. Because different exchanges will have different leverages, different orders from their users. When liquidations are in, with different conditions on different exchanges, crashes will be different in price and volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 28, 2022, 12:10:12 PM",
      "body": "Quote from: Little Mouse on June 27, 2022, 01:53:12 PMBecause the traders in both platform are different. The price increases/decreases because of the traders like us. We are placing buy orders and some other people are placing sell order and vice-versa. That's why a little fluctuations between different exchange is possible. But the spread will not be high. If it happens, people will have the opportunity to have arbitrage on two different exchanges.On the contrary, market makers are the same players across major exchanges. They're the ones who significantly contribute in keeping the prices between different exchanges more or less similar.  Arbitrageurs are actually one of the reasons why prices will eventually hit a balance between exchanges. Sophisticated arbitrage traders would use advanced systems and bots that immediately detect and take advantage of price discrepancies between exchanges. This results to minimizing the price difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}