{
  "id": "topic_5398328",
  "title": "davve35",
  "author": "davve35",
  "created_time": "May 12, 2022, 02:28:03 PMLast edit: May 19, 2022, 02:21:12 PM by davve35",
  "content": "Please delete thread",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398328",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "May 12, 2022, 03:58:53 PM",
      "body": "I haven't experienced it but I've read here in the forum about others who did. and yeah, it is a scam, they are asking you to pay them for a \"tax\" to another address. if you have any funds on that site, I am sorry to say that you won't get them back. I suggest being more cautious and doing your own research before using or depositing/investing in anything",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "May 12, 2022, 09:51:16 PM",
      "body": "Even the domain name alone should be more than enough for you to know that what you are dealing with is an absolute scam. What kind of serious business or exchange would use numbers as part of their domain name?  Scammers, obviously because such domains are super cheap to buy.It's not their responsibility to tax you, but rather your Government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 13, 2022, 02:42:42 PM",
      "body": "Seriously! Where did you find this website and what may make you think it's legit? I just hope you didn't send them your money because it's definitely a scam.Firstly, their domain name doesn't make any sense. Just ask yourself , which serious business would choose such domain name that doesn't have any thing to do with their brand name. Secondly, didn't you notice that there is something strange with the website design (broken layout, images doesn't load...). Also which legit business would use a yahoo email!And most importantly, didn't you see the links to their social media pages! the exchange name is topcexc but the social media links are for another exchange Omgfin (not sure if this one is legit or not though).They cloned Omgfin but they didn't do it properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}