{
  "id": "topic_5480719",
  "title": "chantatic",
  "author": "chantatic",
  "created_time": "January 07, 2024, 04:54:27 PMLast edit: January 08, 2024, 04:07:55 PM by chantatic",
  "content": "I came across this meme and its too funny not to share. Man creates spam ordinals to create fake traffic jams each time the rate fee drops quickly     https://www.talkimg.com/images/2024/01/07/s3w4G.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5480719",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "January 07, 2024, 05:12:42 PM",
      "body": "Quote from: chantatic on January 07, 2024, 04:54:27 PMI came across this meme and its too funny not to share. Miners are creating spam ordinals to create fake traffic jams each time the rate fee drops quickly     I don't know how you arrived at the conclusion that miners are behind ordinals. I don't actually believe that to be true only there are substantial evidence to support that. What I think is that miners just saw opportunities in it and are benefitting accordingly. They may not be behind it, it could just be the handwork of people that want to leverage on the popularity of Bitcoin to scam people of their money in.exchange for digital jpeg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chantatic",
      "created_time": "January 07, 2024, 05:22:33 PM",
      "body": "I have no opinion in the matter. I just thought it was funny so I decided to share.But whoever are creating these spam ordinals are on a mission... Every time a new block is mined, within seconds are roughly 500-1000 new ordinals created instantly with a rate fee higher than the previous.Example of an wallet address that created 250-500 ordinals right after new block was mine for the past 3 blocks mined.https://mempool.space/address/bc1pzm6grdvyuytv753ew7qv0gf79dytcduecq66szwjgnd8zq7pghkqn6lwadIt might be a coincidence, but this was purely a meme I thought was funny.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chantatic",
      "created_time": "January 07, 2024, 05:49:54 PM",
      "body": "bitcoin ordinals inscriptions analysis@dgtl_assets/ Per Block Inscriptionshttps://dune.com/queries/2145510/3518029Wow, I didn't realize about 25-50% of each new block height are ordinals inscriptions, no wonder why the network has been busiest than ever lately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "January 07, 2024, 05:52:52 PM",
      "body": "Quote from: chantatic on January 07, 2024, 04:54:27 PMI came across this meme and its too funny not to share. Miners are creating spam ordinals to create fake traffic jams each time the rate fee drops quickly     The theory that miners are making spam transactions to drive the fees up has floated around since 2016, and it never really worked, because if you are mining your own spam transactions, you are losing more money than what you gain from driving the fees up.There's a simple explanation - there's a lot of people who are crypto rich - early Bitcoin and altcoin investors who have millions worth of coins, and those people can easily play with those NFTs even if they lose money, because they are just that rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chantatic",
      "created_time": "January 07, 2024, 06:00:22 PM",
      "body": "I didn't mean to imply Miners, I should of just said \"Man, Him, They\".I didn't realize how popular inscriptions are... historically the past 3 months its been even 50/50 split between hashes and inscriptions. craziness how popular they are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "January 07, 2024, 06:22:06 PM",
      "body": "Quote from: chantatic on January 07, 2024, 04:54:27 PMI came across this meme and its too funny not to share. Miners are creating spam ordinals to create fake traffic jams each time the rate fee drops quickly     Well, when i saw your topic, i thought there would be something important in that picture but never thought it will be just a Meme  Quoting it so others can see it directly   Quote from: chantatic on January 07, 2024, 05:49:54 PMWow, I didn't realize about 25-50% of each new block height are ordinals inscriptions, no wonder why the network has been busiest than ever lately.The bitcoin network is getting back to normal and right now the mempool average fee is 45-50 Sat/byte and it is quite low. You can say that it is due to the weekend but i remember that in the last weekends we have over 100+ sat/vbyte fee or even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 07, 2024, 09:35:20 PM",
      "body": "Quote from: chantatic on January 07, 2024, 06:00:22 PMI didn't mean to imply Miners, I should of just said \"Man, Him, They\".I didn't realize how popular inscriptions are... historically the past 3 months its been even 50/50 split between hashes and inscriptions. craziness how popular they are.a few people know you just wanted to simply post a meme for humour.  ...but noticed you mistakenly mentioned implying miners are the instigators its become too common that this congestion is blamed on miners and not the actual coders that allow/created the problemits worth knowing that ASICS(miners) just hash a blockheader ID and have no influence of the transaction selection.asics have no ram to store mempools of unconfirmed tx's nor hard drives to store all transactions, node software, code to validate transactionsits not miners job to transaction selectits pool managers that do transaction selection using code made by core that prioritise transaction by cores policy of fee estimatesso while core devs have pushed a narrative to blame miners and pretend miners need the extra income. miners dont need the income nor resort to extortion to get it. but they simply happily receive extra income via their pool for just existing on a pool. miners dont need the extra, but would be happy to receive extra the real finger pointing should be the pools that accept the spam and the core devs that caused the exploit but dont fix the exploits that allow the spam/fee bumping",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "January 07, 2024, 10:00:46 PM",
      "body": "Quote from: chantatic on January 07, 2024, 06:00:22 PMI didn't mean to imply Miners, I should of just said \"Man, Him, They\".Then why don't you change the wording in your post to avoid the impression that you are deliberately spreading misinformation and unconfirmed claims?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 07, 2024, 10:10:18 PM",
      "body": "Quote from: Odohu on January 07, 2024, 05:12:42 PMQuote from: chantatic on January 07, 2024, 04:54:27 PMI came across this meme and its too funny not to share. Miners are creating spam ordinals to create fake traffic jams each time the rate fee drops quickly     I don't know how you arrived at the conclusion that miners are behind ordinals. I don't actually believe that to be true only there are substantial evidence to support that. What I think is that miners just saw opportunities in it and are benefitting accordingly. They may not be behind it, it could just be the handwork of people that want to leverage on the popularity of Bitcoin to scam people of their money in.exchange for digital jpeg. I agree that there is no solid proof that miners or pools are behind these ordinals but I do think that some pools/miners are spamming the mempool by dust transactions with higher transaction fees.  I had seen several $0.25 transactions getting listed on mempool site with higher than the usual transaction fee.  This makes me think that someone is trying to bump the competition for priority up with a small amount of transactions.  The thing is that I think that it is some pool or miners bumping the tx fee because they are the one who gets the benefit when the price if tx fee increases but I don't say that they are the ones behind the oridinal spams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "January 07, 2024, 10:17:12 PM",
      "body": "as rewards drop it is more important to have higher fees.Quotehttps://newhedge.io/terminal/bitcoin/difficulty-estimatorLatest Block:   824787  (19 minutes ago)Current Pace:   88.9985%  (244 / 274.16 expected, 30.16 behind)Previous Difficulty:   72006146478567.1                             Current Difficulty:   73197634206448.34                            Next Difficulty:   between 65269405049652 and 71229982973035Next Difficulty Change:   between -10.8313% and -2.6881%Previous Retarget:   last Friday at 7:36 PM  (+1.6547%)Next Retarget (earliest):   January 20, 2024 at 5:03 AM  (in 12d 11h 45m 6s)Next Retarget (latest):   January 21, 2024 at 1:08 PM  (in 13d 19h 50m 26s)Projected Epoch Length:   between 14d 9h 26m 43s and 15d 17h 32m 3s240 blocks made vs 270 if normal.that crowds the memory pool a lot.if it is due to miners underclocking huge mines. they lost 30 x 6.25 coins in reward.but fees get jacked for the 240 blocks made.as big a problem as ordinals are what I an talking about is worse.at the ½ they would lose the 30 blocks jack the fees for the 240 blocks.at a cost of 30 x 3.125 = 93.75 coins.this is a problem that seems to be certain to happen.and to avoid the difficulty change to fix this they will over clock later in the same 2 week difficulty period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "January 07, 2024, 10:47:22 PM",
      "body": "Quote from: Odohu on January 07, 2024, 05:12:42 PMQuote from: chantatic on January 07, 2024, 04:54:27 PMI came across this meme and its too funny not to share. Miners are creating spam ordinals to create fake traffic jams each time the rate fee drops quickly     I don't know how you arrived at the conclusion that miners are behind ordinals. I don't actually believe that to be true only there are substantial evidence to support that. What I think is that miners just saw opportunities in it and are benefitting accordingly. They may not be behind it, it could just be the handwork of people that want to leverage on the popularity of Bitcoin to scam people of their money in.exchange for digital jpeg. True, there's no proof on telling that those miners are behind with those spam transactions on which they are really that driving the fee price or value to the roof.Just like on what others been saying that there's no proof and there's no solid evidence but pretty much sure that these minders are really that happy on whats happening considering that they are earning more, but now as we can see that the network condition is slowly going back to normal and this is something that most crypto people do really likes on which it is really that pain in the ass when we do speak about high transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "January 07, 2024, 11:08:51 PM",
      "body": "Quote from: Odohu on January 07, 2024, 05:12:42 PMI don't know how you arrived at the conclusion that miners are behind ordinals. I don't actually believe that to be true only there are substantial evidence to support that. What I think is that miners just saw opportunities in it and are benefitting accordingly. They may not be behind it, it could just be the handwork of people that want to leverage on the popularity of Bitcoin to scam people of their money in.exchange for digital jpeg. Maybe if you've got a funny bone in you then you're going to find it funny, I don't think OP meant any harm or slander towards the miners, it's just that in the past few months of popularity of ordinals they're the most that's benefited in all of this inscription craze because the inscription takes up space in the mempool and with spaces taken up, it makes it so that transactions are being delayed which increases the fee for us who just want to do a bitcoin transaction, I'm sure it's not a real thing that miners are desperately filling up the mempool by spamming ordinals to increase the fees but it's still not that far fetch to think that it can be a possibility right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "January 07, 2024, 11:33:39 PM",
      "body": "Quote from: chantatic on January 07, 2024, 06:00:22 PMI didn't mean to imply Miners, I should of just said \"Man, Him, They\".I didn't realize how popular inscriptions are... historically the past 3 months its been even 50/50 split between hashes and inscriptions. craziness how popular they are.then you should have changed it by now by editing OP because mining is not about making the fees increase. I am sure you know that miners mine new blocks so I am not sure why you think that miners are the one who cause the traffic in the mempool. In my opinion, you are already spreading misinformation about miners and you didn't even provide proof that miners are behind those spam transactions that makes the mempool very busy and traffic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 07, 2024, 11:49:09 PM",
      "body": "Quote from: philipma1957 on January 07, 2024, 10:17:12 PMas rewards drop it is more important to have higher fees.wrongspot market price rises to counter reward dropsits called deflationminers were not poor when the market was $17k they are not poor when the market is $44k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chantatic",
      "created_time": "January 08, 2024, 04:18:30 PMLast edit: January 08, 2024, 04:49:49 PM by chantatic",
      "body": "I updated my original post and replaced \"miners\" with \"man\". I didn't mean to stir the pot and create another overly exhausted debate regarding the network congestion.This was purely comedy, as this meme was based off another funny meme. A meme within a meme. If you didn't find the meme funny, as I did. My apologies and feel free to tag it for removal.Whatever the cause is... I'm sure the bitcoin community is already fully aware of it and hopefully the 250,000+ unconfirmed hashes in mempool will eventually get confirmed.If there are more ordinals being confirmed than transactions at each block_height, I feel that the mempool will become bottomless.block_height 824834total ordinals in block 3386block_height 824833total ordinals in block 2702block_height 824832total ordinals in block 4417block_height 824831total ordinals in block 4570block_height 824830total ordinals in block 2318block_height 824829total ordinals in block 2901",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "January 08, 2024, 07:02:10 PM",
      "body": "Quote from: chantatic on January 08, 2024, 04:18:30 PMIf there are more ordinals being confirmed than transactions at each block_height, I feel that the mempool will become bottomless.I don't think the mempool can ever become bottomless. The default mempool size is 300MB, and all low-fee transactions that do not fit inside are periodically purged. Of course, anyone can arbitrarily change the default settings on their own node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chantatic",
      "created_time": "January 09, 2024, 02:11:48 AMLast edit: January 09, 2024, 02:35:01 AM by chantatic",
      "body": "Quotethe real finger pointing should be the pools that accept the spam and the core devs that caused the exploit but dont fix the exploits that allow the spam/fee bumpingWouldn't that just cause the next block to always have the same rate fee, if the mining pool managers ignore inscriptions? Since those spam ordinals don't get confirmed, it will always remain in mempools next block with the same rate fee. If you look in mempool, there is about 6,000 ordinals (filter by Inscriptions) between 30-35 sat/vb. Its like a buy wall of ordinals that keeps getting passed to the next block, because the mining pools are not accepting them to their block when found. This is tricking rate fees to always be 35sats or more, because of this wall of ordinals no one will confirm on the block sitting between 30-35sat/vb. If they don't get confirmed, rate fee will always be more than 35sat/vb. I don't think having pool managers removing them from their block is the solution. Its just passing the same issue, but downstream.Sorry, I can't figure out how to post a image in a comment.Wall of ordinals that keeps getting passed to the next block, when the current block is mined.Block 824932https://www.talkimg.com/images/2024/01/09/sVGqj.pngBlock 824936https://www.talkimg.com/images/2024/01/09/sVCtP.pngBlock 824937https://www.talkimg.com/images/2024/01/09/sVQLq.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "January 09, 2024, 02:28:00 AM",
      "body": "Quote from: chantatic on January 09, 2024, 02:11:48 AMQuotethe real finger pointing should be the pools that accept the spam and the core devs that caused the exploit but dont fix the exploits that allow the spam/fee bumpingWouldn't that just cause the next block to always have the same rate fee, if the mining pool managers ignore inscriptions? Since those spam ordinals don't get confirmed, it will always remain in mempools next block with the same rate fee. If you look in mempool, there is about 6,000 ordinals (filter by Inscriptions) between 30-35 sat/vb. Its like a buy wall of ordinals that keeps getting passed to the next block, because the mining pools are not accepting them to their block when found. This is tricking rate fees to always be 35sats or more, because of this wall of ordinals no one will confirmed on the block sitting between 30-35sat/vb. If they don't confirmed them, rate fee will always be more than 35sat/vb.Sorry, I can't figure out how to post a image in a comment.Wall of ordinals that keeps getting passed to the next block, when the current block is mined.Block 824932Block 824936Block 824937trying to fix it. not sure why 2 of 3 images posted not all 3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chantatic",
      "created_time": "January 09, 2024, 02:37:08 AM",
      "body": "I updated the first image link, thinking I figured out how to make them appear. Updated IMG link herehttps://www.talkimg.com/images/2024/01/09/sVGqj.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}