{
  "id": "topic_5403337",
  "title": "bitbollo",
  "author": "bitbollo",
  "created_time": "June 20, 2022, 12:25:27 PMLast edit: June 20, 2022, 03:14:01 PM by bitbollo",
  "content": "What happened: I have just seen another FAKE ICO related Tesla coin. Of course they are not running anything like that and this is just another scam. Don't waste your time/money in such stupid things!Scammers Profile Link:  N/AReference Link:  https://imightfleqx.com/?campaign={ad1}Amount Scammed:  N/APayment Method:  N/AProof of Payment:  N/APM/Chat Logs:  N/AAdditional Notes: This scam is currently advertised in QUORA (it is not possible to report or tag!) They have also created a fake GUARDIAN Page (included dozens of comments)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403337",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "June 20, 2022, 02:57:03 PM",
      "body": "Although I don't expect from people reading into this forum fall for such a scam (for those interested I recommend the only good ICO, the Howey Coins), thank you for keeping the newbies alerted/informed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "June 21, 2022, 02:03:04 PM",
      "body": "Quote from: bitbollo on June 20, 2022, 12:25:27 PMWhat happened: I have just seen another FAKE ICO related Tesla coin. Of course they are not running anything like that and this is just another scam. Don't waste your time/money in such stupid things!I first saw an ad promotion about Tesla selling their tokenonnFacebookk. I was surprised to see this and after doing some investigation found that it's a scam. DM to provoke someone to click a link or join a fake token sale becomes an old method. I doubt anyone still fall for these type of offers in DM.But scammers now using money to promote their fake token sales ads through social media(Especially on Facebook, Twitter, and Instagram).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "June 23, 2022, 12:55:15 PM",
      "body": "Quote from: DVlog on June 21, 2022, 02:03:04 PMQuote from: bitbollo on June 20, 2022, 12:25:27 PMWhat happened: I have just seen another FAKE ICO related Tesla coin. Of course they are not running anything like that and this is just another scam. Don't waste your time/money in such stupid things!I first saw an ad promotion about Tesla selling their tokenonnFacebookk. I was surprised to see this and after doing some investigation found that it's a scam. DM to provoke someone to click a link or join a fake token sale becomes an old method. I doubt anyone still fall for these type of offers in DM.But scammers now using money to promote their fake token sales ads through social media(Especially on Facebook, Twitter, and Instagram). Do you think Elon will use Facebook if he happens or decide to launch his own token, he can sell or promote it on his official Twitter handle or the site he owns, and it will be a big headline to the whole community people should start thinking the right way, when you stumble a coin where the developers are associating it to a very popular person whether it's Elon or any other person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 23, 2022, 02:08:52 PM",
      "body": "I do not know, but if you will fall victim to such stupid scam, you do not know why you invest and you will lose your money quickly, they tried to imitate the Guardian newspaper, but the end result was not professional, and the announcement of a company like Tesla to create an ICO/coin?! will bring it more views than promoting in Quora.Sometimes I wonder why scammers make such efforts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "June 23, 2022, 02:29:29 PM",
      "body": "Quote from: bitbollo on June 20, 2022, 12:25:27 PMWhat happened: I have just seen another FAKE ICO related Tesla coin. Of course they are not running anything like that and this is just another scam. Don't waste your time/money in such stupid things!I try to look at in: https://coinmarketcap.com/currencies/tesla/, fortunately, fake Tesla coins are not listed on any trading exchange, this is a real warning, for crypto investors or users, be careful with new coins what else in the name of Tesla, Elon and so on.Thanks, @bitbollo you have found a fake ICO project about tesla coin, I hope people will think 1000X before doing anything about this ridiculous project in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "June 23, 2022, 11:35:36 PM",
      "body": "Quote from: Husires on June 23, 2022, 02:08:52 PMI do not know, but if you will fall victim to such stupid scam, you do not know why you invest and you will lose your money quickly, they tried to imitate the Guardian newspaper, but the end result was not professional, and the announcement of a company like Tesla to create an ICO/coin?! will bring it more views than promoting in Quora.Sometimes I wonder why scammers make such efforts.Some people are in a hurry to invest. They always have in mind how to make a quick profit and differentiate themselves from others. They also realize how dangerous it can be to think of crypto projects as a means to make a quick profit. And scammers always use company names that make a greedy investor think of making a quick profit, which makes them ready to invest. So the victims of such scams are mostly greedy people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 23, 2022, 11:59:51 PM",
      "body": "Quote from: bitbollo on June 20, 2022, 12:25:27 PMThis scam is currently advertised in QUORA (it is not possible to report or tag!)It seems like Quora have their own Ads platform where any one can create an ad account and start running his ad campaign as long as he pays for the clicks:https://www.quora.com/How-do-Quora-ads-work-Who-can-advertise-What-are-the-pricing-plansYou are right there is no direct option (report button) to report such fake ads so the only option left is to contact their support via email.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "okorieemmanuel",
      "created_time": "June 24, 2022, 12:10:04 AM",
      "body": "Quote from: khaled0111 on June 23, 2022, 11:59:51 PMQuote from: bitbollo on June 20, 2022, 12:25:27 PMThis scam is currently advertised in QUORA (it is not possible to report or tag!)It seems like Quora have their own Ads platform where any one can create an ad account and start running his ad campaign as long as he pays for the clicks:https://www.quora.com/How-do-Quora-ads-work-Who-can-advertise-What-are-the-pricing-plansYou are right there is no direct option (report button) to report such fake ads so the only option left is to contact their support via email.You can report such advertisement in quora. I wonder why you didn't do such before making this post. Even if it is via the support email,  that would do",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 24, 2022, 02:39:10 AM",
      "body": "Quote from: YOSHIE on June 23, 2022, 02:29:29 PMI try to look at in: https://coinmarketcap.com/currencies/tesla/, fortunately, fake Tesla coins are not listed on any trading exchange, this is a real warning, for crypto investors or users, be careful with new coins what else in the name of Tesla, Elon and so on.Actually there is a list on coinmarketcap but that one is for a legit stock share I guess since its Elon whom related to crypto due to dogecoin. I wonder why coinmarketcap listed it there probably another hype on crypto peeps for them to get more marketing. Especially Cz owns cmc which is likely a close friend of Elon Musk. Pretty easy to mistakenly input that there out of friendship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 24, 2022, 09:37:09 AM",
      "body": "Quote from: okorieemmanuel on June 24, 2022, 12:10:04 AMYou can report such advertisement in quora. I wonder why you didn't do such before making this post. Even if it is via the support email,  that would doFor many reasons!First of all, there is no button to directly report a fake sponsorship, and I am not a regular visitor to that platform.Even sending an email you can't directly link to a sponsor scam! There is not this option.*Moreover I do not know how long it takes quora to remove such a thing (or if it will be removed).Then it is right to leave a trace even on a forum that deals specifically with these topics!Anyone who is curious to better look for the site link or other information arrives here so it is sure it is a scam.OT* Likewise I have noted another scam advertised on their pages \"Quantum AI\" (a kind of automatic trading machine that will make you billionaire in a couple of weeks). https://deccanherald.digital/It can't be emailed to them because they are asking for a direct link  and it cannot be linked directly in a messagehttps://help.quora.com/hc/en-us/requests/new?ticket_form_id=360000018026QuoteIdentify specifically (via URL) the location of the content that you believe is infringing (e.g., https://www.quora.com/xxx-yyy-zzz)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "June 24, 2022, 11:44:40 AM",
      "body": "Quote from: cryptoaddictchie on June 24, 2022, 02:39:10 AMQuote from: YOSHIE on June 23, 2022, 02:29:29 PMI try to look at in: https://coinmarketcap.com/currencies/tesla/, fortunately, fake Tesla coins are not listed on any trading exchange, this is a real warning, for crypto investors or users, be careful with new coins what else in the name of Tesla, Elon and so on.Actually there is a list on coinmarketcap but that one is for a legit stock share I guess since its Elon whom related to crypto due to dogecoin. I wonder why coinmarketcap listed it there probably another hype on crypto peeps for them to get more marketing. Especially Cz owns cmc which is likely a close friend of Elon Musk. Pretty easy to mistakenly input that there out of friendship. They don't have proper scanning on which is scam and which is not so I think Coinmarketcap really need to fix this because scammers are using their platform to make their project legitimate then scam innocent investors. Also Elon Musk is a famous guys so obviously every investor could verify easily about this scam tesla ICO since for sure if this is owned legitimately by Elon Musk they can see it promoted on his legitimate social media handles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}