{
  "id": "topic_5468838",
  "title": "minerjones",
  "author": "minerjones",
  "created_time": "October 02, 2023, 01:29:42 AM",
  "content": "I just completed the auction for this 0.5BTC Casascius silver coin here:https://bitcointalk.org/index.php?topic=5468069.msg62926404#msg62926404Both I and the owner of the listed coin were engaged with notorious elements after the auction had ended.From fake forum PMs to fake emails using an unknown/fake email address.Based on the value of what could have been lost, I would like to state this:1) From now on, all auction/sales addresses will be listed in said thread... there will NEVER be a change to thisNo emails, Telegrams. Discords, forum PM, etc... the listed address will be the ONLY address for payment2) Any messages or PMs outside of this forum should be disregarded. This is the only place that transaction information will be accepted.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468838",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "October 02, 2023, 06:44:30 AM",
      "body": "Outside communications like those on telegram are red flags. I think the more transparent things are, the safer they are and less risky for all involved. The more simple the better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 02, 2023, 07:05:54 AM",
      "body": "very good decision mj!in view of this approach, i would then add the following to the topic title: official list of payment addresses for completed auctions/sales or something like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StackItUp",
      "created_time": "October 02, 2023, 04:00:38 PM",
      "body": "Thank you for letting know. I support this decision, it will be much more safe especially when trading high value items",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 02, 2023, 08:00:49 PM",
      "body": "Quote from: Eclipse33 on October 02, 2023, 07:49:05 PMI just had a previous client of mine message me on eBay out of the blue asking why I was trying to take the sale off platform. I was not messaging this client previously. Turns out there is a scammer on eBay using my logo and pictures to try to bag my clients off platform. My client nearly fell for it and got taken off platform and bagged. I vote to put a headhunt on all scammers. Defend our commerce and marketplace from this filth. Perhaps the bitcointalk anti-scammer coalition. The problem with things like that are people will inevitably abuse them for extortion-like purposes. If you don’t believe that, just check my trust ratings…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "October 02, 2023, 08:16:32 PM",
      "body": "Quote from: Eclipse33 on October 02, 2023, 07:49:05 PMI just had a previous client of mine message me on eBay out of the blue asking why I was trying to take the sale off platform. I was not messaging this client previously. Turns out there is a scammer on eBay using my logo and pictures to try to bag my clients off platform. My client nearly fell for it and got taken off platform and bagged. I vote to put a headhunt on all scammers. Defend our commerce and marketplace from this filth. Perhaps the bitcointalk anti-scammer coalition. Problem is it’s likely going to be illegal in many ways, and those with enough Mr Robot skills to find these sub-humans have too much to lose as well..so it’s not going to be worth it for most people.  It’s messed up that scammers are constantly watching every single post. My advice to you twats (scammers) , get a real job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rsincognito",
      "created_time": "October 02, 2023, 10:23:48 PM",
      "body": "had someone couple days ago try and phish me on this forum by sending a DM saying \"Hi rsincognito, I've replied to you\" with a link to a fake login page trying to steal my account, the name it was done under was \" klien_br \" shows that they are a Sr. Member on here also, they almost got me but last min I saw the URL was not correct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "October 02, 2023, 10:32:31 PM",
      "body": "Quote from: rsincognito on October 02, 2023, 10:23:48 PMhad someone couple days ago try and phish me on this forum by sending a DM saying \"Hi rsincognito, I've replied to you\" with a link to a fake login page trying to steal my account, the name it was done under was \" klien_br \" shows that they are a Sr. Member on here also, they almost got me but last min I saw the URL was not correct.Yeah, thankfully there was this change made a few years ago, if nobody has still noticed. https://bitcointalk.org/index.php?topic=1432118",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Steeley",
      "created_time": "October 03, 2023, 07:37:15 PM",
      "body": "Quote from: owlcatz on October 02, 2023, 10:32:31 PMQuote from: rsincognito on October 02, 2023, 10:23:48 PMhad someone couple days ago try and phish me on this forum by sending a DM saying \"Hi rsincognito, I've replied to you\" with a link to a fake login page trying to steal my account, the name it was done under was \" klien_br \" shows that they are a Sr. Member on here also, they almost got me but last min I saw the URL was not correct.Yeah, thankfully there was this change made a few years ago, if nobody has still noticed. https://bitcointalk.org/index.php?topic=1432118Brilliant addition. Thanks for pointing this out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StackItUp",
      "created_time": "October 06, 2023, 11:29:43 AM",
      "body": "Quote from: rsincognito on October 02, 2023, 10:23:48 PMhad someone couple days ago try and phish me on this forum by sending a DM saying \"Hi rsincognito, I've replied to you\" with a link to a fake login page trying to steal my account, the name it was done under was \" klien_br \" shows that they are a Sr. Member on here also, they almost got me but last min I saw the URL was not correct.can i use your own answer to reply to this post?here you go:Quote from: rsincognito on August 10, 2023, 04:40:12 PMwow I just lost 5 mins of my life reading all this.  lol reminds me of a Justin Timberlake song, what is the name of  song again?  ow yes\"Cry me a River\" ref:  https://bitcointalk.org/index.php?topic=5432463.msg62676183#msg62676183",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Box Guy",
      "created_time": "October 08, 2023, 10:08:51 PM",
      "body": "Quote from: rsincognito on October 02, 2023, 10:23:48 PMhad someone couple days ago try and phish me on this forum by sending a DM saying \"Hi rsincognito, I've replied to you\" with a link to a fake login page trying to steal my account, the name it was done under was \" klien_br \" shows that they are a Sr. Member on here also, they almost got me but last min I saw the URL was not correct.Just got the same dm….. link sends you to a mirror portal that tries to phish your credentials. I did not fall for it but changed my password just in case out of excess precaution. BE CAREFUL GUYS. Anyone can fall for this if distracted. Stay safe….https://imgur.com/TU92eIU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hackbert",
      "created_time": "October 08, 2023, 10:11:26 PM",
      "body": "I got the same link from the same guy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 08, 2023, 10:26:21 PM",
      "body": "I want to suggets that important data like payment address and other relevant stuff should be signed with their bitcoin public address or with some signed PGP Public key.Those data must be stacked in some of the forum post with in some months or weeks:Stake your Bitcoin address hereThe BCT PGP/GPG Public Key Database: Stake Your PGP Key HereI know that this may be some difficult for some people, but at least most software wallet like electrum/sparrow can sign text messagess easily.At least with this you may notice that you are dealing with someone that knows what is he doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}