{
  "id": "topic_5416135",
  "title": "SOKO-DEKE",
  "author": "SOKO-DEKE",
  "created_time": "October 06, 2022, 07:16:24 AM",
  "content": "I've noticed that scams are becoming more common on a daily basis, and scammers are coming up with new tactics to steal from people, so I believe it's best to secure our funds. Newbies like myself makes up a larger portion of scam victims, I'd like to share some scam pattern, which I believe some people might think is already been known by everybody but I know there are still lots of newbies that will fall for the scam, so I know this post will be helpful to newbies in the forum. 1, phishing link; most people receive links which you will be asked to click the link and input your details in the link, we should always avoid that, don’t click on random link’s, the links are been shared on socials, most especially on Telegram, if you drop a message on telegram group, you will receive random messages from different people and they will change their name to customer support, they will be acting link customer care and you will be send a link which some will ask you to input your details, some will ask you to connect your wallet address, always make sure you don’t respond to any private message you receive on telegram trying to act as a customer support, all of them are scammers, a customer care will guide you on what to do in the group and they won’t message you privately.2, fake crypto exchange; scammers have advanced to the level of creating fake crypto exchange, just to defraud people, that’s why we have to be very smart when using a exchange, we should make sure that we are trading on a reputable exchange, most newbies don’t care about the exchange which they are trading on, they believe all exchange are the same and most of those fake exchange provides bonuses which will encourage people to use there exchange, immediately you deposit to make withdrawal will be kind of difficult.some of them will clone a crypto app on playstore, mostly there is always a little difference in the name, so you have to be very careful when downloading any app on playstore, most preferably make sure you get link that will direct you to the application on playstore from there official website. Sometimes people create a app that’s yet to be launched on playstore and they will launch it on playstore, anybody that download and input details on the app, your account will be hacked because they are already having access to your account. For example let’s assume binance exchange is just having web alone and they are yet to launch their app on playstore, someone might decided to design a app and they will launch it on playstore, any one that see it will think the app belongs to binance. 3, giveaway scam; mostly newbies are the once that mostly fall for this kind of scam, crypto space is not where free money is been shared, you have to work for your money. Sometimes you will receive some coins which after receiving it, some of them will be listed on exchange like pancake, if you try to swap it they request for high gas if and after confirming that you want to swap it, the gas fee will be deducted from your account and your transaction won’t be successful. There are other patterns they use to scam through giveaway that’s different from the one I sighted as an example above, we have to be very careful and to avoid giveaway. Sometimes you see on social media like Twitter that a highly influential person is running a giveaway, we should avoid posts like that, most of them are scammers. 4, fake bitcoin recovery service; their are some people claiming to be bitcoin recovery service, they always claim they can recover your lost bitcoin for you which some of them will request for your private key or your private details which at the end they will endup stealing from you and won’t help you recover any bitcoin, we have to be very careful because mostly newbies are the once that fall victim of all those scam pattern, if your bitcoin have been stolen, Don’t believe any crypto recovery service.5; Ponzi scheme; Cryptocurrency is not a Ponzi scheme so we have to be very careful, scammers are everywhere asking people to invest in some sites and in few hours or few days, you will receive double of your investment, or huge return of your investment without any risk, all those investments are fake, we have to be very careful, the huge return in investment always encourage newbies to invest in it which at the end they endup losing all their money to ponzi and they will blame bitcoin or cryptocurrency for that.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416135",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "October 06, 2022, 09:00:53 AM",
      "body": "Quote from: SOKO-DEKE on October 06, 2022, 07:16:24 AM4, fake bitcoin recovery service; their are some people claiming to be bitcoin recovery service, they always claim they can recover your lost bitcoin for you which some of them will request for your private key or your private details which at the end they will endup stealing from you and won’t help you recover any bitcoin, we have to be very careful because mostly newbies are the once that fall victim of all those scam pattern, if your bitcoin have been stolen, Don’t believe any crypto recovery service.I can understand if the trick is to get a hard fork but there is no recovery service it's either you have the bitcoin or you don't so if you give someone your private key you give them the same degree of access that you have.The only logical thing is that you have part of the seed (nine out of 12 words) and therefore you need some help to get access to your coins or you forgot part of your password.The rest of scam methods are easy to detect if you educate yourself, but in the end everything depends on your knowledge, so do not stop searching and asking questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "October 06, 2022, 09:09:47 AM",
      "body": "It's just a common trick that everyone already know because it's not only happen on Bitcoin space. As long as it's related to money or wealth, scammers will try to trap someone who have a low knowledge and rob their money.You're forgot one thing that everyone should know what's actually the most scammy in crypto space, it's shitcoins (e.g. 99% of cryptocurrency). Those new projects that you see on Altcoin or bounty section are full of scam, anyone should avoid and just buy Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 06, 2022, 12:37:50 PM",
      "body": "Quote from: Despairo on October 06, 2022, 09:09:47 AMIt's just a common trick that everyone already know because it's not only happen on Bitcoin space. As long as it's related to money or wealth, scammers will try to trap someone who have a low knowledge and rob their money.You're forgot one thing that everyone should know what's actually the most scammy in crypto space, it's shitcoins (e.g. 99% of cryptocurrency). Those new projects that you see on Altcoin or bounty section are full of scam, anyone should avoid and just buy Bitcoin.You're right. But the problem is that almost everyone who is interested in the altcoin and bounty sections does not want and perhaps does not have the means to buy bitcoin. They try their luck at catching freebies, which in turn empty their already empty wallets. One could imagine if everyone suddenly woke up and realized that the more they participated in all sorts of scam bounties and giveaways, the more they exacerbated the problem with scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iSQL",
      "created_time": "October 06, 2022, 05:13:21 PM",
      "body": "What about scamming the scammers? There is an amazing tool called BEEF, you can setup your environment, make the web page public and send it you the scammer.You have full control over that webpage for JavaScript commands, so you can scare the **** out of scammer like telling them you got their IP (you can do it with this tool) and telling them that they are reported to the police.I do this to all scammers, and they delete every message they have sent to me Other way: there are those smart contract wallets where there are 1000's of dollars, but no ETH for the fee. You voluntarily give seed phrase to the scammer, and when they send ETH for the transaction fee, that ETH gets redirected to void or your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JustEducated",
      "created_time": "October 06, 2022, 05:55:20 PM",
      "body": "Quote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers? <...> Other way: there are those smart contract wallets where there are 1000's of dollars, but no ETH for the fee. You voluntarily give seed phrase to the scammer, and when they send ETH for the transaction fee, that ETH gets redirected to void or your wallet.And when you're done with it what will you call yourself then? If you should carryout something like this, it means you're no different from the scammer so you should also consider yourself a scammer too.The best thing to do is to take precautions and avoid been scammed rather than trying to outsmart the scammer, something could go wrong and you might loss your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 06, 2022, 07:49:29 PM",
      "body": "Quote from: SOKO-DEKE on October 06, 2022, 07:16:24 AM5; Ponzi scheme; Cryptocurrency is not a Ponzi scheme so we have to be very carefulWell, cryptocurrencies that give a solution to a real problem, have no promised returns, are not primarily driven from a leader who's going to run away with the first deposits, aren't ICO-based, and are completely transparent aren't ponzi schemes. But, strangely, the crypto community is consisted mostly on ponzi, fraudulent, get-broke-quick schemes.Quote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers?Absolute waste of energy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "October 06, 2022, 08:08:38 PM",
      "body": "Quote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers? If you have enough free time to do it you can but you can't just be doing this everytime there's someone trying to hack you since they keep coming no matter what we do. I find it as a complete waste of time not unless if you get paid for doing that but for doing it just to scare them is not enough.Best way to avoid these scammers is to not to entertain anyone or someone that you don't know or having no business with especially to those who doesn't have enough reputation to be talking to you. They could be a potential scammer just trust on your instinct if you have had enough experience with these scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 06, 2022, 08:15:49 PM",
      "body": "Quote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers? Don't you think that makes you are scammer yourself? Really if you have scam intentions no matter what is creating such intentions you are automatically a scammer yourself. I would say there are very effective several other ways to punish a scammer rather than being a scammer yourself. One big way to do that is to report the scammer. Regardless of the platform you can always report a scammer, another way to frustrate a scammer is being wise, not greedy and informing as many people as you can about potential scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "October 06, 2022, 09:03:39 PM",
      "body": "You see, the idea of scammers and their victims is nothing more than taking advantage of ignorance. Even if you are literate and well-informed about everything, a fraudster could be able to use your lack of knowledge of one or two important facts against you. People are unfamiliar with cryptocurrency, so scammers target those who can't tell A from B. It could also be the result of greed, but if you know that A is better than B, you'll naturally find a way to curb your greed. Quote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers? There is an amazing tool called BEEF, you can setup your environment, make the web page public and send it you the scammer.You have full control over that webpage for JavaScript commands, so you can scare the **** out of scammer like telling them you got their IP (you can do it with this tool) and telling them that they are reported to the police.I do this to all scammers, and they delete every message they have sent to me As I have said, it is all about ignorance. If you can scare a scammer away by command of a script, then he is not informed about your tactics else he will find a way to manipulate you further to scam you. Information is the key for a scammer.QuoteOther way: there are those smart contract wallets where there are 1000's of dollars, but no ETH for the fee. You voluntarily give seed phrase to the scammer, and when they send ETH for the transaction fee, that ETH gets redirected to void or your wallet.A scammer can code you a smart contract and give you a seed phrase to his coins, and you won't be able to do anything with his wallets. They can give you a wallet that contains ETH or BNB or any EVM compatible, and as soon as you deposit or try to swap, it will redirect all your balance into another wallet because you will ask to authorise the transaction, and what happens in the background is not displayed, just a warning to proceed with a transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 06, 2022, 09:49:59 PM",
      "body": "Quote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers? If you have free time to do that, then do it. But I won't do what they do because you'll also be part of them even if your victim is them. @OP, the last bull run had made a lot of money from those developers that did rug pull and made their projects look genuine. But from the beginning, they've all planned that they're going to be out when too many investors have already trusted them. That goes by the NFT projects and as well as new projects that has launched their tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "October 07, 2022, 06:49:44 AM",
      "body": "Quote from: SOKO-DEKE on October 06, 2022, 07:16:24 AMWow you nailed this stuff and more grease to your elbow. And adding to all you've said so far, it is always advised to make lots of researches before jumping into cryprocurrencies. One of the major reasons why newbies like myself fall for very cheap scams, is the mentality that crypto is a get rich quick scheme and on sighting any promising opportunity on the internet, we tend to jump on it without proper findings and research, and at the end of the day get scammed and we start parading crypto as a scam, hence discouraging other people who which to get involved in crypto.Quote from: passwordnow on October 06, 2022, 09:49:59 PMQuote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers? If you have free time to do that, then do it. But I won't do what they do because you'll also be part of them even if your victim is them.  launched their tokens.I don't really think it will be easy to scam the scammer, as the scammer's sole goal is to make money and not lose money in any form. There is nothing like free time as it will be just a waste of time but if you can scam the scammer a d get successful with that then there is no harm in that because you outsmarted the scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 07, 2022, 01:12:55 PM",
      "body": "Quote from: SOKO-DEKE on October 06, 2022, 07:16:24 AM5; Ponzi scheme; Cryptocurrency is not a Ponzi scheme so we have to be very carefulThis is most common to beginners or newbies in cryptocurrency, they appear in two categories, the first set believes bitcoin as a ponzi there give every approach they have towards it in the direction of a ponzi get rich quick and die quick your finances, the second category are the type of newbies that eventually know cryptocurrency is different from ponzi but yet fall in hand by investing on the wrong coins all in the name of they are all under cryptocurrency, they don't even know the difference of bitcoin from other altcoins and fall into altcoins that swindles away their funds, this type of category actually thought they know it but eventually had no idea how scammers can go to hunt them through ponzi-like projects in cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 07, 2022, 01:39:02 PM",
      "body": "Quote from: SOKO-DEKE on October 06, 2022, 07:16:24 AM2, fake crypto exchange; scammers have advanced to the level of creating fake crypto exchange, just to defraud people, that’s why we have to be very smart when using a exchange, we should make sure that we are trading on a reputable exchange, most newbies don’t care about the exchange which they are trading on, they believe all exchange are the same and most of those fake exchange provides bonuses which will encourage people to use there exchange, immediately you deposit to make withdrawal will be kind of difficult.some of them will clone a crypto app on playstore, mostly there is always a little difference in the name, so you have to be very careful when downloading any app on playstore, most preferably make sure you get link that will direct you to the application on playstore from there official website. Sometimes people create a app that’s yet to be launched on playstore and they will launch it on playstore, anybody that download and input details on the app, your account will be hacked because they are already having access to your account. For example let’s assume binance exchange is just having web alone and they are yet to launch their app on playstore, someone might decided to design a app and they will launch it on playstore, any one that see it will think the app belongs to binance. Fake crypto exchanges and fake gambling sites currently harm crypto users, always check the reputation of the gambling site or exchange you are using, this is very important because it is not easy to get money, so don't put your money on a fraudulent platform.Quote from: SOKO-DEKE on October 06, 2022, 07:16:24 AM5; Ponzi scheme; Cryptocurrency is not a Ponzi scheme so we have to be very careful, scammers are everywhere asking people to invest in some sites and in few hours or few days, you will receive double of your investment, or huge return of your investment without any risk, all those investments are fake, we have to be very careful, the huge return in investment always encourage newbies to invest in it which at the end they endup losing all their money to ponzi and they will blame bitcoin or cryptocurrency for that.sweet promises and that's what scammers always promise, big ROI in a short time is impossible, maybe at one or two times you receive the Reward as they promised but over time, it will change and, you will not receive it again (promise of reward) as they offered at the beginning, the ponzi scheme is a trick that has been there from the start, always pay attention to everything, don't fall into the trap of ponzi schemes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "October 07, 2022, 02:11:36 PM",
      "body": "Quote from: hugeblack on October 06, 2022, 09:00:53 AMQuote from: SOKO-DEKE on October 06, 2022, 07:16:24 AM4, fake bitcoin recovery service; their are some people claiming to be bitcoin recovery service, they always claim they can recover your lost bitcoin for you which some of them will request for your private key or your private details which at the end they will endup stealing from you and won’t help you recover any bitcoin, we have to be very careful because mostly newbies are the once that fall victim of all those scam pattern, if your bitcoin have been stolen, Don’t believe any crypto recovery service.I can understand if the trick is to get a hard fork but there is no recovery service it's either you have the bitcoin or you don't so if you give someone your private key you give them the same degree of access that you have.The only logical thing is that you have part of the seed (nine out of 12 words) and therefore you need some help to get access to your coins or you forgot part of your password.The rest of scam methods are easy to detect if you educate yourself, but in the end everything depends on your knowledge, so do not stop searching and asking questions.According to the OP's description, I think he was talking about fake Bitcoin recovery services from old storage this is common among the early miners of Bitcoin who still have access to their old computer used to mine Bitcoin during the stage of the CPU mining of Bitcoin and the scammer that offer recovery of coins stolen by online scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 07, 2022, 03:57:33 PM",
      "body": "Thank you for this article, though I know all of them and even more, the newbies would definitely gain from you and be more careful and proactive. No one knows it all in terms of keeping our accounts and profiles safe online, not even companies that spend millions of dollars yearly to maintain their security. Binance was recently hacked with between $100-110M stolen, not to talk of the Axie Infinity hack with Nomad where almost $200M was stolen.So long as we can't be totally safe from online heists, we should be more informed and preventive and also use all the security layouts possible (Password, SMS notification, 2FA on another device, fingerprint).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 07, 2022, 09:05:18 PM",
      "body": "Quote from: Obari on October 07, 2022, 06:49:44 AMQuote from: passwordnow on October 06, 2022, 09:49:59 PMQuote from: iSQL on October 06, 2022, 05:13:21 PMWhat about scamming the scammers? If you have free time to do that, then do it. But I won't do what they do because you'll also be part of them even if your victim is them.  launched their tokens.I don't really think it will be easy to scam the scammer, as the scammer's sole goal is to make money and not lose money in any form. There is nothing like free time as it will be just a waste of time but if you can scam the scammer a d get successful with that then there is no harm in that because you outsmarted the scammer.I've seen some posts about scamming scammers and they really got the culprit. But that won't change the fact that you're doing the same thing as him even though the victim is the scammer himself. Yeah, you have outsmarted him and you're able to take revenge not just yourself but also the other victims but if you understand the whole point of it, you're not that different anymore from him because of what you've done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "October 07, 2022, 09:32:58 PM",
      "body": "Perhaps, their goal is to scam people and they will find a way how to trick us. Well, it has to say that some of these scammers are still using the old trick like doubling your money in a short period of time. Many people are aware of this trick but guess what, many people are still fooled to believe this scheme. That is why I haven't seen scammers will let go off there doing as they know that there are a lot of greedy people that will take their bait.  Even despite the awareness, I'm not sure if people are reading those stuff because from time to time we still heard about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "October 07, 2022, 09:44:07 PM",
      "body": "Quote from: Hypnosis00 on October 07, 2022, 09:32:58 PMPerhaps, their goal is to scam people and they will find a way how to trick us. Well, it has to say that some of these scammers are still using the old trick like doubling your money in a short period of time. Many people are aware of this trick but guess what, many people are still fooled to believe this scheme. That is why I haven't seen scammers will let go off there doing as they know that there are a lot of greedy people that will take their bait.  Even despite the awareness, I'm not sure if people are reading those stuff because from time to time we still heard about this. The fact that the scammer's scheme will always be the same to deceive the victim is only the difference in the methods and conditions according to the current hype, I always find victims with the same scam scheme because the victim is tempted to profit from the scam token investment even a few months ago about the token meme scam, so because of the crypto space have new members that are always growing so many of them do not have the ability to detect areas that must be avoided because of the scammer factor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}