{
  "id": "topic_5457550",
  "title": "ajiz138",
  "author": "ajiz138",
  "created_time": "June 25, 2023, 05:32:34 PM",
  "content": "Someone who joined the telegram channel at Bitcasino created a phishing site (Bitcasino) because recently Bitcasino distributed a bonus free spin code worth $20 so someone takes advantage of this situation, I hope the bitcasino telegram admin immediately deletes the chat.This phishing site can only log in with web3, and can't click anything unless it appears to be logged in with web3, so it's clear this is a phishing site.Code:https://bonus-bitcasino.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457550",
  "comments": [
    {
      "author": "ScamViruS",
      "created_time": "June 25, 2023, 05:40:25 PM",
      "body": "Whenever there is any kind of giveaway somewhere, a group prepares to scam using that trend. When casinos, exchanges, crypto projects announce their campaigns, a trend is created in the crypto market, which lasts for a long time. And scammers use this trend to scam many crypto users. Thank you for exposing this phishing website and alerting crypto gamblers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 25, 2023, 09:09:54 PM",
      "body": "Looks like one of those scam websites where if one tried to link their address containing some tokens to it, they would have all the tokens in their wallet drained in a matter of minutes or hours. I hope no one from here gets to fall for the scam, at least. Thanks for the heads-up OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 25, 2023, 10:21:51 PM",
      "body": "^Didn't check the phishing website thoroughly but I believe it's one of those scam websites that will ask you to make a deposit in order to get the bonus or to be able to withdraw.Telegram admins of reputable services should be more careful and remove such replies fastly. They can use bots or adjust the settings to prohibit posting links. Any post containing a link will be removed immediately and the poster may get banned. Thank you OP for the warning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 26, 2023, 12:26:04 AM",
      "body": "nice catch!now since we are talking about bitcasino phishing site, I'd like to add that I found another bitcasino website(URL below) which I think is also a phishing site(I am not entirely sure). if you visit the website you will be shown a clone of bitcasino.io but if you click the register button you will be redirected to another site called live.bitcasino.io where you can fill up the registration form which clearly is not what happens when you click \"register\" on bitcasino.io.Code:https://www.bitcasino.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "June 26, 2023, 09:03:59 AM",
      "body": "Quote from: khaled0111 on June 25, 2023, 10:21:51 PM^Didn't check the phishing website thoroughly but I believe it's one of those scam websites that will ask you to make a deposit in order to get the bonus or to be able to withdraw.Telegram admins of reputable services should be more careful and remove such replies fastly. They can use bots or adjust the settings to prohibit posting links. Any post containing a link will be removed immediately and the poster may get banned. Thank you OP for the warning. The reply continues to be left on the Bitcasino Telegram channel so that anyone can see the phishing site by offering a bonus of 50 USDT by the scammers, until now the admin is still not active, I hope this will be followed up soon so that some people are not tempted by this offer by scammers.Quote from: acroman08 on June 26, 2023, 12:26:04 AMnice catch!now since we are talking about bitcasino phishing site, I'd like to add that I found another bitcasino website(URL below) which I think is also a phishing site(I am not entirely sure). if you visit the website you will be shown a clone of bitcasino.io but if you click the register button you will be redirected to another site called live.bitcasino.io where you can fill up the registration form which clearly is not what happens when you click \"register\" on bitcasino.io.Code:https://www.bitcasino.com/Thank you for sharing another phishing site so that many people are more aware of it and they are aware not to go to the wrong site, I checked \"live.bitcasino.io\" it was clear when registering it was different from the official bitcasino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "June 26, 2023, 10:39:33 AM",
      "body": "Quote from: ajiz138 on June 26, 2023, 09:03:59 AMQuote from: khaled0111 on June 25, 2023, 10:21:51 PM^Didn't check the phishing website thoroughly but I believe it's one of those scam websites that will ask you to make a deposit in order to get the bonus or to be able to withdraw.Telegram admins of reputable services should be more careful and remove such replies fastly. They can use bots or adjust the settings to prohibit posting links. Any post containing a link will be removed immediately and the poster may get banned. Thank you OP for the warning. The reply continues to be left on the Bitcasino Telegram channel so that anyone can see the phishing site by offering a bonus of 50 USDT by the scammers, until now the admin is still not active, I hope this will be followed up soon so that some people are not tempted by this offer by scammers.Did you report it on Bitcasino Ann thread? Since most of the time their forum representative is active. Might he can do something if this issue reach to his knowledge and also you can also send a message to @LFC_Bitcoin or @jeremypwr maybe they can do something to contact other Bitcasino representatives to help resolve this possible issue.Edit: Just seen you posted it on their thread hopefully this will be taken care of immediately since this could scam a lot of people since bitcasino is we can consider a big casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 28, 2023, 07:25:43 AM",
      "body": "Quote from: avp2306 on June 26, 2023, 10:39:33 AMDid you report it on Bitcasino Ann thread? Since most of the time their forum representative is active. Might he can do something if this issue reach to his knowledge and also you can also send a message to @LFC_Bitcoin or @jeremypwr maybe they can do something to contact other Bitcasino representatives to help resolve this possible issue.What exactly do you think the original casino can do against phishing sites? The most they can do is report the site and write a warning. This will certainly not prevent the greedy who will try to get the free $50. Also, I am sure this is not the only one site like this.a small tip for identifying phishing fraudsters: Every serious casino will always choose a slightly louder domain, and that is almost never a domain with a - sign. Quote from: acroman08 on June 26, 2023, 12:26:04 AMnice catch!now since we are talking about bitcasino phishing site, I'd like to add that I found another bitcasino website(URL below) which I think is also a phishing site(I am not entirely sure). if you visit the website you will be shown a clone of bitcasino.io but if you click the register button you will be redirected to another site called live.bitcasino.io where you can fill up the registration form which clearly is not what happens when you click \"register\" on bitcasino.io.Code:https://www.bitcasino.com/Also, all subdomains like something.bitcasino.io are under the control of bitcasino.io. Anyone from the outside (without access to the domain administration) cannot create such a subdomain. And the page can look different when it comes to affiliate promotions.I would even say that bitcasino.com is legitimate because the affiliate link to the original site is used for login/sign-up. It's just a slightly different approach to collecting referrals than usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 28, 2023, 09:07:58 AM",
      "body": "Quote from: ScamViruS on June 25, 2023, 05:40:25 PMWhenever there is any kind of giveaway somewhere, a group prepares to scam using that trend. When casinos, exchanges, crypto projects announce their campaigns, a trend is created in the crypto market, which lasts for a long time. And scammers use this trend to scam many crypto users. Thank you for exposing this phishing website and alerting crypto gamblers.You're right, they make use of the trending events to to attract people to their tricks and create a cloned website to launch their attack, this calls for us to always check the website address clearly to see that it's their original website and not a counterfeit cloned by scammers, don't allow them to create any unnecessary impression for you to get tricked to their cloned websites and this is why we have always advises to go through the verified and official website of the intended destination we are looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "June 28, 2023, 10:27:59 PM",
      "body": "Quote from: ajiz138 on June 25, 2023, 05:32:34 PMSomeone who joined the telegram channel at Bitcasino created a phishing site (Bitcasino) because recently Bitcasino distributed a bonus free spin code worth $20 so someone takes advantage of this situation, I hope the bitcasino telegram admin immediately deletes the chat.This phishing site can only log in with web3, and can't click anything unless it appears to be logged in with web3, so it's clear this is a phishing site.Scammers are always vigilant and racing to acquire opportunities such as offers, bonuses, and giveaways that are published by casino platforms, exchanges, and other platforms, and they create such phishing sites and race to spread them to the casino platform communities with hundreds of their multiple accounts on Telegram, Discord, and others to catch victims and beginners who do not have experience and insights, It is sad that those of them who will link their wallets to this phishing site will not get 20$ of free spins, but will lose their entire wallets, so the first rule (Admin Never Send DM Frist) and if these offers are not published as official announcements on the platform or their official accounts in the social media, then there is no need for anyone to click on any links from unknown sources and not know them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "June 29, 2023, 09:26:00 PM",
      "body": "Quote from: Aanuoluwatofunmi on June 28, 2023, 09:07:58 AMQuote from: ScamViruS on June 25, 2023, 05:40:25 PM~~~You're right, they make use of the trending events to to attract people to their tricks and create a cloned website to launch their attack, this calls for us to always check the website address clearly to see that it's their original website and not a counterfeit cloned by scammers, don't allow them to create any unnecessary impression for you to get tricked to their cloned websites and this is why we have always advises to go through the verified and official website of the intended destination we are looking for. Crypto users are crazy too. If they find a bonus offer, they figure out how to take it. As a result, in most cases, they give their important information on the website without verifying whether the website is genuine or fake. So here scammers can take different chances. Crypto users should first have proper knowledge about the crypto market to avoid such scams, because if he starts researching about crypto, he will easily find information about how scammers are scamming crypto users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "July 01, 2023, 04:58:53 AM",
      "body": "Scammers every where looking for who to play fast on. Most times the project team and mangers are likely the ones who attracts them to their platform with their giveaways without putting modalities on ground to checkmate scammers if they would take advantage of the situation to scam their community. I think you take this to their telegram community and social media handle to call to their awareness of what is really happening so they take measures to safeguard their name and their community.OP, you can send this here here as a phishing site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}