{
  "id": "topic_5415854",
  "title": "GreatArkansas",
  "author": "GreatArkansas",
  "created_time": "October 04, 2022, 03:11:17 AM",
  "content": "QuoteThe report comes during a time when Congress is exploring the stablecoin industry and other tax rules for crypto brokers. Biden administration is also concerned about a repeat of the Terra-LUNA incident. However, the Congress members state that proper legislation is still months away.QuoteFSOC also suggests that the rules by Congress should cover abusive trading practices, customer asset segregation, cyber security, etc.This seems very interesting and exciting. Is this news good for the cryptocurrency market? We all know the United States is a big player in all markets especially cryptocurrency, with the USD being active and getting stronger against other currencies, now they mentioned crypto regulation.So, what are your takes here? Is this bad news or good news for the cryptocurrency community?Read more here: https://watcher.guru/news/biden-administration-asks-congress-for-clearer-crypto-regulation",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415854",
  "comments": [
    {
      "author": "mk4",
      "created_time": "October 04, 2022, 03:24:52 AM",
      "body": "It being good or bad will almost always depend on what the resulting regulation is. If I were to guess though? Probably not. Most if not all the fossils sitting in congress probably don't even know how to navigate the internet decently well. And now they're going to regulate new technologies? Lmao.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "October 04, 2022, 04:27:44 AM",
      "body": "I really do wish we (bitcoin) could decouple from legacy markets & government decisions for once & all. Feels annoying that it still matters (price direction) what a bunch of old people in suits say.It will come but would really like it if there was no price reaction to anything that governments do/say about bitcoin.I guess we are a long way from that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 05, 2022, 08:22:14 AM",
      "body": "The decision says that the appropriate legislation is still months away, and therefore we cannot judge until we see the draft of the final legislation.In addition, is the question of Congress binding, or is it just clarification?Generally, regulatory decisions push the price higher in the short term, but they are bad in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DudeAtWork420",
      "created_time": "October 05, 2022, 09:42:37 AM",
      "body": "Quote from: GreatArkansas on October 04, 2022, 03:11:17 AMQuoteThe report comes during a time when Congress is exploring the stablecoin industry and other tax rules for crypto brokers. Biden administration is also concerned about a repeat of the Terra-LUNA incident. However, the Congress members state that proper legislation is still months away.QuoteFSOC also suggests that the rules by Congress should cover abusive trading practices, customer asset segregation, cyber security, etc.This seems very interesting and exciting. Is this news good for the cryptocurrency market? We all know the United States is a big player in all markets especially cryptocurrency, with the USD being active and getting stronger against other currencies, now they mentioned crypto regulation.So, what are your takes here? Is this bad news or good news for the cryptocurrency community?This is a bad thing for crypto because they could declare some ecosystem illegals if they think they can not properly regulate them. I do not understand why the world have to obey one countries decisions. These senator just looking for a way to grab opportunity from these space so that more tax can be collected for their illegal war in various countries in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 05, 2022, 03:09:01 PM",
      "body": "They'd run out of fud if there is a clear crypto regulation to which  the SEC will have a clear rules to follow ad it will also be clearer for investors which ones to buy or not.  You can call it good news though. But because BTC is decentralize and government is not able hold it by the neck, its highly likely there will be a clear regulation for it unless they succeed in calling the change of code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 05, 2022, 05:10:23 PM",
      "body": "This is going to be a huge win for all of us in the crypto world. When there is a clear regulation, a legislation that makes it 100% legal but regulated, we are going to see so many companies in the crypto world, everyone will just follow the regulations and start something.It is not clear right now, it is following certain rules in the finance world, but there are so many grey areas, coinbase is the only one that grew big, we are going to see basically a wall street level of companies but in the crypto world when this is over. Biden probably doesn't even know what crypto is, but the fact that he wants it done quickly will help us for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vinaa77",
      "created_time": "October 05, 2022, 10:34:27 PM",
      "body": "Quote from: GreatArkansas on October 04, 2022, 03:11:17 AMThis seems very interesting and exciting. Is this news good for the cryptocurrency market? We all know the United States is a big player in all markets especially cryptocurrency, with the USD being active and getting stronger against other currencies, now they mentioned crypto regulation.So, what are your takes here? Is this bad news or good news for the cryptocurrency community?The implicit meaning is that crypto is already so popular, and prices keep increasing, but you don't pay taxes or fees for us. So with this regulation if you want to develop a crypto project, or use it you have to pay for us. That is another meaning of regulation. And this is also positive, so the existence of crypto can help improve the country's economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "October 05, 2022, 11:45:17 PM",
      "body": "Idk it seems good, at least to the point where they're going to try to at least understand crypto and if they really do, I don't think there'd be any regulations that could prove to be negative (since they know it wouldn't work if they took it past a certain point). Now if they were just willy-nilly doing stuff then we can expect some dumb moves here then I don't expect anything good at all from this decision. I say crypto being under dissemination by the congress is anything new, them properly understanding it can be something new though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 06, 2022, 02:39:24 AM",
      "body": "Judging from the letters of the news, it seems the \"proper legislation\" that the US congress is talking about would be a tight one. They're talking about the tax rules for crypto brokers, the Terra-LUNA incident, abusive trading practices, security. It looks like this \"proper legislation\" is coming from fear or anxiety.  I'm just hoping that despite this, a fair one would be crafted, one that is also exploring and recognizing the true potentials of the technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 06, 2022, 08:49:16 AM",
      "body": "Quote from: LFC_Bitcoin on October 04, 2022, 04:27:44 AMI really do wish we (bitcoin) could decouple from legacy markets & government decisions for once & all. Feels annoying that it still matters (price direction) what a bunch of old people in suits say.It will come but would really like it if there was no price reaction to anything that governments do/say about bitcoin.I guess we are a long way from that.Exactly. I don't think the issue here is the people or Bitcoin itself. But I think it's the people, they too much rely on what other entities or peoples or government do/says about Bitcoin, but we can't blame them. Even though Bitcoin is decentralized, governments are just being governments. I am curious if the market cap of Bitcoin or whole cryptomarket will double/triple or much more in the future, if this is still the same behaviour or reaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 06, 2022, 09:10:12 AM",
      "body": "Almost all countries are pointing toward adopting cryptocurrencies, so that's probably why they would want to be ahead with all the crypto regulation happening with the government. I hope they can already decide what regulatory framework they will apply to the crypto market. Additionally, with the stablecoin issuers to comply with, that should be the key. This is good news for the people who have been scammed and hopefully get back somehow with what they lost. With everything happening, it's better to be safe with regulations because that's how it will get people into the crypto community again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "October 06, 2022, 09:36:50 AM",
      "body": "Quote from: DudeAtWork420 on October 05, 2022, 09:42:37 AMQuote from: GreatArkansas on October 04, 2022, 03:11:17 AMQuoteThe report comes during a time when Congress is exploring the stablecoin industry and other tax rules for crypto brokers. Biden administration is also concerned about a repeat of the Terra-LUNA incident. However, the Congress members state that proper legislation is still months away.QuoteFSOC also suggests that the rules by Congress should cover abusive trading practices, customer asset segregation, cyber security, etc.This seems very interesting and exciting. Is this news good for the cryptocurrency market? We all know the United States is a big player in all markets especially cryptocurrency, with the USD being active and getting stronger against other currencies, now they mentioned crypto regulation.So, what are your takes here? Is this bad news or good news for the cryptocurrency community?This is a bad thing for crypto because they could declare some ecosystem illegals if they think they can not properly regulate them. I do not understand why the world have to obey one countries decisions. These senator just looking for a way to grab opportunity from these space so that more tax can be collected for their illegal war in various countries in the world.And I don't think that one country will obey other nations decision though. If US will set a precedence then it's good for them and their consumers, because that is their mandate isn't it? That's why regulations are put into place.But is doesn't mean that it will be the norm for other countries to follow. Every government in the world has it's leader that will make their decision base on what they need, not because they want to follow the US or any other nation as far as crypto regulation is concern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 06, 2022, 12:13:11 PM",
      "body": "QuoteBiden administration is also concerned about a repeat of the Terra-LUNA incident.Governments have never been concerned about people being scammed. What they are scared of, specifically US is when companies start \"print their own money\", ie the stablecoins. So they will do anything they can to put an stop to it. Lest we forget their anger at Tether and their inability to shut it down so far.Besides, Biden should really worry about United States National Debt that just set a new ATH of a ridiculously high value of $31 trillion. It grow over $1.5 trillion over the past 30 days! ....and yet they keep printing more dollars...https://www.usdebtclock.org/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 07, 2022, 02:09:09 PM",
      "body": "Quote from: LFC_Bitcoin on October 04, 2022, 04:27:44 AMI really do wish we (bitcoin) could decouple from legacy markets & government decisions for once & all. Feels annoying that it still matters (price direction) what a bunch of old people in suits say.It will come but would really like it if there was no price reaction to anything that governments do/say about bitcoin.I guess we are a long way from that.I'm afraid we shouldn't expect a decoupling any time soon. As long as the masses look at bitcoin as a risk asset(despite its characteristics), it will perform similarly to risky tech stocks. It's just the fact that there is no data of bitcoin's past performance in such an economic situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ararbermas",
      "created_time": "October 07, 2022, 03:37:04 PM",
      "body": "Quote from: GreatArkansas on October 04, 2022, 03:11:17 AMQuoteThe report comes during a time when Congress is exploring the stablecoin industry and other tax rules for crypto brokers. Biden administration is also concerned about a repeat of the Terra-LUNA incident. However, the Congress members state that proper legislation is still months away.QuoteFSOC also suggests that the rules by Congress should cover abusive trading practices, customer asset segregation, cyber security, etc.This seems very interesting and exciting. Is this news good for the cryptocurrency market? We all know the United States is a big player in all markets especially cryptocurrency, with the USD being active and getting stronger against other currencies, now they mentioned crypto regulation.So, what are your takes here? Is this bad news or good news for the cryptocurrency community?Read more here: https://watcher.guru/news/biden-administration-asks-congress-for-clearer-crypto-regulation well there still a doubts about what happened on tera luna that always have potential to happen in other crypto as well. Perhaps if they will focus on the benefits that what the community or users can get in crypto currency it's either investments or trading then it's a good news and surely they will decide to regulate it and of course it can make a huge impact in the market.. But if they keep bringing the bad side of crypto perhaps instead of regulation they will decline it afterwards because of other mindset and views on cryptocurrency. Just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}