{
  "id": "topic_5453258",
  "title": "Framelover",
  "author": "Framelover",
  "created_time": "May 19, 2023, 12:29:56 AM",
  "content": "My pipu, I go try summarize dis mata as na heavy heart I carry take de give una dis tori as d wound still fresh for my heart. Yesterday Thursday, follow record one of d worst days of my life wey I no fit eva forget per say I experience watyn no good. I enter Ilorin yesterday for d very first time sake of my childhood friend nd class mate wey wan marry today wey be Friday (traditional wedding) nd tomorrow Saturday (English wedding). I travel go Ilorin by bus nd na so d motor wey I carry stop for one park wey dem de call “Maraba motor park”. As I alight begin try find my bearing to hotel wey dem describe for me na im some men wey were EFCC jacket hold me begin harass me. All these things happen lyk flash for my eyes within split seconds. I be like, “okay, I’m cooperating sir, there’s no need to drag” na der I take receive my first resounding slap wey almost make me unconscious before I notice say dem don put me nd some other boys inside van. When I realize myself dem say make I open my phone, I corporate open my phone. Dem ransack my phone reach how many minutes dem no see anything… next thing wey I hear be say “why do you have binance and trustwallet on your phone?” D mata wow me wey make me ask watyn de wrong with having Binance nd Trust wallet on my phone as a youth, “I use it to trade nd also get paid for jobs I do online” dat question alone fetch me anoda resounding slap wey just shut me up. Dem say I de play smart, say I de among d smart ones wey de always clear all traces from phone but dis time around dem de ready for all of us. Say e no get any young boy for we country wey no de do fraud.To cut d long story short, I was made to pay #200,000 for having “Binance and Trustwallet” on my phone. If not dem don almost give me criminal board to hold make dem snap me publish and post for internet.My friend wey I come him wedding de para say make we carry d mata go court, but me I de reason am… e de worth am? If I spend money on top lawyer plus d whole court stress and all, I go fit get justice for dis mathias?Abeg make Una help me with suggestions… make I swallow my pain abi make I carry d case further?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453258",
  "comments": [
    {
      "author": "Zanab247",
      "created_time": "May 19, 2023, 02:48:07 PM",
      "body": "Bro, is like monkey hand wan reassemble human hand in dis ur matter because EFCC don't work without someone supply dem clear information about the person. E be like say some of ur friends hand dey dis matter, if u can flash back some of ur friends u chatted before going to dat wedding or maybe u shared you crypto trading stuff with dem by showing dem ur binance and other things that related to ur wallet. If truly wat u are saying is true and you transfer the #200k into the account of the EFCC at the moment, I think u can get ur money back if u can get a good lawyer to stand for u because what they did to u is against the law of our land.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Framelover",
      "created_time": "May 20, 2023, 05:08:22 AM",
      "body": "Quote from: Zanab247 on May 19, 2023, 02:48:07 PMBro, is like monkey hand wan reassemble human hand in dis ur matter because EFCC don't work without someone supply dem clear information about the person. E be like say some of ur friends hand dey dis matter, if u can flash back some of ur friends u chatted before going to dat wedding or maybe u shared you crypto trading stuff with dem by showing dem ur binance and other things that related to ur wallet. If truly wat u are saying is true and you transfer the #200k into the account of the EFCC at the moment, I think u can get ur money back if u can get a good lawyer to stand for u because what they did to u is against the law of our land.I give u much thanks. I go look into am nd also seek legal advice. No be say I get monie to throway but as e be now I no care abt d monie. If I go fit get justice, I no mind how much I go spend for lawyer. All I want be say make e de fruitful in d end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "May 20, 2023, 08:15:06 AM",
      "body": "Guy, as I dey read ur story lyk dis I dey para lyk mad, Police mata don go down small, na EFCC mata come plenty lyk ds. If u go club, dey hotel, dey house, dey chill, go school, dey walk, dem go still burst u, e tire me sha. But if na my broda dem do lyk dat, I no go take am oo. No be court I go go, na media and connection mata. U go fit identify them if dem be real EFCC and dem go collect ur moni back and still pay jara on top b4 I gree.I no know watin Naija dey turn to, u no get rest of mind 4 anywhere. Work no dey country, and u wey u dey hustle online dem no go let u rest. Na thunder go fire all of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "May 20, 2023, 03:17:34 PM",
      "body": "Omo dis one na confam embarrassment. Nah due to the lawlessness of the land nai make dis kind tin dey happen if not wetin you do to warrant such treatment? Like dis dis so called law enforcement agencies no com no dia duty again o.  Bros, e go good to carry dis mata go court. Infact, Dem show you valid ID say nah there them come from? Because even thieves don dey devise means to take tif for daylight o.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "May 24, 2023, 10:07:01 AM",
      "body": "At times I d wonder wetin our country d turn out to be between the youths and the military personnel. Anything wey d do or have as a youths don become wahala for police people head. Upon all the warning wey police commissioner don give out to all police personnel never to harass the youths or even search their phone they still the go ahead the do otherwise, still doing what the warned them about. It's so annoying, making me to regard our country as a lawless where there is no rule governing it. Quote from: Zanab247 on May 19, 2023, 02:48:07 PMBro, is like monkey hand wan reassemble human hand in dis ur matter because EFCC don't work without someone supply dem clear information about the person. E be like say some of ur friends hand dey dis matter, if u can flash back some of ur friends u chatted before going to dat wedding or maybe u shared you crypto trading stuff with dem by showing dem ur binance and other things that related to ur wallet. If truly wat u are saying is true and you transfer the #200k into the account of the EFCC at the moment, I think u can get ur money back if u can get a good lawyer to stand for u because what they did to u is against the law of our land.I don't think sae that's what happened in the case because EFCC wey you know before, no be the same EFCC wey d now. EFCC don turn another thing of late. They now go around to arrest and harass youths anyhow with the hope sae they must get something(money) out of them. If you come for my state, you go see how them they patrol during evening hours the enter inside clubs and hotels to arrest people anyhow.As the matter be so, wetin OP go do, na to tag EFCC for Twitter and all other media agencies wey em know as em share his story of the encounter wey em get with the EFCC people for Ilorin.OP sharing his experience with EFCC people for Twitter go go along way as the whole Nigerians and the whole world go hear about am",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 24, 2023, 04:14:12 PM",
      "body": "This matter no make sense nah, and as I dey read eh dey vex me for body for this kind public embarrassment wey they just sama you like this and yet billed you #200k join just to get freedom. Because if I could remember, na this kind act & oppression on the innocent youth make people advocate for \"ENDsals - ENDsals - ENDsals\"...  Because abi they want make we start another one wey be \"ENDefcc - ENDefcc - ENDefcc\", because I know say this kind thing no go fit tire our youths oh, most especially the innocent victims who slept in jail for committing no crime. So as eh don be like this, the only advise I go fit give be say whenever you want travel from one state to another, make una try to dey delete this two apps from una phone,  as eh go cost you nothing, in as much as you still get the phone number or email to your Binance account and Seed phrase to your \"Trust wallet\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "May 24, 2023, 04:42:00 PM",
      "body": "Normally this case is meant to end in court but I must tell you one thing, is better you let the case just go like that even police and any other body's today knows that no youth among that doesn't know anything about internet. That was why even us wey be woman self dey know how we dress and present ourselves even as married what saves us most times is our wedding ring and code of dressing otherwise I do meet lot of those people harassing young ladies accusing them whatever they feels like. Lastly if you carry this matter go court e go chop you money wey you supposed carry manage with your family or love ones and na them dey everywhere and the case no go too go well for your side, even if you decide to delete those app na another implications and worsting the case as well so e go better just forget everything and go your way.Lastly as person from one community, I go advise you t mind how you dressed if not them for no even see you come pick you say you be gee boy but na wetin most our young boys and girls no understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "May 24, 2023, 06:06:50 PM",
      "body": "Quote from: Zanab247 on May 19, 2023, 02:48:07 PMBro, is like monkey hand wan reassemble human hand in dis ur matter because EFCC don't work without someone supply dem clear information about the person. No reason am ooo na for ilorin dem born me and na where I grow, if I tell u say dey get one certain time wey EFCC dey block road, dey go dey stop cars dey search, so this one wey him talk na play self, but me I never get any problem with EFCC before and with sars I dey often get problem with that year. But I fit testify say Wetin d guy talk na true and the Maraba motor park no even far from my area self.Quote from: Zanab247 on May 19, 2023, 02:48:07 PME be like say some of ur friends hand dey dis matter, if u can flash back some of ur friends u chatted before going to dat wedding or maybe u shared you crypto trading stuff with dem by showing dem ur binance and other things that related to ur wallet. If truly wat u are saying is true and you transfer the #200k into the account of the EFCC at the moment, I think u can get ur money back if u can get a good lawyer to stand for u because what they did to u is against the law of our land.No suspect any of your friend or anything, no cause problem between u and your friend, make I tell u d fact na so EFCC dey do for my side, and now I don’t really know what happened, dey don plenty for outside now. The only mistake wey the Op do, him no suppose pay them that money, him for just follow them go office, if dey know say d Op get confidence say him wan follow them go office, they go free am, because their Oga for office no dey take rubbish from them, d money wey him pay na those boys go share am between themselves, but if you no get any illegal thing for your phone tell them u go follow them go office. Dey get some police too wey dey do like sars, like say na people wey dey sars dem be, dey just change their names, dem dey very terrible also, dem dey behave like thugs, if those once stop u, e go better make u just settle them because if u wan follow dem go station, dem fit carry go bush kill u for there, dey go even tell u no be say dem go hide am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "May 24, 2023, 06:37:13 PM",
      "body": "Quote from: CryptoHeadlineNews on May 24, 2023, 04:14:12 PMThis matter no make sense nah, and as I dey read eh dey vex me for body for this kind public embarrassment wey they just sama you like this and yet billed you #200k join just to get freedom. Because if I could remember, na this kind act & oppression on the innocent youth make people advocate for \"ENDsals - ENDsals - ENDsals\"...  Because abi they want make we start another one wey be \"ENDefcc - ENDefcc - ENDefcc\", because I know say this kind thing no go fit tire our youths oh, most especially the innocent victims who slept in jail for committing no crime. Them been do EndEfcc protest for warri last year after Efcc break enter people houses for night, carry people belongings and anybody them see go their office for Port Harcourt, the videos of the break-ins trend for some days but you know Nigeria na after small time everybody forget. Efcc sef post the Warri protest for their Instagram page say “yahoo boys in warri want to get rid of efcc”, we really need change for naija. Sars go dey harass young people for street, everybody go dey waka pass like say na no man’s business, nobody dey confront them, I believe say the only way this madness go stop na when everybody decide to put hand together fight for our right",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}