{
  "id": "topic_5399057",
  "title": "nullama",
  "author": "nullama",
  "created_time": "May 17, 2022, 03:42:35 PM",
  "content": "Real de a ocho: the world’s first currencyThis article tells the fascinating story of how the world began trading a single currency for the first time. This currency, Real de a ocho (piece of eight), was created by the Spanish Empire, but it was used all around Europe, America, and Asia for hundreds of years.It was widely used for trading around the world and to reference other currencies since the mid-16th century until around the 19th century.QuoteIn the Thirteen Colonies, Spanish currency circulated normally and was known first as “Spanish thaler”, later becoming “Spanish daller”, and later “Spanish dollar”. The reales de a ocho were known as “taleros” because of their resemblance to the sturdy Austrian currency “thaler”.Here's the origin of the symbol $, they represent the Pillars of Hercules, with a ribbon in a S shape around it. This symbol is used in the coat of arms of Spain:QuoteSilver colonnade, the inspiration for the creation of the dollar symbol, $. This design belongs to the reign of Fernando VI, minted at the mint of Mexico.The Bitcoin symbol BTC, which was inspired from $ and other descendents of the Real de ocho, can then be traced back to the world's first currency.QuoteMany currencies, such as those of the countries that became independent in America, the Canadian dollar, the Chinese yuan, the Japanese yen, the Philippine peso, and others around the world, were initially based on the real de a ocho. This global acceptance was the origin of the symbol “$” that was used in account books all over the world, imitating in a simplified way the columns and bands that appeared in the original real de a ocho coin.In the beginning of the USD, dollar bills were redeemable for Spanish Dollars. Here's one from 1779:Everything looked great for the world's first currency. But inflation started to become a problem:Quote    Such massive infusions of silver diminished the purchasing power of the metal. Silver, like any item, lost its high value when supply exceeded usual demand. This in turn affected the prices of almost everything in the Empire, because the price structure was tied to the value of silver.    The metal had become more abundant and its purchasing power diminished. This inflationary trend affected the value of all raw materials, since everything had been valued in silver and silver had lost its value. If the silver lost value, more money was needed to buy the items that had kept it.Sir Isaac Newton, who was the Master of the Mint in the United Kingdom at the time, initiated what would later become the Gold Standard. As hard money started to win against weaker currencies, the British Pound started to become the world's second currency, dominating the world trade from the late 19th century until early 20th century.After the first world war, the USD started to become more popular, and with the Bretton Woods Agreement of 1944, the US Dollar became the world's third currency. Following the same principles of the previous world currency, it was backed by gold. But only after a few decades, in 1971, Richard Nixon suspended the ability to redeem USD for gold.Inflation started to cause problems again:In 2008 the subprime mortgage crisis created a Global Financial Crisis, which eventually led to the creation of Bitcoin in 2009.The current fiat financial system continued to decline while Bitcoin slowly gained more acceptance around the world, growing based on its deflationary design.The covid-19 pandemic marked a new era in the world, where Bitcoin reached a new ATH and a more widespread acceptance.In September 2021, El Salvador adopts Bitcoin as legal tender, making it the first country in the world to do so.In 2022, the war in Europe continues to devalue currencies all around the world.Even though many people are against Bitcoin as can be seen in the previous graph, the deflationary mechanism of Bitcoin brings the principles of the gold standard into the modern age. Now with more than 90% of the Bitcoins already mined, Bitcoin is slowly taking over the world to become it's fourth currency at some point in the near future. An unstoppable future with a Bitcoin Standard.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399057",
  "comments": [
    {
      "author": "Moneyprism",
      "created_time": "May 18, 2022, 08:10:32 AM",
      "body": "true, no matter how hard the government wants to regulate the adoption of bitcoin it will not be able to stop people from using bitcoin as their alternative currency... in the future it is estimated that there will be more and more people using bitcoin for their daily transactions and this will make bitcoin a currency which is no less popular with fiat currency",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}