{
  "id": "topic_5452859",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "May 15, 2023, 10:31:38 PM",
  "content": "So guys, I received this mail today from an unknown person or company claiming I ordered for bitcoin from their platform(never did),And the mail contained a pdf file which they claim contain the details of the transaction, it's my first time of receiving such a mail, and my instinct already told me it's a scam attempt, but I still went ahead to download and open the pdf file since I was on mobile, opened the pdf file and below is it's content..Like I said above, I know this is a spam mail and possibly a scam attempt, but what I don't get is that, the scammer didn't mention a website or wallet app (aside PayPal and coinbase) where I could try to claim the bitcoin they claim i supposedly bought from them, as I believe this has always been their normal process, but rather, they provided a phone number which they claim is toll free, is this actually a plot for me to call them?How possibly or what exactly are they possibly goin to say to me to make me send them my bitcoin?, please share if you have an idea.. And also tell us if also received such a mail before, what action did you take?.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452859",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "May 15, 2023, 10:39:17 PM",
      "body": "Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMSnipScammers are so dumped to the extent they believe everyone is dump like them,  if not in this age and time such scam formulas doesn't work anymore and gone are those days when people believe in miracle money, which is money flying to someone's account without any action or input from the individual. Why such scams thrived much in the past is because of the place of airdrop most newbies were too greedy and looking for free bitcoin and any such possibility is an opportunity for them and if they contact the scammer, they will be asked to pay a fee which will become the potential scam target. Best to delete and avoid such emails and never click any attached links.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "May 15, 2023, 10:55:54 PM",
      "body": "I haven't received an email like that but I will have an idea once I receive one since you posted this, maybe it's a wrong send if someone can confirm that they also receive emails like that then it's intended to scam people since you have nothing to do with the platform or have not bought or purchased anything there, I'll just ignore them but will not respond if your response they will get the idea that you have an active email and you've read their email and will likely send you more emails from their different scheme.Whenever I receive from an unknown source I just hit spam I don't delete it so it notifies Gmail that this kind of email is spam in nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 15, 2023, 11:59:42 PM",
      "body": "Or they could have been trying to spread malware to your deviceYes, PDFs can be used to spread Trojans or all other kinds of malware if sent by a malicious person. This was a popular way of sending malware to newbies on telegram around 2017/2018eBook Worms: How to Spot and Avoid PDF MalwareYour android device might not be safe if you opened random PDFs from strangers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 16, 2023, 12:42:02 AM",
      "body": "^ Ohno I'm not sure how those hacks start but there were discussions I've read before that hackers could attach an executable file on a file that when opened, its going to connect to the hacker's server. It's best to just not open the emails and files attached to them when you know you are not expecting any emails from a company. I think everybody have received emails where BTC is to be claimed by us. The best solution is just to ignore it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zwei",
      "created_time": "May 16, 2023, 01:57:32 AM",
      "body": "OP, the mistake you made was opening that PDF file, you got lucky this time as it looks like there was no malware.I think this email is from a very stupid scammer, he can't even do this scam method the right way, and that is good This entire show is to make you call that number, they will pretend to be PayPal \"support\" and claim that your account was hacked, the scammer will try to connect to your device using AnyDesk to \"help you\" or for \"verification\", then they will \"refund\" the transaction to you but they made a oopsie by sending you extra money and ask you to send back the difference with gift cards or crypto, It's a typical refund scam with PayPal flover.You can watch this video to see how this scam is done: https://www.youtube.com/watch?v=5NwyEB0zZqs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Avirunes",
      "created_time": "May 16, 2023, 09:33:39 AM",
      "body": "Quote from: Zwei on May 16, 2023, 01:57:32 AMOP, the mistake you made was opening that PDF file, you got lucky this time as it looks like there was no malware.Who knows maybe that actually ran a process on background and downloaded a malware. You can't be sure of things unless you start to see changes or something unusual with your device. Sometimes you can't notice them at all. Maybe its a scam where you have to call the number but what if they take it up a notch and make the pdf contain a malware also, in case if the phone call attempt fails. Maybe running an antimalware is a measure but I don't think its gonna fully work. Best thing is to reset the device where you have run it after making a backup. Another thing, turn off the remote desktop on your device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "May 16, 2023, 09:42:10 AM",
      "body": "This bill I also received last year [1], and I think mine is more surprising because the sender is paypal itself (this is why I bothered to open it, maybe not if it's from a random address).Luckily so far nothing has happened.(error image?[2])1. https://bitcointalk.org/index.php?topic=5425221.02. https://i.imgur.com/xBevTjz.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "May 16, 2023, 12:26:04 PM",
      "body": "Scammers will use many methods to try to deceive people and they often do not list a website but only use an email address or even a telephone number.I assume they want you to call them and convince you to send them your bitcoins. Next time, if you see a .pdf file embedded in the email, you better not open it because we don't know if it's safe.I've never received an email like that (or I forgot) because every time I receive an email I don't recognize, I delete it immediately and don't open it at all. And I suggest you also do the same. We have no idea how those scammers will try to trick us so we better be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "May 16, 2023, 01:18:50 PM",
      "body": "Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMAnd the mail contained a pdf file which they claim contain the details of the transaction, it's my first time of receiving such a mail, and my instinct already told me it's a scam attempt, but I still went ahead to download and open the pdf file since I was on mobile, opened the pdf file and below is it's content..Just be careful about opening any attachment, especially if it's from someone you don't know or weren't expecting anything from. No matter how tempting or intriguing that attachment may seem, it's better to play it safe and avoid clicking on it. You never know what they might be hiding in those files and cybercriminals are known to use email attachments as a sneaky way to distribute malware or launch phishing attacks. So it's better to be cautious, even if you have top-notch antivirus software.Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMHow possibly or what exactly are they possibly goin to say to me to make me send them my bitcoin?, please share if you have an idea.. And also tell us if also received such a mail before, what action did you take?. It's possible that the whole purpose of sending that email was to get you to open the attachment. You never know, right? Scammers are crafty like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "May 16, 2023, 01:58:07 PM",
      "body": "There's a lot of expert advice and warning that people should not open attachments from unknown sources, these scammers and hackers will send you compelling emails so you'll be tempted to open the file.Control yourself and just believe scammers sent you to hack your system, even the best AV cannot control what will go to your system if you open the file.Since you have no idea what they are sending it's better to ignore and not respond they will bait you again if you respond.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "May 16, 2023, 02:22:05 PM",
      "body": "Quote from: Wiwo on May 15, 2023, 10:39:17 PMQuote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMSnip gone are those days when people believe in miracle money, which is money flying to someone's account without any action or input from the individual. Why such scams thrived much in the past is because of the place of airdrop most newbies were too greedy and looking for free bitcoin and any such possibility is an opportunity for them and if they contact the scammer, they will be asked to pay a fee which will become the potential scam target. Best to delete and avoid such emails and never click any attached links. You are very correct mate, if we were still in the days when airdrops thrived, like in 2016/2017/2018, this strategy would have been an easy way to get airdrop participants and some would eventually fall for the trick..We are indeed no longer in the days when miracle money was believed in(as you put it), at least, back in 2017, I had an experience of what miracle money really is and feels like when I received storm tokens worth over $800 into my wallet, I remember they did an airdrop back those days but I didn't remember applying for the airdrop, how it happened I benefits from the airdrop, I don't know, but I jejely sold it and put the money in bitcoin, and I made a lot of profit from it that same year during bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "May 16, 2023, 03:30:16 PM",
      "body": "Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMSo guys, I received this mail today from an unknown person or company claiming I ordered for bitcoin from their platform(never did),Any of us here, 1-10 people have received emails, from sources that are not clear about Bitcoin, whether it's orders, extortion and so on, but all of that is purely from online fraud.I personally have experienced what you experienced, for that you need to do How to Beat Bitcoin Blackmail Emails & Protect Yourself and How to Protect Yourself From Bitcoin Extortion Emails.It's important that you do:Quote• First: Don't respond to threatening emails:• Update your passwords often:• Turn on two-factor authentication (2FA):• Cover your webcam:• Secure your private files:For complete clarity you can see the source above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 16, 2023, 04:38:33 PM",
      "body": "Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMAnd the mail contained a pdf file which they claim contain the details of the transaction, it's my first time of receiving such a mail, and my instinct already told me it's a scam attempt, but I still went ahead to download and open the pdf file since I was on mobile, opened the pdf file and below is it's content..In the past, when I was still friends with a guy who was learning software programming and ethical hacking, he told me something one day. He said he can send an attack via email, text message, and various other means; the attack could be a picture, a link, or just a PDF, and if the person that is being attacked clicks on the link, he will gain access to some information on his device. So what I am thinking now is that, as you never can tell, that PDF may have been an attack from some scammers; the email might look stupid, but the mistake people make often is clicking on any link, image, PDF, or other external file that is attached to the spam email.To be safe, never even respond to any email you are not expecting to receive. Just my advice, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 20, 2023, 11:28:14 PM",
      "body": "Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMLike I said above, I know this is a spam mail and possibly a scam attempt, but what I don't get is that, the scammer didn't mention a website or wallet app (aside PayPal and coinbase) where I could try to claim the bitcoin they claim i supposedly bought from them, as I believe this has always been their normal process, but rather, they provided a phone number which they claim is toll free, is this actually a plot for me to call them?How possibly or what exactly are they possibly goin to say to me to make me send them my bitcoin?, please share if you have an idea.. And also tell us if also received such a mail before, what action did you take?. Yes, this is a classic scam being perpetuated in the other parts of the globe.a. the email will have the phone numbers that you have to contactb. if you call them and you said that they you didn't initiate the transaction and they will said that they will refund you the money.c. and then the next step is that they will ask you to download a software than can access your PCd. then obviously they can take over your system, if let's say they want you to login to your coinbase account because that's where they are  going to refund you, thru bitcoin.Other methods, saying that your Paypal has been limited so you will have to follow the instructions on the email.a. the email that you will received with Paypal has a link, so if you click on it and you are not careful you will be redirected to a fake Paypal websiteb. once you enter your login details, including your password then your account is compromise already.Next one, same as the steps above, the only difference is:a. let's say you wanted to refund $100.00 only, and after giving them access, they will edit something using Developers tools to looks like they have made a mistake of refunding you, and they made a supposedly deposit $1000.00b. So they will ask you to give them back the $900.00.c. Ask you to go to a store and buy Amazon Gift cards, it could be in bunch of $100.00 or $500.00.d. Then obviously, ask you for the redeem numbers so that they can redeem it for themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "May 20, 2023, 11:54:05 PM",
      "body": "Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMSo guys, I received this mail today from an unknown person or company claiming I ordered for bitcoin from their platform(never did),Better don't download any attachments in future.Did you use that email address to apply to anything connected with crypto and Bitcoin, maybe some giveaway, newsletter or airdrop?It is possible they are using this information or addresses from other leaks and they later send mass emails like this.I received many similar emails, but they go directly into my spam folder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "May 21, 2023, 12:09:21 AM",
      "body": "Quote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMAnd the mail contained a pdf file which they claim contain the details of the transaction, it's my first time of receiving such a mail, and my instinct already told me it's a scam attempt, but I still went ahead to download and open the pdf file since I was on mobile, opened the pdf file and below is it's content..also tell us if also received such a mail before, what action did you take?. Your instinct was right. PDF files can contain malicious codes and become a Trojan, and by downloading and running these PDF files on your devices, the malicious code they injected into them will run, and they will be able to hack your devices easily. And if we assume that these PDF files are not injected with malicious code, they can contain links to scam phishing sites by clicking on them or placing your credit card or any critical data; then they will undoubtedly steal you. As for me, I receive many of these phishing messages constantly. It contains PDF files and many temptations, but I ignore them as if I have never seen them. Also, not only PDF files in the mail are dangerous, but any free PDF files available for download on the Internet can contain a Trojan, so what I see is a safe solution for me I open these files are on cloud reading platforms such as Google Drive, and I do not open them on my main devices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "May 21, 2023, 05:33:22 PM",
      "body": "Quote from: notblox1 on May 20, 2023, 11:54:05 PMQuote from: Fivestar4everMVP on May 15, 2023, 10:31:38 PMSo guys, I received this mail today from an unknown person or company claiming I ordered for bitcoin from their platform(never did),Better don't download any attachments in future.Did you use that email address to apply to anything connected with crypto and Bitcoin, maybe some giveaway, newsletter or airdrop?It is possible they are using this information or addresses from other leaks and they later send mass emails like this.I received many similar emails, but they go directly into my spam folder.i happen to receive many of these mails in my email and they are instantly in my spam after that i just read the headers after that i instantly delete all spam emails.maybe you can check your email on this website https://haveibeenpwned.com/ because on this website you can see which website is in a data breach",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "May 21, 2023, 06:15:10 PM",
      "body": "I've received an abundance of similar emails over the past few months claiming that I've bought something or paid for some kind of service, with an attached invoice, not related to cryptocurrencies. I haven't bothered to investigate any further, but so far, I don't see how they end up scamming you, perhaps by trying to persuade you to pay the invoice. Scammers are constantly trying to find new ways to scam people, and their innovation surprises me.Report them and move on, not much you can do to stop them, u less you change your email address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "May 22, 2023, 12:45:54 AM",
      "body": "Quote from: entebah on May 21, 2023, 05:33:22 PMi happen to receive many of these mails in my email and they are instantly in my spam after that i just read the headers after that i instantly delete all spam emails.maybe you can check your email on this website https://haveibeenpwned.com/ because on this website you can see which website is in a data breachI know about this website and it is good for general public but I think they are only publishing big leaks that are released in public, so it cant detect any small personal leaks when you register on some fake airdrops or other smaller crypto websites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}