{
  "id": "topic_5445366",
  "title": "GreatArkansas",
  "author": "GreatArkansas",
  "created_time": "March 18, 2023, 09:24:48 AM",
  "content": "The new trend now is the Arbitrum airdrop, for those people who are not yet aware: Arbitrum to Airdrop New Token and Transition to DAO.Moving on, what do you think about the starting price of the Arbitrum token when the claiming of airdropped tokens will start around 5 days from now?I already lot of speculations that are comparing it with other layer 2 tokens that did airdrop also before like Optimism.Some people tell it will be $1-$2, and some are starting will be $2.5 and some also telling 2 digits numbers that start at $10.Some exchanges now already have \"IOU\" Arbitrum tokens whose current price now is already around $10.(Take note that this is not yet the real Arbitrum token, this is just an IOU token across the exchanges right now.)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445366",
  "comments": [
    {
      "author": "taufik123",
      "created_time": "March 18, 2023, 09:56:31 AM",
      "body": "Arbitrum is indeed a trending topic and always appears on all my social media homepages. Many people get airdrops from interactions made on Arbitrum. However, I was not lucky this time, because the transactions I made did not meet the requirements. As predicted by many people, the price of Arbitrum is predicted to touch the price of $1-$2.5 and that is a fairly high price if you look at the 10B ARB Supply. See the price prediction and comparison made by DropTabBut the Exchange that is now listed as the OP explained, is the Arbitrum IOU Token and only exists in Internal Exchange such as Hotbit and XT (cannot be transferred to other exchanges). This token only follows the Arbitrum hype and is not an Official token. But those who don't know will be fooled and buy it at $10. The distribution date is March 23, 2013, and it will be a busy day for the Arbitrum Blockchain.All major exchanges are getting ready to list the ARB Token. For your information, the allocation of Arbitrum Token (ARB) is divided into 5 parts. The distribution of Arbitrum (ARB) is as follows:   - 17.53% is allocated to Investors   - 1.13%   is allocated to DAOs in Arbitrum Ecosystem   - 11.62% is allocated to Individual Wallets   - 42.78% is allocated to DAO Treasury   - 26.94% is allocated to Team and Future Team + AdvisorsNote: According to Arbitrum website, 12.75% of the $ARB token supply will be airdropped on 23 March 2023, with 11.62% allocated to users and 1.13% to DAOs. The initial supply of $ARB token is 10 billion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "March 18, 2023, 10:22:14 AMLast edit: March 19, 2023, 04:59:22 PM by naira",
      "body": "Quote from: GreatArkansas on March 18, 2023, 09:24:48 AMThe new trend now is the Arbitrum airdrop, for those people who are not yet aware: Arbitrum to Airdrop New Token and Transition to DAO.Moving on, what do you think about the starting price of the Arbitrum token when the claiming of airdropped tokens will start around 5 days from now?I already lot of speculations that are comparing it with other layer 2 tokens that did airdrop also before like Optimism.Some people tell it will be $1-$2, and some are starting will be $2.5 and some also telling 2 digits numbers that start at $10.Yesterday I just got allocated from Airdrop about 1K $ARB tokens, but regarding price speculation it is obviously quite difficult, some analysis comparing Layer2 token prices which we have seen a lot shows that $1 is the ideal price following the Optimism launch scheme. In addition, with a large enough community and support from Arbitrum investors so far I hope to be able to provide something different.On the Youtube channel, they do a Podcast where the 23rd is a special date if we look at official Twitter they make a video clip which is of course very surprising. Because from the start the plan to launch the token did not come to mind. After much discussion with Nansen, they finally agreed to drop their first Airdrop which we will claim on March 23rd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "March 18, 2023, 12:58:53 PM",
      "body": "Quote from: GreatArkansas on March 18, 2023, 09:24:48 AMThe new trend now is the Arbitrum airdrop, for those people who are not yet aware: Arbitrum to Airdrop New Token and Transition to DAO.Moving on, what do you think about the starting price of the Arbitrum token when the claiming of airdropped tokens will start around 5 days from now?I already lot of speculations that are comparing it with other layer 2 tokens that did airdrop also before like Optimism.Some people tell it will be $1-$2, and some are starting will be $2.5 and some also telling 2 digits numbers that start at $10.Some exchanges now already have \"IOU\" Arbitrum tokens whose current price now is already around $10.(Take note that this is not yet the real Arbitrum token, this is just an IOU token across the exchanges right now.)Seriously?  10 bucks per ARB?  So if I have 5000 of these babies I get an airdrop worth 50k USD?  That might just save me from all my trading and sports betting losses for the past 24 months and be in the green.  Lmao.  Did anyone in these parts ever use Arbitrum to get in the airdrop.  I visit the alt discussion section from time to time but it seems like we're mostly behind on the info.  Like most of the discussions there are total sht now.  There aren't even funny guys who FUD no more.Edit:  Btw...  Thread belongs to the altcoin speculation section.  But I guess you started it here with a purpose..?  C'mon, how many $ARB are you getting?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "capedbaldy",
      "created_time": "March 18, 2023, 07:40:00 PM",
      "body": "Quote from: naira on March 18, 2023, 10:22:14 AMYesterday I just got allocated from Airdrop about 10K $ARB tokens, but regarding price speculation it is obviously quite difficult, some analysis comparing Layer2 token prices which we have seen a lot shows that $1 is the ideal price following the Optimism launch scheme. In addition, with a large enough community and support from Arbitrum investors so far I hope to be able to provide something different.Wow, you get maximum tokens from one wallet that is eligible to receive the airdrop, but imagine if the price is $ 1 then you will get $ 10k just by participating in the airdrop, but the price can be higher if binance announces that it will list ARB on the day of the airdrop distribution. Now several markets have confirmed the ARB listing and even hotbit is trading the ARB for $10, hopefully the $10 price will last until the airdrop distribution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "southerngentuk",
      "created_time": "March 19, 2023, 01:32:38 AM",
      "body": "When I look at some of the developments surrounding this big event coming from Arbitrum, I see its attraction. And given the price speculations, it is understandable that it will be in the top 10 cryptos. So setting an exact price target for me is not so necessary as this is a leading project in the L2 space so I think there will be a lot of hype associated with it, good timing anyway. holding multiple ARBs would be an option that I prefer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "March 19, 2023, 07:16:40 AM",
      "body": "Hello guys, look at the beautiful chart of airdrop distribution from Nansen, since Nansen helped Arbitrum about distributing the airdropped tokens of Arbitrum from the given snapshot date which is February 6, 2023.As Nansen said: \"The median airdrop size is 1,250 ARB. Over 4,400 addresses are able to claim 10,250 ARB\"The higher addresses are the 1000 - 2000 airdrop size will get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StormHawk",
      "created_time": "March 19, 2023, 12:21:24 PM",
      "body": "I was about to create a topic about the benefits that exchanges are getting out of IOU tokens? I am sure that the project teams are not responsible for this listing, they did this on their own for some unknown reason, since I have knew about IOU listings, I have never seen a reasonable price before, the price is always higher than the real token, yet some people will buy IOU tokens first, crazy.I am guessing they are making some big amount of money from listing IOU tokens?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "March 19, 2023, 02:15:16 PM",
      "body": "Quote from: GreatArkansas on March 19, 2023, 07:16:40 AMHello guys, look at the beautiful chart of airdrop distribution from Nansen, since Nansen helped Arbitrum about distributing the airdropped tokens of Arbitrum from the given snapshot date which is February 6, 2023.As Nansen said: \"The median airdrop size is 1,250 ARB. Over 4,400 addresses are able to claim 10,250 ARB\"The higher addresses are the 1000 - 2000 airdrop size will get.Cool.  I have a feeling that most of those wallets with less than 2000 or so tokens would be selling them and take profit as there's a huge possibilty that most of them are not really regular Arbitrum users.  Was it last year when Arbitrum had some sort of gimmick about having different mile stones for users to achieve to prep for the airdrop?  But then Arbitrum's devs decided to drop it because it was being gamed by cheaters?Anyway as for 10 USD per ARB, that's like around 10 billion market cap.  Does anybody really think it would be that right off the bat?  Kinda sketchy imho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "March 19, 2023, 03:05:45 PM",
      "body": "Quote from: tokeweed on March 19, 2023, 02:15:16 PMQuote from: GreatArkansas on March 19, 2023, 07:16:40 AM(....)(...)Anyway as for 10 USD per ARB, that's like around 10 billion market cap.  Does anybody really think it would be that right off the bat?  Kinda sketchy imho.Pure speculation, there is already a lot of comparisons happening between other layer 2 networks that did airdrop before like Optimism.Check this photo:This is mirroring the market cap of other chain networks, this is just speculation or prediction. The majority of people really predict the price could be around starting at $1 - $5. So, let's wait for it.I also love the airdrop distribution because there are only a few people who got big sizes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "March 19, 2023, 05:12:56 PM",
      "body": "Quote from: capedbaldy on March 18, 2023, 07:40:00 PMQuote from: naira on March 18, 2023, 10:22:14 AMYesterday I just got allocated from Airdrop about 1K $ARB tokens, but regarding price speculation it is obviously quite difficult, some analysis comparing Layer2 token prices which we have seen a lot shows that $1 is the ideal price following the Optimism launch scheme. In addition, with a large enough community and support from Arbitrum investors so far I hope to be able to provide something different.Wow, you get maximum tokens from one wallet that is eligible to receive the airdrop, but imagine if the price is $ 1 then you will get $ 10k just by participating in the airdrop, but the price can be higher if binance announces that it will list ARB on the day of the airdrop distribution. Now several markets have confirmed the ARB listing and even hotbit is trading the ARB for $10, hopefully the $10 price will last until the airdrop distributionLol, Sorry It seems I mistyped it should be 1K $ARB tokens instead of 10K. Until now, the hype continues to increase and everywhere, both on the Telegram channel, Twitter, and Facebook, there is a lot of talk about Arbitrum. I'm having a hard time digesting whether in the end this will really have a fantastic value or vice versa. So there is too much speculation that makes us even more impatient with the official price later. Btw the 23rd will be the date when many exchanges will trade $ARB such as Mexc, Kucoin, Bybit, Huobi, and several others exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 19, 2023, 07:17:16 PM",
      "body": "Are those wallets and balances that have got 89k in ARB tokens something real? I've seen people posting their stuff and eligibility for this token and even if the token just goes $1, that's already a massive win for those people that will receive thousands of this token.I guess those speculations about it starting with $1 is good enough and that's what you can get from the initial price of it once it's already in the market. Many will sure start to dump ARB once it's being launched and distributed all of the tokens for the eligible participants since many exchanges have already expressed their listing for this token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "March 19, 2023, 09:39:25 PM",
      "body": "Quote from: blockman on March 19, 2023, 07:17:16 PMAre those wallets and balances that have got 89k in ARB tokens something real? I've seen people posting their stuff and eligibility for this token and even if the token just goes $1, that's already a massive win for those people that will receive thousands of this token.I guess those speculations about it starting with $1 is good enough and that's what you can get from the initial price of it once it's already in the market. Many will sure start to dump ARB once it's being launched and distributed all of the tokens for the eligible participants since many exchanges have already expressed their listing for this token.Those are real since some hunters are using multiple wallet and yes, it is expected to dump right away as many will take their profits as much as possible, official listing price are not sure as well but if its a $1, that can still be a huge profit to many. I was not able to participate on their airdrop, maybe I can just wait for its price to normalize if I really see good opportunity here, there’s a good hype but I know it can be more risky if you will buy at the listing date.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayudndy",
      "created_time": "March 20, 2023, 02:37:08 AM",
      "body": "Quote from: blockman on March 19, 2023, 07:17:16 PMAre those wallets and balances that have got 89k in ARB tokens something real? I've seen people posting their stuff and eligibility for this token and even if the token just goes $1, that's already a massive win for those people that will receive thousands of this token.I guess those speculations about it starting with $1 is good enough and that's what you can get from the initial price of it once it's already in the market. Many will sure start to dump ARB once it's being launched and distributed all of the tokens for the eligible participants since many exchanges have already expressed their listing for this token.I see this too, but I know there are truths that are even scarier than that. Some MMO teams have exploited the ARB campaign before, some groups that I know of they released thousands of wallets that received the airdrop.And not only from arb but I see in the arbitrum ecosystem there are also a lot of projects with airdrops.Just a little calculation, I can see that they can earn millions of dollars after each airdrop event like this. Indeed, with the normal use of tasks, professional cheaters can absolutely earn huge amounts of money, indeed this is a way to earn a lot of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ice18",
      "created_time": "March 20, 2023, 04:25:10 AM",
      "body": "Quote from: crzy on March 19, 2023, 09:39:25 PMQuote from: blockman on March 19, 2023, 07:17:16 PMAre those wallets and balances that have got 89k in ARB tokens something real? I've seen people posting their stuff and eligibility for this token and even if the token just goes $1, that's already a massive win for those people that will receive thousands of this token.I guess those speculations about it starting with $1 is good enough and that's what you can get from the initial price of it once it's already in the market. Many will sure start to dump ARB once it's being launched and distributed all of the tokens for the eligible participants since many exchanges have already expressed their listing for this token.Those are real since some hunters are using multiple wallet and yes, it is expected to dump right away as many will take their profits as much as possible, official listing price are not sure as well but if its a $1, that can still be a huge profit to many. I was not able to participate on their airdrop, maybe I can just wait for its price to normalize if I really see good opportunity here, there’s a good hype but I know it can be more risky if you will buy at the listing date. This happened before from Aptos most recipients dump their coin at 5-7 usd not knowing the potential and after some weeks price pump even higher, this can also happen in ARB airdrop so better wait for bull market, I can predict from 2-3 usd for some weeks and 5-10 usd after some months so better buy the dip if below $1 and hold till bullrun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "March 20, 2023, 10:35:33 AM",
      "body": "Quote from: naira on March 19, 2023, 05:12:56 PM...Btw the 23rd will be the date when many exchanges will trade $ARB such as Mexc, Kucoin, Bybit, Huobi, and several others exchanges.Today, Binance released an announcement of the upcoming ARB listing: \"Binance will list Arbitrum (ARB) and tentatively set to open trading for these spot trading pairs at 2023-03-23 17:00 (UTC)\" - https://www.binance.com/en/support/announcement/binance-will-list-arbitrum-arb-c9cae13aa4ed405e97af29da3e509b46. Such a listing on the largest cryptocurrency exchange should significantly increase the price of ARB.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "March 20, 2023, 11:07:43 AM",
      "body": "Quote from: StormHawk on March 19, 2023, 12:21:24 PMI was about to create a topic about the benefits that exchanges are getting out of IOU tokens? I am sure that the project teams are not responsible for this listing, they did this on their own for some unknown reason, since I have knew about IOU listings, I have never seen a reasonable price before, the price is always higher than the real token, yet some people will buy IOU tokens first, crazy.I am guessing they are making some big amount of money from listing IOU tokens? IOU token was just only a temporary token. It's issued by exchange site itself which will be replaced by the real token in the future. IOU token price could be used as a measurement to determine the real price. Believe me, it will be dumped to the 10 cents - $1 range depending on what price in another exchange site. The price will be the same as binance once the official token will be fully launched. Got a few thousand ARB. I expect the price will be less than 1 dollar. I meant if arbitrum will have more tokens to be airdropped compared with OP. It will have more supply available in the market and it's around almost 4x more supply compared OP in circulating supply. People have very big expectation for ARB to reach $10 or even $100 which is non sense. A few thousands dollars are good enough for me consider it's a free money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irsykes",
      "created_time": "March 20, 2023, 11:15:19 AM",
      "body": "it looks like arbitrary token prices can be at 2$, 3$ per coin. if it is below the price of 1$ there will be a possibility of an increase waiting for the next few months to reach 5$. like UNI no one will know once a few months up significantly. ethereum network big project always best create great price which happened some time ago",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VRExpress",
      "created_time": "March 20, 2023, 12:30:42 PM",
      "body": "Quote from: irsykes on March 20, 2023, 11:15:19 AMit looks like arbitrary token prices can be at 2$, 3$ per coin. if it is below the price of 1$ there will be a possibility of an increase waiting for the next few months to reach 5$. like UNI no one will know once a few months up significantly. ethereum network big project always best create great price which happened some time agoAre you also considering the token max supply? I don't think it makes sense to compare UNI with ARB, their total supply is far from each other, big quantities of number.Uni swap has 1,000,000,000 max supply Arbitrum has 10,000,000,000 max supply The extra 9billion is not a small amount, that's x9 of Uniswap total supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "March 20, 2023, 02:05:49 PMLast edit: March 23, 2023, 12:26:01 PM by tokeweed",
      "body": "Quote from: GreatArkansas on March 19, 2023, 03:05:45 PMQuote from: tokeweed on March 19, 2023, 02:15:16 PMQuote from: GreatArkansas on March 19, 2023, 07:16:40 AM(....)(...)Anyway as for 10 USD per ARB, that's like around 10 billion market cap.  Does anybody really think it would be that right off the bat?  Kinda sketchy imho.Pure speculation, there is already a lot of comparisons happening between other layer 2 networks that did airdrop before like Optimism.Check this photo:This is mirroring the market cap of other chain networks, this is just speculation or prediction. The majority of people really predict the price could be around starting at $1 - $5. So, let's wait for it.I also love the airdrop distribution because there are only a few people who got big sizes.That's fine, I guess.  But one thing a lot of us miss in trying to price these things is overall market sentiment and the perceived future potential of the project aka hype.  And right now, overall market sentment is fairly bullish and there's lots of hype with the project.  So I feel like it's gonna be priced more than 5 bucks per token on the get go and rise fast from there then evertually starts slowly descending to a tad above a billion market cap.  Dunno..  Could be so wrong here as a lot of people have been waiting for an ARB token for so long.Edit:  Typo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}