{
  "id": "topic_5459832",
  "title": "Becassine",
  "author": "Becassine",
  "created_time": "July 14, 2023, 06:11:32 PM",
  "content": "Remember the big Ponzi Bitconnect and learn from the past.At the height of the Bitcoin hype in late 2017, one company in the cryptocurrency sector was almost as much the talk of the town as its illustrious representative. BitConnect (then the sector's seventh-largest capitalization) was at its peak on December 28, 2017, and one BCC (BitConnect's stock symbol) was traded for $477. Bitconnect's market capitalization soared to $3 billion. But on January 17, everything came crashing down: the site abruptly shut down and thousands of investors were left out in the cold. Some had put their life savings into it  A classic Ponzi pyramid: a fraudulent financial scheme in which customers' investments are remunerated by funds provided by new entrants. BitConnect then exchanges bitcoins for its BCC \"cryptocurrency\", while promising a return on investment at a fixed rate over several months. The more money you leave locked up, the higher the return. In this type of scheme, if the scam isn't discovered, it eventually comes to light when too many investors claim their stakes at the same time. This is what happened at the end of January 2018, when most cryptocurrencies experienced a severe correction.\"Influencers:\": BitConnect created a sponsorship and affiliation system. Influential Twitter and YouTube personalities advise beginners to give BitConnect a try, while pocketing a 7% commission. This short documentary shows people being scammed => https://www.youtube.com/watch?v=thMP0ZpGlDwI remember that at the time I couldn't understand how you could exchange btc for this unknown currency  (BCC). I didn't understand why people were so trustfull in staking for so long. Then I didn't understand how you could put your life's savings into a single cryptocurrency (unless it is bitcoin, that's my opinion).And yet it's happening all over again. People don't seem to learn from the past.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459832",
  "comments": [
    {
      "author": "Sandra_hakeem",
      "created_time": "July 14, 2023, 07:23:44 PM",
      "body": "People Will never desist totally from it...The one thing about humans is that; for the fact that they weren't a victim of a Certain Ponzi scam, they'll always feel people have different fate and that could prolly make the case different with anyone else that tried before them.Secondly, GREED has become man worst enemy.. indulging in a scammy project would also be the worst decisions anyone would take, buh for the fact that they feel it's actually paying and investing in it would be a great liverage, they'll still wanna try.P/s: about investing Thier life savings?.. humans can do anything incredible for money... mostly when it's made to sound really strange and fascinatingSandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 14, 2023, 07:43:59 PM",
      "body": "The problem is, people with no financial and business education can't differentiate between a legitimate startup and a ponzi scheme or an obvious scam. This is why it's generally not advised for such people to get into risky investments and instead stick to safer options. But crypto community rejects this idea, they actively promote crypto investments to their friends and family, because they think it's a golden opportunity to get rich quick. They think they can't be scammed, because they did their research, and by research they mean watching a Youtube video and reading a Medium article.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "July 14, 2023, 08:11:07 PM",
      "body": "It is a classic scam and people are still falling for the every day, all you need is someone who the public trusts and an investment that gets all the hype.Quote from: Becassine on July 14, 2023, 06:11:32 PMThen I didn't understand how you could put your life's savings into a single cryptocurrency (unless it is bitcoin, that's my opinion).You should not even put your life savings into bitcoin no matter how much you trust it. Diversification saves your investments and gives you different timelines of gains and periods of hodl, meaning you are not always waiting on a particular asset to rise or fall but have different options to profit from.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "July 14, 2023, 08:53:06 PM",
      "body": "Quote from: un_rank on July 14, 2023, 08:11:07 PMIt is a classic scam and people are still falling for the every day, all you need is someone who the public trusts and an investment that gets all the hype.Exactly, influencers have always part of the reason why all this Ponzi schemes get to lure people into there service, there was a time I was actually seconding a motion that all this influencers or celebrities be held accountable for the actions of the products they promote because they need to know everything about it. Then I thought like what if they were given just the information they needed and the rest were hidden. Moreover I couldn’t blame them because it is even stated clearly by some that any investor should take caution. So the only way to avoid scam is to do your research no matter who the promoters are?. And no matter how legit something is do not invest your savings in them. Quote from: un_rank on July 14, 2023, 08:11:07 PMYou should not even put your life savings into bitcoin no matter how much you trust it. Diversification saves your investments and gives you different timelines of gains and periods of hodl, meaning you are not always waiting on a particular asset to rise or fall but have different options to profit from.- Jay -Yes one needs to diversify their portfolio but I don’t see buy of alticoins as diversification because they just follow the bitcoin. And should anything bad happen to bitcoin as was the fear for diversification then the entire crypto space might collapse. So the best way of diversification should be an investment in differents assets like Gold, Stock, Real Estate and Agricultural hoarding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "July 14, 2023, 08:58:46 PM",
      "body": "Quote from: Zaguru12 on July 14, 2023, 08:53:06 PMthere was a time I was actually seconding a motion that all this influencers or celebrities be held accountable for the actions of the products they promote because they need to know everything about it.Their culpability in scams that they engage in can be investigated and if it is discovered that they willfully promoted a scam, they should be held accountable for it. But if they were also swindled like everyone else they are also victims.No one should let someone else do the thinking for them. If you are going to put your money into it, you should also be able to put your time and energy into doing your research.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odunybiz",
      "created_time": "July 14, 2023, 09:09:31 PM",
      "body": "Quote from: Becassine on July 14, 2023, 06:11:32 PMBut on January 17, everything came crashing down: the site abruptly shut down and thousands of investors were left out in the cold. Some had put their life savings into it  This is greediness and this is what kill people most even in crypto space. Why will one put all your life savings in just one investment. People should learn to diversify their earnings. This will definitely save them if there is an issue in one of their business. The other can bail them out.QuoteA classic Ponzi pyramid: a fraudulent financial scheme in which customers' investments are remunerated by funds provided by new entrants. In this type of scheme, if the scam isn't discovered, it eventually comes to light when too many investors claim their stakes at the same time. This is what happened at the end of January 2018, when most cryptocurrencies experienced a severe correction.\"Influencers:\": BitConnect created a sponsorship and affiliation system. Influential Twitter and YouTube personalities advise beginners to give BitConnect a try, while pocketing a 7% commission. Scammer just full almost everywhere this days and people keep failing into their trap. Some of this influential Twitter and YouTube personalities even sometimes make people to be scammed just because of their selfish interest. Most don't even make research on the investment before advertising for them. They are just being carried away with the money they will make forgetting their personalities is at stake. This is why is better to make ones research before investing in anything.Quotehow you could put your life's savings[/b] into a single cryptocurrency (unless it is bitcoin, that's my opinion).Nothing in this life is 100% sure. Impossibility sometimes become possible. Try diversify your earning to save your money and investment. If all your investment is on Bitcoin and you plan to hold for long but accidentally Bitcoin price now dropped heavily and you need money urgently at the moment. What will happen? You sell part in lose right!!! If diversification is your key, you leave the Bitcoin and seek fund from your other business. Diversification save investor from business risk alot.QuoteAnd yet it's happening all over again. People don't seem to learn from the past.This can't easily be stopped in a country with high rate of poverty. People see those things as a golden opportunities to get rich easily but at the end they got scammed. After being scammed they still continue to try because they believe if you don't lose, you can't gain. And keep thinking their golden opportunities is at the door.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 14, 2023, 09:16:08 PM",
      "body": "Dear op i didn't really catch what you mean by all of this happening again. Because AFAIK, BCC is flopped/rug-pulled and I also do know there are huge amounts of tokens and new projects that are still rug-pulling. So to which project are you referring to? And i do agree that such projects are ponzi schemes that offer huge returns but to the question of why people always fall prey to them is very simple.Venture capitalists attract new or I would say newbie investors towards new projects and most of the projects are DeFi. And once they reached their fund capital limit they rug pulled with investors' money. I know not all VCs are meant to attract newbie investors but in most cases, they are just insiders. The point is, we should avoid from such schemes that promise huge return which looks unbelievable. By doing so, we could save our money and tbh i am against all the staking types instead of one with no fixed apy or returns but still, i do not prefer anyone to do staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "July 14, 2023, 09:54:14 PM",
      "body": "Quote from: hatshepsut93 on July 14, 2023, 07:43:59 PMThe problem is, people with no financial and business education can't differentiate between a legitimate startup and a ponzi scheme or an obvious scam. This is why it's generally not advised for such people to get into risky investments and instead stick to safer options. But crypto community rejects this idea, they actively promote crypto investments to their friends and family, because they think it's a golden opportunity to get rich quick. They think they can't be scammed, because they did their research, and by research they mean watching a Youtube video and reading a Medium article.Well even people with strong financial education cab still get scammed if they drop their guard, scammers are always improving their format so as to still be able to scam more people, I believe that regardless of our financial background we should still strive to understand more and new ways scammers are employing to carry out their activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "July 14, 2023, 10:14:05 PM",
      "body": "The catch is everyone is built different, for instance some people are more gullible than others, less educated on relevant topics than others, more emotionally vulnerable, you name it.And that's ladies and gents is why scams are here to stay. You don't need to come up something orginal or elaborate AF idea, you just need to find the right audience. Let's take ponzi scams for instance, it's pretty much a classic and just gets rehashed all the time and yet it's still as popular.  Perhaps most people won't risk as much as their life savings but history says there are at least a number of people who would stoop that low so it's not unthinkable to assume there could be more people who leans that way. Imagine what happens if they somehow get into the clutches of a scammer and given the right push....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 14, 2023, 11:25:42 PM",
      "body": "Quote from: BIT-BENDER on July 14, 2023, 09:54:14 PMWell even people with strong financial education cab still get scammed if they drop their guard, scammers are always improving their format so as to still be able to scam more people, I believe that regardless of our financial background we should still strive to understand more and new ways scammers are employing to carry out their activities. Those people don't fall for ponzi schemes. It's very easy to spot a ponzi scheme if you have basic financial education. You see a promise of unrealistically high returns with regular payouts, you see that a company doesn't have a solid business model - the only conclusion is that they are paying out from the funds of new investors.Experienced investors might fall for startup scams, when they get promised a groundbreaking new invention that will take some time to show even the first results, but that's very different from scams like bitconnect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "July 14, 2023, 11:58:14 PM",
      "body": "Okay, although I was here in 2017, I vaguely remember the whole BitConnect incident. I hardly remember anything after over 6 years. However, this isn't the first incident, is it? We've had plenty of similar ones in the past year or two. Starting from the FTX exchange and their token, FTT, which went downhill after the exchange shutdown and is now worth peanuts. Guess what, there were people who had invested millions in FTX and the token itself. It's sickening to think that at one point you're a rich and successful investor and, in the next moment, you have absolutely nothing. Don't get me started on Terra, which crashed within a day or two, vanishing billions of dollars worth of crypto and, of course, no solution was ever found for its investors.Thus, it's best to stick to known and reputable options, such as Bitcoin, Ethereum and a few others you think are to be trusted, while at the same time avoiding the storing of funds on centralized exchanges that provide you with zero power over your money and, even then, there is no guarantee regarding Bitcoin or any other coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "July 15, 2023, 02:51:44 AM",
      "body": "Quote from: Becassine on July 14, 2023, 06:11:32 PMRemember the big Ponzi Bitconnect and learn from the past.In the past, OneCoin is another Ponzi project but it did not succeed like Bitconnect because OneCoin never listed on Coinmarketcap or exchanges.Two websites to Bitconnect on Coinmarketcap now are die.https://coinmarketcap.com/currencies/bitconnect/Github of Bitconnect has no contribution since 2019. Very little contribution in 2018.https://github.com/bitconnectcoinGithub is important for a due diligent research on an open source project in cryptocurrency. No or little contributions give you very red flag on development and future of that project.Accused OneCoin Scam Orchestrator Arrested in Los AngelesAbout Ponzi, you can look at Terra and see a red flag from its very high APY. By providing 20% APY, Terra faced with risk to fall in a dead spiral when their capital inflow is broken. The terrible algorithm for their stable coin UST and correlation with LUNA token only makes their project worse.Anatomy of a Stablecoin’s failure: The Terra-Luna case",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "July 15, 2023, 06:57:31 AM",
      "body": "Quote from: un_rank on July 14, 2023, 08:58:46 PMQuote from: Zaguru12 on July 14, 2023, 08:53:06 PMthere was a time I was actually seconding a motion that all this influencers or celebrities be held accountable for the actions of the products they promote because they need to know everything about it.Their culpability in scams that they engage in can be investigated and if it is discovered that they willfully promoted a scam, they should be held accountable for it. But if they were also swindled like everyone else they are also victims.Most of the time, such celebrities have no idea what they are pushing; they are simply promoting such platforms for the purpose of money, and like you mentioned, they are also victims of it since they invest their money in them.The crypto influencers should be held accountable because we know they have almost complete knowledge of the entire process, and even if the project or plan turns out to be a scam, they will continue to promote it for money, which is extremely awful. They are meant to be the first to raise an alarm if they discover any red flags in such initiatives or platforms, but they will remain silent and accept the promotion money.QuoteNo one should let someone else do the thinking for them. If you are going to put your money into it, you should also be able to put your time and energy into doing your research.- Jay -FOMO and laziness are also major contributors. Many people neglect to conduct research because they observe others investing in the project and believe that it will be too late for them to do so, and they end up being victims due to laziness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Becassine",
      "created_time": "July 15, 2023, 10:53:47 AM",
      "body": "Quote from: Sandra_hakeem on July 14, 2023, 07:23:44 PMP/s: about investing Thier life savings?.. humans can do anything incredible for money... mostly when it's made to sound really strange and fascinatingSandra 🧑‍🦰Besides, what is surprising is that one might think that people who play gambling or who get trapped in Ponzi schemes are people who are not or not very wealthy and who have hopes of getting rich quick. But with the Madoff affair, we saw that even people who are already wealthy can be greedy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "July 15, 2023, 12:32:11 PM",
      "body": "Quote from: hatshepsut93 on July 14, 2023, 07:43:59 PMThe problem is, people with no financial and business education can't differentiate between a legitimate startup and a ponzi scheme or an obvious scam. This is why it's generally not advised for such people to get into risky investments and instead stick to safer options. But crypto community rejects this idea, they actively promote crypto investments to their friends and family, because they think it's a golden opportunity to get rich quick. They think they can't be scammed, because they did their research, and by research they mean watching a Youtube video and reading a Medium article. The problem with people these days is that they can be easily lured as long as high returns is at stake. Even if they know they would only lose more than they’ll gain profits because they just quickly invest without educating theirselves. It seems that they are not learning from other people’s mistakes and losses. However, being lured or scammed is part of growing. You will never learn and take it with caution unless you experienced it all by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 15, 2023, 01:28:54 PM",
      "body": "Quote from: Becassine on July 14, 2023, 06:11:32 PMI didn't understand why people were so trustfull in staking for so long. Then I didn't understand how you could put your life's savings into a single cryptocurrency (unless it is bitcoin, that's my opinion).I don't understand how someone can invest their entire life savings in anything, and that includes Bitcoin. Because although Bitcoin from an investment perspective looks very promising, the future has always been and will be uncertain, and therefore diversification is something that only makes sense. Quote from: Becassine on July 14, 2023, 06:11:32 PMAnd yet it's happening all over again. People don't seem to learn from the past.Only intelligent people learn from other people's mistakes, others choose the hard way and learn from their own mistakes, but that's something we can't change. This is something that works for scammers, because they prosper precisely because of such people and the fact that today anyone can \"invent\" cryptocurrency, list it on some CEX and claim that this is the next big thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "July 15, 2023, 03:44:13 PM",
      "body": "Quote from: Becassine on July 14, 2023, 06:11:32 PM~I remember that at the time I couldn't understand how you could exchange btc for this unknown currency  (BCC). I didn't understand why people were so trustfull in staking for so long. Then I didn't understand how you could put your life's savings into a single cryptocurrency (unless it is bitcoin, that's my opinion).And yet it's happening all over again. People don't seem to learn from the past.I still remember this incident back in 2017. Back then, I was just a newcomer, and still learning crypto. At that time, this coin Bitconnect is starting to get hyped because of it's insane returns to it's investors. They even made a meme about Bitconnect. Overall, this was the hyped coin until the shit happened when the developers of the team just ran away, and in just a matter of hours, the price of it went down from 3 digits to 2 digits. Though it didn't stop there because there are still newbies out there who believed that something good will still happen, in the end the developers ran away, and left these investors with a shitcoin.There are reasons why back then, people are risking even their life savings. Those juicy returns back then are just very attracting for newbies, and back then, cryptocurrency as a whole is just starting to get it's attention, so they invested into it, threw their life savings hoping that it will yield more money for them. Unfortunately, their life savings turned into a waste, and correct me, but there are also investors who committed suicide because of this scam. Why it's still happening? There are some reasons as to why it's still happening. There are still reasons as to why there are still people who are still getting scammed after what's happening in the past.1. There are some investors who didn't know what's scam, and what's not. There are still investors who can't distinguish which projects have the potential to scam investors, and which projects hasn't. There are some investors who don't know the red flags of a particular projects, and they're just throwing their money into that project hoping that they will get huge profits into it. Sounds stupid, but it's the reality.2. People loves risk. I know, I know there are some who might be against it, but there are investors who still want to risk their money even though they know that the chances of it to be a scam project is really high. I just don't know why there are investors like this. Anyway, researching is always a good thing to do before investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 15, 2023, 03:58:04 PM",
      "body": "Quote from: Ultegra134 on July 14, 2023, 11:58:14 PMOkay, although I was here in 2017, I vaguely remember the whole BitConnect incident. I hardly remember anything after over 6 years. However, this isn't the first incident, is it? We've had plenty of similar ones in the past year or two. Starting from the FTX exchange and their token, FTT, which went downhill after the exchange shutdown and is now worth peanuts. Guess what, there were people who had invested millions in FTX and the token itself. It's sickening to think that at one point you're a rich and successful investor and, in the next moment, you have absolutely nothing. Don't get me started on Terra, which crashed within a day or two, vanishing billions of dollars worth of crypto and, of course, no solution was ever found for its investors.I think it's because BitConnect are not that popular in Europe and North America, (where mostly is first world country). But it's massively popular in South East Asia, in Indonesia where I came from, it even reach the grass root level, where there is a community of Bitconnect that held monthly meeting, and believe it or not most of the people never heard of Bitcoin or even Cryptocurrency, all they knew was Bitconnect. One of my relative joined this community, depositing some money, but after few months of explanation and argument with me, I can finally assure him that it's a ponzi scam, he finally withdraw his money, about few months before the Bitconnect fall. Anyway most people in here never learn from the Bitconnect, after Bitconnect, there are several similar scam, and people still invest in it, some of the scam falsely claiming as crypto but it's not, and people still believe in it, and the more shocking thing is that they are the same people that are fooled by Bitconnect and previous scam project. I really surprise that they still have money after all those thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "July 15, 2023, 05:45:04 PM",
      "body": "Quote from: icalical on July 15, 2023, 03:58:04 PMQuote from: Ultegra134 on July 14, 2023, 11:58:14 PMOkay, although I was here in 2017, I vaguely remember the whole BitConnect incident. I hardly remember anything after over 6 years. However, this isn't the first incident, is it? We've had plenty of similar ones in the past year or two. Starting from the FTX exchange and their token, FTT, which went downhill after the exchange shutdown and is now worth peanuts. Guess what, there were people who had invested millions in FTX and the token itself. It's sickening to think that at one point you're a rich and successful investor and, in the next moment, you have absolutely nothing. Don't get me started on Terra, which crashed within a day or two, vanishing billions of dollars worth of crypto and, of course, no solution was ever found for its investors.I think it's because BitConnect are not that popular in Europe and North America, (where mostly is first world country). But it's massively popular in South East Asia, in Indonesia where I came from, it even reach the grass root level, where there is a community of Bitconnect that held monthly meeting, and believe it or not most of the people never heard of Bitcoin or even Cryptocurrency, all they knew was Bitconnect. One of my relative joined this community, depositing some money, but after few months of explanation and argument with me, I can finally assure him that it's a ponzi scam, he finally withdraw his money, about few months before the Bitconnect fall. Anyway most people in here never learn from the Bitconnect, after Bitconnect, there are several similar scam, and people still invest in it, some of the scam falsely claiming as crypto but it's not, and people still believe in it, and the more shocking thing is that they are the same people that are fooled by Bitconnect and previous scam project. I really surprise that they still have money after all those thing.I'm completely ignorant regarding the BitConnect scam, but I'm now reading that approximately 800 users were refunded, but the number of users that were reimbursed sounds too small.The issue is that such scams and Ponzi schemes are giving cryptocurrencies a bad name because people tend to associate them with the scam itself. Cryptocurrency-related scams are also easier to recreate due to privacy reasons, which enables such projects to pop up and disappear within a few days. This, however, isn't a valid excuse because the internet is full of scams and has always been like that; it's just that people who are against cryptocurrencies tend to focus on the negative aspects, which are the scams that involve cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}