{
  "id": "topic_5464276",
  "title": "Question:",
  "author": "za23ch",
  "created_time": "August 23, 2023, 10:43:10 AM",
  "content": "I've had the best luck, the fastest withdrawal and deposits from https://www.bitcoincasino.us/ they do require a 3x wager of amount deposit but the cash out immediately. What do any of you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464276",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "August 23, 2023, 10:55:30 AM",
      "body": "Im not sure if it’s just me but I’m unable to access the site and I’m not using any VPN that could change my ip to a U.S. ip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "August 23, 2023, 11:17:39 AM",
      "body": "Quote from: za23ch on August 23, 2023, 10:43:10 AMI've had the best luck, the fastest withdrawal and deposits from https://www.bitcoincasino.us/ they do require a 3x wager of amount deposit but the cash out immediately. What do any of you think?You're lucky to have withdrawn your winnings because based on reviews by casino reviewers this is a bad casino to play with on LCB.org it got a very bad rating of 1.25/5 QuoteConclusionBoasting to be ‘A Casino That You Can Trust,’ this couldn’t be farther from the truth. With a motto like that, it makes you think they have something to hide. However, it hasn’t done a very good job at hiding anything, as our team has caught on to its true colors. We advise our members not to buy into this casino’s false advertising, and play elsewhere.And on Trustpilot it has a very bad rating 76% of the voters gave it 1 starhttps://www.trustpilot.com/review/bitcoincasino.usI hope you're not promoting that casino here with a very bad rating, it's better to post your transaction or screenshot of your withdrawal so we don't suspect you of shilling this casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "August 23, 2023, 12:01:44 PM",
      "body": "Quote from: za23ch on August 23, 2023, 10:43:10 AMI've had the best luck, the fastest withdrawal and deposits from https://www.bitcoincasino.us/ they do require a 3x wager of amount deposit but the cash out immediately. What do any of you think?Not familiar with that casino so if I where you much better if you stick or decide to play on a casino which have good reputation in this forum since they can be more trusted when dealing with our winnings and other technical issues  might occur. As other stated you are so lucky you withdraw your funds since at first glance they are shady casino and can't trust them if on first glance they already have negative ratings from this community or on other site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "August 23, 2023, 12:11:46 PM",
      "body": "Quote from: za23ch on August 23, 2023, 10:43:10 AMI've had the best luck, the fastest withdrawal and deposits from https://www.bitcoincasino.us/ they do require a 3x wager of amount deposit but the cash out immediately. What do any of you think?Sorry but that casino looks shady to me. If you google their ratings, they have extremely bad ratings. And a lot of people are throwing dirt on the casinos reputation. Before playing on any online gambling casino, it is always smart to first check what people are saying about it, how it's ratings look like and if there are any scam accusations against that particular casino website.In any case, I will be staying away. I see lots of red flags...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "August 23, 2023, 12:13:44 PM",
      "body": "Quote from: za23ch on August 23, 2023, 10:43:10 AMI've had the best luck, the fastest withdrawal and deposits from https://www.bitcoincasino.us/ they do require a 3x wager of amount deposit but the cash out immediately. What do any of you think?I'm not sure about the genuinity of that casino because other members have said that the casino is not a trusted one and that's why I would never trust a casino whose reputation is not so good. You were lucky that you got the withdrawal because the reports of that casino aren't really that good and someone who knows crypto gambling would try his/her best to stay away from such casinos. I don't know that why they do require 3x wager because other casinos won't require 3x wager if you haven't availed any of the bonuses that comes with such wagers. The wager requirements are basically for bonuses or promotions and as a normal depositor there aren't such limitations as far as I know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "August 23, 2023, 12:28:55 PM",
      "body": "Quote from: Cantsay on August 23, 2023, 10:55:30 AMIm not sure if it’s just me but I’m unable to access the site and I’m not using any VPN that could change my ip to a U.S. ip. I can access the website using my normal Philippines IP. Maybe your country is restricted on this casino since this casino domain is from US and probably comes with different set of regulation compared to the typical casino that host outside US and use Curacao license.Quote from: za23ch on August 23, 2023, 10:43:10 AMI've had the best luck, the fastest withdrawal and deposits from https://www.bitcoincasino.us/ they do require a 3x wager of amount deposit but the cash out immediately. What do any of you think?Try to browse other casino here in the forum especially Livecasino.io which offers instant withdrawal and x1 wagering requirements on deposit in contrary to what you are using with x3 wagering requirements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "August 23, 2023, 12:59:10 PM",
      "body": "I voted for the second option because I don't waste my time in casinos that are not the trusted ones we all know on the forum. And even less so if the person telling me about it is a newbie, who, although you registered some time ago, has had very little activity during all this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 23, 2023, 01:03:52 PM",
      "body": "Quote from: za23ch on August 23, 2023, 10:43:10 AMI've had the best luck, the fastest withdrawal and deposits from https://www.bitcoincasino.us/ they do require a 3x wager of amount deposit but the cash out immediately. What do any of you think?You have to prove that you're not shilling this casino, searching the internet and their level of trust it's not a good place to play, you will in the end help scammers by the way you post, it's better to control yourself if you have a good experience in a casino but there are bad ratings and bad experience from the other users.Or you should add a disclaimer that you are not recommending this casino and that your post is just based on your experience, I wonder why they do not have an announcement, I guess because the community will dig deep into the reputation of this casino, and they will be exposed, now they are exposed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "August 23, 2023, 01:22:32 PM",
      "body": "Quote from: Cantsay on August 23, 2023, 10:55:30 AMIm not sure if it’s just me but I’m unable to access the site and I’m not using any VPN that could change my ip to a U.S. ip. That's the problem for most websites and casinos online. Unless they have a universal application accessible to all, their website won't open to countries and places that are not within the reach of their servers. I think that's one update needed to the website if they want more users around the globe. For now, I would see this unreliable website yet to put my funds in the website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "August 23, 2023, 01:32:03 PM",
      "body": "I had never heard the casino's name, and I thought it was Bitcasino, but after I observed the casino's name, it was not Bitcasino.If you can deposit and withdraw fast, you can try to continue playing gambling to see if the information is true, as you found. If this is true, you can use the casino to play gambling and add it to your casino list.However, I couldn't find well-known providers like Pragmatic Play, NoLimit, or Play'N Go. They have more slot games than Habanero, Belatra, Booming, Endorphina, and other providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "August 23, 2023, 02:07:17 PM",
      "body": "It says UK players are not allowed to visit the casino, whereas I am not in the United Kingdom, I think this website is down for unknown reasons, and since you just created this topic today how come you don't know that it's down? Anyways, this isn't the first and the last online casino that has fast withdrawal too, or even the 3x wagers, there are few other online casinos with the same potential, or even better.Luck has nothing to do with the casino you are using, if you are full of bad luck for the day it's going to be a bad day anyway, congrats on having the best luck so far, I could have tried mine if it's legit but for now it's down. Try Stake, Roobet, RollBit, and Fortune Jack, you will have great time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 23, 2023, 02:20:46 PM",
      "body": "Quote from: Cantsay on August 23, 2023, 10:55:30 AMIm not sure if it’s just me but I’m unable to access the site and I’m not using any VPN that could change my ip to a U.S. ip. I can't also access the casino from my normal Nigerian ip, no VPN used as well, in fact, I never use VPN for any casino..There is the Inscription there that UK players are not allow to use the casino, I supposed by that, they mean players from UK alone, why then are they not allowing those from other parts of the world outside UK to access the site?Anyways, this casino have a very bad rating, it's not a casino to take serious, I wonder what exactly made op share it here, maybe he's paid to advertise them, don't really know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "August 23, 2023, 02:21:00 PM",
      "body": "Op, if you can really withdraw your funds quickly, you are quite lucky because you can withdraw your funds from a casino that has a pretty bad rating. I mean you are lucky your funds are not swallowed up by the casino. if you really do.as many other members have suggested, there are more trusted casinos, but why do you play at these casinos?for the first time, you might be successful, but maybe for the next one, you can be angry and irritated by the casino you explained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 23, 2023, 02:22:59 PM",
      "body": "Quote from: Crypt0Gore on August 23, 2023, 02:07:17 PMIt says UK players are not allowed to visit the casino, whereas I am not in the United Kingdom, I think this website is down for unknown reasons, and since you just created this topic today how come you don't know that it's down? Try Stake, Roobet, RollBit, and Fortune Jack, you will have great time.Most of the casino that you mention is also geo blocked UK players since they are all using Curacao License which has no power over the UK Gambling Commission since they their own license that they will give for operators that want to accept players from UK. The OP casino provided on this thread doesn't have any information about the casino license. Probably the owner doesn't want legal trouble by allowing country that has a strict regulation towards online casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "August 23, 2023, 02:25:26 PM",
      "body": "I'm just wondering to you op how this bitcoincasino was okay for you? when based on the trustpilot review, his ratings are quite bad. It's like you're just trolling us here on the forum.But even so, most of the communities here know how to look at a casino to see if it is legitimate and good for gambling or not, but for me, I don't trust that platform, sorry, this is my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 23, 2023, 02:32:20 PM",
      "body": "Any casino that has not a big ANN thread here in the forum full of positive reviews and feedback I would be dumb enough to go and join them.Chances are high to risk my money on such casino as if something bad were to happen at such place I would have nowhere to post my complains,my money would be gone and I would be left wondering.That is why to avoid such scenarios I like playing in really well established casinos here in the forum as I know that if anything happens it will be solved in an instant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 23, 2023, 02:37:29 PM",
      "body": "Quote from: Cantsay on August 23, 2023, 10:55:30 AMIm not sure if it’s just me but I’m unable to access the site and I’m not using any VPN that could change my ip to a U.S. ip. Do not mind the site. I looked for their ToS and this is what I saw:https://www.bitcoincasino.us/terms-and-conditionsQuoteWho Can PlayThe website accepts players only from those countries and geographic regions where online gambling is allowed by law. It is the player’s sole responsibility to inquire about the existing gambling laws and regulations of the given jurisdiction before placing bets on the website. The website only accepts adult players (the minimal age is 18) and players who have reached the age specified by the jurisdiction of player’s place of residence as eligible for online gaming. It is the player’s sole responsibility to inquire about the existing laws and regulations of the given jurisdiction regarding the age limitation for online gambling. The Company reserves the right to ask for the proof of age from the player and limit access to the website or suspend the player’s account to those players who fail to meet this requirement.No restricted countries mentioned. I can not use the website either.I tried to access the site, not working until I used VPN. QuoteGame RulesThe player confirms that he/she knows and understands the rules of games offered by the website. It is at player’s discretion to know the payout percentage of each game.The player confirms that he/she is not using VPN (Virtual Private Network). Using a different IP than your original could result to account termination and all funds will be confiscated.I hope some people will not use VPN because their money would be seized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "August 23, 2023, 02:39:29 PM",
      "body": "This is my first time hearing about this. As much as possible, I only stick to casinos and platforms that I've already known for a long time because those are proven and tested and also those are the ones that I really trust. Of course, it involves money and I had to be extra careful of what to trust and not. This is only my own perspective, and it does not apply to everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "August 23, 2023, 02:42:37 PM",
      "body": "Quote from: Cantsay on August 23, 2023, 10:55:30 AMIm not sure if it’s just me but I’m unable to access the site and I’m not using any VPN that could change my ip to a U.S. ip. You are not alone I am also getting the same message. Unfortunately, I am not from the UK; the casino still thinks I am from the UK. This kind of shit promotion is all we need. There is nothing I have to say about this casino as I cannot access it. For me, it is another newbie who might be promoting a scam platform on the forum. I have asked a few time to restrict newbies from promoting any casino on the Gambling main board but none of you are supporting it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}