{
  "id": "topic_5453261",
  "title": "FiveG",
  "author": "FiveG",
  "created_time": "May 19, 2023, 01:20:17 AM",
  "content": "Friends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453261",
  "comments": [
    {
      "author": "Husires",
      "created_time": "May 19, 2023, 01:36:47 AM",
      "body": "What is your country, There are many bitcoin exchanges as most of them require you to verify your identity first, deposit bitcoins and then trade in many pairs such as the stable currency pair, where you aim to make a profit from the price differences or with every rise and fall in the price.You need to learn the basics of trading, technical analysis and reading trading charts and then with a little patience you will learn how to trade Bitcoin properly.You can start following analytics with this board https://bitcointalk.org/index.php?board=57.0.Some forex applications enable you to trade bitcoins, but you do not actually buy bitcoins, but rather shares bearing the name of bitcoins, and you are often unable to withdraw them, and therefore it is better to avoid them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "May 19, 2023, 01:55:45 AM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failingDon't trade cryptocurrency with Forex as with their very high leverages, you will hardly to control your decisions and emotions when you open your positions and close them.You can trade your cryptocurrency on centralized exchanges or decentralized exchanges.With centralized exchanges, you will have to create your account, mostly KYC and store your cryptocurrency in that account. You don't own private keys of your coins on centralized exchanges.Reminder: do not keep your money in online accounts NewWith decentralized exchanges, you own private keys of your coins.Learn trading with Awesome crypto tradingIf you want to cash out and don't want KYC, use non KYC exchanges.https://kycnot.me/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 19, 2023, 04:34:04 AM",
      "body": "The best platform for trading will highly depend on what country you're in. Mostly though, I'd go with Binance and Kucoin. Probably Coinbase if you're from the United States(or any country they support).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "May 19, 2023, 04:54:39 AM",
      "body": "Quote from: hd49728 on May 19, 2023, 01:55:45 AMQuote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failingDon't trade cryptocurrency with Forex as with their very high leverages, you will hardly to control your decisions and emotions when you open your positions and close them.The OP looks like he is going to lose his money and more, but when a person is stubborn about something, it is better to leave it and end up beating himself up against reality on his own. The only ones who get rich with leveraged trading with forex and all that crap are those who promote it and those who charge fees.As for where to trade, he has already been given an answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "May 19, 2023, 05:05:57 AM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMsignals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin?This mean you know the platform to buy and sell Bitcoin, the signals you used to trade forex were working, but it's not work when you trade Bitcoin. So you're looking an exchange where you can make easy money by trading a Bitcoin? there's no such exchange because even though you're using copy trading from a trader or bot to trade for you, there's no guarantee you will make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "May 19, 2023, 09:37:01 AM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.You can't use your trading strategy in forex to Bitcoin immediately, you have to backtest your setup when it's your first time in that pair. You have to bear in mind that each currency pair has different market habits and  volatility. Some traders use different strat when they want to trade crypto, and I also notice with my batch mate that he only scalping in forex, maybe that's the best trading technique in forex. But in crypto, swing trading is also best. If you want to trade Bitcoin, I recommend Binance since this is the best trading exchange out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 19, 2023, 10:38:55 AM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.If you want to trade bitcoin, I mean the real bitcoin, you can use centralised exchanges. You can see the lists of centralize exchanges on Coingecko and their rank. https://www.coingecko.com/en/exchangesYou can see their trading volume and their ranking score. Check the ones that provide exchanges services to people in your country. Quote from: mk4 on May 19, 2023, 04:34:04 AMThe best platform for trading will highly depend on what country you're in. Mostly though, I'd go with Binance and Kucoin. Probably Coinbase if you're from the United States(or any country they support).There are many good exchanges that I am using. Bybit, OKX, Huobi Global and some others are good. I use Binance and Kucoin, they are both good too.For non KYC exchanges: Current list of exchanges without KYCBut know that all exchanges mentioned are centralised exchanges and they may request or force their users to do KYC at anytime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "May 19, 2023, 10:39:34 AM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.You can use binance. It is a centralized exchange platform that you can still use for trading after you verify your account but you have to understand that trading bitcoin from forex platform or crypto exchange platform are not far different and if you are making losses it means you are not trading rightly and can also continue making losses even after you use exchange. Bitcoin no doubt is highly volatile and that is the reason for most traders making losses, trading stablecoins can be a little bit better.Quote from: hd49728 on May 19, 2023, 01:55:45 AMQuote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failingDon't trade cryptocurrency with Forex as with their very high leverages, you will hardly to control your decisions and emotions when you open your positions and close them.I think high leverage is not op's leverage issue because you can adjust leverage use in forex platform. Perhaps Op is new to trade and just confused and thinking an easy way to profiting from bitcoin trading exist somewhere but I doubt he will find that even after reducing his leverage to 1:1 on exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 19, 2023, 10:49:42 AM",
      "body": "Quote from: palle11 on May 19, 2023, 10:39:34 AMYou can use binance. It is a centralized exchange platform that you can still use for trading after you verify your account but you have to understand that trading bitcoin from forex platform or crypto exchange platform are not far different and if you are making losses it means you are not trading rightly and can also continue making losses even after you use exchange. Bitcoin no doubt is highly volatile and that is the reason for most traders making losses, trading stablecoins can be a little bit better.What is the difference? I mean trading bitcoin and trading stable coin. A trader can not prefer to trade stable coin for a stable coin to make profit, that is even not possible for profit making, traders trade unstable and stable coins pair.If you are on a spot market, you will prefer to trade BTC/USDT pair. Also if you are on a future trading market, you will prefer to trade BTCUSDT. Even if you go for Coin-Margin which is the one that is different, that does not mean that it is not risky like others mentioned too. But spot trading is not as risky as future trading.Another thing is that a trader can have the knowledge about market, indicators, charts and others, but how the profit is calculated using pips and lots in forex is not the same as crypto trading which requires little and easy calculations. Not that the calculation in forex is difficult too though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 19, 2023, 11:15:22 AM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.Forex and Bitcoin are different things, the indicators that work with forex might not work with Bitcoin due to its volatility. The forex market is far less volatile than crypto market and that's why many forex traders face losses when they start crypto trading. The crypto market is the most volatile market in the world and anyone who's unware of its volatility should first learn about it before starting trading.Although, the parameters of your indicators might not work for crypto, but the indicators are still same, once you learn to modify the parameters in a working way and develop a good strategy then you will have a good time trading Bitcoin. Basically the technical indicators are same for crypto and forex,  you only need to set some good parameters and winning strategy to take advantage of the volatility of the market.You can try some good crypto exchanges as they offer valuable services and the option to set and modify the indicators. You'll learn the market if you devote some time to it, instead of executing the trades in the start it's better to learn and master the volatility of the market, and once you reach a good level of understanding then execute your trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "May 19, 2023, 11:45:09 AM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response. Dont use forex apps for bitcoin trading. Use an exchange app like KuCoin or others as supported by you local community and in your country. Again dont look at signals, they are mostly fake picks done by malevolent people trying to make money off your panic situation. Listen to those and you will lose your money.You should first visit your local country section of this forum and see what app they use and then create an account there/pass KYC so you can start trading right away. Learn trading from articles on the internet and youtube and start with dummy trading first. Never trust the words of any person on the net, learn the methods on your own and decide on your own to buy and sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "May 19, 2023, 11:52:03 AM",
      "body": "I prefer to use your country's local (regulated) crypto oriented trading platforms first, they generally also provide complete trading-oriented learnings and instructions in the local language. Also, as far as personal experience and lots of stories of people with problems with trading activities they'll get support faster because local platforms only deal with customers with the same nationality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "May 19, 2023, 12:26:16 PM",
      "body": "Quote from: Oshosondy on May 19, 2023, 10:49:42 AMQuote from: palle11 on May 19, 2023, 10:39:34 AMYou can use binance. It is a centralized exchange platform that you can still use for trading after you verify your account but you have to understand that trading bitcoin from forex platform or crypto exchange platform are not far different and if you are making losses it means you are not trading rightly and can also continue making losses even after you use exchange. Bitcoin no doubt is highly volatile and that is the reason for most traders making losses, trading stablecoins can be a little bit better.What is the difference? I mean trading bitcoin and trading stable coin. A trader can not prefer to trade stable coin for a stable coin to make profit, that is even not possible for profit making, traders trade unstable and stable coins pair.I thought you would understand I meant altcoin paired with stablecoin incase that would be less volatile because Op issue was a little about losses trading bitcoin and searching for a place for lesser loses which I think he will get the same anywhere if he is trading bitcoin and can't manage it.Quote from: Oshosondy on May 19, 2023, 10:49:42 AM.Another thing is that a trader can have the knowledge about market, indicators, charts and others, but how the profit is calculated using pips and lots in forex is not the same as crypto trading which requires little and easy calculations. Not that the calculation in forex is difficult too though.Whoever is interested to trade and produce profit should be interested to learn how the pips come out and the difference from where he made the other being the profit or lose. But overall if a trader has knowledge about market, indicators, charts and others according to what you said then he should not worry much about pips because he is going to supposedly make profit anytime he makes order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fauzan Ichsan",
      "created_time": "May 19, 2023, 02:02:59 PM",
      "body": "for me trading forex or bitcoin is the same, I usually use the same indicators and the same techniques too, if you experience an analysis error, it's normal, try again at another opportunity. we cannot force the market according to our wishes, but must be able to follow the will of the market. maybe there is something wrong with us, because I often also trade the same bitcoin in one platform with forex with leveraged trading, and it's not an obstacle, losing or winning is normal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "May 19, 2023, 02:19:49 PM",
      "body": "First you can use the Binance app to trade wherever you are. The first thing you need to do here is to create an account with your email or phone number in your country. Then you need to deposit Bitcoin, USD unique currency if any for trading. Then you can buy and sell by following the market chart. But since you are coming from forex trading, here you will have a lot of difficulty in understanding the market situation at first. At first you need to trade by looking at the market chart very carefully. But remember that no mistake can be made here, if you make a mistake, you will lose a lot of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 19, 2023, 02:24:31 PM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing,Don't take forex for bitcoin trading, they are two different things, though they may sound alike but there are differences, but if you already had the forex trading experience, it may help you in getting used to that of bitcoin more faster than a novice in trading, there are online materials you could download to read, learn from the forum here and watch some trading clips on YouTube, this will also help in it own way.Quote from: FiveG on May 19, 2023, 01:20:17 AMforex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.There are bitcoin trading bots you can get and make use of, but that there's no certainty in the result that you may get from this, study also the trading chart, weekly candles, and track the price by speculating well on the moves, learn all the trading patterns and under where each can be applicable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 19, 2023, 03:27:11 PM",
      "body": "You have many ways to trade Bitcoin and on many exchanges.Awesome crypto tradingUse best trading weapons including Stop loss order and Stop limit orderDon't forget to do Dollar Cost Averaging DCA https://dcabtc.com/Trading or DCA for investment, a same reason is to get richer. DCA can help you become richer and it will be more easily than get richer by trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "May 19, 2023, 06:47:27 PM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.It's hard to give a good answer based on your question when you don't tell us which country you're from!even though it is not recommended to use CEX, i agree with the recommendation from @mk4....for an easy exchange option for beginners, Binance is a good choice besides that Kucoin, e-toro and Coinbase can be other options (dyor which one is best for you).  i also heard the news that Binance has exchanges they control in several countries, maybe you can find out what exchanges in your country are partners with Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "May 19, 2023, 06:55:45 PM",
      "body": "Quote from: FiveG on May 19, 2023, 01:20:17 AMFriends, I have download different apps from forex trading and I use most of them trying to trades bitcoin but it seem too difficult and failing, forex indications and signals are not a match when compare to bitcoin so every buys or sells I end up close the market with red lines of loss. I want to know if there is a bitcoin trading apps, that's mainly for trading bitcoin? Like the blockchain but I need local apps or website links. Please assist with good response.Let me make you to understand that you didn't try trading you tried the futures and options based on the statement you provided. Because there are lot of pseudo trading apps available on Play Store and app market which claims that you can make money and all you need to do is to predict the future movement.I consider spot trading is the real trading where you buy a crypto on an exchange let's say Binance and wait until it rise then you sell it so at the end you made profits and this is how the trading works and just learn basics about trading before jumping into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}