{
  "id": "topic_5415662",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "October 02, 2022, 07:01:50 AM",
  "content": "Globally installed crypto ATMs are being impacted by the protracted bear market, geopolitical unrest, a lack of regulatory certainty, and other unanticipated market conditions. News reports state that 796 cryptocurrency ATMs were removed from the global network in September. However, every day, there are around 14 cryptocurrency ATM installations worldwide. Moreover, nations continue to express interest in establishing operational crypto ATMs within their national boundaries. For example, Japan decided to reintroduce crypto ATMs after 2014. The goal is  to set up 50 BTMs across the country by August 2023. I have mixed feelings about this and can't wait for this cycle to end. Read the full story below. QuoteData on net changes of crypto ATM installations confirm that, in September, 796 crypto ATMs were pulled off from the global network. The domino effect of a prolonged bear market seeped into the Bitcoin (BTC) ATM ecosystem as September 2022 recorded negative growth in global net installations for the first time in history — primarily driven by a slowdown in the United States.The total number of Bitcoin ATMs installed over time fell to 37,980 in Sept. from an all-time high of 38,776 ATMs in August — resulting in a drop of -2.05%, as evidenced by data from CoinATMRadar. Data on net changes of crypto ATM installations confirm that, in September, 796 crypto ATMs were pulled off from the global network. The United States alone recorded a reduction of 825 ATMs. However, Europe, Canada and a few other jurisdictions cushioned the downfall with new installations locally.Despite the setback, data based on 60 days suggest that nearly 14 crypto ATMs are being installed globally per day, with Genesis Coin representing a 40.3% share of ATMs among other manufacturers. Other popular crypto ATM manufacturers include General Bytes and BitAccess.The sudden reduction in the crypto ATM installations can be attributed to geopolitical tensions among factors, including lack of regulatory clarity and market uncertainties.What do you think? Will the nearly 14 crypto ATMs being installed globally per day be able to compensate for the 796 crypto ATMs that were pulled off from the global network in September?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415662",
  "comments": [
    {
      "author": "jackg",
      "created_time": "October 02, 2022, 09:43:14 AM",
      "body": "They're likely costly to uninstall (including the costs of the machine as it goes from being active to not).I wonder what's happening with those 800 atms once they get disconnected, they're probably only useful as bitcoin atms so they'll probably come back online elsewhere or maybe at a different time. There was news a large currency exchanger with 3000-4000 machines (from memory) started accepting bitcoin, what if they've taken a lot of the demand here too from other places as machines that might have cheaper rates if they serve other functions too. Perhaps if the companies hosting them have worked out they make a lot more money out of bull markets or more money out of announcing they have crypto atms they'll probably be turned back on in a few years when the next halving is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 02, 2022, 09:51:44 AM",
      "body": "No surprise as even centralized exchange usage drops when in bear markets; that, and add the fact that using online exchanges are far more convenient and overall better(probably besides privacy in some cases) than ATMs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 02, 2022, 10:25:45 AM",
      "body": "First of all, I want to say that the news source is probably one of the worst sources you can find for news related to cryptocurrencies - I wonder why people still promote their links on the forum?The following data may show how insignificant and absurd the news is :According to data from the coinatmradar website, there are currently 38 179 crypto ATMs in 79 countries around the world. Of these, 33 924 ATMs are located in the US&Canada, which means that there are only slightly more than 4000 such devices in the rest of the world, with a note that you cannot find them in 2/3 of the countries. The fact that 796 ATMs have allegedly disappeared means absolutely nothing, because perhaps it is only one operator who has decided to exit such a business, and this month a new one may appear to replace it.As for Japan, they can install 5000 such devices if they want, but the fact is that Bitcoin has never been very interesting to the Japanese, and somehow I doubt that will change. In addition, anyone who wants to buy or sell Bitcoin will certainly not be satisfied when they pay a 10%+ ATM fee, because it was and still is the most expensive way to trade cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 02, 2022, 11:18:29 AM",
      "body": "Could it be re -withdrawn because they decided to put new updates or for any technical reasons and not necessarily be political, financial or organizational?I did not used any bitcoin ATM, but I do not see it as an indication of increasing the alert or increasing/decreasing the proportion of bitcoin acceptance and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "October 02, 2022, 11:44:35 AM",
      "body": "Why won't it !? Let's talk about certain things: 1. Accessibility2. Rates offered Overall I have seen that the rates offered by thr ATM's were not that great thus, given that margin it's easier to actually exchange everything on a wallet that you can download, verify and then use it in seconds to get a better rate. Going to a physical ATM is honestly overrated, it might be wonderful for the emergency or something but at the end of the day its better to do it online. Also they are placed weirdly around the globe they also need to target the areas that would be beneficial for the company as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 02, 2022, 01:01:13 PM",
      "body": "Regulations seems the big problem for Bitcoin ATM, even in my country many startup companies tried to do business with the installation of Bitcoin ATM but every attempt ended as a failure because the government and central bank doesn't really draw a line in most countries about installing of currency machine for public should be issued by which authority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "October 02, 2022, 01:10:20 PM",
      "body": "I believe the growth of crypto debit card such as crypto.com that partners with payment solution company like mastercard and visa contributes on this drop too since crypto user can use a regular ATM machine to withdraw there crypto including Bitcoin in fiat without the need of specific Bitcoin ATM machine. Investment on Bitcoin ATM is too risky because of the competition with the regular ATM that accepts crypto cards for withdrawal. So I believe Bitcoin ATM investors is starting to cutloss and didn't plan to expand more since regular ATM machine can do what they are doing while they are limited only to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 02, 2022, 02:23:54 PM",
      "body": "No worries … Spain has added 3000 ATMs this September where you can acquire bitcoin from, and they’re not even on CoinATMRadar yet … nor should they … they really allow you to purchase a coupon at Euronet ATMs, which you can then redeem through Bitnovo’s website. A two phase purchase as such should not count as bitcoin ATMs, so the said 3K ATMs won’t come to the rescue.On a serious note, it’s essentially impossible to determine why the net amount of bitcoin ATMs dropped by 796 units during September, as the data on CoinATM Radar does not drill-down into the information. Likely it is essentially based in the US, where the net amount decreased by 835 bitcoin ATMs. The best one can do is try to compare the current operators with those from a recent snapshot (11/08/2022). It gives some potential high-level insights, but nothing conclusive:Currently:QuoteTop 10 operators run 26078 crypto ATMs (68.3%). There are 586 other operators, who run 12101 Crypto ATMs (31.7%). On the 11/08/2022:QuoteTop 10 operators run 26983 crypto ATMs (69.5%). There are 605 other operators, who run 11861 Crypto ATMs (30.5%). That means that the top 10 operators have lost 905 ATMs in just under 2 months. Comparing the numbers for the top 10 operators, it seems that Bitcoin Depot went from 6.898 ATMs to 6.420, Coincloud went from 5.520 to 5.162, bearing most of the luggage. There are no further details, so one cannot tell why this has happened, if some of those have been replace by other ATMs from another operator, or anything of the sort. In fact, being the figure that of an overall net amount, one could make wrong assumptions by looking at a small sample of the data as I have done above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VanillaH",
      "created_time": "October 02, 2022, 04:21:44 PM",
      "body": "As a former operator of ATMs, I do not see a bright future for ATMs. (I live in Canada.)They are expensive to buy and you have so many fees to cover that you have to charge an extremely high markup to customers.Depending on the company, the markup ranges from 8 to 20%.And who buys Bitcoin at 8-20% markup? People being scammed and people doing shady business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 02, 2022, 04:55:23 PM",
      "body": "Quote from: Lorence.xD on October 02, 2022, 01:36:15 PMQuote from: Findingnemo on October 02, 2022, 01:01:13 PMRegulations seems the big problem for Bitcoin ATM, even in my country many startup companies tried to do business with the installation of Bitcoin ATM but every attempt ended as a failure because the government and central bank doesn't really draw a line in most countries about installing of currency machine for public should be issued by which authority.They will fail unless the government fully backs them up and given how banks are heavily tied to the government, I don't think that we will see progress that will make Bitcoin ATMs more prevalent in more places. This news of ATM installations going down is a pretty alarming since that means there's probably less confidence to bitcoin.But as per the book of laws the central banks are individual authority not really possessed by the government just like the court of the country so the banks can certainly crumble the start-up companies by taking legal actions against them since every company needs the help of banks so they don't go to extreme situation to fight for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 02, 2022, 04:59:31 PM",
      "body": "I remember that the vast majority of Bitcoin ATMs are in North America, so their distribution and significance has been very unequal for a while. It's important to keep in mind because there are many countries outside North America where Bitcoin is quite highly adopted but ATMs have never been a big thing or a part of that adoption. If we look at it this way, it doesn't seem like it's a big deal that the number of ATMs is dropping. Moreover, ATMs often require high fees, not to mention that making a transaction somewhere in a shop or even on the road where the ATM is can be far less comfortable than calmly doing it at home from a PC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "October 02, 2022, 05:02:50 PM",
      "body": "Could the drastic drop also as a result of the bear period? Between, in a normal circumstance how many people are actually using these ATMs to buy or withdraw on a daily basis? If the % is as high as what I read above, I don't think anyone will be eager to make use of btc atm to buy. That's a complete ripoff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 02, 2022, 05:22:54 PM",
      "body": "There are probably a bunch that were taken down because of this: https://bitcointalk.org/index.php?topic=5410704 and although a patch / fix has been out for weeks are still offline due to the attitude of 'I'll let someone else risk it for a bit' If you were not making a lot of money with your ATMs at the moment due to market conditions due to the possibility of loosing a bunch of funds you may be more wary of turning it back on.I would also think a drop in ATMs is also due to increased competition. I have seen rates drop locally a lot. If you were charging 10% and now your competition is charging 7% you have to drop below that. But, if you are sitting on expensive leases and so on can you make money at 6.5% when BTC is below $20k? Or do you just shut down and walk away. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pumared",
      "created_time": "October 02, 2022, 05:26:31 PM",
      "body": "Normal behavior as demand is low. In short, it's just the law of supply and demand at work. The market is down, with a great tendency to return to the levels of years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Detritus",
      "created_time": "October 02, 2022, 05:39:26 PMLast edit: October 02, 2022, 05:57:07 PM by Detritus",
      "body": "Usually, bear market is a time to buy more and hodl. According to the graph of 'coin ATM Radar data' below, since 2014 there was less crypto ATMs. The bull cycle of 2017/2018 was around 250 net growth per month, so even in this bear cycle, it is X2 better than the previous bull cycle. according to the above data, crypto ATM installations accelerated in 2021 which I think was partly driven by the rising value of the market, which has since plunged in 2022. For instance, Bitcoin dropped from it’s all-time high price of almost $68,000 in November last year by 70%. The asset is struggling to sustain its price above $20,000. I see that Remitano.com also reported about it here on  01/10/2022 same as OP's source.In July, the net growth of ATMs was 572, low when compared to the peak 2,000 in 2021. “However if you compare to the last bull cycle in 2017-2018, there was only around 250 net growth per month. So in the current bear cycle, we are still 2x higher than the previous bull cycle,\"  Forbes.com reportsQuote from: Davidvictorson on October 02, 2022, 07:01:50 AMWhat do you think? Will the nearly 14 crypto ATMs being installed globally per day be able to compensate for the 796 crypto ATMs that were pulled off from the global network in September?In my opinion, I think It will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "October 02, 2022, 05:48:43 PM",
      "body": "Not an unexpected situation if you ask me. Bear markets are a time of much lower trading activity with smart investors buying (but not through ATMs), those who feel like they're at a loss crawling into their shells for winter because they feel like they got cheated by the market and holders keep holding. ATMs are what becomes popular in bull markets when holders take some profit and newbie investors are so hyped up that they don't care about ATM fees, they just want to get some coins ASAP. No worries though, a halving is just a little over year before us. We've been a year into the bear market and there's probably a few months of accumulation before us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beefcake",
      "created_time": "October 02, 2022, 05:55:57 PM",
      "body": "I think bitcoin atms have many headwinds. As already mentioned, they must charge a large markup, so will not be competitive on price. But also I am seeing more and more wallets that incorporate some sort of marketplace. Why would someone drive to an atm when they can buy right from their wallet on their phone? Maybe there are some reasons, but in general I see exchanges more used by traders and institutions, and wallets more for small time retail. This is maybe a simple way of looking at it, but I'm a simpleton anyways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 03, 2022, 09:21:08 AM",
      "body": "Quote from: VanillaH on October 02, 2022, 04:21:44 PM~snip~And who buys Bitcoin at 8-20% markup? People being scammed and people doing shady business. I would say that mainly those who try to avoid KYC buy in this way, but also those who have not yet found out that there is a much cheaper alternative, whether it is CEX or DEX.  As you yourself say, the price of such a device, along with all the costs arising from maintenance, insurance, and paying taxes, does not give the owners too much room to lower fees and be competitive with other players on the cryptocurrency market. However, the number of such devices is constantly increasing, and regardless of the current situation, I think that it will continue, perhaps even at an accelerated pace, considering that more and more people are learning about Bitcoin and want to buy it in one way or another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "October 03, 2022, 09:32:27 AM",
      "body": "Quote from: Lucius on October 03, 2022, 09:21:08 AMQuote from: VanillaH on October 02, 2022, 04:21:44 PM~snip~And who buys Bitcoin at 8-20% markup? People being scammed and people doing shady business. I would say that mainly those who try to avoid KYC buy in this way, but also those who have not yet found out that there is a much cheaper alternative, whether it is CEX or DEX.It was also interesting to me if Bitcoin ATMs have limits for deposit. With regular ATM, in some countries there are monthly limits of 5k for cash deposit, and it is physically impossible to insert a pile of banknotes in ATM whole. 1 Bitcoin, that is $19k or a solid pack of cash. It will take time before you feed all the banknotes to ATM. I am sure that will gonna cause people's interest, when they observe a person inserting banknotes for 10-30minutes without stopping. To that will be first signs of loosing anonymity. Imagine a persons wants to turn shady cash into 5 or 10 BTC...P.S. I just cant imagine a person that wants to turn $10 into BTC will care much about KYC and will go to ATM to lose 8-20%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}