{
  "id": "topic_5444896",
  "title": "DaNNy001",
  "author": "DaNNy001",
  "created_time": "March 14, 2023, 04:19:54 PM",
  "content": "Bitcoin finally climbs 26k and it's definitely looking more like a bullish trend now as many new investors were worried from it massive drop from its 25k to around 19k in the month of March. For me am definitely praying for the price to drop more so I can buy as much bitcoin as I can but the dip always scares some investors but I say the dip is a good sign for me make more from the market as buying low and hodling till the prices go up is definitely more yielding.What's your pick on this. Will March bring more great feats or a massive dip will be experienced after this pump.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444896",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "March 14, 2023, 04:33:15 PM",
      "body": "I think Bitcoin hitting $30,000 by the end of the month is more likely than not.  I also think we may never see below $20K again, but those are always famous last words.  I'm sure we'll see a bit of profit taking before the next leg up, but when we do move up again I believe it will be a strong move that pushes up right against the $30K resistance level. The new bull market has begun and people are getting their seats reserved for the next rocket ride for the moon.  All aboard!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 14, 2023, 04:47:41 PM",
      "body": "What's special about $26k, and it wasn't at $25k or will it be at $28k when it happens? I have written many times that I do not expect a big bull run to happen before the next halving, and I don't think it is happening now. Not too long ago we were at $25k+ and back under $20k again, and who's to say this isn't another bull trap?What is a little strange is that this pump is happening at a time when some US banks are failing, and especially when one of the largest is failing. I watched a program on local TV and in the context of that story, a man commented on the whole situation with the banks with the sentence \"so what were we supposed to do with our money, invest everything in cryptocurrencies?\"Perhaps one of the possible explanations for why the price of BTC is rising is that some have decided to withdraw money from banks and invest in Bitcoin - because banks have proven to be a very bad choice - not only are their interest rates close to zero, but they literally collapse overnight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 14, 2023, 05:02:31 PM",
      "body": "Quote from: DaNNy001 on March 14, 2023, 04:19:54 PMWhat's your pick on this. Will March bring more great feats or a massive dip will be experienced after this pump.I was very surprised that the price was able to break through the 25k mark so quickly. Last time it looked like 25k is a hard limit to break. Well, now we're scratching at 26k. It's kind of unbelievable how quickly prices have changed in the last few weeks. It is currently difficult to say whether the price can be maintained in the long term. I am and remain skeptical about the current price increase and hope it is not just a brief price flare-up that then quickly dries up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Epaper",
      "created_time": "March 14, 2023, 06:03:25 PM",
      "body": "It is difficult to accurately predict how bitcoin price will move throughout the month of March. Of course we hope that the current bitcoin price movement will continue to rise, at least it can reach above $30k until the end of March. Therefore, let's see how far the current movement continues, whether the current price will continue or be corrected again from the current price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "March 14, 2023, 06:47:48 PM",
      "body": "I can't still believe we are heading to 30k after long stagnation between 19k to 25k, possibly this month will be a very favorable month for bitcoin to leave the level of 25k. Nevertheless let just keep our crossed to watch over the market because most at times it's very hard to determine the price movement, this might likely be a bear trap so as trader you need to very smart and watchful while trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "March 14, 2023, 06:51:33 PM",
      "body": "Yeah it broke through the main bottom of the market resistance in the $25,000s. It's back down at mid-$25k (edit: as I was writing this it dropped $500 lol so now it's back at $25,000) now but I think in a few days the Fed will do just a 25 point interest raise and I could see that pushing it firmly back over this resistance range and the bottom of the market will be over. Definitely could see $30k in the next few weeks. Though unlike past breakouts of the bottom of the bear market there are still economic issues that will hold Bitcoin back a bit, but that's probably good so that we don't get like what happened in 2019 where it shot from $4k to $13k and the market way overreached itself coming off the bottom and then we got 6 months of gradually going back down.But yeah things are looking good for Bitcoin price now and I expect we'll see further upside soon and $30k fairly soon as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "March 14, 2023, 07:21:27 PM",
      "body": "Quote from: DaNNy001 on March 14, 2023, 04:19:54 PMFor me am definitely praying for the price to drop more so I can buy as much bitcoin as I can but the dip always scares some investors but I say the dip is a good sign for me make more from the market as buying low and hodling till the prices go up is definitely more yielding.Your prayer has been granted.Coming from the top of $26k for this day, it's now come down to $24,500. And that's not stopping there because I saw it from $24,700 and that's likely the correction is being done.While your prayer has been granted, it's now time for you to decide whether that will be the prices that you'll buy. Because for me, that's where I'll start DCAing again as very likely that it'll be up again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "March 14, 2023, 07:26:03 PM",
      "body": "Quote from: Adbitco on March 14, 2023, 06:47:48 PMI can't still believe we are heading to 30k after long stagnation between 19k to 25k, possibly this month will be a very favorable month for bitcoin to leave the level of 25k. Nevertheless let just keep our crossed to watch over the market because most at times it's very hard to determine the price movement, this might likely be a bear trap so as trader you need to very smart and watchful while trading.$26k was expected to be broken during 2023 but now it has. Even higher prices are predicted before the end of the year, eg $30k - $40k is possible, but we can expect a correction to find new support.I'm even expecting $30k to be broken in April as I'm not sure March will ever hit that. But of course today's fantastic increase has made my day more enjoyable after in the previous week it was in a sharp decline. Yes, let's hope that $ 25k can survive this March, even though now bitcoin is corrected to $ 24.7k. Yes, let's hope that $ 25k can survive this March, even though now bitcoin is corrected to $ 24.8k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "March 14, 2023, 07:43:45 PM",
      "body": "Quote from: ShowOff on March 14, 2023, 07:26:03 PMQuote from: Adbitco on March 14, 2023, 06:47:48 PMI can't still believe we are heading to 30k after long stagnation between 19k to 25k, possibly this month will be a very favorable month for bitcoin to leave the level of 25k. Nevertheless let just keep our crossed to watch over the market because most at times it's very hard to determine the price movement, this might likely be a bear trap so as trader you need to very smart and watchful while trading.$26k was expected to be broken during 2023 but now it has. Even higher prices are predicted before the end of the year, eg $30k - $40k is possible, but we can expect a correction to find new support.I'm even expecting $30k to be broken in April as I'm not sure March will ever hit that. But of course today's fantastic increase has made my day more enjoyable after in the previous week it was in a sharp decline. Yes, let's hope that $ 25k can survive this March, even though now bitcoin is corrected to $ 24.7k. Yes, let's hope that $ 25k can survive this March, even though now bitcoin is corrected to $ 24.8k.Of all the fud that has surfaced in the media, it felt like $30k in Q1 of 2023 is too early but it seems we are going that way. I don't wanna keep my hopes too high.But if the price will climb a little further to $30k soon and then it's really a healthy market to accumulate some BTC if experimentation just works. Sometimes the market just climbs very fast leaving those who are hoping to make some traders losing more sats instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "March 14, 2023, 08:14:10 PM",
      "body": "Well $26K didn't last long! Now back at $25K. But it's a good start. This is now the third time $25K resistance has been tested so it can only be getting weaker with less sellers each time.Despite the rejection from new yearly high, a new high weekly close in 5 days time could be the bullish confirmation needed. Still not convinced the 200 WMA is the resistance as it wasn't back in July last year, but more so the 50 WMA that's currently around $23.1K. So there's still some room for maintaining a bullish structure by turning 50 WMA old resistance into new support for example even if $25K is lost short-term.Regardless of the price action, the sentiment seems quite bullish at the moment, which should help to push prices higher in the the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "March 14, 2023, 08:16:34 PM",
      "body": "Quote from: Epaper on March 14, 2023, 06:03:25 PMIt is difficult to accurately predict how bitcoin price will move throughout the month of March. Of course we hope that the current bitcoin price movement will continue to rise, at least it can reach above $30k until the end of March. Therefore, let's see how far the current movement continues, whether the current price will continue or be corrected again from the current price.The market has seen a rapid upside in recent times, so a correction is expected for another healthy uptrend. It is true that Bitcoin price is difficult to predict, but Bitcoin price is also connected to financial markets. So if there is a change in the financial conditions of the world, it will also affect the price of Bitcoin. Achieving the $30k target is now the most important to understand the next trend. But it remains to be seen whether this target can be achieved in the short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "March 14, 2023, 09:52:17 PM",
      "body": "Quote from: Epaper on March 14, 2023, 06:03:25 PMIt is difficult to accurately predict how bitcoin price will move throughout the month of March. Of course we hope that the current bitcoin price movement will continue to rise, at least it can reach above $30k until the end of March. Therefore, let's see how far the current movement continues, whether the current price will continue or be corrected again from the current price.As of the moment we’ve seen a slight correct after hitting the price of $26k but I think this is just a temporary dump and later on Bitcoin will totally break that level and can even reach the price of $30k. There will be no big corrections because its about time to rise again and Bitcoin is doing it already. Fortunately we didn’t dump that much lower than $19k, or else it will boost bear market again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "March 14, 2023, 10:20:16 PM",
      "body": "Quote from: DaNNy001 on March 14, 2023, 04:19:54 PMBitcoin finally climbs 26k and it's definitely looking more like a bullish trend now as many new investors were worried from it massive drop from its 25k to around 19k in the month of March. For me am definitely praying for the price to drop more so I can buy as much bitcoin as I can but the dip always scares some investors but I say the dip is a good sign for me make more from the market as buying low and hodling till the prices go up is definitely more yielding.What's your pick on this. Will March bring more great feats or a massive dip will be experienced after this pump.Lots had made out some long position on the time it did break out that $25k price point and reached up 26 which we do have those kind of thoughts that it might be already the start of bullrun or would go directly into hitting up that $30k but here we are once again on which we are playing around 24k where the price had bumped into the ceiling once again or had been rejected as we do say.I cant blame out to those people who had really those positive thoughts on shooting up on the price but well this is how this market behaves where prices could make out some short pumps and then it do corrects itself.One things for sure that there are lots of selling pressure on 25k point which it is really that something simple to be breached or having those breakouts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "March 14, 2023, 10:28:30 PM",
      "body": "That's while we don't need to be more curious or worried when bitcoin price drop to certain points, its obvious that theirs every possibility that bitcoin price will fall again after recovery from this recent falls, so nobody can predict the movements of bitcoin or the price of Bitcoin, it might reach tomorrow we see bitcoin on thirty five thousand (35k), so the predictions of bitcoin is not dependable because it can take another measure in any point in time, either negative measure or positive measure, so those of us that panic to sell have to understand the norms of bitcoin regulations before panicking or been curious to sell out their during small signs of bearish market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "March 14, 2023, 10:29:32 PM",
      "body": "Finally, after waiting for people, Bitcoin settled at $26.4k. A lot of people were worried when Bitcoin dropped back to $19,000. But to end all people's thoughts very quickly Bitcoin ended people's thoughts by standing at $26k after a long time. But OP you missed an opportunity again. Maybe the bitcoin market will go down but you may have to wait for a long time. But anyway you have no choice but to wait. Or invest from the instant market and wait for a long time, surely the market will grow. And within this month of March, it may take position within $30k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "March 14, 2023, 11:25:52 PM",
      "body": "Its about time, its good to see Bitcoin on this level again but let’s not get too excite as the price drops again maybe part of the profit taking of the whales but after this, I expect for the price to continue its uptrend. Bitcoin will be great this year, I’m very optimistic about this in preparation for the real bull run next year, doing DCA patiently and effectively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "March 14, 2023, 11:42:03 PM",
      "body": "Quote from: DaNNy001 on March 14, 2023, 04:19:54 PM(...)What's your pick on this. Will March bring more great feats or a massive dip will be experienced after this pump.Breaking Bitcoin above $23,000 earlier was already a sign for me that we will see $25,000.But something better happened, it broke the $26,000 level. So for me, the next stop or resistance that will be tested is $30,000. For sure before this month will end, we will attempt to test the $30,000 level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "March 14, 2023, 11:46:19 PM",
      "body": "Quote from: DaNNy001 on March 14, 2023, 04:19:54 PMBitcoin finally climbs 26k and it's definitely looking more like a bullish trend now as many new investors were worried from it massive drop from its 25k to around 19k in the month of March. For me am definitely praying for the price to drop more so I can buy as much bitcoin as I can but the dip always scares some investors but I say the dip is a good sign for me make more from the market as buying low and hodling till the prices go up is definitely more yielding.What's your pick on this. Will March bring more great feats or a massive dip will be experienced after this pump.I think it's great to see the price reaching $26k, but it's too early to celebrate, because as quickly as we go to that price, we are not going back below $25k. So for me, the big resistance is still in front of us, we need to really maintain that $25k level to really make a break out run this March.Otherwise, all the hardwork that the bulls did will be nothing. So again, let's wait, still in the middle of this month and there are a lot of things that can happen. We don't look ahead of like $30k or more, the big test is $25k and so far we are still way below it. But in any case, you need to wait for the price to go low this month, your chances to stock pile might have gone already, as we might be around $22k as the lowest support in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stedsm",
      "created_time": "March 14, 2023, 11:49:22 PM",
      "body": "The only reason I see BTC breaking $26k is that the investors who were worried with their money in the banks of SVB and Silvergate, they started taking out their money from there and they are definitely one of the major reasons why all the resistances got broken in BTC and it crossed above $26k. However, a correction is definitely going to take place so don't be overconfident as well as go bullish till bears are done with their furious dance on the charts. I don't think they're exhausted, it's just that all this was to liquidate shorts at an extreme level as you can see that over a billion dollar shorts were liquidated after this continuous rally by BTC during the past 3 days. I don't think that BTC will stop here but as said, markets have been very surprising and anything could happen as US Dollar has got news today regarding Retail Sales and PPI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}