{
  "id": "topic_5472562",
  "title": "Zoomic",
  "author": "Zoomic",
  "created_time": "November 02, 2023, 10:33:52 AM",
  "content": "Do you know that  Signature Campaign  is an invention of bitcointalk.org?I didn't know before now. I had thought that signature campaign is something that has been in practice even before creating the bitcointalk forum. But I was surprised to discover otherwise. I searched the internet for ways to earn bitcoin. Many blogs including binance news acknowledged that signature campaign is a means to earn bitcoin and it was started or it is exclusive for bitcointalk forum. Even 99bitcoins said a similar thing.This is nice to know that apart from the Bitcoin - Pizza event, HODL typo error incident, there are other things that emanated from the bitcointalk forum.So, apart from here in bitcointalk, has any other forum or website adopted the signature campaign system of advertisement?Does theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472562",
  "comments": [
    {
      "author": "_act_",
      "created_time": "November 02, 2023, 10:47:24 AM",
      "body": "The only site that I have seen something like this are altcoinstalks.com, and this Russians forum, cryptotalk.org. Both sites copied it on this forum. Signature campaign started on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 02, 2023, 10:55:07 AM",
      "body": "Wrong, kiba was the person who start it in this forum. There are many forums that allow their user to use their own signature. Phpbb is one of the example and it exist since 2000, earlier than this forum.It started when an user want to rent his signature space, maybe since there's a feedback when this user wear the project signature, then other project start a signature campaign.Signature campaign is popular in Bitcointalk because this forum might be the most successful.Quote from: xtraelv on June 30, 2018, 04:28:12 AMSignature campaigns started much earlier.March 10, 2011 [POST]First Signature Advertising Auctionhttps://bitcointalk.org/index.php?topic=4342.0June 12, 2011,[BCT] First signature campaign.https://bitcointalk.org/index.php?topic=15886.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "November 02, 2023, 10:58:15 AM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AMDo you know that  Signature Campaign  is an invention of bitcointalk.org?It is not so. At least about 15 years ago I already used to get a reward for placing advertisement in my signature on some forums. It was a time when SEO links were very actual, so many were very motivated in advertising via pass-through links. It was different, because the amount of already left posts mattered and it was less important how active you are at the moment. But well, I was paid for advertisement in my signature. Of course there was no BTC at that moment, so we got the reward in USD and much less than projects pay for it at the moment. But I first found it much earlier than came on bitcointalk.org and even earlier than bitcointalk.org first appeared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "November 02, 2023, 11:03:26 AM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AMDo you know that  Signature Campaign  is an invention of bitcointalk.org?It is not an invention of Bitcointalk.The signature space can be disabled by theymos anytime. The signature campaign industry in Bitcointalk can be stopped anytime by theymos.QuoteI didn't know before now. I had thought that signature campaign is something that has been in practice even before creating the bitcointalk forum. But I was surprised to discover otherwise. I searched the internet for ways to earn bitcoin. Many blogs including binance news acknowledged that signature campaign is a means to earn bitcoin and it was started or it is exclusive for bitcointalk forum. Even 99bitcoins said a similar thing.You are discussing two different things.Signature campaigns to earn bitcoin.Signature campaigns to earn income, not in bitcoin.If it is to earn bitcoin, I am so sure Bitcointalk is a first place to have it because Bitcointalk is a Bitcoin forum, created by the Bitcoin creator, founder. You can not find other places to earn it, before Bitcointalk.If it is to earn income, not in bitcoin, you can find other places, other forums.BBCode was invented in 1998, long before Bitcoin and Bitcointalk.A first offer to pay forum members in bitcoin is in 2011 with auctions, then became more popular in 2013.[WTB] Buying your signature space, paying 0.1 BTC require: 50+ posts per monthHistory - signature campaigns and bounties on BitcointalkEvolutionof signature ad campaigns (beginning days to the present)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "November 02, 2023, 11:45:20 AM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AM..Does theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.That's a crazy greedy idea mate. Do you really think it is possible to patent paid signature campaigns in a forum? It's like having the sole right for athletes to wear logos and other printed advertisements on their attires. So millions of athletes worldwide need to contact the person with the rights in order to ask permission or pay fees? Even the invention of medicines can be copied after a period of time to push for cheaper and affordable generic medicines, otherwise, poor people and countries will be deprived. You need to change your mindset mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 02, 2023, 11:55:15 AM",
      "body": "https://99bitcoins.com contains many articles that were written without review or background about the topic, and relying on them as a reference will lead you to wrong conclusions.Although signature campaigns are considered a good way to advertise, for a long time they were associated with spam and many old members tried to either ignore everyone wearing these signatures or even ban some accounts from joining until the merit system came in, which helped reduce spam.Without developing yourself and learning, you will find that making a profit from your signature will become more difficult until it becomes impossible due to the tightening of restrictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "November 02, 2023, 12:01:44 PM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AMDoes theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.Do you think all people are like faketoshi to try and slide a patent some where just to claim ownership? I heard there is a site paying for posts/content, it was posted on project development board, something called stacker.news, you can spread the words and gather as many as you can to attack that site with some constructive content.😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahzadafzal",
      "created_time": "November 02, 2023, 12:07:20 PM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AMDo you know that  Signature Campaign  is an invention of bitcointalk.org?I didn't know before now. I had thought that signature campaign is something that has been in practice even before creating the bitcointalk forum. But I was surprised to discover otherwise. I searched the internet for ways to earn bitcoin. Many blogs including binance news acknowledged that signature campaign is a means to earn bitcoin and it was started or it is exclusive for bitcointalk forum. Even 99bitcoins said a similar thing.That's not entirely true, but if you are talking about earning bitcoins through signature campaigns, then yes, Bitcointalk was one of the earliest platforms to introduce them. However, signature campaigns themselves have a history dating back to the early days of online forums.I remember that back in the days when vBulletin was a popular forum software, it also featured signature options. Of course, users weren't earning money from these signatures, but there were campaigns and promotions involving signatures.Quote from: Zoomic on November 02, 2023, 10:33:52 AMThis is nice to know that apart from the Bitcoin - Pizza event, HODL typo error incident, there are other things that emanated from the bitcointalk forum.Yes, not only these terms, but many other significant developments originated on Bitcointalk. For example, Ethereum was first announced on Bitcointalk, and MtGox, one of the earliest bitcoin exchanges, also had its beginnings here. The idea of ICOs (Initial Coin Offerings) and token sales also gained popularity through discussions on BitcointalkQuote from: Zoomic on November 02, 2023, 10:33:52 AMSo, apart from here in bitcointalk, has any other forum or website adopted the signature campaign system of advertisement?Does theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.Seriously? Why would theymos do that? It's important to understand that Bitcoin thrive on decentralization and openness. The beauty of signature campaigns (or it used to be  ) is that it promotes community engagement, spread awareness, and provide opportunities for forum members. Introducing patents and exclusive rights would go against the very principles that Bitcoin stands for. So, no, theymos having a patent for signature campaigns is highly unlikely and would not be in the best interest of the Bitcoin community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 02, 2023, 12:12:40 PM",
      "body": "Quote from: jokers10 on November 02, 2023, 10:58:15 AMAt least about 15 years ago I already used to get a reward for placing advertisement in my signature on some forums.Most forums I know don't allow to earn money from your signature. It's meant for personal things, although it could include your own website.What makes Bitcointalk unique, is the level of freedom we get. Of course, it also helps that the forum owns $40M. Most other forums rely on advertising, and advertising in signatures would compete with the forum's own income. Bitcointalk doesn't have that problem.Quote from: Zoomic on November 02, 2023, 10:33:52 AMSo, apart from here in bitcointalk, has any other forum or website adopted the signature campaign system of advertisement?I haven't seen it, and even if it existed, I'd expect it to pay much less.QuoteDoes theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.From what I've seen, theymos prefers freedom instead of restrictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "November 02, 2023, 12:49:18 PM",
      "body": "Quote from: LoyceV on November 02, 2023, 12:12:40 PMQuote from: Zoomic on November 02, 2023, 10:33:52 AMSo, apart from here in bitcointalk, has any other forum or website adopted the signature campaign system of advertisement?I haven't seen it, and even if it existed, I'd expect it to pay much less.Payment depends on the amount of exposure and competitions between competitors. This forum has enough monthly traffic to convince advertisers spending their money. The campaign mangers are also doing great works in making the signature campaign more demand-able.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "November 02, 2023, 01:04:06 PM",
      "body": "Quote from: BitcoinGirl.Club on November 02, 2023, 12:49:18 PMQuote from: LoyceV on November 02, 2023, 12:12:40 PMQuote from: Zoomic on November 02, 2023, 10:33:52 AMSo, apart from here in bitcointalk, has any other forum or website adopted the signature campaign system of advertisement?I haven't seen it, and even if it existed, I'd expect it to pay much less.Payment depends on the amount of exposure and competitions between competitors. This forum has enough monthly traffic to convince advertisers spending their money. The campaign mangers are also doing great works in making the signature campaign more demand-able. That's right, but the payment rates depend on average on the market. When is was SEO motivated people could get pass-through links on other sites for several bucks, so the most SEO attractive forums could bring you the same amount maximum. Of course, like LoyceV said, it was not on every forum, many added rel=nofollow tags on signatures, so you could earn on your signature mainly on the forums which wanted more content which would be paid this way. All those forums are dead already because that era of mega popular SEO links is over more than a decade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "November 02, 2023, 01:10:16 PM",
      "body": "Quote from: digaran on November 02, 2023, 12:01:44 PMQuote from: Zoomic on November 02, 2023, 10:33:52 AMDoes theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.Do you think all people are like faketoshi to try and slide a patent some where just to claim ownership? I heard there is a site paying for posts/content, it was posted on project development board, something called stacker.news, you can spread the words and gather as many as you can to attack that site with some constructive content.😉I have seen such a thread in the development board but it is not close to what the bitcointalk has. It was even imitating the algorithm of Reddit where people receive Satoshis instead of upvotes. I do not think that it is a project that will make waves Quote from: LoyceV on November 02, 2023, 12:12:40 PMQuote from: jokers10 on November 02, 2023, 10:58:15 AMAt least about 15 years ago I already used to get a reward for placing advertisement in my signature on some forums.Most forums I know don't allow to earn money from your signature. It's meant for personal things, although it could include your own website.Jokers10, good to know your experience that you have earned through signature about eleven years ago even when bitcoin wasn't invented. Oc Tradism said about it that bitcointalk could only be the first if it is about bitcoin earning that that has been signature campaigns which paid in USD.Quote from: LoyceV on November 02, 2023, 12:12:40 PMWhat makes Bitcointalk unique, is the level of freedom we get. Of course, it also helps that the forum owns $40M. Most other forums rely on advertising, and advertising in signatures would compete with the forum's own income. Bitcointalk doesn't have that problem.Did you say the forum owns $40M? How did this money come? From forum earnings through advert or from donations. Is there any address where this fund is kept, I want to check it out on the Blockchain.Quote from: LoyceV on November 02, 2023, 12:12:40 PMQuoteDoes theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.From what I've seen, theymos prefers freedom instead of restrictions.You said about this freedom in my other thread. I understand very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "November 02, 2023, 01:45:26 PM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AMDo you know that  Signature Campaign  is an invention of bitcointalk.org?I didn't know before now. I had thought that signature campaign is something that has been in practice even before creating the bitcointalk forum. But I was surprised to discover otherwise. I searched the internet for ways to earn bitcoin. Many blogs including binance news acknowledged that signature campaign is a means to earn bitcoin and it was started or it is exclusive for bitcointalk forum. Even 99bitcoins said a similar thing.In my opinion, the concept of signatures is not only available on the bitcointalk site. I once joined a local community site that probably used the same CMS as bitcointalk and had a signature feature under posts. However, in my local forum there is no signature campaign so the signature space is usually filled with words of wisdom or promos about products/servicesI assume the emergence of this signature campaign is because the bitcointalk site is a large forum so many companies want to advertise their products here, but because the bitcointalk forum does not provide advertising space, the trick to being able to continue advertising on this forum is to rent signature space from forum members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "November 02, 2023, 02:08:36 PM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AMDoes theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.Adding a promotional ad or anything to the profile signature on the forum has always existed. That is, since forum scripts like SMF, Phpbb, ... were created. A suitable ground for making campaigns out of it is Bitcoin and the simplicity of paying many participants while keeping everything \"anonymous\".Imagine how complicated it would be for a biker forum to introduce a signature promotion/campaign. Which payment method would they choose?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "November 02, 2023, 02:25:36 PM",
      "body": "Quote from: Zoomic on November 02, 2023, 10:33:52 AMDo you know that  Signature Campaign  is an invention of bitcointalk.org?I didn't know before now. I had thought that signature campaign is something that has been in practice even before creating the bitcointalk forum. But I was surprised to discover otherwise. I searched the internet for ways to earn bitcoin. Many blogs including binance news acknowledged that signature campaign is a means to earn bitcoin and it was started or it is exclusive for bitcointalk forum. Even 99bitcoins said a similar thing.I didn't know that the forum signature campaign originated on Bitcointalk. It's a bit conflict of interest in their business because they also have their own advertisements. In a signature campaign, advertisers don't pay Bitcointalk; instead, the campaigners and their managers are the ones paid. Yet, Bitcointalk allows it because it brings in more users, which increases site traffic. It was a smart move.Quote from: Zoomic on November 02, 2023, 10:33:52 AMThis is nice to know that apart from the Bitcoin - Pizza event, HODL typo error incident, there are other things that emanated from the bitcointalk forum.I can't compare these two things. The pizza event in the past became widely popular worldwide, while the signature campaign is known to only a few people.Quote from: Zoomic on November 02, 2023, 10:33:52 AMSo, apart from here in bitcointalk, has any other forum or website adopted the signature campaign system of advertisement?Does theymos have a patent for signature campaign such that no other forum can replicate what is happening here without his permission.I only know about Cryptotalk. It's a campaign that was run by Yobit before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 02, 2023, 02:42:45 PMLast edit: November 02, 2023, 03:01:48 PM by Don Pedro Dinero",
      "body": "Quote from: freedomgo on November 02, 2023, 02:25:36 PMI didn't know that the forum signature campaign originated on Bitcointalk. Apparently you can't read either, or I don't know which is worse: you didn't feel like reading the few comments in the thread where it is clearly shown that it is based on a false supposition, since they didn't originate here:Quote from: jokers10 on November 02, 2023, 10:58:15 AMQuote from: Zoomic on November 02, 2023, 10:33:52 AMDo you know that  Signature Campaign  is an invention of bitcointalk.org?It is not so. Quote from: OcTradism on November 02, 2023, 11:03:26 AMIt is not an invention of Bitcointalk.Quote from: shahzadafzal on November 02, 2023, 12:07:20 PMThat's not entirely true, but if you are talking about earning bitcoins through signature campaigns, then yes, Bitcointalk was one of the earliest platforms to introduce them. However, signature campaigns themselves have a history dating back to the early days of online forums.freedomgo, I don't know who your manager is, but I hope he doesn't pay you to write posts on page 1 without reading the comments. On the other hand, I don't see much point in keeping this thread open, let alone on meta, because it's already clear that what the OP says is false.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 02, 2023, 02:50:57 PMLast edit: November 02, 2023, 03:12:28 PM by Solosanz",
      "body": "Quote from: Don Pedro Dinero on November 02, 2023, 02:42:45 PMQuote from: OcTradism on November 02, 2023, 11:03:26 AMIt is not an invention of Bitcointalk.I don't know who your manager is, but I hope he doesn't pay you to write posts on page 1 without reading the comments. Chill dude, the guy isn't even wear a signature Quote from: Don Pedro Dinero on November 02, 2023, 03:01:30 PMFreedomgo doesn't wear a signature? I thought you were saying to all users you quoted, but yeah now I understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 02, 2023, 03:01:30 PM",
      "body": "Quote from: Solosanz on November 02, 2023, 02:50:57 PMQuote from: Don Pedro Dinero on November 02, 2023, 02:42:45 PMQuote from: OcTradism on November 02, 2023, 11:03:26 AMIt is not an invention of Bitcointalk.I don't know who your manager is, but I hope he doesn't pay you to write posts on page 1 without reading the comments. Chill dude, the guy isn't even wear a signature Freedomgo doesn't wear a signature? I think I'll edit the last sentence to make it clear amidst all the quotes. Although I think it was pretty clear from the context, if you read it carefully. First I tell Freedomgo that he hasn't read the comments, then I put the comments he hasn't read and finally I tell him that I hope his manager doesn't pay him to write without even reading the comments on the first page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "November 02, 2023, 03:42:31 PM",
      "body": "The signature space was available on some forums before Bitcointalk but only a few members were able to get any deals from advertisers and the pay on those forums was are very limited back then. I believe it's Bitcointalk that changed advertisers perception about the signature space and allowed users to earn good income by applying the advertisers signature on their signature space.I think the management about signature campaigns started from this forum because back then advertisers used to directly contact the users in order to rent their signature space. But, these days thanks to the managers who have made the work easier for the advertisers as well as for the members, the advertisers don't have to find the members directly and the tiring work is done by a manager.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}