{
  "id": "topic_5458995",
  "title": "ustc-erc20",
  "author": "ustc-erc20",
  "created_time": "July 07, 2023, 04:45:17 PM",
  "content": "Please help.I have USTC on ERC20 chainNo  exchanges support this anymore.Exchanges only support USTC on terra chain.  I need to get my USTC on the terra chain so I can sell it.I tried the terra bridge and it does not help   please helpthanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458995",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "July 07, 2023, 06:57:24 PM",
      "body": "I check on the list-exchange.It's on dex exchange as well, If you have struggled with the cex why not tried to use (dex) in Ethereum-network. Example, like (Uniswap) I see on the coinmarketcap USTC (Telegram-community) are still online.There has some admin on there, could be you asking these to them. So, you get a better support assistance ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ustc-erc20",
      "created_time": "July 07, 2023, 08:56:21 PM",
      "body": "I tried many things. I am totally stuck. I don't know where to go.I used trust wallet dex 1inch and then it gets stuck and I have to revoke permission. I tried metamask dex and it  gets stuck also and I have to revoke permission.I tried all the central exchanges and they only use USTC on terra rails.Can you tell me a place that works.  I want to sell my USTC on ERC20 RAILSORI want to move my USTC off ERC20 RAILS and put it on terra rails.I tried classic-bridge.terra.money and that does not work either.   I will send you a $10 DOGE tip for your help.thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "July 07, 2023, 09:08:09 PM",
      "body": "Quote from: ustc-erc20 on July 07, 2023, 08:56:21 PMI tried many things. I am totally stuck. I don't know where to go.I used trust wallet dex 1inch and then it gets stuck and I have to revoke permission. I tried metamask dex and it  gets stuck also and I have to revoke permission.I tried all the central exchanges and they only use USTC on terra rails.Can you tell me a place that works.  I want to sell my USTC on ERC20 RAILSORI want to move my USTC off ERC20 RAILS and put it on terra rails.I tried classic-bridge.terra.money and that does not work either.   I will send you a $10 DOGE tip for your help.thanks.I just made a little search on CMC and noticed it was listed in several centralized exchange and decentralized exchange as well. https://coinmarketcap.com/currencies/terrausd/#Markets Please careful go through it to choose the best market that would work fine for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ustc-erc20",
      "created_time": "July 10, 2023, 03:22:50 PM",
      "body": "i looked at your link andIt's on many exchanges on TERRA rails only.that does not help.  No one has USTC on ERC20 RAILS.How can I move my USTC off ERC20 RAILSand onto terra rails so I can sell it.  After I get it on terra rails I can sell it easy with binance  or many other exchanges.please helpthanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ustc-erc20",
      "created_time": "July 10, 2023, 03:46:15 PM",
      "body": "please helpI just want to move USTC off of ERC20 railsand onto TERRA rails.No exchanges accept USTC on ERC20 RAILS. no one.All the exchanges only have  deposit  addresses on terra rails NOT ERC20 RAILS.Is there a consultant I can pay for help?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 10, 2023, 04:06:04 PM",
      "body": "Try looking for other bridges, I'm sure you can find a relevant offer. USDT in the Terra network is quite a rare stablecoin for centralized exchanges, so you should only hope for decentralized exchangers here. Try searching in the topic Chains & Bridges, there are a lot of services and networks provided there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "July 10, 2023, 04:18:10 PM",
      "body": "Quote from: ustc-erc20 on July 10, 2023, 03:46:15 PMplease helpI just want to move USTC off of ERC20 railsand onto TERRA rails.No exchanges accept USTC on ERC20 RAILS. no one.All the exchanges only have  deposit  addresses on terra rails NOT ERC20 RAILS.Is there a consultant I can pay for help?  USTC is trading on Osmosis blockchain which you can bridge your ERC20 tokens to Osmosis using Gravity Bridge. You can read the tutorial on gravity bridge using this tutorial link https://support.osmosis.zone/tutorials/bridging-with-gravity-bridge.USTC is trading on multiple on Osmosis chain. Use Dexscreener app or website to get the list of pairs on DEX of different blockchain. It's better than using coinmarketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ustc-erc20",
      "created_time": "July 18, 2023, 09:46:45 AM",
      "body": "So I need to first move USTC off ERC20 rails toosmosis rails using gravity Bridge which is inside the  K wallet? ? ? How do I Pay for this rail change? pay with ETH on erc20 rails?or do I need to buy another token topay for this first step?thanks I loaded the K wallets with my seed and do notsee USTC on ERC20 rails",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ustc-erc20",
      "created_time": "July 18, 2023, 10:30:09 AM",
      "body": "I tried satellite.money but the pair is not available to swap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 18, 2023, 02:35:42 PM",
      "body": "Quote from: ustc-erc20 on July 18, 2023, 10:30:09 AMI tried satellite.money but the pair is not available to swapHow did you end up with that?You are going to get scammed if you are not careful.Try using instant swap exchanges like1. https://simpleswap.io2. https://stealthex.io3. https://swapspace.coThis is not an endorsement of the above platforms. DYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ustc-erc20",
      "created_time": "July 18, 2023, 10:03:51 PM",
      "body": "they do not accept USTC on ERC20 railsonly on terra rails.my USTC is stuck o  erc20 rails and no one takes it.can I pay someone to change rails for me?or pay for good directions that a noob can follow",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "July 19, 2023, 07:56:23 AM",
      "body": "Quote from: ustc-erc20 on July 18, 2023, 10:03:51 PMthey do not accept USTC on ERC20 railsActually swapspace do accept USTC on ERC20 chain although I've never use this site to exchange my coin.Did you get a warning message or something else when you try to swap your USTC?I'm not really sure how to change the chain network, usually I use bestchange to get the best rate of chain conversion, but when I check about USTC coin, there's no suggestion on their site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}