{
  "id": "topic_5435580",
  "title": "malik2233",
  "author": "malik2233",
  "created_time": "January 17, 2023, 03:14:24 PM",
  "content": "Hello guys,I work for an auction house in Switzerland we only sell watches and are looking to add crypto payments for our clients. Im looking for suggestions on what provider I should use as there are so many I looked into bitpay but im a bit overwhelmed. Any suggestions would be appreciated",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435580",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "January 17, 2023, 03:18:44 PM",
      "body": "Quote from: malik2233 on January 17, 2023, 03:14:24 PMAny suggestions would be appreciatedTry BTCpay server if you are accepting only Bitcoin. You don't need to pay transaction fees to anyone. A very cheaper option. I have no idea who to suggest if you are going to accept other currency. Coinpayments is definitely not a good option. They are fucking expensive and eat a lot of fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 17, 2023, 03:25:57 PM",
      "body": "Check this list[1]. Suggestions:If you want, any to avoid any kind of restrictions, holding of payments for some reason, waiting for weekly/monthly payments, fixed/dynamic fees, in short any kind of problems towards the processors, use self-hosted payment processor such as BTCpay Server.Well, since self-hosted processor requires development, and probably will take time to develop which is a bit an issue to others for some reasons and choose those payment processor services that require fees per transactions then i'll suggest blockonomics and coinpayments.Others:I never experienced other processors yet (including btcpay server but its the most recommend one so i include it) other than what i have mentioned above so i cant say about them.[1] https://github.com/alexk111/awesome-bitcoin-payment-processors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 17, 2023, 03:35:53 PM",
      "body": "Quote from: malik2233 on January 17, 2023, 03:14:24 PMAny suggestions would be appreciatedIt depends a lot whether you want to receive at the end of the day bitcoin or fiat. Then it depends a lot whether you want it implemented locally by some IT technician or you want to just use pretty much out-of-the-box.The cleanest solution is BTCPay. But for that you'll receive bitcoin and that needs installed/configured. However, this is what most will recommend (including myself).If you want to receive fiat, or you want to not need skilled specialist and local hardware/hosting for it, then the option is the commercial solutions.The problem is that they come with fees and KYC, hence not really \"loved\". Even more, the most known commercial solution, BitPay, has a history of supporting more an altcoin (BCH, which they even advertise as \"the real bitcoin\"), sometimes even imposing even higher fees for Bitcoin (but I have old information on this and I don't know whether it's outdated or not).Afaik other big players like Coinbase or Binance may have similar solutions (but I don't know for sure).I expect KYC and maybe some extra fees too are not a big issue for your buyers, still, you'll have to find out which service has the required reputation (this is against not a problem if you go for BTCPay).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malik2233",
      "created_time": "January 17, 2023, 04:06:40 PM",
      "body": "Thanks for the fast reply guys BTCPAY looks good but too answer Neuroticfish we would like the crypto transferred into fiat and we would like the option to accept more then just Bitcoin.We have IT guys working for us so anything that needs to be configured wont be an issue. So what would you suggest when it comes to these commercial options? which one has the lowest fees and at least a few cryptos to choose from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 17, 2023, 06:32:16 PM",
      "body": "As a company, they don't really have the choice to convert the bitcoins to fiat. It's not only a matter of accounting if you think about it.To @malik2233The fees usually goes around 0.5-1%, so you won't find a huge difference about it. All that matter is the options they have to integrate their payment system to your platform, the cryptos avalaible to use, OFAC restrictions, etc..Check out Strike, Coinbase commerce, Open node, bitpay... there are many, but bitpay and coinbase are perhaps the most popular amoung business owners",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 17, 2023, 11:40:15 PM",
      "body": "Quote from: malik2233 on January 17, 2023, 04:06:40 PMwe would like the crypto transferred into fiat and we would like the option to accept more then just Bitcoin.We have IT guys working for us so anything that needs to be configured wont be an issue. So what would you suggest when it comes to these commercial options? which one has the lowest fees and at least a few cryptos to choose from.Check the link i have shared[1], these are the processors who require business kyc information and have the option to convert crypto to fiat, most of accept multiple crypto payments, fees just <=1% per transaction. AI seconded Coinbase and Bitpay too for the list. You can included coingate, coinspayments, these two have ann thread here iirc.[1] https://github.com/alexk111/awesome-bitcoin-payment-processors#custodial",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malik2233",
      "created_time": "January 18, 2023, 09:33:05 AM",
      "body": "thx for all the help guys do you guys know if any accept usdt?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "January 18, 2023, 10:55:32 AM",
      "body": "Quote from: malik2233 on January 18, 2023, 09:33:05 AMthx for all the help guys do you guys know if any accept usdt?Most of the popular ones mentioned above support USDT, or other stablecoins if you're interested. Just check their about page if you're unsure, or use a search on Google with simple keywords like \"Coinpayments accept USDT\" to see if they accept them or not. Self-hosted BTC payment gateway usually only supports BTC though, CMIIW.As for detailed fee comparison, I think you'll have to compare it yourself if you want some in-depth analysis. I found some simple comparisons online but the information is usually outdated, and most users here would probably use BTCPayserver anyway. You can probably find this thread useful too[1]. Some posts on that thread have good suggestions if you want to look further, but keep in mind that most of these are BTC payment processors, so you have to check manually check them to see if other cryptos are available or not.[1] Bitcoin Payment Processors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bnbstorm",
      "created_time": "January 21, 2023, 10:20:07 PM",
      "body": "Quote from: malik2233 on January 17, 2023, 03:14:24 PMHello guys,I work for an auction house in Switzerland we only sell watches and are looking to add crypto payments for our clients. Im looking for suggestions on what provider I should use as there are so many I looked into bitpay but im a bit overwhelmed. Any suggestions would be appreciatedAs others have added already about btcpay servers and other 3rd party. I would like to include Blockchain V2 payment API. It is free for now and you can ready more about it here. https://www.blockchain.com/explorer/api/api_receive",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malik2233",
      "created_time": "January 24, 2023, 10:10:06 AM",
      "body": "Thanks again for all the help guys I created a Utrust and bitpay account for my company but im interested in adding a BTCpay server option would it be possible to have the funds converted into fiat with BTCpay?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "January 24, 2023, 11:42:01 AM",
      "body": "Quote from: malik2233 on January 24, 2023, 10:10:06 AMwould it be possible to have the funds converted into fiat with BTCpay?You can refer to the docs provided by BTCPay server. For example, you can refer to this guide[1]. I'll just quote what they said here:QuoteCurrently, BTCPay Server is a processor without fiat conversion capabilities out of the box. ....However, a fiat conversion plugin is available for BTCPay Server. Since merchants are always the owners of their private keys, they can always freely convert their coins manually, but for now there's no instant-fiat conversion. More info on the Transmuter.Source: https://docs.btcpayserver.org/BTCPayVsOthers/#fiatYou can use Transmuter to automatically sell your BTC if that is what you need. There is a guide on their GitHub page[2]. Try to set it up and if you find difficulties you can always ask here or just commission someone to do it for you. Alternatively, you can also just manually sell your BTC once per week or so. CMIIW.[1] https://docs.btcpayserver.org/BTCPayVsOthers/#fiat[2] https://github.com/btcpayserver/btcTransmuter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}