{
  "id": "topic_5488373",
  "title": "Mokemokk",
  "author": "Mokemokk",
  "created_time": "March 11, 2024, 01:08:24 AM",
  "content": "I have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5488373",
  "comments": [
    {
      "author": "GreenInk",
      "created_time": "March 11, 2024, 01:41:47 AM",
      "body": "Do you remember liberty reserve?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ancafe",
      "created_time": "March 11, 2024, 03:07:26 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think? If you haven't started investing yet, do it now because if you keep waiting, you will never move to start. Verify your finances well and make a portion of the money for investment or to meet your living needs, so that it won't cause financial problems when you want to invest. You have known this forum for a long time, but you haven't learned to understand current developments so you are left behind in terms of age on the forum because now there are many people who are involved in investing even though they are younger.It's never too late as long as you want to do it and all you need to do is make a responsible investment portion. Some people don't have a stable source of income making it difficult for them to invest but there is a way if they want to do it. Study the DCA strategy and do several studies to bring you complete knowledge before investing because there are many people who just force it without knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "March 11, 2024, 03:28:35 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI want your advice for me. I just want to say that it's never too late to get started with bitcoin and cryptocurrency. We are still in the early stages and opportunities still abound for us, what matters is how long you stay in the market, not how early or late you enter. Because even if you bought bitcoin 10 years ago, I bet you wouldn't have been able to hold it until now. And to be able to survive the longest in the market, you need to have knowledge about it, so I recommend that besides investing, you should spend time learning and researching the market carefully. That way you can survive and make a profit from it, but if you  invest only because of Fomo, then sooner or later you will lose money and leave the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 11, 2024, 03:33:48 AM",
      "body": "There's no point saying you've known Bitcoin ahead of others if you failed to believe in it. Or you probably just heard about Bitcoin but not really know it or understand it, because if you did know and understand Bitcoin back then, you would have bought some.As others are saying, we all buy Bitcoin at a price we deserve. You can go ahead and buy now. It's not anymore as cheap as it was in 2014 but there's still a lot of room for the price to grow. Personally, I'm convinced that $100,000 will be reached within the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverCryptoBullet",
      "created_time": "March 11, 2024, 04:32:59 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMIt is late, but the opportunity is always there. I know that many people suffer from what I suffer from.If you did not invest your money, you did not get any loss. It means you did not suffer anything, you only miss good opportunities in the past but did not lose anything!QuoteMany people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think?You knew about Bitcoin since 10 years ago, now you return to say it is late but opportunity is always there.So what is advice you need?I believe yo know what you should do already.I believe you knew about Bitcoin Spot ETFs in USA. They only joined this market since January 2024, are they late?You can start your investment in Bitcoin like those Bitcoin Spot ETFs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "March 11, 2024, 04:38:38 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think?It's not a crime to not know about cryptocurrencies in 2014 or even today. But it's definitely a serious thing to think about if you haven't invested even after knowing about it and after seeing upward momentum bitcoin has shown since then. I personally had a nice desktop PC back in 2009 which I could have used to mine Bitcoin at that time. But I didn't and that's when I missed a chance of being a millionaire. But I don't regret it and I jumped right back on when it was feasible for me. My only advice is that you need to start investing in Bitcoin and also you need to do dollar cost averaging by investing in various timestamps and dates. That will give you a better buying price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 11, 2024, 04:56:46 AM",
      "body": "Quote from: GreenInk on March 11, 2024, 01:41:47 AMDo you remember liberty reserve?This was out in 2010 or sometime around then. Back in 2014 we had plenty of exchanges like MtGox, Poloniex, Bitfinex, etc.As for the OP, congrats on coming back. Sure it would of been wise to invest in bitcoin in 2014 for $200 or buy the ETH ico around the same time but we all have investing regrets.I mined so many ETH all thru 2016 to 2017 and sold it all when ETH broke $20. Later in the year it went to $1100. No way could I predict that since when I mined it, it was $10 or so. $1100 an ETH made no sense and most never held until then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "March 11, 2024, 05:22:06 AM",
      "body": "You shouldn't need to ask about the investment potential of Bitcoin, if you have known about it for the past 10 years. You can see how the value of Bitcoin is increasing and its adoption is increasing - this proves how great Bitcoin's potential is in the future. It's never too late to start investing in it. Just start with a smaller amount and invest regularly, try doing that for the next few years and you will definitely be able to get a profit from your investment. Moreover, you already have high hopes for it, so it shouldn't be difficult for you to start investing in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "March 11, 2024, 05:32:58 AM",
      "body": "I have been around, since before 2014 and I have pulled the trigger on buying bitcoin, before it went crazy. Unfortunately I got greedy when the price went above $18 000 per coin and I sold the majority of my cheap coins. I have bought some more coin since then, but at a much higher price, so my profit on those coins will be much lower. The most valueble thing I have gain is not money, but rather a wealth of new knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "March 11, 2024, 06:05:21 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI want your advice for me. You don't need our advice, you need to make decisions for yourself. You got to know bitcoin in a year when many of us would have liked to have known about it, and you did nothing. Just as you have done nothing about it to date other than open this thread. You're on your own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uhwuchukwu53",
      "created_time": "March 11, 2024, 07:01:05 AM",
      "body": "Quote from: Don Pedro Dinero on March 11, 2024, 06:05:21 AMQuote from: Mokemokk on March 11, 2024, 01:08:24 AMI want your advice for me. You don't need our advice, you need to make decisions for yourself. You got to know bitcoin in a year when many of us would have liked to have known about it, and you did nothing. Just as you have done nothing about it to date other than open this thread. You're on your own. Your very correct advice with you not setting your heart towards it is waste of time ,you hear people say about opportunity come but once  mist time is reality, it's very risky not to take a risk, what you did not make happen will not take place advice without decision is like pushing a horse to a River but can't force it to Drink water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kingperry22",
      "created_time": "March 11, 2024, 07:02:27 AM",
      "body": "This thread solely reminds me of myself. i read the whitepaper of BTC in 2008 by never moved an inch. it's crazy how I started calling a friend Satochi in 2010 but never thought about it.Then, 2013 came and I was looking for opportunities to acquire free BTC which I was told i could get after performing online tasks. To my dismay i didn't take that seriously either 🤦🏿The sudden surge in 2016 broke my heart from $8k to $28k. i thought it was all a hoax that it going to encounter regulation issues but it never did. fast forward to today, it is going for $78k and still haven't gotton but i am more than determined that this time around i will get mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solokan",
      "created_time": "March 11, 2024, 07:22:45 AM",
      "body": "You have known Bitcoin since 2014, of course at that time it was a good opportunity for you to invest in Bitcoin because the price was still cheap and of course people who have known Bitcoin since then and invested until now have certainly made big profits. But of course, now it's not too late to invest in BTC because the Bitcoin halving hasn't started yet and the bull run is still a long way off, namely the bull run is predicted to be around 2025.If you like this forum, I'm grateful and indeed this forum has many benefits because here there are many people who are great in their knowledge about Bitcoin. If you are interested in investing, of course you can start now or you can also wait for the Bitcoin price to correct. However, there are also many people who use the DCA system, but you need to remember that investing in BTC is certainly not free from risks, so you have to be prepared for the risks and only money that you are ready to lose is worth putting in Bitcoin.I think many people have known about BTC longer than you, but they were not at all interested in Bitcoin until now and actually you are a lucky person because you are interested in investing in BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "March 11, 2024, 07:27:04 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think?If given a chance of learning bitcoin back in 2014/ for sure i have invested in 2017(at least 3 years after because like me I have just started learning in couple of years from yours and just started investing in 2019 in which almost late from the 2017 bull.________________________________________Advise? start investing more now, don't let those 10 years be gone again because you have already learn your lessons now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "March 11, 2024, 07:44:29 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think?It's dangerous and risk if you invest in bitcoin when you have not know the usefulness of bitcoin, even though you know bitcoin know that should prompt you to invest in bitcoin, what you should consider mostly for bitcoin investment should be the understanding of the methods of how bitcoin works.....some people today who castigated bitcoin when the awareness of bitcoin was started, they are same people who praise bitcoin...but my advice is that, don't invest in bitcoin because someone make profit out of it, learn and invest so when you loss for your investment you will not blame anyone.Quote from: Iranus on March 11, 2024, 03:28:35 AMQuote from: Mokemokk on March 11, 2024, 01:08:24 AMI want your advice for me. I just want to say that it's never too late to get started with bitcoin and cryptocurrency. We are still in the early stages and opportunities still abound for us, what matters is how long you stay in the market, not how early or late you enter. Because even if you bought bitcoin 10 years ago, I bet you wouldn't have been able to hold it until now. And to be able to survive the longest in the market, you need to have knowledge about it, so I recommend that besides investing, you should spend time learning and researching the market carefully. That way you can survive and make a profit from it, but if you  invest only because of Fomo, then sooner or later you will lose money and leave the market. We have to understand the basics thing of cryptocurrency mostly bitcoin before we invest, many people today hate bitcoin because they lose for its investment, and the main point that makes them not to lose for the investment is due they are unable to learn and understand the procedures...actually their is no time you come into investment that is not proper, because its a continuous process investment, the thing is we should know the proper time to enter the market of cryptocurrency.Quote from: Darker45 on March 11, 2024, 03:33:48 AMThere's no point saying you've known Bitcoin ahead of others if you failed to believe in it. Or you probably just heard about Bitcoin but not really know it or understand it, because if you did know and understand Bitcoin back then, you would have bought some.As others are saying, we all buy Bitcoin at a price we deserve. You can go ahead and buy now. It's not anymore as cheap as it was in 2014 but there's still a lot of room for the price to grow. Personally, I'm convinced that $100,000 will be reached within the year.  op should know that bitcoin price is rotational and no time you start investing in bitcoin that is late, what matters is to know when bitcoin will fall and when it will rise, so that you will not invest at the wrong time, depending the kind of investment the person or the investor what to establish..theirs know them you invest in bitcoin is useless.. according to you, if you notice bitcoin know is not late because price continue to spin neither to upper level or a lower level Quote from: avikz on March 11, 2024, 04:38:38 AMQuote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think?It's not a crime to not know about cryptocurrencies in 2014 or even today. But it's definitely a serious thing to think about if you haven't invested even after knowing about it and after seeing upward momentum bitcoin has shown since then. I personally had a nice desktop PC back in 2009 which I could have used to mine Bitcoin at that time. But I didn't and that's when I missed a chance of being a millionaire. But I don't regret it and I jumped right back on when it was feasible for me. My only advice is that you need to start investing in Bitcoin and also you need to do dollar cost averaging by investing in various timestamps and dates. That will give you a better buying price.  the mistake many who coming now to cryptocurrency especially bitcoin alway make is that, at of the time they know bitcoin they will not invest but after some year and they are still hearing that someone is profitable in cryptocurrency or bitcoin investment  it's the that many of them will think of bitcoin investment, so in above my explanation I have said it that theirs no time you invest in bitcoin is wrong time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AirtelBuzz",
      "created_time": "March 11, 2024, 07:44:51 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think? Investments should be based on one's own wishes and not on the advice of others. Since you have known about Bitcoin and other cryptocurrencies since 2014, you should invest now without delay.If you started your investment from the time you mentioned you would have become a billionaire investor by now just investing in Bitcoin.Today Bitcoin price touched another new all-time high Bitcoin price is currently above 71 thousand dollars. If I had been connected to this forum since 2014 like you, maybe I would have started my bitcoin investment since then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "March 11, 2024, 07:50:51 AM",
      "body": "Quote from: AirtelBuzz on March 11, 2024, 07:44:51 AMQuote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think? Investments should be based on one's own wishes and not on the advice of others. Since you have known about Bitcoin and other cryptocurrencies since 2014, you should invest now without delay.If you started your investment from the time you mentioned you would have become a billionaire investor by now just investing in Bitcoin.Today Bitcoin price touched another new all-time high Bitcoin price is currently above 71 thousand dollars. If I had been connected to this forum since 2014 like you, maybe I would have started my bitcoin investment since then. Exactly , this is our money and who will show concern about that? of course it is only us and others will just give us temporary advises .and also OP seems to be a bright person upon reading his post so I believe that he knows what to do , maybe added words is what he is asking from us in this post .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "March 11, 2024, 08:06:25 AM",
      "body": "I know this forum late 2013 and joined early 2014, but never really started buying until late 2015. Like you, I believed in cryptocurrencies but never bothered to touch it because my fear of the risks outweighed logical thinking back then. I wasn't earning much before, and had my investments fail, I would have just wasted time and money. Nevertheless, I still followed my instincts and began putting in small amounts every time I receive my paycheck. It's never too late to invest in bitcoin. You can still create a sizeable portfolio through DCA. You don't have to buy coins outright if your wallet can't afford it, but you can buy little bits and pieces and it adds up eventually. 10 years is a long time to not do anything. Hopefully this time you get the initiative to do something about your positivity towards bitcoin and cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "March 11, 2024, 08:11:27 AM",
      "body": "Quote from: Mokemokk on March 11, 2024, 01:08:24 AMI have known Bitcoin and other currencies since 2014, but I did not move a finger. I did not benefit from anything. I mean, I did not invest anything now. I am serious. I liked this forum a lot. A long time ago, I decided to start investing, even if it was a small amount, in some other currencies. Perhaps it would go up significantly and make profits. Perhaps I would. It is late, but the opportunity is always there. I know that many people suffer from what I suffer from. Many people now talk about Bitcoin, but I preceded them in knowing it by ten years. I want your advice for me. I have high hopes for digital currencies. What do you think?Investing in bitcoin is never too late. If you want the event of bitcoin at a low price, then a sudden bull run will never happen again. Yes,  there are still bull runs happening in bitcoin. You just have to find your way of knowing what and when is the right time to invest in bitcoin. You can do a DCA, wherein you buy a portion of bitcoin at the right price at the right time and then wait for the price of bitcoin to increase, just as you brought bitcoin. An example of this is what is happening right now in bitcoin, where it already surpasses its ATH. Take note that this is only a preparation for the actual bull run, meaning we are just accumulating bitcoin assets, and due to demand, the price of bitcoin keeps on increasing, so is investing too late? No, because if you can take the risk and enter the market, you might experience bullishness and earn from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}