{
  "id": "topic_5471199",
  "title": "MusaMohamed",
  "author": "MusaMohamed",
  "created_time": "October 22, 2023, 10:04:39 AM",
  "content": "It's about 185 more days till a 2024 Bitcoin halving.Bitcoin Block Reward Halving Countdown gives you an estimation and it is not completely correct but you can use its estimated date for the halving. It's not important to know when is a halving date because knowing the halving block is enough.It will happen at the block 840000.QuotePast halving event datesThe first halving event occurred on the 28th of November, 2012 (UTC) at block height 210,000The second halving event occurred on the 9th of July, 2016 (UTC) at block height 420,000The third halving event occurred on the 11th of May, 2020 (UTC) at block height 630,000A chart that breaks down Bitcoin history price to past halving cycles (4-year cycles).I don't mind about reasons for a next bull run because market will have many 'reasons' to rise during a big bull run with parabolic curve but I quote some idea in the tweet.Quote#Bitcoin is going to $100k here is why - - Honda now accepts Bitcoin & Crypto Payments- Elon Musk calls fiat currencies a S-C-A-M- Tesla reveals none of its $312 Million Bitcoin was sold in Q3 2023.- Ferrari now accepts Crypto payments for its Car- Hong Kong officially launches its first Bitcoin  & Crypto trading platform.- Less than 5% of the global population is invested in Crypto (we are soo early)- Japan's largest investment bank Nomura launches Bitcoin fund for institutional investors- Coinbase receives regulatory approval to offer perpetual futures to international retail customers- Coinbase receives full operating License in Singapore- There are Only 21 Million Bitcoins- Bitcoin Halving in less than 180 days- Bitcoin Supply Shock Incoming- Bitcoin Bears still waiting for $12kThe funny idea is \"Bitcoin Bears still waiting for $12k\". I don't wait for that price but if you knew the March 2020 crash, will $12k be seen in 2024 before a halving with some bad news to shock the market?Don't exclude that risk and don't use leverage to Long Bitcoin because if you use leverage, open a Long position, you will be forced liquidated in such crash.Will this time be different when Bitcoin broke $30,000 resistance? Let's see.That Bitcoin Bull wants to see a big bull run as soon as possible but I don't expect too early bull run this year. He even tried to borrow something in textbook (Bump & Run Reversal Bottom pattern) to convince us that a bull run is very closely to start..Before a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.If you are a witness in a big bull run but you lose access to your wallets, it's damn terrible.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471199",
  "comments": [
    {
      "author": "Russlenat",
      "created_time": "October 22, 2023, 10:12:22 AM",
      "body": "I've taken all the basic steps to secure my wallet, and now I'm gearing up to stack some Bitcoin for the upcoming bull run. This part can be a bit tough, especially with that sneaky greed creeping in. I don't have a ton to invest, so my plan is to put a little in every week and let it sit until the bull run hits. Then, I might consider selling some when we reach a new ATH.What do you think will be the new ATH, is $100k a very conservative estimate only? Or can it go  as high as $300kish....?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "October 22, 2023, 10:15:28 AMLast edit: October 22, 2023, 11:07:53 AM by Mr.suevie",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMBefore a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.If you are a witness in a big bull run but you lose access to your wallets, it's damn terrible.Obviously yes, the halving currently is the most expected thing in the crypto space although the main event actually comes after the halving which is the bull run and I think saving your coins in a wrong or faulty wallet would be least of many holders because obviously from the first instance of saving your holding journey, you would have been saving it in a wallet that is secure to your best of knowledge and you starting to have doubt now just makes the whole thing kinda stupid don't you think,I think the major problem is knowing when to sell off during this expected bull run because the halving is not the main event in expectation, the bull season or run that comes after it is the major thing and alot of Bitcoin users sell off their coins at the wrong time during this period, maybe they sold too or early or sold too late .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "October 22, 2023, 10:48:23 AM",
      "body": "I think the focus shouldn't solely be on wallets when it comes to the bull run. It's all about knowing when to sell at the right time. We're all eagerly waiting for the bull run to rake in those sweet profits. This doesn't apply to those who just HODL; they're in it for the long haul and might have to sit through several bull run cycles before cashing in.Now, for those planning to sell during the bull run, it's crucial not to let greed get the best of you. Predicting the ATH is tough, so when you see good profits, don't hesitate to pull the trigger. It all comes down to having a game plan in place before the bull run starts. Right now, it's the buying phase. Sure, Bitcoin's price may have climbed a bit, especially if you didn't snag it during a dip. But since Bitcoin is expected to hit a new ATH during the bull run, the current price still offers a good chance to turn a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "October 22, 2023, 10:56:27 AM",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMIt's about 185 more days till a 2024 Bitcoin halving.185 days might be an opportunity for me to keep trying to collect every satoshi in preparation for Bullrun. The more I collect, the more opportunities I have to make a profit during the bull run.Maybe if within 185 days there is a decline in the price of BTC this could be a golden opportunity to make purchases and increase your Bitcoin savings.Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMBefore a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.If you are a witness in a big bull run but you lose access to your wallets, it's damn terrible.This storage wallet is very important and needs to be considered for storing Bitcoin assets. I do not recommend storing large amounts of BTC on exchange wallets. I myself store BTC in a hardware wallet.Quote from: Ziskinberg on October 22, 2023, 10:48:23 AMI think the focus shouldn't solely be on wallets when it comes to the bull run. It's all about knowing when to sell at the right time. To be able to get maximum results, perhaps a technical analysis is needed which can provide an overview of the point level by level where we can sell BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "October 22, 2023, 11:10:21 AM",
      "body": "More than half of this post is a chart and price speculation, so I think probably this thread should be moved to speculation. And as for 'prepare for Bitcoin bull run' I thought the discussion will be about should we buy more bitcoin immediately start from today, or should we wait until we actually see an obvious and significant bull run? Currently I still wait for a significant bull run (the price jump right now is not included imho), but I really want to hear from others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 22, 2023, 11:11:44 AM",
      "body": "There are not a lot to prepare for, because the Halving usually only have a little impact on the price. You will see a slight increase in the run up to the Halving and then it will be all over. This small spike in the price are linked to the increased media attention that this event are giving to Bitcoin. I use my wallet almost every day, so I always have access to it... but I will have to shift some coins from cold storage, if the affect on the price are significant this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 22, 2023, 11:33:48 AM",
      "body": "Good highlights why we should experience bull run bitcoin to possibly break out another ATH, but we should also consider that whatever said about bitcoin can be subjected as speculation and sometimes we say a speculative words can be taken as a probability statement which may likely happened or not. But one thing for sure is that bitcoin will record another great new level of price come next year 2024, then also know that for one to be prepared about the next bull run we should hold enough bitcoin in our custody otherwise you could be left out as a story teller who doesn't have any portion of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "October 22, 2023, 12:07:30 PM",
      "body": "Quote from: lombok on October 22, 2023, 10:56:27 AMQuote from: MusaMohamed on October 22, 2023, 10:04:39 AMIt's about 185 more days till a 2024 Bitcoin halving.185 days might be an opportunity for me to keep trying to collect every satoshi in preparation for Bullrun. The more I collect, the more opportunities I have to make a profit during the bull run.Maybe if within 185 days there is a decline in the price of BTC this could be a golden opportunity to make purchases and increase your Bitcoin savings.If you rely on history, the bull season will not come immediately when the halving takes place, but after the halving takes place, it will take us a while longer to activate the bull season. So if things repeat, you will have more than 185 days to accumulate bitcoin for the next bull season. But if something unexpected happens like some recent predictions that we will have a bull season before the halving then the time for accumulation is very limited. No one knows what will happen, so take advantage of every possible moment, don't wait for the price to drop further or believe that the bull season is still far away and hesitate to buy bitcoin. Buying now is always best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoinpoly",
      "created_time": "October 22, 2023, 01:07:16 PM",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMIt's about 185 more days till a 2024 Bitcoin halving.Bitcoin Block Reward Halving Countdown gives you an estimation and it is not completely correct but you can use its estimated date for the halving. It's not important to know when is a halving date because knowing the halving block is enough.It will happen at the block 840000.QuotePast halving event datesThe first halving event occurred on the 28th of November, 2012 (UTC) at block height 210,000The second halving event occurred on the 9th of July, 2016 (UTC) at block height 420,000The third halving event occurred on the 11th of May, 2020 (UTC) at block height 630,000A chart that breaks down Bitcoin history price to past halving cycles (4-year cycles).https://pbs.twimg.com/media/F84CvIpa8AAIJy9?format=jpg&name=900x900I don't mind about reasons for a next bull run because market will have many 'reasons' to rise during a big bull run with parabolic curve but I quote some idea in the tweet.Quote#Bitcoin is going to $100k here is why - - Honda now accepts Bitcoin & Crypto Payments- Elon Musk calls fiat currencies a S-C-A-M- Tesla reveals none of its $312 Million Bitcoin was sold in Q3 2023.- Ferrari now accepts Crypto payments for its Car- Hong Kong officially launches its first Bitcoin  & Crypto trading platform.- Less than 5% of the global population is invested in Crypto (we are soo early)- Japan's largest investment bank Nomura launches Bitcoin fund for institutional investors- Coinbase receives regulatory approval to offer perpetual futures to international retail customers- Coinbase receives full operating License in Singapore- There are Only 21 Million Bitcoins- Bitcoin Halving in less than 180 days- Bitcoin Supply Shock Incoming- Bitcoin Bears still waiting for $12kThe funny idea is \"Bitcoin Bears still waiting for $12k\". I don't wait for that price but if you knew the March 2020 crash, will $12k be seen in 2024 before a halving with some bad news to shock the market?Don't exclude that risk and don't use leverage to Long Bitcoin because if you use leverage, open a Long position, you will be forced liquidated in such crash.Will this time be different when Bitcoin broke $30,000 resistance? Let's see.https://pbs.twimg.com/media/F8-1vhHawAAOpLP?format=png&name=900x900That Bitcoin Bull wants to see a big bull run as soon as possible but I don't expect too early bull run this year. He even tried to borrow something in textbook (Bump & Run Reversal Bottom pattern) to convince us that a bull run is very closely to start.https://pbs.twimg.com/media/F89H-eqbsAA0ngG?format=jpg&name=900x900.Before a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.If you are a witness in a big bull run but you lose access to your wallets, it's damn terrible.OP it might interest you to know that at this point we should be ready for not only the halving but also the aftermath of the halving. The expected bull run might not come immediately after the halving and that’s why we need a long term strategy on how to survive within the crypto space. What I will advice is that everyone should try and do what works for them! Some are very good at spot trading while some are good at futures trading, the only people who might seems left out are people who really don’t understand the volatility of the crypto market and therefore they can’t really carry out any analysis. But nevertheless they can also utilize latest advance features in the crypto space to make their own long term profit such as the Copy trading and Bot trading of Bitget exchange and some other advance features.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "October 22, 2023, 01:09:10 PM",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMIt's about 185 more days till a 2024 Bitcoin halving.I find myself also preparing for it by cutting down on my expenses to make sure that I have enough in BTC to be in profit when bitcoin finally surges. The economy is tougher now demanding more expenses and higher bills, so if you do not plan and execute daily based on budget yo will not have enough money to spare for investment in bitcoins. I am also preparing for the bull run by trying secure my bitcoins the more because I know that there will be many people who are looking for peoples own to steal for themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "October 22, 2023, 01:17:05 PM",
      "body": "Quote from: DanWalker on October 22, 2023, 12:07:30 PMQuote from: lombok on October 22, 2023, 10:56:27 AM185 days might be an opportunity for me to keep trying to collect every satoshi in preparation for Bullrun. The more I collect, the more opportunities I have to make a profit during the bull run.Maybe if within 185 days there is a decline in the price of BTC this could be a golden opportunity to make purchases and increase your Bitcoin savings.If you rely on history, the bull season will not come immediately when the halving takes place, but after the halving takes place, it will take us a while longer to activate the bull season. So if things repeat, you will have more than 185 days to accumulate bitcoin for the next bull season. But if something unexpected happens like some recent predictions that we will have a bull season before the halving then the time for accumulation is very limited. No one knows what will happen, so take advantage of every possible moment, don't wait for the price to drop further or believe that the bull season is still far away and hesitate to buy bitcoin. Buying now is always best.Yes, it's still just a prediction of whether it will happen or not, let time decide. It's true what you say, before the bull season occurs, it's an opportunity to make purchases. For traders and long-term investors, the current price is relatively cheap and there are some people who say that the value of BTC is still undervalued.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "October 22, 2023, 01:24:07 PM",
      "body": "In some cases, I've already shifted a portion of my funds to an exchange to be more responsive when encountering a bearish market. Yes, I do keep them in a private wallet as well, but the issue of delayed transactions can arise at any time, which means dust attacks like the recent ones can happen again unexpectedly. This could be quite bothersome during longer transaction waiting times, so I believe moving a portion of my funds to the exchange is a step forward.The Bitcoin halving and the potential Bitcoin ETF are truly moments that could usher in significant changes, and missing out on these opportunities could leave lasting regrets if they materialize. Waiting for the next bearish market might make it easier for me to acquire some Bitcoin before the true bullish run commences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "October 22, 2023, 01:27:46 PM",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMThe funny idea is \"Bitcoin Bears still waiting for $12k\". I don't wait for that price but if you knew the March 2020 crash, will $12k be seen in 2024 before a halving with some bad news to shock the market?Not so sure in the bear market before the 2024 halving the price dropping as low as $12K is not in my mind although nothing is impossible, in reality it is too improbable with the onslaught of negative news that will shock the entire market.Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMBefore a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.Yes this is important, it is always good to check wallet access with scale to make sure you can access it.Only keep one backup hardware wallet.Some use hot wallets but not for the long term.Looking forward to that challenge, how the market reaction happens, I have to be ready to see all that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 22, 2023, 01:42:01 PM",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMIt's about 185 more days till a 2024 Bitcoin halving.Bitcoin Block Reward Halving Countdown gives you an estimation and it is not completely correct but you can use its estimated date for the halving. It's not important to know when is a halving date because knowing the halving block is enough.It will happen at the block 840000.QuotePast halving event datesThe first halving event occurred on the 28th of November, 2012 (UTC) at block height 210,000The second halving event occurred on the 9th of July, 2016 (UTC) at block height 420,000The third halving event occurred on the 11th of May, 2020 (UTC) at block height 630,000A chart that breaks down Bitcoin history price to past halving cycles (4-year cycles).I don't mind about reasons for a next bull run because market will have many 'reasons' to rise during a big bull run with parabolic curve but I quote some idea in the tweet.Quote#Bitcoin is going to $100k here is why - - Honda now accepts Bitcoin & Crypto Payments- Elon Musk calls fiat currencies a S-C-A-M- Tesla reveals none of its $312 Million Bitcoin was sold in Q3 2023.- Ferrari now accepts Crypto payments for its Car- Hong Kong officially launches its first Bitcoin  & Crypto trading platform.- Less than 5% of the global population is invested in Crypto (we are soo early)- Japan's largest investment bank Nomura launches Bitcoin fund for institutional investors- Coinbase receives regulatory approval to offer perpetual futures to international retail customers- Coinbase receives full operating License in Singapore- There are Only 21 Million Bitcoins- Bitcoin Halving in less than 180 days- Bitcoin Supply Shock Incoming- Bitcoin Bears still waiting for $12kThe funny idea is \"Bitcoin Bears still waiting for $12k\". I don't wait for that price but if you knew the March 2020 crash, will $12k be seen in 2024 before a halving with some bad news to shock the market?Don't exclude that risk and don't use leverage to Long Bitcoin because if you use leverage, open a Long position, you will be forced liquidated in such crash.Will this time be different when Bitcoin broke $30,000 resistance? Let's see.That Bitcoin Bull wants to see a big bull run as soon as possible but I don't expect too early bull run this year. He even tried to borrow something in textbook (Bump & Run Reversal Bottom pattern) to convince us that a bull run is very closely to start..Before a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.If you are a witness in a big bull run but you lose access to your wallets, it's damn terrible.Oh yes I am. I make sure that I store them in a cold storage and backups are in offline while anticipating for the Bitcoin halving. I still regret that time when I let go of my Bitcoin in 2020 before it broke the then all-time high of almost $20k. I started DCA around mid-2022 for both Bitcoin and Ethereum with my extra “not beer” money. Although I do not expect much from the upcoming Bitcoin halving, but let’s just hope that this would turn things around for the entire market to go bull run again like what we have experienced last 2021. Always be prepared for the unexpected happenings and acknowledge the results no matter what. We just don’t know what would be another big catalyst for the next bull run these days aside from the Bitcoin halving. Maybe an approved ETF by Blackrock and the other pending ones? Time will tell as this could be very interesting in this space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 22, 2023, 01:46:43 PM",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMBefore a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.If you are a witness in a big bull run but you lose access to your wallets, it's damn terrible.It is certain that not everyone will sell their bitcoin in this coming bitcoin halving. Some people have plans to sell their Bitcoin in the next 8 or 10 years, but for those who already have the interest to sell their Bitcoin during the bull market, they are already getting prepared for the bull market. But there's one mistake that some people will make during the forthcoming bull market: some people might quickly rush to sell their coins once they see Bitcoin trading around $90k, and if the price spikes to $150k, then they will begin to regret why they did not hold for so long. There's a commonly known strategy of investing in Bitcoin known as the DCA, so I advise that anyone who is selling during the bull market should also sell in fractions. Never sell all your holdings at once because you don't know if the price will still go above what you have sold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wend",
      "created_time": "October 22, 2023, 01:58:39 PM",
      "body": "Quote from: MusaMohamed on October 22, 2023, 10:04:39 AMBefore a 2024 halving, you must make your preparation for it.Checking your wallet. Do you still have access to your wallet?Making some wallet backups.Storing backups safely.Be ready for a 2024 and 2025 bull run with usable wallets.If you are a witness in a big bull run but you lose access to your wallets, it's damn terrible.Bitcoin is a precious asset with great value, so it's not just because bull season is approaching that we have to check it on a regular basis. Instead, we should check them regularly even during bear season or bull season because they are assets that will bring us huge wealth or profits in the future. If someone is a holder then I think they already have the safest method for their bitcoins and don't need anyone to remind them. What I care about is that bull season is approaching and how many bitcoins we already own, that's the worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "October 22, 2023, 02:12:26 PM",
      "body": "Quote from: Russlenat on October 22, 2023, 10:12:22 AMWhat do you think will be the new ATH, is $100k a very conservative estimate only? Or can it go  as high as $300kish....?If we will follow the pattern base on the previous cycle. X2 of the previous ATH is the minimum target to be considered as ATH which around 130K+ but 100$ will probably a strong resistance since many traders will setup on that price level as target sell price since it’s a round number that is popular to every trader. My target on next bullrun is to start taking profit when 90K hit then DCA sell every 10K price increase using 10% of my holdings until I sold 90% of my holdings and left the remaining Bitcoin as my FOMO holdings just in case the price will still sky rocket on insane level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "October 22, 2023, 02:20:47 PM",
      "body": "Quote from: Negotiation on October 22, 2023, 02:14:39 PMBetter to wait until the bull run /....We can't just sit around waiting for that bull run before we dive into investing. If you want to savor those juicy profits once the bull run hits, now is the time to jump in. Bitcoin's price is still pretty reasonable compared to what it could be during the bull run. We're discussing preparation here, and that means acting before the bull run arrives. Trust me, if you wait until the bull run's in full swing, you'll likely only see modest gains and risk losing out if your timing's off. So, if you're looking for a safe bet, the time to buy is right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 22, 2023, 02:27:00 PM",
      "body": "Well, not really. I prepare for the whole cycle. I know that the bull run will come, and then the bear market, so you have to be prepared for everything and try not to get overexcited when the price keeps going up and not to get depressed when the price goes down. DCA and a very long term view are the solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}