{
  "id": "topic_5521982",
  "title": "Troytech",
  "author": "Troytech",
  "created_time": "December 07, 2024, 06:51:41 PM",
  "content": "Price action looks a bit stagnant just short of 100k. I do believe there is a strong probability that we head to test that, but would personally like to wait for a retest before it heads back above $100,000 Fundamentally, I think BTC has a good backdrop into 2025. With the return of Donald Trump and the new department of government efficiency (DOGE) run by Elon Musk, Bitcoin currently has some strong allies taking power. Additionally, we see a pretty strong setup for the US economy, amidst falling inflation and a consumer feeling stronger than recent years.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521982",
  "comments": [
    {
      "author": "Odusko",
      "created_time": "December 07, 2024, 08:16:49 PM",
      "body": "Quote from: Troytech on December 07, 2024, 06:51:41 PMPrice action looks a bit stagnant just short of 100k. I do believe there is a strong probability that we head to test that, but would personally like to wait for a retest before it heads back above $100,000 Bitcoin speculations board is the right place for this discussion so you consider moving this thread to the right board.LMO Bitcoin is very active and not stagnant as you say because judging from Bitcoin 24 hours price chart, you will notice a lot of volatilities untill now and Bitcoin still mentain the 100,000 + price which for me is still very far from saying it stagnant in nature, and as a matter of fact, the level of volatility in Bitcoin market since it first touched $100k and above is higher than the entire Bitcoin volatilities ratio for the whole of 2024, so we should expect a lot to happen in the coming year 2025, but Bitcoin is far from being stagnant at the moment.QuoteFundamentally, I think BTC has a good backdrop into 2025. With the return of Donald Trump and the new department of government efficiency (DOGE) run by Elon Musk, Bitcoin currently has some strong allies taking power. Additionally, we see a pretty strong setup for the US economy, amidst falling inflation and a consumer feeling stronger than recent years. Bitcoin may not need any shitcoiner as Allie as per say and whatever Elon musk is doing on doge coin will have nothing to add or take away from Bitcoin, but yes US government may have a bit of impact on Bitcoin, but since what we expect from the president elect is positive policies towards Bitcoin, then we can say that we are heading into an exciting time for Bitcoin and all we need to do is to keep accumulating more Bitcoin as the time permit us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 07, 2024, 10:26:02 PM",
      "body": "Quote from: Troytech on December 07, 2024, 06:51:41 PMPrice action looks a bit stagnant just short of 100k. I do believe there is a strong probability that we head to test that, but would personally like to wait for a retest before it heads back above $100,000 As per cmc it's over $100k. However, when he hit that all time high of around $103k, we go on a minor correction. But now it's seems that the price has a big support on $100k'ish for now and this could be the norm, or at least the price base will be that 6 digits.Quote from: Troytech on December 07, 2024, 06:51:41 PMFundamentally, I think BTC has a good backdrop into 2025. With the return of Donald Trump and the new department of government efficiency (DOGE) run by Elon Musk, Bitcoin currently has some strong allies taking power. Additionally, we see a pretty strong setup for the US economy, amidst falling inflation and a consumer feeling stronger than recent years.Yeah, and probably getting a pro-crypto SEC chairmanship too will be good news to us and will be a big boost on the price. 2025 will be very exciting and could be the biggest gains that we might seen in the last bull cycles. I guess falling economy will not be a big hindrance for Bitcoin and crypto, I mean smart investors knows where to hedge their wealth if the economy is not doing good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "December 09, 2024, 02:36:19 AM",
      "body": "Quote from: Troytech on December 07, 2024, 06:51:41 PMPrice action looks a bit stagnant just short of 100k. I do believe there is a strong probability that we head to test that, but would personally like to wait for a retest before it heads back above $100,000 Fundamentally, I think BTC has a good backdrop into 2025. With the return of Donald Trump and the new department of government efficiency (DOGE) run by Elon Musk, Bitcoin currently has some strong allies taking power. Additionally, we see a pretty strong setup for the US economy, amidst falling inflation and a consumer feeling stronger than recent years. You are correct about Bitcoin going up because of Trump getting up.But I am not sure about US economy, it is projected as good but I see lot of problems with it. I can just shatter completely one day all of sudden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "December 09, 2024, 06:22:59 AM",
      "body": "Quote from: krishnaverma on December 09, 2024, 02:36:19 AMQuote from: Troytech on December 07, 2024, 06:51:41 PMPrice action looks a bit stagnant just short of 100k. I do believe there is a strong probability that we head to test that, but would personally like to wait for a retest before it heads back above $100,000 Fundamentally, I think BTC has a good backdrop into 2025. With the return of Donald Trump and the new department of government efficiency (DOGE) run by Elon Musk, Bitcoin currently has some strong allies taking power. Additionally, we see a pretty strong setup for the US economy, amidst falling inflation and a consumer feeling stronger than recent years. You are correct about Bitcoin going up because of Trump getting up.But I am not sure about US economy, it is projected as good but I see lot of problems with it. I can just shatter completely one day all of sudden. We will see if there will be improvement on the US economy as Trump could be the one that might have a lot of bargaining power and used it in world stage. Although if I'm not mistaken, during his first tenure, him and China as somewhat in a tug of war.But in any case, next year will be big for us as when he sits, we might see another all time high. And he already had mentioned a former COO of Paypal to be somewhat of a crypto czar so let's see how it will go for next year as the government could not be lenient on crypto projects, but they could support it in the area of like Bitcoin mining as the US might take the lead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 09, 2024, 06:49:32 AM",
      "body": "These alliances are based on interests and may change once Trump takes power. The occurrence of these alliances may lead to counter-alliances that will try to reduce individual privacy or decentralize the network. Therefore, it is better to avoid political conflicts, especially since we are still in a market capacity of less than several trillion dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "December 09, 2024, 11:37:57 AM",
      "body": "Quote from: Troytech on December 07, 2024, 06:51:41 PMPrice action looks a bit stagnant just short of 100k. I do believe there is a strong probability that we head to test that, but would personally like to wait for a retest before it heads back above $100,000 Fundamentally, I think BTC has a good backdrop into 2025. With the return of Donald Trump and the new department of government efficiency (DOGE) run by Elon Musk, Bitcoin currently has some strong allies taking power. Additionally, we see a pretty strong setup for the US economy, amidst falling inflation and a consumer feeling stronger than recent years. Bitcoin is valuable in itself, and I am not sure it needs strong allies. The powers that be may not like Bitcoin because it is not under their full control (even though they praise it and sing its praises now). Spot ETFs, options, derivatives - all these are financial instruments for manipulating the price of Bitcoin. However, the price of Bitcoin can be manipulated both up and down. So I am not sure that the price of Bitcoin will rise much in 2025. At the same time, other financial assets (which are under the full control of the powers that be) can rise in price greatly. I do not really believe in the noble intentions of bankers, politicians and bureaucrats - they like to play their own games and are not liberals or cypherpunks at heart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "December 09, 2024, 11:44:04 AM",
      "body": "Quote from: hugeblack on December 09, 2024, 06:49:32 AMThese alliances are based on interests and may change once Trump takes power. The occurrence of these alliances may lead to counter-alliances that will try to reduce individual privacy or decentralize the network. Therefore, it is better to avoid political conflicts, especially since we are still in a market capacity of less than several trillion dollars.Conflicts are inevitable in our times.They are there for a reason - no wars, just some \"situations\" that happen here and there.But I do agree - it's better without them for the stability to stay intact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "December 09, 2024, 11:47:03 AM",
      "body": "Quote from: TravelMug on December 09, 2024, 06:22:59 AMWe will see if there will be improvement on the US economy as Trump could be the one that might have a lot of bargaining power and used it in world stage. Although if I'm not mistaken, during his first tenure, him and China as somewhat in a tug of war.But in any case, next year will be big for us as when he sits, we might see another all time high. And he already had mentioned a former COO of Paypal to be somewhat of a crypto czar so let's see how it will go for next year as the government could not be lenient on crypto projects, but they could support it in the area of like Bitcoin mining as the US might take the lead.His term this time seems to be more interesting for the space for sure - lots of promises and actions to be taken.Hopefully, it will be pleasant rather than full of things to mourn in the perspective.At least it seems to be oriented towards better regulations - new faces.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 09, 2024, 05:38:18 PM",
      "body": "Allies are temporary. They will remain Bitcoin's supporters until it's interesting for their personal plans. As soon as Bitcoin becomes a threat to the system they are trying to rule and where they inserted, their stance will completely change towards BTC.Actually, it's not going to be a surprise for anyone once this happens (once again). Trump and Musk have already discouraged Bitcoin adoption in previous years. Trump didn't have a big impact, but Musk was responsible for causing a serious wave of pessimism regards Bitcoin when he stated Bitcoin was harmful for the environment, and therefore, Tesla was going to stop accepting it as payment method.Instead of seeking for allies, I would search for friends. Real adopters, average citizens who are just trying to live their lives despite the tyrannical establishment not giving them any solid opportunities to thrive along the life, who have found in Bitcoin the gap they needed to reach a little further, against all expectations given by the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "December 09, 2024, 06:20:07 PM",
      "body": "Quote from: uneng on December 09, 2024, 05:38:18 PMAllies are temporary. They will remain Bitcoin's supporters until it's interesting for their personal plans. As soon as Bitcoin becomes a threat to the system they are trying to rule and where they inserted, their stance will completely change towards BTC.Actually, it's not going to be a surprise for anyone once this happens (once again). Trump and Musk have already discouraged Bitcoin adoption in previous years. Trump didn't have a big impact, but Musk was responsible for causing a serious wave of pessimism regards Bitcoin when he stated Bitcoin was harmful for the environment, and therefore, Tesla was going to stop accepting it as payment method.Instead of seeking for allies, I would search for friends. Real adopters, average citizens who are just trying to live their lives despite the tyrannical establishment not giving them any solid opportunities to thrive along the life, who have found in Bitcoin the gap they needed to reach a little further, against all expectations given by the system.Trump probably had the start of a wakeup call when PayPal and Stripe cut him off in January 2021.  One would think that having fascists like that disallowing you to accept payments would make one realize that having a censorship resistant currency, not to mention inflation protection and all the other benefits, would be smart to have available.  I don't know if that makes Trump an ally, a friend or what, but smart people should see the benefits to themselves and the world itself when statist authoritarians are thwarted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}