{
  "id": "topic_5412928",
  "title": "DigitalMonk",
  "author": "DigitalMonk",
  "created_time": "September 08, 2022, 10:53:24 PM",
  "content": "I am now a Newbie. Some people think I could be troll. So few of the forum members insulting me and using abusive word against me. I have done nothing wrong. Some one told me my a mirror. Some one saying I am Bitcoin Moses. Some directly insulting me. Some one has deleted many of my post. Some one has stollen my entire thread. If you are confused about my self and my identity or do not understand my language, then please write to me with complain instead of insulting me. I am a man like yourself  but I am not a scammer or hacker or thief. I am a Digital Monk does not mean I a beger. Most of the people here are anonymous or pseudonymous. You may not know who is on the other end ? It is wise to respect every one's each other. Some one said, may I have been hired by a Faketoshi and he is paying for hashish instead of Hashes. If you people do not like to be civilised then it is better for you to leave the Bitcoin Forum and do something else, in some where else. If you do not like my writing then don't read it just read what you like from other people. Why do you hacle me ? I have not invited you to read my writing. I will do my best to promote Bitcoin and Blockchain. If you think, you are Bitcoin and Blockchain master and you have got a PH.D.  in Bitcoin and Blockchain then why can't you open a Uninversity and teach there and become a lecturer. Remember, you are not the founder of this forum or inventor of Bitcoin and Blockchain technology. You all are working here as Robots according to my design. You think you have made billions of dollars out of Bitcoin and you have become an Elite now. So you are entile to do what ever you want to do or say what ever you want to say.  But my only request is treat others and every one with respect. I said, I announced that I am now a Bitcoin Ambasador. How did you bully me about it ?  Unless I have capacity and capability, I would not speak it at all. Now please understand, that a gold Smith has a plan  what he is going to make with gold ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412928",
  "comments": [
    {
      "author": "AnotherAlt",
      "created_time": "September 08, 2022, 11:01:42 PMLast edit: September 09, 2022, 08:20:56 AM by AnotherAlt",
      "body": "First of all, This is not the appropriate section (This is For Bitcoin discussion) to discuss whether you are a troll or whatever others said. You may want to move this topic to the Reputation board. Now I want to talk about the thread title. Bitcoin has one leader, it's Satoshi. No one knows his identity. Bitcoin Forum has a few leaders. They don't have time to handle you. If people report your posts that are against the rules, they have no choice other than delete them. You were proved as a pro Liar. So, expect some harsh comments in this thread too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 08, 2022, 11:10:42 PM",
      "body": "There's a lovely button on the left side of every post with the word \"Ignore\" you could try using it on posts that annoy you if you want.I can't comment on the thread and posts that were deleted but you seem to have gone from claiming to have only recently come across bitcoin a month ago and trying to understand it to making a bitcoin cult, I think you've skipped a few months/years there at least. And yes you could probably do with moving this to reputation board - you'll find the button on the lower left.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "September 08, 2022, 11:50:25 PM",
      "body": "Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMMost of the people here are anonymous or pseudonymous. You may not know who is on the other end ? It is wise to respect every one's each other. Respect must go both ways. If you don't respect the community, then you can't expect the community to respect you.How would you feel if I came to your house and put my muddy shoes on your dinner table? That's how I see what you did here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "September 09, 2022, 12:03:15 AM",
      "body": "Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMIf you people do not like to be civilised then it is better for you to leave the Bitcoin Forum and do something else, in some where else. Sweetheart, you've got that entirely backward.  The culture of bitcointalk was well established before I got here, which was in 2015, and it's not only unreasonable but extremely self-centered and egotistical to expect that culture to bend to your wishes simply because you got your fee-fees hurt.  Translation: If you don't like how people here are, you leave the forum.  I don't know how many times I've told people they need to grow a spine if they're going to last as members here.  If you can't take criticism, or even a bit of hazing, you're in the wrong place.Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMIf you do not like my writing then don't read it just read what you like from other people. Why do you hacle me ? \"hacle\".  Well, my guess is that people saw what you wrote before they had a chance to ignore you, so they responded however they did.  I'm posting first and reading this thread second, so I don't know the whole story, but I'll tell you that it's not uncommon for relative newcomers like yourself to get shit if they post something stupid/illogical/troll-y/whatever.  I guess I'll have to check your posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 09, 2022, 02:12:32 AM",
      "body": "Mate, if you have some bad takes, expect to get at least a little bit of pushback.But really — regardless if your opinions are good or not, always expect to have negative responses. Remember that you're on the internet — there is always someone that will disagree with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 09, 2022, 02:27:19 AM",
      "body": "well you are the ambassador now as  you claimed, you can do some diplomatic approach. somehow users will not believe you have the knowledge how BTC works. Offshore Bitcoin transaction platform is funny actually. believe it of not there is nothing like it. but seeing you ask people to make transactions with you is like trying to scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "September 09, 2022, 05:39:37 AM",
      "body": "The whole situation is actually laughable ( lol ), each member here, if not all here got bashed and lambasted when they actually was a newbie innit the forum. When you're not doing the right thing or a user feels your opinions are not correct you tend to be corrected from them. ( You have to see that as positive criticism )I can relate, all of what you wrote, you did with your emotions still paranoid. This is the internet, get a thicker skin, have some ball's mate.You get tougher and everything gets better with time. Take your time to observe and read  more, don't be too quick to write shit/spam.Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMIf you do not like my writing then don't read it just read what you like from other people. Why do you hacle me ? \"hacle\".  Well, my guess is that people saw what you wrote before they had a chance to ignore you, so they responded however they did.  I'm posting first and reading this thread second, so I don't know the whole story, but I'll tell you that it's not uncommon for relative newcomers like yourself to get shit if they post something stupid/illogical/troll-y/whatever.  I guess I'll have to check your posts.[/quote]OP wrote with his/her emotions, I really do think he was trying to say \" WHY DO YOU TACKLE ME ? \" Post Quality might not be what you expected but with time the user will sure get better. Lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DigitalMonk",
      "created_time": "September 09, 2022, 07:30:22 AM",
      "body": "Quote from: decodx on September 08, 2022, 11:50:25 PMQuote from: DigitalMonk on September 08, 2022, 10:53:24 PMMost of the people here are anonymous or pseudonymous. You may not know who is on the other end ? It is wise to respect every one's each other. Respect must go both ways. If you don't respect the community, then you can't expect the community to respect you.How would you feel if I came to your house and put my muddy shoes on your dinner table? That's how I see what you did here.Very good response. Now, imagine the House owner went for a holiday in the Mountain of Many Flower beyond the Seven Seas and after he came back found there are so many people have invaded his house and owner returned with muddy feets and then few of them knew that he is the owner of the house then they together pushing him out again and again. What the owner should do in thin case ? If you can advise me correctly, then I might be able negotiate with the intruders or uninvited guests but if give me wrong advise then the house owner may have take the  tough decision. In that case, most of the Bitcoin community leaders will become good neighbours to Ross the DPR. I really do not want that because that will be bad for them. As a digital Monk, I can only give good advise to the invaders that they must not enter in the Inner Court of the House. Which they have done. So I have sign a message  Cryptographically with a very good hover to clean the Bitcoin Talk Forum. If my words are harsh for them then I can give them a second  chance to repent and say sorry for their wrong doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 09, 2022, 07:33:32 AM",
      "body": "Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMSome people think I could be troll.Let me see:you have announced you've made a bitcoin service, but your questions show you have not even the basic knowledge about Bitcoin    --> This means that you put people's money at risk, hence you can easily be tagged as scammeryou have asked people to help you build a block explorer which you don't even know if it's meant to be block explorer, DEX or OTC exchange    --> This means that you are trolling and have no respect for people's work/effortyou have announced some strange ambassador program you implied you're offering (big) money, but you've never shown any proof of money (nor promised at least to escrow it)    --> This is somewhere trolling and scamPeople don't care about your name. People don't hate you per se; people hate to be taken for fools and this is what your actions are implying, hence the response you've got.So maybe instead of asking why the community is doing this, you should start asking what you have been doing wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 09, 2022, 08:24:33 AM",
      "body": "Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMI have done nothing wrong.Sure you did: you lied!QuoteSome one has deleted many of my post. Some one has stollen my entire thread.Those damn Mods at it again? You have only 13 deleted posts, I have 32 (some of them I even reported by myself)!Read the rules, it helps.QuoteSome people think I could be troll.How dare they! You're just a broke guy who offers a $160,000 salary!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 09, 2022, 09:16:18 AM",
      "body": "You become inconsistent. Isn't it written by you?https://loyce.club/archive/posts/6086/60864841.htmlWhy are you complaining?Quote from: DigitalMonk on September 09, 2022, 07:30:22 AMVery good response. Now, imagine the House owner went for a holiday in the Mountain of Many Flower beyond the Seven Seas and after he came back found there are so many people have invaded his house and owner returned with muddy feets and then few of them knew that he is the owner of the house then they together pushing him out again and again. What the owner should do in thin case ? And again you got it all mixed up. This is not a forum that came to you, but the opposite. You came here. Coming to \"another's monastery, they don't wave their charter.\" Are you familiar with this expression?And the last thing a person who said yesterday that he doesn’t care about everyone can say is to complain tearfully that they don’t understand him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "September 09, 2022, 09:54:48 AM",
      "body": "First of all, who do you mean by \"the Bitcoin Forum leaders\"? I never see admin/theymos comment about you or your posts.Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMI am now a Newbie.After you made this claim?Quote from: DigitalMonk on August 19, 2022, 11:41:31 AMI am a digital Monk, and I do have complete knowledge about everything Bitcoin and Cryptocurrency.Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMRemember, you are not the founder of this forum or inventor of Bitcoin and Blockchain technology. You all are working here as Robots according to my design. You think you have made billions of dollars out of Bitcoin and you have become an Elite now. So you are entile to do what ever you want to do or say what ever you want to say.  But my only request is treat others and every one with respect. What a bold request after you claim that we're your slave robot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 09, 2022, 01:29:12 PM",
      "body": "Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMIf you think, you are Bitcoin and Blockchain master and you have got a PH.D.  in Bitcoin and Blockchain then why can't you open a Uninversity and teach there and become a lecturer. Why would anyone with a little better knowledge have to be a lecturer or teacher? are such people prohibited from minding their own business?You sound very limited since you present yourself as a master.QuoteRemember, you are not the founder of this forum or inventor of Bitcoin and Blockchain technology.how can you be sure of this?QuoteI said, I announced that I am now a Bitcoin Ambasador.who gave you that title? on the basis of which you deserved it?what happened to your initiatives?Any one interested to assist me to build a new Bitcoin Explorer ?A Job for Life: Bitcoin Ambassador - Salary: US $160,000 DollarsAlso, since you know everything about Bitcoin and blockchain, why do you ask so many \"How\" and \"Why\" questions? a know-it-all like you should know that.btw. Did you find Satoshi Nakamoto and his bitcoins? You open several threads about that.So, yes, you are just a troll and nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "September 09, 2022, 01:39:49 PM",
      "body": "Quote from: decodx on September 08, 2022, 11:50:25 PMQuote from: DigitalMonk on September 08, 2022, 10:53:24 PMMost of the people here are anonymous or pseudonymous. You may not know who is on the other end ? It is wise to respect every one's each other. Respect must go both ways. If you don't respect the community, then you can't expect the community to respect you.How would you feel if I came to your house and put my muddy shoes on your dinner table? That's how I see what you did here.Every one deserves a respect, are you are aware that the forum does not welcome abusive language to a fellow user. Theirs so many ways to correct somebody you know that is on off point. You can message the person through inbox and explain things with person than insulting the person on public or you blacklist the person knowing that what ever the person's post you will not see it or come across to the post, insulting the person every time, it will demoralize the person ambition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "September 09, 2022, 02:02:05 PM",
      "body": "Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMSome one told me my a mirror. Some one saying I am Bitcoin Moses. Some directly insulting me. Some one has deleted many of my post. Some one has stollen my entire thread. If you are confused about my self and my identity or do not understand my language, then please write to me with complain instead of insulting me. I am a man like yourself  but I am not a scammer or hacker or thief. I am a Digital Monk does not mean I a beger. There seems to be something wrong with your way of thinking, because consistency in forums is a style that cannot be faked, people will find something wrong with what we have done.Falsehood is just a smell that hasn't been smelled yet?Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMRemember, you are not the founder of this forum or inventor of Bitcoin and Blockchain technology. You all are working here as Robots according to my design. You think you have made billions of dollars out of Bitcoin and you have become an Elite now. So you are entile to do what ever you want to do or say what ever you want to say.  But my only request is treat others and every one with respect. The treatment of people will be very balanced with the impact we give, people will respect us according to our respect for others.This only applies in real places, but chances are slim on forums, but you can trust people and trust will come back to you.We came here on the basis of not knowing each other, even People who have access to forum settings don't need to know who we are.But one thing you have to believe and trust, this forum is growing and quite consistent until now, because too many people are honest and care about each other, I call it trust.Maybe the important point I want to convey is \"TRUST\".The rest you can check for yourself, what makes people do not appreciate and do not trust you.Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMI said, I announced that I am now a Bitcoin Ambasador. How did you bully me about it ?  Unless I have capacity and capability, I would not speak it at all. Now please understand, that a gold Smith has a plan  what he is going to make with gold ?   Even the last quote I read from your post is quite affirmative, and too bragging about what you have done or are currently doing.But in reality, you are not like a beginner just crawling into an adult.\"Trust will take you to a more perfect place, and that's where the highest award you will get\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "September 09, 2022, 02:11:56 PM",
      "body": "I tried to look at the history of your topic/post and the Red trust you have, two conclusions that I can conclude for you.Violation:One:Quote from: mprep on July 21, 2014, 05:27:51 PMHowever, trolling isn't allowed. If a user is habitually posting obviously false nonsense (\"obviously false nonsense\" to an outsider, NOT to someone who follows or is involved in the discussion) just to stir up trouble, then it's considered trolling, which is prohibited. Such cases should be thoroughly documented in the report though (There are tons of reports that just say \"trolling\", but moderators don't have time to look through each user's post).And second:Quote from: mprep on July 21, 2014, 05:27:51 PMQ: Someone insulted me. Why aren't you deleting his post/thread?A: Possible (since we don't have the time or resources to check) insults are also allowed as long as they contain any kind of constructive opinion, info or something else substantial and aren't off-topic. For example, posting something like \"you are dumb\" will be deleted as it contains no meaningful content. However, if the post is somewhere along the lines of \"You are dumb. This is wrong because this website/thread/etc. has explained it's not right\", it's in most cases accepted.Wow, this is even worse.Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMI said, I announced that I am now a Bitcoin Ambasador. How did you bully me about it ?  Unless I have capacity and capability, I would not speak it at all. Now please understand, that a gold Smith has a plan  what he is going to make with gold ?   Obviously trolls, bullshit and jokes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "September 09, 2022, 04:44:10 PM",
      "body": "Quote from: DigitalMonk on September 08, 2022, 10:53:24 PMAt last someone gets to write from his mind and hard emotions. That's a good one except for the write up itself. Not that your grammer or any of those are wrong but, when you find yourself being heated on the way you've claim in OP, the better thing yo do is to see check back for what you might be doing wrong and see how you could amend those.As much as I know, no one knows you in person to have just outrightly hate you, not to mention it coming from a larger group of persons. When that happens to be the case, you could be the problem and have put yourself in the forefront of all the resentment towards you. Withdraw and see reasons why.Nagging around is not going to change the reactions towards the things you do hear but, a change of your person to one that is teachable would help.As much as I have known the forum, they appreciate ideas and when they see a carefully planned one, they encourage it. There is even a thread that enquires the possibility of promoting crypto projects for free.You don't come and talk about being an Ambassador, speak of recruiting staff with a huge pay and no detail on how this money is to be generated! I mean, it raises an eyebrow and like that, your going to be asked questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "September 09, 2022, 05:38:42 PM",
      "body": "Quote from: Oluwa-btc on September 09, 2022, 05:39:37 AMOP wrote with his/her emotions, I really do think he was trying to say \" WHY DO YOU TACKLE ME ? \" Post Quality might not be what you expected but with time the user will sure get better.[/b] Lol.I've written with my emotions before, and yet I still correct any errors that jump out at my from my spell-checker.  In addition, I don't think he meant to write \"tackle\".  I think the word he might have been looking for was \"heckle\", but then again that's not a common word people use whose native language isn't English.  Anyway.Quote from: ETFbitcoin on September 09, 2022, 09:54:48 AMFirst of all, who do you mean by \"the Bitcoin Forum leaders\"? I never see admin/theymos comment about you or your posts.Good point and an obvious one at that, which I should have pointed out to OP.  There aren't any leaders here, except if you consider the members who are working for the forum (mods) or Theymos or Cobra(?).  The rest of us have varying degrees of influence, but Theymos seems to run bitcointalk with a laissez-faire approach and lets people do pretty much what they want to do.  Last I checked, nobody here has claimed to be any kind of leader of the forum.  If someone were to do that, they'd probably get slapped harder and more publicly than Chris Rock at the academies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 09, 2022, 06:46:35 PM",
      "body": "Quote from: dataispower on September 09, 2022, 01:39:49 PMEvery one deserves a respect, ...No matter how nice that sounds, I disagree. Respect is not something that is freely given, but earned.Many people feel they are entitled to be respected without giving anything in return. They want our respect with no strings attached, and when they fail to get it, they're quick to point out that we're the ones who are disrespectful. Whether or not you choose to show respect for certain individuals is of course totally up to you, but appealing to the idea of inherently deserved respect seems to be a way of manipulating others into doing what you want.Quote from: dataispower on September 09, 2022, 01:39:49 PMare you are aware that the forum does not welcome abusive language to a fellow user. I think you are confusing respect with basic courtesy and human decency. But beyond basic courtesy, it's not as if he or she must be respected by default.Ultimately, I think the only way to truly earn someone else's respect is to put in the effort to develop yourself into a person worthy of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}