{
  "id": "topic_5449432",
  "title": "Alpha Marine",
  "author": "Alpha Marine",
  "created_time": "April 19, 2023, 12:17:07 PM",
  "content": "Ordinarily, I don't like asking questions like this because I feel they're personal questions that should be answered by myself alone but it has been on my mind for a very long time and I have not gotten a solution for it. I have a friend that works hard. He does two jobs and he makes a lot of money. Most of his money is in a savings bank account where he saves them. He doesn't have any use for it right now so the money is just sitting pretty in that account. Lately, I've been having the urge to advise him to buy Bitcoin with like 40% of his savings and HODL. Holding won't be an issue for him because he has the patience of an old man. He has left the savings in his account for over two years without touching it. Now imagine him transferring that energy to Bitcoin.The problem is, someone has convinced him to buy altcoins before now, I think in late 2021 or thereabout. He bought three different altcoins for about $500 and now two out of the three coins he bought are worthless. one is worth about $0.045. The price ain't the issue, the issue is these coins are not like Bitcoin that will rise again. I have explained all he needs to know about Bitcoin to him and he understands. He understands how Bitcoin is not a get-rich-quick scheme, the risk, and the patience involved.He buys into the idea but I'm still having doubts. I don't want to look like a fraud when things don't work out. I mean, I can speculate about the market all I want, but I can't be sure what tomorrow brings. So should I go ahead and advise him to buy Bitcoin or I should leave him to come to me himself? Because he will buy it if I ask him to.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449432",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "April 19, 2023, 12:22:40 PM",
      "body": "There isn't a foolproof answer to this question... Personally, i have never tried to convince anybody to invest in anything. Not my parents, not my brother, not my friends...If it goes wrong, they will always feel like you were responsible for their loss, and that's a burden i don't want... But that's just my personal opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 19, 2023, 12:41:45 PM",
      "body": "Do not advise anybody to buy BTC, many people buy BTC without actually knowing what it is because their friend or family told them to buy it to make X amount in returns. When you don't know what BTC is you'll struggle to use or even hold it, and you can easily be scammed.If your friend is interested in BTC, and you know something about it, you can teach them how BTC is a second choice currency to fiat which is censorship resistance and permissionless, you should also tell them the advantages of using BTC, it is better to tell people what BTC is first, that's a currency, before you let them know that is is also an asset that can be invested into because its supply keeps reducing and the value keeps going up. If your friend understands all the basic things about BTC, they will decide for themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "April 19, 2023, 12:56:04 PMLast edit: April 19, 2023, 01:28:37 PM by Aikidoka",
      "body": "I would suggest telling him to buy but deep inside, it's not something that is guaranteed to happen, like you won't be sure 100% cause it is still risks even when we are talking about bitcoin. To be honest, If I was him I would buy since him having already money sitting for 2 years in his account? why he don't get a profit from money sitting there? he obviously should take the advantage of that and make them moves to bitcoin and HODL, that's just my opinion. For your friend, simply inform him about it and let him make his own decision on whether or not to proceed, just don't force him so that you won't encounter any issues/troubles later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "April 19, 2023, 12:57:14 PM",
      "body": "He start in a wrong path and I think the three coins he hold will not have a bright future, so he will blame himself for invest in these three coins. After that he will call any cryptocurrency including Bitcoin is scam, but it's his choice and you've done your part to teach him. Let him choose, you shouldn't force him to invest in Bitcoin, do you want your friendship will be ruined because your friend can't accept bear market when he already invest on Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "April 19, 2023, 01:07:57 PM",
      "body": "I don't think it's wrong for you to advise him to buy bitcoin but I think it would be wrong of you to tell him the about of money he should commit in it. Let him decide if he wants to use 40% of his saving to buy or not. Your place is to introduce him to bitcoin, advise him to study the market and to always do due diligence which I want to believe you've done already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 19, 2023, 01:22:25 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PMThe problem is, someone has convinced him to buy altcoins before now, I think in late 2021 or thereabout. He bought three different altcoins for about $500 and now two out of the three coins he bought are worthless. one is worth about $0.045. The price ain't the issue, the issue is these coins are not like Bitcoin that will rise again. I have explained all he needs to know about Bitcoin to him and he understands. He understands how Bitcoin is not a get-rich-quick scheme, the risk, and the patience involved.He buys into the idea but I'm still having doubts. I don't want to look like a fraud when things don't work out. I mean, I can speculate about the market all I want, but I can't be sure what tomorrow brings. So should I go ahead and advise him to buy Bitcoin or I should leave him to come to me himself? Because he will buy it if I ask him to. I don’t buy the idea of advising some who has already gone into Alticoins to come to bitcoin is way too risky because such is only looking at the profitability potential for investing in cryptocurrencies and when you advise such person they only see bitcoin as something that won’t dump like other coins which is yes but this kind of mentality is not advised even in bitcoin. The major question you need to throw out to him is why is he into crypto in the first place if is to get away from fiat crises and start an investment in bitcoin then you tell him that bitcoin actually is one of the best assets for it but there periods in it too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "April 19, 2023, 01:37:52 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PMsnipYour friend is saving money in the bank because it is his personal desire and he is satisfied even if he gets less profit from it. But you cannot give him financial advice that if he invests in Bitcoin he will get us profit and he should invest 40% of his savings. Because if he loses his hard earned money somehow he will blame you and you will be responsible for that. So refrain from giving financial advice to anyone.  You can tell him about Bitcoin and of course you should also inform him well about the risks of Bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "April 19, 2023, 01:41:35 PM",
      "body": "Tell him to buy bitcoin, explain to him about the block reward  every 4 years & what that means for the supply, how bitcoin is deflationary. Tell him how this compares to the $ which is to quote Michael Saylor, a block of ice melting via annual (theft tax) inflation. It’s up to your friend what he does with his money but explain bitcoin as best as you can. I hope he buys, and last thing tell him not to shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 19, 2023, 01:42:29 PM",
      "body": "Like you have said, you can speculate on price but not always be certain. There is a possibility that if you advise your friend to buy bitcoin now, it could turn out to be beneficial advice for him if prices spike, or he will be on the losing end if prices drop. You said your friend has two jobs that he is doing, which means he is steadily earning from them, and that's why he was able to allow his savings to sit in the bank for two years. If you advise him to buy Bitcoin now, it's not a bad idea, although he has had some experience with the altcoins he bought. First, I will advise you to make sure your friend is totally aware of Bitcoin and how volatile the price can be. Second, let him know that if he can't hold until the price goes up, he will not be making profits unless he is ready to sell at a loss. Thirdly, let him know that if he decides to invest, it is at his own risk and not yours to receive blame. If your friend is aware of all this, then there's no harm in trying. If he decides to invest, then don't forget that DCA is always a good strategy for accumulating bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "April 19, 2023, 01:45:57 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PMSo should I go ahead and advise him to buy Bitcoin or I should leave him to come to me himself? Because he will buy it if I ask him to. You can give your friend the good points and benefits why it will be better for him to keep his savings in bitcoins, if not all his savings, some of it. Do not force the decision, but allow him see reasons. Explain to him the mistake he made before which is trusting altcoins more and that if it was bitcoins he made those investments, he would have been smiling this period that the price of bitcoin is doing well. If he is a smart guy, he will come around to invest in bitcoin, get the knowledge about Cryptocurrency for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "April 19, 2023, 01:50:03 PM",
      "body": "If I'm not mistaken and haven't forgotten, I've read posts with almost the same topic as this more than twice. Maybe now many people have the same case.Giving advice to your friends about bitcoin is indeed a very wise thing, especially if you give advice while teaching what bitcoin is and how it works, surely it will be more perfect. But the problem is, do you want the friend you gave the advice to follow your advice and buy bitcoin? the answer must be between participating and not participating.Those who agree to accept advice about bitcoin need not be discussed and questioned again. But the problem is people who don't want to take your advice, but you still force them to continue investing in bitcoin.My advice, if you have told your friends about what bitcoin is, the benefits of bitcoin, and the potential for bitcoin. But your friend still doesn't want to, it's better not to force it. Because if you force it, you are afraid that there will be risks that you will have to face in the future.For example, what if your friend invests in bitcoin, and (for example) suffers a loss, (because of being deceived, or because the market goes bankrupt and the bitcoins are not returned), I'm sure you will be affected by your friends, because you are the one who told them about bitcoin .So basically, don't ever force your opinion on other people, even if the opinion you have is indeed good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "April 19, 2023, 01:50:45 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PMThe problem is, someone has convinced him to buy altcoins before now, I think in late 2021 or thereabout. He bought three different altcoins for about $500 and now two out of the three coins he bought are worthless. one is worth about $0.045. Haha, let me guess, he bought Terra Luna   Your friend should cut ties with that person who convinced him to buy scam coins.QuoteHe buys into the idea but I'm still having doubts. I don't want to look like a fraud when things don't work out. Don't work out? In what way? If holding is not an issue and he can hold for about 2 years, there's no way the price won't be higher than 30000. Bitcoin is one of the best investments right now. It can't be stopped, only delayed. If you can forget about it for a few years you'll always come out on top. QuoteI mean, I can speculate about the market all I want, but I can't be sure what tomorrow brings. I thought he doesn't care about \"tomorrow\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 19, 2023, 01:55:51 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PMI have a friend that works hard. He does two jobs and he makes a lot of money. Most of his money is in a savings bank account where he saves them. He doesn't have any use for it right now so the money is just sitting pretty in that account.Banks are risky but others are risky too including Bitcoin. Especially if you don't know how to store your bitcoins safely and where to store it with full control on your bitcoins, no dependence on other parties.QuoteLately, I've been having the urge to advise him to buy Bitcoin with like 40% of his savings and HODL.You are doing one of worst things by advising another person invest into something.QuoteHolding won't be an issue for him because he has the patience of an old man.Patience is a personal trait and usually it is not related directly to age.QuoteThe problem is, someone has convinced him to buy altcoins before now, I think in late 2021 or thereabout. So now you will put yourself into a war with someone else, just to convince that man to do something. Giving financial advice is risky and are you ready to be responsible with your advice?Even Bitcoin has risk and not completely safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 19, 2023, 01:56:05 PM",
      "body": "If your friend does not know what to invest in, it is better not to invest, investing 40% of the savings account is not considered a small investment, and therefore if your friend does not know what he is trying to do, he will end up selling in the first panic, and then he will not think about investing again.Let him start with money he does not need for the next five years and diversify investments in real estate, stocks and foreign currencies in addition to gold and bitcoin by 5%.Always let him put the worst case scenario before the gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "April 19, 2023, 02:03:14 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PMSo should I go ahead and advise him to buy Bitcoin or I should leave him to come to me himself? Because he will buy it if I ask him to. if he still has interest in investing in crypto. yes, you should advise him to buy and hold Bitcoins. but if she doesn't like it anymore, then you can't force her. but if only to share information when you meet him. I think discussing investment assets is not something serious when everyone really understands it.Your friend is unlucky with his ignorance in investing. He will surely regret it. but hopefully he doesn't come out and reject Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 19, 2023, 02:09:00 PM",
      "body": "Quote from: Husires on April 19, 2023, 01:56:05 PMIf your friend does not know what to invest in, it is better not to invest, investing 40% of the savings account is not considered a small investment, and therefore if your friend does not know what he is trying to do, he will end up selling in the first panic, and then he will not think about investing again.It is a big risk for that man and for the OP too.The market is very volatile and that man might be panic anytime and exit with loss. Moreover, when people start in cryptocurrency market, they will probably make mistake with wallet backup, account information backup including 2 factor authentication backup and often store their cryptocurrency on exchanges. What if he lose 40% of his savings on a scam exchange?Will he knock the OP door to blame something? I don't know but I don't want to take that risk on my shoulders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "April 19, 2023, 02:15:18 PM",
      "body": "Since you knew that BTC is a king among other cryptocurrencies, and you want your friend to grow well like you, why can't you tell him the truth that BTC will help him to improve if he can apply long holding strategy. You can Use the market chart to explain to him so that he will believe that you are giving him a right direction that will make him to earn well when the price of BTC increase higher. If you wait for him to come to you, maybe another people can still deceive him to invest in altcoins that will make him to feel that BTC and other cryptocurrencies are fake not knowing that he didn't invest in a potential coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "April 19, 2023, 02:29:24 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PM~snipIf you are ready to take responsibility for asking him to invest in bitcoin and your conscience doesn't bother you if something goes wrong, then go ahead - advise him to buy. I understand that this is your friend and you want to do good to him, but sometimes in life it is difficult to distinguish good from evil and vice versa (never know what the outcome of any action will be). Personally, it would be extremely unpleasant for me to let a friend down and it would be difficult for me to take on the decision of his investment. Therefore, in this situation, I see the solution as follows: tell about all the opportunities and risks when investing in btc, but your friend, the decision must be made by himself. Best of all, after a few days of reflection, that reduce the impact of emotions.Isn't it too much, 40%? BTC is still considered to be risky assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "April 19, 2023, 02:49:27 PM",
      "body": "Quote from: Alpha Marine on April 19, 2023, 12:17:07 PMSo should I go ahead and advise him to buy Bitcoin or I should leave him to come to me himself? Because he will buy it if I ask him to. I would not suggest that people go too far to invest in the Crypto and Bitcoin space though, if they don't try to understand the conditions of price fluctuations and every suggestion we give, when they don't try to learn to know Bitcoin then one day we will be blamed whenever they get a loss. Not everyone learns quickly to realize that Bitcoin is much more basic than Altcoins, sometimes there are also people who find Altcoin prices easy to buy because they are cheap, even though the returns are very risky and very uncertain.In your case what needs to be explained to a friend is that the power of Bitcoin and Altcoins is very different, explaining the journey of Bitcoin in recent years and comparing it with Altcoins will make him have a view and he can decide, but basically he is the one who will be responsible for the loss of the assets in have it, while you are an intermediary as a basis for him to choose a decision and it depends on how you explain bitcoin and altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}