{
  "id": "topic_5434540",
  "title": "king6string",
  "author": "king6string",
  "created_time": "January 13, 2023, 03:39:58 AM",
  "content": "(short preface - I see alot of people who are drifting, potentially upset or unsettled about the current conditions, and state of things in general regarding world events, market environment, inner stability, ect. This post is simply what I can offer, as a way to spread warmth and positive energy. I'll keep it at that.)Alot of newbies will be coming to this sector as the economy slips further into uncertainty and dismay. Strategy is what will keep them afloat.      Most of the people I know are aware of Bitcoin, and I'd estimate that slightly less than half have tinkered with it, or an alt coin, in some way. Who's to say what the future will bring, so I will refrain from coming off as if I have any more knowledge than the next man or woman. However, I do utilize some of my own principles and convictions in my own life, based on my understanding of The Art Of War, and The Book Of 5 Rings, which are two keys to understanding Strategy as a subject in itself. I have studied both books deeply for well over a decade now - and when I say study - I mean I can readily recite both with far more accuracy than anyone else I've met. I consider myself fascinated with the topic. I truly apply it to all things in my life, and I do my best to filter my perceptions through it. I've said it before - Bitcoin IS Strategy. If you want to understand bitcoin deeper, you absolutely must study the Art of Strategy, and the Book Of 5 Rings. It's too important for anyone reading this to ignore.       This leads me to the reason I titled this post - \"Always Buy Up\".  What I mean is that you should always gain something of value in any exchange. This is one of the central messages and lessons that is continually brought up in the Art of War. As men and women, we exist on many levels - bitcoin only interacts with some of those levels (to most people - physical (cold storage) and digital) ... If you were to observe higher levels of existence according to natural law, you would have to acknowledge that monetary value eventually has it's limitations. It is my understanding that Bitcoin is the first tool in human existence, considered to be \"money\", that has extended itself to reach these levels of limitations, however it still has limitations. Now, with that in mind - I do not sell my coins for cheap. I have to have something worth more for me to consider selling a single satoshi. I absolutely must be \"buying up\" - which is rarely in material form. I would consider Training, Education, School, Private Instruction, ect as being some of the only things worth it to me personally, provided that the monetary value is at the right level. I do not judge others for thinking differently, but this is my Way... Knowledge, Growth, and Development of Character are fundamental to experiencing a life worth living in the first place - it is the true hallmark of a wealthy man or woman, regardless of Net Worth. So that's why I take this kind of outlook on it.      I make this point to illustrate why I have the lifestyle that I do - I'm a private guitar instructor. By choice, it is my primary way of making a living, and I am truly passionate about it. I am one of the very few exceptional men alive today who can honestly say I Love Doing What I Do For a Living. To put it precisely - I teach my students Strategy, applied to the guitar. This gives them a reference point in their lives that they can come back to, and use in other endeavors in the future, as well. I want to be careful about Not turning this into a guitar lesson post - but It deserved it's own part here out of pure respect for the art, and the expression of the creative power therein. I love teaching Strategy, through the guitar.      Now - as a teacher, I can say that the skills that you have in any particular artform are going to expose you to the level of understanding of Strategy that you instinctively have. I'll say that again - The Skills that You Have are going to Expose you to the Level of Understanding of Strategy that you Instinctively Have. The better you get at something, the more it will expose you to the natural strategy that you're already using. The reverse is also true - The more you study strategy, the better you will get at the things that you are already good at. This is a fundamental truth - It is reflective in all things, and in all artforms, because the Way of Nature is the Way of Strategy. Learn it.      Whether you are a musician, painter, poet, singer, songwriter, coder, magician, day trader, juggler, golfer, swimmer, mechanic, doctor, ballerina, warrior, attorney, business consultant, manager, bare knuckle boxer, pilot, diver, miner, carpenter, plumber, architect, district manager, janitor - you get the idea, anything - Having an understanding of Strategy as an Art Form, and applying it to the other aspects of your life, will greatly enhance your performance and growth, which will in turn add value to your life that cannot otherwise be had. That's it. That's the point.      If you do not already study Strategy on a formal and structured level - I highly suggest you do. The answers to your questions are already within you, it's simply a matter of attaining the correct skillset within, that will allow you to observe them as such. If you Do study Strategy already, I must commend you. Cheers! Keep your path straight, and be open to learning additional skills that will allow you the opportunity to express your own strategy in a healthy way. That being said - I'll leave the rest of the discussion to those who are blessed enough to find this post. Happy New Year - Make 2023 a great year, regardless of market conditions or world outlook. Take the time to develop yourself as a Man or Woman, and be the best that you can be.    [/b]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434540",
  "comments": [
    {
      "author": "Hydrogen",
      "created_time": "January 13, 2023, 11:49:47 PM",
      "body": "The book of 5 rings is a good read. While many have applied it to combat sports and life hacks over the years. I have yet to see anyone apply it to finance, bitcoin or crypto.Image link:  https://i.ibb.co/4fXfHYt/resentment-complaint-inappropriate.jpgThe above quotation from Musashi Miyamoto's dokkodo could be good advice for coping with unpredictable, seemingly irrational and crazy events in the cryptosphere.The book of 5 rings encourages an unclouded, unbiased, perspective. Which can be important qualities to develop for investment. Recognizing opportunity and not being swayed by trends and popular public opinion. Emphasizing a lack of preference could also be a good trait to develop. Applied to finance, it could imply having no preference for shitcoins over defi. Or ICOs over tokens. But to simply recognize value and make unbiased investment choices based on logic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "king6string",
      "created_time": "January 14, 2023, 03:12:05 PM",
      "body": "Excellent observation!! There's so many hidden gems in it. It is truly like a bible to me. With a deep enough understanding of it, you will see that it clearly explains the true nature of the universe. It's absolutely relevant to any type of investing. He says very bluntly - \"If you wish to learn Commerce, study the Fist.\" Directly implying that Trade Is Strategy...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "January 15, 2023, 05:29:40 PM",
      "body": "Yes we need that step by step approach in our lifetime because without it we would end up in complicated situation. This is mostly when it comes to the financial management. I’m not saying we are always at complex but in crypto where the market is far more volatile and trendy one can end up loosing the heat over the time.  Here success can only follow you if you are patient enough to resolve the buying and selling process. Meaning, you have to have proper understanding as to when and what to buy in the crypto market. With the time things also get cozy if we are now updated with the finance management. Good to have this discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "January 16, 2023, 07:49:10 AM",
      "body": "This topic is more about self-help rather than economics. Maybe it belongs to another forum.Anyway, I guess that by \"strategy\" you mean discipline and consistency. Having a strategy means having a plan, and plans don't always work.Mike Tyson once said: \"When you go on the boxing ring, you can have the best plan/strategy in your head, but the plan/strategy goes away when the opponent hits you in the head.\" Having a plan is one thing, sticking to your plan is another thing and adapting your plan, when it doesn't work is a third thing.I like your idea of always buying up, but many people simply hate consistency and they can't follow one plan for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "January 16, 2023, 08:47:17 AM",
      "body": "-  Well, if you devoted more than a decade to the art of war and the book of 5 rings which is the reason for the deep principles that you have, that's good on your part.But do you know that most communities here have different experiences with bitcoin as to how they understood and understood it, most of them here in the crypto space because of their experience, researching things related to Bitcoin or cryptocurrency, and so on.It just means that if every individual who enters this industry has the dedication, determination and perseverance, and passion, others cannot be deep in the bitcoin or crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "January 16, 2023, 09:22:54 AM",
      "body": "Quote from: king6string on January 13, 2023, 03:39:58 AMThat being said - I'll leave the rest of the discussion to those who are blessed enough to find this post. Happy New Year - Make 2023 a great year, regardless of market conditions or world outlook. Take the time to develop yourself as a Man or Woman, and be the best that you can be.  Thanks buddy also to you a happy new year. I really liked your short essay here and you are absolutely right that we need to make plans in life and focus on the long term development and not the short term gain or loss. My first boss after university always used to say that to achieve success in life you need to look at it as a marathon and not a sprint. We all are facing setbacks from time to time, but that shouldn't discourage us from trying again. There are only a lucky few in life who achieve great success overnight, most of us have to work a long time for it. Development is very important, we should never stop learning new things as standings still already means going backward. Time is moving forward and so we need to do the same. Never give up and good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "January 16, 2023, 03:25:11 PM",
      "body": "Quote from: davis196 on January 16, 2023, 07:49:10 AMThis topic is more about self-help rather than economics. Maybe it belongs to another forum.Anyway, I guess that by \"strategy\" you mean discipline and consistency. Having a strategy means having a plan, and plans don't always work.Mike Tyson once said: \"When you go on the boxing ring, you can have the best plan/strategy in your head, but the plan/strategy goes away when the opponent hits you in the head.\" Having a plan is one thing, sticking to your plan is another thing and adapting your plan, when it doesn't work is a third thing.I like your idea of always buying up, but many people simply hate consistency and they can't follow one plan for a long time.Because not all people have the capability to stick to their plan because as time goes by, their priority changes. As you go thru life, your strategy changes also as you learn more lessons in your lifetime.The post of the OP creates a positive vibe, it shows whatever profession you have in this life, it is up to you how you will use strategy to add value in your life. It is up to you how you will use it to improve your life and serve your purpose as a human. But I guess, we should also filter what we need to take in in our life, and just let go of the things that you think will just be a baggage that you don't want to carry on as you progress in this life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "January 16, 2023, 05:16:16 PM",
      "body": "Firstly, I want to say that this is a great post. I have learned a lot from this. Although I haven't read those books, but I can tell that they are great, and I am willing to read them in the future. I don't actually follow strategies that much. I am willing to grab any opportunity, even if it's hard or easy. First, I will see people working and how they do it. Then I will try to recreate that with free hand style. Not learning anything, but just by watching them. If the result comes out decent, then I will try to improve it on my own. If not, I will follow some tutorials on that subject. Then I will come back and try again. After that I will create some shortcut and do it in my way. That's how I have been improving my skills. I guess that's my strategy. I am also a guitarist. I do play music and sing. You could say that it's a hobby. But helps me relax and sometime keeps me away from making emotional decisions. So everything is going well these days, and hopefully I will find my own strategy one day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquallLeonhart",
      "created_time": "January 20, 2023, 02:14:33 PM",
      "body": "Quote from: Hydrogen on January 13, 2023, 11:49:47 PMThe book of 5 rings is a good read. While many have applied it to combat sports and life hacks over the years. I have yet to see anyone apply it to finance, bitcoin or crypto.Image link:  https://i.ibb.co/4fXfHYt/resentment-complaint-inappropriate.jpgThe above quotation from Musashi Miyamoto's dokkodo could be good advice for coping with unpredictable, seemingly irrational and crazy events in the cryptosphere.The book of 5 rings encourages an unclouded, unbiased, perspective. Which can be important qualities to develop for investment. Recognizing opportunity and not being swayed by trends and popular public opinion. Emphasizing a lack of preference could also be a good trait to develop. Applied to finance, it could imply having no preference for shitcoins over defi. Or ICOs over tokens. But to simply recognize value and make unbiased investment choices based on logic.That could be literally the whole thing Warren Buffet basically does. He has been friends with Bill Gates for decades, and I mean like literally over 20 years, and they are not just friends as in just they see each other once a year, they are literally bridge partners and Warren never had any Microsoft shares yet he bought a bunch of apple shares a few years back.This is proof that he looks for value, and even if something looks like oversaturated, he could see how it could gain a lot more cash flow coming up and still go in there. So basically 5 rings on finance is what Warren Buffet does. It's hard to do it in crypto, not that easy but still possible if you look for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "January 20, 2023, 03:07:15 PM",
      "body": "This talks about adopting a personal strategies to approaching life economical and financial situations and also managing the people around us in other for us to have an adaptable life experience at the end, we are not expected to live out daily lives as what comes in goes out, we need to plan and sit to think about how we can make changes to benefit everything that surrounded us, some people would have sensed something coming before it's consequence arrived and they would have planned and adequately prepare for the way out, this is what some business and entrepreneurs failed to realize or do that every thing keep going down on them whenever they invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "January 20, 2023, 07:03:49 PM",
      "body": "Having some sort of understanding about the future of bitcoin, will allow you to get rich but you may psychologically reject the possibility of it. If you end up working for 20 more years, and every single time you get a salary you put 10% into that towards bitcoin, and keep doing that for the next 20 years, it is 100% guaranteed that you will be wealthy. Not just rich or something, I mean like 10+ houses worth of money no matter how much salary you make, if you make a lot then it would be even higher.But, you need to remember two things; first of all never sell, even if it goes down, keep buying with 10% of your salary and never sell, and secondly you should not stop for too long, maybe one or two months is fine, but if you do it for 20 years with 5 year breaks in the middle that won't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "January 20, 2023, 07:34:54 PM",
      "body": "Definitely, we need to invest in our selves first, developed, learn from out mistakes and make a progress and then make our life easier regardless of our job, that is we should love what we are doing (like the OP) and then go on the next level. As for crypto and bitcoin, yeah, it will take some time and effort, not just the money. Time because it's a hard grind, it's like what others are picturing it in social media - \"get rich scheme\", effort because your should be focus not just for a year or two, but throughout your crypto journey So it's very hard, but if you are motivated, not just for you, but for your family to be able to get rich and live comfortably, then you will have to go to all of this and come up successful in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "January 20, 2023, 07:53:37 PM",
      "body": "Quote from: king6string on January 13, 2023, 03:39:58 AMand I am truly passionate about it. I am one of the very few exceptional men alive today who can honestly say I Love Doing What I Do For a Living.That is very important in the long run and you can achieve amazing heights if you have this kind of thoughts about your life. A passion can take man to any realms and fulfil their dreams in the long run. Similarly when we are in the crypto world or in the investment mode one should be thinking about their investments keenly, check out the 360 view of the same and be happy about it. Well in all one can club this together to form a passionate investment and do it rightfully. Doing the financial stuff under pressure is not advisable to be honest so it's far better to keep up with plans. Appropriate plans regarding financial goals is big part of it obviously so just follow until we achieve the desirous levels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "January 20, 2023, 07:59:26 PM",
      "body": "Quote from: so98nn on January 20, 2023, 07:53:37 PMQuote from: king6string on January 13, 2023, 03:39:58 AMand I am truly passionate about it. I am one of the very few exceptional men alive today who can honestly say I Love Doing What I Do For a Living.That is very important in the long run and you can achieve amazing heights if you have this kind of thoughts about your life. A passion can take man to any realms and fulfil their dreams in the long run. Similarly when we are in the crypto world or in the investment mode one should be thinking about their investments keenly, check out the 360 view of the same and be happy about it. Well in all one can club this together to form a passionate investment and do it rightfully. Doing the financial stuff under pressure is not advisable to be honest so it's far better to keep up with plans. Appropriate plans regarding financial goals is big part of it obviously so just follow until we achieve the desirous levels. And along the way, you would really be able to meet up lots of factors which would really be able to distract you and this is why it would  really be that ideal that you should really be prepared at least on what arethe things that you could possibly be dealing off with along the way.The things that we do wish for is on living our lives in outmost or to the fullest but it cant really be avoided sometimes for you to be that gettingtoo stressed just because of the desperation that we would really be loving or wanting to achieve a particular goal which we dont really make ourselves that get convinced that everything would really be taking some time.The  most important thing or part is that you should follow on what you had really in mind and dont make yourself that easily get influenced up by other things which other people might be saying basing upon their own approaches too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}