{
  "id": "topic_5455075",
  "title": "BlockchainWizard",
  "author": "BlockchainWizard",
  "created_time": "June 04, 2023, 05:18:50 PMLast edit: June 04, 2023, 05:30:13 PM by BlockchainWizard",
  "content": "Hello everyone! I'm new here and I'm happy to write here finally. Bitcoin has always been an interesting topic, when I first heard about it because I'm a friend of savings and store as value. I don’t have much Bitcoin but as we know: not much Bitcoin can have much value in a few years. It is all about HODL. I have read a lot of topics what's important to save my Bitcoin from hacks and after storing it on Blockchain.com wallet, I have decided to send it to my own wallet. Not my keys, not my coins is an important advice. We need to be very safe to avoid getting hacked because coins stored on a centralized exchange are keys held by operators, not customers. I have decided to select Electrum wallet because Electrum wallet is Open Source and is developed by a very experienced coder team for a long time now. In my opinion, we need to reward such coders by deciding for Electrum, like I've decided for Firefox instead of Google Chrome because we need to support unique coder teams, like behind Electrum and Firefox. I will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455075",
  "comments": [
    {
      "author": "paid2",
      "created_time": "June 04, 2023, 05:32:30 PM",
      "body": "Welcome to the forum!You're right, owning your private keys and storing them securely, and above all offline, is a very important step. Electrum is a good choice, Firefox too. As a pro-Linux \"lobbyist\", I'd like to suggest Debian as an OS if you're looking for a very clean one  I don't know \"where\" you are, I mean in which step of your discovery of Bitcoin you are actually, but if you want to go further in your Bitcoin journey, you maybe could have a look (if not already done) on the Bitcoin Standard (from Saifedean Ammous) and if you are interested about the technical background of Bitcoin, Mastering Bitcoin is great and free on Github.QuoteI will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.Yeah that in my opinion a very good approach. DCA is a very good strategy, if you are here for a long run.If you are a long term holder, you should consider buying an hardware wallet, if you want to do some researches about this topic, we have a section dedicated to Hardware wallets on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "June 04, 2023, 06:03:14 PM",
      "body": "Welcome to the forum.Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI'm new here and I'm happy to write here finally. Bitcoin has always been an interesting topic, when I first heard about it because I'm a friend of savings and store as value. I don’t have much Bitcoin but as we know: not much Bitcoin can have much value in a few years. It is all about HODL. I'm sure you will understand more and more about Bitcoin broadly, including about Bitcoin investments that you will carry out with patterns and strategies that can lead to success because you are in a great discussion room.Do not rush.Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI have read a lot of topics what's important to save my Bitcoin from hacks and after storing it on Blockchain.com wallet, I have decided to send it to my own wallet. Not my keys, not my coins is an important advice. We need to be very safe to avoid getting hacked because coins stored on a centralized exchange are keys held by operators, not customers. I have decided to select Electrum wallet because Electrum wallet is Open Source and is developed by a very experienced coder team for a long time now. You easily understand basic knowledge about Bitcoin and as I said above that your presence in this forum will really help to understand more about Bitcoin.Many newcomers often overlook basics like Bitcoin wallets.Saving on the exchange is wrong because the coins stored on the exchange are not ours but theirs.I am happy if Electrum is your preferred Bitcoin wallet.Safeguard and store the seed and private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "June 04, 2023, 06:17:55 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMHello everyone! I'm new here and I'm happy to write here finally. Bitcoin has always been an interesting topic, when I first heard about it because I'm a friend of savings and store as value. I don’t have much Bitcoin but as we know: not much Bitcoin can have much value in a few years. It is all about HODL. It's a nice ideas investing in bitcoin, also you don't just have to HODL your bitcoin, you can also be performing transactions with your bitcoin also, if bitcoin is accepted in any store in your area, you can just purchase things and make payment with bitcoin, let's try and make bitcoin serve its purpose, it shouldn't be hold alone, transactions should be done also with bitcoin. Am not saying we shouldn't hold bitcoin, but we should also try and make transactions with it. Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI have decided to send it to my own wallet. Not my keys, not my coins is an important advice. We need to be very safe to avoid getting hacked because coins stored on a centralized exchange are keys held by operators, not customers. It's nice that you already learn about how you can secure your bitcoin, you already know the appropriate wallet to store your bitcoin, but also you should learn how to secure your wallet private key, make sure your private key is stored in a place where their is no internet connection, you can easily carve your private key on a metal steel and keep it in a secure place. Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.You can accumulate more bitcoin, but use the extra money you won't be using for now to invest in bitcoin, and don't be to desperate to invest in bitcoin, have seen people selling properties just to invest in bitcoin, am not in support of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 04, 2023, 06:24:03 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMHello everyone! I'm new here and I'm happy to write here finally. Bitcoin has always been an interesting topic, when I first heard about it because I'm a friend of savings and store as value. I don’t have much Bitcoin but as we know: not much Bitcoin can have much value in a few years. It is all about HODL. Well come abroad OP, I hope you will grow here. And there is no doubt in that less BTC will bring less profits even if you hold them for years, but that is also not 100% true, let's say you have 100$ of BTC now at the current price and you hold them till BTC new ATH after its Halving in April 2024. Let's say BTC set ATH of $100k then you will be getting a profit of around $267 + your own one hundred dollars, which becomes 367$. Well, keeping the amount of 100$ in mind, the above profit is enough, and it will increase as you will increase your capital but as you said you do have not much BTC, my advice is, do not worry and do not fall prey to the emotion that, you have less BTC you will earn less, Instead you should accumulate BTC drop by drop as there is a saying, Drop by Drop fills the ocean. Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PM Like I've decided for Firefox instead of Google Chrome because we need to support unique coder teams, like behind Electrum and Firefox. I will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.I value your thoughts about Electrum but as you mentioned you are a newbie and idk you are a newbie to Firefox too or not, but there is a community member in our local board who have faced some issue with Firefox. As mistake was his own, as he forgets to save the seed phrase of his wallet he was using Firefox browser, and his browser auto-updated, which results in deleting all the browser extensions and when exploring that he was asked for seed phrases but he did not save them yet but fortunately he was able to get them using Parent and child mechanism of wallets. (if you are interested then you should read his topic)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "June 04, 2023, 06:33:45 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI don’t have much Bitcoin but as we know: not much Bitcoin can have much value in a few years. It is all about HODL. It doesn't matter if you don't have a lot of bitcoins and you can buy slowly according to the ability of the money you have. But if your finances aren't that stable and you may not be able to afford large purchases, using the DCA method is a great move that you can apply consistently.Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI have decided to select Electrum wallet because Electrum wallet is Open Source and is developed by a very experienced coder team for a long time now. In my opinion, we need to reward such coders by deciding for Electrum, like I've decided for Firefox instead of Google Chrome because we need to support unique coder teams, like behind Electrum and Firefox.  It's a good decision and not even that many newbies try to do something like you did. I mean, you not only understand how to invest but also have insight on how to store bitcoins safely, this is rarely noticed by beginners and usually they just ask and never try to learn it first. Welcome to the OP forum and you will be directed to further discussion when you want to hit the search button according to what you want to learn.I don't think it will be difficult since you just made one post, but your knowledge is quite good about bitcoin and safe wallets to store it, we rarely encounter this when many beginners are busy asking how to get Merit. Don't forget to save the seed and private key in a safe place because that is the real essence of how to protect the bitcoins that you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "June 04, 2023, 06:49:24 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.Welcome to the forum.I'm also an Electrum user, I'm comfortable using it so far. but just a suggestion. if you have the plan to hold long term by continuing to collect Bitcoin that you can afford. you might be better off buying a hardware wallet. it will be safer for you.but if you are a trader, or maybe like moving your assets from one wallet to another in a transaction. using Electrum is enough for you.I wish you success with your Bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "June 04, 2023, 06:49:48 PM",
      "body": "Welcome to the forum and on a general note, it seems from your first paragraph you have a misconception understanding of the subject of bitcoin and what amount to profitability holding bitcoin, this is because you are mistakenly held to profitability without taking note or misunderstanding the total amount of BTC to equal the percentage earning when price increase. But then you are partially right on owning your own key, because when it is not your keys then it's not your wallet after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 04, 2023, 06:58:38 PM",
      "body": "Welcome to bitcointalk forum. You have a unique name, I'm quite surprised you could use it without needing to add numerals or special characters; I'll be looking forward to seeing your username more in discussions.Electrum is a good choice for a software wallet, for extra security use it on an airgapped device which would never be connected to the internet. Some suggest you only go for more security when you get a large amount of bitcoins but if you have a spare PC laying around you can put it to use.On the browser you're using, Duckduckgo is another alternative I have been using for several years now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 04, 2023, 08:52:15 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.You are on the correct track; I notice you have some basic Bitcoin knowledge; thus, I am delighted you found our forum since it will help you expand your skills and motivate you to buy and hold more Bitcoin.The only thing you have to do is follow the forum rules and prevent plagiarism.Thank you, and welcome to this fantastic forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "June 04, 2023, 09:47:22 PM",
      "body": "Hi BW, welcome to the forum.You're right about using a web wallet which is Blockchain.com and good thing that you've transferred your fund from there to Electrum. Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.Good luck and just enjoy the ride. It's a bumpy one but it's all fun and intriguing at most times but once you get used to it, you'll have nothing to say but happy whenever you see that we're back in bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "June 04, 2023, 10:00:41 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI don’t have much Bitcoin but as we know: not much Bitcoin can have much value in a few years. It is all about HODL. Make sure to avoid shady offers where some random internet people are making big promises to \"increase your Bitcoins\". It's happening frequently and such scammers are very eager to scam less experienced people. In addition I can recomment to stay away from trading. It might be tempting to engage in trading but you won't get happy as 90% of all traders end up losing. Because nobody can predict the market, it's impossible. But HODL will take advantage from Bitcoin's limited supply. HODLing is definitely a good decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 04, 2023, 11:05:05 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI don’t have much Bitcoin but as we know: not much Bitcoin can have much value in a few years. It is all about HODL. This isn't the case anymore. If you look at the last few years, the best case scenario was buying close to $3,000 and selling for $60,000. That's x20 returns. $100 multiplied by 20 is $2,000 - really not a lot of money even after this perfect HODL.Bitcoin offers high returns, but it's no longer \"from rags to riches\" returns. You'd need to invest a lot of money if you want to get a lot of profits, so you are right to be focused on security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "June 04, 2023, 11:39:49 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMNot my keys, not my coins is an important advice. We need to be very safe to avoid getting hacked because coins stored on a centralized exchange are keys held by operators, not customers. I appreciate a newbie thinking like this, before engaging and embracing the world of crypto should have research first and you're right, that's a golden rule here that everyone keeps reminding a newbie like you. If you have a small fund you can afford to buy a hardware wallet much better and HODL it in the long run.You can do it in a DCA way of purchasing Bitcoin, it's the potential to lower the average purchase price and since DCA involves buying more Bitcoin when prices are lower and less when prices are higher, it can potentially lower the average purchase price of your holdings over time.  This can be advantageous if Bitcoin's price appreciates in the long term.So good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "June 05, 2023, 02:45:49 AM",
      "body": "Quote from: sheenshane on June 04, 2023, 11:39:49 PMQuote from: BlockchainWizard on June 04, 2023, 05:18:50 PMNot my keys, not my coins is an important advice. We need to be very safe to avoid getting hacked because coins stored on a centralized exchange are keys held by operators, not customers. I appreciate a newbie thinking like this, before engaging and embracing the world of crypto should have research first and you're right, that's a golden rule here that everyone keeps reminding a newbie like you.Not your key, not your bitcoin. If anyone can not understand it, fail to secure private key or own private key, he or she does not own coins.Cryptocurrency Security Checklist.Reminder: do not keep your money in online accountsQuoteIf you have a small fund you can afford to buy a hardware wallet much better and HODL it in the long run.You can do it in a DCA way of purchasing Bitcoin, it's the potential to lower the average purchase price and since DCA involves buying more Bitcoin when prices are lower and less when prices are higher, it can potentially lower the average purchase price of your holdings over time.  This can be advantageous if Bitcoin's price appreciates in the long term.Dollar Cost Averaging is hard to follow and boring too but if you can use it disciplined, you will see sweetie results after a long time, like you DCA in bear market and after 2 or 3 years, you will gain sweet result in a next bull run.With DCA, you must choose good assets to DCA because sweet results are achievable with good assets. If you DCA tokens like GameFi with high inflation, a longer you hold your token or DCA, a lower price of that token you will see on the market. So DCA does not work with inflationary or hyper inflationary tokens.With Bitcoin, you can check and practice DCA with https://dcabtc.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "June 05, 2023, 05:53:18 AM",
      "body": "Quote from: Hyphen(-) on June 04, 2023, 08:52:15 PMQuote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI will try to collect more Bitcoin, save it carefully and HODL it, because in my opinion, Bitcoin is a very promising investment.You are on the correct track; I notice you have some basic Bitcoin knowledge; thus, I am delighted you found our forum since it will help you expand your skills and motivate you to buy and hold more Bitcoin.The only thing you have to do is follow the forum rules and prevent plagiarism.Thank you, and welcome to this fantastic forum.His post doesn't look like that of a newbie which means he has been reading about Bitcoin. I want to encourage you not to stop reading because knowledge is the only tool that will distinguish you in the Bitcoin industry and the forum. For now, I have not seen any other investment in the crypto industry that is performing well like Bitcoin. That is why your decision to invest in Bitcoin is not a bad one. You can own Bitcoin by mining, buying, or earning. So you have to determine the most convenient one for you. As you have rightly said, centralized wallets are unpredictable and can lead to a total loss of funds. The problem of FTX and other exchanges in 2022 is still fresh in the memory of many crypto investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 05, 2023, 09:00:15 AM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMI have decided to select Electrum wallet because Electrum wallet is Open Source and is developed by a very experienced coder team for a long time now.Electrum wallet is a very good example of a cold storage non custodial bitcoin wallet, it is also very important that you make use of this electrum wallet on an airgapped device which is not connected to the internet, which means, your device you will be using in accessing your bitcoin on the blockchain shouldn't be the one used for browsing or internet connectivity, this helps for maximum security measures while using electrum.Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMIn my opinion, we need to reward such coders by deciding for Electrum, like I've decided for Firefox instead of Google Chrome because we need to support unique coder teams, like behind Electrum and Firefox.Why are you comparing one browser from the other here, you can choose anyone you like, adjust the settings to your taste and change some functions as well as disabled some other functions you don't like, you're using them or not is not a profit to them as long as the product of their development still remains relevant for use by everyone, those development are self sustainable for themselves as long as they provide you with what you want, people will always go after them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "June 05, 2023, 10:25:54 AM",
      "body": "You have gotten the basic concept of bitcoin but you need to keep on learning because there is a lot about bitcoin which you haven't heard yet. So always stick to the forum to acquire more knowledge and also your contributions on topic discussed will help you grow. I am also using electrum wallet and you have chosen one of the best wallet to keep your bitcoin safe. As for hodling and at the same accumulating more bitcoin is the best strategy to make profit in a long term. You should take your time to navigate round the various boards in the forum to find board of your interest, so that you can enjoy the forum. You should read more on hardware wallet to understand how it works.Welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 05, 2023, 12:30:44 PM",
      "body": "The meaning of the topic is not entirely clear. OP. Well done, If you read the forum, then you have carefully prepared, and your post looks like a test.But it's not clear what you wanted to tell us about your first topic. Very often, topics appear here that do not carry either a question or a conclusion. Don't forget that you are a beginner, and not many of the people here are, so please, in the next topic that you open, let there be something original.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 05, 2023, 01:44:11 PM",
      "body": "Quote from: BlockchainWizard on June 04, 2023, 05:18:50 PMHello everyone! Not my keys, not my coins is an important advice. We need to be very safe to avoid getting hacked because coins stored on a centralized exchange are keys held by operators, not customers. At first I will welcome you onboard this platform and from the looks seems you have already done some research on and about the bitcointalk platform to have had such knowledge of \"not your keys, not your coin\" that is good of you op. Unlike Others that do not have idea about this phrase as mentioned. Knowing it keeps you and your assets on the right track. Centralised exchange are not safe storing your assets and should not be your store of value. You have your wallets where you can easily transfer your assets to after trading. Your self custodial wallet should be your last resolution when storing up your assets and funds. With this, you can be sure of the safety of your assets without being afraid is keys are well secured by you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}