{
  "id": "topic_5447390",
  "title": "cheezcarls",
  "author": "cheezcarls",
  "created_time": "April 03, 2023, 01:17:28 PMLast edit: April 03, 2023, 03:26:47 PM by cheezcarls",
  "content": "Hello guys!I’ve been gone for a long while and isn’t active in the forum for almost 2 months. The real reason is that I’ve been busy traveling from one island to the other to initiate and spearhead in building Bitcoin, crypto and Web3 communities in the Philippines. I’ve done this with no to very little sponsors, but I’ve kept going. What I have accomplished so far:* Successfully built local communities and organized meetups in 5 different cities/provinces in the Philippines * Successfully having more unexpected volunteers in joining my cause * Had my first keynote speaking engagement in a crypto related conference* Had my first university talk with the Computer Science students educating about Bitcoin, crypto and Web3What’s upcoming for me this Q2 & beyond?* Expanding to other islands in building local Bitcoin, crypto and Web3 communities.* Starting a free basic crypto & Web3 workshop to newbies, beginners, students, etc., in these islands.* More partnerships and collaborations* Invited as one of the keynote and panel speakers in a Web3-related conference in just 2 weeks from now* Invited to be a keynote speaker in 7 different schools in a single PH region composed of 4 different islands in collaboration with a metaverse-related startup starting next month* Invited as a keynote and panel speaker of a 3-day blockchain SME expo late next month* Invited as a keynote speaker in a couple of gaming-related events where I will introduce Web3 for gamers late next month and mid-June. I am not doing this for myself or for my own fame or recognition. The reason I am doing this is because these islands I have targeted aren’t having some Bitcoin, crypto and Web3 awareness, education and adoption as they’re already left behind (unlike in the National Capital Region where there are many activities, workshops, hackathons, etc.) and no one’s stepping up. I see some of the locals in these areas are just wondering on when will they experience having more events and activities in their respective islands. So I had to do something about it, and fast forward to today it’s now growing organically. I can see more universities, businesses and merchants getting involved, more events and meetups, workshops, hackathons, etc. I wanted the community to be happy and benefited with all of these activities. It’s kind of an evangelist-thing that I’ve been doing now without expecting anything in return. It’s just that I am so passionate in what I have been doing so far until now and that keeps me fired up and excited.So yeah this is what I have been doing so far and I am happy to share it here to the Bitcointalk community.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447390",
  "comments": [
    {
      "author": "pawel7777",
      "created_time": "April 03, 2023, 10:04:48 PM",
      "body": "That's an impressive list of accomplishments. How are you finding the time for all that? Are you retired or \"made it\" and can afford not to work and you're doing that as a hobby, or are you able to make a living from Bitcoin/Crypto activism?Feel free to share any photos/videos from your meetups/workshops - it's always refreshing to see a real life people getting involved in crypto instead of just seeing faceless forum posts all the time.For the future meetups, feel free to utilise meetups board: https://bitcointalk.org/index.php?board=86.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 03, 2023, 10:57:14 PM",
      "body": "Congrats cc!That's certainly a lot of things you've done over 2 months. I've been seeing those things on social media and it could be one of those pictures that you're also there. Keep it up, there have been a lot of our countrymen that still lack education about things in the crypto space.By any chance, are you part of the Bitskwela since it has just popped on my feed and it seems they've been on a roundtrip in particular islands (Boracay) as well?I can remember that I've been part of an old crypto community in our country but then it became passive and can't find it anymore, maybe dissolved. It's hard to maintain such crypto communities in particular places and it's even the hardest to build so, well done to you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "April 04, 2023, 05:14:27 AM",
      "body": "Quote from: pawel7777 on April 03, 2023, 10:04:48 PMThat's an impressive list of accomplishments. How are you finding the time for all that? Are you retired or \"made it\" and can afford not to work and you're doing that as a hobby, or are you able to make a living from Bitcoin/Crypto activism?Feel free to share any photos/videos from your meetups/workshops - it's always refreshing to see a real life people getting involved in crypto instead of just seeing faceless forum posts all the time.For the future meetups, feel free to utilise meetups board: https://bitcointalk.org/index.php?board=86.0 I'm a freelancer where I own my time. Too early for me to retire lol. I don't make a living by being a Bitcoin and crypto activist, event organizer and as a keynote or panel speaker. I'm just lucky if they would sponsor me of any kind without asking like a place to stay, event place, transportation, food, etc., but I'd never asked them for it. They're the ones who offered me some kind of stuff and I'm just being grateful.Yes this is much likely a hobby for me now. I'm having a lot of crypto gigs ever since and I got endless opportunities even if it's not giving me that much. Probably in the long run when I have consistent community events, there might be sponsors who are willing to be part of it and support my cause in which I have already a few of them now.Instead of asking myself \"What's in it for me\", I usually ask \"What's in it for them?\". Coz' I wanted the community to be benefited first by giving them more value. I do not want to be like the others that they are starting this initiative just for their own gain, fame, popularity, etc. Because of having a \"community first\" mindset, that's where I was getting unexpected people, startups, etc., reaching out to me supporting my initiative. When they win, I win. The community really matters the most. Without the community's unconditional support, we would be nothing whatever startup or any type of campaign that we're doing nowadays.This photo was me speaking to the locals during a crypto conference just 2 weekends ago.Quote from: blockman on April 03, 2023, 10:57:14 PMCongrats cc!That's certainly a lot of things you've done over 2 months. I've been seeing those things on social media and it could be one of those pictures that you're also there. Keep it up, there have been a lot of our countrymen that still lack education about things in the crypto space.By any chance, are you part of the Bitskwela since it has just popped on my feed and it seems they've been on a roundtrip in particular islands (Boracay) as well?I can remember that I've been part of an old crypto community in our country but then it became passive and can't find it anymore, maybe dissolved. It's hard to maintain such crypto communities in particular places and it's even the hardest to build so, well done to you!Technically I've started mid last year but I've taken it very seriously since January. If you see that in January I was also not that active. I only have 3 posts. Then February I only have one post and had been gone for a long while.  Yes it is hard to maintain but luckily I have volunteers in every city/province who choose to be the ones in charge for keeping the community engaged, etc., especially that they have their own startups.  I believe it's hard to keep them if the community are just money-motivated rather than being bullish on the tech and utility itself. I can relate to that because I have built a community last 2018 and it failed because of the bear market where they are so affected. They only emerged from their \"caves\" when bull run comes again and then goes silent and hiding when things are really quiet.I would rather build a community that whenever bullish or bearish they would still be active as enthusiasts, builders, etc. So I built from scratch and testing the unknown waters to educate and \"re-educate\" them about the reality of Bitcoin, crypto, Web3, etc., where there are no guarantees and promises in terms of the price. Unfortunately I wasn't in Boracay where Bitskwela participated in the conference organized by Pouch.ph and Coins.ph. It's schedule conflict to me however. But in Boracay, most of them were Bitcoin maximalists and \"utilitarians\" where Pouch.ph was heavily adopted as mode of payment in various establishments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 04, 2023, 10:01:40 AM",
      "body": "Quote from: cheezcarls on April 04, 2023, 05:14:27 AMQuote from: blockman on April 03, 2023, 10:57:14 PMCongrats cc!That's certainly a lot of things you've done over 2 months. I've been seeing those things on social media and it could be one of those pictures that you're also there. Keep it up, there have been a lot of our countrymen that still lack education about things in the crypto space.By any chance, are you part of the Bitskwela since it has just popped on my feed and it seems they've been on a roundtrip in particular islands (Boracay) as well?I can remember that I've been part of an old crypto community in our country but then it became passive and can't find it anymore, maybe dissolved. It's hard to maintain such crypto communities in particular places and it's even the hardest to build so, well done to you!Technically I've started mid last year but I've taken it very seriously since January. If you see that in January I was also not that active. I only have 3 posts. Then February I only have one post and had been gone for a long while.  Yes it is hard to maintain but luckily I have volunteers in every city/province who choose to be the ones in charge for keeping the community engaged, etc., especially that they have their own startups.  I believe it's hard to keep them if the community are just money-motivated rather than being bullish on the tech and utility itself. I can relate to that because I have built a community last 2018 and it failed because of the bear market where they are so affected. They only emerged from their \"caves\" when bull run comes again and then goes silent and hiding when things are really quiet.I would rather build a community that whenever bullish or bearish they would still be active as enthusiasts, builders, etc. So I built from scratch and testing the unknown waters to educate and \"re-educate\" them about the reality of Bitcoin, crypto, Web3, etc., where there are no guarantees and promises in terms of the price. Unfortunately I wasn't in Boracay where Bitskwela participated in the conference organized by Pouch.ph and Coins.ph. It's schedule conflict to me however. But in Boracay, most of them were Bitcoin maximalists and \"utilitarians\" where Pouch.ph was heavily adopted as mode of payment in various establishments.   I thought that you're one of them but good thing that you also know them. I understand where you're coming from about being an advocate and you've got no source or you're gonna get the budget deep from your pocket. But with your eagerness and vision to educate everyone and re-educate those that have probably forgotten the lessons you've taught them. It's a thing that we mostly see from them that many in the community were just motivated during the bull run and lie-lows whenever we experience the bear market. You've been a lot, through thick and thin and you're all sharing them because you have passion and love to bitcoin and the tech. Well done and keep it up, mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "April 04, 2023, 11:32:33 AM",
      "body": "Quote from: cheezcarls on April 03, 2023, 01:17:28 PMI am not doing this for myself or for my own fame or recognition. The reason I am doing this is because these islands I have targeted aren’t having some Bitcoin, crypto and Web3 awareness, education and adoption as they’re already left behind (unlike in the National Capital Region where there are  will only be many activities, workshops, hackathons, etc.) and no one’s stepping up. I see some of the locals in these areas are just wondering on when will they experience having more events and activities in their respective islands. After reading your thread @OP I began to compare your works with those of the Apostles in the Bible that were moving from place to place preaching about Jesus Christ. Its had to believe that people like you still exist. In this current age nobody does anything for free because they will always seek for financial gain or fame. You have done really well and your selfless service is worth emulating. Its also good you shared it with the community because it will serve as a motivation to some of us to also engage in this selfless drive when ever we have the opportunity.  Quote from: cheezcarls on April 04, 2023, 05:14:27 AMI believe it's hard to keep them if the community are just money-motivated rather than being bullish on the tech and utility itself. I can relate to that because I have built a community last 2018 and it failed because of the bear market where they are so affected. They only emerged from their \"caves\" when bull run comes again and then goes silent and hiding when things are really quiet. I don't know the economic situation of the people in the Island you visited. Most time if there is high rate of unemployment and poverty, the people might only be attracted to investment that will give them instant profit. And most of them might not have the financial power to engage in bitcoin investment or use it as a legal tender. The level of infrastructural development is these areas will also affect the level of attention they will give to bitcoin. This is not to dispute the fact that regardless of these challenges some person will still become bitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "April 04, 2023, 12:50:03 PM",
      "body": "Quote from: Fiatless on April 04, 2023, 11:32:33 AMQuote from: cheezcarls on April 03, 2023, 01:17:28 PMI am not doing this for myself or for my own fame or recognition. The reason I am doing this is because these islands I have targeted aren’t having some Bitcoin, crypto and Web3 awareness, education and adoption as they’re already left behind (unlike in the National Capital Region where there are  will only be many activities, workshops, hackathons, etc.) and no one’s stepping up. I see some of the locals in these areas are just wondering on when will they experience having more events and activities in their respective islands. After reading your thread @OP I began to compare your works with those of the Apostles in the Bible that were moving from place to place preaching about Jesus Christ. Its had to believe that people like you still exist. In this current age nobody does anything for free because they will always seek for financial gain or fame. You have done really well and your selfless service is worth emulating. Its also good you shared it with the community because it will serve as a motivation to some of us to also engage in this selfless drive when ever we have the opportunity.  Quote from: cheezcarls on April 04, 2023, 05:14:27 AMI believe it's hard to keep them if the community are just money-motivated rather than being bullish on the tech and utility itself. I can relate to that because I have built a community last 2018 and it failed because of the bear market where they are so affected. They only emerged from their \"caves\" when bull run comes again and then goes silent and hiding when things are really quiet. I don't know the economic situation of the people in the Island you visited. Most time if there is high rate of unemployment and poverty, the people might only be attracted to investment that will give them instant profit. And most of them might not have the financial power to engage in bitcoin investment or use it as a legal tender. The level of infrastructural development is these areas will also affect the level of attention they will give to bitcoin. This is not to dispute the fact that regardless of these challenges some person will still become bitcoiners.      The economic situation in these islands I have visited are just fine especially my hometown. However, there is no to very little Web3 awareness, education and adoption. They said that Philippines is one of the crypto-friendliest countries in the world. But most of the activities such as meetups, events, university roadshows, hackathons, workshops, conferences, summits, etc., only happen in Manila and other parts of the National Capital Region. There are also consistent activities happened in the Bicol region and Davao City in Mindanao.There are 3 major regions in the Philippines. Luzon, Visayas and Mindanao. I was living in the Visayas group of islands. We are categorized nationally as Western Visayas (Region 6), Central Visayas (Region 7) and Eastern Visayas (Region . So this is where I have initiated building hyper local communities in the group of islands region. It got me thinking on why the Visayas group of islands is so far behind in this trend where the others are already adopting? And no one’s willing to step up?So I did the unthinkable to start this slow mid-last year. I don’t mind being a turtle. The turtle always wins the race.I started in one city. Then I’ve expanded to other islands. Last year, we only have less than 7 meetups/events combined in these group of islands. This Q1 alone, we have more than 15+ as I have counted combining all islands organized by me and the others.  We’re getting more attention now than before and this Q2 and beyond are getting bigger because of those big organizers Luzon, Mindanao and overseas are gonna hold events in one of the islands that I’ve initiated. Quote from: blockman on April 04, 2023, 10:01:40 AMI thought that you're one of them but good thing that you also know them. I understand where you're coming from about being an advocate and you've got no source or you're gonna get the budget deep from your pocket. But with your eagerness and vision to educate everyone and re-educate those that have probably forgotten the lessons you've taught them. It's a thing that we mostly see from them that many in the community were just motivated during the bull run and lie-lows whenever we experience the bear market. You've been a lot, through thick and thin and you're all sharing them because you have passion and love to bitcoin and the tech. Well done and keep it up, mate.I’ve got nothing to lose mate. It’s been a long time coming that I wanna do this after staying at home for 2+ years due to the lockdowns. When I’ve started doing these meetups, only less than 1% of them have either left early or late due to certain reasons. But for most of the time? Surprisingly no one left? Why? Because they’re willing to listen. They’re willing to spend time learning about Web3. You know in most MLM presentations? From my first hand experience, the guests are just freaking excited when the presentor talking about the six figure income, dream cars, houses, etc., or something like that. However, that excitement died down once the presentor revealed the compensation plan (the good ol’ binary structure, unilevel, etc.) and investment packages to start, I see that most of the guests aren’t impressed or disappointed (and even left saying that it wasted their time). I do not want to end up like these MLM guys who are just building their communities for their own gain, fame and benefit and letting their “downlines” getting left behind as always. It is difficult to “keep” the community if you do not keep giving them more value. No disrespect to them but it’s the reality that we have to accept nowadays.So this is what I was doing in my months of building inter-island Bitcoin, crypto and Web3 communities. I want them all to be happy and have equal opportunities. I want them to be benefited even more. I “technically” treat this like an imaginary DAO where me and my volunteer core teams from different islands are just presenting the proposals and let the community decide via number of votes. I do not expect anything in return from the community, but I did get some unexpected blessings from them. Not just monetary stuff but other perks or so because of the value I give to them as well as maintaining a healthy relationship with one another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}