{
  "id": "topic_5443783",
  "title": "hZti",
  "author": "hZti",
  "created_time": "March 06, 2023, 05:46:54 PMLast edit: March 10, 2023, 02:24:29 PM by hZti",
  "content": "To pay with bitcoin was always my favorite use of bitcoin. Since it should be easy and fast the best Solution would be an implementation in Apple Pay. Is there a way to do that or could it be done in the more open Android Pay envoirment? I heard that apple will open nfc to 3rd party applications soon.Edit: What I propose is not to put bitcoin on a MasterCard or something. I want to create a shortcut to blue wallet so that you can spend bitcoins that are stored locally on your phone directly and easily with \"Apple Pay\" in the sense that you just need to \"tap and go\". No need to unlock your phone, no need to open the app, no need to insert bitcoin address. Just simple tap and payment is done.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443783",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "March 06, 2023, 07:04:18 PM",
      "body": "I believe the best you can do is to try to buy gift cards  to use in apple pay or Google pay.Those tech giants do not accept bitcoin directly,  and I doubt they will do it anytime soon.You can try services like thishttps://www.bitrefill.com/buy/apple-usa/?hl=enPersonally, I don't like bitrefil because it has high fees in my country,  but I know it is good in usa and Europe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 06, 2023, 10:27:10 PM",
      "body": "There's no way to do that, and it won't happen anytime soon. Since you mentioned these tech giants, If you are in US, you can use Cash App. Although i don't know if you can pay and send bitcoin now using Paypal in US but they announced working on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "March 07, 2023, 07:55:48 AM",
      "body": "Quote from: hZti on March 06, 2023, 05:46:54 PMTo pay with bitcoin was always my favorite use of bitcoin. Since it should be easy and fast the best Solution would be an implementation in Apple Pay. Is there a way to do that or could it be done in the more open Android Pay envoirment? I heard that apple will open nfc to 3rd party applications soon.As far as I know, it is already being planned and there is no exact date yet when they will actually start it, although they said the year when it is 2023 they plan to open Apple's NFC for 3rd party applications.But of course let's see what will happen next regarding these things that they are planning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 07, 2023, 06:06:31 PM",
      "body": "Why would you want to pay bitcoin with Apple Pay? You shouldn't store bitcoin to third party platforms, and Apple Pay is definitely one. Quote from: bitmover on March 06, 2023, 07:04:18 PMI believe the best you can do is to try to buy gift cards  to use in apple pay or Google pay.I don't think this is what OP wants, otherwise he could just sell bitcoin for fiat. Quote from: SeeBiscuit on March 07, 2023, 03:53:35 PMAnd yes, it’s fantastic here in the States, and you can do it anonymously too. Anonymously and United States are antonyms. Do you mean that you can just sell through a decentralized exchange?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 07, 2023, 07:27:58 PM",
      "body": "Quote from: BlackHatCoiner on March 07, 2023, 06:06:31 PMWhy would you want to pay bitcoin with Apple Pay? You shouldn't store bitcoin to third party platforms, and Apple Pay is definitely one. This is not what I was thinking. I was thinking about the option to integrate a \"bitcoin card\" into Apple Pay, that would take the money out of your phone wallet (like blue wallet). The benefit is that it is quick and easy. If you use Apple Pay, it also takes the money from your bank account. The money is never stored at apple. The same I was thinking about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "March 08, 2023, 12:49:24 AM",
      "body": "Quote from: SeeBiscuit on March 07, 2023, 03:53:35 PMQuote from: hZti on March 06, 2023, 05:46:54 PMTo pay with bitcoin was always my favorite use of bitcoin. Since it should be easy and fast the best Solution would be an implementation in Apple Pay. Is there a way to do that or could it be done in the more open Android Pay envoirment? I heard that apple will open nfc to 3rd party applications soon.I too have read somewhere that Apple Pay will integrate with bitcoin somehow. If this happens, it will be a major game changer.Apple Pay does not integrate bitcoin directly, instead, the current available option is to use a BitPay card and then connect it to Apple Pay. It is a prepaid card where you store your bitcoins or other supported cryptocurrencies on them, to be used on Apple Pay, take a look further at https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/. It's more or less kind of like crypto debit card, I don't know if others platform like Coinbase Card or Crypto.com are supported.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "March 08, 2023, 08:14:52 AM",
      "body": "Quote from: vv181 on March 08, 2023, 12:49:24 AMI don't know if others platform like Coinbase Card or Crypto.com are supported.Including the crypto.com visa card, I think all DC/CC/VC products that collaborate with Visa will automatically be used on Apple Pay based on several searches for payment card products that I found.Crypto.com visa card https://watcher.guru/news/how-to-add-crypto-com-visa-card-to-apple-payBinance card https://watcher.guru/news/how-to-add-binance-card-to-apple-payNexo card https://support.nexo.io/s/article/how-to-add-nexo-card-to-apple-payWirex card https://wirex.knoji.com/questions/wirex-apple-pay",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "March 10, 2023, 05:37:22 AM",
      "body": "Quote from: hZti on March 06, 2023, 05:46:54 PMTo pay with bitcoin was always my favorite use of bitcoin. Since it should be easy and fast the best Solution would be an implementation in Apple Pay. Is there a way to do that or could it be done in the more open Android Pay envoirment? I heard that apple will open nfc to 3rd party applications soon.A little skeptical to see that Apple Pay will implement payments using Bitcoin. Because if we look at the technology, Apple Pay is just an app that allows users to be able to integrate their credit/debit cards on their Apple devices to be able to make transactions easily and quickly, they don't provide infrastructure as a \"stand-alone\" payment system. But that doesn't mean that payments with Bitcoin or other cryptocurrencies are not possible through Apple Pay, because MasterCard seems to be enabling Bitcoin trading on their system, which will make it easier for their users to trade with crypto and Apple Pay itself supports MasterCard credit/debit card integration. , so it is possible that MasterCard users via Apple Pay will be able to make payments with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 10, 2023, 02:23:54 PM",
      "body": "What I propose is not to put bitcoin on a MasterCard or something. I want to create a shortcut to blue wallet so that you can spend bitcoins that are stored locally on your phone directly and easily with \"Apple Pay\" in the sense that you just need to \"tap and go\". No need to unlock your phone, no need to open the app, no need to insert bitcoin address. Just simple tap and payment is done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "March 10, 2023, 03:42:48 PM",
      "body": "I agree that it would be a great addition to Bitcoin if one could store BTC in their Apple wallet. I also think that Tim Cook probably has people working on just that. However, it has to be a pretty massive liability for Apple if their phones are holding BTC and it’s a native application. I’m not sure the benefits outweigh the liabilities for Apple at this time. However, Tim Cook does own BTC, so I’m sure at some point in the distant future he will be providing more support for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 11, 2023, 02:53:07 PM",
      "body": "So far, Apple has not accepted Bitcoin as a currency, and therefore it is difficult to find it as a direct payment method via Apple Pay. Perhaps the main reason for this is that shareholders will not like the ease of using Bitcoin in traditional payments.  Your best option is to either use PayPal or gift cards, otherwise you must use third-party options.I wish there was an easier way, but the world is cruel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "March 11, 2023, 03:05:01 PM",
      "body": "Quote from: BlackHatCoiner on March 07, 2023, 06:06:31 PMWhy would you want to pay bitcoin with Apple Pay? You shouldn't store bitcoin to third party platforms, and Apple Pay is definitely one. Quote from: bitmover on March 06, 2023, 07:04:18 PMI believe the best you can do is to try to buy gift cards  to use in apple pay or Google pay.I don't think this is what OP wants, otherwise he could just sell bitcoin for fiat. Quote from: SeeBiscuit on March 07, 2023, 03:53:35 PMAnd yes, it’s fantastic here in the States, and you can do it anonymously too. Anonymously and United States are antonyms. Do you mean that you can just sell through a decentralized exchange?I disagree you should store 5% or less of you btc on third party players.Paypalcoinbaseapple payamazonwould all be good to put a small percentage in the hands of a third party.as of today paypal and coinbase do allow it.apple payamazon dont.to be clear this would be small amount .1000 usd worth or less.the vast majority needs to be in a secure walletan example of a five btc amount0.05 in a third party account0.95 in a trezor or any good hardware wallet4.00 in two seperate off line wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 21, 2023, 10:14:12 AM",
      "body": "Quote from: philipma1957 on March 11, 2023, 03:05:01 PMI disagree you should store 5% or less of you btc on third party players.Paypalcoinbaseapple payamazonwould all be good to put a small percentage in the hands of a third party.as of today paypal and coinbase do allow it.apple payamazon dont.to be clear this would be small amount .1000 usd worth or less.the vast majority needs to be in a secure walletan example of a five btc amount0.05 in a third party account0.95 in a trezor or any good hardware wallet4.00 in two seperate off line wallets.This is kind of what I mean. What would be even better, would be, if you could store your coins on a mobile wallet that is not hosted by a 3rd party. BlueWallet for example gives you full control and your own seed for your device. If you could connect this somehow to Apple Pay, then you dont need any trust in a 3rd party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "March 23, 2023, 07:09:59 AM",
      "body": "Quote from: philipma1957 on March 11, 2023, 03:05:01 PMan example of a five btc amount0.05 in a third party account0.95 in a trezor or any good hardware wallet4.00 in two seperate off line wallets.I don't have 5 Bitcoin but for 4 Bitcoin.Is it safer to store them in two offline multi-sign wallets with 3 cosigners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "March 23, 2023, 07:26:45 AM",
      "body": "Quote from: hZti on March 06, 2023, 05:46:54 PMTo pay with bitcoin was always my favorite use of bitcoin. Since it should be easy and fast the best Solution would be an implementation in Apple Pay. Is there a way to do that or could it be done in the more open Android Pay envoirment? I heard that apple will open nfc to 3rd party applications soon.Edit: What I propose is not to put bitcoin on a MasterCard or something. I want to create a shortcut to blue wallet so that you can spend bitcoins that are stored locally on your phone directly and easily with \"Apple Pay\" in the sense that you just need to \"tap and go\". No need to unlock your phone, no need to open the app, no need to insert bitcoin address. Just simple tap and payment is done.if you mean the NFC feature on a smartphone then i think the ideas you are telling here won't happen in the near future, smartphone owners are still required to unlock their smartphone when making bitcoin transactions but for the NFC feature on cards at the moment there are some pretty good ones like bitpay, arculus, satochip (keep dyor) but the benefits of using it vary in each country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "April 25, 2023, 07:14:26 AM",
      "body": "What I found is that service: https://getspendl.com Does anyone have experience with that service?Pricing seems to be fair:Card Issuance Fee FREEMonthly Card Fee FREEDomestic Purchase Fee FREEInternational Purchase Fee FREEATM balance inquiry/ATM decline fee €1.00ATM disbursement fee €2.50 + 2.5%Top-Up Fee €0.99Max Cards 5 per customerFX Mark up 3.5%Daily Purchase Limit €2,500 per cardMonthly Purchase Limit €5,000 per cardAccount Closure Fee €25 (starting from 01/12/2022)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "April 25, 2023, 08:12:05 AM",
      "body": "Quote from: hZti on April 25, 2023, 07:14:26 AMWhat I found is that service: https://getspendl.com Does anyone have experience with that service? The first time GetSpendl was mentioned in Bitcointalk was back in 2019. https://bitcointalk.org/index.php?topic=5188100.0The service actually has an account here, but the user hasn't been active since 2020 > SpendlOmegaStarScream has mentioned this service several times as I can see from Ninjastic.Space. I don't think he used it though as his posts show no feedback or mention personal experience, but you can always ask him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "April 25, 2023, 08:43:05 AM",
      "body": "Thanks! I may try it in the future, even if I’m very cautious about those services as they are essentialy online wallets, which is the worst that was introduced to bitcoin . In the past there were services like that, and I used I think 3 of them. All of them closed at one point and the funds were lost. So maybe this service is more trustworthy, but I’m not shure about that in this moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "April 25, 2023, 09:58:13 AM",
      "body": "Quote from: hZti on April 25, 2023, 08:43:05 AMThanks! I may try it in the future, even if I’m very cautious about those services as they are essentialy online wallets, which is the worst that was introduced to bitcoin . In the past there were services like that, and I used I think 3 of them. All of them closed at one point and the funds were lost. So maybe this service is more trustworthy, but I’m not shure about that in this moment.I did try them at some point when I really needed them and IIRC, I had problems with the verification process, not sure what was causing the issue but from the look of it (if you check online) a few people had similar issues at the time. It could be related to Ondato (their KYC provider) and not necessarily the service itself. I do know some people who had a good experience with them though, and you can find a few on Reddit. I just tried to find some recent reviews about them, and I did find a couple of people who had issues, from a few months ago.  And when I checked their Twitter (I'm guessing that's how you found them?), I noticed that they have just woken up after a long period of inactivity[1] (~2 million views if we combine the last two posts, so they're probably displaying ads and taking marketing more seriously) so it's very possible that they have fixed the issues they used to have.Alternatively, Paywithmoon[3] (very similar to spendl) used to offer cards that support Apple Pay but they stopped issuing them a couple of months ago and they are now looking for a new partner, maybe you can wait or ask them when they're relaunching.[1] https://twitter.com/getspendl?lang=en[3] https://twitter.com/paywithmoon/status/1624548552402694144",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}