{
  "id": "topic_5443809",
  "title": "Y3shot",
  "author": "Y3shot",
  "created_time": "March 06, 2023, 10:14:16 PMLast edit: March 07, 2023, 03:35:04 AM by Y3shot",
  "content": "About 3 years ago world bandit break into bitcoin Atm thinking they could get some coin from it. So funny they found nothing to go with. I'm very sure they were disappointed . Bitcoin is mysterious 😄https://twitter.com/pete_rizzo_/status/1632724529595154433?t=vnCJCK16Pa6jKPrgXFP7pA&s=19",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443809",
  "comments": [
    {
      "author": "Saisher",
      "created_time": "March 06, 2023, 11:14:45 PM",
      "body": "The guy who did this is ignorant of how Bitcoin works, they thought it was a fiat-like machine where you can extract paper cash, and they thought that it works like all the other ATM, this is one of the funniest jokes about Bitcoin.I'm sure those who did this are thinking why there is no cash on that ATM.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 06, 2023, 11:26:42 PM",
      "body": "They can't get Bitcoin at an ATM but the real cash is inside that machine.So why would they be disappointed if they already get some cash?Bitcoin ATM works: before you buy Bitcoin you need cash to deposit so it should have some cash unless all transactions made on that machine are via Debit/credit card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "March 06, 2023, 11:28:54 PM",
      "body": "You meant to say, \"bitcoin can't be robbed\"?Perhaps a more suitable title would be, \"Bitcoins can not be stolen from a Bitcoin ATM by breaking into it\" But yes, someone can rob your Bitcoins in other ways like telling you to transfer the coins to the robber's address under gun point or if someone accesses your seed phrases to your addresses containing the Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "March 06, 2023, 11:33:23 PM",
      "body": "Might they think that there was a lot of cash inside since it was an ATM, but they thought that it was like a traditional ATM like in the bank.Poor bandit didn't even think that the transaction of the ATM machines is all digitally linked to their wallet or their bank, not unless for those who are using paper bills on purchasing Bitcoin. Quote from: BitMaxz on March 06, 2023, 11:26:42 PMSo why would they be disappointed if they already get some cash?This is the point of stealing and breaking the machine, get some cash, not the Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "March 06, 2023, 11:33:33 PM",
      "body": "Quote from: BitMaxz on March 06, 2023, 11:26:42 PMThey can't get Bitcoin at an ATM but the real cash is inside that machine.So why would they be disappointed if they already get some cash?Bitcoin ATM works: before you buy Bitcoin you need cash to deposit so it should have some cash unless all transactions made on that machine are via Debit/credit card.Was supposed to say the same thing that even if those thieves had failed on getting bitcoin literally but for sure they were after for the cash inside.Although the money they could stole wont really be that as much compared on a typical fiat atm machine but still they do successfully get some amounts despite of failing up on getting those bitcoins which we know that its impossible on getting it.Criminal acts doesnt really care whether its bitcoin or fiat as long they could get something valuable then that what matter the most and its not something new in todays where breaking atm machines turns out to be that not shocking thing anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "March 06, 2023, 11:36:45 PM",
      "body": "According to the sign, this machine also accepts cash. I think the thieves just wanted the cash in it, but it seems out of luck this hasn't even been used by anyone. Btw, this is the worst-designed ATM machine considering the thin metal cover and small size that can be carried by only one person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bollexz1",
      "created_time": "March 06, 2023, 11:39:16 PM",
      "body": "The guy must be daft to the core. How on earth would someone try to rob a system without even making proper research? This indeed is the dumbest grade of ignorance I've heard or read about since my existence",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 07, 2023, 01:16:11 AM",
      "body": "Quote from: rat03gopoh on March 06, 2023, 11:36:45 PMAccording to the sign, this machine also accepts cash. I think the thieves just wanted the cash in it, but it seems out of luck this hasn't even been used by anyone. Btw, this is the worst-designed ATM machine considering the thin metal cover and small size that can be carried by only one person.Now you mention it, this ATM seems to have been designed to be placed on a surface instead be fastened to a wall or something similar. I could be wrong, but it seems like it, and if it was the case, it could explain why the thief tried his/her luck on breaking a Bitcoin ATM instead a more traditional target, since those are more sturdy and fixed to a wall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "March 07, 2023, 01:39:25 AM",
      "body": "If the robbers are not that ignorant, they probably knew that they can't get any Bitcoin from the machine. Anybody who has heard of Bitcoin might have already a rough idea that Bitcoin isn't hard cash. So they're probably not after the Bitcoin but the fiat money that is fed into the Bitcoin machine. Targeting this much smaller machine is of course easier for them. They cannot easily do the same with the usual fiat ATMs. But this does not prove that Bitcoin can't be robbed. There were already many cases of Bitcoin robbery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "March 07, 2023, 02:00:48 AM",
      "body": "\"Not your keys, not your coins\" or \"It's your keys, it's your coins\".Bitcoin ATM does not store any key inside and people can not steal bitcoins at Bitcoin ATMs. It is very logic.If at home, you store your keys in vault and by whatever reason, someone can steal your vault, bring it away, break it to get keys you store in that vault, you will lose your coins.Some people complicate their backups by splitting it into half, one in vault, one in book or storing two halfs of their backups at two different locations. If one half of backup is compromised, they will still not lose their coins. Obviously that they must have access to that one half of backup somewhere else. If they don't have that access too, they will lose their coins as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "March 07, 2023, 03:46:13 AM",
      "body": "If I'm not mistaken it was in Memphis a few years ago https://www.ccn.com/stolen-bitcoin-atm-owners-suspect-memphis-robbery-was-inside-job/, and if true thieves didn't get anything because the cash there just got taken by the operators so it's just empty machines, and thieves only get empty machines so they're poor bandits because surely if caught by the police will still be processed even if they don't get anything.The title of this thread will give mislead information because if it only refers to the incident Op mentioned it is true that Bitcoin cannot be stolen but Bitcoin can still be stolen if we cannot store PK and all important information about our wallet properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 07, 2023, 04:16:33 AM",
      "body": "You title gives another impression. At first I thought you were referring to Bitcoin held an individual not knowing that you were referring to Bitcoin ATM. I have never used Bitcoin ATM Before and don't really know how it works I don't know if you pay with cash or you lay with your credit or your debit card but if it's cash then the robbers will probably just go for that one if they fail to get any Bitcoin. And btw where they expecting to get real coins from the machine? Or they thought the machine had some coins in it they same way cash ATM has cash loaded into it and if they break it they might find some inside. It's a pity though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "March 07, 2023, 04:24:10 AM",
      "body": "Quote from: hd49728 on March 07, 2023, 02:00:48 AM\"Not your keys, not your coins\" or \"It's your keys, it's your coins\".Bitcoin ATM does not store any key inside and people can not steal bitcoins at Bitcoin ATMs. It is very logic.If at home, you store your keys in vault and by whatever reason, someone can steal your vault, bring it away, break it to get keys you store in that vault, you will lose your coins.Some people complicate their backups by splitting it into half, one in vault, one in book or storing two halfs of their backups at two different locations. If one half of backup is compromised, they will still not lose their coins. Obviously that they must have access to that one half of backup somewhere else. If they don't have that access too, they will lose their coins as well.Actually. This is true. A bitcoin can't be steal if you don't know any idea of its key or what we called seed phrase. The idea of \"not your keys, not your coins\" is the best possible way of explaining it. Most of the people who have enough idea on how to store and protect bitcoin know this. Bitcoin ATM might be possible yet I guess it is more on transactions online and making some withdrawals via physical money. You might not get the idea clearly but you will only able to access bitcoin wallet via seed phrase or key phrase. Stolen keys, stolen coins as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "March 07, 2023, 04:29:19 AM",
      "body": "It's good to see old criminals still doesn't know how Bitcoin's work, but I think nowadays people already know about it since Bitcoin already get regulated in few countries. Bitcoin can be robbed if the criminals use $5 wrench attack into someone house, the criminals can force and intimidate them to give all of the coins they have. This is nothing new anymore, that's why privacy is really important for Bitcoin holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "March 07, 2023, 05:31:49 AM",
      "body": "Quote from: Despairo on March 07, 2023, 04:29:19 AMIt's good to see old criminals still doesn't know how Bitcoin's work, but I think nowadays people already know about it since Bitcoin already get regulated in few countries. Bitcoin can be robbed if the criminals use $5 wrench attack into someone house, the criminals can force and intimidate them to give all of the coins they have. This is nothing new anymore, that's why privacy is really important for Bitcoin holders.After all, bitcoin is also money, an asset like any other property, as long as you become the target of robbers, they will attack you and can take your bitcoins at any time. We can't even call the police if our bitcoins are robbed because their anonymity is difficult to track, or it's a property that has not been protected by law. Bitcoin gives us privacy and anonymity, so I think even if bitcoin is widely accepted, I will not go public as an investor or holder of bitcoin for my safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "March 07, 2023, 05:32:02 AMLast edit: March 07, 2023, 05:17:37 PM by HajiBagi",
      "body": "Quote from: Bitcoin_Arena on March 06, 2023, 11:28:54 PMYou meant to say, \"bitcoin can't be robbed\"?Perhaps a more suitable title would be, \"Bitcoins can not be stolen from a Bitcoin ATM by breaking into it\" But yes, someone can rob your Bitcoins in other ways like telling you to transfer the coins to the robber's address under gun point or if someone accesses your seed phrases to your addresses containing the Bitcoins.That's right mate, we can't say that bitcoin cannot be robbed; all we can say is that it cannot be physically robbed. However, bitcoin can be robbed in many other ways, and it will be simple for them if they have access to some of your wallets' private keys. All we can do is try to avoid people who have bad mind and want to live well off of the wealth of others while also keeping our secrets to ourselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 07, 2023, 05:57:52 AM",
      "body": "Quote from: Y3shot on March 06, 2023, 10:14:16 PMRe: bitcoin can't be robbed Idunno mate — probably not in this case with bitcoin ATMs, but people can definitely be robbed off their bitcoin lol.https://github.com/jlopp/physical-bitcoin-attacks/blob/master/README.md",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 07, 2023, 06:33:22 AMLast edit: May 20, 2023, 07:10:43 PM by stompix",
      "body": "Never gets old:Quote from: sheenshane on March 06, 2023, 11:33:23 PMMight they think that there was a lot of cash inside since it was an ATM, but they thought that it was like a traditional ATM like in the bank.Poor bandit didn't even think that the transaction of the ATM machines is all digitally linked to their wallet or their bank, not unless for those who are using paper bills on purchasing Bitcoin. It's a BATM that does accept banknotes.Besides, if the thieves had enough time they could have simply cashed out a lot of Bitcoin in multiple transactions once the BTAM was broken.Insert $1000, buy coins, grab the money through the hole, feed the BATM again, and buy another 1k worth of BTC or even more, you didn't even need the BATM to have any cash in it, you could use your own as you would get it back immediately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "March 07, 2023, 06:40:29 AM",
      "body": "Quote from: mk4 on March 07, 2023, 05:57:52 AMQuote from: Y3shot on March 06, 2023, 10:14:16 PMRe: bitcoin can't be robbed Idunno mate — probably not in this case with bitcoin ATMs, but people can definitely be robbed off their bitcoin lol.https://github.com/jlopp/physical-bitcoin-attacks/blob/master/README.mdIt's ironic, that in the link that you posted to Jameson Lopp's list of robberies and extortions, that he himself was almost extorted. But you can avoid such situations by not revealing where you live or your house address. Can't get SWATted if the scammer doesn't even know where to send them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}