{
  "id": "topic_5462935",
  "title": "Best-mary",
  "author": "Best-mary",
  "created_time": "August 11, 2023, 02:18:33 PM",
  "content": "The crypto world is buzzing as the SEC prepares to reveal a crucial Bitcoin ETF verdict. The ARK 21Shares Bitcoin ETF news might arrive earlier than expected, thanks to a Sunday deadline.But here's the real question: How will this decision affect Bitcoin's price? Will it soar or slump?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462935",
  "comments": [
    {
      "author": "avikz",
      "created_time": "August 11, 2023, 02:41:33 PM",
      "body": "Lol! Not sure why people are so bullish about an ETF but it doesn't bring any real value on the table. It's just a method of investment that mimics the price of an asset without buying or selling that asset. So I don't see any positive impact or liquidity inflow in the crypto market due to ETF approval. The only positive thing here is that some more people might get intrigued about Bitcoin and start learning about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "August 11, 2023, 02:47:02 PM",
      "body": "Quote from: avikz on August 11, 2023, 02:41:33 PMLol! Not sure why people are so bullish about an ETF but it doesn't bring any real value on the table. It's just a method of investment that mimics the price of an asset without buying or selling that asset. So I don't see any positive impact or liquidity inflow in the crypto market due to ETF approval. It's probably about SEC allowing it is the big deal. A lot of people of course follow SEC and see that their decision is something to follow. Having that type of exposure to those who don't follow cryptocurrencies in the first place would maybe try and HODL or learn about crypto. I think it is a big deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 11, 2023, 04:16:59 PM",
      "body": "I am personally not expecting much of a price change with the introduction of more ETFs of Bitcoin. Perhaps it could bring more awareness of Bitcoin to people who have been used to traditional investment tools for a while, but in reality the best case scenario would be new people joining and actually buying and keeping their Bitcoin in their personal wallets. At least we are seeing how Bitcoin and crypto in general slowly continues to lose the stigma it had from the beginning, this is not longer an asset used for tax evasion and dark web dealings, but a legitimate one which people is interested in.  Eventually, skeptic users will move from ETFs, to exchanges and hopefully to self-custody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 11, 2023, 04:28:24 PM",
      "body": "Quote from: Best-mary on August 11, 2023, 02:18:33 PMThe crypto world is buzzing as the SEC prepares to reveal a crucial Bitcoin ETF verdict. The ARK 21Shares Bitcoin ETF news might arrive earlier than expected, thanks to a Sunday deadline.SEC has an option to delay an approval since they keep doing this on older ETF applications before this Blackrock ETF hype. SEC has a lot of time to decide since they can delay the process until 2024.If you are new to crypto. ETF approval result usually release near the last deadline. I'm not updated on ETF deadline anymore but I guess this article will backup my hypothesis above https://www.cnbc.com/2023/08/11/sec-delays-decision-on-bitcoin-etf-from-cathie-woods-ark-invest.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 11, 2023, 04:28:55 PM",
      "body": "Quote from: crwth on August 11, 2023, 02:47:02 PMQuote from: avikz on August 11, 2023, 02:41:33 PMLol! Not sure why people are so bullish about an ETF but it doesn't bring any real value on the table. It's just a method of investment that mimics the price of an asset without buying or selling that asset. So I don't see any positive impact or liquidity inflow in the crypto market due to ETF approval. It's probably about SEC allowing it is the big deal. A lot of people of course follow SEC and see that their decision is something to follow. Having that type of exposure to those who don't follow cryptocurrencies in the first place would maybe try and HODL or learn about crypto. I think it is a big deal.It's not a big deal at all. ETF is a method of making money out of thin air unless that is backer by actual asset. Anyone can sell ETF with SEC's approval, but unless that ETF is actually buying bitcoins as a reserve, it doesn't and shouldn't matter to the crypto community. It might take future investors away from actual Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "August 11, 2023, 04:36:47 PM",
      "body": "Quote from: Best-mary on August 11, 2023, 02:18:33 PMHow will this decision affect Bitcoin's price? Will it soar or slump? Since this deals with news and knowing that the bitcoin market have a little influence it receives from breaking news to adjust the market to pump in most cases even though it may not be that very much, just like we had in recent news updates about the institutions applying for the spot bitcoin ETF, all these aren't the major trigger to pump or dump bitcoin market price, the demand and supply goes along way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 11, 2023, 04:37:09 PM",
      "body": "IF (big if) a ETF is approved. then many many other institutions will copy and paste the template of the accepted ETF to fast track their own acceptance. this means they have confidence to then grab reserves of coins. so a buying frenzy can occur from other companies wanting to get into ETF offeringshowever i see the SEC not wanting hundreds of ETF offerings and instead want ONE main known SEC friendly institution to be the \"first mover\" and main ETF offerer. whereby that potential ETF offerer will have a template of a high bar of standards which other businesses cant copy. such as them offering X billion in fiat as a escrowed insurance pot. or paying a high licence fee and willing to be SEC audited at a high cost. meaning it sets barriers of entries for othersi feel thats why the SEC has not approved others so far. because the barriers of entry and the walls of the castle are not high enough and not from a well established institution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 11, 2023, 04:52:09 PM",
      "body": "Quote from: avikz on August 11, 2023, 02:41:33 PMLol! Not sure why people are so bullish about an ETF but it doesn't bring any real value on the table. It's just a method of investment that mimics the price of an asset without buying or selling that asset. So I don't see any positive impact or liquidity inflow in the crypto market due to ETF approval. The only positive thing here is that some more people might get intrigued about Bitcoin and start learning about it. Your last already answered your own doubts,, investors are not particularly excited about the whole Bitcoin ETF approval because they think it has the capacity to add any real value to Bitcoin, people are mostly excited and cant wait to see some of the applications approved because since SEC is an arm of the government, the Bitcoin ETF approval will finally prove to doubters that Bitcoin is indeed a legitimate currency like every other currency in the financial market.ETF approval on its own has not the ability to add a single digit to the price of bitcoin, but it does have the ability to be a catalyst that will drive the next/coming bull run which a lot of people have been anticipating.Oh God bless the SEC if the approval comes at a time when bitcoin halving is just a few days to go, or immediately after the halving, I think the price of Bitcoin will catapult to over $100,000 and above very easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zee27",
      "created_time": "August 11, 2023, 09:12:40 PMLast edit: August 11, 2023, 10:37:53 PM by Zee27",
      "body": "Quote from: avikz on August 11, 2023, 02:41:33 PMLol! Not sure why people are so bullish about an ETF but it doesn't bring any real value on the table. It's just a method of investment that mimics the price of an asset without buying or selling that asset. So I don't see any positive impact or liquidity inflow in the crypto market due to ETF approval. The only positive thing here is that some more people might get intrigued about Bitcoin and start learning about it. My sentiments about this is not completely bullish to be frank. I'm not sure either what value ETF adds or I might just be the odd one who'd rather have her BTC in Bitget's flexible savings accruing some APR pending wether or not this will propell some boost in the price of Bitcoin. Just my thoughts for now  tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 11, 2023, 09:23:09 PM",
      "body": "Quote from: Best-mary on August 11, 2023, 02:18:33 PMThe crypto world is buzzing as the SEC prepares to reveal a crucial Bitcoin ETF verdict. The ARK 21Shares Bitcoin ETF news might arrive earlier than expected, thanks to a Sunday deadline.But here's the real question: How will this decision affect Bitcoin's price? Will it soar or slump? This depends on the hype the ETF can bring the market and how it will affect the sentiment of the traders.  It is expected that there will be a positive effect on the market sentiment, the problem lies on the grounds on how high it will impact the market.  If it does not give an impression that much, we might see the price of Bitcoin still tanking.  What am saying is that it is early for us to tell we can just have speculation but I think it is best to see it for ourselves how the market will react on the SEC decision since it will happen soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 11, 2023, 09:33:40 PM",
      "body": "To be honest, I've never really observed noteworthy price shifts in response to ETF news in the past. The occasional uptick seems more like a result of hype rather than a genuine bullish trend linked to ETF news. Bitcoin's inherent volatility has driven its movements even without ETF-related updates. Given the SEC's attempts to curtail the cryptocurrency market, I don't hold high expectations for substantial impacts from these ETF announcements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "August 11, 2023, 10:07:26 PM",
      "body": "Quote from: avikz on August 11, 2023, 02:41:33 PMLol! Not sure why people are so bullish about an ETF but it doesn't bring any real value on the table. It's just a method of investment that mimics the price of an asset without buying or selling that asset. So I don't see any positive impact or liquidity inflow in the crypto market due to ETF approval.Probably we're talking about different ETF because the last time I read some news it was about bitcoin spot ETFs, so that means that the funds actually have to buy bitcoin, we're not talking about some futures or stuff like that. And those funds manage ridiculous amount of money so even if 1% of what they manage gets poured into bitcoin we're still talking about a huge amount of money. Bitcoin's market cap is still very low at the end of the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "August 11, 2023, 10:35:24 PM",
      "body": "In my opinion, this would be little impact to the price of Bitcoin. Some people are relying to SEC and they will only invest if there's a good news from them. If people see this as a good news, and encourage new investors, the price would definitely increase. The current marketcap of Bitcoin is around $571B, so if ever it's added for around $100B would surely increase it's price. The only one thing to do that is not the ETF itself but the effects to the big investors in Bitcoin because of ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "August 11, 2023, 10:57:13 PM",
      "body": "Zero chance. Gensler isn't going to do anything to allow Bitcoin's presence in America to increase. Any ETF will either get denied or the decision will get delayed so they can deny it later. Same as always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 11, 2023, 11:30:20 PM",
      "body": "Quote from: Best-mary on August 11, 2023, 02:18:33 PMThe crypto world is buzzing as the SEC prepares to reveal a crucial Bitcoin ETF verdict. The ARK 21Shares Bitcoin ETF news might arrive earlier than expected, thanks to a Sunday deadline.But here's the real question: How will this decision affect Bitcoin's price? Will it soar or slump? I did not get it right i think you said not a company will declare the announcement of new ETF request went for approval but instead SEC by itself will make announcements that a new Bitcoin ETF is going to come in the market? if that's the case then this ETF will definitely have a good impact on the price of Bitcoin. As, other ETFs has made impact. I can see many people are saying that ETFs have no impact on the value of BTC. but i don't think that's true instead it do have impact on the value.Because once the ETFs will got approved the demand of the BTC will increase because the companies who applied for BTC ETFs will buy BTC more and more and in that race, demand will increase while the supply remains the same and this will increase the value of BTC. SO, i might be wrong but if someone is saying BTC ETFs have no impact on BTC price then i think they don't wants others to be get benefit from this opportunity. The thing is the impact will be then when the ETF request will be approved not by the news only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 12, 2023, 12:47:12 AM",
      "body": "Quote from: Faisal2202 on August 11, 2023, 11:30:20 PMBecause once the ETFs will got approved the demand of the BTC will increase because the companies who applied for BTC ETFs will buy BTC more and more and in that race,many of the current applicants already hoarded their initial reserves to offer basket of shares. they are les likely to grab more on announcement day. its the next gen applications(not yet applied) that will rush to try to fast track their own new applications by using the first success as a template for their own new applications that will then want to grab a lump of coin for reserves to offer their own. later on after the first mover sells through their first lump of reserves of share baskets will then gather more. but the initial movement of coins at a ETF acceptance announcement will be from those not yet applying but see that there is a possibility and gain confidence to try entering the sector, thus would need a reserve upfront when applying",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "August 12, 2023, 01:47:10 AM",
      "body": "Quote from: Best-mary on August 11, 2023, 02:18:33 PMThe crypto world is buzzing as the SEC prepares to reveal a crucial Bitcoin ETF verdict. The ARK 21Shares Bitcoin ETF news might arrive earlier than expected, thanks to a Sunday deadline.But here's the real question: How will this decision affect Bitcoin's price? Will it soar or slump? It will soar which is the typical expectation that shall happen.But it is no wonder if these ETF that have been applied for approval will eventually get rejected. It has been years since the last ETFs have been on the news everyday.And then, they didn't managed to get an approval, and that's why it will not be a thing anymore for me if there will be a news of rejection. This is also to keep myself from too much expectation in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 12, 2023, 02:29:04 AM",
      "body": "ETF is not of much value to Bitcoin and will not affect the real price materially because the supply or demand for the actual amounts of Bitcoin will not change. But in my view, the moral victory over the SEC is the most positive thing about this approval.After the SEC rejected the requests of BlackRock and other companies, it returned and obtained approval, and this also comes after Ripple’s victory over the SEC in its famous case, so all of these reasons will have a significant moral and positive impact on the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "August 12, 2023, 02:59:09 AM",
      "body": "I agree with the consensus in this forum that in reality BTC-ETF is not actually a big development for Bitcoin but since we are living in the real world where market sentiments are always a force so maybe in case of an approval there can be a big push for the price of BTC but I am sure this is just going to be short-lived. Now, in case, the opposite can happen - SEC delaying or rejecting the application - that will not have a negative effect on BTC as we know that the crypto industry already knows how erratic is SEC these days on matters related to crypto in general. With Gary Gensler around, it would be a big miracle for an ETF to be approved but then who knows what can be?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}