{
  "id": "topic_5444817",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "March 14, 2023, 07:27:39 AM",
  "content": "This is a website that I found that reviews online services such as exchanges, or any website that accepts Bitcoin, and evaluates their trustworthiness: https://bittrust.org/It appears to have been online since at least 2014 (look at the last edited date if you don't believe me), but it appears dormant, considering the copyright has last been updated in 2017 - not even Binance is listed on that site.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444817",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "March 14, 2023, 08:45:46 AM",
      "body": "From what I understand the site is based only on the opinion of other people who use these companies / services. It is not the site owners themselves who make the assessment, but the consumers.So it doesn't need big updates.Quote from: NotATether on March 14, 2023, 07:27:39 AM not even Binance is listed on that site.From what I understand, it has to be the company itself or someone who adds the company/service to the site. Certainly no one connected to Binance has done this.Now if you ask that the site is viable? Honestly, I don't like sites that have a lot of advertising. Advertising that hinders the reading of the page. That is, the probability of using this site is very low.Either way, the idea of the site is a good one and could easily be exploited in a more efficient way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "March 14, 2023, 01:06:54 PM",
      "body": "Quote from: joker_josue on March 14, 2023, 08:45:46 AMEither way, the idea of the site is a good one and could easily be exploited in a more efficient way.true, but at the same time the site is cluttered with advertisements. It is too tiring for me to have to close the advertisement and popup windows after each click.it seems that there is no special control over the content, so it may be subject to manipulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "March 14, 2023, 01:35:01 PM",
      "body": "Looks like an abandoned project. Outside of the domain registration which may be costing the operator a few bucks a year if they did not prepay for an extended time it's hosted on fly.io and they have a free tier. So, in theory it could be sitting there a very long time just hanging out doing nothing. I have a few sites setup like that that I will take care of \"tomorrow\" and yeah, it never gets done.Could have had potential years ago, but as of now it would require a complete re-do and I doubt the operators is going to do that at this point.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "March 14, 2023, 03:16:08 PM",
      "body": "I've seen this years ago but ended up avoiding it mainly because of the rampant fake reviews plus the team never really did anything to lessen that. Something as simple as reporting reviews wasn't even present. Seeing how there's still no improvement, it could indeed be abandoned. I think they also used to ranked well in search results and at some point, I just stopped seeing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "March 14, 2023, 07:57:56 PM",
      "body": "Quote from: DaveF on March 14, 2023, 01:35:01 PMLooks like an abandoned project. Outside of the domain registration which may be costing the operator a few bucks a year if they did not prepay for an extended time it's hosted on fly.io and they have a free tier. So, in theory it could be sitting there a very long time just hanging out doing nothing. I have a few sites setup like that that I will take care of \"tomorrow\" and yeah, it never gets done.Could have had potential years ago, but as of now it would require a complete re-do and I doubt the operators is going to do that at this point.-DaveDave, I agree with you, BitTrust is already abandoned and probably died a long time ago, see the following reviews from one of the spammers on most of the crypto services.The question here is, where is the team of this platform? Why don't they review user reviews and delete spam?I can confirm that 99% that the rates, reviews, and compares of Crypto services are incorrect and no one can rely on them completely, because the platform only profits from Adsense, they left their site collecting traffic and their team retired from work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 15, 2023, 07:46:26 AM",
      "body": "I searched for many services, and many of them have a 5-star rating, which is strange because it is rare to find more than 20 app reviews without any negative comment.Therefore, they are either paid comments or they do not filter them, and therefore in any case they cannot be relied upon.I can also modify the description of some services, which is a strange thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zakservers",
      "created_time": "March 27, 2023, 07:25:33 AM",
      "body": "well at least they have their ads campaign running, dont know much about the management, if they are active or looking to improve and filter their merchant reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 27, 2023, 07:57:55 AM",
      "body": "Quote from: hugeblack on March 15, 2023, 07:46:26 AMI can also modify the description of some services, which is a strange thing.I picked up some random service and checked their review:https://bittrust.org/qoinprocomhttps://bittrust.org/cash-to-cryptohttps://bittrust.org/bitquickcoCheck the reviews from users. I don't see much things to suspect. There are 5 stars review while there are many 1 star reviews too.I am not advocating for them but things are looking normal to me.Quote from: NotATether on March 14, 2023, 07:27:39 AMnot even Binance is listed on that site.I don't see Kucoin on there too. May be they still have not listed their service with them yet. You need to add your business there before everything else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelonmusk",
      "created_time": "March 28, 2023, 03:27:11 PM",
      "body": "Generally, it's a good idea to do your own research and gather information from multiple sources before using any online service that involves Bitcoin or other cryptocurrencies. This means, it's also important to keep in mind that there is always some degree of risk involved when using such services, and it's essential to understand the risks and take appropriate precautions.In my opinion, one should not rely solely on a single source, especially an outdated one, to evaluate the trustworthiness of online services involving cryptocurrency. So, it probably a good idea to look for more recent and updated information from multiple sources to make an informed decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}