{
  "id": "topic_5436677",
  "title": "rdluffy",
  "author": "rdluffy",
  "created_time": "January 24, 2023, 11:52:05 PM",
  "content": "Achei interessante essa matéria do Portal do Bitcoin, vou só colocar o principal da notícia, mas é um assunto que nunca vi falarmos por aqui: a Coréia do NorteQuoteO FBI anunciou segunda-feira que concluiu que a organização hacker norte-coreana Lazarus Group estava por trás do hack de US$ 100 milhões do Harmony Protocol em junho. Mais de US$ 60 milhões em ETH roubados durante o assalto foram lavados no dia 13 de janeiro, seis meses após o fato. Isso permitiu que a agência de investigação identificasse com confiança o Lazarus e APT38 — outro grupo cibernético norte-coreano — como os arquitetos do crime.Os hackers usaram o RAILGUN, um protocolo de privacidade, na tentativa de esconder suas transações. Mesmo assim, uma parte dos fundos foi congelada e recuperada através de exchanges quando os hackers tentaram trocá-los por Bitcoin. Os fundos não recuperados foram posteriormente enviados para 11 endereços Ethereum.O FBI e seus parceiros de investigação “continuarão a identificar e interromper o roubo e lavagem de moeda virtual pela Coreia do Norte, que é usada para apoiar os programas de mísseis balísticos e armas de destruição em massa da Coreia do Norte”, de acordo com o comunicado.Fonte: https://portaldobitcoin.uol.com.br/fbi-diz-que-coreia-do-norte-esta-tras-do-roubo-de-us-100-milhoes-de-protocolo-cripto/O que acham disso tudo?Tem mais hacks que foram atribuídos a eles, como os  USD 622 milhões da Rede Ronin (Axie Infinity) e de acordo com a matéria, eles podem ter roubado já 1,2 bilhões de dólares.O fator mais complicado disso tudo é que além de ser criptos, é na Coréia do Norte, onde praticamente nenhum país vai conseguir cooperação ainda mais que o próprio governo pode estar envolvido nisso tudo.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436677",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "January 25, 2023, 12:12:31 AM",
      "body": "Já tinhamos citado e conversado um pouco sobre o Lazarus Group aqui.Sobre um episódio do Darknet Diaries e os ataques de engenharia social do Lazarus: https://bitcointalk.org/index.php?topic=5403526.msg60414258#msg60414258E as sanções ao Tornado Cash principalmente pois o grupo usava o mixed para lavar seu dinheiro: https://bitcointalk.org/index.php?topic=5409161.msg60717974#msg60717974Impressionante que eles seguem exploitando o ecossistema por centenas de milhões de dólares… mas não é de se espantar tanto, já que ele é um grupo aparentemente estatal e vive de buscar falhas em cada linha de código de centenas de contratos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 25, 2023, 10:09:43 AM",
      "body": "A existência deles é apenas uma prova mais concreta e talvez mais drástica de algo que sabemos há um tempo sobre a guerra fria do nosso séculos. A atuação deles talvez seja mais descarada, mas existem centenas de notícias sobre os roubos de informações que os EUA tem feito, não só para fins de controle das atividades dos próprios cidadãos, mas também de roubos de informações de negócios, para fins de vantagem no comércio internacional. Acho que no final do dia, é uma diferença de tática e talvez intensidade, mas acredito que todos os paises devam ter seus hackers olhando tudo que podem e explorando o que encontram. Alguns roubando cripto de joguinhos, outros explorando informações para se beneficiarem de negociações.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 25, 2023, 08:00:05 PM",
      "body": "O que me espanta é que normalmente todos os hacks que não se consegue recuperar o dinheiro ou apanhar os culpados, dizem sempre que são desse grupo.Serão eles assim tão bons ou o bode expiatório dos hacks impossíveis de resolver?  Teorias da conspiração a parte... É normal e espectável, que uma equipa de grandes informáticos dedicados a 100% na busca de falhas de vários serviços e com o objetivo de trazer dinheiro de fora para o seu país, com o apoio do Estado, tem todas as condições para terem sucesso.Visto serem da Coreia do Norte, nunca irão ser apanhados, e continuarão a operar livremente na www.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 25, 2023, 08:31:51 PM",
      "body": "Quote from: TryNinja on January 25, 2023, 12:12:31 AM...Acabei não prestando atenção nesse tópico que vocês falaram sobre o Lazarus, e agora que fui entender melhor porque fizeram aquilo com o Tornado Cash.Sendo eles da própria estatal não tem como punir, a não ser claro ser punido pela própria Coréia do Norte caso falhem...Mas é impressionante o que conseguem, mas afinal é o trabalho deles e tentando todos os dias uma hora conseguem, imagino que a equipe deve ser enorme porque afinal nem devem precisar paga-los.Quote from: Disruptivas on January 25, 2023, 10:09:43 AM...Todos os países devem contar com alguma inteligência do tipo de obter informações, de formas legais ou não, eu também acredito nisso.Mas eles vão mais longe e partem para o roubo mesmo, afinal o que os países de fora podem fazer?É uma situação bem inusitada de um país praticamente isolado do mundo.Quote from: joker_josue on January 25, 2023, 08:00:05 PM...Acho que tendo uma equipe trabalhando 24h por dia só pra procurar esses exploits deve aumentar muito as chances deles conseguirem encontrar as falhas. Isso é bem ruim para todos.São coisas que seriam impossíveis alguns anos atrás, mas com a tecnologia, ela está aí para o bem e para o mal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 26, 2023, 01:59:30 PM",
      "body": "Um dado interessante também para pensar nessas questões é também quantas criptomoedas o próprio governo dos EUA já tem sob custódia. Eu sabia que era relevante, mas não sabia quanto. Ontem vi uma matéria no portal dizendo que sob controle das autoridades norte-americanas estão atualmente a 5ª, a 8ª e a 13ª carteira com a maior quantia de bitcoin armazenada no mundo. Elas são do Departamento da Justiça dos EUA (DOJ) e do FBI.Realmente se tornou uma questão de interesses internacionais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}