{
  "id": "topic_5437566",
  "title": "seojuni04",
  "author": "seojuni04",
  "created_time": "February 01, 2023, 12:48:26 AM",
  "content": "Hello. I have a question about Bitcoin Core.As far as I know, Bitcoin Core does not support 2FA, Multi Signature, and Hardware Wallet, is it true?I'd appreciate it if you could reply.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437566",
  "comments": [
    {
      "author": "jackg",
      "created_time": "February 01, 2023, 01:25:31 AM",
      "body": "It supports multisig but not 2FA or hardware.There are applications you can run alongside bitcoin core that can handle 2fa or hardware wallets though (they might be unnecessary unless you care so much about privacy you don't want an external node linking your addresses).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "February 01, 2023, 04:33:08 AM",
      "body": "Quote from: seojuni04 on February 01, 2023, 12:48:26 AMAs far as I know, Bitcoin Core does not support 2FA, Multi Signature, and Hardware Wallet, is it true?There are \"external signers\" to be able to use Bitcoin Core with your hardware wallets but it's tagged as \"experimental\".If you want to know more, read the documentary about it in Bitcoin's GitHub repository: github.com/bitcoin/bitcoin/blob/master/doc/external-signer.md...As you can see, it's not end-user-friendly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 01, 2023, 07:29:03 PM",
      "body": "https://specter.solutions/desktop/ it's a 1 step more or less install for using hardware along with core.Fully open source: https://github.com/cryptoadvance/specter-desktopPersonally I have used it a little and it does work, but for most HW wallets electrum connected back to my own server works just as well.I am guessing it's not a big demand / people are not asking for it because it's rarely asked about.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creativegiant",
      "created_time": "February 02, 2023, 07:34:27 PM",
      "body": "Hey!I'm looking forward to contributing to the Bitcoin-core project. And I also found some good first issues on the Github, but I'm having a hard time downloading the entire node on my laptop (for testing and all). So, is there anything I can do here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "February 03, 2023, 04:50:52 AM",
      "body": "Quote from: creativegiant on February 02, 2023, 07:34:27 PMI'm looking forward to contributing to the Bitcoin-core project. And I also found some good first issues on the Github, but I'm having a hard time downloading the entire node on my laptop (for testing and all). So, is there anything I can do here?For testing, you can use \"Regtest\" which can be set-up in minutes and mine blocks in seconds.You can read more about it in the developer reference's \"Testing Application\" page: developer.bitcoin.org/examples/testing.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}