{
  "id": "topic_5455203",
  "title": "countryfree",
  "author": "countryfree",
  "created_time": "June 05, 2023, 06:47:44 PM",
  "content": "6 months ago, my savings went down because of the FTX debacle. I've never used FTX, I've never been a customer of this company, but my savings are in BTC, and because of that failure, BTC's value went down, and so went my savings.Today, bis repetita. I've never used Binance. I've never been a customer of this company, but because the SEC sues Binance, BTC is down, and so are my savings, so I have a message to all bitcoiners out there.Exchanges and BTC are 2 different things. One exchange going down doesn't mean BTC must follow.Binance will disappear? I don't give a damn.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455203",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 05, 2023, 06:55:31 PM",
      "body": "You're right — but what we think and want doesn't always reflect reality. The fact is, most of the cryptocurrency space at least for now is still largely speculation and not much people (at least yet) care about self-custody and self-sovereignty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 05, 2023, 06:57:24 PM",
      "body": "The market is determined by sentiments, bearish and bullish sentiments of traders affect how the price changes. Binance are one of the biggest holders of Bitcoin, FTX had a large amount deposited with them, so it's only natural that the many holders of Bitcoin there would cause of a negative news on those platforms panic and that in turn that sentiment will affect the price.In the long run as a BTC holder you should not be too worried. The effect of those news last for just a couple of days at best and the market corrects.I would hope it would teach many not to deposit their bitcoins on centralized exchanges but that's not the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 05, 2023, 07:17:23 PM",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PMExchanges and BTC are 2 different things. One exchange going down doesn't mean BTC must follow.Well, sure, the currency and the exchanges are separate. But the price of the currency is determined by a market, and that market is greatly influenced by a few such entities, like Binance and the like. There shouldn't be exchanges used as wallet software in the first place, as you're not supposed to have an intermediary when using or buying bitcoin, but unfortunately many people (who partly define the price) don't get that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 05, 2023, 07:21:11 PM",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PM6 months ago, my savings went down because of the FTX debacle. I've never used FTX, I've never been a customer of this company, but my savings are in BTC, and because of that failure, BTC's value went down, and so went my savings.Today, bis repetita. I've never used Binance. I've never been a customer of this company, but because the SEC sues Binance, BTC is down, and so are my savings, so I have a message to all bitcoiners out there.Exchanges and BTC are 2 different things. One exchange going down doesn't mean BTC must follow.Binance will disappear? I don't give a damn.Everything has its place. There are people who believe so much in exchanges to take care of their assets security more than they think they can do for themselves, and as such, most people save their coins on centralized exchanges with hope and believe that they are the best option. Which is the worst idea anyone can have. A true Bitcoiner knows the value and benefits of self-custodial.The price of Bitcoin always goes down based on the level of fudz, which is a cause against Bitcoin. The Bitcoin price is not controlled by anyone, but most times it can be manipulated, since the case of the SEC coming after Binance CEO is enough reason for non-believers to start panic selling, which can cause a drastic price dump, but this can only be temporary and not a permanent price. But you shouldn't be considering your savings gone until you have sold them out entirely. So long as you still hold your coin, there is a higher chance and possibility of regaining everything that you have calculated to have lost when the bull market comes. That's why we are always advised to hodl strong in a bearish market and never to sell under panic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 05, 2023, 07:42:41 PMLast edit: June 05, 2023, 08:01:05 PM by franky1",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PM6 months ago, my savings went down because of the FTX debacle. I've never used FTX, I've never been a customer of this company, but my savings are in BTC, and because of that failure, BTC's value went down, and so went my savings.Today, bis repetita. I've never used Binance. I've never been a customer of this company, but because the SEC sues Binance, BTC is down, and so are my savings, so I have a message to all bitcoiners out there.Exchanges and BTC are 2 different things. One exchange going down doesn't mean BTC must follow.Binance will disappear? I don't give a damn.you have been around long enough to know this stufffirstly never measure your \"SAVINGS\" based on the volatility of the market price because the market price is indeed controlled by exchanges..instead if your a long term holder stop caring about the market price. and just remember its volatile..instead remember this simple factthere is always a periodic BOTTOM that the markets refuse to sell below. set that as your \"savings value\" per coin per 6 month periodthe bottomline value is almost like the guarantee minimum return. yes the speculative market can swing up above this and you can get temporary opportunities to sell higher then the periodic bottom. but if you are not in a selling mood dont care about the temporary pricesfor instance late 2022 saw the bottom at $15k early 2023 saw it at $17k (even when temporary market prices were over $20k)now the bottomline value is over $20k (even when the market prices are over $25k)knowing you would get a minimum of $15k late 2022 and now $20k in 2023 is much more relaxing though then daily worrying about the daily speculation and volatility of the markets that sit above the bottomline valueif you want to calculate the bottomline value.. take about 6 months of average network hashrate. calculate the cheapest most efficient asic to work out how many asics are needed, how much electric and the cheapest effective electric of prominent mining farms. to then calculate the cost to mine most efficiently on the planet per btcthat there is the effective bottomline cheapest way to acquire bitcoin on the planet(below market rate) meaning no one wants to sell below that amount because no one on the planet can acquire bitcoin via mining, otc trading or CEX trading to get bitcoin any cheaper. so no one on planet will sell below that. which is where the bottomline support steps in to re-inforce that cex markets never correct all the way down to that levelonce you know the number. you can then be rest assured that unless bitcoin really breaks you have a minimum value for your \"savings\" and anything else the speculative market wants to sell for is a bonus above the savings",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorik",
      "created_time": "June 05, 2023, 07:57:33 PM",
      "body": "I am certain this is due to fud. People are selling off due to.fear of the unknown and this in turn is putting pressure of the price of BTC. But they fail to understand that even if Binance falls today, that will not be the end of crypto. I hope they understand this and stop this unnecessary panicking",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 05, 2023, 09:03:58 PM",
      "body": "Well spoken @op, bitcoin and exchanges are two different entities, but unfortunately, they are linked by customers who trade bitcoin on the exchanges, understand that the problem is not with the exchange themselves, but with the customers who panic sells their bitcoin when any major issue arrives, like in the FTX saga last year..If bitcoin holders, who are also customers of this exchanges can come to their senses, and choose withdrawing their bitcoin to their private wallets rather than panic selling whenever there is a negative news, then the negative impact of the news will not at all, show on the price of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "June 05, 2023, 09:20:07 PM",
      "body": "Of course the two are different between exchanges and Bitcoin but the price is determined by the market which is called the exchange that provides this but bitcoin will go with that flow because it depends on how the market reacts with its ups and downs.Your savings may go down the same thing I also have a savings account now in bitcoin and it has gone down due to the news the SEC attacked Binance to sue it but my bitcoin numbers won't change with the influence of this news only in the declining dollar value I think this is very reasonable if we hold in a situation of being in a lot of FUD news it would be better to stay holding.Today our investment is down but one day it will recover again with even higher bitcoin prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 05, 2023, 09:23:26 PM",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PMToday, bis repetita. I've never used Binance. I've never been a customer of this company, but because the SEC sues Binance, BTC is down, and so are my savings, so I have a message to all bitcoiners out there.This clearly a case of FUD reaction by mostly traders. If we look at the this exchanges mostly centralized exchanges we would find out that most of the coins stored on them are for traders that utilizes the features like spot trading, future trading, margin trading and its likes. And binance been the largest or biggest exchange it is possible that it will have more traders on it. And we all know traders aren’t investors that would hold on to their coins or withdraw them to a proper wallet. The traders will be predicting a price drop in bitcoin and the rest as CZ is reported to be sued, and then they also would just sell off their funds to either fiat or stablecoins. The continuous increase of different trading features on exchanges will definitely make it hard for traders mostly daily traders to take off their funds off the exchanges. Also if the many people do not only see the use of bitcoin as payment method or an asset that can be stored but a currency for different trading purposes and without decentralized exchanges matching the number of different trading features on centralized exchanges, sadly many will continue to hold there funds on platforms like binance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "June 05, 2023, 10:05:39 PM",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PM6 months ago, my savings went down because of the FTX debacle. I've never used FTX, I've never been a customer of this company, but my savings are in BTC, and because of that failure, BTC's value went down, and so went my savings.Today, bis repetita. I've never used Binance. I've never been a customer of this company, but because the SEC sues Binance, BTC is down, and so are my savings, so I have a message to all bitcoiners out there.Exchanges and BTC are 2 different things. One exchange going down doesn't mean BTC must follow.Binance will disappear? I don't give a damn.Unfortunately, that's jist how market value works in this technology. Being affected by many factors is \"double-edge\". Indirect positive news will result to increase on cryptos' market value but same thing with negative articles. Reason? as others have mentioned, FUD. As far as I know, Binance would still function during the suitcase but it is just investors who wants to exit early and avoid bigger losses from people who would panic. Quite of a domino and relative events given that there's a belief of a downfall with Bitcoin's price because of CME gap below $23k. It is our reaction which creates a wave or movement with its market value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 05, 2023, 10:11:15 PM",
      "body": "The value of your coins goes up not because millions of people adopt Bitcoin to pay with it for their morning coffee, it's because companies like Binance allow millions of people to quickly and conveniently invest in Bitcoin and trade it. Binance is responsible for a large share of total Bitcoin trading volume, so like it or not, exchanges will be a major factor for Bitcoin's price, until most of the trading volume will move to DEX, which might not even happen ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "June 05, 2023, 10:28:28 PM",
      "body": "Bitcoin and Exchanges are different but they are both connected to each other that is why, as you have experienced when Binance has a problem, it affects the price of Bitcoin as well. And this is because exchanges have a huge role in the crypto space where people are buying and selling there, and if any problems arise with these exchanges, users are really affected. That is why people are giving more attention and importance to them as it was one reason why people are here and make a good profit and trading are alive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "June 05, 2023, 10:39:07 PM",
      "body": "Bitcoin and exchanges are different, but there is a need of a platform through which the market for the bitcoin is built. If exchanges weren't available, what would've happened. Everyone who have got bitcoin will be holding it and there won't be any trading practice which keeps the market stable. If not we could've got moved to the ancient days or to the paper and pen on trading. Exchanges are part of the development. Everything can't be cent percent perfect, so is the service provided through the exchanges. The cryptomarket have got some connectivity with the exchanges, just because of that we were able experience downfall in the market when something good happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "countryfree",
      "created_time": "June 06, 2023, 12:19:30 AM",
      "body": "Somehow, it's about the same thing with stocks, people are always overreacting.On the other hand, this shows how small, and concentrated BTC still is. There are many banks, and if one bank collapse, the currency doesn't follow. But one exchange is sued (it's not collapsing, yet), and BTC loses 5% within the hour. That's not normal. Maybe there aren't enough exchanges, so that one going down shouldn't have any effect on BTC's value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandji02",
      "created_time": "June 06, 2023, 02:03:24 AM",
      "body": "Yes, you're right. I've never used either of them too. But still, for the masses, things like that create a bad image of crypto, so it all goes down, you know how that works. We can embrace or at least endure it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "June 06, 2023, 02:04:21 AM",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PM6 months ago, my savings went down because of the FTX debacle. I've never used FTX, I've never been a customer of this company, but my savings are in BTC, and because of that failure, BTC's value went down, and so went my savings.Today, bis repetita. I've never used Binance. I've never been a customer of this company, but because the SEC sues Binance, BTC is down, and so are my savings, so I have a message to all bitcoiners out there.Exchanges and BTC are 2 different things. One exchange going down doesn't mean BTC must follow.Binance will disappear? I don't give a damn.Exchanges can be created and can die with time. Many reasons for their disappearance that can be a scam exit, a governmental seizure or self service closure. We never know what will be ending of one exchange whether it is a decentralized exchange or a centralized exchange.If we store our bitcoin at a centralized exchange, if they go down, we lose our coins.Reminder: do not keep your money in online accountsIf a big exchange go die, it will create big impacts on cryptocurrency market and price will be down a lot, -20 or -30% or more but if Bitcoin won't die, its price will recover after all and will continue to grow in its network hashrate and bitcoin price on market will continue to grow with every halving in future.You only lose your savings if you sell your bitcoins when you are panic. If you hold your bitcoins, with recovery of bitcoin price, you won't lose anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "June 06, 2023, 02:23:33 AM",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PM~Binance will disappear? I don't give a damn.Negative news = negative effect towards the crypto market. Market is heavily driven by emotions, by sentiments of the investors.Though this wasn't the case for some news, most of the time whenever there's a negative news, the sentiment of the investors is going negative, thus they feel panic, and they will sell their holdings, causing the prices to go down.I don't know if it's just me, but I've seen Binance being sued for many times already. CZ denied the allegations on his twitter account, and these are just \"SPECULATIONS\" because of the word \"ALLEGED\" meaning they aren't 100% sure if it's true. Now to answer your question, I guess the fact that most of the investors are using Centralized Exchanges whenever they buy and sell makes it more important to them. I mean if these exchanges will disappear, what will be our options if we want to buy, or/and sell Bitcoin, and other altcoins.Well like you, I will not get affected if Binance will suddenly disappear, but I doubt it will happen. Just look at FTX. It has an issue a few months ago like you shared, but it's still operating like nothing happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGamblingSites",
      "created_time": "June 06, 2023, 02:29:15 AM",
      "body": "Whenever BTC Price goes down, always best to wait 2 - 5 years and ask yourself if you're still upset",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "June 06, 2023, 02:31:58 AM",
      "body": "Quote from: countryfree on June 05, 2023, 06:47:44 PM6 months ago, my savings went down because of the FTX debacle. I've never used FTX, I've never been a customer of this company, but my savings are in BTC, and because of that failure, BTC's value went down, and so went my savings.Today, bis repetita. I've never used Binance. I've never been a customer of this company, but because the SEC sues Binance, BTC is down, and so are my savings, so I have a message to all bitcoiners out there.Exchanges and BTC are 2 different things. One exchange going down doesn't mean BTC must follow.Binance will disappear? I don't give a damn.In the past, if we didn't know enough about cryptocurrencies and received terrible news about any project or thing related to bitcoin, we would panic. As a result, many sell their assets right away to minimize the potential losses that unfavorable news could bring about. If you look at the market, it has happened before. And now, people are getting matured and they no longer purchase this type of stuff because they believe it is just manipulation. As a result, even though there are several charges against Binance, the price of Bitcoin will not fall significantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}