{
  "id": "topic_5416061",
  "title": "gmaxwell",
  "author": "gmaxwell",
  "created_time": "October 05, 2022, 05:27:54 PM",
  "content": "As many are aware, the infamous faketoshi scammer Craig Wright has been on a campaign to use harassment, intimidation, barratry, and fraud to attempt to steal some 1.1M coins that belong to Satoshi and others.In furtherance of this scheme his company just published code for directing the seizure of third party coins in the BSV blockchain. BSV is a scammy bitcoin knockoff that is proprietary software controlled exclusive by Wright and his agents. Users of BSV are only permitted to run the software he approves so they're able to foist their coin stealing code onto their users which would be impossible for legitimate cryptocurrencies.Because of this I believe any user of the BSV altcoin is in serious risk of exposure to network consensus instability or outright having their assets frozen or stolen out from under them.This would be of no direct relevance to Bitcoin users except some Bitcoin exchanges support BSV and so far whenever an exchange has gone insolvent they've pooled assets from all users in the bankruptcy. This means that if an exchange becomes insolvent due to Wright stealing or freezing BSV out from under it users Bitcoin balances may be used to make BSV customers whole.While it's never a good idea to leave Bitcoins you aren't actively trading on exchange I'd strongly recommend getting your funds off the following exchanges ASAP (non-exhaustive list):RobinhoodBitfinexBittrexHitbtcHuobi GlobalKucoinBithumbGate.ioPoloniexCoinWIndoexOKXCoinDCXPionexUpbitBiboxBkexYobitDeepcoinMexo ExchangeWazirxCoinExThis shouldn't be news to these exchanges as it's been known for some time that this was coming: https://twitter.com/Arthur_van_Pelt/status/1577647343595315201Of course, since the BSV ecosystem has been engaging in non-stop harassment of Bitcoiners including multibillion dollar lawsuits against Bitcoin developers and non-BSV supporting exchanges it's probably prudent to not to business with exchanges still supporting this ecosystem to begin with, if you care about the value of your Bitcoins'. If an exchange will support this scam just to make a bit of extra money-- what else might they do?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416061",
  "comments": [
    {
      "author": "Bitstar_coin",
      "created_time": "October 06, 2022, 02:38:44 PM",
      "body": "One thing is clear, faketoshi is not satoshi, no real satoshi will go after other bitcoiners and developers of btc. If the court has any knowledge whatsoever should already know that satoshi can not attack his own. Hope bitcoiners will take the above message seriously and take the necessary action before they will regret it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 06, 2022, 02:48:51 PM",
      "body": "I'm actually thinking about using this as a list of exchanges to avoid (as in, high risk - do not trade on ever).I already have a small list of exchanges if I ever need to quickly withdraw or cash out something:- Binance (this will be primary)- One or more of Gemini, FTX, or Kraken as an immediate backup.Coinbase is off of this list because they are too overzealous in chattering about any event from depositing/withdrawing crypto to failing KYC, to the Feds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "October 06, 2022, 03:33:58 PM",
      "body": "I do not use any of these exchanges except Kucoin. I have an account on Kucoin. But, due to KYC issues. I haven't verified my account. Not only Bitcoin, but I also recommend everyone not use those platforms even if they want to buy altcoins. If you have altcoins in those exchanges, Get them off ASAP. It is not recommended to use Exchanges to hold any coins. But, You may need to use exchanges to buy or sell currencies, Then use Binance. Still, again, Don't hold your coins on exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 06, 2022, 04:11:11 PM",
      "body": "Quote from: NotATether on October 06, 2022, 02:48:51 PMI already have a small list of exchanges if I ever need to quickly withdraw or cash out something:- Binance (this will be primary)- One or more of Gemini, FTX, or Kraken as an immediate backup.I would add Bitstamp to that list. They are the oldest bitcoin exchanges which is still active. Never had problems with them and I use them for some time already.Quote from: gmaxwell on October 05, 2022, 05:27:54 PMThe size of this list is impressive and there are many big names like Huobi, Kucoin, Poloniex.. I didn't know that só many exchanges would support this altcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 06, 2022, 04:56:21 PM",
      "body": "Quote from: NotATether on October 06, 2022, 02:48:51 PM already have a small list of exchanges if I ever need to quickly withdraw or cash out something:- Binance (this will be primary)Am surprised to see how Binance does not make it to the list but that does not support the fact that they are all centralized, i admit with you that only the little amount needed to be exchanged for cash should only be with these centralized banks (exchanges)   and if we must use an exchange then the decentralized ones are the best ideally ones, Binance is just populated with users allover the world but makes no difference in term of data leakage, while some avoided CEX entirely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 06, 2022, 06:59:46 PM",
      "body": "Why isn't Coinbase in this list? Besides being a privacy nightmare and KYC beggar, Brian Armstrong has been really silent with the Hodlonaut's case. He's also blacklisted Russian-related addresses, treating bitcoin as non-fungible, goes in bed with regulators such as the IRS and DEA, and is willing to sell personal data to whoever asks for it. There's no doubt he'll trade his principles for profit for once more. Basically, any centralized exchange that lists BSV and hasn't yet removed it with all the evidence that prove Wright is a liar, should be included.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 06, 2022, 07:06:37 PMLast edit: October 07, 2022, 07:05:01 AM by o_e_l_e_o",
      "body": "Quote from: NotATether on October 06, 2022, 02:48:51 PMI already have a small list of exchanges if I ever need to quickly withdraw or cash out something:- Binance (this will be primary)- One or more of Gemini, FTX, or Kraken as an immediate backup.Why are any of those better than any of the ones on the list above? All have the power to arbitrarily freeze your coins, all will use your deposits to socialize losses from hacks, scams, or bankruptcy, and all host a bunch of other shitcoins. There are plenty of other shitcoins out there other than BSV which could collapse and take entire platforms with them (e.g. Luna collapsing just a few months ago and taking the likes of Celsius and Voyager down with it).Sure, the ones Greg has listed are perhaps riskiest right now because of the BSV scam, but looking long term then every centralized exchange is just as risky as every other one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "October 06, 2022, 07:20:19 PM",
      "body": "Quote from: BlackHatCoiner on October 06, 2022, 06:59:46 PMWhy isn't Coinbase in this list? Besides being a privacy nightmare and KYC beggar, Brian Armstrong has been really silent with the Hodlonaut's case. He's also blacklisted Russian-related addresses, treating bitcoin as non-fungible, goes in bed with regulators such as the IRS and DEA, and is willing to sell personal data to whoever asks for it. There's no doubt he'll trade his principles for profit for once more.Between the list in this thread and the list in the \"taint-proclaiming\" thread, it should cover all the bases.  If you are a conscientious consumer, avoid all these so-called services.  A popular idiom has always been that you \"vote with your wallet\", so it becomes almost literal in this instance.  Nothing will improve if we don't adopt a form of activism and shun companies that aren't operating by our preferred ideals.Quote from: o_e_l_e_o on October 06, 2022, 07:06:37 PMbut looking long term then every centralized exchange is just as risky as every other one.Absolutely.  But if people insist on using them (and some sadly always will), they could at least try to use the ones with a modicum of respectability.  Any exchange entertaining the existence of BSV or taint should be considered bereft of decency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "October 06, 2022, 07:45:04 PM",
      "body": "I’m surprised that shitcoin is still functioning, weird that Ayre & Wright are still towing the party line. You would have thought they’d have just sold everything & given up by now. Satoshi’s Vision, the real bitcoin? Don’t make me laugh.If you’re looking for a trustworthy exchange then I highly recommend Kraken. It’s my go to exchange, never had any issues. Obviously though as gmaxwell said in the OP, you shouldn’t be leaving any amount of bitcoin on an exchange long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 06, 2022, 07:53:05 PM",
      "body": "Quote from: gmaxwell on October 05, 2022, 05:27:54 PMOf course, since the BSV ecosystem has been engaging in non-stop harassment of Bitcoiners including multibillion dollar lawsuits against Bitcoin developers and non-BSV supporting exchanges it's probably prudent to not to business with exchanges still supporting this ecosystem to begin with, if you care about the value of your Bitcoins'. If an exchange will support this scam just to make a bit of extra money-- what else might they do?There are more exchanges that have BSV shitcoin listed, and most volume reported on Coingecko is in Digifinex exchange, and you can also add AscendEX (BitMax) exchange.I don't think withdrawing Bitcoin from this exchanges will solve anything, and people shouldn't really hold coins on any centralized exchange.Fun fact, BSV network is totally unsustainable, and like Jameson Lopp recently posted on twitter, it exceeded 7 TB, adding 4 GB per day, priced at ~$50 per gigabyte in transaction fees  It's just a matter of time when this crap will stop existing by itself:https://nitter.fly.dev/lopp/status/1577741709693403159",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 06, 2022, 09:02:54 PM",
      "body": "Quote from: o_e_l_e_o on October 06, 2022, 07:06:37 PMQuote from: NotATether on October 06, 2022, 02:48:51 PMI already have a small list of exchanges if I ever need to quickly withdraw or cash out something:- Binance (this will be primary)- One or more of Gemini, FTX, or Kraken as an immediate backup.Why are any of those better than any of the ones on the list above? All have the power to arbitrarily freeze your coins, all will use your deposits to socialize losses from hacks, scams, or bankruptcy, and all host a bunch of other shitcoins. There are plenty of other shitcoins out there other than BSV which could collapse and take entire platforms with them (e.g. Luna collapsing just a few months ago and taking the likes of Celsius and Voyager down with it).Sure, the ones Greg has listed are perhaps riskiest right now because of the BSV scam, but looking long term then every centralized exchange is just as risky as every other one.What you said is true, but the general perception of the average crypto user is that giant exchanges which have been around for a long time and have a history of surviving hacks are much less at risk of bankruptcy than the rest. Let's assume a well-behaved user who is already verified. Insolvency scares the crap out of users more than anything then.Bisq is obviously the best choice but I haven't gotten around to installing that yet... don't even know its system requirements. Could serve as the new primary for the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "October 07, 2022, 12:44:32 AM",
      "body": "I am glad to see that most of the exchanges I am using right now are not on the list...but anyway since I am not holding a lot of coins and tokens on exchanges I think am generally safe in case something bad can happen when Craig Wrong will be gone mad. Craig never fail to be \"relevant\" in a bad way...as he and his team are always concocting something maybe just to land on the news and to be creating havoc on other people and organizations. This man should be in jail now by being a fraud, liar and shameless crock.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 07, 2022, 04:53:40 AM",
      "body": "Quote from: NotATether on October 06, 2022, 02:48:51 PM- Binance (this will be primary)I think it is worth remembering that Binance (and some others like it that don't list BSV today) have been supporting this scam altcoin for a long time before they removed it. Basically they were all happy to list this obvious scam as long as it had a high volume and could give them a lot of money and delisted it as soon as the volume dropped and the pressure from the community became bigger than the profit they could make.Lest we forget how Binance was offering mining pools money to commit a 51% attack just to reverse their stupidity (when they got hacked).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 07, 2022, 07:23:30 AMLast edit: October 07, 2022, 08:25:05 AM by o_e_l_e_o",
      "body": "Quote from: dkbit98 on October 06, 2022, 07:53:05 PMFun fact, BSV network is totally unsustainable, and like Jameson Lopp recently posted on twitter, it exceeded 7 TB, adding 4 GB per day, priced at ~$50 per gigabyte in transaction fees  It's probably worth pointing out that this is completely intentional. As Greg has pointed out above, CSW's team will be releasing code which allows him to arbitrarily seize BSV. This will only work if the majority of nodes run this idiotic code. This would obviously be impossible on a decentralized network such as bitcoin, where >99.9% of nodes would simply refuse to run such code. But since they've deliberately made it so difficult to run a BSV node (there are currently a grand total of 9 nodes at the chain tip), it becomes much easier to get a majority of nodes to implement these changes, particularly since the majority of nodes are being running by CSW, Ayre, or another member of his team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gmaxwell",
      "created_time": "October 07, 2022, 09:32:27 AM",
      "body": "Yep, the unsustainability of BSV isn't an accident.  The original, successful, attack was removing the capacity limits.  From there they could at no cost slowly drive almost everyone else off the network.  That opens the door to adverse rule changes.This is an attack these scammers wanted and tried to perpetrate against Bitcoin but the Bitcoin community fought them back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 07, 2022, 10:03:31 AM",
      "body": "Quote from: o_e_l_e_o on October 07, 2022, 07:23:30 AMIt's probably worth pointing out that this is completely intentional. As Greg has pointed out above, CSW's team will be releasing code which allows him to arbitrarily seize BSV. This will only work if the majority of nodes run this idiotic code. This would obviously be impossible on a decentralized network such as bitcoin, where >99.9% of nodes would simply refuse to run such code. But since they've deliberately made it so difficult to run a BSV node (there are currently a grand total of 9 nodes at the chain tip), it becomes much easier to get a majority of nodes to implement these changes, particularly since the majority of nodes are being running by CSW, Ayre, or another member of his team.If someone had a million dollars a year to spend, they could use it to break their tactics on their own chain by running 2x the amount of nodes that they are running, so that's 18 more nodes - all in the cloud. CSW can't do nothin' about it without running more nodes, which will burn a hole in his pocket and especially Ayre's pockets. Running those nodes anonymously would be an even better tactic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 07, 2022, 10:25:44 AM",
      "body": "Quote from: pooya87 on October 07, 2022, 04:53:40 AM~snip~CZ and similar leaders (as some call them) could have chosen never to support anything that more than evidently indicated that it would turn into a greedy enterprise of a few people with dangerous intentions - but all of them, if we are honest, never cared too much for Bitcoin, nor do they today. Even when some people like @hodlonaut find themselves in court because they told the truth, none of these leaders want to show their support, or they show it in a very strange way by conditioning donations in some kind of altcoins.I was honestly surprised that so many CEX are still supporting a project backed by someone like Faketoshi...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "October 07, 2022, 11:50:31 AM",
      "body": "Apart from the shady trick pulled by the BSV team lately, the project is a complete mess right from the beginning due to the dramatic entry of Craig Wright and his allies (Ver) who now turn foes after the betrayal that happen between them. If we evaluate all these things only a naive person won't understand that it doesn't take Craig anything to steal from the BSV supporter.In fact, the project representative on this forum once makes a statement on this forum that the project is over on their ANN thread but sadly, I look for the post for over an hour but it was taken down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin SV",
      "created_time": "October 07, 2022, 01:05:25 PM",
      "body": "Quote from: gmaxwell on October 05, 2022, 05:27:54 PMBitfinexAre you crazy? This is a top exchange",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}