{
  "id": "topic_5453837",
  "title": "durop77",
  "author": "durop77",
  "created_time": "May 24, 2023, 07:03:50 AM",
  "content": "Воз опубликовало предупреждение о том, что будет новая пандемия опаснее ковида. Что она более смертельная и опасная. И что всему миру стоит готовить уже к началу новой пандемии. Как вы считаете в нынешних реалиях возможна новая пандемия да и еще более страшная?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453837",
  "comments": [
    {
      "author": "Xal0lex",
      "created_time": "May 24, 2023, 07:22:40 AM",
      "body": "Такие заявления желательно бы подкреплять ссылками на источник(и) подобной информации.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koleusdat",
      "created_time": "May 24, 2023, 08:48:19 AM",
      "body": "Quote from: Xal0lex on May 24, 2023, 07:22:40 AMТакие заявления желательно бы подкреплять ссылками на источник(и) подобной информации.Да такое утром распростараняли по информационным каналамВот например: https://ria-ru.turbopages.org/turbo/ria.ru/s/20230524/pandemiya-1873758215.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "May 24, 2023, 04:42:27 PM",
      "body": "Quote from: koleusdat on May 24, 2023, 08:48:19 AMДа такое утром распростараняли по информационным каналамВот например: https://ria-ru.turbopages.org/turbo/ria.ru/s/20230524/pandemiya-1873758215.htmlИ все они просто делают кликбейтные заголовки, чтобы прилечь внимание к своим отстойнешим \"информационным каналам\", хотя там ничего такого серьёзного на самом деле не было. Вот новости самого ВОЗ: https://www.who.int/ru/news-roomЯ так понял, что на традиционном съезде они предложили как-то улучшить координацию в действиях между странами и ВОЗ, так как пандемия коронавируса показала кто где срал, что не всё так гладко как хотелось бы, да и вообще предыдущий порядок действий больше чем сто лет назад был согласован, надо бы обновить на случай повторения ситуации.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 24, 2023, 05:09:02 PM",
      "body": "Добавлю к этому, что по ссылке там не говорится, что именно будет, как заявил нам автор топика. Там идёт речь, что если будет.Quote from: https://ria-ru.turbopages.org/ria.ru/s/20230524/pandemiya-1873758215.htmlУгрозу новой пандемии, гораздо более опасной, чем COVID, нельзя исключать, приводит слова генерального директора Всемирной организации здравоохранения Тедроса Адханома Гебрейесуса на ежегодной ассамблее ВОЗ в Женеве. \"Угроза появления другого варианта (COVID. — Прим. ред.), способного привести к новым вспышкам болезни и смертей, остается. Также остается угроза появления нового патогена с еще более смертоносным потенциалом\", — заявил глава ВОЗ.Гебрейесус призвал весь мир быть готовым в будущем дать этой угрозе коллективный ответ.Где тут речь о том, что она (пандемия) именно будет? Просто предупреждение о том, что если и будет, то она будет более опасной. Что, кстати, логично. Вирусы всё время мутируют, чтобы выжить в борьбе с лекарствами, которые придумывает человек. Соответственно, становятся более опасными.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}