{
  "id": "topic_5405911",
  "title": "Ucy",
  "author": "Ucy",
  "created_time": "July 11, 2022, 04:52:57 PM",
  "content": "I guess most people have no idea that evil money (cursed money) and good money (blessed money) do actually exist. It's important to know how to avoid the cursed money if you want to be always satisfied with your earnings no matter how little they are. I want to show you how you can always have enough and avoid the curse of wasting & misusing your earnings. The truth is if you earn money you do not deserve, you will end up wasting it until you are left with what you deserve. For example, if you are paid a thousand dollars for a work that's actually worth $300,  $700 will be misused or wasted by you in different ways; you could buy $700 worth of electronics and it get stolen or spoiled easily....or the $700 will be lost utrightly. To avoid this problem, you need to make sure you do extra work for the one who is paying you and do it well so that it's actually worth the $1000 you were paid. Once this is done  your money and things you buy with it is automatically preserved, because you deserve itGood money is money earned from doing good work... that is, from solving problems without creating more problems, while evil money is money earn from evil work, that is, works that create more problems rather solving them. Money earned from doing good work, no matter how little is always enough. If you are not paid enough for your good work, you are naturally compensated with things you need in such a way that makes things look like you were paid enough. For example, you do a good work that is worth $1000 but you got paid $300, the $300 will be enough to buy you things that's actually worth $1000 or more. And these things will last long for you.  People who do evil work end up with what they deserve. Workers reap what they sow: if they create more problems, they reap more problems making the big earnings they received not to be enough. If they solve problems without creating more problems they reap things without problems and they little they were paid becomes enough. What I just revealed to you is a great Mystery of money/reward. It's worth alot but I give it to you for free. If you apply it in your life, you may never worry about money again but instead focus on solving problems without creating more problems. This is how the CREATOR of this World designed things.I wrote a book on this in detail, incase you are interested send me message.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405911",
  "comments": [
    {
      "author": "mu_enrico",
      "created_time": "July 11, 2022, 06:18:52 PM",
      "body": "Ah, so it's based on the religion (not sure which religion).I'm not gonna argue with the belief thing, but this is difficult to measure:Quote from: Ucy on July 11, 2022, 04:52:57 PMFor example, if you are paid a thousand dollars for a work that's actually worth $300,  $700 will be misused or wasted by you in different ways;How do you measure the actual worth of a work?Is it labor cost (work hour)? Since different people value his time differently, won't it be a problem?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "July 11, 2022, 07:45:51 PM",
      "body": "I disagree with the examples you gave. I thought you were going to classify \"cursed money\" as money made from illegal activities such as human trafficking, Black arms trade e.t.c. Quote from: Ucy on July 11, 2022, 04:52:57 PMFor example, you do a good work that is worth $1000 but you got paid $300, the $300 will be enough to buy you things that's actually worth $1000 or more. And these things will last long for you.  This is not how things work in the real world. You got cheated of $700, and paid only $300 you think the value is going to magically reflect in your $300? This reminds of bible story of Jesus feeding the multitude with five loaves of bread and two fishes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 11, 2022, 10:35:01 PM",
      "body": "Quote from: Pokapoka124 on July 11, 2022, 07:45:51 PMI disagree with the examples you gave. I thought you were going to classify \"cursed money\" as money made from illegal activities such as human trafficking, Black arms trade e.t.c. Quote from: Ucy on July 11, 2022, 04:52:57 PMFor example, you do a good work that is worth $1000 but you got paid $300, the $300 will be enough to buy you things that's actually worth $1000 or more. And these things will last long for you.  This is not how things work in the real world. You got cheated of $700, and paid only $300 you think the value is going to magically reflect in your $300? This reminds of bible story of Jesus feeding the multitude with five loaves of bread and two fishes. Good and Evil money, do the criminal even believe that?Even money made from legitimate means could be used in buying electronics and still, the electronic could be stolen. What does that make it then?Well, your examples @OP doesn't exactly agree with me. I might take money from illegal deals like as mentioned by @Pokapoka124 and to add a little, the money earned through scamming as its been done by 1xbit and its campaign participants on the forum.When you complete a supposedly $1000 deal with $300, using proper quality materials while putting in your best to attain success, I call the $700 left over profit. Its why deals are bargained for. Its a matter of the employer not being skilled enough to quantify the job and make proper bargaining. It's really up to the individual offering the service at this point. That's just the real world for you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "July 11, 2022, 11:52:16 PM",
      "body": "Quote from: Ucy on July 11, 2022, 04:52:57 PMGood money is money earned from doing good work... that is, from solving problems without creating more problems, while evil money is money earn from evil work, that is, works that create more problems rather solving them. Money earned from doing good work, no matter how little is always enough.I have read and observed to see if this is true.There was a famous case of gamblers in the NBA having connections to referees who would held them to rig games in their favor. They made a lot of money. As far as I know, none of them lived a life which allowed them to enjoy the wealth they accumulated through corrupt means. To some extent this is documented. It is a well known story covered by mainstream media in years past when journalists were more honest and news was more reliable.Wealth accumulated through corrupt means could be blood money. It is ingrained with sin and malice which cannot easily be removed. It is cursed in a way. This is a topic I've always been curious of and wondered about. Whether karma exists and is a real thing. It is interesting to think about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "July 11, 2022, 11:52:40 PM",
      "body": "It sucks but typically morality isn't going to pay for food and goods at the check out- $300 and it's proven I am of high moral character isn't going settle the $1000 bill in front of me, at least immediately it won't and this is what's required at check out.  However, this doesn't excuse one to earn immorally or evilly.  All I'm saying is unfortunately, most don't care.  The religious speak, not saying you, also reminds me of when some preachers say this in order to get more money out of their parishioners, e.x, you only need $300, give the rest to God (like he needs our money) and he'll turn that $700 into $7000; all the while, it's that preacher and his family who is making out.  Sad things is you have many folks going broke following this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 12, 2022, 03:33:19 AM",
      "body": "I believe in morality when it comes to making money, but not based on God. For example, don't scam people to make money is a principle that the vast majority of people can agree on, except for a few scammers. But this thread, coming from someone who writes this:Quote from: Ucy on April 30, 2022, 09:32:56 AMI created a Signature to prove that the right posts can have a positive impact on the price of Bitcoin. It is yet another nonsense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 12, 2022, 04:44:32 AM",
      "body": "I think its just a superstition.Most cash in the world is already tainted with drugs, according to a case study. But nobody seems to (or should have to, for that matter) care about that because that money is no longer in hands of drug dealers.If people use their money for illegal activities they get caught by the feds, that's all. It doesn't \"bless\" or \"curse\" the guy who receives it next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "July 12, 2022, 06:35:12 AMLast edit: July 12, 2022, 06:48:02 AM by xSkylarx",
      "body": "Quote from: Ucy on July 11, 2022, 04:52:57 PMPeople who do evil work end up with what they deserve.Good or evil can be subjective. Let's say a person that is always gambling. It isn't that bad as long as you know your limits and complete your responsibilities before gambling. He always gamble a portion of his money dreaming to win the jackpot. Normally we think that money/profit from gambling are evil money because it causes addiction. But what if he is not that type of gambler and he manages to win a huge amount and spend it wisely that completely changed his life, then his winnings can be considered a good money. We can only call it evil money if he gambled more after he won until he just lose it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "July 12, 2022, 08:23:04 AM",
      "body": "Quote from: Ucy on July 11, 2022, 04:52:57 PMI guess most people have no idea that evil money (cursed money) and good money (blessed money) do actually exist. It's important to know how to avoid the cursed money if you want to be always satisfied with your earnings no matter how little they are. I want to show you how you can always have enough and avoid the curse of wasting & misusing your earnings. The truth is if you earn money you do not deserve, you will end up wasting it until you are left with what you deserve. For example, if you are paid a thousand dollars for a work that's actually worth $300,  $700 will be misused or wasted by you in different ways; you could buy $700 worth of electronics and it get stolen or spoiled easily....or the $700 will be lost utrightly. To avoid this problem, you need to make sure you do extra work for the one who is paying you and do it well so that it's actually worth the $1000 you were paid. Once this is done  your money and things you buy with it is automatically preserved, because you deserve itGood money is money earned from doing good work... that is, from solving problems without creating more problems, while evil money is money earn from evil work, that is, works that create more problems rather solving them. Money earned from doing good work, no matter how little is always enough. If you are not paid enough for your good work, you are naturally compensated with things you need in such a way that makes things look like you were paid enough. For example, you do a good work that is worth $1000 but you got paid $300, the $300 will be enough to buy you things that's actually worth $1000 or more. And these things will last long for you.  People who do evil work end up with what they deserve. Workers reap what they sow: if they create more problems, they reap more problems making the big earnings they received not to be enough. If they solve problems without creating more problems they reap things without problems and they little they were paid becomes enough. What I just revealed to you is a great Mystery of money/reward. It's worth alot but I give it to you for free. If you apply it in your life, you may never worry about money again but instead focus on solving problems without creating more problems. This is how the CREATOR of this World designed things.I wrote a book on this in detail, incase you are interested send me message. Money is not good or bad. Any idea that it can be is fundamentally wrong. You are associating the activities that lead you to accumulating money with the underlying asset, which means you do not understand it enough and certainly should not be writing a book about it. You're trying to portray something but give pretty poor examples, besides obvious criminal activity which is illegal and could easily result in you losing money as fast as you made it, there are other scenarios where you earn money without contributing much to society. That is usually known as a rent seeking activity, for example renting out a house is not producing anything of value over the long term and simply extracting money from people who may be forced to pay rent because richer people have purchased up all the homes which makes them heavily unaffordable for the average earner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "July 12, 2022, 10:57:04 AM",
      "body": "If this \"good vs. evil money\" theory was true, almost all the millionaires and billionaires around the world would just waste the fortune they don't deserve.  The reality is way different than your beliefs and assumptions.Your \"good/evil money\" theory has another name: Karma is a bitch.  The bad things you do in life come back and kick you in the ass at some point. This isn't statistically or empirically proven, but many people still believe in this superstition. I'm not sure if this has something do with religion. I've seen many criminals living a luxurious lifestyle, dating hot women and getting away with their crimes. Maybe they will receive their punishment in the afterlife(if there is afterlife). Justice is a human concept. In reality, there's no such thing as justice in the mother nature or the universe. Life isn't fair and it never will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 12, 2022, 11:39:50 AM",
      "body": "Quote from: Pokapoka124 on July 11, 2022, 07:45:51 PMThis is not how things work in the real world. You got cheated of $700, and paid only $300 you think the value is going to magically reflect in your $300? This reminds of bible story of Jesus feeding the multitude with five loaves of bread and two fishes. Seriously.  I think I understand what OP is trying to say, but if indeed I do it sounds very much like magical thinking--and I guess you could consider religion to be one of the most popular examples of that (and no doubt the most acceptable one).I don't believe in karma either.  Why?  Because really awful, nasty, evil human beings can become very successful in life and enjoy things others only dream of.  Whether any of that makes them truly happy or not is up for debate, but the fact remains that if bad deeds equated with some supernatural retribution, I'm not buying it.  Good people get screwed all the time.  So I don't agree with OP's assertion that there's any special moral characteristic that can be attributed to money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "July 12, 2022, 11:57:25 AM",
      "body": "As much as I want to agree but it doesn't work like that anymore. There are people who can swallow the food bought from the fruits of evil deeds. Likes scams which we happen to bump many times in this forum. Sure, those who worked hard to make a living are more conservative about spending but when you see people waste money because they can create it the easy way it makes others think they should just follow the same way. I worked as an employee for a lot of years and trust me it didn't get me anywhere. It may have provided what I needed to live but it will not provide for the future. I am not suggesting to do illegal works, it's just that, you have to be creative today to have a better life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 12, 2022, 01:22:37 PM",
      "body": "You are paid ...based on your market value in your specific area of work that you do. Your employer will determine what the salary must be, after research was done to determine what the industry standard is for the payment of that specific job.In my view... people earning \"money\" through illegal means... might be perceived as \"evil\" money. (This is money that are stolen or linked to criminal actions.. drugs / smuggling / money laundering etc..)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "July 12, 2022, 01:25:25 PM",
      "body": "Therefore, “What you sow is what you reap”. If the plant is good, the harvest is good, and if the plant is bad, the harvest is bad. That's all you can see if this topic points in our thread section.That is why I believe that money is the root of evil. But it can also be the root of doing good to others, that's all I see in Money. In fact, money is not bad, it only becomes bad when used in the wrong way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "July 12, 2022, 01:32:17 PM",
      "body": "I don't agree with the words you said if what you say was true the richest countries were the most religious countries where they advise you to earn money in good ways while we know it's not true and saying words like good money is just for a naive people to keep them on the way they want and take their freedom while the money they earn from a good cause or a bad one doesn't change anything, it's just about being wise and something being wise means being evil, what say here maybe have many fans between the religious people but not here where people are thinking about proper ways to maximize their profits from the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 12, 2022, 01:41:04 PM",
      "body": "If it were possible to search the spiritual realm, maybe some of us would have done it to verify the authenticity of your claim, because I believe all you've said are based on the spiritual aspect of money and reward as you've called it.But in this physical world we live in, 99 percent will never believe in this type of theory, it doesn't matter how fascinating the theory sounds, alot of times, I've heard that the spiritual controls the physical, many do not believe it, I am just neutral in all of this, because it is better to stay neutral in things one is not sure whether they truly exist or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopTort777",
      "created_time": "July 12, 2022, 01:44:34 PM",
      "body": "Here is the question to Ucy - if I buy an alcohol in Turkey, the seller gets good or evil money? Alcohol is forbidden for Muslims. And then I go a next shop and buy fake Nike t-shirt. Then these are money good or bad? Considering I've got USD from converting Bitcoin, and that Bitcoin was send to me via mixer  The idea of getting more than deserved for an item or services is silly. If one party is ready to pay certain amount, and the other party agrees to accept that amount for an item or service, then I see no problem of morality here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "July 12, 2022, 02:15:45 PM",
      "body": "Quote from: The Pharmacist on July 12, 2022, 11:39:50 AMQuote from: Pokapoka124 on July 11, 2022, 07:45:51 PMThis is not how things work in the real world. You got cheated of $700, and paid only $300 you think the value is going to magically reflect in your $300? This reminds of bible story of Jesus feeding the multitude with five loaves of bread and two fishes. Seriously.  I think I understand what OP is trying to say, but if indeed I do it sounds very much like magical thinking--and I guess you could consider religion to be one of the most popular examples of that (and no doubt the most acceptable one).I don't believe in karma either.  Why?  Because really awful, nasty, evil human beings can become very successful in life and enjoy things others only dream of.  Whether any of that makes them truly happy or not is up for debate, but the fact remains that if bad deeds equated with some supernatural retribution, I'm not buying it.  Good people get screwed all the time.  So I don't agree with OP's assertion that there's any special moral characteristic that can be attributed to money.Karma doesn't exist. The law of karma is fiction propagated by people who value superstition. The idea of karma is for countries that have poor system of government and use religion as an excuse to avoid accountability. I know the phrase too well \"leave it for God\", \"God will judge\", \"God will provide\". These are designed to manipulate people to accept a narrative that isn't true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaberwock",
      "created_time": "July 12, 2022, 04:53:28 PM",
      "body": "This is why when I work I always give my best shot. They say that it's better to work smarter than harder but I can't seem to agree with this. I can work smart and quickly finish my work but I will feel guilty afterwards. I think that the pay given to me by my employer is too much for the work that I've been doing.  Quote from: Ucy on July 11, 2022, 04:52:57 PMIf you are not paid enough for your good work, you are naturally compensated with things you need in such a way that makes things look like you were paid enough. For example, you do a good work that is worth $1000 but you got paid $300, the $300 will be enough to buy you things that's actually worth $1000 or moreI agree on your earlier sentence but I think I cant agree on this one sorry. This is a form of abuse already. It's sad bad it's happening on many poorer countries where employers are being paid small for the hardwork that they provide to the company but despite of it, many workers are still kind and do their jobs properly. At the end of the day, they are still thankful that they have a job even if it pay less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}