{
  "id": "topic_5409873",
  "title": "famososMuertos",
  "author": "famososMuertos",
  "created_time": "August 14, 2022, 08:33:05 PMLast edit: June 29, 2024, 05:42:14 PM by famososMuertos",
  "content": "I guess it's the trend because it's the World Cup season, plus crash games are having that graphic evolution of advancing from the classic crash to having variants in exclusive editions like these dedicated to soccer.Undoubtedly there may be more but if you know any that do not name here please let us know where they try to score goals, I say multipliers.The first two that I am going to mention, have the basic graphics but with the incursion of the likeness of a footballer.name:Football Edition CrashX and Sporttsbet.io Crash-XYou can get these Crash at Sportsbet and Livecasino, surely they will be at other casinos? I don't know, but I found them only in the mentioned casinos.The RTP is 95% and the provider is TurboGames.Found 3 games that are presented quite differently in their approach.  Let's start from the most traditional to the most radical in its presentation based on what the traditional crash game is.name:Footboll ManagerIt is the classic graphic but it incorporates a statistic that is added to a certain player, it is also explicit in its rules in pointing out that the maximum multiplier is 1000x, the House edge is 2%. Provider is Evoplayname:Penalty ManagerProvider Evoplay this game presents the option to choose a national selection and then you simply have to mark where your shot will go.name:PenallityIt is presented with the most options and variants but in a certain way very similar to the previous one.All the mentioned games you can check Provably Fair.The first two are recent releases, but the previous ones are dated 2020 at least one of them.Sources: Livecasino, sportsbet, Crashino.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409873",
  "comments": [
    {
      "author": "gunhell16",
      "created_time": "August 26, 2022, 12:09:31 PM",
      "body": "How many times have I tried to play those crash games in different casino games and they are almost the same but different because they are football games? But its style is the same with a multiplier, and for me, it's the games where the battle and combination are just luck. So for me, if you take this seriously, I'm sure you'll just freeze in annoyance as you lose here one after the other, which will also cause your level to run out. But I haven't tried it in other games like you mentioned dude.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "August 26, 2022, 12:29:26 PM",
      "body": "It is such an eye candy.  I bet football lovers will try to play these games.  But of course nothing changes on the mechanics.  Game developers is indeed researching and applying game skins that is on trend.  This simply show that game developer never stops thinking on how they can enticed prospected players into playing their developed games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "August 26, 2022, 02:39:31 PM",
      "body": "The Penallity game seems similar to the classic roulette game but it's combined with the visuals of football and the total numbers are less compared to the usual board that has 30+ numbers.I wanted to test some of the games like the footboll manager since the cover wasn't enough for me but it looks like the providers have geo-restrictions since I couldn't look up their game from the search bar. Still, thanks for sharing them since it's nice to see different visuals even though they're still the same game we know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "August 26, 2022, 06:12:55 PM",
      "body": "Penalty shootout and penalty manager have similarities in the engine with Crash there are also JetX and Lucky Jet slots in the same casino sportsbet.io in the crash-games section there is an Aviator game, and in general, of course, it was possible to diversify the crash series, for example, free throws in basketball or ball throws in baseball, for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "August 26, 2022, 07:57:00 PM",
      "body": "Quote from: famososMuertos on August 14, 2022, 08:33:05 PMI guess it's the trend because it's the World Cup season, plus crash games are having that graphic evolution of advancing from the classic crash to having variants in exclusive editions like these dedicated to soccer.Undoubtedly there may be more but if you know any that do not name here please let us know where they try to score goals, I say multipliers.The first two that I am going to mention, have the basic graphics but with the incursion of the likeness of a footballer.name:Football Edition CrashX and Sporttsbet.io Crash-XYou can get these Crash at Sportsbet and Livecasino, surely they will be at other casinos? I don't know, but I found them only in the mentioned casinos.The RTP is 95% and the provider is TurboGames.Found 3 games that are presented quite differently in their approach.  Let's start from the most traditional to the most radical in its presentation based on what the traditional crash game is.name:Footboll ManagerIt is the classic graphic but it incorporates a statistic that is added to a certain player, it is also explicit in its rules in pointing out that the maximum multiplier is 1000x, the House edge is 2%. Provider is Evoplayname:Penalty ManagerProvider Evoplay this game presents the option to choose a national selection and then you simply have to mark where your shot will go.name:PenallityIt is presented with the most options and variants but in a certain way very similar to the previous one.All the mentioned games you can check Provably Fair.The first two are recent releases, but the previous ones are dated 2020 at least one of them.Sources: Livecasino, sportsbet, Crashino. I honestly wonder who finds these sort of games entertaining, but there is clearly a big crowd out there for them to keep producing them with different graphics and sound effects. Then again, it's a bit like the endless versions of slots out there, which all have an underlying theme but with gimmicky extras that give the player the illusion of control or value for money. It's nice that they run on a provably fair system, which is possibly the only advantage you get from these in comparison to many blackbox systems that you see on fiat currency gambling websites. I guess some people are fooled by adding in extra interactive elements or simply that bored that things like \"taking a shot\" in a gambling game are enough to spice up their session.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "August 26, 2022, 09:51:15 PM",
      "body": "Quote from: Fortify on August 26, 2022, 07:57:00 PMI honestly wonder who finds these sort of games entertaining, but there is clearly a big crowd out there for them to keep producing them with different graphics and sound effects. Then again, it's a bit like the endless versions of slots out there, which all have an underlying theme but with gimmicky extras that give the player the illusion of control or value for money. It's nice that they run on a provably fair system, which is possibly the only advantage you get from these in comparison to many blackbox systems that you see on fiat currency gambling websites. I guess some people are fooled by adding in extra interactive elements or simply that bored that things like \"taking a shot\" in a gambling game are enough to spice up their session.I didn't find Footboll Manager, Penalty Manager and Penality on Sportsbet and Livecasino, I guess they belong to the other casino mentioned (Crashino) but Crash X Football Edition and Sportsbet.io Crash-X are not provably fair from what I have seen. Otherwise the seeds and the feature to change them are very well concealed. But the graphics and the soundscape of the game are fun and entertaining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johhnyUA",
      "created_time": "August 26, 2022, 09:55:43 PM",
      "body": "Quote from: Daltonik on August 26, 2022, 06:12:55 PMPenalty shootout and penalty manager have similarities in the engine with Crash there are also JetX and Lucky Jet slots in the same casino sportsbet.io in the crash-games section there is an Aviator game, and in general, of course, it was possible to diversify the crash series, for example, free throws in basketball or ball throws in baseball, for example.But again, this is just another design of the (in fact) the same game. I'm not in slots, so I can't say is is worth to play the same game or not with another design. Maybe, sometimes people want some other design, but in my opinion you should play another game with a different mechanic if your want some variety in your gambling life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "August 26, 2022, 10:10:19 PM",
      "body": "These are seasonal games added to the list of available casino games. Now a gambler who is much into football will go with the above kind of crash game whereas the common gambler will prefer the regular crash game. Till the days of FIFA this will be available and once the Cricket World Cup starts we can see cricket ball at the place of football. Everything is business, more being creative is much needed as the competence within the market is very high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "August 26, 2022, 10:21:41 PM",
      "body": "Quote from: KennyR on August 26, 2022, 10:10:19 PMThese are seasonal games added to the list of available casino games. Now a gambler who is much into football will go with the above kind of crash game whereas the common gambler will prefer the regular crash game. Till the days of FIFA this will be available and once the Cricket World Cup starts we can see cricket ball at the place of football. Everything is business, more being creative is much needed as the competence within the market is very high.This is just another attraction so the gamblers will see a different mood if they are playing crash game. At least, the casino is trying their best to find a way not to bore their players and apply current sports events to their games. This initiative may bring positive vibes to some, whereas, as you said, some will just ignore it.In any case, at least the casino is looking for ways on how to be relevant and possibly keep the interest of the players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirLancelot",
      "created_time": "August 27, 2022, 08:39:00 PM",
      "body": "Quote from: KennyR on August 26, 2022, 10:10:19 PMThese are seasonal games added to the list of available casino games. Now a gambler who is much into football will go with the above kind of crash game whereas the common gambler will prefer the regular crash game. Till the days of FIFA this will be available and once the Cricket World Cup starts we can see cricket ball at the place of football. Everything is business, more being creative is much needed as the competence within the market is very high.Interesting! They are seasonal and not always available therefore many football fans are going to play this type of crash game and will skip the original crash game for a while if both crash games are separated but I think they are really separated because there are also people who aren't a fan of football.They can always make this game permanent but they didn't do that because they are giving a way to other sport/events. That was even better and having a category of different crash games sounds weird already but for slot games, that will look normal because that is what slot games are known for (to have different a theme). There's a crash site I saw last time where its theme is a car video game. The graphics are nice though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "August 28, 2022, 10:47:21 AM",
      "body": "I think these obviously look gorgeous and interesting for football fan. I especially loved penalty one and directly wanted to try it. Animations of these games are generally not good, they should work on developing them for sure. I think there could be something similar to Captain Tsubasa game from 1990 like everytime your team sends a pass or get away with ball you may pick 1 lucky option of 2. Result would be striking a goal etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "August 29, 2022, 05:01:31 PM",
      "body": "Quote from: famososMuertos on August 14, 2022, 08:33:05 PMname:Football Edition CrashX and Sporttsbet.io Crash-XThe graphics are interesting. I liked them. But I wish a crash game about goal minutes had been designed. I don't know how this could be designed. But I would definitely like to play such a game. For example, 1.05 odds on the option No goals in the first 10 minutes. A crash similarity can be established with an increasing bet rate towards the 90th minute.There are other betting options that do things like this. But an interesting game can be created if similarity with crash is established. The simple theme and crash resemblance may attract more gamblers to such a game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minime0105",
      "created_time": "August 29, 2022, 05:45:17 PM",
      "body": "Quote from: BitcoinPanther on August 26, 2022, 12:29:26 PMIt is such an eye candy.  I bet football lovers will try to play these games.  But of course nothing changes on the mechanics.  Game developers is indeed researching and applying game skins that is on trend.  This simply show that game developer never stops thinking on how they can enticed prospected players into playing their developed games.Their motive of developing another game is to make sure that it's functionable, so immediately a developer game is being known, it's knowns their is benefit or return coming from that particular game. Another thing is that in all this their is competition that is attached to new games for the developers. So someone will like to play game that is acquainted to, because their is many research ongoing of new games that people will like to play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 29, 2022, 05:50:44 PM",
      "body": "Quote from: KennyR on August 26, 2022, 10:10:19 PMThese are seasonal games added to the list of available casino games. Now a gambler who is much into football will go with the above kind of crash game whereas the common gambler will prefer the regular crash game. Till the days of FIFA this will be available and once the Cricket World Cup starts we can see cricket ball at the place of football. Everything is business, more being creative is much needed as the competence within the market is very high.Definitely, it's all for the opportunity, to take advantage of the current FIFA and so it will create hype for gamblers. Because for sure fans are also gamblers right, we bet on our favorite teams. And then when by chance we saw this crash games fully design for our ours, at if tailor fit then for sure we are going to play it. So it's a win-win for us and the gambling platform. And I don't think that it's not that hard to do that, some simply tweaks for the developers but instant fun for us gamblers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 29, 2022, 05:58:35 PM",
      "body": "I tried the crash game and it is definitely addictive. Not much to say about the overall concept of the game but the graphics had me hooked. It probably doesn't have a lot to connect to football other than its design and its graphics, but it will certainly catch the attention of football fans who are very familiar with the ball and the terminologies this crash game has. They have to do more of these seasonal contents for games IMO. It generally sets you in the mood for the season of these sporting events that the theme is centered on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "August 29, 2022, 09:25:38 PM",
      "body": "I like that the background design is beautiful to go with the graphics. This reminds me of play station in time past. For that of the penalty manager, I guess the gambler has the chance or option to choose among the best keepers just like in play station that you can choose the penalty taker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "August 30, 2022, 03:38:07 AMLast edit: June 29, 2024, 05:44:21 PM by famososMuertos",
      "body": "+1, comments, I found others slots (footballers) and  also incorporate another casino.If you know of any soccer slots or crash that has not been mentioned here, let us know it.Quote from: BitcoinPanther on August 26, 2022, 12:29:26 PMIt is such an eye candy.  I bet football lovers will try to play these games.  But of course nothing changes on the mechanics.  Game developers is indeed researching and applying game skins that is on trend.  This simply show that game developer never stops thinking on how they can enticed prospected players into playing their developed games.Exactly, it is the same with the large number of traditional slots that exist and their varied presentations, in any case the point is competition between providers not only to offer the best RTP, volatility, etc. We are in a time when the theme counts, it is that simple for the recreational player, some prefer the rocket, others the soccer ball, etc.In any case, I have been able to realize at least in the crash games that some providers offer bonuses for losses, in any case, they are games of recent use for me.Quote from: Saint-loup on August 26, 2022, 09:51:15 PM.../Q/...::I didn't find Footboll Manager, Penalty Manager and Penality on Sportsbet and Livecasino, I guess they belong to the other casino mentioned (Crashino) but Crash X Football Edition and Sportsbet.io Crash-X are not provably fair from what I have seen. Otherwise the seeds and the feature to change them are very well concealed. But the graphics and the soundscape of the game are fun and entertaining.Thank you for taking the trouble to do the task and review; you can see in the case that when I mention the PF (see OP) I would like to clarify that I use [ hr ] between the first two slots and the other group of games and you can see that I even closed with [ hr ] I thought it was understood that it was referring to those games, so, in any case, thank to you comment is useful clear it up.I'll update this on the OP in due course.Other games:Football Pro.Provider: Caleta.RTP: 91.67%Volatility: HV.You can buy features.https://i.imgur.com/WMkKqZx.gifThis slots adds the basic elements of soccer and typical soccer audio-environment with the noisy atmosphere of the fans in the stands.Football Champion Cup.Provider: NetentRTP: 96.82%.I couldn't play it due to location restrictions.I didn't want to do everything we know to be able to play him, so I just leave you the name.Football Mania.Provider: WazdanRTP: 96.59%Volatility: HV.https://i.imgur.com/dLS96CG.gifHorrible graphics, seriously! the music a classic sequence of electronic bits, I think one of those for free use, until now the least prodigious in the soccer theme.Football Mania Deluxe.Provider: Wazdan.RTP: 96.59%.Volatility: HV.https://i.imgur.com/zdLa4cG.gifWell done, you can notice that the \"deluxe\" update was necessary, they improved the graphics, the rewards, etc. and the musical theme improved but in sound quality because the theme is not, let's say, the best in relation to soccer.Then I did another simple search on another casino and got 30 results:https://i.imgur.com/TahoOA1.jpgNot surprising given what we discussed but I really didn't expect to get such variety. Of this last group I did not try any.The captures correspond to sportsbet and Bcgame respectively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "August 30, 2022, 06:21:16 AM",
      "body": "I think casinos just want it to be more lively and engaging as well as being catchy considering the trend in the space. It's still a crash game after all but kudos to those talented dev artists that made these amazing UIs, they make gambling really more fun. Maybe next time we see some anime characters in a crash game. Who knows?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "August 30, 2022, 07:07:50 AM",
      "body": "It's only a few months left till the worldcup in Qatar. Good for the casinos to profit of it and include it in their games. Football is the number followed sport in the world and all the major tournaments are huge events. So far I haven't seen these crash games focused on football and wonder now if this is only a gimmick with a new layout, or does this have some sports betting included in the games? Like will events during the game affect the multipliers and crash chances? In the past I played my fair share of crash games, but completely stopped now. It's very interactive but made me a bit angry when the game crashed way too early. Somehow I always try to look for a pattern in the crash behaviour when it's obviously completely random. Dice seems like a better game for me, unfortunately there is not much chances to combine that with the football worldcup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}