{
  "id": "topic_5476307",
  "title": "WeThePe0ple",
  "author": "WeThePe0ple",
  "created_time": "December 02, 2023, 03:36:25 PMLast edit: December 02, 2023, 03:49:59 PM by WeThePe0ple",
  "content": "So me and most of my family are EU citizens. Banks and governments are going after crypto holders like a hungry dog goes after a hamburger.Making a substantial BTC investment (I am aiming for 15k-20k) will immediately flag me to the local IRS. I will get a guaranteed visit from a tax agent, which is also detrimental for my normal job. He will demand to verify all my crypto holdings, and tax me accordingly. At this point only for realized profits, but I read articles about holdings too. Imagine being taxed 33% for holding BTC at 47k, and it goes down to 17k the year after that. It makes no sense but this is their strategy.So my plan is like this:5k in my name (this is only 7% of my portfolio)5k in my wife's name (I transfer 5k to her)5k in my fathers name (I pay him)This decreases the odds of tax agents going after me/us.My 78 year old mother in law is a non EU citizen. We can let her go through KYC, deposit our 3 funds to her BTC address and manage it for her.The tax hawks in my country will be shown that our accounts are empty. There is nothing for them to rob. I don't think we do anything illegal. We just donated to my mother in law who is outside of their jurisdiction.Authorities in the country of my mother in law will not expect anything from her because there was never a deposit from any local bank to her BTC address. I do wonder, if we wish to manage her account and cash out in 2035, if that requires her to be alive at that point (live camera footage, fingerprint..)Or if we can do that P2P without any problems.Does this make sense or am I missing something?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476307",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "December 02, 2023, 03:52:44 PM",
      "body": "If you don't keep your funds on an exchange or online wallet, and you use a decent hardware, paper or airgapped wallet, there'll be no real difference between your wallet and your mother's. Nobody will be able to stop you moving your funds, even in 50 years, since you hold the private keys.On the other hand, if you really get into trouble with the tax authorities, it might be a little unbelievable if you tell them: this hardware wallet is mine, it contains 0€ worth of BTC, this other hardware wallet i have in my desk drawer is my mother's, it contains €15.000 worth of BTC.All in all, even the best advice here won't be as good as the advice of a tax lawyer or a good accountant in your country... If you really want to know if you'll get into trouble with the law, spend a couple hundred and get the advice from somebody with an actual degree who specialises in this stuff in your country. Don't risk things by getting advice from a couple unknown people on the internet!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 02, 2023, 03:53:24 PM",
      "body": "Look at this service to see what payment services are available in Europe and buy Bitcoin through them to your wallet. Make 10-xx wallets of several thousand dollars so as not to attract attention.https://www.bestchange.com/Check out this list and buy bitcoins without KYChttps://archive.ph/CpS0WIf you don't trust your government, then don't use KYC. It's time to decide for yourself what you are most afraid of. Sitting on two chairs is very difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeThePe0ple",
      "created_time": "December 02, 2023, 04:20:41 PMLast edit: December 02, 2023, 04:41:52 PM by WeThePe0ple",
      "body": "Quote from: zasad@ on December 02, 2023, 03:53:24 PMLook at this service to see what payment services are available in Europe and buy Bitcoin through them to your wallet. Make 10-xx wallets of several thousand dollars so as not to attract attention.https://www.bestchange.com/Check out this list and buy bitcoins without KYChttps://archive.ph/CpS0WIf you don't trust your government, then don't use KYC. It's time to decide for yourself what you are most afraid of. Sitting on two chairs is very difficult.Honestly I don't know what I'm most afraid of.I'm afraid of missing out. I'm afraid of getting taxed like shit and being treated like a criminal too.The idea of only being able to invest in BTC on the condition that the government does not know, doesn't work for me. They will flag me as soon as this kind of money leaves my account. I also don't think that mass adoption is possible when governments attack with these huge taxes and penalties.I think I'm just gonna risk it. I can report my wallet (ledger) as stolen. Most likely I will. The goal is to hodl anyway, and never withdraw to any bank at all. Or when they go after me, I can donate the coins to one of my non EU citizen friends. I make the wallet for them but I manage the keys. This is also insurance, in case they ever wish to claim the coins.I considered using Bitvavo but knowing that they are in the EU, I have a very bad feeling about that. They will instantly cooperate with the authorities.I trust Binance a bit more. My first deposit was denied, but meanwhile I read that they have a license via Poland. I estimate the odds of Binance protecting my privacy larger than any EU regulated exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gormicsta",
      "created_time": "December 02, 2023, 04:53:37 PM",
      "body": "Quote from: WeThePe0ple on December 02, 2023, 03:36:25 PMSo me and most of my family are EU citizens. Banks and governments are going after crypto holders like a hungry dog goes after a hamburger.Making a substantial BTC investment (I am aiming for 15k-20k) will immediately flag me to the local IRS. I will get a guaranteed visit from a tax agent, which is also detrimental for my normal job. He will demand to verify all my crypto holdings, and tax me accordingly. At this point only for realized profits, but I read articles about holdings too. Imagine being taxed 33% for holding BTC at 47k, and it goes down to 17k the year after that. It makes no sense but this is their strategy.So my plan is like this:5k in my name (this is only 7% of my portfolio)5k in my wife's name (I transfer 5k to her)5k in my fathers name (I pay him)This decreases the odds of tax agents going after me/us.My 78 year old mother in law is a non EU citizen. We can let her go through KYC, deposit our 3 funds to her BTC address and manage it for her.The tax hawks in my country will be shown that our accounts are empty. There is nothing for them to rob. I don't think we do anything illegal. We just donated to my mother in law who is outside of their jurisdiction.Authorities in the country of my mother in law will not expect anything from her because there was never a deposit from any local bank to her BTC address. I do wonder, if we wish to manage her account and cash out in 2035, if that requires her to be alive at that point (live camera footage, fingerprint..)Or if we can do that P2P without any problems.Does this make sense or am I missing something?Well first, you sound like you got everything all planned out pretty good, but what if there's a loophole in your plan and at some point things go bazaar and then you end up either being flagged or even worse. I don't know about your country but in certain countries of the world tax evasion is considered criminal, regardless the technique you adopt, that's why it's always advisable to involve a professional or an expert in matters like this. But if you eventually seek professional advice on the matter and confirms you're not breaking any laws then that brings to the part where you're asking if you can take out the Bitcoin without your mother in law's fingerprints or some sort of verification. In this case, there are several DEXs that really don't require any form of verifications before you can take out your BTC as long as the Wallet Phrases are in your possession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeThePe0ple",
      "created_time": "December 02, 2023, 05:29:14 PM",
      "body": "Quote from: Gormicsta on December 02, 2023, 04:53:37 PMWell first, you sound like you got everything all planned out pretty good, but what if there's a loophole in your plan and at some point things go bazaar and then you end up either being flagged or even worse. I don't know about your country but in certain countries of the world tax evasion is considered criminal, regardless the technique you adopt, that's why it's always advisable to involve a professional or an expert in matters like this.My country is Belgium. In most of Western Europe, banks plan to attack crypto with huge taxes. And yes tax evasion is criminal.There is a difference between avoiding taxes legally, and tax evasion though. Tax evasion would be me owning the BTC (a part of it) and not declaring it.Avoiding it legally, to my knowledge is what happens when I send the crypto to my mother in law's BTC address. Sending a gift is not taxable. She can go through KYC. We can set up her account with a password that we choose. She'll be the owner, even if she doesn't realize it. I am the manager.Also her local authorities will not expect her to own crypto because there was never a bank deposit from her bank account.And even if they do find out, she's not really at risk. She can say never knew she was the owner of the gift. And if they find out in 10 years, they can't tax a dead person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "December 02, 2023, 05:44:24 PM",
      "body": "For countries with strong enforcement against cryptocurrency traders, how likely is it to stay anonymous holding altcoins in wallets and trading them only on decentralized exchanges? For immigrants who will be staying in some of these countries for a short time, how difficult can it be to deal with the law while in the country for a short period of time, especially within a year?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeThePe0ple",
      "created_time": "December 02, 2023, 06:10:49 PM",
      "body": "Quote from: royalfestus on December 02, 2023, 05:44:24 PMFor countries with strong enforcement against cryptocurrency traders, how likely is it to stay anonymous holding altcoins in wallets and trading them only on decentralized exchanges? The thing that bothers me is that this kind of taxation, and later on maybe other legal fights (mining is bad for the planet..) are likely to prevent mass adoption. Which is necessary for the price to skyrocket.Besides that I think that in the end, bitcoin is the perfect money and it will always have value. And governments will fight to be the owner of that value, at the cost of the people. Today I heard that only China and the US government hold more bitcoin than Michael Saylor. They didn't mention Blackrock, but I'm sure they are also getting into this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 03, 2023, 11:22:20 AM",
      "body": "Quote from: WeThePe0ple on December 02, 2023, 04:20:41 PMQuote from: zasad@ on December 02, 2023, 03:53:24 PMLook at this service to see what payment services are available in Europe and buy Bitcoin through them to your wallet. Make 10-xx wallets of several thousand dollars so as not to attract attention.https://www.bestchange.com/Check out this list and buy bitcoins without KYChttps://archive.ph/CpS0WIf you don't trust your government, then don't use KYC. It's time to decide for yourself what you are most afraid of. Sitting on two chairs is very difficult.Honestly I don't know what I'm most afraid of.I'm afraid of missing out. I'm afraid of getting taxed like shit and being treated like a criminal too.The idea of only being able to invest in BTC on the condition that the government does not know, doesn't work for me. They will flag me as soon as this kind of money leaves my account. I also don't think that mass adoption is possible when governments attack with these huge taxes and penalties.I think I'm just gonna risk it. I can report my wallet (ledger) as stolen. Most likely I will. The goal is to hodl anyway, and never withdraw to any bank at all. Or when they go after me, I can donate the coins to one of my non EU citizen friends. I make the wallet for them but I manage the keys. This is also insurance, in case they ever wish to claim the coins.I considered using Bitvavo but knowing that they are in the EU, I have a very bad feeling about that. They will instantly cooperate with the authorities.I trust Binance a bit more. My first deposit was denied, but meanwhile I read that they have a license via Poland. I estimate the odds of Binance protecting my privacy larger than any EU regulated exchange.I want you to understand me correctly, I am not suggesting breaking laws and not paying taxes. I believe that taxes should be paid when you sell cryptocurrency in 10-15 years. Then you will come to a tax lawyer and he will tell you how to do this more profitably for you. But it is possible that in 10-15 years Bitcoin will be banned, hacked, or its price will be much lower than it is now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 03, 2023, 11:38:54 AM",
      "body": "Quote from: WeThePe0ple on December 02, 2023, 03:36:25 PMMaking a substantial BTC investment (I am aiming for 15k-20k) will immediately flag me to the local IRS. I will get a guaranteed visit from a tax agent, which is also detrimental for my normal job. ~At this point only for realized profits, but I read articles about holdings too. Imagine being taxed 33% for holding BTC at 47k, and it goes down to 17k the year after that. It makes no sense but this is their strategy.Yeah, stop reading stupid articles for once and read the fiscal code in your country, this is just going full lunatic.How the hell is a visit from your IRS (btw, where the hell in Europe does the IRS does home visits for personal finances),  detrimental to your job? Get real and stop the fear mongering.Besides, even if they would plan on doing this impossible taxation then you would simply need to sell the coins before that is announced to your mother and that's it, if she's not a resident of the EU and she is not a tax resident. And furthermore, how do you plan on cashing those out if the evil government is watching you and avoid taxation when you do? You do realize you will have to eventually pay up the same sum in the end, right?At one point you make the govemermnt these control freaks that try to control everything, that monitor everything, and at the next step you envision them as some stupid braindead idiots who will just believe your 40 years inheritance story and out of pity they will simply not tax a dime!Quote from: WeThePe0ple on December 02, 2023, 03:36:25 PMThis decreases the odds of tax agents going after me/us.Does this make sense or am I missing something?You see this is what all this mumbo jumbo lead you to:- you believe the government is doing everything to kill bitcoin and it will left no stone untouched to tax you and at the same time- you believe their are stupid enough so that because you have 5k instead of 15k they will ignore youSee how illogical your thoughts are?Quote from: WeThePe0ple on December 02, 2023, 04:20:41 PMHonestly I don't know what I'm most afraid of.I'm afraid of missing out. I'm afraid of getting taxed like shit and being treated like a criminal too.You should be more afraid of ending with paranoia taking over and losing your coins while trying to hide them form virtual enemies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 03, 2023, 11:47:40 AM",
      "body": "Quote from: WeThePe0ple on December 02, 2023, 03:36:25 PMDoes this make sense or am I missing something?No it doesn't. Sorry.First of all, the paranoia is too high in this equation, as Stompix has already mentioned.Then, you seem to misunderstand how bitcoin wallets work and this can easily get all your investment lost before you figure that out.So, instead of working with X's bitcoin account and Y's bitcoin account, just get yourself a hardware wallet, create a new seed and write it in steel (3 copies for geographically separated locations), recover the wallet from the seed (to make sure it's correct) and send the bitcoins there.You can even reset the hardware wallet afterwards or keep 0.0001 BTC on it.From this point on it doesn't matter at all (from finances point of view, obviously) which of the N persons will no longer be alive. Whoever has the seed backup (any of the backups or any copy you left unguarded!!) can spend, no matter the moment in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeThePe0ple",
      "created_time": "December 04, 2023, 05:46:32 AMLast edit: December 04, 2023, 05:56:37 AM by WeThePe0ple",
      "body": "Quote from: stompix on December 03, 2023, 11:38:54 AMQuote from: WeThePe0ple on December 02, 2023, 03:36:25 PMMaking a substantial BTC investment (I am aiming for 15k-20k) will immediately flag me to the local IRS. I will get a guaranteed visit from a tax agent, which is also detrimental for my normal job. ~At this point only for realized profits, but I read articles about holdings too. Imagine being taxed 33% for holding BTC at 47k, and it goes down to 17k the year after that. It makes no sense but this is their strategy.Yeah, stop reading stupid articles for once and read the fiscal code in your country, this is just going full lunatic.How the hell is a visit from your IRS (btw, where the hell in Europe does the IRS does home visits for personal finances),  detrimental to your job? Get real and stop the fear mongering.Besides, even if they would plan on doing this impossible taxation then you would simply need to sell the coins before that is announced to your mother and that's it, if she's not a resident of the EU and she is not a tax resident. And furthermore, how do you plan on cashing those out if the evil government is watching you and avoid taxation when you do? You do realize you will have to eventually pay up the same sum in the end, right?At one point you make the govemermnt these control freaks that try to control everything, that monitor everything, and at the next step you envision them as some stupid braindead idiots who will just believe your 40 years inheritance story and out of pity they will simply not tax a dime!Quote from: WeThePe0ple on December 02, 2023, 03:36:25 PMThis decreases the odds of tax agents going after me/us.Does this make sense or am I missing something?You see this is what all this mumbo jumbo lead you to:- you believe the government is doing everything to kill bitcoin and it will left no stone untouched to tax you and at the same time- you believe their are stupid enough so that because you have 5k instead of 15k they will ignore youSee how illogical your thoughts are?Quote from: WeThePe0ple on December 02, 2023, 04:20:41 PMHonestly I don't know what I'm most afraid of.I'm afraid of missing out. I'm afraid of getting taxed like shit and being treated like a criminal too.You should be more afraid of ending with paranoia taking over and losing your coins while trying to hide them form virtual enemies.Sigh.. ParanoiaI am a self employed physician. The way taxes work in my country is that you report your gross wage to a local accountant. You also report your professional expenses (taxes, gasoline, car downpayment..). The accountant makes the balance of this and reports it to the tax office. In the end we pay more than 50% tax on our gross wage. Welcome to socialismThe tax office regularly visits self employed people and we have to keep all of our records for the last 5 years. When you get a visit from those guys, there is a guarantee that you have to pay. Crypto has to be declared in a separate bracket and this is what they would come for. It is already happening because I know people like this.With regards to the 5k vs 15k. This is because banks are legally obliged to report transactions over 10k. Or multiple transactions of 5k from the same person.I can even link you an article about how our tax office categorizes you (amateur, partial trader or pro). But in the end they tax 50% out of everyone.The 5k vs 15k matters because the invested percentage of someones portfolio matters in getting you categorized as an amateur (small % invested, hodler, no trades and no risks) vs a partial trader or pro (risks, higher % invested, 50% tax on profits)I just asked an official tax agent (anonymously) online, what happens if I send the coins to a non EU resident.If I buy the coin today and transfer them to her in march, with a 20k profit at that point, I have to pay 50% tax on the realized profit even though the coins are not in my possession and I don't have the money. Yes, banks and governments try to kill bitcoin and they want the largest possible cut. The way they do this is by demanding impossible taxes and reporting every investor to the tax office. It isn't paranoid to say that they want to control everything here. It is reality",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 04, 2023, 07:13:41 AM",
      "body": "Well, after reading all these legal plans to avoid taxes legally, I feel happy that I live in a country where Bitcoin is not subject to any regulatory law (knowing that Bitcoin is illegal in my country), here in my country we do not have any law to regulate Bitcoin or impose taxes on Bitcoin holders.I don't know much about taxes in Europe, but if this is really true, then this is the stupidity of governments. How do they impose exorbitant taxes, which makes citizens in these countries think of a thousand ways to avoid paying these disgusting taxes in any way? There are even lawyers specializing in finding legal loopholes for this problem. This is ridiculous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 04, 2023, 10:21:18 AM",
      "body": "Quote from: yhiaali3 on December 04, 2023, 07:13:41 AMWell, after reading all these legal plans to avoid taxes legally, I feel happy that I live in a country where Bitcoin is not subject to any regulatory law (knowing that Bitcoin is illegal in my country), here in my country we do not have any law to regulate Bitcoin or impose taxes on Bitcoin holders.I don't know much about taxes in Europe, but if this is really true, then this is the stupidity of governments. How do they impose exorbitant taxes, which makes citizens in these countries think of a thousand ways to avoid paying these disgusting taxes in any way? There are even lawyers specializing in finding legal loopholes for this problem. This is ridiculous.Although Bitcoin is illegal in your country, no one considers you a criminal on this forum. Using Bitcoin and other cryptocurrencies is the right of every free person.And if the government wants to take large taxes and force the use of a complex tax reporting system, then any person will look for a way out of the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 05, 2023, 04:12:43 AM",
      "body": "Quote from: NeuroticFish on December 03, 2023, 11:47:40 AMQuote from: WeThePe0ple on December 02, 2023, 03:36:25 PMDoes this make sense or am I missing something?No it doesn't. Sorry.First of all, the paranoia is too high in this equation, as Stompix has already mentioned.Quote from: WeThePe0ple on December 04, 2023, 05:46:32 AMSigh.. ParanoiaYes, paranioa. I don't know if I'm going to waste a lot of time with this because it's not the first time I come across someone who insists on seeing everything negative and when you try to make things easier for him he keeps looking for and finding arguments to keep on complicating things. For starters, in which European country are you going to be taxed every year without having sold the investment?Quote from: WeThePe0ple on December 02, 2023, 03:36:25 PMAt this point only for realized profits, but I read articles about holdings too. Imagine being taxed 33% for holding BTC at 47k, and it goes down to 17k the year after that. It makes no sense but this is their strategy.Cite those articles because you have misunderstood for sure. I would have to look at the laws specifically, but I would say that tax for unrealized gains is against European law.Quote from: WeThePe0ple on December 02, 2023, 03:36:25 PMSo my plan is like this:5k in my name (this is only 7% of my portfolio)5k in my wife's name (I transfer 5k to her)5k in my fathers name (I pay him)...I do wonder, if we wish to manage her account and cash out in 2035...Look, I wouldn't have that problem. You're talking about investing 15K and waiting three more halvings with what could easily have turned into 0.5M for you. I would buy it all myself, and pay any applicable taxes. Period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 06, 2023, 03:41:34 PM",
      "body": "How much does it cost to consult a good lawyer in Europe?Investments are private information, and a lot of data should not be published on forums. Most likely, in every country you can find a way to safely invest in cryptocurrencies.In Russia, such issues are resolved very simply. My 78 year old relative can say that this is his wallet and his bitcoins, and no one will bother to punish an elderly pensioner. Even if he is called to the tax office or the police, he will become ill there and will go to intensive care in an ambulance. And then there will be a lot of complaints to the prosecutor’s office, after which the tax and police will quickly lose interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "December 06, 2023, 05:23:22 PM",
      "body": "First of all, make sure you understand crypto tax laws in your country, maybe you're panicking for no good reason. I'm not aware of any EU country demanding tax on unrealised crypto holdings (somebody please correct me if I'm wrong).So if you want to buy BTC with your lawfully earned money, then you have nothing to worry about, other than paying tax on capital gains when you sell with profits. Some banks may cause troubles when sending such large amounts to an exchange, but if it's not illegal, you should be able to do so upon jumping few hurdles.So unless your country taxes unrealised gains, moving btc to your mother in law is not necessary. Also, you need to consider how will you cash it out? Will your mother in law officially give the btc back to you (provided she's still alive in 2035)? Will she be able to explain where did she get that from? It could be worth millions by then and it could trigger much more scrutinous investigation with a risk of whole amount getting seized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 07, 2023, 02:49:42 PM",
      "body": "Quote from: pawel7777 on December 06, 2023, 05:23:22 PMFirst of all, make sure you understand crypto tax laws in your country, maybe you're panicking for no good reason. I'm not aware of any EU country demanding tax on unrealised crypto holdings (somebody please correct me if I'm wrong).So if you want to buy BTC with your lawfully earned money, then you have nothing to worry about, other than paying tax on capital gains when you sell with profits. Some banks may cause troubles when sending such large amounts to an exchange, but if it's not illegal, you should be able to do so upon jumping few hurdles.So unless your country taxes unrealised gains, moving btc to your mother in law is not necessary. Also, you need to consider how will you cash it out? Will your mother in law officially give the btc back to you (provided she's still alive in 2035)? Will she be able to explain where did she get that from? It could be worth millions by then and it could trigger much more scrutinous investigation with a risk of whole amount getting seized.I think that the first problem is that in many countries the tax legislation for cryptocurrencies has not yet been formed and may change, so declaring cryptocurrencies has its own risks. There is a risk that Bitcoin will cease to be the main coin and will give way to Ethereum.Investing in only one coin for 10 years is also very risky. I would make an investment portfolio of 5-7 coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "December 07, 2023, 05:18:20 PM",
      "body": "Quote from: zasad@ on December 07, 2023, 02:49:42 PMI think that the first problem is that in many countries the tax legislation for cryptocurrencies has not yet been formed and may change, so declaring cryptocurrencies has its own risks.Could be, but OP mentioned he's from an EU country, and I imagine most of those would have crypto-related tax laws somewhat clarified by now. It could be easier if he just said which country is he from.Quote from: zasad@ on December 07, 2023, 02:49:42 PMThere is a risk that Bitcoin will cease to be the main coin and will give way to Ethereum.Investing in only one coin for 10 years is also very risky. I would make an investment portfolio of 5-7 coinsThere was a thread about this somewhere, and the historical data shows that holding just BTC for a long time yielded much better results than diversifying over the top 5 or top 10 coins. Of course there's no guarantee this will be true forever. I'm in favour of holding some ETH just in case of the \"flippening\", but holding too many coins is probably riskier than holding BTC only.Anyhow, OP said he would be managing the funds even if they were in the formal custody of his mother in law, so he'd be able to take actions when/if weird things start happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "December 07, 2023, 06:59:09 PM",
      "body": "Quote from: pawel7777 on December 07, 2023, 05:18:20 PMQuote from: zasad@ on December 07, 2023, 02:49:42 PMI think that the first problem is that in many countries the tax legislation for cryptocurrencies has not yet been formed and may change, so declaring cryptocurrencies has its own risks.Could be, but OP mentioned he's from an EU country, and I imagine most of those would have crypto-related tax laws somewhat clarified by now. It could be easier if he just said which country is he from.--snip--He said he's from Belgium... Being from west EU myself, i'm vaguely familiar with some of the general idears of the laws around here... AFAIK, Belgium only taxes you if you're a professional trader (but i could be wrong). I think if you're a \"goede huisvader\" you don't have to pay tax on investments (\"goede huisvader\" translated would mean something like doing the things a normal worker would do with his hard earned money... The problem is that there's always room for discussion...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}