{
  "id": "topic_5441255",
  "title": "rachael9385",
  "author": "rachael9385",
  "created_time": "February 25, 2023, 08:43:17 PM",
  "content": "Money and education which one of these is advisable to achieve? They constantly say education is the key to success but in my country today many graduates don't have a job, and most of them are still fed by their parents, and that's not the way it's supposed to be. And again they also said money is potency and fondness. Yes, money is power even if you are not a graduate or you haven't been to college before and you have the money you can even employ a graduate to work for you. Presently now in my wonderful fatherland NIGERIA 🇳🇬 I can see the power of money. Please any advice?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441255",
  "comments": [
    {
      "author": "jrrsparkles",
      "created_time": "February 25, 2023, 09:06:01 PM",
      "body": "Education doesn't necessarily mean knowledge and many rich people don't even have a degree because they thought its useless and not completely related to knowledge and skills. Education is the key for survival not for success so don't get confused between both cause it is different and knowledge is powerful in my opinion.Unemployment is everywhere and lot of reasons are there why many doesn't have jobs but currently the fear of recession caused many companies including google, facebook, twitter, tesla, etc fired thousands of their employees to survive their winter. For us, we need to keep updating our skills so you won't be fired or can get a job in no time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "February 25, 2023, 09:20:55 PM",
      "body": "Quote from: rachael9385 on February 25, 2023, 08:43:17 PMMoney and education which one of these is advisable to achieve? They constantly say education is the key to success but in my country today many graduates don't have a job, and most of them are still fed by their parents, and that's not the way it's supposed to be. And again they also said money is potency and fondness. Yes, money is power even if you are not a graduate or you haven't been to college before and you have the money you can even employ a graduate to work for you. Presently now in my wonderful fatherland NIGERIA 🇳🇬 I can see the power of money. Please any advice? If you're making a decent living and money, then be consistent on it and look at it if it will become stable someday. So when it does, you're free to do whatever you want in the future and that includes studying back again. We're in a different economy these days and many companies won't look for educational attainment as they only look at the skill and personality of their potential employee. I mean not all companies are like that and there are still those that depends on the educational attainment of their applicant. But as you've said, the situation there is different and you have to adapt with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "February 25, 2023, 09:40:56 PM",
      "body": "Money is good because with it you are sure to have some form of education in some time in the future at your own pace when you are ready for it and this is why they say education is not limited to only the young, that you can be educated at even old age  However, the education is not just the high level of degrees but your ability to understand what is taught to you not only in formal education but also learning of skill. My point is with money you can get an education by the side but it is not a guarantee that getting educated brings money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "February 25, 2023, 09:42:39 PM",
      "body": "@OP, Both, in my opinion, should be archived. Education is not a guarantee of success because the world's most successful and powerful men did not become wealthy as a result of formal education. Some people have the zeal to gain all the educational certificates in the world, and they end up becoming professors in their discipline, but the richest man in the world today is not a professor. Most wealthy and powerful people are businessmen who are not illiterate in terms of education, but while pursuing formal education, they discover their own potential and what they want to become. There is a case of two medical doctors in my area; one is working in a government hospital, but the other person has his own hospital with up to five different branches.There are lots of people who want to acquire formal education so that after graduation they can be employed by a big company. There are also people who plan to be bosses of their own after graduation. It all depends on how you plan, but education is not a guarantee of success. However, education is necessary because, even if you are successful in business, you will do some things differently than an illiterate may be able to do.@OP, you said that in your country some graduates are not employed; would you also believe that some people don't know how to hunt for a job? When a white-collar job is not forthcoming, the individual must learn how to support themselves rather than stay at home. Learn a skill, do business, go freelance, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryu_Ar1",
      "created_time": "February 25, 2023, 09:49:41 PM",
      "body": "Both are clearly important.Education is clearly a good capital but it is not the only key to success because it can be said that with good education and study there at least we can have knowledge which is of course useful to support our living conditions so that they are better (at least in this case we are more intelligent and not be stupid and always deceived by others).On the other hand money is also very important to support education and of course life. I don't want to be naive but the fact is money is always a major factor in that but on the other hand we also can't rule out education because of course when we have money but our knowledge is lacking then this will also be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "February 25, 2023, 09:51:53 PM",
      "body": "Quote from: rachael9385 on February 25, 2023, 08:43:17 PMMoney and education which one of these is advisable to achieve? They constantly say education is the key to success but in my country today many graduates don't have a job, and most of them are still fed by their parents, and that's not the way it's supposed to be. And again they also said money is potency and fondness. Yes, money is power even if you are not a graduate or you haven't been to college before and you have the money you can even employ a graduate to work for you. Presently now in my wonderful fatherland NIGERIA 🇳🇬 I can see the power of money. Please any advice? For me, education is the best thing in life.  With it comes knowledge, and we all know just like money, knowledge is power.  Power attracts power. In short, when a person is full of knowledge, he can create ideas and innovations that can bring him prosperity.  Aside from that, the system today often gives priority to those who have the degree or proof of knowledge on several areas.  Even in Entrepreneurship and businesses, successful people seek knowledge, they even reenroll in colleges, workshops, special education like seminars, and alike just to gain knowledge.  You can choose money but without knowledge of how to grow them, you will end up with nothing.  Ever heard of the news about lottery winners?  They have huge amounts of winnings but without financial literacy, they end up poorer than before they even won the jackpot.So between education and money, it is education for me, money can come after.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "February 25, 2023, 09:55:39 PM",
      "body": "You should choose both because without either one of it you will struggle in life. Education is the key to make more money, not necessarily the general part but if you have a specific knowledge that you already mastered then that's it, although, it depends on someone on how they're going to use it.Money on the other hand is the one that was making us to move further in life because without it you will struggle in life or will get behind with the evolving technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "February 25, 2023, 11:41:33 PM",
      "body": "If you were the main character in a movie who becomes wealthy. What would the story be for how you attain wealth? How to get from point A to point B. Try to create a business plan or investment model for how this might occur. Maybe you can write an ebook you sell on amazon. Priced at $1. You can make $1 million dollars, if 1 million people purchase your book. Keep coming up with and executing plans, until you succeed. Learning from each experience. That seems to be what works for most people.Education I am not certain on. The diploma and certification can open the door to higher paying jobs with some majors. Unless there is a specific vocational skill one wishes to learn, I think university doesn't make much sense. Today with the advent of micro degrees which can be earned on sites like khan academy. It might be better for some to pursue ISO equivalent certs, which can be had quicker and more affordably. There are some micro degrees which can be earned for $50 within the span of a few weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "February 25, 2023, 11:51:18 PM",
      "body": "You can be educated in ancient Greek, it may not directly be an asset to enable enough money to live on which is a problem. Education by itself is not enough but generally discipline and learning will allow you to advance in parallels if not a direct path.  Many people pass a degree in English or history but go into business in some other way, the general take is that a higher education can qualify a person to learn some level of business higher then normal entry level.   It depends really its the person and their capabilities that matters, some never leave the education system I know quite a few who qualified and just went into teaching which is one valid route.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "February 26, 2023, 12:23:05 AM",
      "body": "Quote from: rachael9385 on February 25, 2023, 08:43:17 PMMoney and education which one of these is advisable to achieve? They constantly say education is the key to success but in my country today many graduates don't have a job, and most of them are still fed by their parents, and that's not the way it's supposed to be. And again they also said money is potency and fondness. Yes, money is power even if you are not a graduate or you haven't been to college before and you have the money you can even employ a graduate to work for you. Presently now in my wonderful fatherland NIGERIA 🇳🇬 I can see the power of money. Please any advice? Both is you ask me, and Op you should know that being educated doesn't really meaning going to school, you should try to differentiate between school and education and also recall that beware a child is registered in a school or any learning institution that child already knows something like for example a baby before being enrolled in a kindergarten that child already knows his/her name and its also able to identify some inject around him/her. So you see that child has been educated without even having to go to school. So also you can still have money and still be educated on a certain field you can just decide that I want to k ow more about a specific niche of science of your interest and just learn it while still being rich, and at the end you'll end up with both knowledge and wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "February 26, 2023, 01:48:33 AM",
      "body": "Educational background (diploma) is not a guarantee that it will make it easy for us to achieve success.but the most important thing to achieve success is developing skills and adding insight / knowledge from experience.Why not all undergraduate graduates can achieve success? because the answer is in each individual itself. their successful people do not only seek knowledge and develop skills through formal education. but they also take direct action through direct practice in the field. so it's no stranger to hearing stories about someone who has achieved success, it turns out that they are indeed continuing to develop their talents independently outside of the formal education they are currently entering. in fact, many of them also leave education to focus on the projects they are developing.so the point is not about formal education and money. but it's about the individual himself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "February 26, 2023, 02:38:40 AM",
      "body": "Quote from: rachael9385 on February 25, 2023, 08:43:17 PMThey constantly say education is the key to success but in my country today many graduates don't have a job,Unfortunately it is also found in my country. Most young people still have the notion that the field of government is a career that will at least guarantee until old age.Back to the question, education is more important if you take it seriously (both formal and non-formal education). The provision for making money is whatever knowledge or ability you get from that education period which is then developed along with real life situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 26, 2023, 02:54:23 AM",
      "body": "Why not both if possible?Money is important,specially during these challenging times, there is no doubt about it, but in my opinion if someone has some spare money, it is always good to invest in oneself for the sake of a better future, perhaps not in Nigeria but in other countries.Here where I live there is also a lack of opportunities for professionals, but that does not usually stop many of us to pursue higher education and a career which could help eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "February 26, 2023, 03:33:50 AM",
      "body": "Education does not guarantee you a successful future, but education is necessary and a solid springboard for you to start life. Today, many college graduates are unemployed, but not all, many still have jobs even while attending college. That means that in addition to degrees and knowledge, we need to have many more skills, and skills are not the same for everyone. Sometimes education is not necessarily a university graduate, or getting a degree, education is the knowledge that you can learn outside of society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "February 26, 2023, 04:17:42 AM",
      "body": "Maybe you've heard these words, \"money is not everything, but everything needs money\". On the one hand, to get an education requires money, on the other hand to earn money requires knowledge.There are lots of dreams that someone wants to fulfill, starting from wanting to be rich and respected by others. Meanwhile, through education you have a greater opportunity to be able to contribute to the environment around where you live. You can become a member of society who actively participates in bringing about change and development for the better with the educational provision that is within you.Narrow employment opportunities make it difficult for graduates to find work, no country is inseparable from this problem, both developed and developing countries. The government must act as a facilitator to reduce unemployment to improve social welfare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "February 26, 2023, 04:32:35 AM",
      "body": "Education doesn't necessarily bring knowledge after all, even setting up a foundation can be done easily now with the internet being so accessible to everyone, though having that educational background does bring about a solid foundation on which companies can take as the basis to hire you. It's a sort of connection that boosts you up, unlike when you only have the skills involved but you don't have anything to spring you up toward these companies. Ofc if possible I'd probably just choose money, I mean, if I have enough anyone should be able to live without having to spend an hour working, maybe even hire people to help you create opportunities for passive income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "February 26, 2023, 04:58:31 AM",
      "body": "You wont get money in your hands unless you earn it and to earn it you needs skills and education. Leaving specific countries out of the question and talking in general this is the main idea. Maybe Nigerians are having a different problem but most countries have the need for education and degrees in order to get a job.If you can set up your own business that is another option to go for but it is not everyone's cup of tea.Graduates not having job can be an effect of a lot of things. Maybe their skills are poor, if so work on them. Maybe the number of jobs are low in such case get a new degree (which can take years) or move to a new country (sounds more feasible).In either way the condition of many countries might force their people to move away and I support that because everyone has to feed own stomach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "February 26, 2023, 05:59:05 AM",
      "body": "If you say that money is power and education turns into a waste of time, ask yourself whether the hope of getting money is for a completely uneducated person. How? Who has more opportunities to get a rare, well-paid job? Will uneducated people be able to manage something without knowing all the technologies?I think the answer is obvious. Yes, many in your country are not born with a golden spoon in their mouth; however, I am sure that you know many successful people who were able to achieve everything on their own. In that case, which would you choose, and why could they?  Can all students, at the same time, seriously take up their education and not stop it in any case? There is no other way. The choice is always yours: to be poor or to succeed through blood and pain, no matter what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "February 26, 2023, 06:31:17 AM",
      "body": "What many people are saying education is the most important to become successful isn't only the education you got in your school or university e.g. generic knowledge, but education about money management, investment, problem solving, and any other knowledge that will help you to work in high salary job e.g. programmer. If you only have a good knowledge about your local language, your country's history, religion, it will not make you become rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}