{
  "id": "topic_5461240",
  "title": "teoliya33",
  "author": "teoliya33",
  "created_time": "July 27, 2023, 07:31:40 PM",
  "content": "Hello Everyone;As per my understanding, the lighting network adds a feature where you a payment channel between to individuals where nothing is transacted until the payment channel is closed. This is to reduce the fees on individuals and number of transactions on the blockchain.I know you can run a BTC node by running the original Bitcoin wallet. So I assume the BTC lightning network is on the blockchain.Since if it is not that would be a vulnerability.Thankful for any info.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461240",
  "comments": [
    {
      "author": "_act_",
      "created_time": "July 27, 2023, 07:46:35 PM",
      "body": "Bitcoin lightning node is not the same as bitcoin node.If you run bitcoin node, you are contributing to how decentralized bitcoin network is and it is validating mined blocks and blockchain transactions. With lightning node, it is about the off-chain layer.  Lightning node runners are connected in channels to route off-chain transactions and they can open and close channels.You can learn about the the differences: https://voltage.cloud/blog/lightning-network-faq/differences-between-bitcoin-nodes-and-lightning-nodes/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 27, 2023, 07:58:04 PM",
      "body": "When two individuals open LN payment channel, they commit a certain amount of BTC to that channel. They can then transact with each other off-chain, updating the distribution of funds in the channel. These transactions are not immediately recorded on the blockchain, which reduces congestion and transaction fees. At any point, either party can decide to close the payment channel and settle the final balance on the blockchain. The closing transaction is an on-chain transaction, and its purpose is to reflect the final distribution of funds between the two parties after their off-chain transactions. Thus, the Lightning Network ultimately relies on the blockchain for security and to ensure the final settlement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "July 27, 2023, 09:18:04 PM",
      "body": "We have a thread that is dedicated to Lightning Network by @Pmalek.It's a huge list, here it is, All Lightning Network Threads In One Place. Hopefully, you won't be overwhelm by the information as there are lot in just one thread. You can browse it and maybe you can find your answer. Best of luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 28, 2023, 02:21:20 AM",
      "body": "The Lightning network doesn't add a feature on the Bitcoin network because it is a separate network. Also, there are transactions within the Lightning network. However, these transactions are outside the Bitcoin network. They don't need block confirmation. These transactions don't reflect on the Bitcoin blockchain. The only transactions that will reflect on the Bitcoin network is when you fund or open your Lightning channel and when you close it. So if you open your channel and deposit 1BTC, that's recorded on the Bitcoin blockchain. Succeeding transactions on the Lightning network won't be recorded on the Bitcoin network. When you close your channel and you're left with 0.01BTC, that's the one that will be recorded on-chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "July 28, 2023, 11:49:52 AM",
      "body": "Quote from: teoliya33 on July 27, 2023, 07:31:40 PMHello Everyone;As per my understanding, the lighting network adds a feature where you a payment channel between to individuals where nothing is transacted until the payment channel is closed. This is to reduce the fees on individuals and number of transactions on the blockchain.I know you can run a BTC node by running the original Bitcoin wallet. So I assume the BTC lightning network is on the blockchain.Since if it is not that would be a vulnerability.Thankful for any info.Running a full node[1] is not same as running a Lightning network node[2].1. Running A Full Node2. Explaining Lightning NodesThe Lightning Network is indeed a layer-2 scaling solution for Bitcoin by creating off-chain payment channels between individuals. These payment channels can be used to conduct multiple transactions without each one being recorded on the main blockchain. So it doesn't pose any vulnerability to the funds that are transacted into the network.Also, there is no such thing as called original Bitcoin wallet, you can run a full node on other wallets too apart from bitcoin-core so the wallets are just acts as an interface to access the blocks where the funds are stored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 28, 2023, 06:40:51 PM",
      "body": "Quote from: teoliya33 on July 27, 2023, 07:31:40 PMAs per my understanding, the lighting network adds a feature where you a payment channel between to individuals where nothing is transacted until the payment channel is closed. This is partially correct. Closing the channel records the final wallet balances on the blockchain. But the opening transaction that funds the payment channel is also an on-chain transaction that is recorded on Bitcoin's first layer. Quote from: teoliya33 on July 27, 2023, 07:31:40 PMThis is to reduce the fees on individuals and number of transactions on the blockchain. It's meant to help mitigate blockchain congestion, which used to be a problem in the past and is now a problem again following Ordinals spam. It's also a good solution if you make many transactions back and forth with the same person or business entity.  Quote from: teoliya33 on July 27, 2023, 07:31:40 PMI assume the BTC lightning network is on the blockchain. It's a second layer chain on top of the main (first layer). To enter it, you need to make a first-layer opening transaction. To exit and put your coins in your non-LN wallet, you must again make another on-chain transaction.Quote from: Findingnemo on July 28, 2023, 11:49:52 AMAlso, there is no such thing as called original Bitcoin wallet, you can run a full node on other wallets too apart from bitcoin-core so the wallets are just acts as an interface to access the blocks where the funds are stored. True, but OP is surely talking about the old Bitcoin Core, which was in the past both a wallet and mining software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoababe",
      "created_time": "July 28, 2023, 11:41:08 PM",
      "body": "Quote from: Darker45 on July 28, 2023, 02:21:20 AMThe Lightning network doesn't add a feature on the Bitcoin network because it is a separate network. Also, there are transactions within the Lightning network. However, these transactions are outside the Bitcoin network. They don't need block confirmation. These transactions don't reflect on the Bitcoin blockchain. The only transactions that will reflect on the Bitcoin network is when you fund or open your Lightning channel and when you close it. So if you open your channel and deposit 1BTC, that's recorded on the Bitcoin blockchain. Succeeding transactions on the Lightning network won't be recorded on the Bitcoin network. When you close your channel and you're left with 0.01BTC, that's the one that will be recorded on-chain.Im getting you right until you said that 0.01BTC will be left after closing a channel that was filled with 1BTC. Would you be able to break this for a noob like me?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 29, 2023, 01:04:24 AM",
      "body": "Quote from: Cryptoababe on July 28, 2023, 11:41:08 PMQuote from: Darker45 on July 28, 2023, 02:21:20 AMThe Lightning network doesn't add a feature on the Bitcoin network because it is a separate network. Also, there are transactions within the Lightning network. However, these transactions are outside the Bitcoin network. They don't need block confirmation. These transactions don't reflect on the Bitcoin blockchain. The only transactions that will reflect on the Bitcoin network is when you fund or open your Lightning channel and when you close it. So if you open your channel and deposit 1BTC, that's recorded on the Bitcoin blockchain. Succeeding transactions on the Lightning network won't be recorded on the Bitcoin network. When you close your channel and you're left with 0.01BTC, that's the one that will be recorded on-chain.Im getting you right until you said that 0.01BTC will be left after closing a channel that was filled with 1BTC. Would you be able to break this for a noob like me? It's like this. Let's say your mother is the Bitcoin network and she's giving you $100. You can buy whatever you want with it but you will have to return the change or whatever is left at the end of the day. You are the Lightning channel. After you received the money from your mother, you went out, bought a cup of coffee, a sandwich, watched a movie, ate at a restaurant, and so on. At the end of the day, you went home and only $10 is left of the $100. You returned the $10 to your mom as agreed. What's only registered to your mom, or what she only knows, is that she gave you $100 and you returned $10. Those are the only transactions that are on-chain and are registered on the Bitcoin blockchain. The rest of the transactions, those that happened between you and the others, she didn't know. All of them happened in another network which is the Lightning network. You receiving the $100 and returning the $10 is the opening and closing of the channel, respectively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "July 29, 2023, 01:35:38 PM",
      "body": "Quote from: teoliya33 on July 27, 2023, 07:31:40 PMHello Everyone;As per my understanding, the lighting network adds a feature where you a payment channel between to individuals where nothing is transacted until the payment channel is closed. This is to reduce the fees on individuals and number of transactions on the blockchain.I know you can run a BTC node by running the original Bitcoin wallet. So I assume the BTC lightning network is on the blockchain.Since if it is not that would be a vulnerability.Thankful for any info.You can't say nothing is transacted because the transactions are done but on layer 2. Lightning network is a layer 2 solution to make fast and cheap transactions.Yes, opening and closing a lightning channel requires us to make a transaction on the bitcoin blockchain and all the rest of the transactions are on layer 2.When you close the channel the final settlement is done between the addresses with the final transaction being recorded on the bitcoin ledger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "July 29, 2023, 02:13:50 PM",
      "body": "I have always been scared of reading about the technical aspect of bitcoin because I find it complex and difficult to understand. But today I have learned more about the Lightning Network simply and understandably. The explanations from this thread are some of the best I have ever come across. It was like the class was for a primary school pupil in the bitcoin space like me. It is now clear that LN is the best alternative for businesses, especially for those that have consistent customers. And it will also be ideal for international trade because it will be cheaper and faster. My next task will be to learn how to set up the LN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "August 03, 2023, 01:29:10 PM",
      "body": "Quote from: teoliya33 on July 27, 2023, 07:31:40 PMHello Everyone;As per my understanding, the lighting network adds a feature where you a payment channel between to individuals where nothing is transacted until the payment channel is closed. This is to reduce the fees on individuals and number of transactions on the blockchain.When you make a payment in a channel, payment is recorded in the node interacting with the channel, nothing is sent to the Bitcoin network except for the first transaction when you open a channel and when you close a channel, there are situations where a third transaction may come in when you want to close a channel and remove the BTC that is committed to that channel.QuoteI know you can run a BTC node by running the original Bitcoin wallet. So I assume the BTC lightning network is on the blockchain.Since if it is not that would be a vulnerability.Thankful for any info.Lightening Network is a layer 2 network, it means everything that happens on the network is not recorded on the Bitcoin main chain itself except for when you open and close a channel, and there is no vulnerability of any kind except when you used a custodial wallet that you may not have access to the private keys or the mnemonic seed. You can choose to use a non-custodial wallet like the SPV wallet and still use your wallets without running your node.You are missing up somethings.*You use payment when you are sending bitcoin on Lightening Network (layer 2)*You use Transaction when you are sending Bitcoin on Main Network",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "August 03, 2023, 09:59:27 PMLast edit: August 03, 2023, 10:15:05 PM by Sandra_hakeem",
      "body": "You got it all wrong...you don't just assume things though - asking constructive questions would go a long way...The lightning network processes transactions off- chain, hence saving time and reducing the gas fees in some cases. How does this happen?? LN uses what's Called \"channels\" ... it's done in a way that transactions are swap between users; This measure diversifies the means for every transaction that should be passing through/ waiting for the usual 2out of 6 level of confirmations on the mempool..Sandra🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "August 03, 2023, 11:59:35 PM",
      "body": "I tend to agree above, in the Lightning Network, transactions are processed off-chain, which means they aren't immediately recorded on the main Bitcoin blockchain.  This process helps save time and can significantly reduce transaction fees compared to on-chain transactions, especially for smaller and more frequent transactions.The Lightning Network achieves this by utilizing what is known as \"payment channels.\"  These channels are established between two parties, and once opened, they allow those parties to conduct multiple transactions between themselves without needing to involve the leading blockchain for each one.  Because running a full Bitcoin node, which includes supporting the blockchain, is different from running a Lightning Network node. To use the Lightning Network, you must set up a separate Lightning node, which is compatible with the Bitcoin network but operates on a different layer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}