{
  "id": "topic_5492331",
  "title": "chasebandsnotbtc",
  "author": "chasebandsnotbtc",
  "created_time": "April 10, 2024, 05:35:48 PM",
  "content": "Im not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identity",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5492331",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "April 10, 2024, 05:44:48 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMso does anyone know how to buy btc without having to show proof of identityDo you mean kyc? You can buy Bitcoins using decentralized exchanges where you don't require to give personal information or identity. here's a link to some well known decentralized exchangeshttps://kycnot.me/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "April 10, 2024, 05:45:51 PM",
      "body": "Best way to do this is P2P on software like Bisq (as in the list pointed out above) -- go ahead and read about it. You need a security deposit on Bisq though so likely you can't use it if you don't have any coin. Others will eventually require KYC, believe me.Brings us to marketplaces like on this forum itself: https://bitcointalk.org/index.php?board=53.0 Pretty sure some traders would accept if you pay first. Given you don't have a reputation here or anywhere else, you'd need to find someone trusted or reputable so you feel safe sending first. Be prepared to face unfavourable terms, as you're an unknown entity.Binance and other exchanges also have P2P marketplaces -- I believe you don't need KYC to view these. Many leave their contact details, least last I checked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "April 10, 2024, 05:45:56 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityIt's  simple   there're  alot of ways you could connect your  identity to your wallet **Kyc => mostly  acquainted  to Exchange  wallets  **Announcing or mentioning  your address publicly  means you're  connecting your real life identity  to such address.However there's  only one single way to the privacy in term of buying  for storage you want which is using a noncustodial  wallet but you can still reveal your self  from what I've  mentioned  above..If you wish to trade you can use some P2P service without  having  to provide  you kyc   or identities  Exchanges  like https://exch.cx/  and many more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 10, 2024, 05:48:34 PM",
      "body": "Quote from: buwaytress on April 10, 2024, 05:45:51 PMBinance and other exchanges also have P2P marketplaces -- I believe you don't need KYC to view these. Many leave their contact details, least last I checked.They have limitations on how much you can trade without the need of KYC. If the Op only wants to trade a few dollars worth of bitcoin this will suffice for what he is looking for, but starting on a privacy note with a decentralized exchange maybe the best option.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 10, 2024, 06:09:12 PM",
      "body": "Quote from: un_rank on April 10, 2024, 05:48:34 PMQuote from: buwaytress on April 10, 2024, 05:45:51 PMBinance and other exchanges also have P2P marketplaces -- I believe you don't need KYC to view these. Many leave their contact details, least last I checked.They have limitations on how much you can trade without the need of KYC. If the Op only wants to trade a few dollars worth of bitcoin this will suffice for what he is looking for, but starting on a privacy note with a decentralized exchange maybe the best option.- Jay -I also don't think you can make use of P2P without passing the KYC. The only thing you can do without the need for KYC is that you can send a few dollars into the exchange and trade a few coins on the spot market, but once it comes to withdrawal, I don't think you can withdraw without KYC, and even if you can, just like you said, it can't be more than a few dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 10, 2024, 06:21:47 PM",
      "body": "Quote from: promise444c5 on April 10, 2024, 05:45:56 PMIf you wish to trade you can use some P2P service without  having  to provide  you kyc   or identities  Exchanges  like https://exch.cx/  and many moreExch.cx is a swap exchange, you cannot buy BTC in exch.cx. If op wants to buy BTC without losing their privacy, then they have to choose a p2p exchange from the link that has already been shared. Op can then use exch.cx later on if they want to swap BTC to either XMR, DAI, USDT, USDC, and the other options available in exch.cx.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BABY SHOES",
      "created_time": "April 10, 2024, 06:22:37 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityI have never bought BTC on a decentralized exchange but you can try it for a new experience as shown above.There are CEX exchanges that do not ask for KYC that I know of which is Mexc but now you will be asked for basic information even if it is skipped you can still make purchases and withdrawals on this exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "April 10, 2024, 06:25:15 PM",
      "body": "Quote from: Z-tight on April 10, 2024, 06:21:47 PMExch.cx is a swap exchange, you cannot buy BTC in exch.cx. If op wants to buy BTC without losing their privacy, then they have to choose a p2p exchange from the link that has already been shared. Op can then use exch.cx later on if they want to swap BTC to either XMR, DAI, USDT, USDC, and the other options available in exch.cx.Yes you are right , I  used the word trade.... I didn't  made mention  of buying  BTC maybe I should  add (inform of exchange) to make it clearer to readers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zedrojipsa",
      "created_time": "April 10, 2024, 07:03:48 PM",
      "body": "The only safe way to do that without getting ripped off is in small portions,giftcards or cashapp,etc $100 max per transaction would be my guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 10, 2024, 07:06:00 PM",
      "body": "Quote from: BABY SHOES on April 10, 2024, 06:22:37 PMThere are CEX exchanges that do not ask for KYC that I know of which is Mexc but now you will be asked for basic information even if it is skipped you can still make purchases and withdrawals on this exchange.If you are 100% certain that you never want to give your personal data to any crypto service, then do not even use centralized exchanges were you can trade certain amounts without kyc. That's because you may deposit your funds and they confiscate it and ask for kyc, they can claim your coins came from a mixer or has a link to a 'blacklisted' address, so if you don't want to be compelled into losing your privacy, use p2p exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "April 10, 2024, 07:22:38 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityCentralized exchanges would often require kyc wherein you would have to tell them your identity and verify it with documents as well some people find centralized exchanges more secure but for those who do not they use decentralized exchanges.Here you can just directly buy and sell your crypto without having to tell them anything about yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "April 10, 2024, 07:38:40 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityThe first question I would ask you is what currency are you trying to trade for Bitcoin and are you trying to do it online only or in person?  If in person, where are you located?  Many places have Bitcoin ATMs where you can put cash into the machine and receive Bitcoin.If you're trying to trade online and you have a different form of digital currency, it is quite easy.  There are many sites that will facilitate the trading of digital currencies without having you fulfill know your customer rules.  You may find yourself still dependent upon location for this though, so a VPN might be a good tool to utilize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "April 10, 2024, 07:42:26 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityI don’t really know the country which you are from, but if you are from my country, their are some high rank forum members which I can recommend to you which if you make transaction with them, you are definitely going have a smooth deal, you can just send them fiat currency, and they will send you bitcoin. But I don’t know your country, just try and visit your local board, create a thread about it, don’t agree with anyhow that send you a personal message to sell bitcoin for you, and make sure anyone you trading with is a higher rank member with reputation, and make sure you confirm in the local board if the person is really reliable before making transactions. @ Hatchy also dropped a link for you, am sure you will be able to get your bitcoin from there if you can make use of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 10, 2024, 07:58:57 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityyou can buy bitcoin without having to go through the use of a centralized exchange because using such will definitely require your kyc, so if i were you, all i will do is to make use of a decentralized exchange or make use of a direct p2p with the person i trusted and want to sell, there are also physical escrow service providers which are trusted, you can check them our below for your choice of decentralized exchanges and escrow service providers. escrow service providershttps://bitcointalk.org/index.php?topic=5047302.0decentralized exchangehttps://bisq.network/https://hodlhodl.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "April 10, 2024, 08:23:38 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityYou do not give us too much info to work with, we do not know if you have cash, what is what you are lacking so you cannot buy bitcoin or if bitcoin is legal where you live, still another option is to buy bitcoin face to face from another person, when doing an exchange like that no one is going to ask you for your personal information or anything like that , the downside is that this is a risky method to buy bitcoin and you must trust the other person not to scam you or steal from you, so it is preferable to arrange such encounters in a crowded place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "April 10, 2024, 08:32:22 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityP2p gives you the freedom to buy Bitcoin for m any random person without the need to follow the third party kyc compliance services such as exchange, so yep you can visit the service section and make your offer I am sure you will get someone around your region mostly from your local board that can trade Bitcoin with you based on p2p.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "April 10, 2024, 08:32:30 PM",
      "body": "Quote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityAll our local exchanges require KYC for all crypto transaction activities. I don't know which country you come from. If the qualification you mean is KYC, there are still exchanges that do not require KYC so you can buy Bitcoin.You can purchase Bitcoin via P2P bisq as mentioned above.I plan to advise you to go to the currency exchange board to be more specific about what you mean, because there this discussion is very appropriate.I would like to welcome you to the bitcoin forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "April 10, 2024, 08:34:03 PM",
      "body": "The exchanges that were posted here won't require you to do any kyc. Aside from P2P and those exchanges, you can ask someone that has an account in an exchange that's fully verified to do the favor for you. If you happen to know in a circle of your friends have that, you can ask that guy to do the purchase to you. It's either you'll give him a bit portion of your purchase or he'd do it for free as both of you are friends. This is just like the choice that you don't ever have any other but do the first ones, the P2P or else you do the verification on your own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chasebandsnotbtc",
      "created_time": "April 10, 2024, 08:39:33 PM",
      "body": "Quote from: South Park on April 10, 2024, 08:23:38 PMQuote from: chasebandsnotbtc on April 10, 2024, 05:35:48 PMIm not able to purchase BTC due to me not having the qualifications needed to buy btc,so does anyone know how to buy btc without having to show proof of identityYou do not give us too much info to work with, we do not know if you have cash, what is what you are lacking so you cannot buy bitcoin or if bitcoin is legal where you live, still another option is to buy bitcoin face to face from another person, when doing an exchange like that no one is going to ask you for your personal information or anything like that , the downside is that this is a risky method to buy bitcoin and you must trust the other person not to scam you or steal from you, so it is preferable to arrange such encounters in a crowded place.So I try buying btc from btc machines from where I live but most of them are messed up and when I tried buying btc from coinbase or apps like that ,it wants me to verify my identity and im not of age yet so i cant buy btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}