{
  "id": "topic_5477082",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "December 08, 2023, 06:10:45 PMLast edit: February 28, 2024, 04:10:16 PM by Mia Chloe",
  "content": "A lot of new members on the forum often ask questions about Avatar, signatures and personal text and Most of them usually have some issues setting them up. However In  this thread I created some time ago Hamza2424 suggested a guide concerning signatures and avatars.so I decided to create one coupled with the fact that I have come across some threads by new members concerning them and I don't know if an image guide has been created before.this thread will carry important information about signatures and avatar including a guide on setting it up.AvatarThis is the small sized image usually displayed in your profile or under your username when you make a post. It acts like a form of profile picture for users.Setting it upBefore heading to your profile to set up a new avatar make sure you have the avatar image ready and available on the device you are using this because the image file would be uploaded from your device and not \"TALKImg\" .below are criteria necessary to consider before choosing a avatar image.Rank ;To be able to upload an avatar to your profile you must be at least a full member.Resolution ; The avatar resolution must not be greater than 120px × 80px.if the image you wish to use is greater you would have to use a possible software to reduce its resolution before attempting to upload.Size ; The file size of the image you wish to use as avatar should not be greater than 100kib.File type ; The standard accepted file types are PNG, jpeg and non animated GIFs although some ordinary GIF files may work.STEP By STEP GUIDE1. Open your profile, click \"forum profile information\", click on \"Go here\" then click \"choose file\".now select your preferred avatar image and click upload. See images below;To remove an avatar just click on upload file without selecting any file. Signature This is a unique form of design code which is usually displayed under your profile and post.These signatures are capable of embedding links depending on the signature code.Setting it upBefore heading to your profile to apply a new signature make sure you have the signature code ready and copied to your device clipboard.signatures are limited depending on ranks.below are some factors to be considered before uploading a signature.Rank ; Signatures can be updated from Jr member to legendary ranks. However the number of maximum characters of signature code applicable varies depending on rank. Below is a breakdown.Jr member --> 150 characters maxMember --> 4000 characters maxFull member --> 4000 characters maxSr member --> 4000 characters maxHero member --> 4000 characters maxLegendary --> 4000 characters maxDisclaimer!!! ---> Be sure not to promote a scam website with your signature space . therefore check for scams before uploading a signature.promoting scam websites on your signature could lead to negative trust feedback on your profile.STEP By STEP GUIDETo apply a signature from your forum profile information click on the text box for signature and paste in the required signature code the. Click change profile as shown in the image below.To remove a signature clear all the code in the signature text box and click change profile.Note also that signature also has a few mods depending on your rank also. Below is a summary;Quote from: theymos on February 26, 2014, 09:15:18 PM- Jr. Member: No links allowed. Max 150 characters.- Member: Unlimited length.- Full member: Color allowed.- Sr. Member: Size allowed- Hero member: Background color allowed- Legendary: Background color allowed",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477082",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "December 08, 2023, 06:55:39 PM",
      "body": "Quote from: Mia Chloe on December 08, 2023, 06:10:45 PMSetting it upBefore heading to your profile to apply a new signature make sure you have the signature code ready and copied to your device clipboard.signatures are limited depending on ranks.below are some factors to be considered before uploading a signature.Rank ; Signatures can be updated from Jr member to legendary ranks. However the number of maximum characters of signature code applicable varies depending on rank. Below is a breakdown.Jr member --> 150 characters maxMember --> 4000 characters maxFull member --> 4000 characters maxSr member --> 4000 characters maxHero member --> 4000 characters maxLegendary --> 4000 characters maxregarding this part, aside from the maximum number of characters allowed, I think you should also add what other feature on the signature is unlocked on each rank. if I remember correctly, a new feature in the signature unlocks on each rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "December 08, 2023, 07:01:53 PM",
      "body": "This is so basic yet most important topic for new comers because usually no one goes through all the linkes or must read articles published and rather reads the posts and topics published by fellow users and this would definitely help new comers and also it would help them even further if we can guide them on how to not breach the forum rules and how to have organic growth. I appreciate these sort of topic which will help users as when we were new it was difficult but glad that the person who introduced this to me gave me enough download. Well-done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "December 08, 2023, 07:16:28 PM",
      "body": "I wasn't expecting, the implementation of the suggestion, thanks for contributing towards guiding new users as always. Keep it up I'm not sure if you've covered other profile settings as well, but after experiencing this guide or by exploring by themselves newbies can customize their profile under the forum limitations, such as status info, IP info, and other features.I've seen some of your guiding topics, I appreciate all the efforts you put in for newbies, keep exploring, and keep growing.Quote from: acroman08 on December 08, 2023, 06:55:39 PMregarding this part, aside from the maximum number of characters allowed, I think you should also add what other feature on the signature is unlocked on each rank. if I remember correctly, a new feature in the signature unlocks on each rank.Hmm yeah, there are a few upgrades on every rank regarding glow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AirtelBuzz",
      "created_time": "December 09, 2023, 05:46:49 AM",
      "body": "Great post I might find this post useful today as I want to add it to the signature campaign with my member account.Those who pass from Newbie to Member and Full Member or higher ranks must add Signature Code and Avatar and Personal Test if they want to join the Signature Campaign. There are many like us who are not aware of these, they will surely know and learn by reading this post.ThanksAirtelBuzz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "December 09, 2023, 06:48:40 AM",
      "body": "Actually assuming I saw this post before I joined a signature campaign I won't have find it difficult to wear my avatar, because when I joined a campaign newly I was even looking for the appropriate place to click so that I can be able to wear avatar and my signature but it took me more time and I began to check everything concerning personal data in the profile that's how gat to know the appropriate place I'm supposed to click in order to direct me the appropriate place I'm to click and wear my avatar and my signature, this your post is adorable because it's very educative through the place you painted red to be click for wearing of avatar and signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "December 09, 2023, 07:04:36 AM",
      "body": "Animated images were allowed to use as avatars but because they are annoying images, theymos disabled it. After that announcement, you can not upload and use animated images for avatar.Years ago, newbies can wear avatars too but after a forum hack, it was disabled. There are glitches and you sometimes can see newbies wear avatars (like this user whistle11 or more newbies in that thread) or users with animated avatars like yahoo62278. They will lose those avatars if they remove it or upload a new image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "December 09, 2023, 08:05:01 AM",
      "body": "Quote from: hd49728 on December 09, 2023, 07:04:36 AMAnimated images were allowed to use as avatars but because they are annoying images, theymos disabled it. After that announcement, you can not upload and use animated images for avatar.Years ago, newbies can wear avatars too but after a forum hack, it was disabled. There are glitches and you sometimes can see newbies wear avatars (like this user whistle11 or more newbies in that thread) or users with animated avatars like yahoo62278. They will lose those avatars if they remove it or upload a new image.I've had my avatar for years now, you are correct that if I remove it I lose it as well. That is why any signature campaign that wants me has to agree that my avatar space is able to stay as is. I would remove it, but a company will have to open their wallets big for that to happen. Remember everyone that wearing a signature on this forum is a privilege and not a right. Don't go spamming the forum with a bunch of nonsense to try to get paid once in a campaign. You can get yourself banned from the forum for doing so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "December 09, 2023, 11:34:57 AM",
      "body": "This is quite educative. I had this experience when I was accepted into the current campaign I am participating in, at the time, I didn't know much on how things works in terms of wearing the signature of the campaign I was accepted into and almost stayed two days without putting on the signature. When I noticed that all those that where accepted with me are ptting on the signature I had to make enquiry and i was told that it was the first thing I am supposed to do after being accepted into a signature campaign.All thanks to my manager @cryptoprenurebrainboss that give me similar directive and I was able to apply my current signature rightly.I believe this tutorial will be of great help to people that will be participating in signature and avatarCampaign for the first time .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "December 10, 2023, 01:25:25 PM",
      "body": "Quote from: yahoo62278 on December 09, 2023, 08:05:01 AMRemember everyone that wearing a signature on this forum is a privilege and not a right. Don't go spamming the forum with a bunch of nonsense to try to get paid once in a campaign. You can get yourself banned from the forum for doing so.It is a privilege, not a right.When the forum was covered with spam posts in 2017, theymos wanted to consider to shut down all signatures if he fails to find solution to improve forum post quality.Ideas for improving post quality?Quote from: theymos on December 18, 2017, 12:54:08 AMWhat are everyone's ideas for improving post quality?I have mostly ruled out: - Removing signatures or sig ads globally. - Requiring payment to wear sig ads. - Banning account sales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "December 10, 2023, 02:46:30 PM",
      "body": "This is the most helpful topic for beginners or other users who have never used signatures before. I really appreciate your efforts to create an educational topic like this, your work really helps other users who are still confused about using signature code. Even though it looks very simple, it is full of meaning. Those who initially had difficulty with limited knowledge about how to use the signature code on their profile, will understand more quickly after following your guide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}