{
  "id": "topic_5489709",
  "title": "Pingu of Sealand",
  "author": "Pingu of Sealand",
  "created_time": "March 20, 2024, 09:53:24 PM",
  "content": "The custodial path is the wrong way.-----One of Bitcoin’s strengths lies in the certainty of controlling one’s own funds, with no possibility for others to access them unless they possess the private keys to do so.During the Blocksize Wars, two distinct factions emerged, represented by equally distinct chains. After the recent end of the Faketoshi saga, only Bitcoin and Bitcoin Cash remain from all the noise of those years.At first glance, it seems that the first faction, Bitcoin, has chosen the long-term path—one where the base layer cannot scale and must ossify to remain secure and decentralized. Meanwhile, the second faction, Bitcoin Cash, has opted for a shorter route—a path where the base layer can scale and adapt more easily, allowing immediate use by all usersIn my view, neither of these choices can be definitively labeled as long-term or short-term. If we examine the details closely, developing suitable subsequent layers takes time, but building mass adoption on the base layer requires just as much effort.-----I have one certainty: the custodial path is the wrong way, and turning a blind eye could prove fatal.Currently, on-chain transactions with Bitcoin are still feasible for moderate amounts, but they are prohibitive for smaller sums. Mathematically, fees are destined to increase. Following this trajectory, it’s logical to assume that in the future, we will conduct most transactions on subsequent layers while keeping savings on-chain. Alternatively, we might transform the current system into a slower one, where instead of buying a low-quality pair of jeans each month, to avoid fees we opt for a high-quality pair once a year. However, taking the path of layers 2, 3, and beyond would be in vain.It’s crucial not to let these subsequent layers become mere copies of the current system. Lightning Network is an excellent system, but I cannot truly claim to always possess my funds. Doing so would be far from simple, and I end up relying on someone else. Liquid is cost-effective, and I hold my private keys, but the system is controlled by a few companies. Bitcoin Cash scales, and I have my private keys; I don’t need to trust anyone. However, the mining incentive and fees are near to negligible, making the network vulnerable to attacks.Make no mistake, Bitcoin works. It is the greatest revolutionary act of the century—a tool that will serve humanity’s evolution. However, we must have vision, think about the future and the next generations. Let’s pause for a moment and take the truly challenging path, perhaps the best but the longest, to make the system entirely uncensorable.Don’t assume that the solutions we have today are definitive. The upgrade to Bitcoin’s source code that will lead to its victory is yet to come, and it will happen gradually, with total consensus. No, no altcoin will bring about this revolution. Bitcoin’s functionality makes it the only usable tool to achieve our purpose.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5489709",
  "comments": [
    {
      "author": "Medusah",
      "created_time": "March 20, 2024, 10:42:04 PM",
      "body": "For our savings, we must retain self-custody, but I would contend that custody of little sums is not always a terrible thing.  Yes, I would prefer to pay with my own money when I buy myself a coffee, but if doing so requires me to incur exorbitant costs or run the danger of starting another block size war, then forget it.  I retain Bitcoin for my big quantities and prefer to place a little faith in a reputable third party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "March 20, 2024, 11:25:38 PM",
      "body": "Quote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMBitcoin, has chosen the long-term path—one where the base layer cannot scale and must ossify to remain secure and decentralized.That sounds a little... absolutist?  If that's going to set the tone for this thread, we're off to a ropey start.  So let's get a few things clarified here:It's not that the base layer \"cannot\" scale.  It's that it has to be scaled intelligently because there are consequences to getting it wrong.  I would also argue quite a few users of the word don't correctly comprehend the meaning of 'scaling' to begin with, anyway.  'Linear growth' is not the same as 'scaling'.  BCH is doing linear growth.  That's not an improvement of technology, it's just using more resources in the same inefficient way.  Real scaling comes from advancing technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 20, 2024, 11:39:12 PM",
      "body": "doomad never understands scalinghe thinks scaling means LEAPING to huge sizes is scaling because whenever anyone talks of scaling he cries about super size blocks to amounts NO ONE but his cultish ilk mentionscaling is small progressive growth.. not delay and leap.. .. but its doomads cultish ilk that want delays and then jumps but only when they command it via their idols they treat as gods (centralised devs protected by politics of moderation policies and hierarchy of reference client sole control)..funny part is he loves to say bitcoin should allow one transaction to cost $50 but then says bitcoin should not scale due to fears of the same $50 being the cost to store 20 years+ of transactions(billions of transactions)reality is, once he takes his meds, one day he will see if he thinks people should pay many $'s per use then a $50 hard drive which all computers need anyway is more then enough for decades of decentralising the blockchainhe cant play poverty at decades of use but be ok with single use premium costs.. thats insanityif he is ok with his crappy narrative of $100 to lock-unlock from his favoured shoddy subnetwork once a year. then he should have no fear of a $50 cost per 5-15 year. and should actually want to see onchain transactions cost under $1 each where many people collectively transact to then give mining pools a nice bonus total",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 21, 2024, 09:17:32 AM",
      "body": "Block size war is over. People who support bigger block size, but still choose Bitcoin is in minority.Quote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMIt’s crucial not to let these subsequent layers become mere copies of the current system.Mere copies? Ridiculous, many sidechain/L2 offer feature what Bitcoin doesn't.Quote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMLightning Network is an excellent system, but I cannot truly claim to always possess my funds. Doing so would be far from simple, and I end up relying on someone else.LN is far from perfect and only meant for micro-transaction. But FWIW there are few light non-custodial LN wallet where you only rely on 3rd party watchtower.Quote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMLiquid is cost-effective, and I hold my private keys, but the system is controlled by a few companies.That's true, but Liquid also offer Confidential Transaction, faster block time and turing-complete smart contract.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "March 21, 2024, 09:28:44 AM",
      "body": "What does it have to do with custody? Blocksize war isn't related to that. I'm curious as to what point and how it connects with the topic you presented OP. I'm quite confused now.Anyway, I agree that self-custodial is the way if you were to ever support BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 21, 2024, 10:25:10 AM",
      "body": "Quote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMDuring the Blocksize Wars, two distinct factions emerged, represented by equally distinct chains.Wrong. There was never a chainsplit or even a community split. Majority have so far always been on the singular chain which is called Bitcoin.Everything else including bcash are copies of Bitcoin and there are lots of them (BCH, BSV, BTG, BTS, ...) in fact during 2017 there were at least 20 different copies created just like bcash.QuoteAt first glance, it seems that the first faction, Bitcoin, has chosen the long-term path—one where the base layer cannot scale and must ossify to remain secure and decentralized.Wrong. Bitcoin (which is not a \"faction\") increased the on-chain capacity back in 2017 with the soft-fork known as SegWit.QuoteMeanwhile, the second faction, Bitcoin Cash,Again bcash is not a \"faction\" it is one out of a dozen copies created from Bitcoin which has nothing to do with it. It's just a centralized shitcoin with a mutable chain that has nothing to do with Bitcoin.Quotehas opted for a shorter route—a path where the base layer can scale and adapt more easily, allowing immediate use by all usersWrong.You scale your altcoin based on demand and this altcoin has no demand as it is clear from its empty blocks. So it did not scale anything, it just has bigger block size cap that is left unreached.QuoteCurrently, on-chain transactions with Bitcoin are still feasible for moderate amounts, but they are prohibitive for smaller sums.Similar to 2017, Bitcoin is under a spam attack that has created a congestion and triggered the mechanism that automatically battles spam attacks which is the fee market.QuoteBitcoin Cash scales, and I have my private keys; I don’t need to trust anyone. You do have to trust the centralized authority that controls this centralized altcoin and can for example perform a 51% attack anytime they want to reverse transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 21, 2024, 10:47:56 AM",
      "body": "Quote from: crwth on March 21, 2024, 09:28:44 AMWhat does it have to do with custody? Blocksize war isn't related to that. I'm curious as to what point and how it connects with the topic you presented OP. I'm quite confused now.Based on example he mentioned, i assume he refer usage of custodial service to avoid high free. For example, custodial LN wallet or using centralized/federated sidechain where theoretically they can freeze/steal your pegged Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 21, 2024, 11:54:01 AM",
      "body": "Bitcoincash has not solved the problem, most blocks are mined empty and have not been tested compared to Bitcoin, as most blocks come full, but over time, many will realize that for growth in adoption, increasing block sizes may be appropriate.Layer 2 solutions are ideal for small transactions and everyday payments but are not a solution for long-term scalability. This topic has generally been discussed hundreds of times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pingu of Sealand",
      "created_time": "March 21, 2024, 12:07:16 PM",
      "body": "Thank you all for the follow up.I'm going to answer to some of you.ABCbits - \"Mere copies? Ridiculous, many sidechain/L2 offer feature what Bitcoin doesn't.\"That's not what I said, the \"current system\" I'm referring in that specific quote is the FIAT system.pooya87 - When I talk to Bitcoiners and Bcashers, the goal in both cases is a fair currency, we can talk about factions because they both pursue the same goal, in different ways, often in contrast with each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 21, 2024, 01:32:28 PM",
      "body": "Quote from: Pingu of Sealand on March 21, 2024, 12:07:16 PMWhen I talk to Bitcoiners and Bcashers, the goal in both cases is a fair currency, we can talk about factions because they both pursue the same goal, in different ways, often in contrast with each other.Bcash is neither currency nor fair. For example one of the requirements for a fair crytocurrency based on blockchain is to have an immutable blockchain. Bcash stopped being immutable the moment they decided to roll back their blocks with a 51% attack.There is a lot of other reasons such as being centralized, having a centralized mining cartel, having no utilities, no demand, etc.You can't use the term \"faction\" for bcash because it is an unrelated altcoin like LTC or ETH or ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "March 21, 2024, 02:37:54 PM",
      "body": "Quote from: Pingu of Sealand on March 21, 2024, 12:07:16 PMWhen I talk to Bitcoiners and Bcashers, the goal in both cases is a fair currency, we can talk about factions because they both pursue the same goal, in different ways, often in contrast with each other.Bcash does not have the same goal as BTC, it is neither decentralized nor censorship resistant and there are also a lot of security flaws and vulnerabilities in their system. Statements that the both coins have the same goal is what leads newbies into buying Bcash in exchanges, when what they actually wanted to purchase is BTC. Only few people want to use Bcash and so there is little to no demand for it, hopefully this number reduces gradually until we see the end of this shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "March 21, 2024, 03:59:09 PM",
      "body": "Much as I agree with you, I have to point out that there's ordinals floating in the network that's making it congested thus making the payments for it more expensive for those that are just using bitcoin to do transactions so even if custodial is a wrong thing for us, it still should be an option for in the cases you're going to need the money and that you don't want to be paying those high fees, they can be an option for you but nonetheless it should be a last resort kind of thing. Also, isn't BCash worth nil anymore? And it's a different kind of network anyway? So how is there a blocksize war on something that has a clear winner?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 21, 2024, 04:16:01 PMLast edit: March 21, 2024, 04:34:39 PM by franky1",
      "body": "Quote from: pooya87 on March 21, 2024, 10:25:10 AMQuote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMDuring the Blocksize Wars, two distinct factions emerged, represented by equally distinct chains.Wrong. There was never a chainsplit or even a community split. Majority have so far always been on the singular chain which is called Bitcoin.never was a chainsplit?! oh no, you have caught the ignorant blind disease of the stupid bridage again. sorry to tell you this but there was a chain split.its not like BCH is a complete separate altcoin that had its own unique block 0 genesisplease just check the block data and node code of previous versions of nodes to correct yourself.. you dont need to believe me.. nor falsely TRUST the cult stupid brigade, but simply check the data, then you wil see what happened and who caused whatin 2017 there was a NYA agreement(only required economic node/pool participation) to orchestrate the banning of blocks that used old version numbers.. whereby pools and economic nodes would only accept the new block versions to signal a move to segwit, and strip the block data to old nodes that would not understand segwit that segwit nodes of economic nodes and pols were part of..  (normal user full nodes didnt get a vote(backward compatibility trick)you can check this using real data of code and blockdata.. not human trust..the blocks that had old versionbits ended up being BCH. and segwit via the mandated NYA policy version bits, only accepted the new version bit blocks by banning peers that tried to send old style blocks. thus causing a divergence of nodes..so the initial split of block versions was orchestrated by segwit nodesit was actually gmaxwell that then pleaded to the bch crowd(faction) to change some code afterwards to not cause segwit nodes to keep needing to ban older nodes/blocks to formalise the separation..(of the factions)the mandatory block selection which you can see(via mandatory banning old versionbit marked blocks) was a unnatural incline to 100% reading of block versions to make it feel like the network wanted to 100%(via banning old block version) move to segwit to an unnatural acceptance 100% of segwit virtue signallyso when old nodes using code before 0.12 would accept old versionbit blocks. it did cause a split.. but it did not require old nodes to adjust code to do so. old nodes accepting old blocks did not need to change code to cause a fork.. the fork ocured due to segwits block selection(rejection)emphasis the code adjustment between the block types was actually initially caused by the segwit side of nodes. and banning peers that tried to push old blocks to segwit accepting nodes.. and then segwit nodes only accepting segwit signalling blocks would strip the blocks to remove witness to then filter stripped blocks to their peers that didnt understand segwit(aka backward compatibility) to cause some user nodes to stay on the segwit accepting side without a vote..so check the code check the blockdata. and acquaint yourself with fact not the fiction via the idiot brigade.. dont fall int the trap of the silly stupidity you followed years ago. dont fall down the wrong rabbit hole again due to trusting silly narratives.. lets the block data and code guide you to the true events.. then you cant blame yourself or anyone for what happened, nor in what order.. as the blockdata and code holds the truthbch didnt decide to create an altcoin by tweaking code to cause a differential of different block type before august.. they only changed code afterwards due to pressure from the segwit devs AFTER the block versions separatedim saying this to correct fact, and no it does not mean i wanted nor was a bch-er i just prefer facts over fictions of versions of events of who caused what first",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 22, 2024, 08:06:02 AM",
      "body": "Quote from: franky1 on March 21, 2024, 04:16:01 PMQuote from: pooya87 on March 21, 2024, 10:25:10 AMQuote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMDuring the Blocksize Wars, two distinct factions emerged, represented by equally distinct chains.Wrong. There was never a chainsplit or even a community split. Majority have so far always been on the singular chain which is called Bitcoin.never was a chainsplit?! oh no, you have caught the ignorant blind disease of the stupid bridage again. sorry to tell you this but there was a chain split.its not like BCH is a complete separate altcoin that had its own unique block 0 genesisIf I waste 1-2 hours of my life I can easily create a new shitcoin using the same Genesis block with the same blockchain and same everything else except a small change like having 10 MB blocks and a different difficulty adjustment policy (to make it easily mineable with CPU/GPU). Then I can start building new blocks on top of it, pay a CEX to list my coin calling it Bitcoin Pooya and start trading it there.Do you call that a chainsplit too?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 22, 2024, 08:58:23 AM",
      "body": "Quote from: pooya87 on March 22, 2024, 08:06:02 AMQuote from: franky1 on March 21, 2024, 04:16:01 PMQuote from: pooya87 on March 21, 2024, 10:25:10 AMQuote from: Pingu of Sealand on March 20, 2024, 09:53:24 PMDuring the Blocksize Wars, two distinct factions emerged, represented by equally distinct chains.Wrong. There was never a chainsplit or even a community split. Majority have so far always been on the singular chain which is called Bitcoin.never was a chainsplit?! oh no, you have caught the ignorant blind disease of the stupid bridage again. sorry to tell you this but there was a chain split.its not like BCH is a complete separate altcoin that had its own unique block 0 genesisIf I waste 1-2 hours of my life I can easily create a new shitcoin using the same Genesis block with the same blockchain and same everything else except a small change like having 10 MB blocks and a different difficulty adjustment policy (to make it easily mineable with CPU/GPU). Then I can start building new blocks on top of it, pay a CEX to list my coin calling it Bitcoin Pooya and start trading it there.Do you call that a chainsplit too?chain split is another name for a fork. and yes there was one in 2017weird that you can think there never was any of the sort..especially in regards to the events of 2017..a fork in the way you describe it, is not the only way one occurs.. but specifically the one you describe is usually orchestrated by a independent user doing their own change to be different than majority.. (unilateral is the cults buzzword(oops im overstepping the cult guide, ill get back to this word in a moment))a chainsplit is where a minority move to their own thing when a main chain has a change of its own that cause 2 directions(bilateral is the cults buzzword(oops im overstepping the cult guide, ill get back to this word in a moment))both are forks. but slight different ways they occuroops did i beat you to the punch of you wanting to call the event a bilateral fork for instead of a chainsplit... hmm i wonder why ud ever get angry about mentioning chain split but want to call it by something else.. oh wait, the old script narrative is circling again of echo chamber stupidity just to copy and paste a silly notion of buzzword gamery..sorry i stepped over your comments and beat you to the punch.. but yes there was a chainsplit no matter what you wanted to intend to call it instead to appease some relationship you are trying to develop with some idiot group of cultish people that dont even use blockdata or code to back up their notions of historic events but then later give in, give up, realise they are wrong, but to save face and not admit it,  give it some silly buzzword to pretend they are right by calling it something else to pretend they still stand by their own waste of time of arguing that there want a chain split by making up a new name for a chainsplit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "March 22, 2024, 09:02:17 AM",
      "body": "Talking only about offchain.Custody is good, it's the way I believe, and the way I trust.But it's overrated by some people who just have no understanding of the reality for millions of people. Who will never have enough to consider as savings enough to want full and only custody. Who benefit more from custodial of others.I have a hot wallet. Gambling. I prefer it sits there easy for me to use, I don't want to keep accessing cold wallet to deposit and withdraw after every single bet.If I could pay tips easy, I would too, hot wallet with lightning yes for sure.We're not talking about keeping even $1k, we're talking about $50. Some people will never understand this simple reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 22, 2024, 09:13:11 AMLast edit: March 22, 2024, 09:34:31 AM by franky1",
      "body": "Quote from: slaman29 on March 22, 2024, 09:02:17 AMIf I could pay tips easy, I would too, hot wallet with lightning yes for sure.We're not talking about keeping even $1k, we're talking about $50. Some people will never understand this simple reality.lightning is not the be-all end-all solution you think it is even its own developers point out many flaws even they cant fix which is where their work around is then to change LN's agenda goal into hubs of channel makers (factories/watchtowers/[insert buzzword of the month]) which users then rent/are given or offer msats(IOU) units peggedtt to btc at a rate that has changed*.. and settle up later.. turning LN into a credit card system of buy now pay later instead of a debit system of pay first delivery of goods later.. ttor where some lucky users that act as a multichannel hub lock up value as collateral to offer their own balance as loans(IOU for partners to owe/be owed, where it needs to settle/payback later)*an msat iou unit was 1000msat:1sat now its more zeros depth pegged iou unitsand thats before mentioning all the other flaws where LN just doesnt meet any of its old promises of being solutions to not require bitcoin to need to scale any time soon(funny part is the recruiters that want to drive idiots to LN dont even see the flaws and work arounds as they are to even spin them into possible positives of calling it a credit system as a feature.. you know turn a negative into a positive by offering LN as a credit facility of loans(f*ck did i just give them an idea and do their job for them..))i wont bore you with the other flaws. or we will just get the crybaby bridage playing victim again shouting insults because they dont like me pointing out the risk factors.. but there are many other risks. so dont rely on LN being the answer to all bitcoin things..that being said.. the future will see NEW(yet to be made) subnetworks for niche use cases that learn from the mistakes of LN and actually offer secondary options to bitcoin features.. but it is well worth you realising LN is not the solution you think it is, and LN devs admit it and are yet to offer anything different because their sponsorship deals were just to make and promote LN and that contract has yet to expire to allow them to escape endorsing LNand with that said bitcoin still does now and will need to scale even if new subnetworks that dont have LN flaws/features/work-around's are made. so lets not just pretend subnetworks are the only option.. bitcoin needs to scale too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 22, 2024, 09:38:27 AM",
      "body": "Quote from: Pingu of Sealand on March 21, 2024, 12:07:16 PMThank you all for the follow up.I'm going to answer to some of you.ABCbits - \"Mere copies? Ridiculous, many sidechain/L2 offer feature what Bitcoin doesn't.\"That's not what I said, the \"current system\" I'm referring in that specific quote is the FIAT system.I see. But your thread doesn't mention fiat, bank or government, so how would i know you refer to fiat system? Besides, only some sidechain/L2 are centralized or federated with only few members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 22, 2024, 11:01:05 AM",
      "body": "Quote from: franky1 on March 22, 2024, 08:58:23 AMchain split is another name for a fork.Wrong. Chain-split could be a subcategory of forks or at best you could call it one of the possible outcomes of forks. But they are not the same thing.A chain-split happens in a decentralized cryptocurrency when they can not reach consensus meaning when anything less than the decided percentage of the network (which is usually above 90%) didn't accept the change.This was never the case with SegWit since the majority voted for it.This was also not the case with Bcash since someone created the copy without needing to reach any kind of consensus. Something anybody can do at any time just as I pointed out in my example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}