{
  "id": "topic_5482080",
  "title": "Jiklojajsknm1990",
  "author": "Jiklojajsknm1990",
  "created_time": "January 18, 2024, 06:46:25 PM",
  "content": "Hello everyone, I'm new to cryptocurrency and I was able to earn 8,000$ in btc, and I keep all the money on binance, but I heard that binance blocks accounts. Please advise me of a reliable crypto wallet to store this money, who can recommend a really good wallet, I can transfer you 200$. Please write to my telegram @leaneek",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5482080",
  "comments": [
    {
      "author": "SatoPrincess",
      "created_time": "January 18, 2024, 06:54:25 PM",
      "body": "You’re right, centralized exchanges are not supposed to be used for storing bitcoins. Move your bitcoins from Binance to Electrum or Blue wallet. I don’t understand why you would add your telegram handle here and promise $200 for information you can easily google, all these looks suspicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "January 18, 2024, 06:54:38 PM",
      "body": "Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMHello everyone, I'm new to cryptocurrency and I was able to earn 8,000$ in btc, and I keep all the money on binance, but I heard that binance blocks accounts. Please advise me of a reliable crypto wallet to store this money, who can recommend a really good wallet, I can transfer you 200$. Please write to my telegram @leaneekElectrum would be enough.  Quote from: SatoPrincess on January 18, 2024, 06:54:25 PMYou’re right, centralized exchanges are not supposed to be used for storing bitcoins. Move your bitcoins from Binance to Electrum or Blue wallet. I don’t understand why you would add your telegram handle here and promise $200 for information you can easily google, all these looks suspicious. Bolded part, whenever i do hear about having those kind of contacting or having some need on dm'ming someone on something those informations that could be simply be searched out then its not something that you would really be needing to pay for. It doesnt make sense and just like you said that it is really just that too suspicious.  Speaking about security of funds then its never been that considerable on storing up your money on centralized platforms on which you dont possessits keys on which you are really that putting yourself at such great risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "January 18, 2024, 06:58:33 PM",
      "body": "What’s the use of your telegram? And also payment?If you’re really in need of a wallet and not here to draw people to telegram where you’ll most likely scam them, then I’d recommend you get a hardware wallet for yourself -> from your $8,000 you can get a very good hardware wallet.  [listt] Open Source Hardware Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "January 18, 2024, 07:01:47 PM",
      "body": "Go get a hardware wallet is my opinion, you don't need to wait for the amount to be much bigger before getting a hardware wallet. Wallet hack and drain has been happening too frequently and also happened to me, you can't be too careful. Buying a hardware wallet will save you from future pain. It doesn't cost much to get one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "January 18, 2024, 07:05:58 PM",
      "body": "Using cex account keep your coin not actually advisable. You can use it and to purchase any coin you wanna purchased and send them in any Dex account. Because leaving your funds in cex account is like leaving your funds on someone else's hands.There are various good bitcoin wallet you can store your asset we have.ElectrumBluewalletExodusMostly electrum is pretty great and also do your research about them too. And you don't have to pay anyone here for asking for help. Because one of the aim of the forum is to render help to those who need any assistance. Because here you can meet alot of pro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 18, 2024, 07:06:31 PM",
      "body": "I also recommend a hardware wallet. This website has quite a comprehensive comparison: https://thebitcoinhole.com/hardware-walletsI have, but no longer use, a Ledger, I recommend you find something else.Trezor is one of the oldest, hence it has passed the test of time.Coldcard and Passport are solid choices. However, I think that you should go for one that's open source and 100% airgapped, at least. Plus, read for others' opinions too.Stay safe and make sure the backup seed you'll also keep safe, as multiple copies in multiple locations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "January 18, 2024, 07:06:48 PM",
      "body": "Hey, you don't need to share your personal contact information here, because scammers would contact you with some phishing wallets. Just be cautious and remove your Telegram from your post to be safe. Whoever wants to help will comment on this thread. Don't follow any private message that isn't public. However, since you have a decent amount, I will strongly advise you to buy a hardware wallet that is open source. It doesn't cost a lot, but your funds will be secure. I had been using the Ledger wallet and am now moving to the Trezor wallet. So you might choose the Trezor Safe3 wallet. You don't need to pay anyone $200 for a wallet. Rather, just spend $80 to get a Trezor wallet. Don't forget to secure your seed in a safe place. It's advisable to write your seed on multiple pieces of paper and keep it safe in multiple places.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "January 18, 2024, 07:28:07 PM",
      "body": "Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMHello everyone, I'm new to cryptocurrency and I was able to earn 8,000$ in btc, and I keep all the money on binance, but I heard that binance blocks accounts. Please advise me of a reliable crypto wallet to store this money, who can recommend a really good wallet, I can transfer you 200$. Please write to my telegram @leaneekAs suggested buying a Hardware wallet is the best choice and if you are not willing to go for a hardware wallet then consider setting up an airgap device where you can install Electrum wallet and move your funds from the exchange to the wallet.Guide : Creating a Cold Storage wallet in Electrum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "January 18, 2024, 07:49:05 PM",
      "body": "Quote from: The Cryptovator on January 18, 2024, 07:06:48 PMHey, you don't need to share your personal contact information here, because scammers would contact you with some phishing wallets.I’m thinking OP may be a scammer. It’s unlike that someone would want to gift a stranger $200 for doing next to nothing. For the more trusting members of the forum, remember that there is no free lunch in this world. If it sounds too good to be true, it is not real. Anyone who is greedy enough to pm that telegram account will surely be roped into a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "January 18, 2024, 08:10:50 PM",
      "body": "You can use a cold wallet, or get yourself hardware wallet like Passport. You can setup a multisig wallet with hardware wallet and wallet like Sparrow or Electrum. Do not use online wallet if you can not afford to lose the coins. Use cold wallet. Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMPlease write to my telegram @leaneekYou are easily drawing scammers to yourself. Quote from: SatoPrincess on January 18, 2024, 06:54:25 PMYou’re right, centralized exchanges are not supposed to be used for storing bitcoins. Move your bitcoins from Binance to Electrum or Blue wallet. I don’t understand why you would add your telegram handle here and promise $200 for information you can easily google, all these looks suspicious. Worth knowing that $8000 should be kept on a cold wallet or cold wallet setup eith multisig wallet.Quote from: I_Anime on January 18, 2024, 07:05:58 PMUsing cex account keep your coin not actually advisable. You can use it and to purchase any coin you wanna purchased and send them in any Dex account. Because leaving your funds in cex account is like leaving your funds on someone else's hands.There are various good bitcoin wallet you can store your asset we have.ElectrumBluewalletExodusMostly electrum is pretty great and also do your research about them too. And you don't have to pay anyone here for asking for help. Because one of the aim of the forum is to render help to those who need any assistance. Because here you can meet alot of pro.Exodus is a close source wallet. Not recommended at all. Online wallet also not recommended unless you use them as a cold wallet on an airgapped device.Quote from: SatoPrincess on January 18, 2024, 07:49:05 PMI’m thinking OP may be a scammer. It’s unlike that someone would want to gift a stranger $200 for doing next to nothing. For the more trusting members of the forum, remember that there is no free lunch in this world. If it sounds too good to be true, it is not real. Anyone who is greedy enough to pm that telegram account will surely be roped into a scam.  I guess so as well. He may likely be a scammer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 18, 2024, 08:17:42 PM",
      "body": "Just like a few people have said, I still support what they have said concerning the hardware wallet. Hardware wallets are the best place to store huge amounts of bitcoin. It's more safe since it's not directly attached to your device (phone or laptop) all the time, just like you can have a normal software wallet just on your device. If you had $8000 on Binance Exchange, you should quickly get a hardware wallet and transfer your funds out of hardware.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "January 18, 2024, 08:20:48 PM",
      "body": "Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMHello everyone, I'm new to cryptocurrency and I was able to earn 8,000$ in btc, and I keep all the money on binance, but I heard that binance blocks accounts. Please advise me of a reliable crypto wallet to store this money, who can recommend a really good wallet, I can transfer you 200$. Please write to my telegram @leaneekYou are so desperate to lure people to Telegram and that is a red flag for me. You posted this enticing message with another brand new account telling people to visit this same telegram @leaneek. You are most likely not pure and people should be careful of you. If you are saying the truth in this post that you have such amount, you would have known how to go about the money because there is enough information about wallet in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "January 18, 2024, 08:20:56 PM",
      "body": "Quote from: Charles-Tim on January 18, 2024, 08:10:50 PMYou can use a cold wallet, or get yourself hardware wallet like Passport. You can setup a multisig wallet with hardware wallet and wallet like Sparrow or Electrum. Do not use online wallet if you can not afford to lose the coins. Use cold wallet. Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMPlease write to my telegram @leaneekYou are easily drawing scammers to yourself. Quote from: SatoPrincess on January 18, 2024, 06:54:25 PMYou’re right, centralized exchanges are not supposed to be used for storing bitcoins. Move your bitcoins from Binance to Electrum or Blue wallet. I don’t understand why you would add your telegram handle here and promise $200 for information you can easily google, all these looks suspicious. Worth knowing that $8000 should be kept on a cold wallet or cold wallet setup eith multisig wallet.Quote from: I_Anime on January 18, 2024, 07:05:58 PMUsing cex account keep your coin not actually advisable. You can use it and to purchase any coin you wanna purchased and send them in any Dex account. Because leaving your funds in cex account is like leaving your funds on someone else's hands.There are various good bitcoin wallet you can store your asset we have.ElectrumBluewalletExodusMostly electrum is pretty great and also do your research about them too. And you don't have to pay anyone here for asking for help. Because one of the aim of the forum is to render help to those who need any assistance. Because here you can meet alot of pro.Exodus is a close source wallet. Not recommended at all. Online wallet also not recommended unless you use them as a cold wallet on an airgapped device.Quote from: SatoPrincess on January 18, 2024, 07:49:05 PMI’m thinking OP may be a scammer. It’s unlike that someone would want to gift a stranger $200 for doing next to nothing. For the more trusting members of the forum, remember that there is no free lunch in this world. If it sounds too good to be true, it is not real. Anyone who is greedy enough to pm that telegram account will surely be roped into a scam.  I guess so as well. He may likely be a scammer yeah I think you right, in the scamming part because nobody just come for no where, that his new in cryptocurrencies and was able to earn such huge amount of money, who also found that weird and suspicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "January 18, 2024, 08:45:09 PM",
      "body": "Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMHello everyone, I'm new to cryptocurrency and I was able to earn 8,000$ in btc, and I keep all the money on binance, but I heard that binance blocks accounts. Please advise me of a reliable crypto wallet to store this money, who can recommend a really good wallet, I can transfer you 200$. Please write to my telegram @leaneekIt does not matter how much money you have, you can store them in any noncustodial wallet, if you are planning to hold for a longer period of time then I suggest you should use Electrum due to many reasons, first it is noncustodial, as you own the key thus you own the funds fully and can do whatever you want anytime, second, electrum is open source, unlike other noncustodial wallets like Trustwallet which is not fully open source. Third, Electrum does not block accounts unless you do some stupid shit from your end.And I suggest you to withdraw funds from Binance not because Binance blocks accounts as if you have done the KYC then they have no reason to block your account until you have done some illicit activity. I am saying this because Binance is facing a lot of trouble like in Indian Binance along with other 8 exchanges is banned and Indians can't access it directly. US authorities are behind Binance and they want it to vanish from the market, so it would be best for you to avoid using Binance for holding purposes, but if you want to do trading then I won't stop you using it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "steamon",
      "created_time": "January 18, 2024, 08:48:50 PM",
      "body": "I would just get a Ledger Nano S plus if its BTC only you can get a ColdCard mk4 that is even better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "January 18, 2024, 08:56:42 PM",
      "body": "I'd take my money off exchanges ASAP and simply get a desktop wallet like Electrum. Heard a lot of good things about Sparrow and Blue Wallet too, so choose the one you like more visually. Make sure your device is clean of any malware. You don't want to move your coins into the hands of someone who's running remote desktop or a keylogger on your computer, right?Also, don't tell people how much money you have. I don't mean this thread, but I get the impression that you might go around asking people where to put your 8k to make it safe. Just tell people you have a little bitcoin to try it out and want to put it somewhere safe, don't go into numbers straight away.Quote from: steamon on January 18, 2024, 08:48:50 PMI would just get a Ledger Nano S plus if its BTC only you can get a ColdCard mk4 that is even better.Holding on Ledger is pretty much like using a centralized exchange. It's a false feeling of safety. If you're looking for something cheap, Get Trezor One. It costs $60 or something like that. Blockstream Jade is around $100. Both of these are better than Ledger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "January 18, 2024, 09:01:04 PM",
      "body": "Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMHello everyone, I'm new to cryptocurrency and I was able to earn 8,000$ in btc, and I keep all the money on binance, but I heard that binance blocks accounts. Please advise me of a reliable crypto wallet to store this money, who can recommend a really good wallet, I can transfer you 200$. Please write to my telegram @leaneekNot just Binance, all centralized exchanges are not reliable to such huge amount of money because you are not in control of your bitcoin if you hold it there \"not your keys, not your coins\".You can use Electrum wallet or blue wallet to hold your bitcoin.You are not supposed to share any of your identity here, and you don't have to pay for any recommendation.Avoid revealing your private key with anyone in your PM because if anyone have your private key, they can move anything out of your wallet without your consent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "January 18, 2024, 09:03:22 PM",
      "body": "Quote from: darkangel11 on January 18, 2024, 08:56:42 PMHolding on Ledger is pretty much like using a centralized exchange. It's a false feeling of safety. If you're looking for something cheap, Get Trezor One. It costs $60 or something like that. Blockstream Jade is around $100. Both of these are better than Ledger.Yup. Many state that it is risky to store large amounts of crypto assets on Ledger, it is said that Ledger is open source. It's better to keep it on Trezor, this recommendation is also voiced by many members here. If you haven't had time to buy a hardware wallet, maybe OP can use the Electrum mobile wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "January 18, 2024, 09:06:28 PM",
      "body": "Quote from: Jiklojajsknm1990 on January 18, 2024, 06:46:25 PMHello everyone, I'm new to cryptocurrency and I was able to earn 8,000$ in btc, and I keep all the money on binance, but I heard that binance blocks accounts. Please advise me of a reliable crypto wallet to store this money, who can recommend a really good wallet, I can transfer you 200$. Please write to my telegram @leaneekWell you can separate it to Electrum for your daily trading activities, and then Hardware wallet for long term storage. That is a huge money to begin with, might be better if you really take it out from exchange. Even if it is Binance, they can still confiscate your Bitcoin, as what we say here, \"not your keys', not your coins\".For hardware wallets, there are 2 best options.https://trezor.io/https://www.ledger.com/Electrum can be download here: https://electrum.org/#download",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}