{
  "id": "topic_5456290",
  "title": "cygan",
  "author": "cygan",
  "created_time": "June 14, 2023, 07:16:54 AM",
  "content": "my forum search for this wallet was negative, so now i want to open this thread and introduce you to another lightning wallet this is the LifPay wallet in which you can set your name in email form as your lightning address, i.e. your_name@lifpay.methe app is available for both mobile os and can be downloaded from the official website: https://lifpay.me/en/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456290",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "June 14, 2023, 09:36:07 AM",
      "body": "Woow layer-3 application   since I was enthusiastic about the tipping[1] service and turned to scam, I no longer trust centralized services built on top of the Lightning network.QuoteThe fee is usually less than 1% of the total amount being transferred. If you transfer to the Bitcoin network address, we will charge a 5000 sats base fee + a miner fee.The way they introduce the fees is not that of someone with in-depth knowledge of Bitcoin, it's the first time I've heard of Bitcoin transaction fees for transaction volume i.e. total amount being transferred or why the wallet asks for a fee besides mining fees.QuoteIs our wallet custodial?Yes, because we want to make Bitcoin and Lightning Network accessible to the general public around the world. Therefore, the current LifPay design without people owning their node is the best way we can think of to encourage as many people as possible to join the Lightning Network. Custodial wallet , there is no reason to use them, we have better open source options.[1] Bitcoin Tipping Service on Twitter is a Scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "June 14, 2023, 11:50:24 PM",
      "body": "This is a dangerous path. Anything that's in centralized hands but seemingly makes using lightning or any Bitcoin tech easier to use can be harmful for newbies. The email idea is appealing, but at the same time you put all your trust into a centralized entity - not worth the tradeoff at all.https://walletscrutiny.com/android/flutter.android.LifePay/ - less than 100 downloads to far and no rating. I would assume it will rate very low, though, if tested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 15, 2023, 09:10:35 AM",
      "body": "Quote from: Kryptowerk on June 14, 2023, 11:50:24 PMhttps://walletscrutiny.com/android/flutter.android.LifePay/ - less than 100 downloads to far and no rating. I would assume it will rate very low, though, if tested.Paying by email will not be of useful due to the small number of downloads and the other party needs to create an account with that wallet to be able to withdraw money. It's likened to centralized services like Kucoin pay to another Kucoin account.Using it as a wallet is not meaningful due to the high transaction fees and the fact that it is a closed source wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 15, 2023, 09:12:58 AM",
      "body": "Aside from custodial gripe in this thread, why only for mobile ??Maybe it's just easier for these people to make mobile apps than desktop applications? I don't know. But the app stores are already saturated with bitcoin LN mobile wallets, so if someone really wants to stand out, they should make a desktop solution as well. It could actually be easier even, as desktop apps have the capability to run in the background.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "June 15, 2023, 01:24:53 PM",
      "body": "I have a feeling that this app is not a true Lightning Network integration, they mentioned Transaction data sync between web and LifPay App I don't understand what they mean and there is no option to connect your own node.They made me ask more questions than they offered solutions.Quote from: NotATether on June 15, 2023, 09:12:58 AMAside from custodial gripe in this thread, why only for mobile ??Lightning network applications are always for daily payment with those small amounts that you pay to buy a coffee or a book, so it is illogical for development to be a basis for desktop interfaces, mostly development as points of sale or for mobile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "June 15, 2023, 02:56:53 PM",
      "body": "Quote from: Yamane_Keto on June 15, 2023, 01:24:53 PMI have a feeling that this app is not a true Lightning Network integrationAccording to the FAQ [1], They integrated it for sending to third party LN wallets, but still they are centralized and they may hold your orders.Quotethey mentioned Transaction data sync between web and LifPay App I don't understand what they meanI think that means if you login[2] on web version you can see a reflection of all the data that is on the apps version.1. https://lifpay.me/en/#:~:text=What%20are%20the%20fees%20for%20each%20transaction%3F2. https://lifpay.me/en/login",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 15, 2023, 03:29:24 PM",
      "body": "Quote from: hugeblack on June 15, 2023, 09:10:35 AMQuote from: Kryptowerk on June 14, 2023, 11:50:24 PMhttps://walletscrutiny.com/android/flutter.android.LifePay/ - less than 100 downloads to far and no rating. I would assume it will rate very low, though, if tested.Paying by email will not be of useful due to the small number of downloads and the other party needs to create an account with that wallet to be able to withdraw money. It's likened to centralized services like Kucoin pay to another Kucoin account.Using it as a wallet is not meaningful due to the high transaction fees and the fact that it is a closed source wallet.The pay by address is just a regular lightning address telling someone to send to davef@wherever.com is a lot easier then telling them to send to a long lnurl Looking at it, it's very similar to wallet of satoshi. Yes it's custodial, but as I like to point out ANY funds on your phone are not secure so you should not have that much in it anyway. So yes it's bad, and not your keys not your coins. But it's another LN wallet out there and that is a good thing.As for people running their own LN node, yeah I do it and so do a lot of other people here, but we are edge cases. Most people just want things to work magically in the background and don't want to know how or why.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "June 16, 2023, 03:05:23 PM",
      "body": "I am from the $3.1 trillion economy, and these wallets will, or rather Bitcoin Lightning Network will grow when the two countries create an ecosystem to thrive Bitcoin and its layer. The first is India and the second is China, the US under the present administration is handicapped.I want to try LifPay, my problem is where should I use it. Some of you might suggest using it online. The answer is I can't & I won't as I want to practically experience instant gratification by using this service at a retail store. I do not think it will happen soon, when it happens, I too would be able to write a review with all the pros and cons. At the moment all your replies are jargon for me except the basics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "June 17, 2023, 02:09:53 AM",
      "body": "Quote from: Bureau on June 16, 2023, 03:05:23 PMSome of you might suggest using it online. The answer is I can't & I won't as I want to practically experience instant gratification by using this service at a retail store.Yes, it has to be online as the first condition for interacting with LN channels but we also don't recommend using this wallet due to its centralized nature.I don't know if there is an offline method out there where this wallet also allows to do that (I don't think so).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "June 17, 2023, 02:38:55 AM",
      "body": "Quote from: Bureau on June 16, 2023, 03:05:23 PMI want to try LifPay, my problem is where should I use it. Some of you might suggest using it online. The answer is I can't & I won't as I want to practically experience instant gratification by using this service at a retail store.It is not necessary that you can buy and pay for digital products using Lightning Network, and you can exchange it to cash with platforms that accept LN payment or online shopping, not necessarily only with retail stores.Quote from: rat03gopoh on June 17, 2023, 02:09:53 AMI don't know if there is an offline method out there where this wallet also allows to do that (I don't think so).This can be done using invoice expires for a specific time, as the routing node allows for delayed payment as long as the validity of that invoice continues. This service can be for users who frequent the store or know them personally.Cheap, offline(!), DIY bitcoin lightning-network PoS https://github.com/arcbtc/LNURLPoS",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "June 18, 2023, 03:23:00 PM",
      "body": "Quote from: Yamane_Keto on June 17, 2023, 02:38:55 AMQuote from: Bureau on June 16, 2023, 03:05:23 PMI want to try LifPay, my problem is where should I use it. Some of you might suggest using it online. The answer is I can't & I won't as I want to practically experience instant gratification by using this service at a retail store.It is not necessary that you can buy and pay for digital products using Lightning Network, and you can exchange it to cash with platforms that accept LN payment or online shopping, not necessarily only with retail stores.Now, this is what I said, right! I know we can use it for online payment. What I need is to use it effectively while at a point of sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "June 18, 2023, 11:12:13 PM",
      "body": "Quote from: Yamane_Keto on June 17, 2023, 02:38:55 AM[...]This can be done using invoice expires for a specific time, as the routing node allows for delayed payment as long as the validity of that invoice continues. This service can be for users who frequent the store or know them personally.Cheap, offline(!), DIY bitcoin lightning-network PoS https://github.com/arcbtc/LNURLPoSThat's a pretty slick creation right there. Amazing what is available if you know where to look. Any real-life experience with this LN-PoS system? Did a quick search for a bitcointalk thread but didn't find anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 19, 2023, 02:10:59 PM",
      "body": "Quote from: Kryptowerk on June 18, 2023, 11:12:13 PM...That's a pretty slick creation right there. Amazing what is available if you know where to look. Any real-life experience with this LN-PoS system? Did a quick search for a bitcointalk thread but didn't find anything.I made one (it's dead simple) and used it a couple of times it does work, but unless you NEED it, there are better solutions to do it.But, for offline generation or demo or things like that it does work.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 21, 2023, 09:53:05 AM",
      "body": "Quote from: Yamane_Keto on June 15, 2023, 01:24:53 PMLightning network applications are always for daily payment with those small amounts that you pay to buy a coffee or a book, so it is illogical for development to be a basis for desktop interfaces, mostly development as points of sale or for mobile.Yes, the Lightning Network is for daily payments in small amounts, but we need the desktop version as well. It is not necessary to use it for daily payment in stores only, there are other uses that we need.If we want to move to the full use of the Bitcoin Lightning Network, we have to cover all aspects, for example depositing in centralized exchanges, a large number of which now accept deposits and withdrawals through the Bitcoin Lightning Network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}