{
  "id": "topic_5472661",
  "title": "Krispr",
  "author": "Krispr",
  "created_time": "November 03, 2023, 05:28:01 AM",
  "content": "Hi, I have a ledger nano wallet (the one that existed before the ledger nano s) lying around at home, which is still in its original sealed packaging. Is this wallet worth anything? (Collectible?) Are sealed \"older\" hardwarewallets considered collectibles?Many thanks for any answers!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472661",
  "comments": [
    {
      "author": "dkbit98",
      "created_time": "November 03, 2023, 02:41:53 PM",
      "body": "Quote from: Krispr on November 03, 2023, 05:28:01 AMHi, I have a ledger nano wallet (the one that existed before the ledger nano s) lying around at home, which is still in its original sealed packaging. Is this wallet worth anything? (Collectible?) Are sealed \"older\" hardwarewallets considered collectibles?Is this the ledger wallet you own?They are considered collectibles, especially if they are rear, unique or discontinued, and ledger have a lot of discontinued crap.I personally wouldn't pay a single sat for ledger nano (maybe other people would pay) but I am not sure if it still works with old Electrum wallet. Note that this device should NOT be used for storing any real coins!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Krispr",
      "created_time": "November 04, 2023, 12:03:37 PM",
      "body": "Thanks for your reply! Yes that's it. https://i.ibb.co/g4dpdcF/IMG-20231104-130222197.jpgNo, I wouldn't use this device, even if it would be usable.I haven't seen one being sold or on auction on ebay or bitcointalk. Can I find a price estimate for it somewhere?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "November 04, 2023, 01:43:11 PM",
      "body": "Quote from: Pamparadolius on November 04, 2023, 01:20:59 PMOld Ledger Nano wallets can sometimes be considered collectibles by crypto enthusiasts and collectors. The value might depend on the demand from collectors, but it's worth checking out online marketplaces like eBay to see if there's any interest.50 - 100 USD I'd guess, as it is one of the first HW wallets I believe.  Maybe less, not sure, but I won one in a raffle here a few years ago. Nobody would buy to use it, just leave it sealed and in a few more years, it will be worth a lot more IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alterra57",
      "created_time": "November 04, 2023, 10:31:48 PM",
      "body": "How much?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "November 05, 2023, 02:23:10 AM",
      "body": "I would pay $50 its the 2nd or 3rd ledger made, unless I am mistaken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "December 17, 2023, 10:29:59 AM",
      "body": "Quote from: Krispr on November 03, 2023, 05:28:01 AMHi, I have a ledger nano wallet (the one that existed before the ledger nano s) lying around at home, which is still in its original sealed packaging. Is this wallet worth anything? (Collectible?) Are sealed \"older\" hardwarewallets considered collectibles?Many thanks for any answers!I have been around the space enough to know that a wallet is a very senitive instrument whennit comes to finance and should be treated with care and kept personal. I have not seen the posssibility of getting a wallet and still hoping that the same wallet is 100 percent safe. I will not advice anyone to buy into the wallet that has been unboxed let alone a walle that has stayed around a person for a while, it might be compromised already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "December 31, 2023, 09:44:26 PM",
      "body": "Quote from: Krispr on November 03, 2023, 05:28:01 AMHi, I have a ledger nano wallet (the one that existed before the ledger nano s) lying around at home, which is still in its original sealed packaging. Is this wallet worth anything? (Collectible?) Are sealed \"older\" hardwarewallets considered collectibles?Many thanks for any answers!After all of this crazy string of events w/ the dapps I'm sure that these wallets have lost a lot of users, but from a collectible standpoint I don't see why something like that wayyyy down the line couldn't be worth a whole heck of a lot more simply because there are few going to be left in this condition in existence. Hang on to it m8! Maybe they can use it in your local crypto museum some day in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}