{
  "id": "topic_5426798",
  "title": "trytrades69",
  "author": "trytrades69",
  "created_time": "December 08, 2022, 07:38:29 AM",
  "content": "Previously, Telegram required users to provide a phone number to register on its platform. Currently, that requirement has been removed. In its latest update, telegram allows users to register through an anonymous blockchain-based number available on the Fragment platform. If you want to create a new account without your phone number, you can visit the Fragment platform and buy an anonymous number with Toncoins for $16. Furthermore, you can use this number to register and will get a verification code through the Fragments platform.Read more : https://trynews.id/telegram-meluncurkan-nomer-berbasis-blockchain/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426798",
  "comments": [
    {
      "author": "Edwardard",
      "created_time": "December 08, 2022, 07:58:49 AM",
      "body": "This news seems real. But not sure about the level of  privacy we get with these anonymous numbers. Are they safe just like our normal number?? However, imo they should have launched email based signups, more convenient and better.Or Are they planning for \"Toncoin to the moon\" effect ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 08, 2022, 08:18:00 AM",
      "body": "Quote from: Edwardard on December 08, 2022, 07:58:49 AMThis news seems real. But not sure about the level of  privacy we get with these anonymous numbers. Are they safe just like our normal number?? $16 sounds expensive just to get a phone number so I'd hope something like that was secure. I've seen hosting providers charge that as an annual rental of a static IP address too so perhaps that's how much each cost.And I do think email would be superior to both of these too but perhaps there's an app you have to install with the number that makes it a bit more secure than a passworded email in some cases (like when users pick bad passwords).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "December 08, 2022, 08:51:40 AM",
      "body": "I've seen those websites that do offer free numbers for free but they're just like one time registration. So, if this is going to be like a permanent number that you can use for such verifications and accounts, I think that it depends now to the person who would like to avail it and sees it as an investment.This could be useful for specific uses and people working for some industries that would require them not their real numbers but would like to have a permanent one for specific cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "December 08, 2022, 12:14:06 PM",
      "body": "Quote from: ETFbitcoin on December 08, 2022, 09:13:56 AMFew media even claim it only can be used on Telegram[2-3].Yes, it's only can be used for \"Telegram\".It's a new feature from \"Fragment\", last time they opened an auction for Usernames and now \"Phone Number\" is the new thing from them. More information about \"Fragment\" can be found in here: https://fragment.com/about",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 08, 2022, 12:31:40 PM",
      "body": "Quote from: jackg on December 08, 2022, 08:18:00 AMQuote from: Edwardard on December 08, 2022, 07:58:49 AMThis news seems real. But not sure about the level of  privacy we get with these anonymous numbers. Are they safe just like our normal number?? $16 sounds expensive just to get a phone number so I'd hope something like that was secure. I've seen hosting providers charge that as an annual rental of a static IP address too so perhaps that's how much each cost.And I do think email would be superior to both of these too but perhaps there's an app you have to install with the number that makes it a bit more secure than a passworded email in some cases (like when users pick bad passwords). There are many services that will allow you to register telegrams and accounts of other popular messengers for 0.1-2 dollars, depending on the chosen country. But on average, it costs no more than $ 1.And any wallet that is connected to the phone is either not secure or not confidential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}