{
  "id": "topic_5427994",
  "title": "Gregy Fur",
  "author": "Gregy Fur",
  "created_time": "December 12, 2022, 10:26:05 AM",
  "content": "ETH Holders To Get Max Pain By DecemberSince the crypto market has faced many impactful events that have plunged numerous digital assets to the bottom. As per Coinpedia, the second largest cryptocurrency, Ethereum(ETH), accelerates its bearish trend because its price seems to be affected mainly by huge fund movements by whale holders.As reported by Coinpedia, the FTX hacker who stole around $600 million from the crashed crypto exchange is constantly swapping stolen Ethereum for cash-out purposes. It has been said that the hacked swapped across 15K Ethereum in exchange for renBTC, which further converted into 1023.64 BTC.Following the huge liquidation of Ethereum, the asset is trading in a crucial fear zone, which may shortly trigger a sharp decline in the ETH price chart. Furthermore, during the ongoing dump situation, the DeFi activity on Ethereum has declined rapidly because DefiLlama displayed that the total value locked in dApps on Ethereum dropped by 4% to $23.8B.Coinpedia believes that, if the hacked cashes out all his ETH Holdings, then ETH may continue its death rally further and fall below its crucial support zone of $1,075. After that, the price of ETH will likely stabilize closer to $900 before igniting a fresh surge by the beginning of 2023.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427994",
  "comments": [
    {
      "author": "jossiel",
      "created_time": "December 12, 2022, 10:51:53 AM",
      "body": "That is for sure when someone dumps a huge amount of Ethereum then the market will react and it's going to be down. Bitcoin's price went a little bit low this day and the other alts will obliged to follow that eventually.But whenever there's a huge sell off, there is no doubt that the market will have to react too just as what they do whenever bitcoin is down. So, if those Ethereum from the FTX hacker cashes out, we'll see more bloods in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "December 12, 2022, 11:12:08 AM",
      "body": "Quote from: Gregy Fur on December 12, 2022, 10:26:05 AMCoinpedia believes that, if the hacked cashes out all his ETH Holdings, then ETH may continue its death rally further and fall below its crucial support zone of $1,075. After that, the price of ETH will likely stabilize closer to $900 before igniting a fresh surge by the beginning of 2023.That was their assumption and no way I have to believe that either. Because I'd never think that these people (hackers) will tend to drop their ETH at the same time together, in fact, we never know their plan and also Coinpedia. I believe there might be a huge drop this month but never I think this is because of them. Whales are not panic sellers, they are pertained to hold even longer so selling this bear season wasn't in my view as they also waiting for the right time to sell. I think you can post the link so we can verify it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 12, 2022, 11:38:42 AM",
      "body": "Why do people think a mass liquidation means a big dump?  The hacker can swap, wait, repeat.  There is no need to dump every thing at once and if over 1,000 Bitcoin worth of Ethereum did not crash the Ethereum price yet, why would it soon.  If they dump every Ethereum at once they would lose a lot.  Small trades is a better choice and it seems like the hacker is doing just that.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "December 12, 2022, 12:52:19 PM",
      "body": "It may or may not happen. These are just speculations and scenarios that aren’t guaranteed at all. Of course, the entire market may go another round of crash if that hacker cashes out all of that ETH, but also an opportunity for those who are shorting it and waiting to buy at a discount price. I’m an ETH holder myself, but I would just hang on to it as I still continue doing DCA with it along with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "December 12, 2022, 01:00:05 PM",
      "body": "Too bad, they haven't managed to track those scammers and now the legit companies and investors are suffering from their evil doings. This isn't good for the crypto market because this will become evidence of the super-volatility of whatever coins you are holding. You wouldn't be get helped by other coins as well because they are also experiencing the same negative impact by these crooks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 12, 2022, 01:33:59 PM",
      "body": "Does the authority find out the hacker? Some say that this is an inside job to fully exited with funds some of the FTX management but there is no crystal evidence of this.But if the said hacker would dumped it continously then you are right. But for sure he wanted to liquidate that on a good price as well so definitely he wouldnt do that. If I were him, just hold since it bear market no one want a penny than a dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}