{
  "id": "topic_5471708",
  "title": "Iamcrypticguy",
  "author": "Iamcrypticguy",
  "created_time": "October 26, 2023, 07:38:01 AM",
  "content": "The recent surge in BTC to the $35k region has led many to believe that the bull market is back. Some analysts believe this is just the effect of historical October patterns, and we may see a significant pullback for accumulation and liquidity purposes before the bull season kicks off. I'm confused, which is why I'm here. What's your opinion, fellow traders?\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471708",
  "comments": [
    {
      "author": "_act_",
      "created_time": "October 26, 2023, 07:44:49 AM",
      "body": "According to what I read, bitcoin ETF may not be approved until next year January, I am not seeing any bull run again for now but neither expecting a significant drop. If there would be a significant drop in bitcoin price, I am expecting it next year, but spot bitcoin ETF may not let that happen. Some analysts on this forum are expecting $40000, but no one know if that would be possible. If the question is about buying bitcoin, yes buying bitcoin is still not late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iamcrypticguy",
      "created_time": "October 26, 2023, 07:46:47 AM",
      "body": "Quote from: _act_ on October 26, 2023, 07:44:49 AMAccording to what I read, bitcoin ETF may not be approved until next year January, I am not seeing any bull run again for now but neither expecting a significant drop. If there would be a significant drop in bitcoin price, I am expecting it next year, but spot bitcoin ETF may not let that happen. Some analysts on this forum are expecting $40000, but no one know if that would be possible. If the question is about buying bitcoin, yes buying bitcoin is still not late.Why are u expecting a drop next year?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "October 26, 2023, 07:53:00 AM",
      "body": "Quote from: _act_ on October 26, 2023, 07:44:49 AMAccording to what I read, bitcoin ETF may not be approved until next year January, I am not seeing any bull run again for now but neither expecting a significant drop. If there would be a significant drop in bitcoin price, I am expecting it next year, but spot bitcoin ETF may not let that happen. I share the same sentiment; it seems too hasty for the SEC to approve Bitcoin either this year or by January 2024. Over the past few hours, it appears that the pumping momentum has ceased, and the current price is struggling to surpass the previous swing. I have a hunch that BTC will establish a price range to define support and resistance levels. It's possible that Bitcoin will be in search of a new breakthrough while we keep a close eye on its direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "October 26, 2023, 07:54:19 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:38:01 AMThe recent surge in BTC to the $35k region has led many to believe that the bull market is back. Some analysts believe this is just the effect of historical October patterns, and we may see a significant pullback for accumulation and liquidity purposes before the bull season kicks off. I'm confused, which is why I'm here. What's your opinion, fellow traders?\"My opinion is that it's anyone's guess for the short to mid term, but I believe that the long term will include higher prices than we see right now. The short term provides two possibilities, one being a major event involving whales/institutions that capitulates on the current high prices. The other being that the excitement for the progress of the ETF is the catalyst that starts the bull run early. I think the latter is what everyone would least expect, and many are probably still in disbelief, so it could be the more likely outcome when it comes to benefiting whales the most and keeping market participants from benefiting from the run. Whichever way it goes, the fun is only beginning! Buckle up!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "October 26, 2023, 07:54:25 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:38:01 AMThe recent surge in BTC to the $35k region has led many to believe that the bull market is back. Some analysts believe this is just the effect of historical October patterns, and we may see a significant pullback for accumulation and liquidity purposes before the bull season kicks off. I'm confused, which is why I'm here. What's your opinion, fellow traders?\"This is not a bull season definitely to be honest. This is just a price hike due to the traders keeping more demand to buy the coin. The traders know that the bull season is near, so definitely they are trying to buy the coins now in current price which is more cheaper than the actual worth of Bitcoins. As they are increasing the demand to accumulate the coins and we know that Bitcoins are limited in number, hence to fulfil the demand, this is a sudden price hike.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 26, 2023, 08:09:04 AM",
      "body": "It has not arrived yet and what we were seeing is due first to the fake news about the bitcoin etf approval. Next, is about the IBTC ticker which hasn't confirmed yet. But if we are going to connect all of these, they are likely about to get for real.Now the thing is, how long we are going to wait until the bull run happens. Indication wise, after the halving. That is safe to say that  the bull run will start from there but, we can be wrong from that point and it could happen any moment from now on.And with the recent rise that we have seen lately, corrections are about to happen but it cannot be as big as the recent pump we witnessed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 26, 2023, 08:09:52 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:38:01 AMThe recent surge in BTC to the $35k region has led many to believe that the bull market is back. Some analysts believe this is just the effect of historical October patterns, and we may see a significant pullback for accumulation and liquidity purposes before the bull season kicks off. I'm confused, which is why I'm here. What's your opinion, fellow traders?\"I don't think that the bull run has started, maybe this is just a preamble of what we will expect next year. And what makes next year unique is that we are expecting two significant events which are the Bitcoin halving and spots Bitcoin ETF. The SEC's decision on the approval is unpredictable so it might not be proper to depend on their approval to make predictions. However, I expect the price of Bitcoin to get to its highest past price or even greater than that. I will suggest that you trade with caution because the market is highly unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "October 26, 2023, 08:12:50 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:46:47 AMWhy are u expecting a drop next year?What I meant is that a price drop may begin early next year, but spot bitcoin ETF will not let that happen if it is approved early next year. But if not early approved and there is a small drop, bitcoin halving will come and that would lead to a significant bull run. The fall I am talking about is before halving but which bitcoin spot ETF may not let happy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 26, 2023, 08:14:55 AM",
      "body": "Quote from: _act_ on October 26, 2023, 08:12:50 AMQuote from: Iamcrypticguy on October 26, 2023, 07:46:47 AMWhy are u expecting a drop next year?What I meant is that a price drop may begin next year, but spot bitcoin ETF will not let that happen if it is approved early next year. But if not early approved and there is a small drop, bitcoin halving will come and that would lead to a significant bull run. Federal agencies are like dinosaurs when it comes to making decisions, so don't be surprised when they move very slowly with the approval process. Also, the SEC is not in a rush to approve any Bitcoin ETF, so all this price rising and hype surrounding ETFs is premature, and it will potentially cause a bunch of mini-hikes and mini-dips for the next year (or at least several months).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "October 26, 2023, 08:44:10 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:38:01 AMThe recent surge in BTC to the $35k region has led many to believe that the bull market is back. Some analysts believe this is just the effect of historical October patterns, and we may see a significant pullback for accumulation and liquidity purposes before the bull season kicks off. I'm confused, which is why I'm here. What's your opinion, fellow traders?\"If you are a long-term investor, you should continue to accumulate and if the bull season comes, sell when you reach your goal. If you are a short-term trader, I think it is never wrong to take profits when we have made significant profits. Personally, I close most of the long orders opened the previous day and what I do is wait for the market to correct to find a suitable buy point. Of course, I also have a separate long-term bitcoin accumulation, but I wouldn't accumulate more at this price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "October 26, 2023, 08:51:38 AM",
      "body": "Quote from: sunsilk on October 26, 2023, 08:09:04 AMIt has not arrived yet and what we were seeing is due first to the fake news about the bitcoin etf approval. Next, is about the IBTC ticker which hasn't confirmed yet. But if we are going to connect all of these, they are likely about to get for real.Now the thing is, how long we are going to wait until the bull run happens. Indication wise, after the halving. That is safe to say that  the bull run will start from there but, we can be wrong from that point and it could happen any moment from now on.And with the recent rise that we have seen lately, corrections are about to happen but it cannot be as big as the recent pump we witnessed.Bitcoin will increase according to the previous halving data, but we can't know for sure that it will be bullish. Usually, Bitcoin starts its upward movement before the Halving date approaches, and with the Halving, more investors enter the market.However, I think this halving will be different from others and I would say that fundamental analysis is more important than technical analysis for Bitcoin. The Etf approval, the market maker decisions made by the US institutions about Bitcoin, especially the FED's decisions, the recent wars in the Middle East and the Black Sea region show that the price of Bitcoin may rocket earlier than expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 26, 2023, 09:16:10 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:38:01 AMSome analysts believe this is just the effect of historical October patterns, and we may see a significant pullback for accumulation and liquidity purposes before the bull season kicks off. I'm confused, which is why I'm here. What's your opinion, fellow traders?\"I think Bitcoin price movement is nothing you should be confused about; all you need is to have a target price for which you wish to sell your asset, then sit back and hold it until your desired price is reached. If you are also in the process of still accumulating your coins, then you should apply the DCA strategy, depending on whether the price will still bounce back.IMO, the sudden jump in price is not a surprise; perhaps the price has sat so low for more than one month too, and even if the price drops before properly going up again for the bull market, it's still not a bad thing. If you are buying, apply the DCA strategy, and if you are selling, wait more until the market is very bullish; maybe it surpasses the last ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "October 26, 2023, 10:33:54 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:38:01 AMThe recent surge in BTC to the $35k region has led many to believe that the bull market is back. Some analysts believe this is just the effect of historical October patterns, and we may see a significant pullback for accumulation and liquidity purposes before the bull season kicks off. I'm confused, which is why I'm here. What's your opinion, fellow traders?\"You have already the main 2 answers to your question that indeed it may be the effect of October pump that we already seen many years now and the coming is full back , or  this is the beginning of the Bull season though I doubt the second because as we know , Halving is near to come so basically the market shows dumping when this comes closer, and since it will come on April , there must be a dump coming either next month or at least early next year.better be ready and hold on , add more coins as needed and you can risk , also sell high now if you believe in the sooner dump.BTCtickers down$34,442 price is up today, rising to an intra-day high of $35,121. The Bitcoin price increase today comes as hype around a spot BTC exchange-traded fund (ETF) resulted in an increase in spot and CME BTC volumes and this bullish momentum continues to push prices across the crypto market higher. according to Cointelegraph https://cointelegraph.com/news/why-is-bitcoin-price-up-today",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ayers",
      "created_time": "October 26, 2023, 10:47:09 AM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:46:47 AMQuote from: _act_ on October 26, 2023, 07:44:49 AMAccording to what I read, bitcoin ETF may not be approved until next year January, I am not seeing any bull run again for now but neither expecting a significant drop. If there would be a significant drop in bitcoin price, I am expecting it next year, but spot bitcoin ETF may not let that happen. Some analysts on this forum are expecting $40000, but no one know if that would be possible. If the question is about buying bitcoin, yes buying bitcoin is still not late.Why are u expecting a drop next year?The more the price drops, the more opportunities we have to buy more bitcoin at a discount. You don't want to buy cheap bitcoin and want to buy at a high price? The halving is expected to take place in March or April 2024 and if history repeats itself, we will have a bull season when the halving occurs, but it will not happen immediately but will it takes a few more months. That means there's still a chance the price will fall. If you believe in history, you should prepare mentally for it, don't be subjective because of what is happening in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "October 26, 2023, 12:25:36 PM",
      "body": "The sudden jump is due to the news lingering around the approval of EFT Bitcoin, which from what is on air that it will be approved by next year January. It is possible for the approval to take place by January or not because we don't need to trust SEC as they can still be reluctant to approve it. If it is not approved then bitcoin price wouldn't keep pumping but it will dump. I still believe that we might experience a dump even before next year January because this is how bitcoin price moves. I believe that you should continue accumulating more bitcoin is you can through DCA so that you will have stashed up your portfolio very well when the bull run arrives. Every price dump or pump is an opportunity to buy more since we believe that bitcoin price will hit 100k and above during the next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boltz",
      "created_time": "October 26, 2023, 12:49:16 PM",
      "body": "Just a spike in price but no real bull run whatsoever. However , the signs of a bull run are present in the crypto space but the price tells us there is a big accumulation phase going behind and personally , I don't want to miss this so everytime I have some money to spare , I get some Bitcoin in return. I also have a prediction of Bitcoin going full bull run Q3 of 2024 until Q1 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "October 26, 2023, 01:06:59 PM",
      "body": "The bull market will return but maybe not yet. Slowly, the market will recover, and now, Bitcoin is on its way. We must be more patient in waiting for the market to become bullish again. And in the meantime, we are still given the opportunity to buy more Bitcoin at the current price.And don't forget that the current increase will have a decrease as a correction. At that time, you can use it to accumulate more Bitcoins. It's better not to be too serious about waiting for a bull market but focus on accumulating more Bitcoins for now.If a correction comes later, will the price of Bitcoin remain at $34k or will it decline below $30k again? Because the price of Bitcoin managed to rise to the current level of $34k. So it's better to be prepared with your money so you can buy more Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "October 26, 2023, 01:19:15 PM",
      "body": "Quote from: Iamcrypticguy on October 26, 2023, 07:38:01 AM What's your opinion, fellow traders?\"Although there haven't been too many comments yet, I see that most people still don't believe that cow season has come and that what is happening is only temporary and will quickly disappear. I also think like everyone else but I'm not really sure about anything because the market will usually always go against what the crowd thinks. When people believed that bitcoin would drop to $20k - $23k, but bitcoin has rebounded strongly by over 20% in the past few days and is currently trading for $34k. What I'm thinking is when everyone thinks bull season is not here yet, will ETFs be approved and will we have an immediate bull season?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onecall123",
      "created_time": "October 26, 2023, 01:38:12 PM",
      "body": "I believe there's significant market manipulation happening right now. It looks like that the approval of a BTC spot ETF is driving a frenzy of buying, although the price isn't surging dramatically. Once the ETF gets the green light, we can expect billions of real money to enter BTC. The current activity might be more about moving funds from altcoins to Bitcoin. The total market cap isn't skyrocketing, so if this is new investment, it's quite substantial. This kind of behavior is common in the crypto market, and it doesn't surprise me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}