{
  "id": "topic_5464317",
  "title": "inl0veweb3",
  "author": "inl0veweb3",
  "created_time": "August 23, 2023, 04:24:19 PM",
  "content": "Gonna be as short as possible but hopefully you'll read on!-Be one ape among other apes in late 2021 during a NFT bull market.-Be afraid of missing out on every NFT project you throw your wagecucking in.-Get rugged every single time.-Enjoy the gas (500 gwei during mint with ETH=$5K)-2022 comes in.-Get ruined.-Smells like crypto winter for a long time. A lot of pain. No gain.-Bad luck.Here comes the project that may take you to the whale club one time for all.<<< REACTOR 2042 >>>NFT racing game on Ethereum greeting players with a huge open world that features a mix of Forza with a taste of GTA.Yes, you can get out of your car during a race to explore the world, looking for easter eggs or other in-game bonuses.Unreal Engine 5, been on development for almost 2 years and looks wonderful. Already playable on its beta state. Final release in the coming months.Get in touch with an admin from the Discord channel to give it a shot:https://discord.com/invite/BaY8erHdn9Current game is already 8GB.Active community with daily bug reports, team always carefully listens to the community.New beta build rolls out every week.Epic launcher already in the works regarding the next build.This has clearly been under the radar for the last 2 years.Marketing push coming soon so get ready to snipe a few cars before this eventually blows the fuck up.Next step is Epic Games Store integration.Keep an eye out on the in-game currency named REACTON, this will be used to buy improvements on your cars and all. Also planned to be a token every racer earns and can buy/sell i.e on Uniswap.Head of project: Mike Bundlie (Hollywood producer that also worked on Iron Man movie, Shazam and so on)Find his bio in here:https://en.wikipedia.org/wiki/Mike_BundlieComic and movie in the works so the game lore gets even better. Website in here (being revamped):https://www.reactormotors.com/game/Twitter:https://twitter.com/reactor_motorsOpensea:https://opensea.io/collection/reactormotorsEtherscan:https://etherscan.io/token/0x6f9Eb87f5a5638A3424c68FfAe824608671F4EA6Roadmap:https://www.reactormotors.com/roadmap/Comic:https://www.reactormotors.com/comic/Lore:https://www.reactormotors.com/origin/Holders: 4K<1% listedTotal NFTs: 8888Rarity data:https://www.reactormotors.com/rarity/Know that if you're lucky enough to get your hands on one of the rarest cars in this game (only 8 Spectrum cars=0.09% rarity) you're probably all set to be one of the next blue chip holders.Cheers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464317",
  "comments": []
}