{
  "id": "topic_5470234",
  "title": "Palazodeen",
  "author": "Palazodeen",
  "created_time": "October 13, 2023, 05:53:57 PM",
  "content": "A lot of Game-Fi projects have been launched in the past couple of years but only a few have managed to stay relevant. Popular Game-Fi projects like Sandbox, Axie infinity and decentraland succeeded because of their innovative approach to gaming and the potential for players to generate income through game play.I recently came across another Game-Fi project \"BIGTIME\" It is a multiplayer action RPG for PC that melds a fast-combat system with an open game economy where players have an active role in generating and exchanging game items.Just launched a month ago, the native token seems to be bullish after launched on some top exchange like Bitget and MEXC.Knowing fully that some of this tokens like AXS who enjoyed significant reception reaching several ATH has also witnessed significant drawback, do you think BIGTIME could be an exception?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470234",
  "comments": [
    {
      "author": "Husires",
      "created_time": "October 14, 2023, 03:21:29 AM",
      "body": "I am cautious or skeptical of all the projects being promoted in Bitget's innovation zone, and I do not see that there is any intention to include them in any other large platforms soon.The idea of the project seems good for those who want to invest in it for a short period and withdraw profits as soon as they are realized, but it is not a good investment after that, meaning that you have to sell within 3 months of investing, otherwise it is better to sell at a loss than to keep it.What did you like about it so much that you asked about it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 14, 2023, 04:20:22 AM",
      "body": "I don't think so. It could have its best of days just like the ones that you mentioned, but it is still highly dependent on hype. It is built on a trend, so be very careful about it. If you have such token, sell it if you are already earning from it. Don't keep it for long. Tokens such as these are not built for long term hodling. They don't last. Be warned about this tendency. If you think Sandbox (SAND), Axie Infinity (AXS), and Decentraland (MANA) are successful, zoom out and think again. According to data from Coingecko, here is the situation of these three right now:Sandbox (SAND)Axie Infinity (AXS)Decentraland (MANA)Now ask yourself of the same question, could BIGTIME token sustain its current tempo? And take note that BIGTIME isn't even big time just like these three.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "October 14, 2023, 06:35:51 AM",
      "body": "Don't focus to use this as long term investment. I have been getting a key to play this game and i have downloaded it right now. Im still grinding to create hourglass as many as possible caused by this will be a valuable thing for sure. Everything about it will be going to be booming soon after this token will be listed on binance. It's still at the pre launch and only those who got key can play the game and i got 1. The hourglass has limited supply and it's time to grinding it. I don't care so much about the price and the inflation looks like quite slow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Palazodeen",
      "created_time": "October 14, 2023, 08:00:30 AM",
      "body": "Quote from: Fundamentals Of on October 14, 2023, 04:20:22 AMI don't think so. It could have its best of days just like the ones that you mentioned, but it is still highly dependent on hype. It is built on a trend, so be very careful about it. If you have such token, sell it if you are already earning from it. Don't keep it for long. Tokens such as these are not built for long term hodling. They don't last. Be warned about this tendency. If you think Sandbox (SAND), Axie Infinity (AXS), and Decentraland (MANA) are successful, zoom out and think again. According to data from Coingecko, here is the situation of these three right now:Sandbox (SAND)Axie Infinity (AXS)Decentraland (MANA)Now ask yourself of the same question, could BIGTIME token sustain its current tempo? And take note that BIGTIME isn't even big time just like these three. If you check the last paragraph of the post, I clearly stated that some of this tokens including AXS has witnessed a significant drawback. I know most of the game-Fi projects hasn't lived to expectation but my question is could BIGTIME be an exception. Remember ETH wasn't the next crypto after BTC. As a matter of fact, we have about 16 crypto from 2011 to 2014 before the birth of ETH but ETH is more successful than others. That's the angle am looking at.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "October 14, 2023, 09:43:51 AM",
      "body": "Better to know other projects rather than hoping for them to rise again as it was impossible. Though I won't say they are worthless, however, with their performance after bullish, it is not really convincing enough to trust and think for a profit. That will tell us that investors are quite losing their interest and demand is declining. Honestly, they're out of the trend already and investors nowadays are watching AI projects and meme coins. These gaming projects seem to be going to decline more rather than seeing them recover, the chance is very slim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "October 14, 2023, 10:24:37 AM",
      "body": "Quote from: Palazodeen on October 13, 2023, 05:53:57 PMKnowing fully that some of this tokens like AXS who enjoyed significant reception reaching several ATH has also witnessed significant drawback, do you think BIGTIME could be an exception?Why are you providing late information, mate? we should be able to profit from this little hype . According to Coingecko, $BIGTIME has an ATL of around $0.052 which means it's 300% of its current price. IMO, this project is a good project, we can see from the CEX that are listing $BIGTIME, but of course not for the long term, we know that as of today, there's no project that has survived its hype price.Quote from: Husires on October 14, 2023, 03:21:29 AMI am cautious or skeptical of all the projects being promoted in Bitget's innovation zone, and I do not see that there is any intention to include them in any other large platforms soon.Recently Poloniex listed $BIGTIME on their platform. Not only that, apart from Bitget and MEXC as @OP said, $BIGTIME has also been listed on Gate.io, OKX and also Coinbase Exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 14, 2023, 11:36:58 AM",
      "body": "Quote from: Palazodeen on October 14, 2023, 08:00:30 AMQuote from: Fundamentals Of on October 14, 2023, 04:20:22 AM-snip-If you check the last paragraph of the post, I clearly stated that some of this tokens including AXS has witnessed a significant drawback. I know most of the game-Fi projects hasn't lived to expectation but my question is could BIGTIME be an exception. Remember ETH wasn't the next crypto after BTC. As a matter of fact, we have about 16 crypto from 2011 to 2014 before the birth of ETH but ETH is more successful than others. That's the angle am looking at.So then I've already given my answer. Again, I don't think so. It's not that most of the game-Fi projects, as you call them, didn't live according to expectations, it's that they are simply part of a trend. A trend doesn't last forever. And since you talked of the past, you must have an idea of the years when ICO was the trend. There were also many projects at that time that became successful like AXS, SAND, MANA in the play to earn trend. After a while, they all faded away. Again, I don't think BIGTIME is an exception. It's far from it. It's not even bullish. It's not even admitted on top exchanges. It's far from becoming like AXS, SAND, or MANA. But if it becomes like these top game-Fi projects, it means it won't be like ETH because these projects won't stay long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "October 14, 2023, 11:46:38 AM",
      "body": "Quote from: Palazodeen on October 14, 2023, 08:00:30 AMIf you check the last paragraph of the post, I clearly stated that some of this tokens including AXS has witnessed a significant drawback. I know most of the game-Fi projects hasn't lived to expectation but my question is could BIGTIME be an exception. Remember ETH wasn't the next crypto after BTC. As a matter of fact, we have about 16 crypto from 2011 to 2014 before the birth of ETH but ETH is more successful than others. That's the angle am looking at.I am not coing to compare it with those, but no. I can guarantee you that it's not going to to be exception other way then not being able to climb that high on marketcap.I am sorry to say but graphics are off putting and nothing on their homepage feels inviting. Some sort of generic, way below average looking rpg with a cryptocurrency layer on it is not going to cut it.And i am not sure about your angle here. The fact there has been so many failed cryptocurrencies just indicates that there will be so many failed cryptocurrency games like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "October 15, 2023, 12:06:43 AM",
      "body": "Quote from: Hypnosis00 on October 14, 2023, 09:43:51 AMBetter to know other projects rather than hoping for them to rise again as it was impossible. Though I won't say they are worthless, however, with their performance after bullish, it is not really convincing enough to trust and think for a profit. That will tell us that investors are quite losing their interest and demand is declining. Honestly, they're out of the trend already and investors nowadays are watching AI projects and meme coins. These gaming projects seem to be going to decline more rather than seeing them recover, the chance is very slim. Play to earn is having problem on its sustainability. I meant various blockchain play to earn game has proven if they were not sustainable. The inflation will always become nightmare for the play to earn game. The price will never be stable. This is the main question. Even though bigtime has been limiting the use of its item for some reasons but it's not yet enough. This game is kinda the same like axie infinity which was also let people to earn token. People will be actually grinding it to be dumped to the market. I see no reason for people to use this as investment caused by the supply will be increasing drastically. There's no doubt if play to earn game is able to go dead easily caused by it has no great sustainable system who can keep the price. People are only farming token to be dumped for money. This is very hard to accept it but it's the truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "October 15, 2023, 12:22:13 AM",
      "body": "has been delving into the game itself, the game was quite promising though still need some update, considering its in beta phase, thats normal.but considering it get listed in many various exchange maybe it would turns out to be good project in the long run though I wonder if it can free itself from the curse of blockchain game as usually which is getting high at value then plummet afterwards and losing the userbase.thats can only be solved by giving out good quality content in their game and kept improving, but the game itself i'm pretty sure has many potential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "October 15, 2023, 06:26:12 AM",
      "body": "Is the source of this hype coming from Elon Musk, when recently he has been continuously testing live streaming games on the X twitter platform, and some people like to speculate that this will explode again towards p2e. Actually, few in this market can maintain their existence in that field, and most products are created only for the short-term purpose of following the hype.With Bigtime, I'm not sure, but fomo is different from the problem of working well, as some information that I know is still very early and will likely repeat the footsteps of other projects. Other than that, it has increased in price thanks to the marketing process as well as the community's fomo, continue to observe to see if they are really serious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "October 15, 2023, 07:20:46 AM",
      "body": "Quote from: Fundamentals Of on October 14, 2023, 11:36:58 AMIt's not even admitted on top exchanges.Okx, Gate, and Coinbase is not a top exchangers in your list?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 15, 2023, 11:22:13 AM",
      "body": "Im not sure if Im gonna regret selling my spaces for flipping before. I didnt have much time to play the private beta for the one holding access pass. So Id sell mine long time before the release for the game. But I did profited from spaces. Thumbs up for those who diligently wait and play for the release of their token and even play the game at the expense of grinding items and nft without even assurance of possible drop. Anyway it seems the game is quite good as per some Vloggers that showing their progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 15, 2023, 12:18:49 PM",
      "body": "Quote from: Palazodeen on October 13, 2023, 05:53:57 PMKnowing fully that some of this tokens like AXS who enjoyed significant reception reaching several ATH has also witnessed significant drawback, do you think BIGTIME could be an exception?Also take into account the fact that the popularization of game projects was in a bull market and such projects had a large budget and investments from large funds. If a game project does not have any budget, its popularization will be extremely low. It is also worth considering that the GameFi sector is in complete decline and without a bullish trend and large investments in the altcoin sector, such projects will not be popular and therefore will not grow in value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 16, 2023, 11:01:41 AM",
      "body": "No, there's no exception for drawbacks, it can always happen to any altcoin or any projects out there. I played a lot of NFT and DeFi games but all of them went low and some are now gone because they cannot hold the fortress. The market of cryptocurrencies is a wild one and when investors feel like there's no sense in supporting one project anymore, they will withdraw anytime they want. Also, games with cryptocurrencies injected with them are like a pyramid scheme so when there's no one buying downstairs then the players upstairs will have a problem at making demands on selling either their equipment in-game or their own character/avatar. IMO, it's always better to be ready for something like that to happen because another reason is if they find a new game that is better than what you or I is playing right now. Games gets boring in the long run unless developers can create something that would avoid that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fmz89",
      "created_time": "October 17, 2023, 02:18:28 PM",
      "body": "Quote from: Palazodeen on October 13, 2023, 05:53:57 PMA lot of Game-Fi projects have been launched in the past couple of years but only a few have managed to stay relevant. Popular Game-Fi projects like Sandbox, Axie infinity and decentraland succeeded because of their innovative approach to gaming and the potential for players to generate income through game play.I recently came across another Game-Fi project \"BIGTIME\" It is a multiplayer action RPG for PC that melds a fast-combat system with an open game economy where players have an active role in generating and exchanging game items.Just launched a month ago, the native token seems to be bullish after launched on some top exchange like Bitget and MEXC.Knowing fully that some of this tokens like AXS who enjoyed significant reception reaching several ATH has also witnessed significant drawback, do you think BIGTIME could be an exception?as far i know generate income from gaming it was fake economic, minting coin to give rewards the player will run out of treasury, isnot money its just coin came from nowhere and give it to player as rewardsits just like you playing games and get exp aka experience to level up your char, and there is some implementation real economic through microtransaction  real money converted to coin and vice versa, but i saw double token that has different purpose. so yeah....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "October 18, 2023, 11:22:52 PM",
      "body": "seeing reviews from youtube it seems like this game isn't that good honestly, 2 years in and the game still lacked so many things just like any other metaverse gaming that utilizes blockchain they always feels unfinished, maybe because unfinishing the game more profitable for them. by keeping the game in beta they could always have excuse to make some launching event.its not like there will be any meaningful update towards the technical of the game but instead its all about NFT that they are releasing which is silly.this game will be another journey of getting bored to play boring game for the sake of creating money journey, because I can see that the main purpose of people playing these game is just to earn some money not reallytrying to play for fun, you can see the reason many blockchain game stay irrelevant after few months because they have mediocre gameplay, if only there's real AAA game that utilizes blockchain that would be massive but alas developing such game requires massive amount of money and effort, definitely not something that can easily come by.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}