{
  "id": "topic_5404912",
  "title": "TryNinja",
  "author": "TryNinja",
  "created_time": "July 02, 2022, 11:00:49 AM",
  "content": "Mais uma...A Voyager, CeFi semelhante a Celsius/Blockfi/Nexo, que inclusive era listada na bolsa de valores, bloqueou os seus saques poucos dias após conseguir uma linha de crédito da FTX exatamente para garantir os saques em momentos de falta de liquidez: https://finance.yahoo.com/news/voyager-digital-provides-market-184400883.htmlO problema é que eles parecem ter perdido cerca de $600m que foram emprestados para a 3AC, hedge fund crypto que colapsou recentemente, SEM QUALQUER TIPO DE COLATERAL. Esse dinheiro pode muito bem ser dado como perdido, pois a 3AC entrou em processo de falência e com certeza não tem ativos o suficientes para honrar com o pagamento desse empréstimo. Falando em empréstimos sem colateral, descobriram que a maior parte dos empréstimos da Blockfi também não tinham colateral, ainda que eles prometessem publicamente que TODOS tinham uma porcentagem acima de 100% (overcollateralized). Os bonitos também tinham um empréstimo de $1b com a 3AC, sendo que $400m eram em forma de GBTC (da Grayscale).https://twitter.com/BlockFiZac/status/1536174316550770688Mais uma vez a maré abaixou e descobriram que todos estavam nadando pelados.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404912",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "July 02, 2022, 11:55:02 AM",
      "body": "A questão do não pagamento dos empréstimos é o pior veneno que a banca e empresas de créditos podem ter.Porque se as pessoas deixam de cumprir os seus compromissos, eles próprios ficam sem o capital para continuarem a operar, e isto gera um ciclo descendente que só prejudica.A empresa tem de estar bem estruturada, para saber lidar com este tipo de situações.Quote from: TryNinja on July 02, 2022, 11:00:49 AMMais uma vez a maré abaixou e descobriram que todos estavam nadando pelados.Acho que isso também é fruto de algum \"amadorismo\" por parte de quem criou essas empresas/serviços.Talvez alguns dos criadores destas empresas, nunca tiveram uma formação especifica no setor financeiro. Viram apenas uma boa oportunidade de negocio, e tinham os recursos necessários para avançar. E quando assim é, se tudo correr bem, é ótimo. O problema é quando as coisas \"deixam de ser 1+1=2\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 02, 2022, 03:50:09 PM",
      "body": "Sempre dou uma olhada no twitter, mas não sabia dessa agora, é tanto fud ou notícias duvidosas, aliadas a tanta besteira que fizeram, que fico meio perdido em que acreditarEssa queda é pra conhecer todo mundo mesmo, agora duas coisas me chamam a atenção1 - como conseguem esses empréstimos sem colateral?2 - parece que o Sam da FTX quer comprar tudo isso aí, será que teve dedo dele em alguma queda?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 02, 2022, 04:15:22 PM",
      "body": "Quote from: rdluffy on July 02, 2022, 03:50:09 PM1 - como conseguem esses empréstimos sem colateral?Ganância. Por exemplo, você acha que o pessoal da 3AC ofereceria taxas melhores por um empréstimo 120%+ colateralizado ou sem colateral?Eles eram um dos maiores players do mercado. Há diversos relatos de projetos colocando o seu tesouro nas mãos do 3AC em troca de uma taxa garantida. A ganância e inocência dessas empresas as deixou cegas para qualquer tipo de gerenciamento de risco, então elas se deixaram levar e acreditaram que era mais fácil emprestar tudo para eles (\"claro que eles vão pagar, duh\"), repassando uma parte para os clientes e ficando com uma pequena parte. Dinheiro fácil, não?...\"3AC’s Treasury Management. 3AC gave an 8% APR guarantee on the treasury. So protocols would park the funds raised by 3AC + additional parts of their treasury. The protocols felt safe because well…it’s 3AC. Protocol X has mentioned that the ghosting is real. They’ve talked to two other protocols who also mentioned that they’re being ghosted too by them. 3AC now holds part of their treasury, and they have no idea what’s the state of their cash.\"https://news.bitcoin.com/report-bitmex-deribit-liquidate-3acs-positions-negativity-continues-to-plague-the-crypto-hedge-fundQuote from: rdluffy on July 02, 2022, 03:50:09 PM2 - parece que o Sam da FTX quer comprar tudo isso aí, será que teve dedo dele em alguma queda?Teoria da conspiração. Claro que ele vai querer agarrar oportunidades de centavos ao dólar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 04, 2022, 07:00:05 AM",
      "body": "E mais um...Agora foi o \"Vauld\" pausando tudo para focar em sua \"reestruturação\": https://www.vauld.com/blog/corporate-statement/QuoteIn the meantime, we have made the difficult decision to suspend all withdrawals, trading and deposits on the Vauld platform with immediate effect. We believe that this will help to facilitate our exploration of the suitability of potential restructuring options, together with our financial and legal advisors. We seek the understanding of customers of the Vauld platform that we will not be in a position to process any new or further requests or instructions in this regard. Specific arrangements will be made for customer deposits as may be necessary for certain customers to meet margin calls in connection with collateralised loans. Só não dá para saber se eles tiveram perdas e/ou estão insolventes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 04, 2022, 09:59:12 AM",
      "body": "É um por semana...Querem fazer apostas, para ver quem vai ser para a próxima semana?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 04, 2022, 11:57:59 AM",
      "body": "E lá vão as DeFi fugindo com o dinheiro dos outros. Bloquear saques é um confisco do dinheiro alheio.De forma geral, isso é péssimo pro setor, pois esse alto índice de calotes e confiscos são um alerta para os reguladores.Afinal, essa deveria ser a função mais natural da regulação: criar regras que impedem bandidos de pegar nosso dinheiro.O problema todo é que as criptomoedas deveriam ser exatamente formas de proteção do indivíduo contra esses mecanismos de confisco.A maravilha das criptomoedas são justamente o indivíduo ter o controle da sua chave privada e não poder ser confiscado/bloqueado/impedido de transacionar.A rigor, as DeFi deveriam operar por smartcontracts que transferissem de volta para os verdadeiros proprietários seu dinheiro investido caso uma das partes não cumpra o acordado, deixando os investidores ilesos ao final do lending. Contudo, não é isso que está acontecendo. Na prática, as pessoas estão praticamente depositando dinheiro na carteira dos outros, que decidem se bloqueiam os saques ou não.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 04, 2022, 12:04:34 PM",
      "body": "Quote from: bitmover on July 04, 2022, 11:57:59 AME lá vão as DeFi fugindo com o dinheiro dos outros. Bloquear saques é um confisco do dinheiro alheio.Textão falando mal de \"DeFi\" (Decentralized Finance) sendo que a Voyager é uma empresa 100% centralizada e inclusive listada na bolsa. Uma Googlada (ou uma lida no primeiro parágrafo do post - \"CeFi (Centralized Finance) semelhante a Celsius/Blockfi/Nexo\") e evitava isso dai. Empresa que, também como escrito no post, emprestou $600m sem colateral para outra empresa 100% centralizada (3AC). Nem \"maça e pêra\", tá mais para \"crocodilo e papagaio\".Por outro lado, Coumpound, Aave, Sushiswap, enfim... todos os grandes protocolos DeFi seguem funcionando assim como definido em seus smartcontracts imutáveis. Ponto para as DeFi que fogem com o dinheiro dos outros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 04, 2022, 12:08:02 PM",
      "body": "Quote from: TryNinja on July 04, 2022, 12:04:34 PM Uma Googlada (ou uma lida no primeiro parágrafo do post - \"CeFi (Centralized Finance) semelhante a Celsius/Blockfi/Nexo\") e evitava isso dai. Por outro lado, Coumpound, Aave, Sushiswap, enfim... todos os grandes protocolos DeFi seguem funcionando assim como definido em seus smartcontracts imutáveis. Ponto para as DeFi que fogem com o dinheiro dos outros.Pois é, eu poderia falar a mesma coisa.Não precisa nem do google para evitar esse textinho. Bastava ir na página da celcius",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 04, 2022, 12:09:26 PMLast edit: May 14, 2023, 02:18:46 AM by TryNinja",
      "body": "Quote from: bitmover on July 04, 2022, 12:08:02 PMPois é, eu poderia falar a mesma coisa.Não precisa nem do google para evitar esse textinho. Bastava ir na página da celcius Não entendi, a palavra (auto-intitulada) de uma empresa centralizada vale mais do que todo o conceito de descentralização nativo e verificável de um smartcontract? O que tem a ver? Então se a Atlas Quantum falar que tem a transparência de uma DeFi, ela é uma DeFi? \"Celsius\" ... \"to a centralized company\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 04, 2022, 12:17:15 PM",
      "body": "Quote from: TryNinja on July 04, 2022, 12:09:26 PMNão entendi, a palavra de uma empresa centralizada vale mais do que todo o conceito de descentralização nativo e veríficavel de um smartcontract? O que tem a ver? Então se a Atlas Quantum falar que tem a transparência de uma DeFi, ela é uma DeFi? \"Celsius\"Eles se definem como um misto de CeFi e DeFi.https://mashinsky.medium.com/the-best-of-both-worlds-how-celsius-straddles-both-cefi-and-defi-d15325c61814E ai, no final, as pessoas vão sendo levadas por esses hypes, buzzwords, smartcontracts que acabam fazendo a custódias de ativos como essa Celsius (misto de cefi e defi) e os caras vao la e fogem com o dinheiro delas.Não é porque existem DeFi honestas como essas que voce citou, que invalida o que eu disse antes.Essas Defi, tipo a Celsius, estão levantando a bola para uma regulação pesada no setor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 04, 2022, 12:20:51 PM",
      "body": "Quote from: bitmover on July 04, 2022, 12:17:15 PMEles se definem como um misto de CeFi e DeFi.Eles podem se definir como quiserem. Eles não são descentralizados = eles não são uma \"DEcentralized FInance\". Ponto. O conceito \"DeFi\" está completamente, 100%, definido ao uso de smartcontracts em blockchains descentralizadas. Absolutamente não tem nada a ver uma coisa com a outra.Não tem absolutamente nada de \"DeFi\" em pegar $600m em fundos, em um endereço privado, e enviar tudo para outra empresa, sem receber qualquer garantia, apenas para sofrer um calote.  Que tentativa chula de falar que é \"a DeFI\" da Voyager (ou nesse caso, Celsius?) que está \"fugindo com o dinheiro dos outros\". Desculpa, mas você sequer está lendo o que escreve? \"Me recuso a seguir essa discussão inútil\" sobre Defi com você, sendo que desde os primeiros tópicos sobre o assunto me ficou claro que é a mesma coisa que andar em círculos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 04, 2022, 12:49:31 PM",
      "body": "Quote from: TryNinja on July 04, 2022, 12:20:51 PMDesculpa, mas você sequer está lendo o que escreve? Cara, na boa.Acho que voce tem que baixar a bola, respirar.Ja tentei te acalmar no privado e não adianta, lá voce é ainda pior.Outro dia eu falei algo mais obvio desse mundo de criptomoedas: \"corretoras fogem com o dinheiro do outros\". Voce quis dizer q eu estava errado No dia seguinte ta lá perguntando \"Qual garantia tenho de que não vao fugir com meu dinheiro\"?Dai uns meses atras eu estava falando do cerco das corretoras de criptomoedas contra os mixers, que era perigoso enviar fundo de mixers pra corretoras, e voce negou até a dizer chega, falando que era de boa mandar (e agora ta cheio de topicos sober isso na aba gringa). E ta aí ontem falando sobre isso em outro tópico, que vai ter KYC até de endereços, que ninguem vai conseguir mandar dinherio pra lugar nenhum , de lugar nenhum Em meio a xingamentos, eu te ensinei a usar o N26 (que certamente está te ajudando muito na sua viagem), dai vc vai lá escreve um texto ensinando a usar ele para fazer uma operação ilegal (que é a conclusão natural de qq pessoa que aprende a usar um banco gringo+ cripto, e por isso que rapidamente foi proibido). Fui lá, te alertei, e tu vem me xingando depois pq escrevi no meio de um texto enorme que \"só paga impsoto que é otário\" (nao sei pq vc se ofendeu com isso, mas enfim)Daí tem aí um exemplo claro da Celsius fazendo smartcontracts, que se chamam de DeFi, fugindo com o dinheiro dos outros, e voce ta ai, reclamando do que eu escrevo.Eu concordo que não uma DeFi igual a pancake, mas eles fazem parte do ecossistema e se definiem assim. E cabem perfeitamente no que eu escrevi.Não é uma DeFi pra voce, mas se for pergutnando por ai, certamente a maioria vai falar que é DeFi. Até pro CEO. Olha só se isso não descreve a Celsius:Quote from: bitmover on July 04, 2022, 11:57:59 AMA maravilha das criptomoedas são justamente o indivíduo ter o controle da sua chave privada e não poder ser confiscado/bloqueado/impedido de transacionar.A rigor, as DeFi deveriam operar por smartcontracts que transferissem de volta para os verdadeiros proprietários seu dinheiro investido caso uma das partes não cumpra o acordado, deixando os investidores ilesos ao final do lending. Contudo, não é isso que está acontecendo. Na prática, as pessoas estão praticamente depositando dinheiro na carteira dos outros, que decidem se bloqueiam os saques ou não.A Celsiu é justamente uma DeFi que faz a custódia. Enfim... não adianta ter razão, pq vc quer ir na polemica. \"bastava uma googada, voce nao le o que escreve\", mesmo estando com um ponto valido.As vezes escrevo textos enormes, de muitas palavras, com bastante informação, dai vc procura uma virgula fora do lugar e quer me encher o saco, vem todo agressivo. (e em cima um mar de bobagens escrito por outros usuários).Não entendo a sua, na real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 04, 2022, 12:58:01 PM",
      "body": "Quote from: bitmover on July 04, 2022, 12:49:31 PMNão entendo a sua, na real.A minha é que é muito chato \"conversar\" com você. Você simplesmente fecha a sua visão em um ponto qualquer e fica nele até o fim. Não está nunca aberto a ouvir o lado da contraparte e nem aprender algo de novo em um assunto que você é claramente leigo (e que não tem nada de errado nisso, ninguém sabe de tudo e todo dia há oportunidades de aprender algo novo).Por exemplo, você continua insistindo que a Celsius é \"\"uma DeFI que faz custódia\"\". Sendo que isso nem se quer faz sentido. Qual a parte descentralizada da Celsius? O que da sua custodia se equipara à \"uma DeFi\"? Nem precisa responder.Eu passei quase os últimos 2 anos full-time crypto, ganhando a vida no DeFi e lendo, lendo, e lendo mais um pouco. Eu absolutamente sei o que é \"uma DeFi\" e absolutamente sei que a Celsius e Voyager passam longe disso. Qualquer player sério do cenário riria desse seu post e dessa sua insistência. Mas claro que estar certo sempre parece ser o mais importante.Enfim, eu até pensei em responder cada um dos pontos desse seu post mas essa é de longe a maior perda de tempo que eu poderia cometer. Você não aprenderia nada, continuaria batendo na tecla errada, e eu ia ficar andando em circulos à toa. Eu estou sinceramente quase te colocando no \"ignore\" aqui no fórum, por que sempre é a mesma coisa, e o pior, NUNCA acaba de forma produtiva, uma tentativa de \"te corrigir\" em um assunto que eu sei que domino e sei que você não domina sempre acabar em uma briguinha aleatória que não dá em nada. Passar bem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 04, 2022, 04:54:48 PM",
      "body": "Quote from: bitmover on July 04, 2022, 12:49:31 PMCara, na boa.Acho que voce tem que baixar a bola, respirar.Ja tentei te acalmar no privado e não adianta, lá voce é ainda pior.Quote from: TryNinja on July 04, 2022, 12:58:01 PMEnfim, eu até pensei em responder cada um dos pontos desse seu post mas essa é de longe a maior perda de tempo que eu poderia cometer. Você não aprenderia nada, continuaria batendo na tecla errada, e eu ia ficar andando em circulos à toa. Eu estou sinceramente quase te colocando no \"ignore\" aqui no fórum, por que sempre é a mesma coisa, e o pior, NUNCA acaba de forma produtiva, uma tentativa de \"te corrigir\" em um assunto que eu sei que domino e sei que você não domina sempre acabar em uma briguinha aleatória que não dá em nada. Passar bem.Vamos lá rapazes! Tenham calma. Debater ideias e opiniões é sempre bom.E por vezes as opiniões são diferentes, e podem ter perspetivas diferentes sobre o assunto. Mesmo que não concordemos com essa opinião, temos de respeitar.Mesmo que uma ideia possa parecer a menos acertada, cabe a cada um avaliar e chegar as suas conclusões.Por isso, não vale a pena ficar demasiado stressado com isso. Julgo que ambos tem a mente aberta, capaz de respeitar a opinião um do outro, mesmo não concordando.Acredito que toda a comunidade PT/BR não quer ver os dois melhores membros de costas voltadas.Um abraço deem um abraço crypto! Para o bem da nossa comunidade! Quote from: TryNinja on July 04, 2022, 12:20:51 PMEles podem se definir como quiserem. Eles não são descentralizados = eles não são uma \"DEcentralized FInance\". Ponto. O conceito \"DeFi\" está completamente, 100%, definido ao uso de smartcontracts em blockchains descentralizadas. Absolutamente não tem nada a ver uma coisa com a outra.Isso é publicidade enganosa! Eles deviam de alguma forma ser penalizados por isso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 04, 2022, 05:06:51 PM",
      "body": "Quote from: joker_josue on July 04, 2022, 04:54:48 PMVamos lá rapazes! Tenham calma. Debater ideias e opiniões é sempre bom.\"A definição de insanidade é fazer a mesma coisa repetidamente e esperar resultados diferentes\"Há uma grande diferença entre debater e jogar xadrez com pombo. Até o mais paciente tem limites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 04, 2022, 05:19:13 PM",
      "body": "Quote from: TryNinja on July 04, 2022, 05:06:51 PMHá uma grande diferença entre debater e jogar xadrez com pombo. Até o mais paciente tem limites.Entendo. E paciência é coisa que não me falta...Mas, também devemos aprender saber o momento certo de sair de um determinado tema, sem as coisas descambar.Isso não é sinal de fraqueza ou derrota, mas sim de sabedoria.É preferível sair a bem, mesmo sabendo que se podia dar algo mais, do que sair sem se conseguir dar esse algo.Acho que todos nós já passamos por situações assim na vida offline. Por isso, temos de aprender os momentos certo de continuar ou não um debate. Porque se ele deixa de ser construtivo, não vale a pena continuar, porque isso só nos vai destruir a nos próprios.Eu mesmo já tive debates contigo @TryNinja e com o @Bitmover, por opiniões ou perspetivas diferentes. Se calhar a vossa perspetiva, fez mudar a minha numas ocasiões e noutras não, e talvez o mesmo tenha acontecido convosco. Se não mudou, é verdade que mais cedo ou mais tarde vai voltar ao \"barulho\", mas temos de continuar a ter o equilibro nessas coisas.Por isso, amigos, tentar manter um ambiente agradável na nossa comunidade! Eu acredito que vocês são capazes!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 06, 2022, 05:00:12 AM",
      "body": "Voyager protocolando o seu pedido de falência. QuoteOn July 5, 2022, Voyager Digital Holdings, Inc. and two affiliated debtors (collectively, the \"Debtors\") filed voluntary petitions for relief under Chapter 11 of the United States Bankruptcy Code. The Debtors' bankruptcy cases are pending joint administration under Case No. 22-10943 in the United States Bankruptcy Court for the Southern District of New York (the \"Bankruptcy Court\").https://cases.stretto.com/Voyager/https://cases.stretto.com/public/x193/11753/PLEADINGS/1175307062280000000016.pdfReportagem pode ser lida aqui: Voyager Seeks Bankruptcy Protection Amid Crypto Credit Crisis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 06, 2022, 11:10:12 AM",
      "body": "Quote from: TryNinja on July 06, 2022, 05:00:12 AMVoyager protocolando o seu pedido de falência. As vezes é melhor declarar falência e a malta ainda conseguir recuperar algum do dinheiro lá colocado, do que tentar continuar a operar e perder ainda mais, chegando a um ponto é que não há dinheiro nenhum para os credores.Agora, irá começar um longo processo de papelada, e esperar que conseguia recuperar alguma coisa.Tinhas lá dinheiro @TryNinja?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 06, 2022, 11:14:22 AM",
      "body": "Quote from: joker_josue on July 06, 2022, 11:10:12 AMTinhas lá dinheiro @TryNinja?Eu não... O DeFi paga(va) 10x mais e era descentralizado e transparente, o que faz uma grande diferença.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}