{
  "id": "topic_5406382",
  "title": "sonali2015",
  "author": "sonali2015",
  "created_time": "July 15, 2022, 10:05:16 AM",
  "content": "I  want to trade this site so any expert trader here who already trades this site. thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406382",
  "comments": [
    {
      "author": "mk4",
      "created_time": "July 15, 2022, 11:03:30 AM",
      "body": "While it seems to be a \"real\" exchange — If you have no reason to switch from your typical reputable exchanges like Binance/KuCoin/FTX, why not just stick to using them? I don't see anything special from KickEX for me to actually try it out and risk money on something that doesn't have that much reputation yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "July 15, 2022, 12:23:50 PM",
      "body": "Quote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksWell for me, this is a totally BS exchange, considering a nonsense exchange --they airdropped 800K KiCK token but no one has been converted into other cryptocurrencies or traded them. Perhaps this is your purpose why you are here, how you can trade the airdropped useless token that come from this exchange.I advise you to stay away from this exchange and forget the token that you have got if there is one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 15, 2022, 12:24:41 PMLast edit: July 15, 2022, 08:11:08 PM by Charles-Tim",
      "body": "To be specific, this is the exchange URL: https://kickex.com/The exchange is listed on Coinmarketcap, actually it is not a fake exchange but there are some listed exchange on Coinmarketcap that can be shaddy, so the exchange is not fake but I do not know if it is shaddy.https://coinmarketcap.com/exchanges/kickex/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sklopan",
      "created_time": "July 15, 2022, 12:26:20 PM",
      "body": "And how does it differ from many others?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChrisPop",
      "created_time": "July 15, 2022, 02:53:28 PM",
      "body": "Seriously, don't trade on shady, new exchanges. You take on unnecessary extra risk. The well-established exchanges like FTX, Binance, Coinbase, etc. already involve good amount of risk by not being properly regulated like a conventional broker. Nobody guarantees that your deposit or cryptocurrencies are safe. Ask yourself if you would be able to sleep at night knowing you have a significant amount of your stack on a platform named \"kickex\" that nobody heard about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 15, 2022, 04:42:49 PM",
      "body": "What's special about them? Isn't this project got that token that was airdropped and many have received it? I'm more interested on what happened to those than their exchange honestly.Quote from: mk4 on July 15, 2022, 11:03:30 AMWhile it seems to be a \"real\" exchange — If you have no reason to switch from your typical reputable exchanges like Binance/KuCoin/FTX, why not just stick to using them?  The same thought, there are too many good exchanges out there and people have been eyeing those that are not popular. At least with those reputable ones, they've proven themselves in any situation before, from good to worse and vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 15, 2022, 05:55:49 PM",
      "body": "Please don't put yourself at risk. Do you have any reason why you want to try that kickex exchange over the exchange that is long running and has good reputation such as kucoin, binance, coinbase or ftx. Don't increase the risk of you using a new exchange unless you really want to try it or that is the only exchange that have the pairs you are finding. It's the first time I heard such exchange and I honestly won't even try signing up with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "July 15, 2022, 06:00:24 PM",
      "body": "Quote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksWhy? Why are you not satisfied with the old, well-known, proven and reliable exchangers? Does kickex offer some unique and special conditions for trading? Even if that were the case, are you willing to put your money on the line and take the risk of depositing it into the exchanger's account?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "July 15, 2022, 06:09:48 PM",
      "body": "Quote from: m2017 on July 15, 2022, 06:00:24 PMQuote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksWhy? Why are you not satisfied with the old, well-known, proven and reliable exchangers? Does kickex offer some unique and special conditions for trading? Even if that were the case, are you willing to put your money on the line and take the risk of depositing it into the exchanger's account?Doesn't really sound like the exchange offered something different from the old like no transactio fees. But Kickex afaik was the one.who distributed 888,000 tokens to some eth wallets where they have to deposite some amount to claim.There were some.threads of this exchange but they did made them lose a reputation. If there is no reason to try it out, just don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "July 15, 2022, 06:57:59 PM",
      "body": "Quote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksKickex exchange platform is a very good platform. I never entered here though. But it has a famous name as a real exchange.But if you want to trade then definitely go to better exchange and trade which will be very good and convenient for you.You can trade on all these platforms like Binance Kucoin Ftx because of which you will get the most advantage and this exchange is very popular all over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 15, 2022, 07:59:33 PM",
      "body": "Quote from: Rigon on July 15, 2022, 06:57:59 PMKickex exchange platform is a very good platform. I never entered here though.Can't you do this kind of zero-information post somewhere else where bad advice won't cause a loss of money?How the hell do you know it's a good platform you've never even had an account on it?Quote from: Charles-Tim on July 15, 2022, 12:24:41 PMThe exchange is listed on Coinmarketcap, actually it is not a fake exchange but there are some listed exchange on Coinmarketcap that can be shaddy, so the exchange is not gaje but I do not know if it is shaddy.Yeah, it's not a fake/scam one but that indeed means one should trust it blindly.1) It is registered on the British Virgin Island2) It had an old Estonian license, those are getting revoked for anyone who has no physical presence or office in the country so they couldn't keep it and come with some bs excuse:QuoteThe fact is that Estonia easily joins sanctions, which often disadvantage citizens of certain countries. That’s why Kick Ecosystem has settled on the BVI (British Virgin Islands) and is expanding the geography of its users.- those two mean that if you're ever going to have a problem with them good luck getting your money back3) They have a moron in charge of writing the articles:QuoteCongratulations to Kick Ecosystem on our new home in the British Virgin Islands! But that’s not all — as of today KickEX exchange is wide open to new users from USA, Canada, Iran, Crime and countries which were blocked before!Everyone in Crime, do you trading here!!Of course, if nobody would give new exchanges a try there won't be any new exchanges at all since they wound't have customers, so we would be eventually left with some kind of oligopoly, but choose wisely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 15, 2022, 09:58:37 PM",
      "body": "Avoid the shit exchange, don't settle for less, yet we have so many good exchanges out there.If I recall very well, I think they even conducted an ICO at one point, but of course it was just a money making venture. The whole thing was a flop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "July 15, 2022, 10:29:10 PM",
      "body": "Quote from: Rigon on July 15, 2022, 06:57:59 PMQuote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksKickex exchange platform is a very good platform. I never entered here though. But it has a famous name as a real exchange.But if you want to trade then definitely go to better exchange and trade which will be very good and convenient for you.You can trade on all these platforms like Binance Kucoin Ftx because of which you will get the most advantage and this exchange is very popular all over the world.^ How good this exchange platform is? there are a lot of complaints that I have read before. No, I won't risk my money on exchange that they are not well known. It is better to use decentralized exchange if there is a token that you can trade there. There is no need to put our investment at risk if we know how to avoid it, this exchange is something that I did not trust plus additional those informations posted above was right. However, your decision must be followed and we already warned you OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 16, 2022, 11:37:20 AM",
      "body": "Quote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksIt makes no sense to risk your money by acting as a tester on an unknown cryptocurrency exchange. See what an abundance of already time-tested and having enough positive reviews offers the rating of Coinmarketcap: https://coinmarketcap.com/rankings/exchanges/ In addition, most of the TOP exchanges offer bonuses for newly registered traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "July 16, 2022, 11:41:25 AM",
      "body": "This is a shit exchange. I remember they are the startup exchange that launch an airdrop to all ETH holders while the token is freeze and you can only unlock it if you trade on there exchange with an insane amount. There exchange has no volume at so you will just buying high slippage token price when you use this exchange. Much better if you will use trusted CEX like Binance. Don’t risk your money on mediocre exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "July 16, 2022, 03:14:39 PM",
      "body": "Quote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksHaven’t heard about the trading platform.How come OP you come across this site/platform. And also i am curious to know that why you want to join this platform?There are already many reputable sites and exchanges present in the market with great reputation and history.I would suggest to choose any one of them and use for trading.For more safety, go with Binance or Kucoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "July 16, 2022, 07:53:16 PM",
      "body": "I went to coinmarketcap and saw that this exchanger is in a good ranking. But it is being used for lowtest and its trade volume is fairly good. But I think there is no need to use it where there are many good exchangers already. You can trade in binance, FTX, and Ku-coin these exchanges professionally where at least you don't need to worry about the security and usabilty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 16, 2022, 09:59:04 PM",
      "body": "Quote from: sonali2015 on July 15, 2022, 10:05:16 AMI  want to trade this site so any expert trader here who already trades this site. thanksWhere do you find this site? Looks like a small exchange with a good volume of trades but I don’t know if its a real volume or not. Well, I’d rathe risky my money on the top exchanges than using this one honestly. If you find no reason to use this platform better not to try at all. If your token listed on this exchange, try to convert it now and transfer it into a better site. I can only suggest this site if the token you’re looking for is only listed here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 17, 2022, 02:58:13 AM",
      "body": "i don't know why so many new members keep asking about new exchange that are mostly scam, when legit exchange seems to be everywhere. i mean if the OP wants to try is can go ahead with your risk. Haha. but like I was said in other post if you still wants to try it check in WHO iS whats the background of the exchange if the site pretty new but they have High volume is pretty much fake so beware",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}