{
  "id": "topic_5467414",
  "title": "Promocodeudo",
  "author": "Promocodeudo",
  "created_time": "September 20, 2023, 05:06:39 AM",
  "content": "This situation got my attention, Nigerians are currently facing hard times because of the inability of our government to hold the bull by the horns, the high cost of living is attributed to the government lapses in planning, and the government of the day has made it almost impossible for our naira to have value for whatever goods we want to purchase, and this portrays a high level of danger, Nigeria is a great country that is blessed with natural resources, I think out government to rethink and get the right things done for the sustenance of it citizen, prices of what the citizen need keep on rising every day to the extent that, if you buy something today by tomorrow the price will go up, when will all this stop, I think there is no price control in Nigeria because of the insincerity, what we here every day is excuses, no action of hope, I know that government can not feed everyone or provide employment for all, but they can create an enabling environment to lure foreign and domestic investors in different sectors that had been abandoned or that's facing under/ mismanagement, government anti-peoples policies should be reviewed in other to caution this condition being faced by people in this country, I think Nigerians has being push to the wall, some many homes barely feeds twice a day not because the can't hustle but because the hustling is no where to be found, even the mason work people manage with, is not anywhere because the price of building materials is on the high side, currently you can only see real estate firms building but not even the level it was before, the government needs to start from somewhere because the masses are suffering much and this might cause more insecurity is not handled very well.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467414",
  "comments": [
    {
      "author": "Broadanbig",
      "created_time": "September 20, 2023, 07:20:07 AM",
      "body": "It is true that the cost of living in our dearly beloved nation is on the high side and our government is doing nothing about it to cushion the effect of it on her citizens and this has so far caused untold hardship on Nigerians who can not afford two square meal a day. Policies implemented are not favorable to the sustenance and economic growth our nation. It is usually said that the laws and policies are made for the poor and not the rich here in Nigeria. So by doing so, the average Nigerians are held bound by those policies which does not enable them to survive the hardship of the economy. The mismanagement of  resources by our leaders is nothing to write home about. Constant devaluation of our currency as a result of over dependent on importation of foreign goods when we have  the financial strength to make available those equipment used in producing those goods coupled with the government inability to create an enabling environment for production. All these put together are just making things difficult for Nigerians and the government is not ready to look into it  for possible resolution.It is nice you brought up this topic but I think similar topic of this nature already exist here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "September 20, 2023, 08:22:28 AM",
      "body": "Di cost of living de very high for Nigeria now, prices of goods and services de skyrocket everyday. I don reason am say if any Nigerian de wait wen government go make di economy beta, na sorry be im name, because poverty na im di person de invite for im life. My morale be say in di midst of all di hardship people still de make am for di country, millionaires de emerge everyday. So how dem do am, na to reason outside di box. Dat na why person like me come adopt bitcoin, because I see prospect to make am for inside, if i diligently follow di guidelines well, I go de earn inside am, join di small business wey I de do. E get plenty ways to make money inside bitcoin, even dis bitcoitalk forum wey we de inside people de earn money take support life.E don te we we de hear say e go better, but with every administration wey enter dem go give promises of a beta Nigeria, in di end di economy go became worse off dan wen dem enter. My advice for every Nigerians, na to be di change wey dem wan see, so in our own little ways make we de do di right things to make di country a beta place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "September 20, 2023, 04:37:16 PM",
      "body": "Bro I no go lie this your topic really long for me to read and the truth be say I believe say you they pass very educative message judging from the first few lines I been read and I believe  say plenty people especially people for we country no dey see the country as the Africa gaint again because e don already get alot several other africa countries wey don better pass us by far.Secondly,  cost of living wan kill the living  and Nigeria don already dey turn to object of laughter and that's bad and under the new administration wey just turn 100 days, alot of hardship and pains and e be like them don dey fulfil  the scripture and e be like we don dey miss buhari",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "September 20, 2023, 05:10:56 PM",
      "body": "Quote from: Promocodeudo on September 20, 2023, 05:06:39 AM the government needs to start from somewhere because the masses are suffering much and this might cause more insecurity is not handled very well. You sure say the government know where to start from because me I see them as confused people with no agenda for Nigerians. The way things don be for the country presently, na only you fit help yourself find wetin you go fit use fey earn a living. This is why learning of skill is important because many people will need your service and this way you go fit use am dey survive till you hama, because me I believe say God no put our future for these leaders' hand, If not nobody go make am, with the way wey them dey mismanage our resources.Nigeria is not a country that supports manpower development or wey dey appreciate your gift and talent because these wicked leaders no want make poor man pikin dey rob shoulder with them at all. This na why them dey do everything to choke poor people them but the truth be say God na him get power pass them. Any Nigeria citizen that can survive in Nigeria, will surely make it when he travels to overseas because of the lesson wey suffer don teach am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abdulzuruku01",
      "created_time": "September 20, 2023, 07:33:33 PM",
      "body": "Quote from: Promocodeudo on September 20, 2023, 05:06:39 AMThis situation got my attention, Nigerians are currently facing hard times because of the inability of our government to hold the bull by the horns, the high cost of living is attributed to the government lapses in planning, and the government of the day has made it almost impossible for our naira to have value for whatever goods we want to purchase, and this portrays a high level of danger, Nigeria is a great country that is blessed with natural resources, I think out government to rethink and get the right things done for the sustenance of it citizen, prices of what the citizen need keep on rising every day to the extent that, if you buy something today by tomorrow the price will go up, when will all this stop, I think there is no price control in Nigeria because of the insincerity, what we here every day is excuses, no action of hope, I know that government can not feed everyone or provide employment for all, but they can create an enabling environment to lure foreign and domestic investors in different sectors that had been abandoned or that's facing under/ mismanagement, government anti-peoples policies should be reviewed in other to caution this condition being faced by people in this country, I think Nigerians has being push to the wall, some many homes barely feeds twice a day not because the can't hustle but because the hustling is no where to be found, even the mason work people manage with, is not anywhere because the price of building materials is on the high side, currently you can only see real estate firms building but not even the level it was before, the government needs to start from somewhere because the masses are suffering much and this might cause more insecurity is not handled very well. The high cost of living in Nigeria today 50% na our own fault no be government fault. I know sey we no get market control for Nigeria and people wey dey sell for market nowadays dey pray make things dey cost everyday.Na who get strong connection dey see work for both private and public sectors for dis country today and na why youths dey put dem sef for bad bad things bcos country hard and no work no dey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartgoat",
      "created_time": "September 21, 2023, 08:16:41 PM",
      "body": "Quote from: Promocodeudo on September 20, 2023, 05:06:39 AMThis situation got my attention, Nigerians are currently facing hard times because of the inability of our government to hold the bull by the horns, the high cost of living is attributed to the government lapses in planning, and the government of the day has made it almost impossible for our naira to have value for whatever goods we want to purchase, and this portrays a high level of danger, Nigeria is a great country that is blessed with natural resources, I think out government to rethink and get the right things done for the sustenance of it citizen, prices of what the citizen need keep on rising every day to the extent that, if you buy something today by tomorrow the price will go up, when will all this stop, I think there is no price control in Nigeria because of the insincerity, what we here every day is excuses, no action of hope, I know that government can not feed everyone or provide employment for all, but they can create an enabling environment to lure foreign and domestic investors in different sectors that had been abandoned or that's facing under/ mismanagement, government anti-peoples policies should be reviewed in other to caution this condition being faced by people in this country, I think Nigerians has being push to the wall, some many homes barely feeds twice a day not because the can't hustle but because the hustling is no where to be found, even the mason work people manage with, is not anywhere because the price of building materials is on the high side, currently you can only see real estate firms building but not even the level it was before, the government needs to start from somewhere because the masses are suffering much and this might cause more insecurity is not handled very well.  high cost of goods and other things in this country is too much. come again the government is not helping matter at all. because they have failed Nigerians. no employment, and there is no way to regulate the price of things. everybody is doing anyhow. something I'm afraid of this country because I don't know what will happen in this country in next two years. we really need God intervention in this country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "September 21, 2023, 09:30:24 PM",
      "body": "Op next time try  dey paragraph your work so dat e go sweet for eyes. I no go lie  this your topic goes well as nah the situation wey every Nigerian dey currently face. Person go receive salary for month end the money no get value with only one bag of rice salary don finish, nothing now for market wey never add price 5x higher.The worst part of this hardship be say the government no even get blue print wey dem de use wey we fit ook at and say ok with time tins go better. Asin no hope at all. There's no sector of the county wey person go fit just look and get hope. Insecurity, employment, empowerment, prices of foodstuffs, electricity, healthcare etc etc, no area you go look and get joy say genuinely it's getting better.  I just feel say dis Naija don supposed reach wen military go just take over small make tins stabilize then we move back again to civilian rule.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Salahmu",
      "created_time": "September 21, 2023, 09:49:27 PM",
      "body": "In Nigeria whenever something goes up it doesn't come down again, I'm surprised why tthe government are not able to control the prices of commodities, at least there should be some sorts of agencies established to enforce price control were as they make sure everybody sells at the required price and if found anybody selling above what his suppose to be selling will be persecuted and charged to pay a certain about for violation of rules, with that the prices of commodities will be moderate were as everybody sells at the same price but perhaps the government doesn't really care the survival of the people if not they would have done something about it because the rate at which things are costly in this country will seriously affect the less privileges were as they cannot afford to buy somethings for themselves, is actually a real situation and government have to do something about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 22, 2023, 04:00:28 PM",
      "body": "Quote from: Salahmu on September 21, 2023, 09:49:27 PMIn Nigeria whenever something goes up it doesn't come down again, I'm surprised why tthe government are not able to control the prices of commodities, at least there should be some sorts of agencies established to enforce price control were as they make sure everybody sells at the required price and if found anybody selling above what his suppose to be selling will be persecuted and charged to pay a certain about for violation of rules, with that the prices of commodities will be moderate were as everybody sells at the same price but perhaps the government doesn't really care the survival of the people if not they would have done something about it because the rate at which things are costly in this country will seriously affect the less privileges were as they cannot afford to buy somethings for themselves, is actually a real situation and government have to do something about.  No be lie you tok for there. I just dey reason with my guy sometime back how before you fit use 1k prepare beta soup and e fit still reach to cook stew but now, that money no fit even prepare food wey go last one full day. The contri don cast to the point say our money no get value anymore. Before, we fit use #1000 buy beta stuff for Ghana but now, their cedi don hot pass the naira and this morning, the naira dey trade at #993 to a dollar. Nah all this dey add to increment in the cost of living yet wetin our government dey promise us? \"Relax, all will be fine\". Maybe nah wen we don kpai because of hunger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "September 22, 2023, 06:33:46 PM",
      "body": "Quote from: Ruttoshi on September 20, 2023, 05:10:56 PMNigeria is not a country that supports manpower development or wey dey appreciate your gift and talent because these wicked leaders no want make poor man pikin dey rob shoulder with them at all. This na why them dey do everything to choke poor people them but the truth be say God na him get power pass them. Any Nigeria citizen that can survive in Nigeria, will surely make it when he travels to overseas because of the lesson wey suffer don teach am.It is no longer new that our great country Nigeria is still underdeveloped and at such our economy is still very down, the rate of unemployment is increasing everyday making it difficult for our leaders to shift their thinking of stealing to human capital development which can help to push the development of the economy to a better position but still I tend to disagree that our country or leaders doesn't the gift or talent of her citizens as you stated. Our leaders may be very corrupt but one thing we can not deny is the level of support they have rendered to some of our people who have shown some level of seriousness in their different careers, talents and so on. You don't expect the leaders which are our politicians to help you to become like them or be in same position with them when you understand the risk they stand to face once you realize the evil they have done and you don't expect them to render all the help to you when they also sacrificed a lot to assume the position they occupy I think the best thing for us to do as good citizens is to fight to elect credible leaders who can work on our economy and human capital development instead of waiting for the government to appreciate our talents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "September 22, 2023, 07:11:10 PM",
      "body": "Quote from: Ruttoshi on September 20, 2023, 05:10:56 PMQuote from: Promocodeudo on September 20, 2023, 05:06:39 AM the government needs to start from somewhere because the masses are suffering much and this might cause more insecurity is not handled very well. You sure say the government know where to start from because me I see them as confused people with no agenda for Nigerians. The way things don be for the country presently, na only you fit help yourself find wetin you go fit use fey earn a living. This is why learning of skill is important because many people will need your service and this way you go fit use am dey survive till you hama, because me I believe say God no put our future for these leaders' hand, If not nobody go make am, with the way wey them dey mismanage our resources.Nigeria is not a country that supports manpower development or wey dey appreciate your gift and talent because these wicked leaders no want make poor man pikin dey rob shoulder with them at all. This na why them dey do everything to choke poor people them but the truth be say God na him get power pass them. Any Nigeria citizen that can survive in Nigeria, will surely make it when he travels to overseas because of the lesson wey suffer don teach am.@Ruttoshi, paddy you talk well for this matter, say baba God no put our future for this leaders them hand and nah true talk you talk so, one thing for this country nah to know how to read and write then also to learn useful skill at a tender age so when you they grow up and life no they as you plan am you fit use your skill take help your self in one way or the other.So many people today, some of them no attend school but with the skill way them get, them they use am survive for this country, but nowadays I see am say some youths they find am too difficult to learn skills because them they think am say ma waste of time but the few ones way they try to learn they very committed and humble to learn.Yes, you get point, and I like your point, as you say Any Nigeria citizen that can survive in Nigeria, will surely make it when he travels to overseas, nah true talk you talk because as we they learn lessons for this our country, if we see those ones for other countries, e no go choke us again because we done already encounter the ones way pass that one and nah why our fellow Nigerians way they abroad dey always prosper come back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uhwuchukwu53",
      "created_time": "September 24, 2023, 02:19:41 AM",
      "body": "What you have said is the disheartening and is showing deep on our people but we really need to sit up because with the look of things more of situation like this will still occurred because no plan on ground to remedy the challenges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adams0001",
      "created_time": "September 24, 2023, 01:25:26 PM",
      "body": "Quote from: Salahmu on September 21, 2023, 09:49:27 PMIn Nigeria whenever something goes up it doesn't come down again, I'm surprised why tthe government are not able to control the prices of commodities, at least there should be some sorts of agencies established to enforce price control were as they make sure everybody sells at the required price and if found anybody selling above what his suppose to be selling will be persecuted and charged to pay a certain about for violation of rules, with that the prices of commodities will be moderate were as everybody sells at the same price but perhaps the government doesn't really care the survival of the people if not they would have done something about it because the rate at which things are costly in this country will seriously affect the less privileges were as they cannot afford to buy somethings for themselves, is actually a real situation and government have to do something about. How you want make this new government fit control price issue where the other one  were dey before no fit, now everyone just dey ne dey find place where him go dey get chop ne, our country just dey as he be people just dey suffer money no get too much value again, anything just dey expansive now, poor people just dey suffer nothing to eat this our new government never even reach 1month fuel just add price like Bitcoin, na only God just dey help us for this our country, and our government never talk anything about am fuel add price food stuff follow am too, Make him do something now before we enter next year because if fuel no come down nothing even foodstuffs go dey increase anytime I don't know or na the people were dey under him dey make things hard for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roseline492",
      "created_time": "September 24, 2023, 06:01:38 PM",
      "body": "Omo the country mata tire me oo, the same thing everyday, the more we they feel say our obodo Nigeria go better the more e they worst, prices of commodities just increase everyday, and government no they even reason how them go take empower people to reduce unemployment rate. Before 1k u go fit ues am buy or cook better soap way go fit serve two to three days but now 1k self no go fit buy better meat let alone use am cook soup, things done cost so teh 20 naira self no get value again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartCharpa",
      "created_time": "September 26, 2023, 09:55:47 PM",
      "body": "Quote from: Promocodeudo on September 20, 2023, 05:06:39 AMThis situation got my attention, Nigerians are currently facing hard times because of the inability of our government to hold the bull by the horns, the high cost of living is attributed to the government lapses in planning, and the government of the day has made it almost impossible for our naira to have value for whatever goods we want to purchase, and this portrays a high level of danger, Nigeria is a great country that is blessed with natural resources, I think out government to rethink and get the right things done for the sustenance of it citizen, prices of what the citizen need keep on rising every day to the extent that, if you buy something today by tomorrow the price will go up, when will all this stop, I think there is no price control in Nigeria because of the insincerity, what we here every day is excuses, no action of hope, I know that government can not feed everyone or provide employment for all, but they can create an enabling environment to lure foreign and domestic investors in different sectors that had been abandoned or that's facing under/ mismanagement, government anti-peoples policies should be reviewed in other to caution this condition being faced by people in this country, I think Nigerians has being push to the wall, some many homes barely feeds twice a day not because the can't hustle but because the hustling is no where to be found, even the mason work people manage with, is not anywhere because the price of building materials is on the high side, currently you can only see real estate firms building but not even the level it was before, the government needs to start from somewhere because the masses are suffering much and this might cause more insecurity is not handled very well. My brother na better thing you dey talk so but you see this our country ehn we don dey complain about one issues for so long and yet the governments no want to hear our cry, waiting dey surprise me be say is it that they are not hearing that the poor are complaining about the issue that is going on in this country, each of our surrounding even person wey this issue no touch e no waiting dey sup for this country, no work has been provide to the youth, that is why we go dey see youth go dey shout say school na scam, as they don't want to employ people again until you have connection everywhere, this country matter na by who know person oo son of nobody if God no help am for this country he go face a lot. No be only poor people e dey hard to chop this time around even some rich people don dey see shege too, who else for this country that has not complain about the government?Normally we suppose complain about the issue going on in our country but the main problem is that even if we do are dey going to change? Shey governments dey see poor shading tears? We be dey think say na Buhari problem but now i think we all have realized that is APC problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Versatile_choice",
      "created_time": "September 27, 2023, 11:31:24 PM",
      "body": "Nigeria that has been known to be the giant of Africa with enough mineral resources name them, Nigeria have all it takes to become a great nation were countries in the world would be wishing to live but it was quite unfortunate that our leader has there own plans and agenda on how they can mode the country money to there pocket were as the masses are suffering from abject poverty feeding from hand to mouth, the cost of living is very high, somethin we can easily buy with small amount before is now very difficult to get again, I don't really no the way forward for this country because if the circle of leaders continues the suffering will always continue onless God intervention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 29, 2023, 03:30:31 AM",
      "body": "Quote from: Promocodeudo on September 20, 2023, 05:06:39 AMThe high cost of living is attributed to the government lapses in planning, and the government of the day has made it almost impossible for our naira to have value for whatever goods we want to purchase, and this portrays a high level of danger, Nigeria is a great country that is blessed with natural resources, I think out government to rethink and get the right things done for the sustenance of it citizen, Everything starts from voting the right persons into office and also we destroying whatever cartel is in Abuja controlling all the president that get into office to change dem from the initial plans dey had for the country to what suits the cartel over there because how will everybody be doing the wrong things, e means say something dey happen for that top wey we no dey understand. Goodluck Jonathan had go plans for the country but e no work, even Buhari been start very well but everything collapse. Our problem is coming from bad governance because if we get it right from the voting poll we no go get problem again for this country as we dey bless but no know how to use am because our government no wan give us breakthrough, dem want make we dey surfer so we go be their puppet for electoral malpractice to give them power again.Quote I think Nigerians has being push to the wall, some many homes barely feeds twice a day not because the can't hustle but because the hustling is no where to be found, even the mason work people manage with, is not anywhere because the price of building materials is on the high side, currently you can only see real estate firms building but not even the level it was before, the government needs to start from somewhere because the masses are suffering much and this might cause more insecurity is not handled very well.Those Real estate people self dey take risk building all those costly building, the average Nigeria no fit afford their house and na the small favored people wey get luck get better paying jobs fit afford the house and again yahoo (illegal people). If we get a good government dem go invest in human development and creating jon opportunity for people to hustle and not only stomach infrastructure wey no go pass 24hrs and e dun finish. Nigerians dey ready to hustle but no better hustle dey for person to do although we get online hustle now and na there the Gold dey so na for we to get sense on our own and not wait on the government. Shuku eye for digital skills that'll help us get something from this internet money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Youngkhngdiddy",
      "created_time": "September 29, 2023, 06:58:41 PM",
      "body": "Quote from: CryptopreneurBrainboss on September 29, 2023, 03:30:31 AMThose Real estate people self dey take risk building all those costly building, the average Nigeria no fit afford their house and na the small favored people wey get luck get better paying jobs fit afford the house and again yahoo (illegal people). If we get a good government dem go invest in human development and creating jon opportunity for people to hustle and not only stomach infrastructure wey no go pass 24hrs and e dun finish. Nigerians dey ready to hustle but no better hustle dey for person to do although we get online hustle now and na there the Gold dey so na for we to get sense on our own and not wait on the government. Shuku eye for digital skills that'll help us get something from this internet money. The country’s economy is rapidly going on a down slide with high cost of living and low income. The government is not helping in the tackling this crisis, we still have a lot of unemployed youth out there who are still looking for their way. And many graduates coming out of school to face the labour market. The government is not helping matters in tackling this problem. A lot of hardworking youth and workers who are looking for opportunities  to shine in their field are not given the chance to show their skill and talent. The masses are desperate thereby turning into other available means of survival. The high cost of living is currently pressing the neck of everyone in the country. Due to the removal of the subsidy the price of fuel went up, affecting both the price of goods and services as well. Both the lower and middle class families will find their selves struggling to meet up with standard of living.  The government will need to handle this situation with precautions cause the people are desperate and hungry. A hungry man is an angry man. People can vent to joining illicit activities just to meet up with the standard of living. An increase in salary will help the civil workers, provision of job opportunities for the masses, and thanks to the internet and it’s benefits. A lot of Nigerian youth are not making very good use of the internet to better their lives. The government can do better in easing the burden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "September 29, 2023, 08:01:48 PM",
      "body": "Quote from: Versatile_choice on September 27, 2023, 11:31:24 PMNigeria that has been known to be the giant of Africa with enough mineral resources name them, Nigeria have all it takes to become a great nation were countries in the world would be wishing to live but it was quite unfortunate that our leader has there own plans and agenda on how they can mode the country money to there pocket were as the masses are suffering from abject poverty feeding from hand to mouth, the cost of living is very high, somethin we can easily buy with small amount before is now very difficult to get again, I don't really no the way forward for this country because if the circle of leaders continues the suffering will always continue onless God intervention. The matter with this country be say na all of us be the problem because everyone in Nigeria has let that foul spirit cover them that has to do with corruption. The leader of this country are a major cause yes but the citizens of the country too are a big contributor to this act. Well like you said only God can help us and we all pray that a saviour comes to rid the plague that is in this country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}