{
  "id": "topic_5397911",
  "title": "GazetaBitcoin",
  "author": "GazetaBitcoin",
  "created_time": "May 09, 2022, 04:50:42 PMLast edit: May 14, 2023, 11:46:29 AM by GazetaBitcoin",
  "content": "Din pura intamplare, am vazut pe un site obscur (imi scapa acum -- intamplarea a avut loc in urma cu ceva vreme, dar nu am apucat sa postez de ceva timp) o stire despre Elrond, care a achizitionat recent o companie care era eligibila de a emite carduri VISA, precum si coduri IBAN.Este vorba de Capital Financial Services (Twispay), din Sibiu. Cum stirea m-a intrigat la vremea respectiva, am cautat un pic pe Google si am gasit un articol din Ziarul Financiar care detalia operatiunea, oferind totodata si o alta stire, despre care, de asemenea, nu aveam habar. Stiu ca la momentul respectiv m-am si intrebat: oare cum de am ratat stirea aceasta, despre un proiect crypto romanesc care este si destul de dezvoltat?. Am ajuns la concluzia ca s-a intamplat, cel mai probabil, din cauza presei romanesti care nu difuzeaza prea multe stiri despre crypto... ceea ce este trist.Revenind, insa, iata cateva detalii extraordinare:Quote„Această decizie istorică a Băncii Naţionale a României deschide calea pentru cetăţenii Uniunii Europene, şi în curând pentru oamenii de pretutindeni, să aibă beneficii semnificative generate de transferuri de valoare care sunt instantanee şi se realizează la o fracţiune din costurile curente, cu multiple avantaje suplimentare aduse de un sistem care asigură transparenţă şi disponibilitate în orice moment” a declarat Beniamin Mincu, CEO al Elrond Network, într-un comunicat de presă.Concret, Twispay este o instituţie financiară licenţiată să presteze servicii de plată şi să emită monedă electronică în conformitate cu legislaţia aplicabilă şi autorizaţia emisă de BNR. Totodată, deţine statutul de membru principal Visa, ceea ce înseamnă licenţă de emitere carduri Visa, precum şi statutul de membru principal Mastercard, care înseamnă licenţă de emitere carduri MasterCard şi acceptare la plată a cardurilor.A doua stire pe care o furnizeaza acelasi articol este de fapt un hyperlink catre o stire mai veche, dar de care, de asemenea, nu auzisem:QuoteSibienii de la Elrond cumpără procesatorul de plăţi crypto Utrust din Portugalia. Echipa anunţă plăţi mai rapide şi o funcţie care le permite comercianţilor să câştige în plus din plăţile clienţilorAparent, aceasta operatiune a avut loc la inceputul anului.Mi se pare incredibile realizarile celor de la Elrond, pe care tin sa-i felicit cu aceasta cale. In plus, pe vremea in care Lauda inca era un membru activ, am observat cu uimire ca ea (el?) era si OP la topic-ul Elrond de pe forum. Dupa ce Lauda a parasit forumul, s-a schimbat si OP-ul acelui topic, insa tin minte ca m-a uimit ca un proiect atat de nou a reusit sa convinga pe un membru cu atata greutate, precum Lauda, sa le tina topic-ul de ANN de pe forum...In orice caz, una peste alta, nu am vazut nimic din stirile de mai sus la TV, nici in mass media. Primul articol l-am gasit din pura intamplare, pe un site al carui nume nici nu mi-l mai amintesc. Noroc ca a aparut stirea si pe ZF, dar acoperirea presei in ceea ce priveste crypto lasa mult de dorit...Cu toate aceste, fenomenul crypto in Romania infloreste. Ce scriu acum este relativ departe de subiectul principal, insa nu am vrut sa mai deschid un topic nou in acest sens.Intr-o zi, in timp ce sofam pe Titulescu in drum spre Piata Victoriei, am vazut pe dreapta un magazin numit Crypto Flowers!Iar reclama lor e de nota 20 - Ne place tehnologia, dar ne plac si florile! Sau, cum ar spune bunul nostru prieten biguy, 👍100%",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397911",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "May 10, 2022, 07:04:37 AM",
      "body": "Quote from: GazetaBitcoin on May 09, 2022, 04:50:42 PMDin pura intamplare, am vazut pe un site obscur (imi scapa acum -- intamplarea a avut loc in urma cu ceva vreme, dar nu am apucat sa postez de ceva timp) o stire despre Elrond, care a achizitionat recent o companie care era eligibila de a emite carduri VISA, precum si coduri IBAN.Este vorba de Capital Financial Services (Twispay), din Sibiu.O chestie interesanta este ca TwisPay este (si) procesator de plata. Imi doresc cat mai multi procesatori sa accepte Bitcoin (chiar daca TwisPay inca nu o face, dar sper ca este pasul urmator).Partea cu VISA nu stiu cat de interesanta e de fapt; un card VISA este acceptat linistit fara sa conteze prea mult unde a fost emis. Cardurile mai \"spalate\" nici nu mai au comisioane extra la conversia EUR-RON. Deci cred ca ai nostri s-ar putea sa cam fi pierdut acel tren. Nici macar nu voi intra prea mult in detalii legate de KYC, cerinte BNR/ANAF samd; dar trendul pare sa fie in sfarsit spre renuntarea la servicii KYC si platit direct cu BTC, deci, de ce nu si la noi?Overall, da, jos palaria, Elrond se misca foarte bine. La o tara cu asa background IT ma si mir cum de suntem asa in urma la partea de antreprenoriat crypto. Poate ca macar Elrond va mai spala un pic din rusine.Si legat de Crypto Flowers, la cat mai multe asemenea magazine!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "May 10, 2022, 02:44:27 PM",
      "body": "Quote from: NeuroticFish on May 10, 2022, 07:04:37 AMImi doresc cat mai multi procesatori sa accepte Bitcoin (chiar daca TwisPay inca nu o face, dar sper ca este pasul urmator).Si la mai mare!Quote from: NeuroticFish on May 10, 2022, 07:04:37 AMCardurile mai \"spalate\" nici nu mai au comisioane extra la conversia EUR-RON. Deci cred ca ai nostri s-ar putea sa cam fi pierdut acel tren.Cred ca miscare ajuta totusi la popularizarea celor de la Elrond... la modul general vorbind. Stii vorba aia - leu cu leu se face mia...Quote from: NeuroticFish on May 10, 2022, 07:04:37 AMOverall, da, jos palaria, Elrond se misca foarte bine. La o tara cu asa background IT ma si mir cum de suntem asa in urma la partea de antreprenoriat crypto. Poate ca macar Elrond va mai spala un pic din rusine.Da, din pacate, nu ne miscam foarte bine pe acest segment... In afara unor stiri de genul Anamaria Prodan a investit un milion de euro în criptomonede si, din cand in cand, cate ceva serios, ne miscam cam in ritm de melc... CryptoFlowers mi-a starnit zambete, in sensul bun al cuvantului. De asa ceva avem nevoie, nu de \"balene\" care promoveaza Pi sau, mai stiu eu, MyCoin...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "May 11, 2022, 09:16:55 AM",
      "body": "Quote from: GazetaBitcoin on May 10, 2022, 02:44:27 PMsi, din cand in cand, cate ceva serios, ne miscam cam in ritm de melc... CryptoFlowers mi-a starnit zambete, in sensul bun al cuvantului. De asa ceva avem nevoie,Da, avem nevoie, dar pe langa zambete nici nu facem prea mult (stiu, e destul de greu, la cat de putini sunt).De exemplu tin minte ca acum cativa ani era o firma (cred ca Grup West, din Oradea si/sau Arad) care vindea masini si accepta bitcoin. Doar ca ii accepta prin intermediul Netopia, deci probabil ca iesea cam prea scump la o masina. Nu cred ca mai vand asa, nu am mai gasit nicio informatie recenta.PCGarage vindea si cred ca inca vinde pe bitcoin. Tot scump, prin Netopia. Am mai cumparat de la ei, ca sa imi arat suportul. Dar nici nu cumpar atatea produse IT, si mai nou parca imi vine mai degraba sa schimb la ATM si sa-i dau cash curierului, si sa imi fac cumparaturile de la alte magazine.Deci e dragut sa avem asemenea magazine, dar in realitate ne uitam de 3 ori pana sa cheltuim bitcoin, iar apoi ne uitam inca de 2 ori daca sa cumparam direct cu bitcoin...De aceea sper ca procesatorii de plata sa intre mai serios. Sa fie pe de o parte concurenta si comisioane ceva mai mici, iar pe de alta parte sa putem cumpara de la oricare magazin vrem, chiar si cu bitcoin.Quote from: GazetaBitcoin on May 10, 2022, 02:44:27 PMnu de \"balene\" care promoveazaEi, astea sunt alt subiect. Si cred ca nu e rau sa promoveze bitcoin (dar clar, bitcoin si nu rahaturi si tepe), ca, vrem nu vrem, aceste personaje sunt modele pentru unii si pot sa ajute omul de rand macar sa nu isi faca cruce de 3 ori cand aude de bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rizzrack",
      "created_time": "May 11, 2022, 12:16:08 PM",
      "body": "Quote from: NeuroticFish on May 10, 2022, 07:04:37 AMO chestie interesanta este ca TwisPay este (si) procesator de plata.Pai au mai cumparat si UTRust (procesator de plata din Portugalia) deci cred ca TwisPay va fi folosit pentru canduri ... cumva legat de contul Mayar presupun si UTRust pentru procesator de plati (dupa cum scriai si tu ca deja au contract cu Elvila)Quote from: NeuroticFish on May 10, 2022, 07:04:37 AMPartea cu VISA nu stiu cat de interesanta e de fapt; un card VISA este acceptat linistit fara sa conteze prea mult unde a fost emis. Cardurile mai \"spalate\" nici nu mai au comisioane extra la conversia EUR-RON. Deci cred ca ai nostri s-ar putea sa cam fi pierdut acel tren. Cel mai probabil un produs similar cu cardurile de la Binance sau Crypto.com . \"Acum aveti ocazia sa folositi cardul Mayar... primul card crypto 100% Romanesc\" Eu asa as incepe campania de marketing  Quote from: NeuroticFish on May 10, 2022, 07:04:37 AMOverall, da, jos palaria, Elrond se misca foarte bine. La o tara cu asa background IT ma si mir cum de suntem asa in urma la partea de antreprenoriat crypto. Poate ca macar Elrond va mai spala un pic din rusine.Pai simplu: ca sa ai firma iti trebuie cont la banca. Si deja te-au blocat (ca tot mai veni vorba prin alte topicuri)Quote from: NeuroticFish on May 10, 2022, 07:04:37 AMSi legat de Crypto Flowers, la cat mai multe asemenea magazine!Cat costa crypto lalelele ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}