{
  "id": "topic_5462306",
  "title": "Trawda",
  "author": "Trawda",
  "created_time": "August 07, 2023, 03:05:37 AM",
  "content": "مرحبا إخوتيقرأت هذا الخبر على تويتر ولكنني غير متأكد من صحته بعد.\"ايلون ماسك يدخل المجال بقوة بإنشاء منصة X لتداول الاسهم والكريبتو #Bitcoin\"https://twitter.com/MnsNever/status/1687197674280472580?sهل هناك من سمع بهذا الخبر؟",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462306",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "August 07, 2023, 09:49:21 AM",
      "body": "هذا الخبر ليس له أي أساس من الصحة كما صرح المدير التنفيذي منذ أيام[1].نفس الأمر ينطبق حول امكانية اطلاق عملة للمنصة[2].[1] https://twitter.com/elonmusk/status/1687146854172303360[2] https://twitter.com/elonmusk/status/1687662311010631680",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "August 07, 2023, 05:20:33 PM",
      "body": "شكرا لك على التوضيحأنا رأيت الخبر على تويتر لكن لم أتأكد من مصدر آخر، كما رأيت أيضا في نفس الوقت ترويج كبير لعملة X وأعتقد أن ذلك مرتبط بهذا الخبر. ربما الأشخاص الذين يروجون لهذه العملة السكام روجوا أيضا خبر المنصة لذلك من الأفضل الانتباه أن لايقع أحد ضحية هذه الأخبار.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "August 07, 2023, 09:54:09 PM",
      "body": "Quote from: Trawda on August 07, 2023, 05:20:33 PMشكرا لك على التوضيحأنا رأيت الخبر على تويتر لكن لم أتأكد من مصدر آخر، كما رأيت أيضا في نفس الوقت ترويج كبير لعملة X وأعتقد أن ذلك مرتبط بهذا الخبر. ربما الأشخاص الذين يروجون لهذه العملة السكام روجوا أيضا خبر المنصة لذلك من الأفضل الانتباه أن لايقع أحد ضحية هذه الأخبار. التوتير ليس مصدراً موثوقاً لأخذ الأخبار الصحيحة منه أو أي من وسائل التواصل الاجتماعي، و علي الرغم من أن هناك مصادر عديدة مثل Semafor قد ذكرت أن تويتر قد تصبح مركزا لتداول الأسهم لكنها في رئيي تبقى مجرد مقترحات أو أفكار تم تقديمها لم يتم اعتمادها أو تأكيدها، وبما أن إليون ماسك قد أشار أنه لا يوجد عمل يتم القيام به بخصوص هذا الشأن على حد علمه، حيث ذكر ذلك الأخ أوميجا, فربما يكون هذا المقترح قيد التشغيل وقد لا يكون وشيكاً فيما بعد، الجدير بالذكر أنه كما ذكرت أنت فإن المحتالين يستغلون مثل هذه المقترحات والأخبار التي لم تثبت والتي يتم تداولها ويستغلون اسم منصة X، للترويج لعملات الرج بول الاحتيالية والدومينات التصيدية التي تؤدى إلى سرقة مستخدمي التويتر ومستثمري العملات الرقمية، لذلك ينبغى علينا الحذر وإجراء الابحاث الازمة والتأكد من صحة لأخبار التى نتحصل عليها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}