{
  "id": "topic_5460224",
  "title": "rachael9385",
  "author": "rachael9385",
  "created_time": "July 18, 2023, 12:57:29 PMLast edit: July 19, 2023, 09:44:16 PM by rachael9385",
  "content": "In the world to day gambling is leading instead of BitcoinBTC (crypto currency) and more are still wanting to join gambling because the minimum age to gamble is 18+ and lot of upcomings are waiting and this is the total amount of  gamblers, so let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gamble and my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460224",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "July 18, 2023, 01:10:54 PM",
      "body": "First I would say to clear the air, there are actually many gamblers because it has been a long thing way before bitcoin even came into existence so it’s adoption should is more even if many countries frown upon it. Also even the under 18s actually engage in gambling they just register with fake KYC. The most important thing is not the risk, I would say there many people who actually looking for a get rich quick scheme and gambling with all its risks is up there among them. For you to earn maybe much from bitcoin maybe daily is through trading and this requires extensive knowledge. The time to acquire this knowledge is what some gamblers do not want to spend. So it is not about risk because bitcoin is certainly less risky but rather the narrative or just gain an outrageous amount of profits and that is why we have so many people still investing in pump and dump coins because they just want to make money and don’t care about risk at all. So certainly bitcoin isn’t for this people because it’s gradual profits trend will only frustrate them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "July 18, 2023, 01:11:14 PM",
      "body": "Comparing gambling and Bitcoin is truly a mismatch. Gambling (in general) predates Bitcoin by several decades. It is evident that gambling is a highly profitable industry for casino owners and an addictive game for gamblers. In the gambling industry, they sell pleasure to the players. On the other hand, Bitcoin has a specific purpose for a brighter future as a form of wealth.While we can use Bitcoin for gambling beyond existing boundaries, that is not its primary objective. Bitcoin exists as an alternative valuable asset, not too different from stocks or gold. If a country were to enable Bitcoin payments, it would be advantageous to make the most of it.Quote from: rachael9385 on July 18, 2023, 12:57:29 PM my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  sourceGambling entails significantly higher risks compared to investing in Bitcoin. Are you not aware that in gambling, every loss can result in the complete loss of your money? However, such a scenario is impossible with Bitcoin. When you possess Bitcoin, the exchange rate becoming zero is highly implausible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wend",
      "created_time": "July 18, 2023, 01:37:33 PM",
      "body": "Quote from: rachael9385 on July 18, 2023, 12:57:29 PMIn the world to day gambling is leading instead of BitcoinBTC (crypto currency) and more are still wanting to join gambling because the minimum age to gamble is 18+ and lot of upcomings are waiting and this is the total amount of  gamblers, so let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gamble and my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  sourceBitcoin is an investment, not gambling, so comparing bitcoin investment with gambling is lame, and it's like you are implying bitcoin is gambling.People who like to gamble are people who want to make quick money without learning or having too much knowledge. While bitcoin is not a tool that can make you rich quickly, and you also need a lot of knowledge to be able to invest in bitcoin. In short, the comparison between bitcoin and gambling is that you are underestimating bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "July 18, 2023, 01:45:12 PM",
      "body": "Quote from: rachael9385 on July 18, 2023, 12:57:29 PMIn the world to day gambling is leading instead of BitcoinBTC (crypto currency) and more are still wanting to join gambling because the minimum age to gamble is 18+ and lot of upcomings are waiting and this is the total amount of  gamblers, so let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gamble and my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  sourceIt's all because people want money fast and they are given easy access to gambling platforms. Moreover, not everyone is educated about Bitcoin and even if they do, they are still not convinced to invest in it for whatever reason.And gambling has been around for a long time and has become a part of society in various places. Maybe in the future, if education about Bitcoin is evenly distributed in various places and access to it is easier, maybe there will be more people who adopt Bitcoin than people who gamble, who knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 18, 2023, 02:27:55 PM",
      "body": "Quote from: rachael9385 on July 18, 2023, 12:57:29 PMIn the world to day gambling is leading instead of BitcoinBTC (crypto currency) and more are still wanting to join gambling because the minimum age to gamble is 18+ and lot of upcomings are waiting and this is the total amount of  gamblers, so let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gamble and my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  sourceThere is no day we will compared gambling to bitcoin that's yet to be generally adopted and legalized. Bitcoin taking gradual process to get the required attention besides bitcoin is just barely 14 years now and I think we don't need to be in a hurry because even the gambling industry it's self was there since the origins of man creation. In fact man himself is a gamble so why do you wanna compared gambling to bitcoin that are yet to be Globally accepted as means of exchange of goods and services. So I will urge you to have patients and give bitcoin more time I said because good things takes a lots of time to get known.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 18, 2023, 02:57:28 PM",
      "body": "Gambling exists in ancient civilizations way before people have electricity, and yet you compare it with Bitcoin which only exist since 2009. However, I also agree with the above opinions about it's not actually comparable since these two are basically different things. Perhaps you mean trading Bitcoin (or trading in general) vs gambling as an activity, then the answer is probably because of the fun or gaming factor in gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "July 18, 2023, 03:04:57 PM",
      "body": "People see gambling as the quickest means of making money, this sound like the truth but we should also know that the possibility of losing all your stake is high, note generally, gambling includes both sporting activities and arguments that need clarity, and this may prompt individuals to bet money, pending on the findings, this is done immediately, whoever wins takes the money. Note individuals may either lose the money they use to stake in gambling or get double their stake depending on the amount they put in. But in Bitcoin, nobody loses all their investments, although your capital might shrink, the fact is, it can never be decreased to the point of losing all your input.In gambling your winning is almost immediate but in Bitcoin, it is a gradual process depending on your pattern of investment, it might be short-term or long-term. Some people might not like to settle for Bitcoin because of their lack of patience and how inquisitive they are to make money quick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 18, 2023, 03:06:49 PM",
      "body": "Currently, there are many gambling sites that apply crypto as their currency. Why is this happening? that's because crypto has convenience and independence. Crypto doesn't need kyc and people are lazy to fill out kyc, kyc is just an excuse for the government to collect taxes.Legal companies other than gambling sites should think twice about implementing cryptocurrency because it will definitely be difficult for the financial authorities and will be accused of being a place of money laundering. Even though there are several companies that implement crypto currency, they still ask for kyc, so it's no different from using fiat.Maybe if there wasn't a shadow of a state financial authority, many companies would implement crypto as a currency.Then why do so many people like to gamble instead of investing in bitcoin? of course this is something different. Bitcoin is an asset and currency while gambling is an activity. People see gambling as a quick way of making money, in fact  gambling is a quick way of spending money, bitcoin is an asset so you need to wait for the bitcoin price to rise to make a profit. Another way to make profit in bitcoins is by trading activities but it requires extensive knowledge and skills. Instead of learning about bitcoins, people prefer to gamble because it doesn't require much thought",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "July 18, 2023, 03:58:08 PM",
      "body": "You will not get an accurate answer. If your investment is random, without calculating the risks and with money you will need soon, without any plan and great greed, there is no difference between Bitcoin and gambling.Sometimes gambling is attractive because it is a short-term risk, you enter it with a probability of 50% profit and 50% in the simplest form (and this is absolutely not true, otherwise the gambling sites would not be profitable) while Bitcoin is a long-term investment, you invest today and wait for four years or more to achieve 500 % he won.It is rare for a novice investor to make a good profit from investing a small amount in Bitcoin for a short period, but it is possible in gambling.I do not recommend or encourage anyone to gamble, it is the fastest way to lose your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 18, 2023, 04:11:53 PM",
      "body": "Someone also mentioned the similarity with investing with stocks or gold and I agree with that. This may be also due to the lack of financial literacy. I mean how many people had been thought about this in school? There are some for sure but they are probably a small minority. You can learn gambling literally from everywhere starting from your house to school so it's not surprising that there are more people who knew how to gamble than to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 18, 2023, 04:23:32 PM",
      "body": "Quote from: rachael9385 on July 18, 2023, 12:57:29 PMthe minimum age to gamble is 18+ Officially they will made it publicly that 18years plus is the minimum age requirement for gambling but on the actually fact it doesn't work that way, we have many underaged that managed to gamble and we begin to wonder how comes they maneuver their way into gambling, the gambling platforms are to make money regardless of who is bringing it coming their way.Quote from: rachael9385 on July 18, 2023, 12:57:29 PMso let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gambleDo we have a statistics genuine enough to proof the numbers of gamblers all over the world outweighs bitcoin?  am not sire about this but despite we have to believe they aren't the same thing, there's much to differentiate about them all and i know that not everyone as well is a gambler out of the entire world population, the youths are most found gambling while bitcoin has no age limit or boundaries.Quote from: rachael9385 on July 18, 2023, 12:57:29 PMand my question is Why? or  is the risk involved in Bitcoin higher than gambling risk?And where did you get this kind of information from, gambling is more of risk than bitcoin, you can loose part of your money with bitcoin or have more opportunities to make more of it when you hodl your investment while gambling is a one chance entertainment that makes you loose your entire money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "July 18, 2023, 04:32:39 PM",
      "body": "Gambling has already been there since the ancient times while Bitcoin was invented and launch on 2009. If your comparison is all about the number of Bitcoin investors and gamblers, definitely that one can conclude that there are more gamblers than Bitcoin investors.Is this even an important matter to be compared? No.There is no point with this comparison. No matter how many gamblers are there in the world, still, Bitcoin remains to be one of the fastest growing assets in the entire history of humanity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "July 18, 2023, 04:43:32 PM",
      "body": "Quote from: rachael9385 on July 18, 2023, 12:57:29 PMIn the world to day gambling is leading instead of BitcoinBTC (crypto currency) and more are still wanting to join gambling because the minimum age to gamble is 18+ and lot of upcomings are waiting and this is the total amount of  gamblers, so let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gamble and my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  sourceThe market value of Bitcoin won't continuously and consistently increase, and that is the same with profit to be earned from investing into it and not to mention that not all people have huge mount of money to invest and gain big. While in gambking, even small amount could be x100 if you are that lucky. High risk, high reward. Indeed it is less risky to invest but the idea of gaining more in a shorter period of time is wht drgging people into gambling even if in reality it is more often to lose than to hit the jackpot in gambling. Are they having the wrong idea? Nope, they did it with hope on the line, means there's an inititive and that they embrace the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "July 18, 2023, 04:47:33 PM",
      "body": "There seems bit confusion in the article and what you asking. Article is all about the gambling games, gambling, and cryptocurrencies. It doesn’t really tell us whether we have more fan list in the gambling or in the Bitcoin. I think this comparison isn’t valid since we are comparing a “service” with the “currency”. I am not able to populate any sort of comparison points here. We are doing comparison between a currency that is actually being used to make transaction on gambling sites. One is part of pure investment and one is literally way to gamble your money (bitcoin/fiat) etc. I think it’s better to keep them different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "July 18, 2023, 04:57:55 PM",
      "body": "Gambling will always attract you more than investing because you don't need any specific knowledge or experience to gamble and gambling is as much fun as investing in Bitcoin but not as much fun. You can gamble one day and win money to build a house and one day gamble you can lose all money but there is no such record for Bitcoin. By investing in bitcoins you will not be able to own a lot of money overnight and there is no chance of losing your money so quickly. Nowadays, novice gamblers are more common than professional gamblers. There are new gamblers who become more interested in gambling only through various online advertisements, as a result of which most of the new gamblers end up losing their money by gambling. Even though there are more gamblers than Bitcoin, I will always consider Bitcoin as safer than gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "July 18, 2023, 05:12:31 PM",
      "body": "Actually everyone knows about gambling but some are not aware of bitcoin therefore gamblers are more than bitcoin investor. Other thing is that lots of people cannot wait more and don't have patience therefore they are involved in gambling to become rich more quickly as a result of which either they loss all money or make their money double.Gamblers will once earn profit but the future of gamblers will not be good as gambling is addiction which can make a person looser. Bitcoin is one of the best opportunity to earn passive income and enhance the worth of your money but for those who are interested in it as well as have a command to Control feelings and manage risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davian144",
      "created_time": "July 18, 2023, 05:28:22 PM",
      "body": "Quote from: rachael9385 on July 18, 2023, 12:57:29 PMIn the world to day gambling is leading instead of BitcoinBTC (crypto currency) and more are still wanting to join gambling because the minimum age to gamble is 18+ and lot of upcomings are waiting and this is the total amount of  gamblers, so let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gamble and my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  sourceFrom my personal understanding the risks of gambling and those involved in Bitcoin are very different and will never be the same. Because the risk of gambling is only about winning and losing, while the risk of owning Bitcoin does not include winning and losing if it is brought into investment or trading. So it is clear that the level of risk is still much higher for a gamble than a crypto asset like Bitcoin and if what I said doesn't give you a more complete understanding, now I will give another example of something that you find very often in life. That thing is money, will your risk in holding money be the same as your risk when playing gambling? Hopefully you can distinguish this because not all risks are the same or higher than gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 18, 2023, 05:46:44 PM",
      "body": "Bitcoin is a pretty young digital currency, while gambling is an activity that already exists in human society since its beginning. We can't compare both, because they don't have any similarities. What we could do is to speculate the impact of gambling inside Bitcoin adoption. That is, people who adopt Bitcoin for the main purpose of gambling online, and not exactly because they want to be Bitcoin investors and enjoy all the advantages it proportionate to them, as currency.As we know, Bitcoin gambling is highly popular, because it allows gamblers to play nearly anonymously from the comfort of their houses. So Bitcoin is indeed a great tool for those gamblers who were forbidden to play previously at fiat casinos, due to local regulations from their native countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Emmanuelex",
      "created_time": "July 18, 2023, 06:01:12 PM",
      "body": "Quote from: rachael9385 on July 18, 2023, 12:57:29 PMIn the world to day gambling is leading instead of BitcoinBTC (crypto currency) and more are still wanting to join gambling because the minimum age to gamble is 18+ and lot of upcomings are waiting and this is the total amount of  gamblers, so let's talk about the crypto currency (Bitcoin) we all know that Bitcoin is a good investment and it has changed a lot in the crypto world but the interesting part is that the numbers of Bitcoin investors can't be compared to gamble and my question is Why? or  is the risk involved in Bitcoin higher than gambling risk? Just chesk this  sourceWell, I think that's how it should be, because gambling is something that has been around for a very long time before we thought of Bitcoin, so there's the possibility that it would have more users/fans than we have in the Bitcoin community. But that doesn't mean the crypto community is small, there are so many people in the crypto community around the world, and more keeps joining every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}