{
  "id": "topic_5401237",
  "title": "Daltonik",
  "author": "Daltonik",
  "created_time": "June 03, 2022, 02:58:50 PMLast edit: June 06, 2022, 10:08:34 AM by Daltonik",
  "content": "Disclaimer: I am not a member of the development team or its representative, the content is provided solely for the purpose of familiarization, do not forget about the risks and potential consequences of excessive gambling. AidiBets Decentralised Crypto BettingAidiBets is a new platform consisting of sports betting and online casinos running on the BSC blockchain.  The Aidi Finance ecosystem development team launched a gambling platform on May 8, 2022 https://aidibets.io /, which includes sports betting and online casinos from more than 100 gambling games. The platform is based on the BSC blockchain and allows you to play using the Aidi token (BSC) using your Metamask or Walletconnect wallet.Aidibets allows users to play without KYC on the Web 3.0 platform, just connect your Metamask or Walletconnect(preferably using wallets not connected to your main storage) transfer a little Aidi(BSC) Contract: 0xb358b0e5A8943029e66175830D85198fE6cC93f6  Decimals: 9 At the moment, the token price is $0,0¹⁰19 you can buy tokens on PancakeSwap https://pancakeswap.finance/swap?outputCurrency=0xb358b0e5A8943029e66175830D85198fE6cC93f6Official Website and Social Media Links:  Website | Telegram Group | Twitter | Facebook  | Instagram  | Youtube | FAQ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401237",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "June 03, 2022, 03:14:42 PM",
      "body": "Are you a regular player on this site? If you have tested and have a good experience, it's okay to introduce the site here but if you didn’t, I think you shouldn’t. Also, it would be better if they had a representative from the team here so that they would help interested people with queries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "June 03, 2022, 03:23:42 PM",
      "body": "Welcome onboard, now there are quite a few Casino based web 3.0. There is a section where when I click on it doesn't appear as it should, I try to click on the payment method, only show a blank page, but I can say that your Casino loads fast enough.Quote from: Little Mouse on June 03, 2022, 03:14:42 PMAre you a regular player on this site? If you have tested and have a good experience, it's okay to introduce the site here but if you didn’t, I think you shouldn’t. Also, it would be better if they had a representative from the team here so that they would help interested people with queries.Agree with you because there will be questions that only a representative can answer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 03, 2022, 03:39:20 PM",
      "body": "My opinionDesign looks coolAccept web 3 via Metamask or Wallet connect, that is another cool advantage. No KYC, it's greatFrom the name of casino, AidiBets, it reminds me about Aidi finance, I search on Coinmarketcap.com and my thinking is rightDoes AidiBets only accept tokens on Binance Smart Chain?How about payments for winners on their web3 casino? Do you make any withdrawal from your won bets?On Coinmarketcap, there is information for AIDI on Uniswap only, no info for Pancakeswap. The AIDI team should work on this issue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panjul07",
      "created_time": "June 03, 2022, 04:02:13 PM",
      "body": "Quote from: Daltonik on June 03, 2022, 02:58:50 PMDisclaimer: I am not a member of the development team or its representative, the content is provided solely for the purpose of familiarization, do not forget about the risks and potential consequences of excessive gambling.You did a great effort to introduce this casino by creating this ANN thread, did they ask and pay you for this? It is rare to find people who want to do such effort to introduce unknown casino if there is no deal with the casino. If you have nothing to do with them, so who will be in charge to answer any queries in this thread or in this forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "June 03, 2022, 04:09:21 PM",
      "body": "Quote from: panjul07 on June 03, 2022, 04:02:13 PMQuote from: Daltonik on June 03, 2022, 02:58:50 PMDisclaimer: I am not a member of the development team or its representative, the content is provided solely for the purpose of familiarization, do not forget about the risks and potential consequences of excessive gambling.You did a great effort to introduce this casino by creating this ANN thread, did they ask and pay you for this? It is rare to find people who want to do such effort to introduce unknown casino if there is no deal with the casino. If you have nothing to do with them, so who will be in charge to answer any queries in this thread or in this forum? Each casino thread does have to have a representative so that it is easy for us to contact when there are some questions or problems that must be resolved, if this is a self-initiated then we don't necessarily trust it because we certainly need support that can answer every question.We'd better wait for the OP's clarification whether he has a deal with this casino or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 03, 2022, 04:17:28 PM",
      "body": "Quote from: Raflesia on June 03, 2022, 04:09:21 PMWe'd better wait for the OP's clarification whether he has a deal with this casino or not.OP already has clarified that. Check the text in your quoted part where he clearly said the sole purpose of the post is to familiarize the site in bitcointalk. I don't think it indicates any involvement or any financial motives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "June 03, 2022, 04:25:57 PM",
      "body": "A little bit of suggestion for @OP.I think you should ask the team to at least created \"Bitcointalk\" account, In case there has some problem or scam assumption then we all know which one needed to be tag or flag for the account.Since, @OP is only posted the ANN and don't have any relationship between the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "June 03, 2022, 05:07:01 PM",
      "body": "Quote from: ryzaadit on June 03, 2022, 04:25:57 PMI think you should ask the team to at least created \"Bitcointalk\" account, In case there has some problem or scam assumption then we all know which one needed to be tag or flag for the account.Since, @OP is only posted the ANN and don't have any relationship between the casino.I'm wondering why OP has created ANN thread of AidiBets while he isn't connected with the team of this website. Moreover, looks like he isn't hired by the AidiBets team to publish an ANN thread here. AidiBets has given much focus to the AiDi Finance token. OP has also created an announcement thread of AiDi Finance token in the forum and mentioned thisQuote from: Daltonik on September 23, 2021, 08:53:49 PMdisclaimer: I am not the owner or developer, just a participant in the projectI can't figure out the reason of promoting a token and betting website in this way where OP has no connection with the project team. AidiBets team should create an account in the forum. There is a high risk of playing in this gambling site as they don't have any official representative here to short out the issues (if happens).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "June 03, 2022, 05:28:01 PM",
      "body": "Quote from: panjul07 on June 03, 2022, 04:02:13 PMQuote from: Daltonik on June 03, 2022, 02:58:50 PMDisclaimer: I am not a member of the development team or its representative, the content is provided solely for the purpose of familiarization, do not forget about the risks and potential consequences of excessive gambling.You did a great effort to introduce this casino by creating this ANN thread, did they ask and pay you for this? It is rare to find people who want to do such effort to introduce unknown casino if there is no deal with the casino. If you have nothing to do with them, so who will be in charge to answer any queries in this thread or in this forum? The same question crossed my mind, you represent it. As I suspected, this is usually a form of entrusting promotional services to create threads, but in the end, we will definitely doubt it if there is no official representative. Representatives of each Casino that are presented in this forum will certainly play an important role in answering any questions that may later experience problems or whatever. If you only become a mediator or third party then it is not effective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "June 03, 2022, 05:49:55 PM",
      "body": "Quote from: ryzaadit on June 03, 2022, 04:25:57 PMA little bit of suggestion for @OP.I think you should ask the team to at least created \"Bitcointalk\" account, In case there has some problem or scam assumption then we all know which one needed to be tag or flag for the account.Since, @OP is only posted the ANN and don't have any relationship between the casino.yap, it's not good for the OP not to ask permission from the team from the site because if any problem occurs he (OP) must be responsible...this aidibets site has only been made for less than a month, so there must be a lot of bugs here and there and the system is not good yet. OP's reputation is at stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 03, 2022, 07:59:48 PM",
      "body": "Quote from: Renampun on June 03, 2022, 05:49:55 PMQuote from: ryzaadit on June 03, 2022, 04:25:57 PMA little bit of suggestion for @OP.I think you should ask the team to at least created \"Bitcointalk\" account, In case there has some problem or scam assumption then we all know which one needed to be tag or flag for the account.Since, @OP is only posted the ANN and don't have any relationship between the casino.yap, it's not good for the OP not to ask permission from the team from the site because if any problem occurs he (OP) must be responsible...Exactly my thought when I read the disclaimer note at the top of OP's post.But then am thinking, how did OP come about or got the infographics he used for the creation of this thread if he wasn't hired by the casino owners, and again, if truly he wasn't hired, (which I don't believe he wasn't) what then is the motivation? Why did he decide to announce this casino here when the casino owners themselves didn't ask for it?I don't know what everyone else here think, but I for a person believe OP was hired, but failed or forgot to add it in his disclaimer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "June 03, 2022, 08:22:01 PM",
      "body": "Welcome to bitcointalk forum!I see that website claim to be decentralized on bsc blockchain but that means we can't bet with Bitcoin but only with bsc tokens.Payment method page on website is not showing any information about accepted coins, but you need to add Bitcoin BTC if you want to have ANN in this board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "June 03, 2022, 08:28:04 PM",
      "body": "Quote from: Renampun on June 03, 2022, 05:49:55 PMQuote from: ryzaadit on June 03, 2022, 04:25:57 PMA little bit of suggestion for @OP.I think you should ask the team to at least created \"Bitcointalk\" account, In case there has some problem or scam assumption then we all know which one needed to be tag or flag for the account.Since, @OP is only posted the ANN and don't have any relationship between the casino.yap, it's not good for the OP not to ask permission from the team from the site because if any problem occurs he (OP) must be responsible...this aidibets site has only been made for less than a month, so there must be a lot of bugs here and there and the system is not good yet. OP's reputation is at stake.As a Legendary member of this forum then he for sure aware of this thing about risking out his reputation on recommending or exposing some sites which is recently created but he post up some disclaimer somehow which do shows about being unsure on what he had been posting on this board.Honestly site design isnt really just great compared on gambling sites that we do have on this market as of today but its not really that bad either.It do have that casual casino game and sports betting.Lets see if there would be someone who do took risk on getting some experience on this place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "June 03, 2022, 09:16:32 PM",
      "body": "It seems a good website, hope only that is really decentralized. Interface is really intuitive and you can play at the casino in really easy way.I guess that you should consider a welcome bonus without deposit in way to let users try your platform. I'll play it in the next days with the UEFA Nations League !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinAccepted",
      "created_time": "June 03, 2022, 09:16:55 PM",
      "body": "It's nice to see new sites on the forum. Unfortunately, this is a site that does not have a license, we saw that recently with bitlucy. And that's where the problems kept piling up. I think it puts off a lot of players. Many players will not dare to deposit because they are afraid that they will not get paid. That's the main thing this site needs to work on. Is certain company data available somewhere? That would be good for confidence and give players a certain degree of security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "June 03, 2022, 09:21:15 PM",
      "body": "Why tool the initiative to post things about this site? I guess many questions will be raised here and since you created this thread, that only means you’re the one who will answer the questions. If you’re a player, better to let the team have a proper introduction here so by this, gamblers will have the trust on this site. Its looking good under the Web 3.0, I just have a few questions which I think can’t be answered by the player itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "June 03, 2022, 09:22:07 PM",
      "body": "Quote from: BitcoinAccepted on June 03, 2022, 09:16:55 PMIt's nice to see new sites on the forum. Unfortunately, this is a site that does not have a license, we saw that recently with bitlucy. And that's where the problems kept piling up. I think it puts off a lot of players. Many players will not dare to deposit because they are afraid that they will not get paid. That's the main thing this site needs to work on. Is certain company data available somewhere? That would be good for confidence and give players a certain degree of security.If it is decentralised, you don't have any issues with payment. About license, I can say that the Curacao's one isn't so good, because it is released so easily. The most important thing is that the owner of site can provide a proof which demonstrates a great bankroll. But, if it is decentralised, you shouldn't worry about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "June 03, 2022, 09:38:26 PM",
      "body": "Quote from: notblox1 on June 03, 2022, 08:22:01 PMWelcome to bitcointalk forum!I see that website claim to be decentralized on bsc blockchain but that means we can't bet with Bitcoin but only with bsc tokens.Payment method page on website is not showing any information about accepted coins, but you need to add Bitcoin BTC if you want to have ANN in this board.^ I also checked the website and I saw nothing about BTC on the payment method, so there is no point that this gambling casino promoting it here, we are a BTC gambling community not on altcoins. There are too many questions that have been raised but we did not hear any single word as a response from the OP. Honestly, the gambling casino is good and yes they are decentralized gambling platform which is those who wants to protect their privacy will use this. Let us hope and justify our question out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "June 03, 2022, 09:41:48 PM",
      "body": "Quote from: Fivestar4everMVP on June 03, 2022, 07:59:48 PMQuote from: Renampun on June 03, 2022, 05:49:55 PM...Exactly my thought when I read the disclaimer note at the top of OP's post.But then am thinking, how did OP come about or got the infographics he used for the creation of this thread if he wasn't hired by the casino owners, and again, if truly he wasn't hired, (which I don't believe he wasn't) what then is the motivation? Why did he decide to announce this casino here when the casino owners themselves didn't ask for it?I don't know what everyone else here think, but I for a person believe OP was hired, but failed or forgot to add it in his disclaimer. right, maybe this is what happened (OP was hired) but he forgot to write that lol (may we'll see if there is a correction from the OP)...Quote from: milewilda on June 03, 2022, 08:28:04 PMQuote from: Renampun on June 03, 2022, 05:49:55 PM......Honestly site design isnt really just great compared on gambling sites that we do have on this market as of today but its not really that bad either.It do have that casual casino game and sports betting.Lets see if there would be someone who do took risk on getting some experience on this place.The competition in the online crypto gambling business is currently quite tight, each developer provides the best service from them, hopefully this is a gambling site that can compete with others and provide comfort for those who deposit and play in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}