{
  "id": "topic_5403162",
  "title": "Delightcrypto1",
  "author": "Delightcrypto1",
  "created_time": "June 18, 2022, 10:44:36 PM",
  "content": "My account was ban since last year June and lifted this year June 10, I just wanna appeal to the mod and everyone for the act I committed that resulted to my account being ban. I hereby say am sorry and I will abide by the rules and regulations of the forum.More to this how can I remove my red Trust in my Account.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403162",
  "comments": [
    {
      "author": "Gambit2s",
      "created_time": "June 18, 2022, 10:50:45 PM",
      "body": "Quote from: Delightcrypto1 on June 18, 2022, 10:44:36 PMMore to this how can I remove my red Trust in my Account.Only lovesmayfamilis can remove the red trust he gave you so your best bet is you go talk to him and somehow convince him to remove it.Why did you get banned in the first place if i may ask ? since multiple accounts (which was the reason for the red tag)  is technically not against the forum rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 18, 2022, 10:59:32 PM",
      "body": "I do not think that deserves a negative trust but was given on a legit reason which was as a result of you using one account to quote another account, acting like two users. So, I do not have much to comment about that. Only the person that gave you the negative trust can remove the negative trust, but might not be removed as she may want to first check your moves as the ban has been lifted already. Post good and contribute nicely on this forum, I believe he would remove the negative trust with time if you do not use your different accounts to act like different users. But I think neutral tag would have been better on both accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 19, 2022, 12:32:58 AM",
      "body": "Quote from: Delightcrypto1 on June 18, 2022, 10:44:36 PMMy account was ban since last year June and lifted this year June 10, I just wanna appeal to the mod and everyone for the act I committed that resulted to my account being ban. You may have tangled up in your own lies. You already thanked for unban last July. Or did you get banned again?Quote from: Delightcrypto1 on July 11, 2021, 05:16:12 PMI Delightcrypto1 is here by saying a big Thank you to Mr. Theymos and Co for lifting the 30days substantial ban placed on my two account..Delight Media and Delightcrypto1.I hereby apologize never to do such mistake that lead to the previous ban. Thanks Mr Theymos.In any case, you're posting what looks like word spinning so I don't think you should be attention-whoring here lest you get reported.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 19, 2022, 04:41:36 AMLast edit: June 19, 2022, 04:53:26 AM by lovesmayfamilis",
      "body": "What are you carrying? About what ban for a year? Your problem is that you are so flawed that you cannot get any merit. Nutildah rightly noted that you fish for merit and someone else's alt.To be honest, I never cease to be amazed at your audacity.People like you don't change. You can't participate in bounties from @CryptopreneurBrainboss from your red trusts?In addition to the old negative tags, you'll get two more. 4 Accounts Connected    1.iroseyike2.Delightcrypto13.Emanuelaeventry  tag4.Delight MediaProof:Quote from: iroseyike on March 15, 2022, 05:02:04 PMBEP-20 Wallet Address: 0xddB4868fb57ED1623B2A3D4ea4d2bcA6b052656f[ archive ]   Quote from: Delightcrypto1 on June 14, 2022, 10:35:06 PMBSC Wallet Address: 0xddB4868fb57ED1623B2A3D4ea4d2bcA6b052656f[ archive ]Quote from: Emanuelaeventry on October 14, 2021, 11:32:08 AMTelegram Username: @emanuellaeventory[ archive ]Quote from: Delightcrypto1 on December 01, 2021, 04:07:04 PMTelegram Username: @Emanuellaeventory[ archive ]Quote from: Delight Media on May 18, 2022, 09:53:38 PMTelegram Username: @Emanuellaeventory[ archive ]https://ninjastic.space/addresses?address=0xddB4868fb57ED1623B2A3D4ea4d2bcA6b052656fhttps://ninjastic.space/addresses?address=0x04E6eFF9434dd9953f81bb7BC1C663623aE37fC4Related Addresses:Code:BSC Wallet Address: 0xddB4868fb57ED1623B2A3D4ea4d2bcA6b052656fTelegram Username: @EmanuellaeventoryMiscellaneous:cheating bounty programs. ✅ [BOUNTY] ⭐ ULTIX ⭐ Bounty Campaign 💥~$500.000 in Tokens✅https://docs.google.com/spreadsheets/d/1jgtpIRgAQwy2__eKAcsg-BoFKn1qdxsog8-p351IA0Y/edit#gid=227106646  🚧 👉 {Paid} Seasonal Tokens Campaign | Budget: $50k ~ BTC | 8 weeks. ESCROWED.manager @CryptopreneurBrainbosshttps://docs.google.com/spreadsheets/d/1b-bbxLckVD2qdBSUZ4wYNwgVrDwFOWlVEMrTM2lA-dg/edit#gid=1660828616",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "June 19, 2022, 06:46:11 AM",
      "body": "OP, after banning your account for 1 year, it turns out that you don't understand the rules in forums and campaigns. it's annoying, when you finish executing the ban it turns out that your other accounts also commit other violations.with your current situation, no one will remove negative tags from your accounts. we probably won't say goodbye to you. because we know, you will keep making and committing the same crimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 19, 2022, 07:23:56 AM",
      "body": "Quote from: lovesmayfamilis on June 19, 2022, 04:41:36 AMTo be honest, I never cease to be amazed at your audacity.People like you don't change. You can't participate in bounties from @CryptopreneurBrainboss from your red trusts?In addition to the old negative tags, you'll get two more.Newbies and bounty hunters with their funny approaches on the forum, he got four accounts and he had even cheated before in a bounty campaign on this forum and brought up a new thread requesting for negative trust removal. Although, not stated as a eason to be given negative trust if someone cheated on a campaign, but always highly worth it as campaign managers always stated it among the rules of their campaign they are managing for participants not to enroll with alts bt some people will just want to play smart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 19, 2022, 08:03:08 AM",
      "body": "Quote from: rozak on June 19, 2022, 06:46:11 AMwith your current situation, no one will remove negative tags from your accounts. we probably won't say goodbye to you. because we know, you will keep making and committing the same crimes.You're right. This person will not change. You can take a look at this thread. https://bitcointalk.org/index.php?topic=5345394.msg57303250#msg57303250He's already apologized once. Apparently, the OP does not have a normal understanding of the word \"sorry\".The funny thing, or maybe even scary, is that the OP is not at all cunning, but most likely profoundly stupid. And that's what makes me regret it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "June 19, 2022, 06:23:34 PM",
      "body": "Quote from: lovesmayfamilis on June 19, 2022, 04:41:36 AMTo be honest, I never cease to be amazed at your audacity.People like you don't change. You can't participate in bounties from @CryptopreneurBrainboss from your red trusts?In addition to the old negative tags, you'll get two more. 4 Accounts Connected What started as an appeal process for OP turned out into a complete disaster  Hey @CryptopreneurBrainboss the feedback you left on Delightcrypto1's profile contains a link to lovesmayfamilis' profile as reference, you might want to correct that since it's a little confusing.Quote from: https://bitcointalk.org/index.php?action=trust;u=2751225 CryptopreneurBrainboss    2022-06-19    Reference    Avoid associating your brand with this user, Bounty cheater with multiple alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "June 19, 2022, 06:40:41 PM",
      "body": "Quote from: lovesmayfamilis on June 19, 2022, 04:41:36 AMWhat are you carrying? About what ban for a year? Your problem is that you are so flawed that you cannot get any merit. Nutildah rightly noted that you fish for merit and someone else's alt.To be honest, I never cease to be amazed at your audacity.People like you don't change. You can't participate in bounties from @CryptopreneurBrainboss from your red trusts?In addition to the old negative tags, you'll get two more.I think it's a total accident for the OP, the problem is that he may have escaped the ban but now he's stuck for another case. Really, I think you've punished him really hard because [-1] looks the same as [-3]. But on the other hand, the OP really has to accept it because it's a consequence on whoever cheats the campaign. Another great catch from you, mis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 20, 2022, 10:33:21 AM",
      "body": "Quote from: Delightcrypto1 on June 18, 2022, 10:44:36 PMMore to this how can I remove my red Trust in my Account.I don't know how exactly you tricked moderators to unban your accounts, but I know that you just earned yourself a few more red trust feedbacks to your account.I hereby say apologize, begging and lying all the time won't really help you in the long run in this forum.Quote from: lovesmayfamilis on June 19, 2022, 04:41:36 AM...Good work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "June 20, 2022, 10:54:40 AM",
      "body": "Quote from: Charles-Tim on June 19, 2022, 07:23:56 AMNewbies and bounty hunters with their funny approaches on the forum, he got four accounts and he had even cheated before in a bounty campaign on this forum and brought up a new thread requesting for negative trust removal. Although, not stated as a eason to be given negative trust if someone cheated on a campaign, but always highly worth it as campaign managers always stated it among the rules of their campaign they are managing for participants not to enroll with alts bt some people will just want to play smart.The fact is they want to play smart but are stupid enough to get caught and just want to earn more by enrolling their alts in the same bounty campaigns and @OP is one of those cheaters.There are many like him who avoids all the rules stated by campaign managers and participate with alt account but in the end getting their account banned.He somehow managed to get his account unbanned and expected same with negative trust removal by @lovesmayfamilis to get clean chit and start his same process again but this is funny that he ends up getting more from members.Quote from: dkbit98 on June 20, 2022, 10:33:21 AMI hereby say apologize, begging and lying all the time won't really help you in the long run in this forum.They try to play smart like they are really felling bad and will contribute more effectively but that's all the excuses they are putting forward and just want to do the same tricks again but it's not helpful so you are right on his case.Quote from: lovesmayfamilis on June 19, 2022, 08:03:08 AMHe's already apologized once. Apparently, the OP does not have a normal understanding of the word \"sorry\".The funny thing, or maybe even scary, is that the OP is not at all cunning, but most likely profoundly stupid. And that's what makes me regret it. For them sorry is the last solution to resort the problems for every wrong they committed and as once worked for them it's their normal stuff to keep on repeating the same cheap tricks but this time it became more problematic for him as he's having more negative trust from members and this thread had not worked the way he expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "June 20, 2022, 01:10:26 PM",
      "body": "OP, thank you for bringing attention to yourself so we can tag your other alt accounts as well. Apparently, you did the same thing last year with your Emanuelaeventry alt account. I find it amusing how dumb some people on this forum can be with their shitposting. Although you can offer as many apologies as you want, I don't believe that you will really change and I don't think you are mentally capable to be a valuable member of this community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "June 20, 2022, 01:25:45 PM",
      "body": "OP, do you now regret creating this thread in tears?During your 1 year ban, it turns out that you created another account to continue your prohibited activities.I hope this is your farewell to the forum. because I believe you are not matched in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 20, 2022, 01:56:49 PM",
      "body": "You have not done anything yet to redeem yourself. So what are you appealing for? This is to me a reputation thread since you are requesting remove your tags.Quote from: FatFork on June 20, 2022, 01:10:26 PMAlthough you can offer as many apologies as you want, I don't believe that you will really change and I don't think you are mentally capable to be a valuable member of this community.Be active in the community if you love it of course, if you have intention to spam and earn from bounty then it's different. Be active, share yourself, provide value, rank up and prove yourself. Then after few months or years if you would still see the tags are there, you could ask attention from the users who tagged you. OP could do this instead of crying on the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masterrex",
      "created_time": "June 20, 2022, 02:17:03 PM",
      "body": "The evidence is clearly seen so, I think the appeal is useless, I was not able to join that Seasonal Bounty because it's already full and now I found out that some people are using multiple accounts to cheat that bounty it's annoying.Anyway thanks to the hardworking forum members that always ready to do the job and unmask these cheaters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 21, 2022, 10:32:51 PM",
      "body": "Quote from: Delightcrypto1 on June 18, 2022, 10:44:36 PMMore to this how can I remove my red Trust in my Account.How did you get the red trust in your account. Did you give it to yourself? If yes, go to your profile, trust settings and click on remove red trust. But if someone gave it to you, you can send the person pm, give the person convincing reasons to remove the tag. But I checked your trust, more than 4 persons tagged you, I bet you will not be able to convince 4 persons. Quote from: lovesmayfamilis on June 19, 2022, 04:41:36 AMIn addition to the old negative tags, you'll get two more.Does it really make sense for a user to be tagged more than once by a particular DT? I am of the opinion that 1 strong negative tag is enough to say everything for that user.Asking to know if there are situations that will permit multiple tagging by one person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 22, 2022, 05:29:05 AM",
      "body": "Quote from: KingsDen on June 21, 2022, 10:32:51 PMQuote from: Delightcrypto1 on June 18, 2022, 10:44:36 PMMore to this how can I remove my red Trust in my Account.How did you get the red trust in your account. Did you give it to yourself? If yes, go to your profile, trust settings and click on remove red trust. But if someone gave it to you, you can send the person pm, give the person convincing reasons to remove the tag. But I checked your trust, more than 4 persons tagged you, I bet you will not be able to convince 4 persons. Quote from: lovesmayfamilis on June 19, 2022, 04:41:36 AMIn addition to the old negative tags, you'll get two more.Does it really make sense for a user to be tagged more than once by a particular DT? I am of the opinion that 1 strong negative tag is enough to say everything for that user.Asking to know if there are situations that will permit multiple tagging by one person.Sometimes it is useful to read all the posts and delve into the meaning of the content of the topic, in which case it will come to an understanding of which new two trusts we are talking about. Well, in addition to this, your post will not look completely inconsistent with the topic itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "June 22, 2022, 09:07:10 PM",
      "body": "Quote from: KingsDen on June 21, 2022, 10:32:51 PMQuote from: Delightcrypto1 on June 18, 2022, 10:44:36 PMMore to this how can I remove my red Trust in my Account.How did you get the red trust in your account. Did you give it to yourself? If yes, go to your profile, trust settings and click on remove red trust. This is not how the DT system works; there is no such thing as a red trust remover; it is decentralized, unmoderated, and even the mod cannot remove it.Have a look LoyceV's Beginners guide to correct use of the Trust systemQuoteBut if someone gave it to you, you can send the person pm, give the person convincing reasons to remove the tag. But I checked your trust, more than 4 persons tagged you, I bet you will not be able to convince 4 persons. Have you looked at his trust page reference? You wouldn't be asking him to waste his time sending unnecessary PMs if you did. There is nothing anyone can do about those deserving tags. Quote from: KingsDen on June 21, 2022, 10:32:51 PMQuote from: lovesmayfamilis on June 19, 2022, 04:41:36 AMIn addition to the old negative tags, you'll get two more.Does it really make sense for a user to be tagged more than once by a particular DT? I am of the opinion that 1 strong negative tag is enough to say everything for that user.Multiple negative tags will only produce one -1QuoteAsking to know if there are situations that will permit multiple tagging by one person.Yes! There are situations and I've done that before!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "September 05, 2023, 03:51:59 AM",
      "body": "Quote from: lovesmayfamilis on June 19, 2022, 04:41:36 AMRelated Addresses:Code:BSC Wallet Address: 0xddB4868fb57ED1623B2A3D4ea4d2bcA6b052656fTelegram Username: @EmanuellaeventoryAm bumping this thread for a tag reference, and to add one more alt to this list, Benkbeny:Quote from: Benkbeny on August 19, 2022, 09:36:10 PMPROOF OF AUTHENTICATIONForum Username: BenkbenyForum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3490455Telegram Username: @EmanuellaeventoryParticipated Campaigns: Twitter, Telegram, DiscordBEP-20 Wallet Address: 0xddB4868fb57ED1623B2A3D4ea4d2bcA6b052656fI have a hunch that this particular person still has several accounts on the forum, at least two of them at Hero or higher rank, but can't link them via social media info or addresses, for now...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}