{
  "id": "topic_5446066",
  "title": "diretouch",
  "author": "diretouch",
  "created_time": "March 23, 2023, 03:31:53 PM",
  "content": "If I have card that mines with 57 MH/S /conflux/ how much can I earn for month ?I want the way, not to ask here every time.For now we don't talk for electricity and internet taxes.Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446066",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 23, 2023, 03:40:18 PM",
      "body": "To mine bitcoin? We are no more in the days of using graphics card to mine bitcoin profitably. Graphics card of 57 Mh/s is so small. Compare this to Antiminer S19 Pro that can generate 110Th/s, more than a million times more than what the graphics card is generating. Although, consuming more electricity too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "March 24, 2023, 10:23:25 PM",
      "body": "This board is about Bitcoin mining. What you are inquiring about is an altcoin, so this thread is supposed to be moved to the altcoins mining boardThere are 2 most used mining profitability calculators. You can tinker around with the values based on what you have and the possible coists1. https://whattomine.comThis is what I calculated - https://whattomine.com/coins/337-cfx-octopus?hr=57&p=0&fee=0.0&cost=0.0&cost_currency=USD&hcost=0.0&span_br=24&span_d=24&commit=Calculate2. https://minerstat.com/coin/CFX",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "March 25, 2023, 11:20:27 AM",
      "body": "Quote from: diretouch on March 23, 2023, 03:31:53 PMIf I have card that mines with 57 MH/S /conflux/ how much can I earn for month ?I want the way, not to ask here every time.For now we don't talk for electricity and internet taxes.ThanksFind your video card in the list, set the electricity cost. By default, this value is 10 cents.You will see the most profitable mining mode for your video card.https://hashrate.no/gpusInternet costs also need to be taken into account if you make an additional connection for mining farms.If you have 1 graphics card in your computer, then you need to consider the power consumption of the entire PC. This value is usually 70-120 watts more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}