{
  "id": "topic_5418247",
  "title": "venus1100",
  "author": "venus1100",
  "created_time": "October 25, 2022, 08:18:37 AM",
  "content": "Radix is a full-stack layer-1 protocol that allows developers to easily build and scale decentralized finance (DeFi) applications without worrying about network congestion, smart contract hacks, or exploits. This article will cover everything you need to know about Radix, as well as how to purchase XRD tokens.Radix (XRD) was created by whom?After researching Bitcoin for a year, Dan Hughes founded eMunie (later renamed Radix) on Bitcointalk in May 2013. With a background in developing telecommunications technology, he recognized the enormous impact blockchain could have on global finance and beyond.Dan spent the next five years focusing on the most pressing issue of the day: scalability. Blocktrees, Directed Acyclic Graphs (DAGs), Channeled Asynchronous State Trees (CAST), Tempo, and Cerberus are among the consensus architectures he invented and tested.When Piers Ridyard took over as CEO in 2017, the project was renamed Radix. Taavet Hinrikus, co-founder of TransferWise, and LocalGlobe, a leading European venture capital firm, provided funding.DLT Radix and XRD TokenRadix DLT (distributed ledger technology) is a unified technology solution that addresses common issues that impede decentralized finance (DeFi). Radix also claims to be \"the only decentralized network where developers can build quickly without the constant threat of exploits and hacks.\" Radix optimizes cross-shard synchronicity as a layer-1 protocol, enabling multi-chain scalability without sacrificing composability or security.Token XRDThe XRD token, which was released in July 2021, is the native cryptocurrency of the Radix public network.Apart from serving as a reward to the Radix developer community for any protocol improvements. XRD has two primary applications:StakingRadix's Delegated Proof of Stake (DPoS) system relies on XRD to protect the Radix Public Network from a type of attack known as a Sybil attack.By delegating tokens to token holders, XRD token holders vote on which validator nodes will participate in consensus, a process known as \"staking.\" These \"stakers\" are rewarded for their efforts by earning network emission rewards. The Radix Protocol selects the top 100 validator nodes with the most delegated stake as its validator set.This limit of 100 validators is expected to be removed as part of the Radix Xi'an release, allowing for an unlimited number of validators.Fees for transactionsOn the Radix Public Network, XRD is also used to pay transaction fees. Transaction fees are primarily intended to prevent spam transactions from crossing the network.The Radix Protocol burns 100% of all transaction fees, which means that the tokens used to pay the fee are destroyed.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418247",
  "comments": [
    {
      "author": "TastyChillySauce00",
      "created_time": "October 26, 2022, 10:19:43 AM",
      "body": "Radix was a forgotten token. This one used dual token purpose but i don't know whether both are still alive or not. There was also another thread become official thread for radix. that will be far better if you're moving or creating an explanation about radix on the official thread. I will give you the link to the radix official thread. As far as i know if XRD blockchain is not so popular among the investors. some investors are still prefer to used ERC20 based tokens rather than radix itself. https://bitcointalk.org/index.php?topic=5269853.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}