{
  "id": "topic_5405784",
  "title": "xSkylarx",
  "author": "xSkylarx",
  "created_time": "July 10, 2022, 11:44:54 AM",
  "content": "I'm just curious when did you start learning crypto?Seeing posts from legendary members make me wonder how long they've been into crypto. I mean did they already knew much about crypto before their account was created here. You'll see on their posts that they have really deep knowledge about how cryptocurrencies and blockchain works. It just amazes me seeing their posts that it's like they have a decade of knowledge compared to what I know when I started to learn crypto in 2016.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405784",
  "comments": [
    {
      "author": "Daniel91",
      "created_time": "July 10, 2022, 12:01:13 PM",
      "body": "I first heard about bitcoin from a friend, it seems to me somewhere around 2013.At first I didn't really pay much attention to it, but when I heard some other things about the crypto and the idea behind it, I got interested and at the suggestion of a friend, I registered an account on this forum.As a new member, I didn't really know much about crypto, but I slowly learned, both from older members on this forum and from other available sources on the Internet.I don't think I'm a top expert even now, but if I can help younger members with some advice, I'll be happy to do so, in the same way that other members have helped me before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 10, 2022, 12:23:08 PM",
      "body": "Quote from: xSkylarx on July 10, 2022, 11:44:54 AMYou'll see on their posts that they have really deep knowledge about how cryptocurrencies and blockchain works. Not all. Most of them do not even know how to secure their wallets 🤣Honestly speaking I too sometimes find in confusing situations like I had moments few days ago. Legendary does not mean that you will know all technical details, specifications, setup. You do not become a geek. But you have better idea since you are with the community from long time and you are part of every pieces of history. A brand-new user who never heard about this forum could have better knowledge then anyone else in the forum. There are many lower rank members who share excellent understanding about bitcoin tech and fundamental. Legendary is just a rank. Because your rank is Legendary, you are not true Legend. To become a legendary (if that is your goal) you need to know how many posts you need to make to increase your activity, keep posting regularly and figure out how to earn merit. Spending few hours a day or even less than half an hour of a day, you could become a legendary someday.Becoming a true Legend is something else. There are many round us but not many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 10, 2022, 12:37:23 PM",
      "body": "I personally first became interested in Bitcoin because of Reddit (the Bitfinex hack was big news) and lurked there for a few months before I created my Bitcointalk account.And then starting at around 2016-2017 Reddit's r/bitcoin and r/cryptocurrency subreddits grew too big and started to became too crappy, and then stopped using Reddit for crypto stuff permanently in 2018.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 10, 2022, 12:57:23 PM",
      "body": "I first heard about Bitcoin sometime in late 2011, but at that time few people even understood what it was about, and then the whole thing (at least to me personally) seemed like something that would not last long. It wasn't until a few years later that I became more seriously interested in Bitcoin, so even though I missed some time, I'm not sorry because it's never too late to learn.Quote from: BitcoinGirl.Club on July 10, 2022, 12:23:08 PMNot all. Most of them do not even know how to secure their wallets 🤣This refers to old-era Legendary accounts because back then there was no merit and you could reach that rank even if you were making posts in Off-topic all the time. These people came to make money and eventually became Legendary, but unfortunately they learned almost nothing along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 10, 2022, 02:00:24 PM",
      "body": "Don't think of the legendary members as some kind of masterminds.  I heard about Bitcoin and it was suggested to me as a payment method before I became interested in it and started using it personally. I laughed at the idea of using some weird currency no one knew about back then. I thought my trading partners wanted to trick me into accepting something of no value to get a better deal. If I was just a little smarter in those early days, I could have stacked up tens and hundreds of thousands of Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 10, 2022, 03:03:08 PM",
      "body": "I was late to know about bitcoin. Although, I have known about bitcoin since 2014, but I did not know its real value. Later, I was conscious that bitcoin is money in September 2019, just like some months ago, but bearly 3 years now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "July 10, 2022, 03:09:15 PM",
      "body": "Quote from: xSkylarx on July 10, 2022, 11:44:54 AMI'm just curious when did you start learning crypto?Seeing posts from legendary members make me wonder how long they've been into crypto. I mean did they already knew much about crypto before their account was created here. You'll see on their posts that they have really deep knowledge about how cryptocurrencies and blockchain works. It just amazes me seeing their posts that it's like they have a decade of knowledge compared to what I know when I started to learn crypto in 2016.I hope you're not talking about the members who are just ranked as legendary member on bitcointalk because it isn't a real task before the implementation of merit system in 2018.Not just veterans even newbie accounts also posting really knowledgeable contents which contributes towards the forum so yes they got more interested in learning and also got the talent to express it, no wonders just knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 10, 2022, 03:20:07 PM",
      "body": "A deep knowledge of cryptocurrency isn't affiliated with member ranks on bitcointalk, especially when you think of it that some members were airdropped 1000 merits; i look at the post of a member and not their rank, one can only tell who is knowledgeable about bitcoin and the blockchain technology by what they write in the forum, discussion is what is primary on bitcointalk, ranks, merits and others are of second place.It goes without saying that every member starts off as a newbie, regardless of how knowledgeable one is, there are many developers, tech guys and others that aren't on bitcointalk, and should they decide to register they begin as newbies in bitcointalk, but 'legendaries' in cryptocurrency, bitcoin and the blockchain technology, and the only way you'll find out is through what they write.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 10, 2022, 03:45:58 PM",
      "body": "It's a rank, that is all. Something, which anyone can achieve. Now, only a select few people will etch their name into history, that would be comparable to that of a legendary figure. A few names come to mind, and I'm sure most of us know these names.  On the contrary, I'm still a idiot, and routinely get things wrong. Although, that's part of the learning process. Time certainly isn't indicative of knowledge, I could've been here for 10 years, and only participated in the gambling section, whereas I'd be limiting my exposure to anything that would teach me more about Bitcoin. It's not the time it takes, it's how effectively, and intensively you study usually. However, yeah being here longer means you've probably strayed from your normal posting habits from time to time, which might mean you pick up some extra knowledge. Honestly, if you spent a year in the Development, and technical discussion section being active, and participating you'd probably have a decent fundamental base by the end. Since, those guys that frequent that section tend to have a passion, and aren't afraid to tell you why you're wrong in what you've said. Which, honestly is perfect for learning. I do feel some users do get intimidated by certain sections because of it, but I genuinely believe it's not hostility for the most part, but their passion for the subject at hand shining through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 10, 2022, 04:05:03 PM",
      "body": "Quote from: Lucius on July 10, 2022, 12:57:23 PMThis refers to old-era Legendary accounts because back then there was no merit and you could reach that rank even if you were making posts in Off-topic all the time. These people came to make money and eventually became Legendary, but unfortunately they learned almost nothing along the way. After the merit system introduced, you need to work hard to earn merit. This means users are focused on more good posts and creating a good post take times and improvement of knowledge too. Yes, merit changed the trend of spamming.Quote from: Welsh on July 10, 2022, 03:45:58 PMA few names come to mind, and I'm sure most of us know these names.  A lot of names. Some are still alive and some are resting in peace. Hal is at the top of my list. I never had a list but if I do then maybe I will have over 10 names I can easily put into that list.Quote from: Welsh on July 10, 2022, 03:45:58 PMOn the contrary, I'm still a idiot, and routinely get things wrong. Although, that's part of the learning process. Time certainly isn't indicative of knowledge, I could've been here for 10 years, and only participated in the gambling section, whereas I'd be limiting my exposure to anything that would teach me more about Bitcoin. I also feel idiot when I read users on Development & Technical Discussion, mining boards. I am glad that the only thing I learnt well is how to secure my wallet. If I consider the biggest achievement for me then this is at the top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 10, 2022, 04:26:28 PM",
      "body": "Quote from: xSkylarx on July 10, 2022, 11:44:54 AMI mean did they already knew much about crypto before their account was created here. I could almost guarantee you the oldest members did.  That's probably become less true over time, because I think a lot of people registered during the boom times of 2013, 2017, and 2020.  They might be Legendary by now, but I'm guessing a lot of them didn't have extensive knowledge of crypto when they joined bitcointalk.As for myself, it was an extremely slow learning process and when I registered in 2015 I just knew the basics, but in all honesty I was pretty ignorant.  I'm still pretty ignorant compared to a lot of other members here, and I'm always trying to pick up little tidbits of knowledge from the experts (and there are a lot).  If you look at my earliest posts, you probably wouldn't think I knew much of anything--and do me the favor of not going back to the beginning of my post history.  It's embarrassing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 10, 2022, 04:26:51 PM",
      "body": "Iirc first time I heard about Bitcoin it was back in the late 2013, while casually browsing one Croatian forum and there they had topic about it. Back in those days I was all in gaming and always had high end GPUs so thought of being able to make some some money with mining was what attracted me to go deeper into crypto. My first stint didn't last for long though and I came back few years later. Quote from: xSkylarx on July 10, 2022, 11:44:54 AMIt just amazes me seeing their posts that it's like they have a decade of knowledge compared to what I know when I started to learn crypto in 2016.I don't think that those are into bitcoin for a decade are at any real advantage (at least when it comes to knowledge) over those that joined couple of years ago. I know some people that are into crypto for 7-8 years and they never even bothered to read Bitcoin whitepaper, while I know some that joined couple of years ago and are far more knowledgeable about bitcoin and crypto in general that I will ever be and I am perfectly fine with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "InvoKing",
      "created_time": "July 10, 2022, 09:30:01 PM",
      "body": "I learned about bitcoin before 2015, the year I joined bitcointalk. I do not recall when exactly but I assume between 2013-2015, back then it was another virtual money assay for me. A lot has changed since.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 10, 2022, 09:58:28 PM",
      "body": "I first heard about Bitcoin somewhere in 2014 or 2015, but didn't bother to get to know more about it until around late 2016. That's when I created a blockchain wallet, set up a coinbase and also signed up for Freebitco.inI mostly engaged in telegram groups and there were lots of confusing airdrops and ICOsI then registered in the forum in the late 2017",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 10, 2022, 10:11:05 PM",
      "body": "Legendary rank is not a strong indicator of expertise, because before the merit system anyone could achieve it, and even after merit system one could earn hundreds of merits by making posts that aren't related to understanding Bitcoin technology, like posting memes in Wall Observer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "July 10, 2022, 11:37:14 PM",
      "body": "I didn't expect it's now almost 5 years here in the forum where the place I discovered and learned a lot in the crypto and blockchain as well.A genuine account of a Legendary rank must have enough knowledge in crypto (not likely sold account), I even admire those knowledgeable Legendary rank in Blockchain and Bitcoin when it comes technical discussion which I also trying to dig more.  I think those members who have been here since 2013 that actively contributed to the forum must gain a lot of knowledge.Go to these boards, Development & Technical Discussion and Bitcoin Technical Support, you'll amaze every posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 11, 2022, 01:00:32 AM",
      "body": "In this forum, you have legendary members around you (not all legendary members are true legends). satoshi (the founder of this forum), Hal Finney, who has a first peer to peer transaction with satoshi. Hal passed away years ago, satoshi left the forum years ago too.Fortunately, we have BitcoinFX who is participant of Bitcoin Pizza years ago. The user is still active nowadays. A witness from history of Bitcoin.There are Bitcoin developers who were here in early days of Bitcoin like gmaxwell and maybe more.They are legends because they did not fearful but they did actually began to engage with Bitcoin and Bitcoin community, years ago and until now.If you can do the same, you can become a legend too.Quote from: theymos on September 23, 2018, 08:58:25 PMAs a member of the forum, you are surrounded by legends; phenomenal successes and catastrophic failures. The forum was created by Satoshi Nakamoto and saw the first exchange, the first altcoin, and the first ICO, but also catastrophic software flaws, massive thefts, and incredible scams. You too have an opportunity to become part of the forum's history: whether and in what way you do so is up to you.Bitcoin and me (Hal)Satoshi's lessonQuote from: theymos on January 03, 2019, 03:51:55 AMSatoshi is not awesome because he was watching the crypto world and had a brilliant idea. He's awesome because upon having this idea, he carried it out.Satoshi's lesson is that you don't need to be the next Einstein in order to change the world. Nor do you need to have much money, or influence with the world's \"movers & shakers\". You just need to put in the effort. Satoshi, probably just an ordinary hobbyist like anyone here, saw that something was lacking in the Universe, and he fought tooth-and-nail for 2+ years until this imperfection was corrected. This is what makes Satoshi and his work my greatest inspiration.Since we've long passed the moon, I hope you'll join me in aiming for the stars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 11, 2022, 03:11:59 AM",
      "body": "It's one thing to reach the legendary rank on this forum, it is another to be a true legend. The former, anybody could reach that. I reached that myself even if there's nothing special about me. The latter, it's something only a few could become. It's a matter of contribution. But only a few could contribute something that is life-changing, world-changing, or history-changing, thereby worthy of being called a legend. It must be a perfect combination of desire, passion, genius, effort, time, and probably some more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 11, 2022, 04:57:44 AM",
      "body": "Quote from: xSkylarx on July 10, 2022, 11:44:54 AMSeeing posts from legendary members make me wonder how long they've been into crypto. I mean did they already knew much about crypto before their account was created here. I am more than 5 years in crypto. Same time when I dsicovered cryptocurrencies and this forum. Actually at first I dont have much focus on learning stuff but only to earn money thats why I am lurking the forum but thats changed when I realized the needs to learn more and from there I studied and even now still grasping all the ideas and knowledge on bitcoin and crypto. Ranks arent a basis actually even some lower rank might outranked you in terms of knowledge. Its based on contributions and ability to interact with such discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}