{
  "id": "topic_5432811",
  "title": "Mustang Shelby",
  "author": "Mustang Shelby",
  "created_time": "January 03, 2023, 06:12:51 AM",
  "content": "Arkadaşlar 2026 dünya kupası yapılacak ülkeler ve bazı değişiklikleri paylaşmak istiyorum.2026 dünya kupası 3 ülkenin ev sahipliğinde gerçekleşecek.1- Kanada2- ABD3- Meksika Bu ülkeler içerisinde en fazla futbol ile ilgili olan Meksika. Ancak biliyorsunuz ki en tehlikeli ülke yine Meksika. Ayrıca bazı değişikliler yapıldı.Artık dünya kupasında 32 yerine 48 takım olacak. Grup maçları 3 takımlı 16 grup veya 4 takımlı 12 grup şeklinde değerlendirmeler düşünülüyor. Siz değişiklikleri nasıl buldunuz? Ayrıca artık böyle bir organizasyona da katılırız herhalde.Kaynak  https://tr.euronews.com/2022/12/07/2026da-ilk-kez-48-takimla-yapilacak-dunya-kupasi-ne-anlama-geliyor",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432811",
  "comments": [
    {
      "author": "eightdots",
      "created_time": "January 03, 2023, 08:52:18 AM",
      "body": "Farklı ülkelerde olması güzel bir durum. Hem maçlar yayılıyor hem de farklı taraftarlar maç izleme şansı buluyor. Tehlike konusunda problem yaşanacağını sanmıyorum. Dünyanın en büyük organizasyonunda herhangi bir güvenlik zaafiyeti yaşanması çok istisnai bir durum olur. Biz katılır mıyız acaba hem katılımcı artmışken hem de uzun bir hazırlık süreci varken kaçırmamamız lazım. Bu dünya kupasında olsak gruplardan rahat çıkarız diye söylenip durdum hep ama bu sefer demeyiz herhalde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "January 03, 2023, 12:07:35 PM",
      "body": "Kupanın 3 ayrı ülkede yapılacak olması izleyenler için iyi olacaktır ama futbolcular için iyi olmayacaktır. Sanırım grup maçları tek bir ülkede, çeyrek final yarı final başka, final başka ülkede oynanacak. Amerikada oynanacak kısmın adeta show business olacağı kesin. Fifa Dünya Kupasını ticarete dökmüş resmen. Bunlarda az değil ha. 3 ülkeli bir Dünya Kupası’nda futbolcuların mental olarak maçlara hazırlık yapmakta zorlanacaklarını düşünüyorum. Grup maçlarındaki çekişmenin 4 takımla daha yüksek olacağı düşündüğüm için 3 takımlı 16 grup yerine 4 takımlı 12 grubu tercih ederim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "January 03, 2023, 12:09:18 PM",
      "body": "Takım sayılarının artırılması daha güzel olmuş diğer milletlerin de böyle büyük bir organizasyonda olması gerekiyordu iyi olmuş. Amerika kıtasında olması o kıtada yaşayanlar içinde biraz farklı olacaktır, latin Amerika da futbol çok seviliyor taraftarlar çıldıracaktır, ABD'de bir tık daha az popüler gene de ilgi olacaktır. Bu dünya kupasında artık bir şeyler olsun 2002 yılındaki gibi bir coşku yaşayalım uzun bir aradan sonra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "January 04, 2023, 04:24:43 AMLast edit: January 04, 2023, 05:36:02 AM by trendcoin",
      "body": "3 tanecik ülkeymiş gibi gözüküyor ama organizasyon koskoca kıtaya yayılıyor. kesinlikle futbolcuların hoşlanmayacağı seyahatler oluşacaktır ama ben böyle şeyleri bahse bile alınmaması gereken sorunlar olarak görüyorum. aynı dalga muhabbet katar'da sıcaklık bahsi üzerinden vardı. la sanki brezilyalı richarilson bilmem kaç derecede oynarken ganalı muhammed kudüs sırtına bağladığı vantilatörle oynuyor; herkes eşit şartlarda oynuyor işte... :) bu arada, kupaya daha çok takım katılsın fikrini en çok destekleyen arsene wenger olmuş (şuan fifa'da görev alıyor). bu herif bizim 8 yediğimiz cl maçından sonra \"bu tipler buraya gelmesin, biz daha az takımla oynayalım\" minvalinde bir açıklama yapmıştı; demek ki bazı fikirleri değişmiş...QuoteWenger, Platini'nin, İngiltere, İtalya ve İspanya gibi ülkelerden daha az takım alınmasına ilişkin kararını doğru bulmadığını belirterek, \"Platini'yi anlıyorum. Amacı Şampiyonlar Ligi'ni tüm Avrupa'ya yaymak ama bu karar, maçların bazılarını anlamsız hale getirecek. Geçtiğimiz günlerde Slavia Prag'ı 7-0 yendik. Liverpool da Beşiktaş'ı 8-0 mağlup etti. Güçsüz takımlara şans verilirse, Şampiyonlar Ligi'nin ne bir anlamı ne de bir önemi kalır.\" dedi.arsene wenger'in açıklamasını buldum: https://forum.memurlar.net/konu/390177Quoteİkinci sorun ise, dünya futboluna baktığınızda Avrupa ve diğer kıtalar arasındaki ciddi uçurum. Daha fazla sayıda milli takımın Dünya Kupası’na katılması, küçük ülkelerdeki futbolun gelişimine katkı sağlayacaktır, çünkü milli takımların bu seviyede oynama konusunda imkanları daha fazla. Belki Dünya Kulüpler Şampiyonası’nın da liglerin düzenlenmesi ve kaynak oluşturulması bakımından yardımı dokunabilir, ancak buradan elde edilecek gelirin de büyük kulüplerin kasasından ziyade küçük ülkelerdeki yapı ve gelişim için kanalize edilmesi önemli.\"bu da daha çok takım gelsin goygoyu: https://www.ntvspor.net/futbol/dunya-kupasi-icin-devrim-niteliginde-oneri-6050e509708f4816b0a0df89",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "January 04, 2023, 04:53:22 AM",
      "body": "Daha yeni biri bitti diğerini düşünmek için erken yine de eğer öneriler kabul edilirse daha fazla takım katılım sağlayacak belki o zaman şansımız olabilir tabi Türkiye olarak zor bir kıtadan katılmaya çalışıyoruz işin o boyutunu da atlamayalım yine de bahane değil tabi milli formayı giyince o eski ruh yok futbolcularda dünya kupalarını ancak uzaktan izleriz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 05, 2023, 06:07:26 AM",
      "body": "Quote from: RaltcoinsB on January 04, 2023, 04:53:22 AMDaha yeni biri bitti diğerini düşünmek için erken yine de eğer öneriler kabul edilirse daha fazla takım katılım sağlayacak belki o zaman şansımız olabilir tabi Türkiye olarak zor bir kıtadan katılmaya çalışıyoruz işin o boyutunu da atlamayalım yine de bahane değil tabi milli formayı giyince o eski ruh yok futbolcularda dünya kupalarını ancak uzaktan izleriz 2026 konuşmak için erken olsa da bu elemelerdeki sistemi komple değiştireceği için önemli bir haber aslında, elemeler artık fazla takıma göre yeniden düzenlenecek, Avrupa’da kupaya gidemeyen bir çok güçlü takım var, aslında biz de o takımlardan birisiyiz, Asya takımlarından daha güçlü olduğumuzu düşünüyorum, Türkiye olarak artık bu şartlarda 2026’da oluruz umarım,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "January 05, 2023, 08:54:06 PM",
      "body": "2022 Dünya Kupası'nda ev sahipliği için aday ülkelerden bir tanesi de A.B.D olarak karşımıza çıkmıştı.Abd altyapı ve kaynak olarak da rakiplerinin çok önünde gözüküyordu ancak turnuva ev sahipliği Katar'a verildi sonra Fifa'da ortalık karıştı.FBI eline geçen ilk fırsatta büyük bir soruşturma başlattı netflix'de fifa ile ilgili çok güzel bir belgesel var oldukça taraflı yanları da olsa kendi akıl süzgecinizden geçirirseniz size bu konuda bilgi verecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 06, 2023, 06:28:38 AM",
      "body": "Quote from: judas on January 05, 2023, 08:54:06 PM2022 Dünya Kupası'nda ev sahipliği için aday ülkelerden bir tanesi de A.B.D olarak karşımıza çıkmıştı.Abd altyapı ve kaynak olarak da rakiplerinin çok önünde gözüküyordu ancak turnuva ev sahipliği Katar'a verildi sonra Fifa'da ortalık karıştı.FBI eline geçen ilk fırsatta büyük bir soruşturma başlattı netflix'de fifa ile ilgili çok güzel bir belgesel var oldukça taraflı yanları da olsa kendi akıl süzgecinizden geçirirseniz size bu konuda bilgi verecektir.Bu sene kendilerini affettirmiş olacaklar ki ABD’ye kupa organizasyonunu vermişler. Bir de orada oynanacak maçlar kupanın neredeyse tüm maçları olacak. Kanada ve Meksika formaliteden bir kaç maça ev sahipliği yapacak ülkeler olacak. ABD’de futbol bu kadar popüler değil ama altyapısı falan iyidir o konuda şüphem yok. Şimdi 2026 elemelerine artık yüklenme vakti. Bir zahmet bu şartlar altında da katılalım o turnuvaya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "January 06, 2023, 08:48:09 AM",
      "body": "48 takımda olsa bizim katılmamız kolay değil. 12 takım kıtalara göre nasıl dağılacak. En fazla 3-4 takım verilir Avrupa'ya kontenjan olarak. O halde olsa bile çok zor. Gidebilirsek eğer belki play off. Şimdiye kadar güle oynaya gittiğimiz bir şampiyona yok ki 2026 olsun. 3 ülkeden ziyade Amerika kıtasına yayılmış..Bence güzel olmuş..herhalde final ABD'ye kalır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "January 06, 2023, 08:51:45 AM",
      "body": "Quote from: ajanwalker on January 06, 2023, 08:48:09 AM48 takımda olsa bizim katılmamız kolay değil. 12 takım kıtalara göre nasıl dağılacak. En fazla 3-4 takım verilir Avrupa'ya kontenjan olarak. O halde olsa bile çok zor. Gidebilirsek eğer belki play off. Şimdiye kadar güle oynaya gittiğimiz bir şampiyona yok ki 2026 olsun. 3 ülkeden ziyade Amerika kıtasına yayılmış..Bence güzel olmuş..herhalde final ABD'ye kalır.Avrupa’da büyük takımların hepsi gider, üstüne bir kaç sürpriz takım kalır.Hırvatistan, Sırbistan gibi bizim de şansımız var ben inanıyorum.Bu arada grup elemelerinde dünya kupası finalisti Fransa’ya karşı 4 puan toplamıştık hatırlatırım.Aslında bizim oyuncular biraz ruhuyla oynarsa rahatlıkla 2026 dünya kupasını görebiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "January 10, 2023, 04:41:05 PM",
      "body": "Quote from: Mustang Shelby on January 03, 2023, 06:12:51 AMSiz değişiklikleri nasıl buldunuz? Ayrıca artık böyle bir organizasyona da katılırız herhalde.Afrika, Asya'dan daha fazla takım gelmesi için sayıyı artırdılar diye biliyom ben. Biz Avrupa kontenjanından gidicez yine turnuvaya. Avrupa'ya daha fazla kontenjan açılacak mı? Eşit mi dağıtılacak sayı? Ben araştırma yaptım konu hakkında bi şey bulamadım pek. Gerçi daha fikir aşamasında. Ama Asya, Afrika takımları Katar Dünya Kupasında her zamankinden daha fazla puan topladılar. Arabistan, Arjantin'i yendi. Kamerun, Brezilya'yı yendi. Japonya, Güney Kore ölüm gruplarından çıktı. Artık Asya, Afrika takımlarına daha adil bi pay vermenin zamanı gelmiş bana kalırsa. Sonuçlar ortada çünkü. Daha bi adil dağılım olursa Fas'ın başarısını diğer Asya, Afrika takımları da tekrarlayabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 10, 2023, 04:49:10 PM",
      "body": "Quote from: Ondekinecakabilirim on January 10, 2023, 04:41:05 PMQuote from: Mustang Shelby on January 03, 2023, 06:12:51 AMSiz değişiklikleri nasıl buldunuz? Ayrıca artık böyle bir organizasyona da katılırız herhalde.Afrika, Asya'dan daha fazla takım gelmesi için sayıyı artırdılar diye biliyom ben. Biz Avrupa kontenjanından gidicez yine turnuvaya. Avrupa'ya daha fazla kontenjan açılacak mı? Eşit mi dağıtılacak sayı? Ben araştırma yaptım konu hakkında bi şey bulamadım pek. Gerçi daha fikir aşamasında. Ama Asya, Afrika takımları Katar Dünya Kupasında her zamankinden daha fazla puan topladılar. Arabistan, Arjantin'i yendi. Kamerun, Brezilya'yı yendi. Japonya, Güney Kore ölüm gruplarından çıktı. Artık Asya, Afrika takımlarına daha adil bi pay vermenin zamanı gelmiş bana kalırsa. Sonuçlar ortada çünkü. Daha bi adil dağılım olursa Fas'ın başarısını diğer Asya, Afrika takımları da tekrarlayabilir.Hocam hepsini Afrika veya Asya’ya vermezler, bana göre Avrupa’dan gelen takım sayısında da artış olabilir, bu dünya kupasında mesela İtalya yoktu, biz yoktuk, Avrupa’nın diğer önemli ülkeleri de yoktu, Avrupa’da da kontenjan artışı olabilir, ayrıca bence daha fazla ülkenin katılımını sağlayıp, dünya kupasını global yapmaya çalışıyorlar, bence doğru bir hamle, yapsınlar daha fazla seyirci çeker,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "January 18, 2023, 02:01:10 PM",
      "body": "Quote from: RaltcoinsB on January 04, 2023, 04:53:22 AMDaha yeni biri bitti diğerini düşünmek için erken yine de eğer öneriler kabul edilirse daha fazla takım katılım sağlayacak belki o zaman şansımız olabilir tabi Türkiye olarak zor bir kıtadan katılmaya çalışıyoruz işin o boyutunu da atlamayalım yine de bahane değil tabi milli formayı giyince o eski ruh yok futbolcularda dünya kupalarını ancak uzaktan izleriz Bir dünya kupası yeni bitti ama hemen yeni bir tane daha dünya kupası olsa fena olmaz.  Bence dört yılda bir düzenlenmesi dünya kupasını daha iyi yapmıyor. Emeklilik yaşı gelen futbolcular dünya kupalarında daha fazla oynama fırsatını kaçırıyor. Dünya kupası iki yılda bir düzenlenirse hem onlar kariyerlerini geliştirme imkanı bulur hem de bizler onları daha fazla izleme fırsatı buluruz. Ben böyle düşündüğüm için dünya kupasının yeni bitmiş olmasını yeniden başlayacağının müjdecisi olarak yorumluyorum. Ayrıca bu dünya kupasında Kanada ve ABD'ye seyahat eden bazı taraftarların izlerini kaybettirerek yasadışı yollardan bu ülkelerde kalmaya çalışacağına dair haberler okuyacağımıza eminim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 24, 2023, 05:20:45 PM",
      "body": "Quote from: flipme on January 18, 2023, 02:01:10 PMQuote from: RaltcoinsB on January 04, 2023, 04:53:22 AMDaha yeni biri bitti diğerini düşünmek için erken yine de eğer öneriler kabul edilirse daha fazla takım katılım sağlayacak belki o zaman şansımız olabilir tabi Türkiye olarak zor bir kıtadan katılmaya çalışıyoruz işin o boyutunu da atlamayalım yine de bahane değil tabi milli formayı giyince o eski ruh yok futbolcularda dünya kupalarını ancak uzaktan izleriz Bir dünya kupası yeni bitti ama hemen yeni bir tane daha dünya kupası olsa fena olmaz.  Bence dört yılda bir düzenlenmesi dünya kupasını daha iyi yapmıyor. Emeklilik yaşı gelen futbolcular dünya kupalarında daha fazla oynama fırsatını kaçırıyor. Dünya kupası iki yılda bir düzenlenirse hem onlar kariyerlerini geliştirme imkanı bulur hem de bizler onları daha fazla izleme fırsatı buluruz. Ben böyle düşündüğüm için dünya kupasının yeni bitmiş olmasını yeniden başlayacağının müjdecisi olarak yorumluyorum. Ayrıca bu dünya kupasında Kanada ve ABD'ye seyahat eden bazı taraftarların izlerini kaybettirerek yasadışı yollardan bu ülkelerde kalmaya çalışacağına dair haberler okuyacağımıza eminim. İki yılda bir olan uluslar ligi gibi saçma sapan bir organizasyon. 4 sene değil 3 sene olsa yine iyi. Daha çok dünya kupası görürüz. Eskiden konulan kurallar zaman şartlarına göre değiştirilebilir. Neden 4 sene gibi uzun süreye yayılıyor anlamış değilim. 2026 yılına daha 3 sene var sabırsızlıkla bekliyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}