{
  "id": "topic_5435474",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "January 17, 2023, 11:53:44 AM",
  "content": "Please treat your bitcoin as if it is already worth 10x of what it is. Therefore, if you currently own one bitcoin, which is currently worth over $20,000, or a few Satoshis, which is each currently worth a few hundred dollars, you should learn how to treat it as though it has already increased in value because it has the potential to do so. As a result, I believe that 1 bitcoin or few satoshis should be treated as a currency worth $1,000,000 or at the very least $500,000. This should be your mindset this 2023.How do you treat your bitcoin as if it is already worth 10x of what it is already?1. Withdraw your bitcoins from exchanges to a cold wallet. You could leave only a small amount for everyday uses2. Back up your seed/recovery phrase properly3. Use a strong password to protect your crypto4. Use a password different from the one you use for a website for your wallet5. Use a hardware wallet if possible6. Check the URL carefully to ensure that you are not about to download a fake wallet or use a fake application7. Make sure you use only the official website for an app8. Don’t Enter Your Seed Words on a Website9. Avoid Public Wi-Fi when you’re doing crypto transactions10. Use Two-Factor Authentication for your exchangeWhat do you say? Ref:https://www.security.org/crypto/protection/https://bitcoin.org/en/secure-your-wallet#everyday",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435474",
  "comments": [
    {
      "author": "rat03gopoh",
      "created_time": "January 17, 2023, 12:14:44 PM",
      "body": "Quote from: alastantiger on January 17, 2023, 11:53:44 AMWhat do you say? What if 10x the current price is my sales target?  Don't wait to feel be rich to be skeptical",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "January 17, 2023, 12:31:48 PM",
      "body": "It makes no difference whether the Bitcoin price rises or falls; one should never be careless when handling their finances. So waiting for Bitcoin to reach 10x or more before securing it isn't a good idea. Before you get your Bitcoin, you should think about how you're going to secure it. And I believe the list provided in Op is a great place to start from in securing them (Bitcoin and crypto).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "January 17, 2023, 12:36:11 PM",
      "body": "I'm not treating my Bitcoin like it's worth 10x more, but certainly I treat it that way, knowing that it's worth way more than $20,000. To be honest, it has become more of an asset than a currency, and its limited supply also adds to its value. I'm trying to have as realistic expectations as possible and do not expect 5x or 10x returns, at least anytime soon, but I'd be satisfied if it reached $50,000–60,000 within the next two years, which would be approximately double my current DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 17, 2023, 12:51:45 PM",
      "body": "Quote from: rat03gopoh on January 17, 2023, 12:14:44 PMWhat if 10x the current price is my sales target?  Don't wait to feel be rich to be skepticalThat was my reaction too when I read the title, suppose I'm going to pay you in BTC but instead of 0.5 I'm going to send you 0.05, cause that's how I see the value. Wonder what would the reaction of the seller be like  QuoteWhat do you say?That acting differently and taking different security measures that should be mandatory because of a possible price increase make little sense. You're focusing too much on the price of a BTC and not realizing that even an x10 might not change things radically for some. A guy owning now 100 BTC already has 2 million which might make him a designed target if he posts all over the net his email/phone and his wealth, keeping 2 million on some centralized is already stupid. On the other hand, someone who makes $400k a year and now owns just 0.1 BTC at $2k will just see possible gains $20000, still close to nothing for his overall finances and still in the region of \"afford to lose\" and can keep it there if he wants to daily trade as it basically plays money for him and he can buy it at any time back before it hits 10x. But if you have BTC0.5 and your monthly wage in a 3rd world country is $300, it's pretty clear what you should have done a long time ago!So, an increase in price means little for some without some context.That aside, unless you're doing active daily trading or you plan to sell in the next days no matter the price, there is absolutely no point in holding coins on an exchange for a long period.Quote from: alastantiger on January 17, 2023, 11:53:44 AMTherefore, if you currently own one bitcoin, which is currently worth over $20,000, or a few Satoshis, which is each currently worth a few hundred dollars, I'm selling you a satoshi for just one $, how many do you want?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 17, 2023, 01:00:57 PM",
      "body": "Quote from: alastantiger on January 17, 2023, 11:53:44 AMPlease treat your bitcoin as if it is already worth 10x of what it is. Therefore, if you currently own one bitcoin, which is currently worth over $20,000, or a few Satoshis, which is each currently worth a few hundred dollars, you should learn how to treat it as though it has already increased in value because it has the potential to do so. As a result, I believe that 1 bitcoin or few satoshis should be treated as a currency worth $1,000,000 or at the very least $500,000. This should be your mindset this 2023.While your intentions seem to be good, your logic has a flaw, hence people will pick on you (or it).If we all perceive bitcoin as much more expensive than it is, then nobody will send coins (because we may consider the tx fees to big) and nobody will sell bitcoins (not even the miners, hence they will at some point become unable to pay for their electricity).No. Bitcoin doesn't have to be perceived as more expensive. Bitcoin has to be perceived as it is. Not more, not less. And this being said, all the safety measures will differ from person to person. One has to be very careful, according to how much he affords to lose because of mistakes or hacks. One can get hacked and buy back next day all the loses. Others.... don't...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "January 17, 2023, 01:13:19 PM",
      "body": "Quote from: alastantiger on January 17, 2023, 11:53:44 AM-snip-How do you treat your bitcoin as if it is already worth 10x of what it is already?These are all basic security methods that should be implemented from the outset, regardless of whether you end up owning wealth even hundreds of times the size of your current portfolio one day. And it is possible that one of them will become an obsolete method as criminals always develop their methods day by day, who knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "January 17, 2023, 02:57:22 PM",
      "body": "Quote from: alastantiger on January 17, 2023, 11:53:44 AMPlease treat your bitcoin as if it is already worth 10x of what it is. Treat your bitcoin as if it was worth 1 BTC.Fiat is a devaluing medium of exchange so you do not have to always value your bitcoin against it. Understand the value in the bitcoin network.Quote from: alastantiger on January 17, 2023, 11:53:44 AM1. Withdraw your bitcoins from exchanges to a cold wallet. You could leave only a small amount for everyday usesEven amounts for everyday use should not be kept in an exchange. You can combine your cold wallet (for large amounts) and a hot wallet (for smaller amounts used often).- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "January 17, 2023, 03:35:16 PM",
      "body": "Regardless of the price, 1 Bitcoin is still 1 Bitcoin. People who hold Bitcoin will always treat it well by storing it in a place that is considered the safest even though the value is getting cheaper. In the eyes of Bitcoin investors the most valuable thing, the limited stock of Bitcoin has made it the most sought after asset. Maintaining asset security is the obligation of each individual, regardless of the amount of Bitcoin you have, you will always try to keep it safe and will release it when the return starts to appear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "January 17, 2023, 03:36:59 PM",
      "body": "I'm not going to exaggerate this it would be skeptical of me to think bitcoin 10x when in fact it is $20,000 but on the basis of experience it is most importantly prepared beforehand, before I buy bitcoins and put it in a hardware wallet.This information is indeed useful as a reminder about the basis for the security of assets that are owned, even though many have said that the important thing is that we must be aware that all of this must be prepared.Hardware wallet, seed phrases are important but anyway some of them already know about this but I wouldn't trust saving on exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 17, 2023, 06:21:55 PM",
      "body": "You provided some already know informations or security tips that every-well meaning investors should know. But this shouldn’t be implemented only when you have large amounts of bitcoin but for every bitcoin you have. Although bitcoin security varies depending on the amount you have. Bitcoin worth of less than $200 can be stored in non custodian wallet while those worth thousands should be in hardware wallets but overall no amount should be entrusted in exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "January 18, 2023, 06:37:44 PM",
      "body": "Quote from: alastantiger on January 17, 2023, 11:53:44 AMWhat do you say? I will say you have a point, but it wasn't well delivered. Treating my coin has if it has already increased in value to my own understanding means i can sell them for the value i had nurtured in my mind even when the price hasn't pumped to the price in my mind.It would have been more accepted if the advice was treat your Bitcoin has an asset that has the potential to go 10x it's current value. That way it will be an encouragement to have a long term hodling plan in veiw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "January 19, 2023, 01:39:48 PM",
      "body": "It's still going to be worth more than 10x anyway that's why we held unto our Bitcoin, it's the real digital gold, and holding for the long term is the game, truthfully it's not 10x right now and I don't need to start pretending that it's already 10x, what's your buying point? I guess that's what matters. Come to think of it, if you fool yourself that Bitcoin is worth 10x and a big dump happens how will you feel? Because it looks like you are just playing with your emotions, you don't need to. The present value is why I am buying, no dips no reason to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 19, 2023, 02:57:07 PM",
      "body": "How can I treat bitcoin as if it is worth 10x more while I don't care about the price going up or down? Let me be clear of course I care about bitcoin and I don't keep them for checking the price regularly. I keep my assets for a long time and I only look at them when my selling time is near. Quote from: Cantsay on January 17, 2023, 12:31:48 PMIt makes no difference whether the Bitcoin price rises or falls; one should never be careless when handling their finances. So waiting for Bitcoin to reach 10x or more before securing it isn't a good idea. Before you get your Bitcoin, you should think about how you're going to secure it. And I believe the list provided in Op is a great place to start from in securing them (Bitcoin and crypto).After you get your bitcoin keep them safe and forget about it. By forgetting means not checking the worth of the bitcoins or crypto assets you have. When investing for a long time we know that the price will be 10x or even 20x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "January 19, 2023, 03:08:28 PM",
      "body": "The value of Bitcoin is not going to be 10x what it is now, if it is for you then don't recommend it to others, I recommend that you hold your Bitcoin as long as you can and as long as you want, it could be 10x 50x or 100x times it doesn't matter as long as you can and comfortable holding it depends on the trust of the holders on Bitcoin, its a holder to holder basis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "January 19, 2023, 03:11:24 PM",
      "body": "If you're real bitcoin enthusiast you don't need to exaggerate its value just treat 1BTC=1BTC no matter what.As an investor you may choose to decide what your goals are with your crypto assets so 10x makes sense for long term holders but it's possible only if you manages to buy at the lowest low and sell at highest high of next cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "January 19, 2023, 03:16:58 PM",
      "body": "Quote from: Saisher on January 19, 2023, 03:08:28 PMThe value of Bitcoin is not going to be 10x what it is now, if it is for you then don't recommend it to others, I recommend that you hold your Bitcoin as long as you can and as long as you want, it could be 10x 50x or 100x times it doesn't matter as long as you can and comfortable holding it depends on the trust of the holders on Bitcoin, its a holder to holder basis. He is not directly implying that Bitcoin will be x10 on this thread but rather how to be more cautious on protecting your asset like you are holding huge amount despite your real balance is small. I agree on the precautions method that he share but people should always apply this safety precautions whatever the price of Bitcoin is because 1BTC is still 1BTC which is very precious to become reckless on securing it.All the method shares above is basic principle on how securing Bitcoin wallet. He also forgot the extra security needed that whale holders usually have which is using hardware wallet to store Bitcoin. He mention a lot of tips yet there’s no difference between security methodology of newbie to whale holder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "January 19, 2023, 03:31:26 PM",
      "body": "This is nothing more than a tip to secure bitcoins for those who are too skeptical. Safeguards must be very detailed including making the mindset as if 1 BTC = $1,000,000. There's nothing wrong, but one's mindset will not be the same, everyone has their own mindset and strategy.Quote from: jrrsparkles on January 19, 2023, 03:11:24 PMIf you're real bitcoin enthusiast you don't need to exaggerate its value just treat 1BTC=1BTC no matter what.In general, it is like that, 1BTC=1BTC there will be no exaggeration. If you expect the price to be very high, you just have to wait for how strong it is to hold bitcoin to reach its highest price.Quote from: jrrsparkles on January 19, 2023, 03:11:24 PMAs an investor you may choose to decide what your goals are with your crypto assets so 10x makes sense for long-term holders but it's possible only if you manages to buy at the lowest low and sell at highest high of next cycle.10x is still an affordable amount, but before that is it possible to hold on until Bitcoin reaches 10x the price it is now? Because panic and greed will fill the human brain. But for those who have been trained and indeed long-term goals, maybe it can still be achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "January 19, 2023, 03:40:11 PM",
      "body": "Quote from: Mahirap on January 19, 2023, 02:57:07 PMQuote from: Cantsay on January 17, 2023, 12:31:48 PMIt makes no difference whether the Bitcoin price rises or falls; one should never be careless when handling their finances. So waiting for Bitcoin to reach 10x or more before securing it isn't a good idea. Before you get your Bitcoin, you should think about how you're going to secure it. And I believe the list provided in Op is a great place to start from in securing them (Bitcoin and crypto).After you get your bitcoin keep them safe and forget about it. By forgetting means not checking the worth of the bitcoins or crypto assets you have. When investing for a long time we know that the price will be 10x or even 20x. If indeed you want to hodl long then you don't have to bother you with the current price of Bitcoin. The only time you should be bothered is when you intend to bag more Bitcoin. I don't see any reason why a long term holder should be involving himself/herself with current price aside from the fact that they're looking for opportunities to buy more and add to their holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "January 20, 2023, 04:38:43 PM",
      "body": "Quote from: alastantiger on January 17, 2023, 11:53:44 AMPlease treat your bitcoin as if it is already worth 10x of what it is. Therefore, if you currently own one bitcoin, which is currently worth over $20,000, or a few Satoshis, which is each currently worth a few hundred dollars, you should learn how to treat it as though it has already increased in value because it has the potential to do so. As a result, I believe that 1 bitcoin or few satoshis should be treated as a currency worth $1,000,000 or at the very least $500,000. This should be your mindset this 2023.When you keep thinking about your bitcoin investment to be more than what it's actually worth it becomes a mental deception.It will give you some feelings and some excitement that doesn't exist. This could also lead to mental illness because if you own $100 worth of Bitcoin today and you are treating it as if it is $1000 worth of Bitcoin and eventually your hundred dollars falls back to $10, you could become mentally ill.Do not over expect from bitcoin just for your mental wellness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}