{
  "id": "topic_5411937",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "August 31, 2022, 09:39:57 PM",
  "content": "Eylül ayının başlamasıyla birlikte yarım bıraktığımız zam turları yeniden başladı. Bu ülkede yaşamak insanlar için her geçen gün daha zor hale geliyor. Birileri para basıp hiç yoktan gelir elde ederken birileri zamanlarını, hayatlarını ve emeklerini satarak değeri kalmamış bir para birimini sadece insanca yaşamak için kazamaya çabalıyor.İzgaz doğalgaz verilerine göre geçen sene aynı dönemde 2,02 TL (en alt kullanım seviye fiyatı) olan ev kullanıcısı fiyatı bu sene 5,16 olacak (4,30 * 120 / 100). Bir senelik dönemde dönemde fiyatın 2,554 kat olmasından bahsediyoruz. İnsanlar günlerce sadece elektrik ve doğalgaz faturalarını ödemek için çalışmak zorunda kalacak. Sanayide kullanılan doğalgazda ise durum çok daha vahim ve hayatın her alanını etkileyecek. Zaten temel ihtiyaçları gidermek halk için zor iken artık çok daha zor hale gelecek. %50 enerji giderini karşılamak isteyen şirketler mecburen ürün fiyatlarını arttıracak.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411937",
  "comments": [
    {
      "author": "eightdots",
      "created_time": "August 31, 2022, 09:49:46 PM",
      "body": "Asgari ücretli ya da dar gelirli hatta memur, esnaf nasıl yapacak, neyi çevirecek, nelerden daha da kısacak düşünmek bile korkutuyor artık. Daha kışı var bunun bu zamlar böyle duracak gibi de değil. 2-3 de gelmiyor direkt yüzde 20 yüzde 50 geliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 01, 2022, 07:30:01 AM",
      "body": "Quote from: Bthd on August 31, 2022, 09:39:57 PMEylül ayının başlamasıyla birlikte yarım bıraktığımız zam turları yeniden başladı. Bu ülkede yaşamak insanlar için her geçen gün daha zor hale geliyor. Birileri para basıp hiç yoktan gelir elde ederken birileri zamanlarını, hayatlarını ve emeklerini satarak değeri kalmamış bir para birimini sadece insanca yaşamak için kazamaya çabalıyor.Dediğinizin istatistiklere göre grafiğe dökülmüş hali:Gerçekten durum akıl alır gibi değil. Dolarla kazansanız bile fiyat artışlarının hızına yetişemiyorsunuz normal bir insan olarak. Daha yeni zam yaptılar, bu neyin zammı şimdi? Hadi evlerde %20 bile saçmayken sanayide %50 zam nedir?! Bu normal bir insana katlanarak yansıyor. Şaka gibi yönetiyorlar gerçekten ama yaptıkları ultra saçma faiz müdahalesi daha yeni oldu, ne bekleyebilirdik ki. Gerçekten şeye sürülecek akıl yok bu adamlarda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 01, 2022, 07:56:57 AM",
      "body": "Bu zamların karşılığında açıklanacak olan enflasyonun ne kadar az çıktığını göreceksiniz. Enerji ve akaryakıt direkt olarak her olarak her ürünün fiyatlanmasına sebep olur dolayısıyla aslında enerji ve akaryakıt artışları en basitinden enflasyonu yansıtır yani gerçek enflasyonu ne kadar gerçeği yansıtmayan açıklamalar yapsalar da sadece kendilerini kandırıyorlar birde her şeyi doğru kabul tayfalarını.Geçen yıl doğalgaz için yaz döneminde 2 aylık kullanım için 125 lira ödemiştim bu sene yani zam öncesi 265 lira fatura ödedim. Kimse ses çıkarmadığı sürece bu zamlara her geçen gün yenisi eklenecek ve bu kış çok sert geçecek, eee nolacak yani hemen bazı ailelere fatura yardımı yapıp göz boyamaya devam edecekler diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "September 01, 2022, 08:03:11 AM",
      "body": "Maaşlara %20-30 zam geldi diye sevinenler şimdi ne düşünüyor merak ediyorum. İçinden çıkılması çok zor olan sonsuz bir döngüye girdik, maliyet yükseliyor fiyat artıyor fiyat arttıkça enflasyon yükseliyor sonra onun farkını vatandaşa yansıtalım diyerek maliyeti biraz daha yükseltiyor ve tekrar her şeye zam yiyoruz.%20 zam yapmak ne demek, insanlar ne kombi açabilir ne klima kullanabilir. Zaten 3 kişinin yaşadığı orta halli bir eve yazları elektrik 1000, kışları doğalgaz 1500 lira fatura geliyordu, şimdiki haliyle 1 sene öncesinin ev kirası kadar para ödenmesi gerekecek.Sanayiye %50 zam demek alacağımız her kalem ürünün en az %25-30 seviyelerinde zamlanması demek, buna bir de aralık ayı civarı gelecek zamları eklersek alım gücünün iyice dibe vuracağını görebiliyoruz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "September 01, 2022, 01:41:56 PM",
      "body": "Tüm ekonomistler bu kış zor geçecek diyordu çünkü ülke ekonomisine karar verenler mantık ve bilim dışı yönettiği için. Kış gelmeden elektriğe ve doğalgaza gelen zam ısınmayın, yaşamayın demekten bir farkı yok. Ne yapacak bu halk, zaten zar zor bir şekilde yarı aç yarı tok yaşıyor. Birileri zevk-i sefa sürsün diye bazıları en temel ihtiyaçlarını karşılayamıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "September 01, 2022, 04:51:29 PM",
      "body": "yaz ayında gelen doğalgaz faturasına ödediğim parayı, 2 sene önce kışın ödüyordum. ortalık resmen saçma sapan bir hal haldi. sene başında asgari ücrete, memur ve emeklilere zam geleceğini düşünecek olursak şu anki %20'lik zam bence çok iyi. kışın artık götümüz donarken hayatta kalmaya çalışırız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kartalgiunti",
      "created_time": "September 01, 2022, 07:20:37 PM",
      "body": "Olaya sadece %20 diye bakmamak gerekir. Tam olarak araştırmadım ama kış aylarından sonra Nisan’da %30 ve Haziran’da %20 zam daha olmuş sanırım. Bu aylarda doğal gazın çok kullanılmadığını düşünürsek geçen kışa göre faturalarda %100’e yakın bir zam olacak, durumu kasım ayı gibi daha iyi anlarız..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "September 01, 2022, 09:42:10 PM",
      "body": "Quote from: püsür on September 01, 2022, 07:30:01 AMQuote from: Bthd on August 31, 2022, 09:39:57 PMEylül ayının başlamasıyla birlikte yarım bıraktığımız zam turları yeniden başladı. Bu ülkede yaşamak insanlar için her geçen gün daha zor hale geliyor. Birileri para basıp hiç yoktan gelir elde ederken birileri zamanlarını, hayatlarını ve emeklerini satarak değeri kalmamış bir para birimini sadece insanca yaşamak için kazamaya çabalıyor.Dediğinizin istatistiklere göre grafiğe dökülmüş hali:Gerçekten durum akıl alır gibi değil. Dolarla kazansanız bile fiyat artışlarının hızına yetişemiyorsunuz normal bir insan olarak. Daha yeni zam yaptılar, bu neyin zammı şimdi? Hadi evlerde %20 bile saçmayken sanayide %50 zam nedir?! Bu normal bir insana katlanarak yansıyor. Şaka gibi yönetiyorlar gerçekten ama yaptıkları ultra saçma faiz müdahalesi daha yeni oldu, ne bekleyebilirdik ki. Gerçekten şeye sürülecek akıl yok bu adamlarda. Sanayide yüzde 50 inanılmaz bir rakam. Hanelere yapılacak zam oranı da inanılmaz aslında yüzde 20. Bir de aralığa yakın bir zam daha görürüz. Aralık ayında da açıklama yaparlar yıl sonuna kadar zam yok diye. İnsanların aklıyla dalga geçer gibi hareket ediyorlar. Zamlar yüzde 50 50 yapılırken maaşlara etkiyen zam yüzde 20 ancak yapılacak bakın ocağı görün.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "September 02, 2022, 12:45:23 PM",
      "body": "Bu zam sene ortasındaki zammın üstüne geldiği için okkalı bir zam oldu hani sene ortasında en azından çoğumuzun maaşlarına zam/düzeltme gelmişti şimdi 2023 Ocak ayına kadar sabretmemiz gerekecek ve bu durum bence hiç de hoş değil ne yapacağımı bilmiyorum açıkçası. Tek yaptığımız şey evdeki klimayı daha az kullanmak bu şekilde Antalya yazını yaklaşık 1000-900 lira arası aylık elektrik faturası ile geçirdik kışın da 700 leri geçmemeye çalışacağız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "September 02, 2022, 02:52:09 PM",
      "body": "Bugün bir afişte görmüştüm sosyal medyada bir yılda sanayilere gelen zam %1000'i geçmiş evlere gelen zam ise neredeyse %300'lere dayanmış bu kış bir hayli sıkıntı olacak, bunu hep söylüyorduk kış zor geçecek diye baktığımız zaman artık eylül ayına girdik kışa bir şey kalmadı vallahi billahi. Şirketler karlarını dengelemek için mecbur hayvan gibi zam yapacaklar tüketicinin işi artık ne bileyim ne diyeyim o durumda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "September 02, 2022, 03:25:50 PMLast edit: September 02, 2022, 03:48:07 PM by judas",
      "body": "Konutlarda ikinci kademede 1 kilowatt elektriğin fiyatı 2,60 TL olmuş.Klima ya da başka elektrikli ısıtıcılarla kışı geçirmeyi planayanların Allah yardımcısı olsun.Ülkemizde artık orta kesimin klima ile işi yavaş yavaş bitti diyebiliriz.Saatte 5 lira falan yakacak.Sanayideki artış da zaten ürün fiyatlarına direkt olarak yansıyacak.Üstelik ben bu zamların devamının da geleceğini düşünüyorum yakında Mumla aydınlanmaktan başka çaremiz kalmayacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "September 02, 2022, 03:27:51 PM",
      "body": "Zaten yüksekti fiyatlar, şimdi iyice aldı başını gidiyor. artık bu zamlara bir yerde dur denilmeli. tekelleşmiş durumda elektrik şirketleri ve bu şirketler istediği gibi kulis yapıp zamları yaptırabiliyorlar. sanayideki zam kime yansıyacak? bizlerin aldığı ürünlere yansıyacak. konutlara yüzde 20 yapıldı ama sanayiye gelen aradaki yüzde 30 farkı da bize ittireceklerse ne anlamı var yüzde 20 görünen konuttaki zammın?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "September 03, 2022, 11:14:18 AM",
      "body": "İğneden ipliğe her şeye zam geliyor yine, yeniden. Olan yine millete oluyor. Sanayici nasıl olsa zammı millete yansıtacak. Sanayi Odadı Başkanı “Bizler bunun altından kalkamayız. Biz bunu yansıtmazsak Türk sanayicisi batar... Kral çıplak ben bunu söylüyorum\" dedi. Nasıl olacak bu işler. İktidar değişikliğinin vakti geldi artık. Alım gücü eriyen vatandaş bu kışı battaniye altında geçirecek oda mümkünse. Faiz sebep enflasyonun sancılarını çekiyoruz resmen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "September 03, 2022, 01:39:41 PM",
      "body": "Quote from: eightdots on August 31, 2022, 09:49:46 PMAsgari ücretli ya da dar gelirli hatta memur, esnaf nasıl yapacak, neyi çevirecek, nelerden daha da kısacak düşünmek bile korkutuyor artık. Daha kışı var bunun bu zamlar böyle duracak gibi de değil. 2-3 de gelmiyor direkt yüzde 20 yüzde 50 geliyor.Asgari ücretliyi düşünen kim ki?Elektrik şirketleri şikayet etmesin, kâr üstüne kâr açıklasın diye kimsenin bu zamlara tepeden müdahalesi yok.Sanayideki zammın hayatın her alanını etkilediğini söylemeye gerek yok galiba konuda defalarca bundan bahsedilmiş.%50 nedir?Eceviti eleştiriyorlar da kendileri parça parça Ecevit’ten çok zam yapar hale geldiler bir de bunu eleştirenlere hain yaftası vuruyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 03, 2022, 02:57:05 PM",
      "body": "41 yaşındayım,bu ay elektrik 240, su ise 340 ₺ geldi, topu topu 3 kişiyiz evde, suyun elektrikten daha yüksek gelmesi ile ilk kez karşılaşıyorum. Kışlık odunu komuru erkenden tedarik edebilecek imkanım var Allah'tan. Yoksa bu zamlardan sonra odedigim tutarın en az yarısı kadar daha oderdim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "September 03, 2022, 08:01:55 PM",
      "body": "Elektrik ve Doğalgaz, aynı anda ikisine birden çok yüksek zamlar geliyor ve bu gelen zamlardan sonra Türkiye’de hane halkı faturalara artan kira fiyatlarından kalan parasını verecek. Yakında mutfak masrafına parası kalamayan onlarca insan isyan edecek. Geçen gün bir yerde okumuştum geçen seneye göre doğalgaz fiyatı 2.2 kat artmış. Geçen sene 800 gelen fatura bu sene 1700 gelecek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "October 02, 2022, 04:45:25 AM",
      "body": "Bu ay doğalgaza zam yokmuş, marifet gibi de yalaka siteler paylaşımlar yapmaya başlamışlar, zaten her ay geçiriyorlar, bu ay yapmadıkları zammı gelecek aya ekleyip toplu geçiriyorlar, o zamanda fiyat güncellemesi deyip geçiştiriyorlar, herşey olun ama yalaka olmayın, en tehlikeli insan tipi yalaka olanlar,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 02, 2022, 06:48:51 AM",
      "body": "Quote from: totti67 on September 03, 2022, 02:57:05 PM41 yaşındayım,bu ay elektrik 240, su ise 340 ₺ geldi, topu topu 3 kişiyiz evde, suyun elektrikten daha yüksek gelmesi ile ilk kez karşılaşıyorum. Kışlık odunu komuru erkenden tedarik edebilecek imkanım var Allah'tan. Yoksa bu zamlardan sonra odedigim tutarın en az yarısı kadar daha oderdim.Benzer durumu yaşamışız bu ay 240 lira su faturası ödedim hayretler içerisinde kaldım.Bu ay zam yoktur ama gelecek aylarda yaşlayacaklardır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "October 03, 2022, 03:48:01 PM",
      "body": "Quote from: mandown on October 02, 2022, 06:48:51 AMQuote from: totti67 on September 03, 2022, 02:57:05 PM41 yaşındayım,bu ay elektrik 240, su ise 340 ₺ geldi, topu topu 3 kişiyiz evde, suyun elektrikten daha yüksek gelmesi ile ilk kez karşılaşıyorum. Kışlık odunu komuru erkenden tedarik edebilecek imkanım var Allah'tan. Yoksa bu zamlardan sonra odedigim tutarın en az yarısı kadar daha oderdim.Benzer durumu yaşamışız bu ay 240 lira su faturası ödedim hayretler içerisinde kaldım.Bu ay zam yoktur ama gelecek aylarda yaşlayacaklardır.Herhalde yaklaşık fiyatlara çekmişler suyun metreküp fiyatını. Evde 3 kişi yaşıyoruz ve gelen su faturası 260 lira. Eskiden 20-30 lira gelirdi su arkadaş aylık 260 lira nedir. Sayaca gelip baktılar normal dediler bir de servis parası ödeyeceğim gelen faturada herhalde. Bakım parası adı altında para aldıklarını düşünüyorum bunların bedava yapacağı hiç bir şey yok. Devlet kendi tekelindeki elektrik ve suyu firmalara peşkeş çekerse daha çok emrivaki yükselişler görürüz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}