{
  "id": "topic_1795115",
  "title": "Star.Wars",
  "author": "Star.Wars",
  "created_time": "February 18, 2017, 04:58:02 PM",
  "content": "There is more than one address in a wallet. We can receive different payments using these addresses. But all the pays are in the same wallet. When we make an address payment, we will send our through which address.For example, MyWallet is my purse. I have my A, B, C, D addresses in this wallet.A: 0.2 BTCB: 0.1 BTCC: 0.7 BTCD: 0 BTCMyWallet: 1 BTCI want to send the address bitcoin to D. Now when I write address D in my wallet, 0.5 BTC will be sent from which address.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=1795115",
  "comments": [
    {
      "author": "Xiaoxiao",
      "created_time": "February 18, 2017, 06:56:15 PM",
      "body": "I've been curious of this as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cellard",
      "created_time": "February 18, 2017, 06:58:26 PM",
      "body": "Quote from: Star.Wars on February 18, 2017, 04:58:02 PMThere is more than one address in a wallet. We can receive different payments using these addresses. But all the pays are in the same wallet. When we make an address payment, we will send our through which address.For example, MyWallet is my purse. I have my A, B, C, D addresses in this wallet.A: 0.2 BTCB: 0.1 BTCC: 0.7 BTCD: 0 BTCMyWallet: 1 BTCI want to send the address bitcoin to D. Now when I write address D in my wallet, 0.5 BTC will be sent from which address.You can do this with wallets like Bitcoin Core. Click on \"enable coin control\" or something like that, something that says coin control I think under advanced tab. Then you get all the inputs and outputs. So you can send with only one output or various. Its a bit non userfriendly but after you use it a couple times its easier. I wish this was able to be used in a more dumbed down way for noobs since its obvious we want to know how the transaction will look like since the blockchain is open and we dont want certain addresses to be linked with other addresses in a single transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BingoDog",
      "created_time": "February 18, 2017, 07:16:28 PM",
      "body": "It's possible in blockchain wallet. I have multiple address there and I can tranfer funds among address without any problems. Even the fee is smaller compared to transfering funds to address outside the wallet. I think that some other wallets have this functionality too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wizmo",
      "created_time": "February 18, 2017, 07:35:58 PM",
      "body": "Yes it's possible to do in blockchain I've done it few times to transfer my all coins in different address to one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin-Keeper",
      "created_time": "February 18, 2017, 08:30:30 PM",
      "body": "Quote from: Star.Wars on February 18, 2017, 04:58:02 PMThere is more than one address in a wallet. We can receive different payments using these addresses. But all the pays are in the same wallet. When we make an address payment, we will send our through which address.For example, MyWallet is my purse. I have my A, B, C, D addresses in this wallet.A: 0.2 BTCB: 0.1 BTCC: 0.7 BTCD: 0 BTCMyWallet: 1 BTCI want to send the address bitcoin to D. Now when I write address D in my wallet, 0.5 BTC will be sent from which address.While you can do it, as you have seen from the posts preceding this one, why would you want to do that?  All those addresses come from the same SEED and/or all share the same master public key.  In fact on most of the better wallets when you send coins from one of your addresses, ANY coins left in the sending coin address are automatically moved to a new \"change\" address (Electrum as example).  Still, I can visualize why you might want to move coins from a publicly available address where you repeatedly receive coins.  There is NO harm in simply moving them to another address in the same wallet.  Just remember that all those addresses are mathematically related, should the MPK ever get discovered, OR if someone does a trace through the blockchain to follow your transactions from that one initial address.  You may not care about this, but for some, this it a factor worth consideration.  Just sayin!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "February 18, 2017, 09:04:18 PM",
      "body": "Quote from: Star.Wars on February 18, 2017, 04:58:02 PMIs it possible to transfer BTC between addresses in the same wallet?Yes.Quote from: Star.Wars on February 18, 2017, 04:58:02 PM0.5 BTC will be sent from which address.Bitcoin is NOT sent FROM ADDRESSES.  It is sent TO ADDRESSES.Bitcoin addresses are NOT account numbers. They are more like an invoice number.  They provide you a way to determine who sent the money, when they sent it, and why they sent it.If you were a merchant and you sold 4 items to 3 different people, then you sent each customer a different invoice to be paid:Invoice A: $0.20Invoice B: $0.10Invoice C: $0.70The total amount that your business would receive once all payments were received would be $1.00.Then if you sent $0.50 from your checking account to your savings account, the $0.50 would be sent from which invoice?It's a silly question, isn't it?  It isn't sent \"from\" an invoice.Now, you could keep track of the individual payments and store them all separately (like a bitcoin wallet does).  Then when you spend it, you could choose specific coins to spend (like a bitcoin wallet does).  In that case, you could say that this money being spent was RECEIVED as part of a specific invoice.  You aren't \"spending from\" the invoice, but you can be aware of specifically which invoice payment provided the units you are using.If that's what you are asking:Which of the payments previously received will be spent?Then the answer is:It depends on your wallet.  The wallet gets to choose which of the unspent transaction outputs to spend.  The creator of the wallet implements an algorithm for making that decision.  Some wallets also provide advanced features commonly called \"coin control\" which allow the user to specify which unspent transaction outputs they want to spend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roboabhishek",
      "created_time": "February 18, 2017, 09:09:08 PM",
      "body": "Quote from: wizmo on February 18, 2017, 07:35:58 PMYes it's possible to do in blockchain I've done it few times to transfer my all coins in different address to one.I also want to know how you did that can you please let us know about that, It will help us in saving the tx fee we waste to send to our own addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyrantt",
      "created_time": "February 18, 2017, 11:11:10 PM",
      "body": "Quote from: Roboabhishek on February 18, 2017, 09:09:08 PMQuote from: wizmo on February 18, 2017, 07:35:58 PMYes it's possible to do in blockchain I've done it few times to transfer my all coins in different address to one.I also want to know how you did that can you please let us know about that, It will help us in saving the tx fee we waste to send to our own addresses.tbh I didn't know it was possible, I was avoiding to do that since it takes fees to transfer to my own wallet and I've tried everything and didn't find a way to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "February 18, 2017, 11:37:16 PM",
      "body": "Quote from: Roboabhishek on February 18, 2017, 09:09:08 PMQuote from: wizmo on February 18, 2017, 07:35:58 PMYes it's possible to do in blockchain I've done it few times to transfer my all coins in different address to one.I also want to know how you did that can you please let us know about that, It will help us in saving the tx fee we waste to send to our own addresses.i think we can not saving the transaction fee because every time we send the amount of bitcoin, the transaction is made for the miners, this is what i know and what i read. to send some amount into your other wallet is need transaction fee too so i think you can send the amount into every wallet address you want but you need to pay the fee too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nara1892",
      "created_time": "February 18, 2017, 11:50:09 PM",
      "body": "Quote from: Coin-Keeper on February 18, 2017, 08:30:30 PMQuote from: Star.Wars on February 18, 2017, 04:58:02 PMThere is more than one address in a wallet. We can receive different payments using these addresses. But all the pays are in the same wallet. When we make an address payment, we will send our through which address.For example, MyWallet is my purse. I have my A, B, C, D addresses in this wallet.A: 0.2 BTCB: 0.1 BTCC: 0.7 BTCD: 0 BTCMyWallet: 1 BTCI want to send the address bitcoin to D. Now when I write address D in my wallet, 0.5 BTC will be sent from which address.While you can do it, as you have seen from the posts preceding this one, why would you want to do that?  All those addresses come from the same SEED and/or all share the same master public key.  In fact on most of the better wallets when you send coins from one of your addresses, ANY coins left in the sending coin address are automatically moved to a new \"change\" address (Electrum as example).  Still, I can visualize why you might want to move coins from a publicly available address where you repeatedly receive coins.  There is NO harm in simply moving them to another address in the same wallet.  Just remember that all those addresses are mathematically related, should the MPK ever get discovered, OR if someone does a trace through the blockchain to follow your transactions from that one initial address.  You may not care about this, but for some, this it a factor worth consideration.  Just sayin!!I think having many addresses are for many account too. one account for one address. probably farming. imo. but if those addresses are for farming, a few people can detect that those addresses from the same wallet. but if you want to just make it cool to have many addresses or to differenciate your income, it does not matter anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "February 19, 2017, 12:31:11 AM",
      "body": "Offcourse it's possible, as others already said. Personally, I have never tried to do it. And I don't understand point of it. If these addresses are connected to your wallet, you have one main ballance. If you send coins from wallet to address D, you will only need to pay transaction fee, but your coins will remain on your main ballance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aarons6",
      "created_time": "February 19, 2017, 03:12:43 AM",
      "body": "Quote from: LTU_btc on February 19, 2017, 12:31:11 AMOffcourse it's possible, as others already said. Personally, I have never tried to do it. And I don't understand point of it. If these addresses are connected to your wallet, you have one main ballance. If you send coins from wallet to address D, you will only need to pay transaction fee, but your coins will remain on your main ballance.the main reason you would want to do this is if one address as a bunch of tiny inputs. like say you mined bitcoin on that address.. after awhile, if you wanted to buy something with that address you would have so many small inputs you would have a large tx.. sweeping that wallet to a new address combines all those inputs into one bigger one.. so when you want to buy something you dont have such a huge tx and therefor your tx will confirm faster with a lower fee..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "February 19, 2017, 03:25:57 AM",
      "body": "Quote from: aarons6 on February 19, 2017, 03:12:43 AMthe main reason you would want to do this is if one address as a bunch of tiny inputs. like say you mined bitcoin on that address.. after awhile, if you wanted to buy something with that address you would have so many small inputs you would have a large tx.. sweeping that wallet to a new address combines all those inputs into one bigger one.. so when you want to buy something you dont have such a huge tx and therefor your tx will confirm faster with a lower fee.. Of course, the sweep will require a large transaction that will either require that large fee or will take a very long time to confirm.  Then when you use the bitcoins again later, you'll have to pay transaction fees again.The only benefit you'll get is that you'll shift WHEN you pay the fee and wait a long time for confirmation rather than having it happen to you when you NEED the transaction to confirm quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cpfreeplz",
      "created_time": "February 19, 2017, 03:30:33 AM",
      "body": "Yes. Technically you have a lot of addresses in a wallet but if you check out wallet Explorer you'll see which ones actually have balances. Now if you have all of your inputs in one address you won't want to send them to that same address (even if it's possible). You can definitely send funds from 1 address to another. It's still two seperate addresses. Quote from: aarons6 on February 19, 2017, 03:12:43 AMQuote from: LTU_btc on February 19, 2017, 12:31:11 AMOffcourse it's possible, as others already said. Personally, I have never tried to do it. And I don't understand point of it. If these addresses are connected to your wallet, you have one main ballance. If you send coins from wallet to address D, you will only need to pay transaction fee, but your coins will remain on your main ballance.the main reason you would want to do this is if one address as a bunch of tiny inputs. like say you mined bitcoin on that address.. after awhile, if you wanted to buy something with that address you would have so many small inputs you would have a large tx.. sweeping that wallet to a new address combines all those inputs into one bigger one.. so when you want to buy something you dont have such a huge tx and therefor your tx will confirm faster with a lower fee.. The only way that saves you any Satoshis are if you see fees are low on a certain day so you send a low priority transaction, say 10 or 20 sat/byte. Either way you'll have to pay for X amount of tiny inputs at some point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babsalt1975",
      "created_time": "February 19, 2017, 03:36:06 AM",
      "body": "Why would you want to transfer bitcoin from one address to the other within the same wallet?. I don't think it makes sense given that some fees will be charged at the end of the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "~Bitcoin~",
      "created_time": "February 19, 2017, 05:52:49 AM",
      "body": "Quote from: Star.Wars on February 18, 2017, 04:58:02 PMFor example, MyWallet is my purse. I have my A, B, C, D addresses in this wallet.A: 0.2 BTCB: 0.1 BTCC: 0.7 BTCD: 0 BTCMyWallet: 1 BTCI want to send the address bitcoin to D. Now when I write address D in my wallet, 0.5 BTC will be sent from which address.In past blockchain.info have feature to send out bitcoin with multiple bitcoin address to single bitcoin address in one transaction but it is not possible this days. But if you have all of this four addresses imported in blockchain.info wallet than you will have ability to send out bitcoin from one address to another. Both A and B don't have enough bitcoin to send out 0.5BTC so It should be address C. If you send 0.5BTC from C to D you will have following input and output.C 0.70BTC ---------> C 0.20BTC                         D 0.50BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "daringdiscovered",
      "created_time": "February 19, 2017, 08:49:46 AM",
      "body": "Yes it is possible, i've tried this on my coinbase wallet out of curiosity. I have 5 addreses there and the 4 of them wasn't been used for a long time. I'm wondering if it still works so i use the same wallet to send to the 4 addresses. I send the minimum amount to 4 of them to see if it will still can receive and yes, my experimentation succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "olubams",
      "created_time": "February 19, 2017, 12:21:17 PM",
      "body": "This is something I have also tried doing but I couldnt even get an headway. I have a new address added and funded it now I want to transfer from that new wallet to previous wallet but what I noticed was it seems the money didnt move out and I have had difficulty in this. For those who were able to perform this on blockchain.info kindly give the steps necessary to make this happen...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "7788bitcoin",
      "created_time": "February 19, 2017, 01:37:39 PM",
      "body": "Quote from: daringdiscovered on February 19, 2017, 08:49:46 AMYes it is possible, i've tried this on my coinbase wallet out of curiosity. I have 5 addreses there and the 4 of them wasn't been used for a long time. I'm wondering if it still works so i use the same wallet to send to the 4 addresses. I send the minimum amount to 4 of them to see if it will still can receive and yes, my experimentation succeed.I think this does not work anymore in Coinbase. I tried a few months ago and got a message telling me this is an address on my own wallet. Anyway, if you are using Coinbase, it doesn't really matter which address the bitcoin is. Even if you don't do anything, the bitcoin in the address will eventually transferred away and the balance you have in your Coinbase account is what you entrust Coinbase with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}