{
  "id": "topic_5464098",
  "title": "Digipanda",
  "author": "Digipanda",
  "created_time": "August 22, 2023, 12:09:49 AMLast edit: August 22, 2023, 04:05:18 AM by Digipanda",
  "content": "Digipanda is a project which have great developments and fomos to be the next mooning cryptocurrency. This is the developer 1st and only project , which would be running for many years to come. Firstly , they would be offering audit after audits to smart contract. Next would be the development of pandafi , their defi plans in the digipanda ecosystem. It's not just a meme token , but one that's built for the real world with tons of functionality in it. Here's the link for the telegram groupSearch 🔎 for Digipanda official channel on your telegramThey will be holding their private sale at telegram on 10th of September UTC 12pm. Afterwhich presales on the 30th of September UTC 12pm. Don't miss it! It'll likely to moon upon launching on uniswap during mid of October. They are a sincere and dedicated team building this token for the long term , which explains why it take some time for the launch. Slow and steady makes us all millionaires , don't miss it !  Thank You for reading and have a good day 🥰🌈",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464098",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "August 22, 2023, 12:21:32 AM",
      "body": "What's the point of distributing a bunch of tokens that cannot be traded? Doing a simple join task in exchange for a token reward always ends up becoming useless.Your above link is not working, but I have to use the search option in order to view the group. No offense, but the Telegram group and channel look like a ponzi scheme, which might scam anyone who trusts you guys with their funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 22, 2023, 12:54:42 AM",
      "body": "Quote from: Nwada001 on August 22, 2023, 12:21:32 AMWhat's the point of distributing a bunch of tokens that cannot be traded? Doing a simple join task in exchange for a token reward always ends up becoming useless.For them it's not useless they collect people or telegram users to promote their tokens that usually have no value and does not yet listed in any exchange.They don't even have an announcement about their project it is likely the same as other tokens and NFT games like the game that I installed last year but until now the token that I earn can't be traded because no exchange supports it.I believe this would turn out to be the same as a scam or Ponzi project or the telegram group can be used to promote other businesses and those who join will receive a pm and they will try to convince you to invest on the cloud mining or exchange that you never heard before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 22, 2023, 01:38:00 AM",
      "body": "Quote from: Nwada001 on August 22, 2023, 12:21:32 AMWhat's the point of distributing a bunch of tokens that cannot be traded? Doing a simple join task in exchange for a token reward always ends up becoming useless.Thats probably beneficial on their part. Sometime this free airdrop or tokens are just a token of appreciation for joining then those who ask to participate gonna use your joinining for engagement or as followers, then change name again to another project until they farm users or airdropper for what? If you gained a large telegram group or social account with bunch of followers they canbuse that for monetization isnt it. In any case the one got used are those hoping for an airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Digipanda",
      "created_time": "August 22, 2023, 04:05:33 AM",
      "body": "Gogo !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "August 22, 2023, 07:27:05 AM",
      "body": "Quote from: Digipanda on August 22, 2023, 12:09:49 AMDigipanda is a project which have great developments and fomos to be the next mooning cryptocurrency.I don't think this kind of project can create a FOMO you don;t even have a website for people to see how good the project is this is a very cheap promotion of your projectQuoteHere's the link for the telegram groupSearch 🔎 for Digipanda official channel on your telegramWhy telegram channel only it only proves that you are not capable of setting up the right platform to showcase your project, all the best project had a website where you can see the roadmap, whitepaper and who are on the team, if its only telegram that means your project is not transparent so its not worth investing on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "August 22, 2023, 08:45:05 AMLast edit: August 22, 2023, 09:03:00 AM by Godday",
      "body": "I don't know about your project. What will I get from this Airdrop? Of course I will get your token but my question is can your token be traded? You didn't include your website in the thread.Then you say the potential is up to 1000x? Bro it's like your $100 becomes $100,000. It is absolutely impossible to achieve such a target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martinex",
      "created_time": "August 22, 2023, 08:51:31 AM",
      "body": "Quote from: Digipanda on August 22, 2023, 04:05:33 AMGogo !you say a project will come again with a name \" Digipanda\" but, you don't convey the supporting data, like the website or the official communication channel. My message is, don't let this become nonsense, because every day there are many births and complete data to convey. whether you are also from the team or not to convey this here is not a problem for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Digipanda",
      "created_time": "August 23, 2023, 05:05:06 AM",
      "body": "Unable to post link here. www.digipanda.live",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 23, 2023, 06:35:17 PM",
      "body": "A shity site created by shity scammer.It's just like a site created by 5 years old. Audit smart-contract is not the factor they're gonna be successful do you know as long you have the money you can BUY AUDIT result. It's funny while audit are gonna to give us a safe.Actually not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 23, 2023, 07:32:16 PM",
      "body": "Quote from: Godday on August 22, 2023, 08:45:05 AMThen you say the potential is up to 1000x? Bro it's like your $100 becomes $100,000. It is absolutely impossible to achieve such a target.Those are just the words of invitation we used to see in trash projects, mate. I mean, don't take it too seriously.This project is just a poor project that doesn't even have funds for marketing allocation, the number of members in the Telegram group is also no more than 80 people and the total number of website visitors is only around 90 people.It would be suicide to invest in this project, no utility and no hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "August 24, 2023, 04:00:55 AM",
      "body": "I actually love the DigiPanda name...and this reminds me of the food delivery app called Panda which is already available here in my country especially in the metropolis. Anyway, we should always be open to any new entrants to the crypto space but projects should prove that they got something innovative on their sleeves otherwise it would just be another project having the intent to take as much money as they can. I hope to read the things DigiPanda is solidly offering that we can call as new and something interesting, in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "August 24, 2023, 04:43:17 AM",
      "body": "^Many investors are open to anything. But, when you start your discussion with \"going to the moon\" \"1000x\" and the \"next trend\" something doesn't feel right about it. It's too good to be true and there are many ways to make this more appealing than those words. No one believes in those things anymore and it sounded like a clickbait. An old investor's first impression would always be a scammy attempt. It's better to present a project, inform who is on the team, make it clear about what their goal is, and so on and forth. It's not like we are buying here with fake money, those will be real money that could've been spent on better projects with better service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "August 26, 2023, 03:26:52 PM",
      "body": "Anything can happen in the cryptocurrency market, but the claim of a 1000x potential, as you mentioned, doesn't appear credible. It's not realistic for a project to achieve a 1000x increase in value solely by distributing free coins. Even though I am an active crypto user, I've never come across this \"Digipanda.\" Please don't take offense, my friend, but the marketing outreach for your altcoin seems insufficient. To begin with, promote it effectively and build a robust Digipanda community.You haven't disclosed any information about your current funding, and the absence of a roadmap raises concerns. Setting such high expectations without proper planning appears disingenuous. A genuine target wouldn't involve expecting a 1000x increase at this stage. Achieving that will require substantial effort. Mere words won't suffice, as evidenced by the numerous exchanges that provided free offers and disappeared unnoticed. Therefore, my advice remains: focus on promotion, enhance your credibility in the market, and only then contemplate the potential success of your project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FahriZah",
      "created_time": "August 26, 2023, 05:24:27 PM",
      "body": "If someone find Awesome project than they can make huge profit like 100x and 1000x possible if everything is okay but first of all when you thinking about 1000x than your needs to properly research and study also without research can,t find you which potential projects gives you 1000x profit so always thinking with patience and good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heulahee",
      "created_time": "August 26, 2023, 05:31:19 PM",
      "body": "I just think that you are promoting your project, and also it is not listed at any exchange, the thing you should do, better to run a bounty through a best bounty manager, so he could run a bounty and then, there will be some advertisement to your project as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roma66",
      "created_time": "August 27, 2023, 05:25:44 PM",
      "body": "If you promote your project I hope great marketing opportunity bounty published in this thread.First time you choice best bounty manager of this market.Than published your project great marketing I hope.Yes I believe best project 1000x profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "August 27, 2023, 05:28:24 PM",
      "body": "Just a normal shill lol.  What makes you think this can magically 1000× that's a pretty bold statement.  There are too many people who think crypto is a get rich quick scheme.  In most cases it's lose your money slowly by putting your money into these types of coins/projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babygun",
      "created_time": "August 27, 2023, 05:43:10 PM",
      "body": "Quote from: wheelz1200 on August 27, 2023, 05:28:24 PMJust a normal shill lol.  What makes you think this can magically 1000× that's a pretty bold statement.  There are too many people who think crypto is a get rich quick scheme.  In most cases it's lose your money slowly by putting your money into these types of coins/projects.It is a good marketing trick to say that the potential is 1000x as probably some investors will get interested and think this is their way to get quickly rich. If you would invest in this, there is a 99.9% chance that you will loose your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "August 27, 2023, 06:01:17 PM",
      "body": "Thank you buddy. Such a serious project with great potential holds sales in the telegram.A website is also not needed for such a project.And the project was probably invested by a16z, Paradigm, Blockchain Capital, Sequoia and other well-known investors Such projects have the potential to earn money only from scammers who sell tokens in telegram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}