{
  "id": "topic_5452209",
  "title": "Marcellin9",
  "author": "Marcellin9",
  "created_time": "May 10, 2023, 07:15:59 AM",
  "content": "I have been traveling abroad lately, which is the first time I have traveled since the pandemic broke out. Everything feels familiar and yet nothing has been the same: there are still many people wearing a face mask, social distance becomes a norm nowadays. I noticed one thing seems to be more crucial than ever: everyone is trying their best to make a living. The country I am traveling in now is neither developed nor poor. The standard of living is quite affordable compared to western countries’ but does not mean low compared with many poor countries’. In my spare time, I talked to the locals about their life and they all try their best to keep the job they have now or try to find a side hustle to make a living.  Many of them are living paycheck to paycheck without savings.I calculated their income and living expenses on average and find out that if there is no money inherited from parents, a young man can barely afford a house or a car, all he can do is try to work to meet ends meet. I have passed the stage of life to buy expensive things to show off and really come to appreciate the importance of making a living in whatever economic situation. I respect all those who are trying hard to make life easier. What are your thoughts about making a living ? Is it hard or easy in your home country ? Please let me know.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452209",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "May 10, 2023, 07:33:30 AM",
      "body": "Quote from: Marcellin9 on May 10, 2023, 07:15:59 AMWhat are your thoughts about making a living ? Is it hard or easy in your home country ? Please let me know.After listening your story, i am wondering, did you come to Pakistan (haha) because same situation is going on in here, for example, if one has no property inherited by parents then making a new house is way difficult. People who try to earn with honesty always earn less and have to live hand to mouth an i am one of those, and proud of it. It doesn't matter, in which country do you live and how much its economic situations has burden you up. But in my sight, a best way to make living is to live with honesty and by following morality. For example, at lower level, a vegetable seller will try to sell less vegetables by manipulating weights. Etc. Its just one example, if you (we) really wants to make a living we should not worry about savings and other stuff, just do proper work with honesty and live a happy life. But you know what, everything that i mentioned above is not possible for a honest person to follow in countries like mine but many of them try to keep up. So, i know this might look fictional but best living is with honesty not by thugging and scamming others. If you chose to live the right way, good opportunities will automatically open for you, from resources, you can't even imagine. Take an example of myself, i live on daily expenses   it too rare that we save some money and when people like u save some money we always fed on it so much that somehow we waste it on unnecessary things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "May 10, 2023, 08:26:50 AMLast edit: May 10, 2023, 10:13:05 AM by bitterguy28",
      "body": "Quote from: Marcellin9 on May 10, 2023, 07:15:59 AM.I calculated their income and living expenses on average and find out that if there is no money inherited from parents, a young man can barely afford a house or a car, all he can do is try to work to meet ends meet. Sounds like you are talking about Asian countries , as the living seems the same and the capacity of majority is indeed mentioned by you.in my place , only few that afford to buy their own house(at least with Lot) because many of them had inherit the Lot and they are the one who build the house though many are still living with the ancestral houses.and having a car? there are even a little that knows how to drive or at least have their License .QuoteI have passed the stage of life to buy expensive things to show off and really come to appreciate the importance of making a living in whatever economic situation. I respect all those who are trying hard to make life easier.What are your thoughts about making a living ? Is it hard or easy in your home country ? Please let me know.I have a belief in life in which I manage to learn from my elders and that is to be contented in what your achievements can bring , I did not say we must be lazy or be enough but I think we must enjoy life as it is short, work with decent payroll , live a  life and be happy , eat what you wanted (that you can afford) have a family , raise a child and that's it.we will only have at least 50 years to live because nowadays life is shortening but at least we enjoyed right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "May 10, 2023, 09:17:52 AM",
      "body": "Quote from: Marcellin9 on May 10, 2023, 07:15:59 AMThe country I am traveling in now is neither developed nor poor. The standard of living is quite affordable compared to western countries’ but does not mean low compared with many poor countries’. In my spare time, I talked to the locals about their life and they all try their best to keep the job they have now or try to find a side hustle to make a living.  Many of them are living paycheck to paycheck without savings.I calculated their income and living expenses on average and find out that if there is no money inherited from parents, a young man can barely afford a house or a car, all he can do is try to work to meet ends meet. I have passed the stage of life to buy expensive things to show off and really come to appreciate the importance of making a living in whatever economic situation. I respect all those who are trying hard to make life easier. What are your thoughts about making a living ? Is it hard or easy in your home country ? Please let me know.Own housing and a good car is something that people can work on for perhaps even half of their lives. If you say that there are those who barely make ends meet, and live from paycheck to paycheck, then how can they buy a home?Much depends on the place where you live, on the standard of living in the country. Therefore, if you are lucky and you were born in a developed country with a good economy, appreciate it.I often said that it all depends on the person, if you really want something, very much, then you can achieve it, but when I see poor areas in which people have no electricity and sewerage, I understand how difficult it can be, to change something in life. A few people can do this, but most of them will remain in the same place and you can’t change it yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "May 10, 2023, 09:20:19 AM",
      "body": "I don't know what country this is in, but it seems the same in my country, where if you are just relying on your salary (unless you have a huge salary), like me, you can't really purchase a car or even a house. That is really the sad truth, and even my parents are struggling, and I don't have anything to inherit from them as even they don't have a house or land. Also, no one gets rich from working 8 a.m.–5 p.m., which is why others venture into business to try their luck. Even though I do have a full-time job as well as side hustles, I still struggle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "May 10, 2023, 10:24:26 AM",
      "body": "Quote from: xSkylarx on May 10, 2023, 09:20:19 AMI don't know what country this is in, but it seems the same in my country, where if you are just relying on your salary (unless you have a huge salary), like me, you can't really purchase a car or even a house. That is really the sad truth, and even my parents are struggling, and I don't have anything to inherit from them as even they don't have a house or land. Also, no one gets rich from working 8 a.m.–5 p.m., which is why others venture into business to try their luck. Even though I do have a full-time job as well as side hustles, I still struggle.Exactly, it is very hard to get rich when you just settle to be an employee unless you do really have a huge income from it. I think it is not impossible to make our salary be higher, but it takes years of work and commitment to really achieve this. Also, I think that luck in a way have its effect on us since we may be committed enough but if we end up on a company that does not offer increase in salary you might be settling in this. It is the sad reality for some since the salary for most of the people is just enough to make ends meet. So, what we could do is just keep on improving ourselves so that we can improve our salary and financial capabilities while trying out the world of business since it is better to take some risk to have a better future ahead of us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 10, 2023, 10:24:45 AM",
      "body": "Even if you live in a develop country which the average salary is high, you still can't afford to buy house because real estate is always expensive in every country. But if you said you live in a country where you can't afford to buy a car, it's really sad because it show how small the income in your country. Social gap is always a problem in most of country, someone can eat in restaurant everyday but there's someone which can only eat in restaurant once a year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "May 10, 2023, 10:50:48 AM",
      "body": "Quote from: Twentyonepaylots on May 10, 2023, 10:24:26 AMQuote from: xSkylarx on May 10, 2023, 09:20:19 AMI don't know what country this is in, but it seems the same in my country, where if you are just relying on your salary (unless you have a huge salary), like me, you can't really purchase a car or even a house. That is really the sad truth, and even my parents are struggling, and I don't have anything to inherit from them as even they don't have a house or land. Also, no one gets rich from working 8 a.m.–5 p.m., which is why others venture into business to try their luck. Even though I do have a full-time job as well as side hustles, I still struggle.Exactly, it is very hard to get rich when you just settle to be an employee unless you do really have a huge income from it. I think it is not impossible to make our salary be higher, but it takes years of work and commitment to really achieve this. Also, I think that luck in a way have its effect on us since we may be committed enough but if we end up on a company that does not offer increase in salary you might be settling in this. It is the sad reality for some since the salary for most of the people is just enough to make ends meet. So, what we could do is just keep on improving ourselves so that we can improve our salary and financial capabilities while trying out the world of business since it is better to take some risk to have a better future ahead of us.Luck is also part of it because I did have a workmate before who was going to be promoted in the next 2 months, but because the management changed and the organization was shuffled, she ended up getting fired, which she also worked hard on, and with just a simple mistake (the first mistake done), she was then out of the job. If you find an employer that is good and takes care of the employees, then you are lucky, but if not, then that's difficult. But again, business is really the key to success, as most of the people I know came from working to put up a business, and now they are wealthy. Just find your exact business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 10, 2023, 11:05:39 AM",
      "body": "My country is in a very bad economic situation, so I'd say it's hard. You can find a low-paying job, but it will be exhausting, unfulfilling, and the salary won't be enough to cover both housing and other expenses, unless you already have a place to live, or you live with someone else who is also earning at least as much. I won't even mention the minimum wage because even a couple of them aren't enough to cover both accommodation and living expenses for one person. So many people work a lot, doing a bit of this and a bit of that, relying on a mix of income sources. And most of that stuff goes without paying taxes because that would be too much of a load on a person, and even our state seems to understand it, which is why we have a very lax attitude toward taxes. If you are highly skilled and very well-educated, you will probably find some intellectual gigs and enough of them to sustain basic life needs, and if you're also a social and a bit lucky (or well-connected), you can even get a pretty decent job that will allow having some savings, maybe eventually buying accommodation of your own. But for the rest (which is the vast majority of people) it's a huge challenge because the salaries just aren't good enough to cover the basics, unless you team up with a person or two, or you happen to have accommodation you don't have to pay for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "May 10, 2023, 12:43:27 PM",
      "body": "I've learned to always enjoy the life that I have been given because it's temporal, the giver will one day take his life back, so you expect me to keep working day in and out to make ends meet? That's not a good sign of living, because the job you are keeping is not even worth keeping, how can you be working and all the job has to offer is to keep food on your table? That's very bad.I am not advising anyone in such a situation to quit, I am only going to say that, do not get tie down in such a job, find an extra source of way to make money, we are in an era where hard work won't get you anywhere, you need to work smarter than harder now or else you will keep working without any changes in your life. Those who are men of value make more money than those who are just workers, so be a man of value and learn something that's not very common if you want to get the jobs you want",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "May 10, 2023, 03:10:47 PM",
      "body": "Making a living for our family is the most important thing, so no matter what, we must keep trying hard. Even though we don't have money inherited from our parents, we can still try to make ends meet because I'm sure there will still be jobs for people who want to work. I think it's difficult or easy to make a living in our country depending on each one because we can keep trying and as long as there is a will to look for it, we will get it.It may seem difficult for others but not for us because we are getting used to it and the best thing is we can earn money to survive. It's okay if we haven't been able to buy a house or a car because that includes tertiary needs that aren't too urgent. We can rent a house or borrow a car to travel but the main thing is that we need money to buy food and to stay healthy. We can keep trying to make a living as long as we are healthy. That's all that matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "May 14, 2023, 08:49:37 AM",
      "body": "Quote from: WeltZumerr on May 10, 2023, 01:26:05 PMQuote from: xSkylarx on May 10, 2023, 09:20:19 AMI don't know what country this is in, but it seems the same in my country, where if you are just relying on your salary (unless you have a huge salary), like me, you can't really purchase a car or even a house. That is really the sad truth, and even my parents are struggling, and I don't have anything to inherit from them as even they don't have a house or land. Also, no one gets rich from working 8 a.m.–5 p.m., which is why others venture into business to try their luck. Even though I do have a full-time job as well as side hustles, I still struggle.That's really unfortunate and I feel for you. It's great that you are trying to find other avenues to make money to improve your life, as it's certainly not easy to live on just a salary, especially these days. It's amazing what creative solutions people can come up with to make ends meet, and I'm sure you'll figure out a way to make it work! Best of luck!I am still stuck on my 8 a.m.–5 p.m. job, though it is somewhat temporary. I am very attached to my current job, and I can't resign. I am also trying to find a new job right now through the internet, but I think I am out of luck. I also can't resign immediately right now as I do have a family to feed. I hope that in the next few months or, let's say, a few years, I can find the job that I am really looking for, as it is very tiring to keep jumping into different jobs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "May 15, 2023, 06:07:29 AM",
      "body": "It is very important to earn a honest living. Why would you want to live with no peace knowing that you did people wrong? Would it not bother you that you made money not the honest way but by cheating someone out of what is theirs? I was raised in a household where I would see my mother get up early to go make an honest living. Perhaps I may have not been living in luxury growing up but at least I was taught the valuable lesson of going to work every day and go make an honest living. My mother taught me that there is no gain in stealing or cheating people out of their money simply because you want to make more money. She showed me how to work hard and appreciate everything that I earn in my life. There is nothing wrong with making a living instead of living in constant fear because you did people wrong out of their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}