{
  "id": "topic_5426352",
  "title": "martyns",
  "author": "martyns",
  "created_time": "December 07, 2022, 08:27:15 AM",
  "content": "I sit-down to wonder why traders who are consistent in trading and also investing still remain very broke despite the effort they put to erradicating poverty,but it still seems like there is some sort of unforseen and spiritual forces controlling the physical.Or should it be foundational curse from the forefathers affecting the present circumstances?or is it that the poverty is inherited? Or is it a gene or chromosome?.These are questions that that I tend to ask.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426352",
  "comments": [
    {
      "author": "rat03gopoh",
      "created_time": "December 07, 2022, 09:22:10 AM",
      "body": "I'm not sure if those who fail in investing and trading have reached a point of consistency. If the current business doesn't get them to improve financially, then it's not the business for them. It would be better to think about business alternatives soonSpiritual matter? Depends on who you ask for opinion. There are some traditions (such as the Chinese) that believe in myths about one's economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "December 07, 2022, 10:11:28 AM",
      "body": "If you trade and not making profits but losses, it is not because of any spiritual curse, people that are not cursed can also lose during trading. I do say that trading is not gambling, but it is gambling to some people because they do not learn the fundamentals and not following the right strategie. In addition, trading is very risky which makes it similar to gambling.Trading should not be to eliminate poverty, someone with $100 can think that way, that he can earn like $10 or more daily if go for over 10x leverage, making the trader to take trades that are riskier and resulting to losses. If you want to trade and make profit, do not think it as a means of making money, see it an an additional opportunity of making money which is not necessary, this will help you have quality mindset towards trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 07, 2022, 11:03:49 AM",
      "body": "Well this question seems little bit funny somehow meaning to itfirst i must say whenever your heart is positive towards making progress nothing on Earth would ever limit you, not even a foundational curses could limits you. Always try channel your mind, thinking and reasoning on how to make increase and progress in everything you are doing. Applying much greed sometimes somehow limits you from getting to the next level, so it's better to live a pure heart then accept whatever you trade out or even from your investments.Lastly check if you are best suited to be a trader, otherwise i would suggest you to look something else to do.. you could be good in other areas of life which you think is better for you to do than just trying your best to trade and be losing money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "December 07, 2022, 12:32:34 PM",
      "body": "There are also levels of consistency and effort. Yesterday I saw a video on Youtube where a group of fishermen vloggers came to a realization. These fishermen were complaining that they need about an hour of effort to reach their fishing grounds and another hour to go home yet they aren't getting a lot. Yesterday they were invited by another group of fishermen vloggers (with over a million subscribers) so they visited them. They were informed that those fishermen vloggers with over a million subscribers will travel 2 to 3 hours just to reach a fishing ground and with the same hours going back. My point is those who made the extra mile will be rewarded more for their efforts. Trading and investing aren't just purely technical, it is psychological as well. Years before, I met someone online who's been making thousands of dollars with his daily trades. He told me that his skills and emotions are the products of months of sleepless nights over the years and that he read nearly a hundred books on trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoindata21",
      "created_time": "December 07, 2022, 12:48:43 PM",
      "body": "Imo investing and trading are all about psychology and strategy. Intelligence might play a small part but it is not necessary. If you are the type who is good at solving problems you will probably produce a good strategy. The psychology part takes time and practice, aswell as life experience",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "December 07, 2022, 01:35:51 PM",
      "body": "Doesn't trading & investing require patience to gain profits and one can become rich, I see many of my friends who are successful in trading & investing in the crypto market, in fact their ancestors were basically poor, in my friend's family he is the richest and most successful since he was involved in the crypto world, was it inherited, of course not.I think someone's success lies in themselves, if they stick to the belief that what they do will be successful in the future, of course they will get the best.Never be too ambitious and get rich quick in crypto trading & investment, do it step by step to do it, that way you will have good results for your trading, remember the crypto market from experience, it always rises at a predetermined time, seasonally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fesatmas",
      "created_time": "December 07, 2022, 01:51:52 PM",
      "body": "If you ask me is poverty inherited or hereditary? I would say no. Because actually we are given something that we must use to get out of the poverty line, one of which is the brain (thinking).If we are still broke in trading or investing, it means that something is still wrong, and we have to learn again what the problem really is, why we always fail and go bankrupt. As long as we are still willing to learn about it, I'm sure we will find things that might become obstacles in what we do, in this case trading and investing. But if someone says that nothing is wrong, I would say that person is lazy enough to see where things go wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 07, 2022, 02:23:36 PM",
      "body": "Funny topic, trading is based on practice and skills, there are no inheritance involved here. Having parents who have experience in trading might build the kids to better traders, but that is about it.Learning trading on your own means having to \"waste\" a lot on the learning curve. That is like the tuition fee of getting to know the basics of trading. Of course  dummy trading will solve this problem.Still one needs to work a lot on their emotions and skills to become a good trader. Not every mindset can be a good trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "December 07, 2022, 02:49:47 PM",
      "body": "Everyone understands that the size of investments is of primary importance and, accordingly, the profit will vary greatly between those who invested $100 and those who invested a million. In addition, here the loss of half of the investment for those who have a million will be less catastrophic than the loss of half for those with a small deposit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "December 07, 2022, 02:50:57 PM",
      "body": "This is funny to read. Your post looks seemingly like a trader who is frustrated in it. At every point in trading, a trader can get to that level of frustration but if the trader enjoys what he does, he will be passion driven and continue till he succeed. Learning the trading skill is not easy, it takes alot of time for you to start getting it right but don't think a trader will be perfect because there is no perfect trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 07, 2022, 03:04:43 PM",
      "body": "Quote from: martyns on December 07, 2022, 08:27:15 AMI sit-down to wonder why traders who are consistent in trading and also investing still remain very broke despite the effort they put to erradicating poverty...Some statistics and research show that 95% of those who trade end up losing, especially if they trade something that is risky and volatile. This entire machinery that creates the impression that people can get rich overnight if they invest in coin/tokens is actually created by those who invent various crypto projects, and those who give them the necessary infrastructure to become available to the masses.Here and there someone will really get rich, but at the same time thousands will lose everything they have - unfortunately, that's how the system works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 07, 2022, 03:10:25 PM",
      "body": "Everything is a trial and error. Maybe they just lose for now and this loss will make them learn and win in the future. It's always like that and some just take a long time for them to learn. The market is not easy to learn too. Never quit and if it's really possible, consult a shaman before trading.   If trading is really not the kind of skill that someone learns, he should just consider Hodling.  Its safer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "December 07, 2022, 03:32:00 PM",
      "body": "Quote from: martyns on December 07, 2022, 08:27:15 AMI sit-down to wonder why traders who are consistent in trading and also investing still remain very broke despite the effort they put to erradicating poverty,but it still seems like there is some sort of unforseen and spiritual forces controlling the physical.Or should it be foundational curse from the forefathers affecting the present circumstances?or is it that the poverty is inherited? Or is it a gene or chromosome?.These are questions that that I tend to ask.This is mainly as a result of not having a proper plan before coming to invest/trade Bitcoin and cryptocurrency.Every investor or trader out there should set its daily, weekly, monthly or yearly target / goal trading Bitcoin and cryptocurrency, so once your target is achieved, use those profits to solve your day to day needs, and maybe if large profit is achieved you should look into investing in other things like real estate, this will help you not get recked and go broke while investing and trading cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "December 07, 2022, 05:07:11 PM",
      "body": "Quote from: martyns on December 07, 2022, 08:27:15 AMI sit-down to wonder why traders who are consistent in trading and also investing still remain very broke despite the effort they put to erradicating poverty,but it still seems like there is some sort of unforseen and spiritual forces controlling the physical.Or should it be foundational curse from the forefathers affecting the present circumstances?or is it that the poverty is inherited? Or is it a gene or chromosome?.These are questions that that I tend to ask.If you have the thought and believe that a spiritual force or something is affecting you, you will steady be seeing reasons to support your speculation. Consistency in trading does not mean that you will make money in doing so, you can be consistently loosing money with the wrong approach and strategy, while some people who don't trade consistently but with a good strategy are benefiting because of their strategy. I don't think anything but your mentality is what is affecting you, change your mentality and improve your strategy and approach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "December 07, 2022, 06:39:42 PM",
      "body": "Quote from: martyns on December 07, 2022, 08:27:15 AMI sit-down to wonder why traders who are consistent in trading and also investing still remain very broke despite the effort they put to erradicating poverty,but it still seems like there is some sort of unforseen and spiritual forces controlling the physical.Or should it be foundational curse from the forefathers affecting the present circumstances?or is it that the poverty is inherited? Or is it a gene or chromosome?.These are questions that that I tend to ask.Really hard to believe on or to say into those people who are consistent or making profits in trading or simply survive this market would really be having that kind of feeling.If i were into those feet or shoes into thosetraders then why would really be not happy on what you had achieved or able to obtain? This has nothing to do with anything bullshit like spiritual forces or physical shit or whatsoever.If you arent happy on what you are currently been dealing with then you should simply stop, but just like i do said earlier that it is really hard to believe on that someone who areconsistent on trading cant really be that happy because we know that person would be totally be that contented if he do really be able to make money consistentlyspecially into this unpredictable market.It is really just too impossible that you wont really be that happy on this case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 07, 2022, 06:51:35 PM",
      "body": "No curse, no spiritual matters but just all about how they manage their finances. That's it. There's no other reason why someone who's profitable yet still seems to be broke behind.It's not about the money that you earn but all about how you're good at holding and spending the money that you get. There are people that don't earn that much but avoids being broke because they know their priorities and where and what to spend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 08, 2022, 09:49:21 AM",
      "body": "Quote from: martyns on December 07, 2022, 08:27:15 AMI sit-down to wonder why traders who are consistent in trading and also investing still remain very broke despite the effort they put to erradicating poverty,but it still seems like there is some sort of unforseen and spiritual forces controlling the physical.Or should it be foundational curse from the forefathers affecting the present circumstances?or is it that the poverty is inherited? Or is it a gene or chromosome?.These are questions that that I tend to ask.Remaining consistent in terms of keep repeating the trading and investing?No, they're committing a mistake or keep repeating it that is why they can't able to succeed consistent generally in the investment.First of all they need to tick all the basics before becoming trader or investor which is other sources of income. If someone relies only on income source from their investment then sooner or later they will be broke in most cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "December 08, 2022, 11:47:11 AM",
      "body": "Quote from: bitcoindata21 on December 07, 2022, 12:48:43 PMImo investing and trading are all about psychology and strategy. Well, that's lack of what it is all about. It also includes finances/money and that's why we want to trade because we either win or lose but mostly, we want to earn and make money out of it.Quote from: bitcoindata21 on December 07, 2022, 12:48:43 PMIntelligence might play a small part but it is not necessary.That's part of decision making and strategizing so IMO, it's the biggest part and most necessary.Quote from: bitcoindata21 on December 07, 2022, 12:48:43 PMIf you are the type who is good at solving problems you will probably produce a good strategy. The psychology part takes time and practice, aswell as life experienceAnd that includes the intelligence and that means that it contradicts from what you've said. But we do agree about taking time of practice which is common to have experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "December 08, 2022, 11:55:13 AM",
      "body": "Quote from: martyns on December 07, 2022, 08:27:15 AMI sit-down to wonder why traders who are consistent in trading and also investing still remain very broke despite the effort they put to erradicating poverty,but it still seems like there is some sort of unforseen and spiritual forces controlling the physical.Or should it be foundational curse from the forefathers affecting the present circumstances?or is it that the poverty is inherited? Or is it a gene or chromosome?.These are questions that that I tend to ask.Not because you started trading doesn't mean that you will be rich. Not because you put too much effort on studying about trading, asking advices, paying for indicators, doesn't mean you will succeed on most of your trades. Trading is not compatible to everyone, you gotta know where you excel the most, where your skills are useful 100%, because if you'll force yourself in trading even though you can't see yourself being a successful trader, then whatever you'll do is useless. \"God gives mercy to those who help themselves\" in short, ask God for his mercy to help us, and don't stop trying until you find the work that works for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}