{
  "id": "topic_5476868",
  "title": "Bitcoin Smith",
  "author": "Bitcoin Smith",
  "created_time": "December 07, 2023, 06:59:47 AM",
  "content": "Avalanche was selected as the primary settlement layer for IEEE’s certificate issuance because of the need for an ecosystem compatible with the Ethereum Virtual MachineThe credentialing system used by the Institute of Electrical and Electronics Engineers (IEEE) will use the Avalanche blockchain to issue tamper-evident certificates in India. India is the second-largest IEEE membership base outside the United States, with over 75,000 members. The professional association will issue IEEE credentials or certificates to all trainees and users to make the verification process tamper-proof, instant and secure.The IEEE will issue blockchain certificates via LegitDoc, a blockchain-based credential lifecycle management built by Zupple Labs. Speaking to Cointelegraph, Zupple co-founder Neil Martis said that the Indian public sector has become more willing over the last 12 months to implement full-fledged blockchain projects over pilots.The decision to use Avalanche’s C-Chain as the primary settlement layer for IEEE’s certificate issuance stemmed from the need for an ecosystem that is compatible with the Ethereum Virtual Machine (EVM). “However, we would be experimenting with new platforms as additional parallel settlement layers as suitable new tech emerges,”SourceIEEE is an institution similar to IIT in India and it is good to see that they are trying to utilize the blockchain utility and I am not really aware that AVAX has really such use case until I stumble upon this article.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476868",
  "comments": [
    {
      "author": "Bureau",
      "created_time": "December 07, 2023, 10:25:25 AM",
      "body": "The reason why they might be using Avalanche blockchain is because it is very fast and its the ability to launch both Private and Public Blockchain. In this case, they would be creating a Private Blockchain for the creation of tamper-proof certificates. After reading the complete synopsis I was able to gather their main objective is the generation of certificates. Another good thing about Avalanche is the concept of subnetting, which basically means the creation of mini blockchains within the Avalanche blockchain and allowing each blockchain to govern by itself. In all, you have robust security, a private blockchain that is governed by its own rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 08, 2023, 03:37:15 PM",
      "body": "I am aware of a project called EvidenZ (previously BCDiploma) which also provides similar certificates for school and college degrees. Was a bounty participants and its token price went up well, so I holding their tokens for many years now. I think blockchain entrance into the common things of life like groceries, marketing, certification will not happen quickly but very slowly because of a multitude of factors. The above news is optimistic but following it to see how much it makes an impact, will be worth seeing.BTW I first came to know about IEEE when I was doing my firsts in wifi hacking, I used to come across the IEEE 802.11x very commonly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ravichnadra",
      "created_time": "December 28, 2023, 03:57:52 PM",
      "body": "Hello there! Certainly! The Institute of Electrical and Electronics Engineers (IEEE) has initiated a program to issue blockchain skill certificates in India. These certificates will focus on expertise related to the Avalanche platform, a blockchain network known for its high performance and scalability. This program aims to validate and recognize individuals' proficiency in utilizing Avalanche technology, equipping them with sought-after skills in the rapidly growing field of blockchain technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}