{
  "id": "topic_5400352",
  "title": "Silence Scream",
  "author": "Silence Scream",
  "created_time": "May 27, 2022, 01:49:44 AM",
  "content": "Bitcoin ile günümüzde en büyük fiat para koruyucusu kabul edilen gold arasında bazı ilişkileri kaleme alacağım. Bu konuda yazacaklarım bir derleme olacak arkadaşlar. En azından insanların zihninde neden altın yerine bitcoin almalıyım sorusuna basit bir cevap bulmak olacak amacım.Bitcoin Vs GoldBitcoin için konuşmak gerekirse ; +Teknolojisi yeni ve Blockchain ile her işlem kayıt altına alınıyor. Geçmişe bir göz attığımızda 2010 yılındaki ilk transferlerin kayıtları bile hala dijital defterlerde kayıt altında. Bu da işlem geçmişi kontrolünü, hangi hesabın neler yaptığını görmemizi sağlıyor. Altın ise, kimin elinde ne var bilinmediği için gizli bir güç olarak kullanılıyor. +Madencilik konusunda Bitcoin 21 Milyon adet üretilecek olup, ilk yıllarda üretilen kimi tahmine göre 3, kimi tahmine göre 5 milyon bitcoine kadar kayıp olduğunu da düşünecek olursak dünya üzerinde kısıtlı bir sayısı var. Altında ise durumlar böyle değil. Hala artan sayıda madencilik faliyetleri ile sürekli artan bir altın rezervi sayısı mevcut. +Çevresel döngüler göz önüne alındığında, aslında dünyada iddia edildiği gibi Bitcoin üretimi çok zararlı değil. En azından altına kıyasla bunu söyleyebilirim. Bu örnekte bunu gösteriyor.+Bitcoin, genç bir teknoloji ve yeni bir yatırım portföyü olmasına rağmen dünya piyasalarına kendini kabul ettirmiş. Altın ise eski bir yatırım aracı olmasına rağmen hala piyasalarda ana ekonomik yöntemlerden olmaya devam ediyor.Güzel konuştuk ancak hala bazı olumsuz yönlerden bahsetmek gerekir :> Bitcoin için stabil bir değer olmadığı için, yükselişlerde de, düşüşlerde de volatil bir durumdan bahsedebiliriz. Yükselişlerde çok sorun değil tabii ki ancak düşüşlerde çok kayıplar yaşanıyor. Bu süreçte olaya dolar bazı yerine Bitcoin değeri olarak bakarsanız daha doğru olacaktır. Sonuçta elinizde değeri farklı görünse de hala aynı sayıda Bitcoin olacaktır.> Altının fiziki karşılığı olması yüzünden insanlara hala daha cazip geldiği bir gerçek. Bu yüzden bitcoine göre daha çok alt tabakalara hitap eden bir yatırım aracı. Üstelik yumuşak ve kolay şekil alabilen yapısı nedeniyle ziynet eşyaları kullanımıyla da dünyada adından sıkça söz ettirirken, Bitcoinde fiziki bir karşılık olmaması nedeniyle alt tabaka insanlara ulaşımı şimdilik daha zor. Dijitalleşen dünyada şimdiki neslin büyüyüp tam olarak teknolojik bir erişkin birey çağında olduğunda bu dezavantajda ortadan kalkacak diye düşünüyorum.Sizin de değerli fikirleriniz ile bu konuya katkıda bulunacağınızı düşünüyorum. Benim aklıma gelenler şimdilik bu şekilde.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400352",
  "comments": [
    {
      "author": "kriminall",
      "created_time": "May 27, 2022, 04:28:54 AM",
      "body": "Altın iyidir, cankurtaran görevi görür, stabil paraya geçişte dolar yerine fiziksel altın tercihinden yanayım, en azından bizim hayatta olacağımız süreçte altına olan ilginin sürekli devam edeceği kanısındayım, bitcoin de çok önemli bir değer ancak altın kadar global bir piyasaya etki etmesi için en azından bizim ömrümüzün yeterli olmayacağını düşünüyorum, altının üretiminde de çevreye zararları olduğunu duymuştum özellikle siyanürlü çıkardıkları yöntemlerle altın üretmek çevreye çok zarar veriyor, ancak bazı kişiler tarafından bitcoin madenciliği için yapılan temiz sayılan metotlar ile karalama çalışmaları devam ediyor,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 27, 2022, 05:11:50 AM",
      "body": "Arçelik vs Gold desem ? veya Nokia vs Gold olmadı Amerika vs Gold dur dur NATO vs Gold  O da olmadı bizim klima var Altus marka Altus vs Gold diyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "May 27, 2022, 11:34:22 PM",
      "body": "Karşılaştırmanız güzel ancak bazı eksiklikler var. Bitcoin ile altını kıyaslarken bahsedeceğim ilk noktalar kolay taşınabilirlik ve saklama kolaylığı olurdu. Bunlar sonucunda ortaya çıkan gerçek sahiplik sorunları altında çok fazla. Elinizdeki altını koruyabilmek için bir şekilde bankalara yada kiralık kasalara muhtaç kalıyorsunuz. Hafif ve değerli olması hırsızları her zaman kendisine çeker. Evinizde saklarsanız dedektör yardımıyla bulunması fiat paralar yada bitcoinden çok daha kolaydır. Bankada altın hesabı olarak tutarsanız gerçek karşılığının olma/olmama durumu ve bankanın el koyma olasılığı ortaya çıkar. Bankaların en güvenilir kısımlardan birisi olan kişisel kasalarda saklarsanız acil bir durumda ulaşamama olasılığınız ortaya çıkar. Bir soygun durumunda banka kasa verileri tutulmadığı için yasal düzenlemelerden faydalanamazsınız.Kolay taşınabilirlik kısmına geldiğimizde bir ülkeden diğerine sokabileceğiniz altın miktarı kısıtlıdır. Savaş ve benzeri ekstrem durumlarda ise altın taşımak çok riskli hale gelir. Çok yakın zamanda Rusya - Ukrayna savaş sürecinde kolay taşınabilirliğin ne kadar önemli olduğunu gördük.Bitcoin fiziksel bir birim olmadığı için 12 kelimelik seedi ezberlediğinizde dünyanın her yerine birlikte gidebilirsiniz. Basit gizlilik kurallarının dışına çıkmadıysanız ne kadar bitcoine sahip olduğunuz hiç kimse bilemez. Dünyanın hangi bölgesine giderseniz gidin bitcoinlerinizi kolay bir şekilde ihtiyacınızı karşılayacak nakide dönüştürebilirsiniz. Saklaması dünyadaki en kolay para birimidir. Birilerine emanet etmeniz, güvenmeniz gerekmez. Günün her saatinde kolayca kullanabilirsiniz. Saklamak için özel hiç bir cihaza ihtiyacınız yoktur. Eğer bitcoinlerinizi nasıl saklamanız gerektiğini öğrenmek için biraz zaman ayırdıysanız eve girecek bir hırsız onları asla bulamaz, erişim sağlayamaz. Ve en önemlisi siz istemedikçe dünyadaki hiç bir güç size ait bitcoinlere erişemez, sahipliğinizi kısıtlayamaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 28, 2022, 07:11:29 AM",
      "body": "Bu karşılaştırmaların hepsi eziklik psikolojisi sonucu ortaya çıkar. Sahip olamadığımız şeyler için sahtesini uretiriz. Doğan SLX arabalara modifiye dohble ekran takmak, Ferrari ile Murat 131 karşılaştırmak tüplü televizyonu ışıklandırma takmak. İnsan psikolojisi sahip olamadığı şeyleri sahtelerini yücelterek eziklik psikolojisini bastırır. Altına sahip olamayanların bitcoini yuceltmesi, bitcoini olmayanların bitcoini elestirmesi eziklik psikolojisinin dışa vurumudur. Gerçek şuki Altın ile Bitcoini karşılaştıran beynin  başarılı olma şansı yoktur  acemidir piyasalar hakkında bilgisi yoktur . karsilastirilan iki ürün arasında kayda değer tek bir benzerlik bile yok Altın fiziksel ürün madenden çıkarılan işlemcilerde sanayide kullanılan Nano ciplerin içine giren sarı renkli elementtir. Birikim amacıylada kullanılır. Bitcoin yazılımdır teknolojidir. Teknoloji değişir gelişir. Bitcoin ile Altın karsılastırması yapmak kadar saçma ironik durum yok. Altın ile Bitcoinin klasmanı farklı. 50-100 yıl sonra varolup olmayacağı bile belli olmayan teknolojik ürünleri alıp altının karşısına koymak ya eziklik psikolojisi yada spekulasyondur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 28, 2022, 07:22:39 AM",
      "body": "bitcoininizde olsun altınınızda. ikisininde ayrı kulvarda oldunu bilerek bilinçli şekilde alımlar yaparak kazanabilirsiniz. biri daha yüksek getiri sağlayabilir diğeri başka zaman iflas etmenizi engeller. dünyadaki tüm merkez bankalarının sonraki nesillere ve halkının refahı için tuttuğu her fırsatta alım yaptığı altındır. bitcoin teknoloji inovasyon demektir yüksek getiri sağlar sağlamaz kişiden kişiye değişir at arabası ile gezen var mı yok teknoloji eskir bundan 100 yıl sonra bitcoine at arabası gözüyle bakacaklar. ama bitcoin yatırımcısını zengin ediyor ve bitcoininiz olsun. ama tutupta bitcoin altındır yeni altın budur gibi temelde tutarlı olmayan bu düşüncelere kapılmayın spekülasyonlara kurban gitmeyin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "May 28, 2022, 11:56:45 AM",
      "body": "İkisininde yeri ayrı ama karşılaştırırlar, karşılaştırılmaz değiller. Ama herkesin sepetinde her ikisinden de olması gerekiyor. Fiziksel altın malesef çıkarılması,saklanması çok zahmetli bir emtia, bunun yanında bitcoin çok daha avantajlı bir halde kalıyor. Bir güneş patlaması olur, elektrikler uzun bir süre yok olur bilmem ne bunun içinde tek bitcoin tutmak baya riskli olurdu o yüzden sepet ne kadar geniş olursa o kadar iyi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "May 28, 2022, 12:24:39 PM",
      "body": "Quote from: SVirusu on May 28, 2022, 07:11:29 AMBu karşılaştırmaların hepsi eziklik psikolojisi sonucu ortaya çıkar. Sahip olamadığımız şeyler için sahtesini uretiriz. Doğan SLX arabalara modifiye dohble ekran takmak, Ferrari ile Murat 131 karşılaştırmak tüplü televizyonu ışıklandırma takmak. İnsan psikolojisi sahip olamadığı şeyleri sahtelerini yücelterek eziklik psikolojisini bastırır. Altına sahip olamayanların bitcoini yuceltmesi, bitcoini olmayanların bitcoini elestirmesi eziklik psikolojisinin dışa vurumudur. Gerçek şuki Altın ile Bitcoini karşılaştıran beynin  başarılı olma şansı yoktur  acemidir piyasalar hakkında bilgisi yoktur . karsilastirilan iki ürün arasında kayda değer tek bir benzerlik bile yok Altın fiziksel ürün madenden çıkarılan işlemcilerde sanayide kullanılan Nano ciplerin içine giren sarı renkli elementtir. Birikim amacıylada kullanılır. Bitcoin yazılımdır teknolojidir. Teknoloji değişir gelişir. Bitcoin ile Altın karsılastırması yapmak kadar saçma ironik durum yok. Altın ile Bitcoinin klasmanı farklı. 50-100 yıl sonra varolup olmayacağı bile belli olmayan teknolojik ürünleri alıp altının karşısına koymak ya eziklik psikolojisi yada spekulasyondur.Yatırım aracı, değer saklama aracı olarak ele alınıyorsa isterseniz altın veya bitcoin ile vibratörü bile kıyaslayabilirsiniz. Başlıktaki hiç kimse altın ve bitcoini hangisi daha fiziksel diye karşılaştırmamış zaten yada hangisi teknoloji alanındadır şeklinde. Başlığı açan kişinin karşılaştırma yaptığı özellikler;GizlilikToplam miktarÇevre kirliliğiKabul edilirlikikisine ait olan özelliklerin de kendince avantaj - dezavantajlarından bahsetmiş. Bir görüş ortaya koymak eziklik değildir ancak kişiyi beyan ettiği fikirden dolayı ezik olarak nitelemek eziklik olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 28, 2022, 06:43:09 PM",
      "body": "Quote from: Bthd on May 28, 2022, 12:24:39 PMQuote from: SVirusu on May 28, 2022, 07:11:29 AMBu karşılaştırmaların hepsi eziklik psikolojisi sonucu ortaya çıkar. Sahip olamadığımız şeyler için sahtesini uretiriz. Doğan SLX arabalara modifiye dohble ekran takmak, Ferrari ile Murat 131 karşılaştırmak tüplü televizyonu ışıklandırma takmak. İnsan psikolojisi sahip olamadığı şeyleri sahtelerini yücelterek eziklik psikolojisini bastırır. Altına sahip olamayanların bitcoini yuceltmesi, bitcoini olmayanların bitcoini elestirmesi eziklik psikolojisinin dışa vurumudur. Gerçek şuki Altın ile Bitcoini karşılaştıran beynin  başarılı olma şansı yoktur  acemidir piyasalar hakkında bilgisi yoktur . karsilastirilan iki ürün arasında kayda değer tek bir benzerlik bile yok Altın fiziksel ürün madenden çıkarılan işlemcilerde sanayide kullanılan Nano ciplerin içine giren sarı renkli elementtir. Birikim amacıylada kullanılır. Bitcoin yazılımdır teknolojidir. Teknoloji değişir gelişir. Bitcoin ile Altın karsılastırması yapmak kadar saçma ironik durum yok. Altın ile Bitcoinin klasmanı farklı. 50-100 yıl sonra varolup olmayacağı bile belli olmayan teknolojik ürünleri alıp altının karşısına koymak ya eziklik psikolojisi yada spekulasyondur.Yatırım aracı, değer saklama aracı olarak ele alınıyorsa isterseniz altın veya bitcoin ile vibratörü bile kıyaslayabilirsiniz. Başlıktaki hiç kimse altın ve bitcoini hangisi daha fiziksel diye karşılaştırmamış zaten yada hangisi teknoloji alanındadır şeklinde. Başlığı açan kişinin karşılaştırma yaptığı özellikler;GizlilikToplam miktarÇevre kirliliğiKabul edilirlikikisine ait olan özelliklerin de kendince avantaj - dezavantajlarından bahsetmiş. Bir görüş ortaya koymak eziklik değildir ancak kişiyi beyan ettiği fikirden dolayı ezik olarak nitelemek eziklik olabilir.Hocam çevreyi kirletmeye emtiamı var sanayilerde hergün harcanan su tüm insanlığın 100 yıllık içtiği suya eşdeğer. Petrol üretilirken çıkan gazlar , kömür madenleri , gümüş altın paladyum madencilgi bu fikre göre insanlık madenciliği bırakıp avcı toplayacı yaşama geri dönsün. Gizlilik konusuna gelince gizlilik diye birşey yok. Elinde telefon olan biri gizliliğe inanıyorsa ya çok temiz kalplidir ya da saftır. Yakında herkese çip atacaklar cüzdanları bile cipe yukleyecekler en güzel zamanlar bu zamanlar en azından kağıt para var.Kabul edirlik bakımından altın bitcoine karşı bariz üstünlük kurar biryanda binlerce yılın emtiasi diğer yanda 10 yıllık teknoloji bundan 1000 yıl sonra ne sen ne ben ne de bitcoin kalır ama altın hala ayakta olacak Toplam miktara gelince neye göre kime göre. Dünyada futures işlemler 70 lerden buyana var dünyada şuan herşey sınırsız. Gümüşü ele alalım açığa satarak 100 yıl baskılarlar isteseler. Futures varken sınırlı varlik diye birşey yoktur açığa satış olmasaydı şuan hiperenflasyon vardı dünyada",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 28, 2022, 08:56:46 PM",
      "body": "Ben Bitcoin'in daha iyi bir para birimi veya transfer aracı olduğunu, altının ise daha iyi bir değer veya servet saklama aracı olduğunu düşünüyorum. Altının fizikselliği ve de asla azalmayacak yok olmayacak olan kıymeti Altın a portföylerimizde yer vermenin ne kadar mantıklı bir durum olduğunu kanıtlar niteliktedir. Bitcoin ise daha çok ucuzken alınıp itibar ettiğinde satılacak, para göndermekte kısıtlamaları ortadan kaldıracak ve komisyonları yok edecek bir araç.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "May 29, 2022, 12:08:00 AM",
      "body": "Quote from: SVirusu on May 27, 2022, 05:11:50 AMArçelik vs Gold desem ? veya Nokia vs Gold olmadı Amerika vs Gold dur dur NATO vs Gold  O da olmadı bizim klima var Altus marka Altus vs Gold diyorum Siz istediğinizi söylemekte özgürsünüz, sizin hayatınız sizin fikirleriniz. Burada anlatmak istediklerimi bazı arkadaşlar çok iyi anlamış. Ben körü körüne Bitcoin veya altın demedim. Her ikisinin de artısı ve eksisi var. Benim vurgulamak istediğim nokta bence 10 senelik diye bahsettiğin şu teknolojinin gidişatı altından daha iyi yerlere doğru evrilecek. İsteyen istediği yatırımı yapar. Sen Nokia hissesi alabilirsin yada NATO (?) ile ilgilenebilirsin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 29, 2022, 07:19:56 AM",
      "body": "Quote from: Silence Scream on May 29, 2022, 12:08:00 AMQuote from: SVirusu on May 27, 2022, 05:11:50 AMArçelik vs Gold desem ? veya Nokia vs Gold olmadı Amerika vs Gold dur dur NATO vs Gold  O da olmadı bizim klima var Altus marka Altus vs Gold diyorum Siz istediğinizi söylemekte özgürsünüz, sizin hayatınız sizin fikirleriniz. Burada anlatmak istediklerimi bazı arkadaşlar çok iyi anlamış. Ben körü körüne Bitcoin veya altın demedim. Her ikisinin de artısı ve eksisi var. Benim vurgulamak istediğim nokta bence 10 senelik diye bahsettiğin şu teknolojinin gidişatı altından daha iyi yerlere doğru evrilecek. İsteyen istediği yatırımı yapar. Sen Nokia hissesi alabilirsin yada NATO (?) ile ilgilenebilirsin. bitcoini fiyat olarak altın ile karşılaştırabilirsiniz hisse senetlerine göre performansını ölcebilirsiniz ama yapı olarak asla karsılastırmayın ikisininde klasmanı farklı. birkere emtialar ortak hareket eder altın petrol gümüş doğalgaz nikel uranyum mısır pamuk hepsi ortak hareket eder hisse senetleri risk ürünleri ortak hareket eder. en kısa örnekle 1990-2000 arasına bakalım emtia fiyatları düşüyor sovyetler birliği çökmüş dünyada yatırımcılarda risk iştahı artıyor amerika hisse senetleri rekorlar kırmaya başlıyor altın 200 dolara kadar geriliyor sonra ne oluyor 2000 yılı dotcom krizi ve tüm teknoloji devlerinin hisseleri yerle bir oluyor büyük bir kriz yaşanıyor bu aralıktan sonra dünyada emtialar artan riskler Abd ırak savası derken emtialar yükseliyor buğday petrol altın nikel demir yükseliyor hepsi ortak yükseliyor. Yatırım yaptıgın bir enstrümanı ona eşdeğer şeylerle bir tutarsan yanılmazsın klasman farkı var aynı ligde değiller. Yani bitcoin ile Altını yapı olarak karsılastırmazsın Bitcoin ile Petrolü karsılastırabilirmisin petrolün taşınması zor ama bitcoini hemen başka ülkeye transfer edebilirsiniz böyle bir düşünce tarzı olabilir mi. Bitcoin ile buğday karşılaştırılabilir mi bugdayin nakliyesi zor navlun ücretleri var depolama masrafı var ama Bitcoinin yok böyle bir bakış açısı var mı böyle ilginç düşünce tarzı varmı. Benim evdeki klima ile Bitcoini karşılaştırmak gibi birşey. İkisinin yapısı farklı ama şunu diyebilirsin bitcoin altından daha fazla getiri sundu petrolden daha fazla kazandırdı bu yıllarda bitcoin alan güzel kazandı doğru bu düşünce doğru fiyat olarak karşılaştırılabilir ama altın transfer etmesi taşıması zor bitcoin alın demek kadar acayip fikir yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "May 29, 2022, 11:20:45 AM",
      "body": "Quote from: SVirusu on May 29, 2022, 07:19:56 AMYani bitcoin ile Altını yapı olarak karsılastırmazsın Bitcoin ile Petrolü karsılastırabilirmisin petrolün taşınması zor ama bitcoini hemen başka ülkeye transfer edebilirsiniz böyle bir düşünce tarzı olabilir mi. Bitcoin ile buğday karşılaştırılabilir mi bugdayin nakliyesi zor navlun ücretleri var depolama masrafı var ama Bitcoinin yok böyle bir bakış açısı var mı böyle ilginç düşünce tarzı varmı. Benim evdeki klima ile Bitcoini karşılaştırmak gibi birşey. İkisinin yapısı farklı ama şunu diyebilirsin bitcoin altından daha fazla getiri sundu petrolden daha fazla kazandırdı bu yıllarda bitcoin alan güzel kazandı doğru bu düşünce doğru fiyat olarak karşılaştırılabilir ama altın transfer etmesi taşıması zor bitcoin alın demek kadar acayip fikir yok.Konu bir ülkeden diğerine paranın taşınması ise neden karşılaştırılamasın ? Eğer evinizdeki klimayı bir ülkeden diğerine parasal değeri için taşımayı düşünüyorsanız ister bitcoinle ister altınla kıyaslayabilirsiniz, buğdayı da petrolü de. Taşıdığınız ülkeye taşıması daha kolay olacaksa ve paraya çevrimi kolay olacaksa neden olmasın ? En kolay ve ucuz yolu seçmek için her şeyi denersiniz.Bitcoinin altından kolay saklanabilir ve taşınabilir olması değer saklama birimi olarak daha çok getiri getireceğini garanti etmiyor. Bitcoin daha kolay saklanabilir ve taşınabilir demek insanlara yatırım olarak bitcoin satın alma tavsiyesi vermek değildir. Örneğin genel kullanım olarak altın çok daha yaygın kabul görüyor aynı şekilde bu da insanlara bitcoin almayın altın alın demek değildir. Tamamen ortak özelliklere sahip olmasalar dahi bazı özellikler bakımından ortak işlev gören birimler her zaman karşılaştırılabilir.Kurduğunuz cümle uçak hava taşıtı gemi deniz taşıtı o yüzden yolculuk açısından bunları karşılaştıramazsınız gibi bir yere çıkıyor. Uzun mesafe yük taşıma işlemlerinde kapasitesi nedeniyle gemiler kullanılır ifadesi insanlara gemiye yatırımı yapın anlamı taşımaz benzer şekilde uçak insan ve yük taşıma için çok daha hızlıdır demekte uçaklara yatırım yapın anlamı taşımaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 29, 2022, 05:58:55 PM",
      "body": "Hocam altın transfer sorunu kagt para ile çözüldü sonra dijital ortama aktarıldı herşey daha da hızlandı. Fiziksel bir madde olan hammadde olan ı çoğu şeyde fabrikalarda sanayide hammadde olarak kullanılan birikim aracı olan altın ile Bitcoinin hızını bir tutmak mantıklı mı. Bitcoin tabikide hızlı olacak sen fiziksel bir ürün ile fiziksel olmayan kağıt olarak bile tutulmayan sayıdan ibaret olan şeyi altın ile kıyaslanıyor . altını ben nasıl transfer edicem altın dediğin şey elle tutulan birşey o kadar çok kafayı taksam altın EFT sistemine dahil eder pos cihazlarina altın ödemesi eklerim herkes gram altın ile ödeme alınsın yada kurarım güvenli blokzinciri altına endeksli stabil para karşılığında yasalarca denetlenen fiziki altın tutarım. Alın size merkezsiz para. Hem blokzincir üzerinde yasalarca denetlenen fiziki teminatlı altın para olur hemde ödeme de alırsın bu sistemle. Ama sen kuyumcudan aldığın altını Amerika'ya getirmekten bahsediyorsun. Bizim marketten aldığın ekmeği Amerika'ya transfer etmek gibi birşey. Bitcoin yazılım gerçekte karşılığı yok sanal ürün adı üstünde dijtal para yani fiziki karşılığı yok elle tutulmuyor gözle görülmüyor ama altın elle tutuluyor gözle görülüyor. Şimdi ben elle tutugum birşeyi alıp elle tutulmauan gözle görülmeyen bir teknoloji ile nasıl karsılastırayım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "May 29, 2022, 07:48:30 PM",
      "body": "Quote from: SVirusu on May 29, 2022, 05:58:55 PMaltını ben nasıl transfer edicem altın dediğin şey elle tutulan birşey o kadar çok kafayı taksam altın EFT sistemine dahil eder pos cihazlarina altın ödemesi eklerim herkes gram altın ile ödeme alınsın yada kurarım güvenli blokzinciri altına endeksli stabil para karşılığında yasalarca denetlenen fiziki altın tutarım. Alın size merkezsiz para. Hem blokzincir üzerinde yasalarca denetlenen fiziki teminatlı altın para olur hemde ödeme de alırsın bu sistemle. Başkasının kasasında aslını yada teminatını koyduğunuz sürece bahsettiğiniz şey merkeziyetsiz olmuyor. Bunu blockzincir ile desteklemek USDT - USDC v.b. merkezi stabillerden öteye gitmez. Dilediklerinde diledikleri cüzdanı dondurabiliyorlar. Bitcoin tarafından çözülen sorun bu zaten, paranızın kontrolünün sizde olması. Başkaları tarafından limitlerinizin, ne yaptığınızın kontrol edilememesi. Bankada dijital olarak aktarmaktan bahsettiğiniz şey aslında bir kaç rakamdan öteye gitmiyor. Kendi paranızın transferini gerçekleştirmek istediğinizde bile çoğu durumda izin almanız gerekiyor.Quote from: SVirusu on May 29, 2022, 05:58:55 PMAma sen kuyumcudan aldığın altını Amerika'ya getirmekten bahsediyorsun. Bizim marketten aldığın ekmeği Amerika'ya transfer etmek gibi birşey. Bitcoin yazılım gerçekte karşılığı yok sanal ürün adı üstünde dijtal para yani fiziki karşılığı yok elle tutulmuyor gözle görülmüyor ama altın elle tutuluyor gözle görülüyor. Şimdi ben elle tutugum birşeyi alıp elle tutulmauan gözle görülmeyen bir teknoloji ile nasıl karsılastırayım. Sorun tam olarak bu zaten merkezde kendini konumlandırmış bir kaç kişi yada kuruluşun boyunduruğu altından çıkmak. Altın benimse ve karşılığını ödeyerek (iş, emek yada fiat parayla) dilediğim yere dilediğim miktarı neden taşıyamıyorum ? Ekmek altın kadar değerli olsa (sadece fiat para cinsinden bahsediyorum) onu da taşıtmazlar ve kontrol altına alırlar merak etmeyin.Bir şeyin değerli olması için fiziksel olma zorunluluğu internetten önceydi, elle tutamamanız karşılığının olmadığı anlamına gelmiyor. Bitcoin matematiğin parasıdır, matematik gerçektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 30, 2022, 07:56:53 AM",
      "body": "Quote from: Bthd on May 29, 2022, 07:48:30 PMQuote from: SVirusu on May 29, 2022, 05:58:55 PMaltını ben nasıl transfer edicem altın dediğin şey elle tutulan birşey o kadar çok kafayı taksam altın EFT sistemine dahil eder pos cihazlarina altın ödemesi eklerim herkes gram altın ile ödeme alınsın yada kurarım güvenli blokzinciri altına endeksli stabil para karşılığında yasalarca denetlenen fiziki altın tutarım. Alın size merkezsiz para. Hem blokzincir üzerinde yasalarca denetlenen fiziki teminatlı altın para olur hemde ödeme de alırsın bu sistemle. Başkasının kasasında aslını yada teminatını koyduğunuz sürece bahsettiğiniz şey merkeziyetsiz olmuyor. Bunu blockzincir ile desteklemek USDT - USDC v.b. merkezi stabillerden öteye gitmez. Dilediklerinde diledikleri cüzdanı dondurabiliyorlar. Bitcoin tarafından çözülen sorun bu zaten, paranızın kontrolünün sizde olması. Başkaları tarafından limitlerinizin, ne yaptığınızın kontrol edilememesi. Bankada dijital olarak aktarmaktan bahsettiğiniz şey aslında bir kaç rakamdan öteye gitmiyor. Kendi paranızın transferini gerçekleştirmek istediğinizde bile çoğu durumda izin almanız gerekiyor.Quote from: SVirusu on May 29, 2022, 05:58:55 PMAma sen kuyumcudan aldığın altını Amerika'ya getirmekten bahsediyorsun. Bizim marketten aldığın ekmeği Amerika'ya transfer etmek gibi birşey. Bitcoin yazılım gerçekte karşılığı yok sanal ürün adı üstünde dijtal para yani fiziki karşılığı yok elle tutulmuyor gözle görülmüyor ama altın elle tutuluyor gözle görülüyor. Şimdi ben elle tutugum birşeyi alıp elle tutulmauan gözle görülmeyen bir teknoloji ile nasıl karsılastırayım. Sorun tam olarak bu zaten merkezde kendini konumlandırmış bir kaç kişi yada kuruluşun boyunduruğu altından çıkmak. Altın benimse ve karşılığını ödeyerek (iş, emek yada fiat parayla) dilediğim yere dilediğim miktarı neden taşıyamıyorum ? Ekmek altın kadar değerli olsa (sadece fiat para cinsinden bahsediyorum) onu da taşıtmazlar ve kontrol altına alırlar merak etmeyin.\"Sorun tam olarak bu zaten merkezde kendini konumlandırmış bir kaç kişi yada kuruluşun boyunduruğu altından çıkmak. Altın benimse ve karşılığını ödeyerek (iş, emek yada fiat parayla) dilediğim yere dilediğim miktarı neden taşıyamıyorum\"Ya hocam altını taşıyamayan mı var herkesin evinde altını var yastık altında banka hesabında. Gayet güzel taşıyorlar. Merkeze konumlandırılmış diyorsun dijital ortamda başka firmaların sirketlerin oluşturduğu cüzdanlarda bitcoin tutmak mı merkezsizlik. Coinbase Blockchain.info daha kötüsü binance cüzdanında bitcoin tutup merkezsiz ortamdayım falan mı zannediyorsunuz. Ben size merkezsizligi söylüyorum kuyumcuya gidin 1 kg külçe altın 1 kg külçe gümüş alın. Eve koyun. Bakalım kim karışabilecek. Hırsız girebilirmiş gelsin bakalım girsin girebiliyorsa",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SVirusu",
      "created_time": "May 30, 2022, 08:00:13 AM",
      "body": "Ayrıca kactane bitcoin çalındı kactane hack vakası oldu kaç borsa battı kaç kişi para kaybetti risk heryerde var yazılım matematik tamamen kusurlu bugün milyarlarca dolar güvenlik şirketlerine ödeme yapan bankaların bile açıklarından milyonlarca dolar para hackleniyor. Merkezsizlik yok tek merkez cebiniz. Para cebinizde ise merkezsizsiniz. Parayı ekranda sayı olarak görüyorsanız merkezlisiniz. Fizik kuralları bile 50-100 yılda bir degisiyor 2+2=5 eder. 4 eden diyenler kaybedecek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "May 30, 2022, 08:05:39 AM",
      "body": "Quote from: SVirusu on May 30, 2022, 08:00:13 AMAyrıca kactane bitcoin çalındı kactane hack vakası oldu kaç borsa battı kaç kişi para kaybetti risk heryerde var yazılım matematik tamamen kusurlu bugün milyarlarca dolar güvenlik şirketlerine ödeme yapan bankaların bile açıklarından milyonlarca dolar para hackleniyor. Merkezsizlik yok tek merkez cebiniz. Para cebinizde ise merkezsizsiniz. Parayı ekranda sayı olarak görüyorsanız merkezlisiniz.Hocam garantici yaklaşımla yaklaşırsanız, para sürekli cebinizde olacaksa bu tür yatırımlardan kazançları da saf dışı bırakmış olursunuz ha bana yeter bu kadar diyorsanız o zaman da enflasyona yenileceksiniz altın veya döviz ile birikim yaparsanız emeğinizi korursunuz bu forumda bir sürü insan kazanç sağlamak için proje araştırmalarına girişiyorlar bu yüzden risk alıyorlar risk alınmadan da yüksek kazanç olmuyor maalesef",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "May 30, 2022, 09:31:48 AM",
      "body": "Quote from: SVirusu on May 30, 2022, 07:56:53 AMYa hocam altını taşıyamayan mı var herkesin evinde altını var yastık altında banka hesabında. Gayet güzel taşıyorlar. Merkeze konumlandırılmış diyorsun dijital ortamda başka firmaların sirketlerin oluşturduğu cüzdanlarda bitcoin tutmak mı merkezsizlik. Coinbase Blockchain.info daha kötüsü binance cüzdanında bitcoin tutup merkezsiz ortamdayım falan mı zannediyorsunuz. Ben size merkezsizligi söylüyorum kuyumcuya gidin 1 kg külçe altın 1 kg külçe gümüş alın. Eve koyun. Bakalım kim karışabilecek. Hırsız girebilirmiş gelsin bakalım girsin girebiliyorsaAltını ülkeden ülkeye kafanıza göre taşıyamazsınız, her ülkenin belirlediği limitler var. Bitcoin core kullanın.Bir gün sahip olursanız külçe altını evde saklamayı denemeyin  .Quote from: SVirusu on May 30, 2022, 08:00:13 AMAyrıca kactane bitcoin çalındı kactane hack vakası oldu kaç borsa battı kaç kişi para kaybetti risk heryerde var yazılım matematik tamamen kusurlu bugün milyarlarca dolar güvenlik şirketlerine ödeme yapan bankaların bile açıklarından milyonlarca dolar para hackleniyor. Merkezsizlik yok tek merkez cebiniz. Para cebinizde ise merkezsizsiniz. Parayı ekranda sayı olarak görüyorsanız merkezlisiniz. Fizik kuralları bile 50-100 yılda bir degisiyor 2+2=5 eder. 4 eden diyenler kaybedecek.Çalınan bitcoinlerin hiç biri kişisel cüzdanlardan değil, borsalarda trade yapmayı bitcoin sahibi olmak zannediyorsanız sizinle tartışmanın anlamı yok. Siz bitcoinin ne olduğunu nasıl çalıştığını öğrendiğinizde oturup sizinle bu konuyu tekrar tartışabiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "May 30, 2022, 11:54:58 AM",
      "body": "Quote from: SVirusu on May 30, 2022, 08:00:13 AMAyrıca kactane bitcoin çalındı kactane hack vakası oldu kaç borsa battı kaç kişi para kaybetti risk heryerde var yazılım matematik tamamen kusurlu bugün milyarlarca dolar güvenlik şirketlerine ödeme yapan bankaların bile açıklarından milyonlarca dolar para hackleniyor. Merkezsizlik yok tek merkez cebiniz. Para cebinizde ise merkezsizsiniz. Parayı ekranda sayı olarak görüyorsanız merkezlisiniz. Fizik kuralları bile 50-100 yılda bir degisiyor 2+2=5 eder. 4 eden diyenler kaybedecek.Bildiğim kadarıyla çalınan bitcoinler ya bir borsanın cüzdanındakilerdi veya pv key öğrenilip hesabın boşaltılmasını sağlayan kişilerdendi, bunun dışında bitcoin çalmak  için hesabı boşaltmak için kaç milyar ihtimal bir araya gelip ancak bir sağlama yapabilir diye biliyorum, fiziksel bir şeylere yatırım yapmak istiyorsanız sizi farklı sitelere yönlendirebiliriz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}