{
  "id": "topic_5449407",
  "title": "tyz",
  "author": "tyz",
  "created_time": "April 19, 2023, 09:20:26 AMLast edit: April 20, 2023, 03:30:10 PM by tyz",
  "content": "Hallo zusammen,ich suche jemanden der auf Bittrex oder Kucoin registriert und eventuell auch verifiziert ist? Ich möchte alte Coinbestandteile verkaufen, die nur dort noch gehandelt werden. Ich möchte mich nicht extra registrieren und verifizieren. Das lohnt sich für den einmaligen Verkauf nicht.Ich suche daher jemand vertrauenswürdiges aus der Community. Ich würde die Coins an die Einzahlungsadresse des Exchanges schicken, ihr tauscht sie dann in BTC oder ETH und zahlt mir dann den Großteil davon aus. Der Rest ist euer Verdienst. Ich dachte da an einen Betrag von rund $50-100 für Euch (VB).Mehr Details gerne auch per PN falls jemand Interesse hat.Gruß tyz",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449407",
  "comments": [
    {
      "author": "sam00",
      "created_time": "April 19, 2023, 09:50:36 AM",
      "body": "Um was für einen Betrag handelt es sich denn etwa?Theoretisch findet ja eine Schenkung statt (wahrscheinlich aber nicht über der Freigrenze, da du dich bei 20.000€ vermutlich selbst registrieren würdest) und anschließend ein zu versteuernder Verkauf oder nicht?Also ich wäre vorsichtig aber möchte hier jetzt nicht direkt dein Angebot schlecht reden Genaue Details wirst du vermutlich lieber dann über PN preisgeben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "April 19, 2023, 01:11:51 PM",
      "body": "Auf KuCoin kannst Du auch ohne Verifizierung handeln,darfst dann halt \"nur\" 1BTC/Tag auszahlen, aber ansonsten gibts da kaum Einschränkungen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "April 20, 2023, 09:30:20 AM",
      "body": "Quote from: tyz on April 19, 2023, 09:20:26 AMich suche jemanden der auf Bittrex oder Kucoin registriert und eventuell auch verifiziert ist? Ich möchte alte Coinbestandteile verkaufen, die nur dort noch gehandelt werden. Ich möchte mich nicht extra registrieren und verifizieren. Das lohnt sich für den einmaligen Verkauf nicht.Ich suche daher jemand vertrauenswürdiges aus der Community. Ich würde die Coins an die Einzahlungsadresse des Exchanges schicken, ihr tauscht sie dann in BTC oder ETH und zahlt mir dann den Großteil davon aus. Der Rest ist euer Verdienst. Ich dachte da an einen Betrag von rund $50-100 für Euch (VB).Ich bin auf KuCoin registriert und kann das gerne für dich übernehmen. Kannst mir einfach eine PN senden und wir besprechen die Details.Aber wie gesagt: Auf KuCoin kannst du auch ohne Verifizierung handeln und bis 1 BTC pro Tag auszahlen. Hierfür benötigst du dann nur eine E-Mail-Adresse, Passwort und 2-Faktor (Google Auth oder Handy-Nr.). Dementsprechend ist das auch kein großer Aufwand. Zusätzlich würde ich bei einer Registrierung einen Referral-Link verwenden, dann bekommst du mWn noch 10% auf die Handelsgebühren zurück. Zumindest war das vor einiger Zeit noch so.Quote from: lassdas on April 19, 2023, 01:11:51 PMAuf KuCoin kannst Du auch ohne Verifizierung handeln,darfst dann halt \"nur\" 1BTC/Tag auszahlen, aber ansonsten gibts da kaum Einschränkungen.Genauso ist es. KuCoin behält sich vor Accounts zu überprüfen, aber das ist ja bei jeder Börse so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "April 20, 2023, 12:51:03 PM",
      "body": "Ist die Auszahlung von Kucoin eine Auszahlung in crypto oder auch in Fiat möglich (IBAN Überweisung)?Hab mich mit Kucoin noch nicht beschäftigt…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}