{
  "id": "topic_5454911",
  "title": "I_Anime",
  "author": "I_Anime",
  "created_time": "June 02, 2023, 11:41:35 PM",
  "content": "Mining difficulty as the name implies shows how difficult it is to mine a block. This usually arise as a result of an increase in the number of miners and may ending adjustment showed an all time high surpassing the 50 trillion mark. This means that mining a block has never been harder but also shows that Bitcoin popularity has really made it far. Why is the increase happening now, is this because of the hypes of ordinals( which I saw have crossed 10 million inscriptions)? Or the increase in transaction fee is enticing for people to consider mining?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454911",
  "comments": [
    {
      "author": "_act_",
      "created_time": "June 02, 2023, 11:59:03 PM",
      "body": "Quote from: I_Anime on June 02, 2023, 11:41:35 PMWhy is the increase happening now, is this because of the hypes of ordinals( which I saw have crossed 10 million inscriptions)? Or the increase in transaction fee is enticing for people to consider mining?Before Ordinals and Inscriptions, bitcoin mining hashrates has been increasing, reaching all-time-high. If the hashrate is increasing, more blocks would be mined easily before 10 minute average, but increasing the mining difficulty helps to keep the blocks mined to be 10 minutes on average.https://www.blockchain.com/explorer/charts/hash-rate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Clark Anderson",
      "created_time": "June 03, 2023, 01:30:39 AM",
      "body": "Quote from: I_Anime on June 02, 2023, 11:41:35 PMMining difficulty as the name implies shows how difficult it is to mine a block. This usually arise as a result of an increase in the number of miners and may ending adjustment showed an all time high surpassing the 50 trillion mark.  The increasing difficulty in mining is as a result of the design and functionality of the Bitcoin network itself. it usually adjusts within 2 weeks or I think every 2016 blocks based on the total computational power or hash rate of the network Quote from: I_Anime on June 02, 2023, 11:41:35 PMOr the increase in transaction fee is enticing for people to consider mining?the transaction fee itself plays a role in bringing miners to include transactions in blocks. As the network is currently experiencing higher transaction volumes,  the fees normally will sprout very high. And this is very profitable to the miners increasing their overall mining activities",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 03, 2023, 02:00:10 AM",
      "body": "because there is a higher return for mining, you get the block return + higher fees + the block is full, which means more transactions, and the cost of bitcoin is low. Finding a new block, everything will change after the network adjusts itself.The fees now seem reasonable compared to the previous weeks, so I believe that the difficulty will decrease with the passage of time, and what happened is a reflection of the past 10-30 days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 03, 2023, 04:24:47 AM",
      "body": "Well there are a few reasons why. The ordinals is one but another reason is that the hardware is more efficient. Since it’s more efficient a mining farm can have a higher hash rate with the same amount of electricity it used. So this is why the hash rate will always keep increasing since we have better chips.The ordinals is important because the fees are higher than average and it’s attractive to mine because not only do you get block reward but also the miners fee. And a couple of weeks ago the miner fee was also as high as the block reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 03, 2023, 05:22:38 AM",
      "body": "Quote from: I_Anime on June 02, 2023, 11:41:35 PMWhy is the increase happening now, is this because of the hypes of ordinalsCause the haahrate is at all time high.minin difficulty fokkws hashrate, id it increases then miners confirm blocks quicker than the 10 mins average and th difficulty is adjusted upwards, if the hashrate drops then it's slower to confirm blocks and the difficulty is adjusted upwards.The major factors that affects hashrates is newer miners and improved equipments. Newer miners do not need a change in transaction fees before getting on board cause the significant lump of their pay cones from the coinbase reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 03, 2023, 05:26:39 AM",
      "body": "Quote from: I_Anime on June 02, 2023, 11:41:35 PMWhy is the increase happening now, is this because of the hypes of ordinals( which I saw have crossed 10 million inscriptions)? Or the increase in transaction fee is enticing for people to consider mining?We have been having an increasing hash rate over time right before ordinals set in, the more the mining difficulty is increasing the lesser the hash rate and so is the lesser the probability of having an increasing ordinals inscriptions because of the drop in the number of blockspace per the average time, though the transaction fee may be adjusted and a little more cheaper than we are having now, before the transaction fee can be that enticing for people to have interest will be when the miners completely depends on the transaction fees for their profits after the entire blocks had been mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 03, 2023, 07:00:59 AM",
      "body": "Quote from: Dunamisx on June 03, 2023, 05:26:39 AMthe more the mining difficulty is increasing the lesser the hash rate and so is the lesser the probability of having an increasing ordinals inscriptions because of the drop in the number of blockspace per the average time,Mining difficulty will only increase if the hashrate increases, and mining difficulty reduces when the hashrate drops, it is the hashrate that automatically determines how the difficulty will be adjusted. Block space doesn't drop, it is the block time that can either be faster or slower, and that's why mining difficulty adjusts to keeps it at ~10 minutes on average. Take note that miners optimize the space in their block, so they will include the tx with a higher fee, it does not matter if it is ordinals tx's or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 03, 2023, 07:43:27 AMLast edit: June 03, 2023, 07:58:22 AM by franky1",
      "body": "the majority of mining in 2022 was alot of mid size asic farms. but the price of bitcoin which meant the blockreward meant only certain farms in certain cheap electric regions could prosper(not many home hobby miners were mining bitcoin profitably. so they pool hopped to pump and dump sha256 based altcoins)this was where when bitcoin was under $20k the growth rate of bitcoins hashrate was slowed down. compared to the % growth of previous yearshowever now the bitcoin price is over $25k more americans/europeans can afford to break even and profit from miningand so mega farms like foundry could afford to invest in more hardware and increase their hashrate. which has happened in the last 3-6 months since bitcoin market moved above the $20k/btc wallyes some hobby miners that gave up on mining bitcoin to pump and dump altcoins. moved back to bitcoin due to recent fee mania. but that did not cause much profiteering because its the mining pools that made the most profit from the fee's.. not the independent asic owners(home hobby miners).however the pool managers that also own mega asic farms (again using foundry as a example) were getting profits from the reward since january. and getting profits from the fees from march+ and so have been investing in extra asics. which can be seen by the extra hashrate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "June 03, 2023, 05:59:41 PM",
      "body": "Quote from: franky1 on June 03, 2023, 07:43:27 AMhowever now the bitcoin price is over $25k more americans/europeans can afford to break even and profit from miningand so mega farms like foundry could afford to invest in more hardware and increase their hashrate. which has happened in the last 3-6 months since bitcoin market moved above the $20k/btc wall Do you mean that Bitcoin has never been more profitable since the cost of mining a block is outweighed by its return's? The post got me curious because when Bitcoin crossed the $60K price it didn't break through the 5 trillion mark so I thought a factor outside net returns was the cause.Quote from: _act_ on June 02, 2023, 11:59:03 PMBefore Ordinals and Inscriptions, bitcoin mining hashrates has been increasing, reaching all-time-high.  Yeah I know the hashrate has been increasing but not this high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 03, 2023, 06:31:04 PM",
      "body": "Quote from: I_Anime on June 03, 2023, 05:59:41 PMQuote from: franky1 on June 03, 2023, 07:43:27 AMhowever now the bitcoin price is over $25k more americans/europeans can afford to break even and profit from miningand so mega farms like foundry could afford to invest in more hardware and increase their hashrate. which has happened in the last 3-6 months since bitcoin market moved above the $20k/btc wall Do you mean that Bitcoin has never been more profitable since the cost of mining a block is outweighed by its return's? The post got me curious because when Bitcoin crossed the $60K price it didn't break through the 5 trillion mark so I thought a factor outside net returns was the cause.there is always a baseline cost for the most efficient miners.. .. this becomes bitcoins market bottomline valueno one wants to sell below because no one on the planet can mine for less. so the market sits above the bottomline valuehowever different countries and regions have different electric prices. above thissome places have to pay a premium for hardware, taxes and stuff where others buy in bulk and get whole sale prices for hardware.. when bitcoin market went below $20k most of america/europe could not afford to hobby mine individually because the residential electric and the retail hardware prices, priced them out of profitable mining. so they mined altcoins instead.however now the market is above $20k a coin more miners can afford to mine bitcoin. as for when the price topped out at $50k.. that was a factor on the premium endback in 2021 the most expensive locations to mine (japan and hawaii) were able to profitable mine bitcoin when it hit $65k+however when everywhere else on the planet was cheaper to mine(profitable) meaning anyone could and would mine. guess what. there was not much point paying premium to buy bitcoin if you could mine it for less. and soo the market topped out at $70k because there were more people willing to sell and all the buyers dried up becasue they ere able to acquire bitcoin cheaper by other methods..if you work out the mining costs of the most efficient mining on the planet. and the most inefficient and expensive on the planet.. you can work out the speculative window that the market will vibrate somewhere inbetweenfor instance in late 2022-jan 2023 it was $16k-$110k window of speculation. if there was a mega market dip it would settle to $16k and go no further down as everyone on the planet wont want to sell below $16k becasue no one can acquire bitcoin for less and no one is stupid to sell at a losssame for the top if everyone can get bitcoin for less than $110k no one will want to pay more then $100k so that was the possible top for 2022-jan23in short.. 2022-early 2023 had no possibility of a $250k btc or a $1m btcin short..  2022-early 2023 had no possibility of a sub $14k btc or a $1k btcthe range of speculation was $15k-$90k mid 2022the range of speculation was $16k-$110k jan 2023that range has moved higher since 3-6 months ago. but still dont expect a possibility of $250k btc at current position of fundementals",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "June 03, 2023, 07:51:33 PM",
      "body": "Quote from: franky1 on June 03, 2023, 06:31:04 PMthere is always a baseline cost for the most efficient miners.. .. this becomes bitcoins market bottomline valueno one wants to sell below because no one on the planet can mine for less. so the market sits above the bottomline valuehowever different countries and regions have different electric prices. above thissome places have to pay a premium for hardware, taxes and stuff where others buy in bulk and get whole sale prices for hardwareas for when the price topped out at $50k.. that was a factor on the premium endback in 2021 the most expensive locations to mine (japan and hawaii) were able to profitable mine bitcoin when it hit $65k+however when everywhere else on the planet was cheaper to mine(profitable) meaning anyone could and would mine. guess what. there was not much point paying premium to buy bitcoin if you could mine it for less. and soo the market topped out at $70k because there were more people willing to sell and all the buyers dried up becasue they ere able to acquire bitcoiif you work out the mining costs of the most efficient mining on the planet. and the most inefficient and expensive on the planet.. you can work out the speculative window that the market will vibrate somewhere inbetweenThank you very much. Never knew about this so the least efficient set the base price to sell Bitcoin based on the cost they incur to prevent a loss. Always hearing haters saying Bitcoin is going to $12K or $10K is nerve wrecking. Why haven't I thought of this nobody wants to make a loss so anything that makes the market to sell around $12K would be something that even affected the confidence of the base setter.As long as Bitcoin can be mined with lower cost I.e cheaper energy(electricity) and better hardware's, attractive profit, Miners will flock the blockchain thus increasing hashrate which in turn to make a block  mined be around 10 minutes, mining difficulty would increase correspondingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "June 03, 2023, 08:56:29 PM",
      "body": "Quote from: _act_ on June 02, 2023, 11:59:03 PMQuote from: I_Anime on June 02, 2023, 11:41:35 PMWhy is the increase happening now, is this because of the hypes of ordinals( which I saw have crossed 10 million inscriptions)? Or the increase in transaction fee is enticing for people to consider mining?Before Ordinals and Inscriptions, bitcoin mining hashrates has been increasing, reaching all-time-high. If the hashrate is increasing, more blocks would be mined easily before 10 minute average, but increasing the mining difficulty helps to keep the blocks mined to be 10 minutes on average.https://www.blockchain.com/explorer/charts/hash-rate So what does this have to do with Ordinals and Inscriptions? Are they the reason why less bitcoins are being mined, are they congesting the network that much? I need answers!! Anyhow, I don't think the increase in mining difficulty is detrimental to the whole industry. as you said increasing the mining difficulty keeps the blocks from being mined much faster, which I would think depletes the whole supply of bitcoin a little faster which in turn is bad for the industry in the long run. So with that being said it kind of helps the industry stay afloat and topical, and these miner manufacturers to be more efficient and powerful with their rigs and miners to be released in the future. I've heard that it's gonna take at least 120 years to mine the remaining 2 million bitcoins, does this chip off of that 120-year furlough or are we still within predictions? I'm really curious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 03, 2023, 09:10:18 PM",
      "body": "There are different factor why there is an increased in number of mners making the difficulty increase.  It is possible because of the incoming halving, making people to take advantage of mining a year before the reward is reduced to half.  We can also consider the Ordinal Inscription because of the increase in the number and price of transaction fees making some operators to put more hashes in order to have an edge in finding a block.Quote from: panganib999 on June 03, 2023, 08:56:29 PMAnyhow, I don't think the increase in mining difficulty is detrimental to the whole industry. as you said increasing the mining difficulty keeps the blocks from being mined much faster, which I would think depletes the whole supply of bitcoin a little faster which in turn is bad for the industry in the long run. So with that being said it kind of helps the industry stay afloat and topical, and these miner manufacturers to be more efficient and powerful with their rigs and miners to be released in the future. The increase in mining difficulty means there are more hashes pointed on the blockchain it also means that the network is getting more secure. Block creation as far as I know is programmed at least every 10 minutes I do not think more miners will ever increase the mining rate of the network making mining Bitcoin much faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "June 03, 2023, 09:11:35 PM",
      "body": "Quote from: panganib999 on June 03, 2023, 08:56:29 PMQuote from: _act_ on June 02, 2023, 11:59:03 PMQuote from: I_Anime on June 02, 2023, 11:41:35 PMWhy is the increase happening now, is this because of the hypes of ordinals( which I saw have crossed 10 million inscriptions)? Or the increase in transaction fee is enticing for people to consider mining?Before Ordinals and Inscriptions, bitcoin mining hashrates has been increasing, reaching all-time-high. If the hashrate is increasing, more blocks would be mined easily before 10 minute average, but increasing the mining difficulty helps to keep the blocks mined to be 10 minutes on average.https://www.blockchain.com/explorer/charts/hash-rate So what does this have to do with Ordinals and Inscriptions? Are they the reason why less bitcoins are being mined, are they congesting the network that much? I need answers!! Less Bitcoin's aren't being mined, just the difficulty is increasing in line with the increasing hashrate. The only relevance is slightly faster block times temporarily until the difficulty changes, potentially a halving sooner than later. As franky referenced in this thread already, this is more related to Bitcoin's price (up 100% recently) to around $25K to $30K as opposed to anything to do with ordinals or inscriptions. I don't think miners really consider the additional fee reward from a block, as it's inconsistent and can change at anytime, ie return to very low fee rewards. Whereas the block reward itself remains consistent. Quote from: panganib999 on June 03, 2023, 08:56:29 PMAnyhow, I don't think the increase in mining difficulty is detrimental to the whole industry. as you said increasing the mining difficulty keeps the blocks from being mined much faster, which I would think depletes the whole supply of bitcoin a little faster which in turn is bad for the industry in the long run. So with that being said it kind of helps the industry stay afloat and topical, and these miner manufacturers to be more efficient and powerful with their rigs and miners to be released in the future. Increased difficulty doesn't increase block times, it actually decreases them back towards 10 minutes. It's the increased hash rate that reduces block times, but not dramatically either. Roughly a 10% increase in hash rate prior to the bi-weekly difficulty change would equate to a 9 minute block. The difficulty changes are designed to \"balance out\" Bitcoin's distribution of new supply back to 10 min blocks, not change it.Overall increased hash rate is good for increased security of the network. Difficulty increase is merely a by-product of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 03, 2023, 09:22:33 PM",
      "body": "Quote from: panganib999 on June 03, 2023, 08:56:29 PMSo what does this have to do with Ordinals and Inscriptions? Are they the reason why less bitcoins are being mined, are they congesting the network that much? I need answers!! Anyhow, I don't think the increase in mining difficulty is detrimental to the whole industry. as you said increasing the mining difficulty keeps the blocks from being mined much faster, which I would think depletes the whole supply of bitcoin a little faster which in turn is bad for the industry in the long run. So with that being said it kind of helps the industry stay afloat and topical, and these miner manufacturers to be more efficient and powerful with their rigs and miners to be released in the future. I've heard that it's gonna take at least 120 years to mine the remaining 2 million bitcoins, does this chip off of that 120-year furlough or are we still within predictions? I'm really curious. My little explanation is yes the ordinals actual did congested the mempool and that was what brought about the high transaction fee last month. The bitcoin mining will definitely ends at 2140 not that it was predicted but because that is the network was actually designed. The difficulty that was tried to be explained by _act_ is what keeps the network in check. The difficulty is usually calculated or just say adjusted every two weeks. The average minutes it takes to get a block mined is 10 minutes and if during this week the average is above or below that the network adjust to still keep it at 10 minutes. So just like you asked as technology advances over the year, there will be more sophisticated mining tools that could generate more hashrate to get blocks mined faster than they are today but still difficult will continue to increase just to make average mining period of a block stay at 10 minutes. So it was through this 10 minutes a block with 2016 mined every two weeks that it was calculated take till 2140 before mining stops. The other thing again is the number of bitcoin from a block is halved after every four years (6.25 is the current bitcoin per block) and it is this 2140 that it will equates to 0.00",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "June 03, 2023, 10:15:45 PM",
      "body": "Quote from: I_Anime on June 02, 2023, 11:41:35 PMMining difficulty as the name implies shows how difficult it is to mine a block. This usually arise as a result of an increase in the number of miners and may ending adjustment showed an all time high surpassing the 50 trillion mark. This means that mining a block has never been harder but also shows that Bitcoin popularity has really made it far. Why is the increase happening now, is this because of the hypes of ordinals( which I saw have crossed 10 million inscriptions)? Or the increase in transaction fee is enticing for people to consider mining?As long as the miners is still making money, then regardless of how it will be difficult they are going to continue, with or without the hype on the ordinals.Here are some stats to look at, QuoteLatest Stats    Bitcoin Average Mining Costs    2023-06-02    26,757    32,770    Bitcoin/USD    2023-06-03    27,003    27,250https://en.macromicro.me/charts/29435/bitcoin-production-total-costMiners could have just been in the break even numbers though, as far as mining cost vs the price of bitcoin right now. So sooner or later they might have to dump some to cover the cost of their operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "June 06, 2023, 03:55:19 PM",
      "body": "Quote from: adaseb on June 03, 2023, 04:24:47 AMWell there are a few reasons why. The ordinals is one but another reason is that the hardware is more efficient. Since it’s more efficient a mining farm can have a higher hash rate with the same amount of electricity it used. So this is why the hash rate will always keep increasing since we have better chips.The ordinals is important because the fees are higher than average and it’s attractive to mine because not only do you get block reward but also the miners fee. And a couple of weeks ago the miner fee was also as high as the block reward. Shower thought. Miners are speculators too. How possible is it that miners will mine at a loss now, (assuming that they have enough cash to pay for their bills for the next few months), then just store the coins as \"inventory\", then sell them at a much better price later? It also probably presents an answer for the \"price follows hashing power vs. hashing power follows price\" debate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 06, 2023, 04:47:31 PMLast edit: June 06, 2023, 05:04:49 PM by franky1",
      "body": "Quote from: Wind_FURY on June 06, 2023, 03:55:19 PMShower thought. Miners are speculators too. How possible is it that miners will mine at a loss now, (assuming that they have enough cash to pay for their bills for the next few months), then just store the coins as \"inventory\", then sell them at a much better price later? It also probably presents an answer for the \"price follows hashing power vs. hashing power follows price\" debate.most established asic farms factor in a 2 year investment periodthey pre-buy electric contracts in 6-24 month contracts at a discounted rate of electric cost. and they buy hardware upfront. thus they mine continuously for that 2 year lifecycle of hardware no matter what.because not mining loses them time of their ROI of hardware.. and also they dont gain anything by switching off.. they actually lose by not using their allotted electric for that period(lose it if you dont use it)its only at the end of the 2 years do they then assess their rewards total against their initial cost to set their cost per coin amount to then set their minimum sell amount.... this is the reason why the \"ATH\" occurs 1 year after a halving and not at the precise day of a halving.. because they do not work on a day-to-day assessment of cost.however hobby miners just pool jump between bitcoin and altcoins depending on which is currently in a pump mania/ath",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}