{
  "id": "topic_5405525",
  "title": "LagerLV",
  "author": "LagerLV",
  "created_time": "July 07, 2022, 05:17:38 PM",
  "content": "Hey.I've been a customer of Nitrogensports for some time and overall been satisfied with them, but in March of this year i received a ban from the website for supposedly \"use of bots and overall betting behavior in your account\", whatever that even means. https://i.ibb.co/B6ZXNYK/1.pngWhat i assume caused them to ban my account was betting multiple bets of the same kind on the same outcome, which to my knowledge and going through the TOS isn't against the site rules.Okay, so they banned my account and reset my balance to 0, but then over the time i've accumulated some money through my affiliate earnings which they refuse to pay me out as well. https://i.ibb.co/zb4yrky/2.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405525",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 07, 2022, 05:22:46 PM",
      "body": "Quote from: LagerLV on July 07, 2022, 05:17:38 PMOkay, so they banned my account and reset my balance to 0, but then over the time i've accumulated some money through my affiliate earnings which they refuse to pay me out as well. You can have problem with any casino anytime. Nitrogen sports should have a story from their side too. We would like to hear it. Have you deposited any money with them? If you do then please feel free to post any transaction ID. I have seen in many cases casino offers to return the deposit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LagerLV",
      "created_time": "July 07, 2022, 05:58:56 PM",
      "body": "Yeah, the story from their side is that they were not okay with me placing multiple bets of the same kind on the same outcome https://i.ibb.co/7R6hC0C/3.pngAnd i have deposited there, a lot, over 50+ transaction for sure, but they migrated to Nitrobetting yesterday and now you are unable to see the deposits and withdraws on Nitrogensports.I am okay with them banning my account and zeroing the balance, but i've accumulated a fair share of money only from affiliates and i am not able to withdraw those.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "July 07, 2022, 06:00:09 PM",
      "body": "What were you doing all these months since March and suddenly now complaining about the casino?If you have been banned, there's a reason for that. Since you have been banned, you are unlikely to get an affiliate commission. You have been banned from their site, of course, no ban in any casino means a partial ban. It's a fool to expect to get an affiliate commission. You are no more eligible for that since you are banned.However, as said above, if you have made an initial deposit, you may get the deposit back but for that you have clarify everything and of course, we need the nitrobetting part of the story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 08, 2022, 09:49:32 AM",
      "body": "Quote from: Little Mouse on July 07, 2022, 06:00:09 PMWhat were you doing all these months since March and suddenly now complaining about the casino?If you have been banned, there's a reason for that. Since you have been banned, you are unlikely to get an affiliate commission. You have been banned from their site, of course, no ban in any casino means a partial ban. It's a fool to expect to get an affiliate commission. You are no more eligible for that since you are banned.However, as said above, if you have made an initial deposit, you may get the deposit back but for that you have clarify everything and of course, we need the nitrobetting part of the story.Probably he just find out he got affiliate commission.  If you read again you might get your answer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 09, 2022, 09:59:29 PM",
      "body": "Dispute the ban if you think you were unfairly banned and not against any terms and conditions, otherwise, Nitrogensports have had negative feedbacks in the past due to the way they conduct business. You are partly to blame for ignoring the warnings.If they banned your account, then I am pretty sure it's a way of saying “Our business with you is official done” The affiliate earnings don't matter after the ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 10, 2022, 08:34:42 AM",
      "body": "Quote from: LagerLV on July 07, 2022, 05:58:56 PMYeah, the story from their side is that they were not okay with me placing multiple bets of the same kind on the same outcome If they warned you at least once already (in January, according to your screenshot), why did you continue to use your \"method\" of placing multiple bets on the same outcome? It seems to me that they actually gave you a second chance, but you chose to ignore it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 10, 2022, 03:44:26 PM",
      "body": "Quote from: LagerLV on July 07, 2022, 05:17:38 PMbut in March of this year i received a ban from the website for supposedly \"use of bots and overall betting behavior in your account\", whatever that even means.If you are an active user on this forum, please tell your friends who are involved in gambling, avoid betting on sports betting sites: Nitrogensports, it's to avoid your friends and you in loss, when you win sports bets.We have been very anticipating and avoided betting on the Nitrogensports site, there have been a series of cases that they have done against their users.As examples and future memories.• Nitrogen sports biggest scam and spoiled my life.• New Way to Scam through Nitrogen Sports [DT Attention Required]• Nitrogensports.eu rediculous behaviour.For that, no matter how great people bet in gambling, if the bettor himself does not consider, does not look at the reputation of the site and does not research properly, without careful calculation, you immediately register and make a deposit to a site that is prone to fraud, it's useless, he remains entangled in the fraud case, for that searching, asking, investigating gambling sites before doing anything, it's a good move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 12, 2022, 11:13:04 AM",
      "body": "Any update for this case?Quote from: LagerLV on July 07, 2022, 05:58:56 PMYeah, the story from their side is that they were not okay with me placing multiple bets of the same kind on the same outcome QuoteWe really appreciate you time to explain how you are placing so many bets in so shot time, our system trigger an alert on this cases due to the behavior on your account, and for this reason was blocked, we cant stop our system to do so because it settings are made to find strange behaviors on the accounts.Clearly they warned you back in the January but still you decided to continue with them.Quote from: LagerLV on July 07, 2022, 05:58:56 PMI am okay with them banning my account and zeroing the balance, but i've accumulated a fair share of money only from affiliates and i am not able to withdraw those.It's a problem. According to their terms and conditions if this does not violate the terms of affiliate then you should continuing to get the affiliate commissions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}