{
  "id": "topic_5472578",
  "title": "HedgeFx",
  "author": "HedgeFx",
  "created_time": "November 02, 2023, 01:35:01 PM",
  "content": "Buoansera,Ho appena aperto un conto FINECO . Mi sapete dire se fanno rogne in caso di pagamenti (bonifico istantaneo o sepa) verso e da Coinbase / Kraken?Grazie",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472578",
  "comments": [
    {
      "author": "Ale88",
      "created_time": "November 02, 2023, 04:24:04 PM",
      "body": "Non ti saprei dire, l'unico consiglio che mi sento di darti in ogni caso è di verificare direttamente con la tua filiale dato che alcune banche sono assolutamente contro l'invio o la ricezione di soldi che hanno a che fare con gli exchange. Anche perché magari dipende pure dal cliente, se ti conoscono può essere più facile rispetto a qualcuno che ha appena aperto il conto.Parlando con loro almeno eviti l'eventuale perdita di tempo che ti provocherebbe il blocco dei bonifici.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "November 02, 2023, 09:16:14 PM",
      "body": "Quote from: Ale88 on November 02, 2023, 04:24:04 PMNon ti saprei dire, l'unico consiglio che mi sento di darti in ogni caso è di verificare direttamente con la tua filiale .....Fineco ha pochissime filiali, se non abiti in una grande città è improbabile averne una vicina.In compenso ha un ottimo supporto tecnico per cui suggerirei di chiedere via mail.Io usavo TRT (solo in uscita) e con loro non facevano storie, però parlo di 3 anni fa e il destinatario era ovviamente italiano (quindi più conosciuto a loro).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "November 03, 2023, 10:48:27 AM",
      "body": "anche io usavo fineco con trt e mai avuto problemiho fineco perche mi faceva risparmiare sul conto, ma adesso e' uguale agli altripotrei / dovrei cambiarlo ma al momento mi scoccia parecchio farlodirei una banca nella media, senza troppi pro e contronon so se con coinbase romponocon kraken no",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "November 05, 2023, 10:00:37 PM",
      "body": "Quote from: babo on November 03, 2023, 10:48:27 AManche io usavo fineco con trt e mai avuto problemiho fineco perche mi faceva risparmiare sul conto, ma adesso e' uguale agli altripotrei / dovrei cambiarlo ma al momento mi scoccia parecchio farlodirei una banca nella media, senza troppi pro e contronon so se con coinbase romponocon kraken noNon ho mai avuto Fineco, quindi mi dispiace non voglio darti indicazioni basate su sentito dire. Certo è che potevi chiedere prima di aprire il conto, non dopo In caso, ho sentito parlare bene anche di Revolut. Loro non dovrebbero fare proprio storie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "November 06, 2023, 03:29:43 AM",
      "body": "Quote from: fillippone on November 05, 2023, 10:00:37 PM... Revolut. Loro non dovrebbero fare proprio storie. ho sempre letto pessime opinioni su revolut (tra l'altro un articolo scritto da un utente del forum ziomiki che adessso non è più accessibile...) scam, frodi, conti bloccati, no non rischierei almeno come conto \"principale\".Fineco lo usano tutti in \"famiglia\". è ottimo per il trading (ed in passato aveva offerta su mutui e prestiti davvero concorrenziali).Non so per cosa ti serve questo conto bancario ma valuterei Hype! I loro due prodotti premium sono niente male e hanno praticamente tutte le funzioni accessibili da telefono...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "November 06, 2023, 09:07:03 AM",
      "body": "Quote from: bitbollo on November 06, 2023, 03:29:43 AMQuote from: fillippone on November 05, 2023, 10:00:37 PM... Revolut. Loro non dovrebbero fare proprio storie. ho sempre letto pessime opinioni su revolut (tra l'altro un articolo scritto da un utente del forum ziomiki che adessso non è più accessibile...) scam, frodi, conti bloccati, no non rischierei almeno come conto \"principale\".Fineco lo usano tutti in \"famiglia\". è ottimo per il trading (ed in passato aveva offerta su mutui e prestiti davvero concorrenziali).Non so per cosa ti serve questo conto bancario ma valuterei Hype! I loro due prodotti premium sono niente male e hanno praticamente tutte le funzioni accessibili da telefono...guarda io li ho entrambisia fineco che revolut, per revolut ho dentro un insider (ex collega) quindi ho avuto in beta testing molte featurenon so se per questo motivo o per altri motivi, io non posso lamentarmi, sono super soddisfatto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "November 06, 2023, 12:30:51 PM",
      "body": "Quote from: babo on November 06, 2023, 09:07:03 AMQuote from: bitbollo on November 06, 2023, 03:29:43 AMQuote from: fillippone on November 05, 2023, 10:00:37 PM... Revolut. Loro non dovrebbero fare proprio storie. ho sempre letto pessime opinioni su revolut (tra l'altro un articolo scritto da un utente del forum ziomiki che adessso non è più accessibile...) scam, frodi, conti bloccati, no non rischierei almeno come conto \"principale\".Fineco lo usano tutti in \"famiglia\". è ottimo per il trading (ed in passato aveva offerta su mutui e prestiti davvero concorrenziali).Non so per cosa ti serve questo conto bancario ma valuterei Hype! I loro due prodotti premium sono niente male e hanno praticamente tutte le funzioni accessibili da telefono...guarda io li ho entrambisia fineco che revolut, per revolut ho dentro un insider (ex collega) quindi ho avuto in beta testing molte featurenon so se per questo motivo o per altri motivi, io non posso lamentarmi, sono super soddisfatto Revolut inoltre vende i propri servizi in Europa, mentre Fineco è localizzata in Italia. Mi fa sempre piacere, quando devo usare una banca o un fornitore di servizi finanziari, sapere che è grande, autorizzato in diversi mercati e fa a schiaffi al livello globale, piuttosto che rivolgermi ad un player locale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}