{
  "id": "topic_5465794",
  "title": "Little Mouse",
  "author": "Little Mouse",
  "created_time": "September 05, 2023, 09:20:54 PM",
  "content": "I was checking out the mempool space as I saw topic mentioning that mempool is congested. I have found that there are transactions which has been tagged as Full RBF while someone other txs have been tagged as only RBF.I can't remember if I have ever seen Full RBF option. As far as I'm concerned, I haven't seen this. I'm only aware about \"RBF\". What's the difference between these two?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465794",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "September 05, 2023, 09:32:31 PM",
      "body": "There is no such thing as flagging a transaction as full RBF.Full RBF is a setting for nodes. If a node has enabled full RBF, it allows any unconfirmed transaction to be replaced by a new one paying higher fee, even if the original transaction has not been flagged as RBF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "September 05, 2023, 09:38:48 PM",
      "body": "The only tagged in RBF are simply the opt-in full RBF where the transaction initiator add signals that transaction will be changed in future. This way the nodes may allow it to be changed in future and also it wouldn’t be treated as a complete payment by the recipient. This is Called BIP125 replaceability . The full RBF doesn’t needs to add a signal to the transaction and could change the transaction anytime",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "September 06, 2023, 04:17:58 AM",
      "body": "Quote from: hosseinimr93 on September 05, 2023, 09:32:31 PMThere is no such thing as flagging a transaction as full RBF.Full RBF is a setting for nodes. If a node has enabled full RBF, it allows any unconfirmed transaction to be replaced by a new one paying higher fee, even if the original transaction has not been flagged as RBF. Well, I haven't noticed this term earlier in mempool space. Just noticed it yesterday and I tried to figure out what it exactly is but I failed to get the context. It seems to be a term used by mempool. Is it the same one as of Full RBF setting for the node? Can you see the last tx? What it's referring?Quote from: Zaguru12 on September 05, 2023, 09:38:48 PMThe only tagged in RBF are simply the opt-in full RBF where the transaction initiator add signals that transaction will be changed in future.  Thanks and I'm familiar with the RBF term. Check out the image attached above. That's where I'm confused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 06, 2023, 04:37:55 AM",
      "body": "Quote from: Little Mouse on September 06, 2023, 04:17:58 AMCan you see the last tx? What it's referring?It means that the transaction has replaced a transaction which hadn't been flagged as RBF. The other transactions that are shown in the image have replaced transactions that had been flagged as RBF. As I said in my previous post, nodes may allow a transaction to replace another one, even if the original transaction has not been flagged as RBF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 06, 2023, 06:02:29 AM",
      "body": "Here's a thread I opened a while back discussing Full RBF: https://bitcointalk.org/index.php?topic=5403730.0Here's the post on the mempool.space GitHub discussing this new RBF ticker: https://github.com/mempool/mempool/pull/3867. It was merged around 2 months ago.Quote from: Little Mouse on September 06, 2023, 04:17:58 AMIt seems to be a term used by mempool. Is it the same one as of Full RBF setting for the node?The term is used across the Bitcoin ecosystem, not just by mempool.space. It is a setting nodes can apply which means they will accept and broadcast replacement transactions for any transaction in their mempool, regardless of whether the original transaction is opted in to RBF or not.Quote from: Little Mouse on September 06, 2023, 04:17:58 AMThanks and I'm familiar with the RBF term. Check out the image attached above. That's where I'm confused.Here's an example transaction: https://mempool.space/tx/5bbea8b183b7e67cd75d54604dd19e0724b89e2b8675133f0feec360f0fd497eMouse over the first transaction in the \"RBF History\" box, paying 9.24 sats/vbytes. You'll see it was not opted in to RBF. And yet it has been successfully replaced anyway by a new transaction paying 10.2 sats/vbyte. This is what is meant by full RBF. Any node with full RBF enabled will accept replacements for any transaction in their mempool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}