{
  "id": "topic_5406836",
  "title": "gantez",
  "author": "gantez",
  "created_time": "July 19, 2022, 11:31:04 AM",
  "content": "To invest is good but investment in proper sector is important to avoid you headache and to waste yo time and money. You have do your proper investigate that the investment is clear from problem. This season I see investment is going alot in land and buying property and this kind of problem is more in investing in lands. Land investment involve alot of money to not do a better investigation can cause that you can lose more of your income to the problem if you buy from a wrong person that sell another person land to you in pretending to own the land. If this happen you have problem to acquire the land properly and if you have made payment the money will not be given to you again which is you will end up to the court and the court is expensive to take care of on the matter to pay your lawyer. It is better to take the whole time to investigate before you pay for the land. Requirements To investigate of the land you want to pay isYou go to the land authority of the government to know about the status of the land.You find the real ownership of the land from the area people or community.You know the family head to the land",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406836",
  "comments": [
    {
      "author": "Rruchi man",
      "created_time": "July 20, 2022, 10:29:01 AM",
      "body": "Quote from: gantez on July 19, 2022, 11:31:04 AMRequirements To investigate of the land you want to pay isYou go to the land authority of the government to know about the status of the land.You find the real ownership of the land from the area people or community.You know the family head to the landThis can be summarized as you doing your research properly before paying for a Land or best if you are unexperienced in the field, you can go through proper channels like trusted real estate agents or companies. Do not be afraid or too stingy not wanting to pay a little extra charge for the services of these companies/individuals, It cost way lesser to settle these companies/individuals than to deal with the case of buying a land under dispute. Land issues should also be treated very delicately and be avoided at all cost, Most times in my locale, it can lead to unnecessary loss of lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 20, 2022, 11:33:45 AM",
      "body": "The rule of thumb in buying as least land that you can cultivate for usual, is to buy it from your relatives. AT least that's how I got my current land used for planting many including rice and other vegetables. For real state, go for reputable broker or do your own research if you are doing like 1:1 buying with the \"owners\". Check everything in the authorities if the land is legitimate or not or who is the real owner as land registrations can also be fake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "July 20, 2022, 01:48:50 PM",
      "body": "That’s easy logic and anything that is associated with real estate or even if you buy small stuff which is gonna be second or third hand you need to investigate. Even with car you never know what kind of history is attached with it. It could be from accident prone to criminal activity related or hit and run etc etc. In similar ways a land could be in litigation for various reasons such as loan defaulting which might have taken with land being collateral or it could have secondary title verification and owner is another. It has to be well studied before signing up agreement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "July 20, 2022, 02:48:13 PM",
      "body": "Even if you do your research properly, then there are cases that you won't be able to get full information, let me tell what has happened to my family. My aunty forcefully for signatures done for the land back when I was a baby and we haven't taken the land back even after 24 years because we do know that the court cases are not easy and thus it would ruin the family as well. Other than that, when my grandfather died, the biggest son took over the property, apparently it's not allowed by law to forcefully push the person out and it can be only done using court proceedings therefore the case has been in the court for over 6 years and the property haven't been distributed in the kids as well. If it's property, then there are so many ups and downs as well in court which means that, at the end of the day you would ultimately be running around in some cases, invest in Bitcoins, trade there and then look for other options if you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 20, 2022, 02:54:10 PM",
      "body": "You can check all this issue on registry of deeds of your country since all history happened to that specific property that you are planning to buy is listed there. And also you can easily know if the land is in dispute if you will ask the history of the property on the municipal office because there will be an ongoing case file against if there’s a one. I usually love purchasing lot without title and only tax declaration because it was cheap and I can easily put a title on it because I have a geodetic engineer friend that usually do the paper work. This is different with land with dispute but buying a tax dec lot or lot with some compromise is very profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "July 20, 2022, 04:25:10 PM",
      "body": "Whenever you're buying a land or property its always recommended to consult with a legal advisor about the clearity of everything related to the property and this is in practice for very long time if I am not wrong. I know specifically legal advisor are there for only consulting regarding this and if you're a big investor then you have them on your own so its actually a mandatory thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pesona1",
      "created_time": "July 20, 2022, 04:37:40 PM",
      "body": "Quote from: gantez on July 19, 2022, 11:31:04 AMTo invest is good but investment in proper sector is important to avoid you headache and to waste yo time and money. You have do your proper investigate that the investment is clear from problem. This season I see investment is going alot in land and buying property and this kind of problem is more in investing in lands. Land investment involve alot of money to not do a better investigation can cause that you can lose more of your income to the problem if you buy from a wrong person that sell another person land to you in pretending to own the land. If this happen you have problem to acquire the land properly and if you have made payment the money will not be given to you again which is you will end up to the court and the court is expensive to take care of on the matter to pay your lawyer. It is better to take the whole time to investigate before you pay for the land. Requirements To investigate of the land you want to pay isYou go to the land authority of the government to know about the status of the land.You find the real ownership of the land from the area people or community.You know the family head to the landSome of my friends have experienced as you said when they bought land at a low price, the desire to get land quickly and at a low price made them deceived by land brokers, they did not realize that the land they bought was actually still under bank collateral and in the end they have to spend more money to deal with the bank, I think it might be better to check the validity of the land certificate carefully before we buy and it's better to ask the party or the competent authority location of the land before deciding to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 20, 2022, 05:09:24 PM",
      "body": "Op is right that it's important to investigate what to invest and in which sector. Property can be a good investment if it's literally property (not securities, bonds, debt related to property). And you know what can save money and nerves on how to acquire land properly? Investing in cryptos! You can investigate the market online, buy the coins yourself, sell them yourself. It involves risks, sure, but you can monitor the news and the price online, and you don't need to deal with as many factors as you need if you are investing in land.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "countryfree",
      "created_time": "July 20, 2022, 06:37:24 PM",
      "body": "Quote from: gantez on July 19, 2022, 11:31:04 AMTo invest is good but investment in proper sector is important to avoid you headache and to waste yo time and money. You have do your proper investigate that the investment is clear from problem. This season I see investment is going alot in land and buying property and this kind of problem is more in investing in lands. Land investment involve alot of money to not do a better investigation can cause that you can lose more of your income to the problem if you buy from a wrong person that sell another person land to you in pretending to own the land. If this happen you have problem to acquire the land properly and if you have made payment the money will not be given to you again which is you will end up to the court and the court is expensive to take care of on the matter to pay your lawyer. It is better to take the whole time to investigate before you pay for the land. Requirements To investigate of the land you want to pay isYou go to the land authority of the government to know about the status of the land.You find the real ownership of the land from the area people or community.You know the family head to the landI've sold BTC last year to buy land, and I'm very happy with it. I suggest you improve your English if you want to get into investment consulting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harapan",
      "created_time": "July 20, 2022, 07:00:04 PM",
      "body": "Good points Op it is a good decision to make proper and wise planing ahead of whatever you want to invest in should not be narrowed down investment in lands and housing property. Also people have lost to some liars claiming to be owners of the  land and property. Calculate whenever you plan on making a risky move the roads are not safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "July 20, 2022, 07:52:23 PM",
      "body": "Quote from: Findingnemo on July 20, 2022, 04:25:10 PMWhenever you're buying a land or property its always recommended to consult with a legal advisor about the clearity of everything related to the property and this is in practice for very long time if I am not wrong. I know specifically legal advisor are there for only consulting regarding this and if you're a big investor then you have them on your own so its actually a mandatory thing.This is the correct way to go about it, many people often think that they can buy real estate without any kind of advisor but that is a huge mistake, when it comes to real estate there are a lot of regulations and is very common for a property to have all kind of unsettled issues which makes buying it a huge mistake.For example it could have a lot of taxes which have yet to be paid the government, the person trying to sell the property could be the owner of the property but he doesn't have the legal papers that say so, the person right in front of you may try to scam you can sell your property that is not his and so on and so on, as such legal advice will always be needed when buying real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "July 21, 2022, 01:01:55 PM",
      "body": "I honestly can’t comprehend why someone would have an interest to purchase a land that’s on dispute. It doesn’t make any sense and I think the post is inessential. Most people are diligent in their quest to purchase a property like land. I admit there must be fraudulent individuals and mushroom organizations that would seek to defraud people, and that is where due diligence from your part comes in. And if it’s too difficult to research things for yourself, get a third party like a lawyer to act on your behalf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "July 21, 2022, 07:04:10 PM",
      "body": "Quote from: Iroh on July 21, 2022, 01:01:55 PMI honestly can’t comprehend why someone would have an interest to purchase a land that’s on dispute. It doesn’t make any sense and I think the post is inessential. Most people are diligent in their quest to purchase a property like land. I admit there must be fraudulent individuals and mushroom organizations that would seek to defraud people, and that is where due diligence from your part comes in. And if it’s too difficult to research things for yourself, get a third party like a lawyer to act on your behalf This has been happening in land properties in our country. There are really greedy people who would purchase a land property regardless of its land issues as long as it's being sold at a low price. Both parties would end up fighting and suffering for their land rights. We must consult a legal expert's advice to avoid land issues and conflicts so our hard-earned money will never be wasted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "July 21, 2022, 08:06:51 PM",
      "body": "Quote from: virasisog on July 21, 2022, 07:04:10 PMThis has been happening in land properties in our country. There are really greedy people who would purchase a land property regardless of its land issues as long as it's being sold at a low price. Both parties would end up fighting and suffering for their land rights. We must consult a legal expert's advice to avoid land issues and conflicts so our hard-earned money will never be wasted. Greed is a big factor on what makes scams like this successful If people are so blinded by greed to knowingly purchase a land in dispute cause it was offered at a ridiculously low price and end up losing both money and land, I wouldn’t have a shred of sympathy for such an individual. I agree with you on the need to get a legal aid if going through the process of getting the land is overwhelming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "July 21, 2022, 10:59:25 PM",
      "body": "Quote from: virasisog on July 21, 2022, 07:04:10 PMQuote from: Iroh on July 21, 2022, 01:01:55 PMI honestly can’t comprehend why someone would have an interest to purchase a land that’s on dispute. It doesn’t make any sense and I think the post is inessential. Most people are diligent in their quest to purchase a property like land. I admit there must be fraudulent individuals and mushroom organizations that would seek to defraud people, and that is where due diligence from your part comes in. And if it’s too difficult to research things for yourself, get a third party like a lawyer to act on your behalf This has been happening in land properties in our country. There are really greedy people who would purchase a land property regardless of its land issues as long as it's being sold at a low price. Both parties would end up fighting and suffering for their land rights. We must consult a legal expert's advice to avoid land issues and conflicts so our hard-earned money will never be wasted. It is not the greed. Most of the time this kind of problem arises around the region of the cities. People move towards urban region in search for employment. After years of living in rented houses people look for an own property. Urban regions will be expensive, and when someone is providing it at a lesser price you and me too will buy it. This is not greed, but the mind that goes in search of fulfilling a dream that gets fooled at last.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "July 23, 2022, 11:47:27 AM",
      "body": "Quote from: Iroh on July 21, 2022, 01:01:55 PMI honestly can’t comprehend why someone would have an interest to purchase a land that’s on dispute. It doesn’t make any sense and I think the post is inessential. Most people are diligent in their quest to purchase a property like land. I admit there must be fraudulent individuals and mushroom organizations that would seek to defraud people, and that is where due diligence from your part comes in. And if it’s too difficult to research things for yourself, get a third party like a lawyer to act on your behalf This is happening. It can look like it is not possible to get scam from land purchasing but the reality people still fall to it that someone will sell a title of land that he does not have it. The good thing is to go for the land office of the government and be sure the land title transfering to you is genuine and not challenged and this way you can be free from court cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}