{
  "id": "topic_5476269",
  "title": "olhacker78",
  "author": "olhacker78",
  "created_time": "December 02, 2023, 05:19:20 AM",
  "content": "i have two electrum standard wallets with a small btc balance in each. Can i create a 2of2 multi-sig wallet using the seed phrases from these two existing standard wallets? and then continue using the standard wallets individually?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476269",
  "comments": [
    {
      "author": "nc50lc",
      "created_time": "December 02, 2023, 07:54:03 AM",
      "body": "Yes, it's possible with standard wallet but not with 2FA wallet seed phrase.The seed phrases created in Electrum MultiSig wallet are the same as the standard ones.However, you cannot sign transactions using those standard Electrum wallets.You need to create separate cosigner MultiSig wallets from those seed phrases and the other's master public key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 02, 2023, 08:10:46 AM",
      "body": "Quote from: olhacker78 on December 02, 2023, 05:19:20 AMi have two electrum standard wallets with a small btc balance in each. Can i create a 2of2 multi-sig wallet using the seed phrases from these two existing standard wallets? and then continue using the standard wallets individually?You can create a Multi-Sig wallet using both Electrum applications installed separately.FYI, Multi-signature wallets are slightly different from Standard wallets (you can see the options when creating a new wallet in Electrum).The following is an example of a Multi-Sig wallet that I created on Electrum:Multi-Signature Wallet using the Electrum and the Hardware Wallet.The two Electrum applications can still be used to create a Standard wallet in each application individually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "December 02, 2023, 08:13:25 AM",
      "body": "Quote from: nc50lc on December 02, 2023, 07:54:03 AMHowever, you cannot sign transactions using those standard Electrum wallets.You need to create separate cosigner MultiSig wallets from those seed phrases and the other's master public key.Is it possible to create another set of addresses with an existing pair of seeds?Here is the guide for creating a new 2 of 2 multi-signature wallet using Electrum: Create a pair of 2-of-2 walletsOP, if both the wallets are installed on different devices then go ahead and create the multi-sig wallet using the same seeds but if both the seeds were stored in one device even once since it was created then it already beat the purpose of multi-signature so better create a new one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 02, 2023, 08:14:52 AM",
      "body": "To add to nc50lc's reply:Electrum uses a different derivation path when generating the master public key from the seed phrase for multi-sig wallets.This means that although the seed phrases you have for your multi-signature wallet are the same as your standard wallets, the master public keys would be different. Quote from: Findingnemo on December 02, 2023, 08:13:25 AMIs it possible to create another set of addresses with an existing pair of seeds?If the seed phrases have been generated by electrum, no. Electrum uses a fixed derivation path and doesn't allow you to change that. If they are BIP39, yes. You can change the derivation path a generate a completely different wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 02, 2023, 08:20:37 AM",
      "body": "Quote from: Findingnemo on December 02, 2023, 08:13:25 AMQuote from: nc50lc on December 02, 2023, 07:54:03 AMHowever, you cannot sign transactions using those standard Electrum wallets.You need to create separate cosigner MultiSig wallets from those seed phrases and the other's master public key.Is it possible to create another set of addresses with an existing pair of seeds?Sorry, I didn't get the question.If it's about the MultiSig wallet created from an existing standard wallet, then yes.The addresses in the MultiSig wallet are completely different from the standard wallet and the keys used are derived from a different derivation path.Now that I've mentioned it, it's worth noting to OP that he shouldn't use the master public key displayed in his standard wallets' info but the ones displayed during MultiSig wallet creation.-edit-As mentioned in the reply above. (hosseinimr93 beat me to it)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 02, 2023, 12:15:17 PM",
      "body": "Quote from: Findingnemo on December 02, 2023, 08:13:25 AMIs it possible to create another set of addresses with an existing pair of seeds?As an addition to hosseinimr93's answer above, although you cannot change the derivation path for Electrum seed phrases, you can always add a passphrase to one or both seed phrases which will result in a brand new wallet being generated when you combine them in a multi-sig.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}