{
  "id": "topic_5411522",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "August 28, 2022, 04:31:40 PM",
  "content": "QuoteTension between anonymity and identity in web3 is being tested as firms seek a way to control rampant fraudWeb3, blockchain, and decentralized finance (DeFi) technologies, with their famously libertarian users, seem like the last places you'd expect to see a credit-scoring system. But money talks, even in a DeFi world.If you understand a traditional credit score, you understand the point of a web3 credit score: to ascertain trustworthiness of individuals trying to transact on blockchains. Their basic scheme of operation isn't too dissimilar from centralized finance credit scores either.Where web3 credit scores differ from their analog ancestor is in how they define identity, and how easy it may be to fool them. Web3, cryptocurrency, and DeFi are all about anonymity, which makes it tough to see how credit scoring – a necessarily intrusive concept – can eliminate rampant web3 fraud without upsetting many of its advocates.  But what is a DeFi credit score?Credit scores in the physical world use a variety of metrics to arrive at a picture of an individual's financial state – payment history, length of credit, debt-to-income ratios, and other data points are part of how banks and lenders gain an understanding of the risk a person presents. Web3 credit scores would ostensibly do the same thing, but for decentralized financial systems.There's a lot of overlap between web3 credit score companies' methods, which generally involve linking one or more wallets to the company's system and letting an algorithm dig through the wallet's on-chain (and sometimes off-chain) history to build a picture of its owner.With a score established, the various DeFi credit agencies issue NFTs that serve as a token of creditworthiness. Those NFTs can be attached to any blockchain transaction on a system that supports smart contracts, like Ethereum, and could theoretically be used in place of collateral, which is commonly how DeFi transactions and loans are backed.The problem with DeFi credit: IdentityIt could be argued that the reason why credit scores work is because of their centrality. Banks and lenders report to whichever bureaus handle credit ratings in a particular country, and those bureaus in turn are able to keep an (ideally) accurate record of how borrowers behave.Not so with decentralized credit scores, and that appears to be a serious problem, DeFi researcher Chris Blec pointed out in a Twitter exchange with Julian Gay, CEO of Cred Protocol, a company developing a web3 credit scoring system.Discussing the use of multiple wallets, Blec said such users may be expecting a higher degree of privacy. In other words, what's to stop them from simply not linking additional wallets in order to compartmentalize their online activities?Spectral, a web3 credit score company that recently announced $23 million in funding from companies including SamsungNext, seemingly admits the potential for such abuse in its explanation of its scores, which it said are \"created by connecting either a single wallet or a bundle of several wallets to Spectral's App,\" the company said. With web3 credit scores apparently requiring voluntary participation, the success of such systems seem to rely on the hope that the incentive to create a pseudonymous, decentralized online identity will overrule an individual's desire to remain anonymous online. \"Web3 wallets include not only financial transactions, but also NFT holdings, gaming transactions, salaries, governance votes etc. So when a user bundles their wallets they are also expressing their pseudonymous identity,\" Spectral CEO Sishir Varghese told The Register. Avivah Litan, Gartner distinguished VP analyst covering AI and blockchain, said much the same, but added that the anonymity promised with web3 and blockchain are essentially incompatible with credit scores because establishing a credit score online requires some sort of decentralized identity system, Litan told us.\"Before we get reliable credit scores in Web3, we need more adoption of decentralized identity constructs and application and that hasn't happened yet,\" Litan told The Register. Bird, another web3 credit company, has answered that question by relying on off-chain data sources such as social media and web browsing history, as well as traditional banking records, employment status, and other sources of data it might be able to get its hands on in the future. \"Given the pace at which new data sources are being created in our daily lives, the sky is truly the limit when envisioning the potential of Bird's prediction products,\" the company said in a 2021 Litepaper [PDF] about its scoring process.That sounds an awful lot like traditional credit scores, only perhaps more invasive. Agencies like Experian and Equifax, for all their faults, don't typically look at your internet search history – at least not yet. ®https://www.theregister.com/2022/08/25/defi_credit_scores_blockchain/....Lack of credit scores is one of the major obstacles preventing crypto from breaking into home, car and student loan markets. Banks have credit scores and financial networks which allow them to set good terms for loans. While crypto has struggled through using IDs as a sole means of verification. As well as other methods, which haven't fallen short of ideal.I usually avoid anything with a web3 label on it if possible. Defi with credit scores could be the first web3 branded thing I might consider rethinking my stance on. This movement appears to have financial backing from large conglomerates like samsung. Perhaps crypto is finally receiving the support it needs to expand into some of the larger loan markets which traditionally have been dominated by banks?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411522",
  "comments": [
    {
      "author": "jackg",
      "created_time": "August 28, 2022, 05:53:55 PM",
      "body": "A couple of years ago centralised systems were put in place for places like exchanges and cybersec institutions to mark addresses based off their evilness and try to use those to prevent evil funds being washed through exchanges - in a decentralised space I don't think it works but more places are demanding kyc (even if just to steal funds off clients they know aren't willing to file it in some cases).Credit scores to defi seem impossible to enforce, credit scores in cefi are fairly weird too and can't track much - based off my own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 29, 2022, 08:35:26 AM",
      "body": "Anonymity and Identity can not go together. One of them has to be sacrificed.Unless these credit agencies want to be the secret police or military arm of cryptocurrencies and shoot (you read that right) scammers and hackers, they had better stick to just one thing. And Web3 credit scores are not going to solve any of that.Besides, they can just get hacked like most other smart contracts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latines",
      "created_time": "September 26, 2022, 05:35:19 PM",
      "body": "Since the summer of 2020, DeFi volume has grown from $9.7B TVL (Total Value Locked) to $230B. Due to this growing market, we are seeing a huge increase in risk hedging demand and cryptocurrency users often suffer from smart contract vulnerabilities, fraud and NFT hacking. In 2021 due to about $3 billion was lost to hacks and exploits. However, only 2% of DeFi is currently covered by the coverage option. So - what's the solution? This is where the Amulet comes in, as we will explain in detail below.Amulet is a DeFi coverage protocol for the Rust-based ecosystem with initial deployment on Solana. Our goal is to create a more secure Web3 for everyone by providing industry-leading digital asset protection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$anounimus$",
      "created_time": "September 26, 2022, 06:41:16 PM",
      "body": "I think the rationale that needs to be underlined is statistical, not ideological, and this is a practical matter. let's say the world population has about 6 billion people. To make an accurate score for all 6 billion, it would take at least about 9 trillion Information about each of their lives. That's far more information than we have in all the world's databases today.It is true, the huge potential of the credit score market has attracted the attention of many start-ups, especially blockchain-based ones which are highly anticipated to ease some of the other problems of the financial system such as remittances, cross-border payments, and the use of fiat currencies in global markets and alternative financial services and for people who do not have a bank account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "September 26, 2022, 07:06:18 PMLast edit: September 26, 2022, 07:19:18 PM by TimeTeller",
      "body": "Quote from: jackg on August 28, 2022, 05:53:55 PMA couple of years ago centralised systems were put in place for places like exchanges and cybersec institutions to mark addresses based off their evilness and try to use those to prevent evil funds being washed through exchanges - in a decentralised space I don't think it works but more places are demanding kyc (even if just to steal funds off clients they know aren't willing to file it in some cases).Credit scores to defi seem impossible to enforce, credit scores in cefi are fairly weird too and can't track much - based off my own. This is why I am wondering why people or companies are thinking that this venture will generate income from users.Defi users are using these decentralized apps, for one, to secure their privacy and to leave very small details to none as much as possible. So do you really expect them to voluntarily submit their online activities to get their defi credit scores?Unless, there are some very tempting rewards or bonuses on the line, but still, I don't get the feeling that this will attract large number of users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}