{
  "id": "topic_5445039",
  "title": "albon",
  "author": "albon",
  "created_time": "March 15, 2023, 05:34:19 PM",
  "content": "منصة Uniswap أصبحت متاحة اليوم على بلوكتشين BNB أحد أكثر سلاسل الكتل نشاطاً في العالم من حيث الحجم اليومي.يمكن الآن استخدام المنصة لبيع وشراء عملات BEP20 كما الحال مع منصة PancakeSwap.يوفر التوسيع المقترح لسلسلة BNB العديد من المزايا المهمة ، بما في ذلك نمو المستخدم ، وانخفاض الرسوم والقدرة على تزويد المستخدمين بخيارات تداول أكثر كفاءة وفعالية من حيث التكلفة.يؤدي هذا في النهاية إلى تحسين عرض القيمة لسلسلة BNB وعملة الBNB.[1] https://twitter.com/Uniswap/status/1636034900284383239",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445039",
  "comments": [
    {
      "author": "aseemhamza",
      "created_time": "March 15, 2023, 10:52:34 PM",
      "body": "بخصوص تواجد انواع البلوكشين المختلفة ... هل بأمكانى بعد الربط بمحفظة ميتامسك أن أستبدل الايثيريوم مثلا بعملة بى ان بى أو العكس ؟؟ وشكرا",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 16, 2023, 02:47:13 AMLast edit: May 14, 2023, 05:19:59 PM by yhiaali3",
      "body": "شكرا لك أخي @albon على الخبر، هذا الخبر مهم جدا بالنسبة لي لأنني أعمل على شبكة BNB منذ زمن واستخدم منصة PancakeSwap و 1inch والمنصتين جيدتين جدا وفيها تعدد شبكات أيضا وسيولة جيدة لكن تبقى منصة Uniswap اسم كبير جدا في عالم المنصات اللامركزية وسيكون جيد جدا إضافة شبكة BNB. لكن يبدو أنه لم يتم تزويد السيولة الكافية على المنصة بالنسبة للعملات الموجودة على شبكة BNB حتى الآن لأنني جربت أكثر من عملة وكلها أعطت رسالة أن السيولة غير كافية .                                     على كل حال أعتقد أن هذا بسبب كون الخدمة جديدة وسيتم إضافة السيولة اللازمة بالتدريج.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "March 16, 2023, 11:15:04 PM",
      "body": "Quote from: aseemhamza on March 15, 2023, 10:52:34 PMبخصوص تواجد انواع البلوكشين المختلفة ... هل بأمكانى بعد الربط بمحفظة ميتامسك أن أستبدل الايثيريوم مثلا بعملة بى ان بى أو العكس ؟؟ وشكرانعم أخى لكن يجب ان تكون العملة المراد استبدالها على نفس شبكة البلوكتشين التى ربطت محفظتك بهاQuote from: yhiaali3 on March 16, 2023, 02:47:13 AMلكن يبدو أنه لم يتم تزويد السيولة الكافية على المنصة بالنسبة للعملات الموجودة على شبكة BNB حتى الآن لأنني جربت أكثر من عملة وكلها أعطت رسالة أن السيولة غير كافية . على كل حال أعتقد أن هذا بسبب كون الخدمة جديدة وسيتم إضافة السيولة اللازمة بالتدريج. حياك الله أخى الكريم , نعم هذا صحيح فهذا الاصدار الجديد لم يستكمل اسبوع حتى الآن, فربما ما اضافوا سيولة للBNB حتى الآن لهذه العملةفما رئيته فى CMC ان هناك سيولة لعملة ANKR لكن لعملات اخرى ولكن ايضاً بفوليوم وسيولة ليست كبيرةبالنسبة لUniswap (V3) فيمكنك إلقاء نظرة على العملات التى بها سيولة كبيرة من خلال الرابط التالى: https://coinmarketcap.com/exchanges/uniswap-v3/فليس كل العملات على هذا الإصدار الحديث تحتوى على سيولة كافية.. لذلك علينا الإنتظار لحين إضافتهم لسيولة للمزيد من العملات..موفق",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}