{
  "id": "topic_5414295",
  "title": "eightdots",
  "author": "eightdots",
  "created_time": "September 20, 2022, 08:51:52 PM",
  "content": "1- Beliniz ağrıdığında daha önceden gitmiş olduğunuz ve size ameliyat olmanız gerektiğini söyleyen doktora mı gidersiniz yoksa çevrenizdeki kişilerin bildiği alternatif tıp uyguladığını söyleyen kişilere mi? (Doktorun ameliyat demesine rağmen egzersizlerle rahatsızlığınızın daha önceden geçtiğini varsayın.)2- Daha önce geçirmiş olduğunuz bir hastalık sonucunda aldığınız ilaçlar hala evinizde duruyor ve 7-8 ay sonra yine aynı rahatsızlığı yaşıyorsunuz. Bu ilaçları doktora sormadan kullanır mıydınız?3- Aynı rahatsızlığınız tekrar nüksettiğinde aynı doktorunuza mı gidersiniz yoksa farklı doktorları tercih eder misiniz?4- Kamuda ya da özelde çalışıyorsanız yılda kaç gün rapor alma hakkınızın olduğunu biliyor musunuz?5- En son ne zaman kan verdiniz?6- İlk yardım'ı biliyor musunuz?7- Heimlich manevrası'nı biliyor musunuz?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414295",
  "comments": [
    {
      "author": "yenerbatmaz",
      "created_time": "September 20, 2022, 09:15:54 PM",
      "body": "1 numaralı soruya cevap vereyim. Yıllardır belim ağrıyor diyip doktora giden ve ameliyat olan bir çok kişi tanıdım ve iyi oldum diyene rastlamadım. Daha yeni , arkadaşım babasını masör bir tanıdığına götürdü adam 20 gün de iyi oldu.  Nasıl yapıyorlar bilmiyorum. Belki o da tekrar eder ama ameliyat gibi riskli değil..adam şuan rahat yürüyor ağrı sızı yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "September 20, 2022, 09:24:55 PM",
      "body": "1- Beliniz ağrıdığında daha önceden gitmiş olduğunuz ve size ameliyat olmanız gerektiğini söyleyen doktora mı gidersiniz yoksa çevrenizdeki kişilerin bildiği alternatif tıp uyguladığını söyleyen kişilere mi? (Doktorun ameliyat demesine rağmen egzersizlerle rahatsızlığınızın daha önceden geçtiğini varsayın.)Alternatif tıp uyguladığını söyleyen dediğiniz bir zamanlar duvarlara \"romatizma tedavi edilir 0532*******\" yazdırtan kişilerse kesinlikle gitmem. Hakeza daha önceden egzersizlerle geçen bir rahatsızlıksa bu noktada ameliyattan önce fizik tedavi ya da kayropraktik tedavisi sunan lisanslı kişilere gitmek olurdu fazla zorlamadan. Ama baktım olmuyor zorlamaz ameliyat olurdum.2- Daha önce geçirmiş olduğunuz bir hastalık sonucunda aldığınız ilaçlar hala evinizde duruyor ve 7-8 ay sonra yine aynı rahatsızlığı yaşıyorsunuz. Bu ilaçları doktora sormadan kullanır mıydınız?Çocukluğumda doktorun bir uyarısı olmuştu \"Antibiyotikleri iyileşsen bile bitir değilse ileride etki etmez\" ne kadar doğru bilemem ancak o gün bu gündür tarafıma yazılan ilaçları tamamen bitiririm. Ha her rahatsızlıkta soluğu ilaçlarda almıyorum. Kronik olan rahatsızlıklarda genellikle vücudun kendisini iyi etmesini beklerim ilaç olmadan. Egzersiz ve vitamin desteğini arttırırım. Bu yüzdendir belki de ağrı ve acı eşiğim yok yüksekte.3- Aynı rahatsızlığınız tekrar nüksettiğinde aynı doktorunuza mı gidersiniz yoksa farklı doktorları tercih eder misiniz?Öncelikle aynı doktora giderim o ana kadar olan durumumu en iyi bilen kişi odur. Ancak tekrar tekrar nüksediyorsa daha uzman bir doktor bulmaya çalışırım.4- Kamuda ya da özelde çalışıyorsanız yılda kaç gün rapor alma hakkınızın olduğunu biliyor musunuz?Raporu en son lisedeyken kullandım ondan beridir work hard mode'dayım  5- En son ne zaman kan verdiniz?4 ay önce verdim 1 aydırda fırsat bulamıyorum kan vermeye değilse düzenli kan veren birisiyim. Gerçektende kan vermek insanın bünyesinde güzel etkiler bırakıyor.6- İlk yardım'ı biliyor musunuz?Hem ehliyet alırken hemde pandemi döneminde sağlık ve ilk yardım dersi vardı her ikisinde de can kulağıyla dinlemiş öğrenmiştim. Tabi pandemi döneminde sınav yerine ödev verilince ve hocamız ilk yardım tekniklerini fotoğraf ile anlatın demişti. Benimde yanımda mankenlik yapacak birisi olmayınca ve yastık gibi birşeyle yapmak istememiştim. Sonucu photoshopta bulmuş yaklaşık 3 saat uğraşmıştım. Sonuç mu hepsi hala aklımda  7- Heimlich manevrası'nı biliyor musunuz?Evet ve bu manevra ile bir kişiyi kurtarmışlığım var. Dipnot geçmek istiyorum. İlkyardım gerçekten de çok önemli. Çevrenizde birisinin can çekiştiği bir durumda kalınca keşke diyorsunuz bilseydim. Böyle dememek için geç kalmayın. İlk yardımın önemini kavramış olmaktan, öğrenmiş olmaktan gurur duyuyorum. Çünkü birçok kişinin hayatına değmiş bulundum. Yarın siz hiç tanımadığınız birisinin hayatını kurtarırsınız; başka bir günde hiç tanımadığınız birisi sevdiğiniz birisinin hayatını kurtarır",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 21, 2022, 05:45:35 AM",
      "body": "1- Doktor her zaman benim için önde gelir ancak unutmamak lazım ki bugün ki tıp geçmişteki alternatif tıpın temelleriyle farmakolojik evreyi tamamlamıştır yani bugünün olmasa bile geçmişin alternatif tıpı değerliydi bana sorarsanız eğer daha önce pozitif bir etki yaratmışsa ameliyattan önce denerim çünkü unutmamak lazım ki ameliyat en son çare olmalıdır 2- Daha önceden verilen ilaçlardan kas gevşetici gibi ilaçlar duruyor bunlar için kas ağrılarına kullandığım olmuştur ancak skt kontrolü yaparım ve iç hastalıklar gibi önemli ve nedeni bilinmeyen hastalıklarda asla bilinçsiz doktor kontrolsüz ilaç kullanmam 3- Doktordan doktora fark var daha önce şifa bulduysam aynı doktoru tercih ederim tabi memur olan doktorların biz hastalara yaklaşımı da önemli affedersin it muamelesi yapıyorsa kapıdan çıkar şikayet eder bir daha o doktora asla gitmem4- Senede 40 gün rapor hakkım var ancak ben bu rapor gününü zaruri olmadıkça kullanmıyorum keyfi raporun kul hakkı olduğuna ve haksız kazanç yarattığına inanıyorum 5- 6 sene falan oldu herhalde kan vermeyle alakalı bir rahatsızlığım olduğu ortaya çıktığında doktor sen kan veremezsin dedi kardeşimin ameliyatına bile arkadaşlarımı aradım da kan verdiler sağolsunlar6- Temel ilkyardım eğitimi mesleki olarak aldık tabi Hemlich manevrası, tampon yapma, uzuv kaybında ilk yardım gibi daha çok en gerekli ilk yardım metotlarıyla tabi7- Üstteki maddede belirttiğim gibi evet biliyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "September 24, 2022, 05:59:01 PM",
      "body": "1-Eğer egzersizler ile rahatsızlığım geçerse tabiki ameliyat olmam fakat düzenli kontrollerimi aksatmam. Alternatif tıp kısmına bulaşmam.2-Aynı rahatsızlığı daha sonra geçirsem bile mutlaka doktora giderim ve ilaçları kullanmam. Aynı hastalık olsa bile zaman geçtiği için farklı sonuçlara yol açabilir. 3-Doktordan memnunsam devam yoksa değiştir. 4- Kamuyu bilmem ama özel sektörde 1 yılı doldurduktan sonra 14 günden başlar maksimum 26 güne kadardır.(Gün sayısı kıdem yılına göre değişir.)5-Uzun zaman oldu.6-Her zaman eğitimlere girerim ama teorik eğitimler olduğu için akılda kalmıyor.7-Hayır",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "September 24, 2022, 08:05:55 PM",
      "body": "Heimlich manevrası sıklıkla gördüğüm bir kurtarma hareketidir. Bu zamana kadar ismini bilmemem kendi ayıbım olmuş, burada karşılaşınca araştırdım daha sonra videosunu açtım izledim teknik olarakta öğrenmiş oldum bu hareketi teşekkürler. Bu başlıkla beraber güzel bir farkındalık yaratmışsınız sorduğunuz sorularla teşekkür etmeden geçemedim. Kendi ailemde bile sıklıkla rastladığım diğer olay bireyler kendi kafalarına göre ilaç kullanımı yapıyorlar birbirilerine reçete paylaşıyorlar bu durum çok tehlikeli keşke daha fazla farkındalık sağlansa bu konuyla ilgili.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "October 01, 2022, 04:55:24 PM",
      "body": "1- doktora tabi. alternatif tıp önemli olabilir de benim inanışıma göre modern tıp daha önemli.2-durmaz mı kenarda duruyor tüm ilaçlar. iyice biriktikten sonra da atıyorum çöpe. çöpe atarken de defalarca poşete bağlıyorum ki istenmeyen kazalar yaşanmasın.3- aynı doktora giderim çünkü o kişi vücudumuzu daha iyi biliyor. yeni doktor vücudu bilmeden daha tanıma evresine girecek, ilacı ona göre verecek uzun iş.4- rapor hakkımız varmı? rapor alana patron ölmedikçe işe gel diyor da, raporun bir hak olduğunu önce iş verene anlatmak lazım.5- hatırlamıyorum çok uzun zaman olmuş olmalı.6- ilk yardımı hep görüyoruz da tam olarak hiç uygulayamıyoruz. bu yüzden bilmedim sayıyorum.7- duydum ama kullanmadım, tam bilmiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 02, 2022, 04:13:52 PM",
      "body": "1- Gittiğim doktor kesinlikle ameliyat olmam gerektiğini söylesede önce başka doktorlarada giderim ayrıca alternatif tıp konusundada iyi olan insanlar var onlarlada görüşürüm.2- Bazı ilaçları kullanabilirsiniz rahatsızlığınız sebebini %90 kestirebiliyorsanız ve o ilaç varsa kullanırım mesela sinüzit gibi.3- Hastalığa göre değişir genelde aynı doktora giderim ama verdiği ilaçlardan tedavi yöntemlerinden yaklaşımından memnun değilsem o doktora tekrar gitmem.4- Biliyorum keyfi olarak rapor almayı hiç düşünmedim doktordanda rica etmedim.5- 1 Haziran 2022 tarihinde verdim ilk fırsatta tekrar vereceğim.6- Kısmen biliyorum tabi tekrarlanmayan bilgiler unutulabiliyor.7- Biliyorum, sıklıkla filmlerdede bunu işledikleri oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "October 14, 2022, 11:49:55 AM",
      "body": "1- Doktor tabiki. Doktor ameliyat demişse vardır bi bildiği. Ameliyat kaçınılmaz olduğu için demiştir. Ameliyat olmaktan ben de korkarım. Ama o kadar değil.2- Ağrı kesici olursa olur. Mide, karaciğer gibi bi hastalıksa kullanamam aynı ilacı. Vücudumun aynı yeri ağrısa da aynı hastalık mı bilemem. Doktordan onay almadan kullanmam.3- Aynı doktora. Çünkü hastalık geçmişimi bilir en azından. Başka doktora her şeyi baştan anlatınca eski doktorumun denemiş olduklarını bi daha deneme durumu oluyor.4- Sınıra gelmediğim için bilmiyorum.5- 3 sene önce. Biraz tembelim bu konuda.6- Çoğunu. Ama teorik olarak. Yerde kalp krizi geçiren biri olsa pratikte sınıfta kalabilirim. Heyecanlı bi kişiliğim. Bi suni teneffüsü herkese yapabilir miyim emin değilim. Aşırı titizliğim de var. Hayat meselesi olduğu için yaparım sanırım. Ama zor olur benim için.7- Biliyorum. Aynı şeyi yazıcam. Ama teorikte bilmek başka uygulamak başka. Ya çıkaramazsam endişesi var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}