{
  "id": "topic_5403189",
  "title": "tokyohd",
  "author": "tokyohd",
  "created_time": "June 19, 2022, 08:49:35 AM",
  "content": "BabyDoge Achieves New Big Community Milestone! On April 29, this number was still at the 1.3 million level, while in February it stood at 1 million. Thus, over the past 5 months, the growth has been nearly half a million Twitter followers.This is not the only milestone reached by BabyDoge recently. As reported by U.Today, earlier this week the number of the BabyDoge circulating supply was finally verified by CoinMarketCap. Besides, the BabyDoge holder number has spiked to reach an all-time high of 1,550,000 addresses.At press-time, the price of the meme token is holding at $0.000000001177, showing a decline by 3.46 percent in the past 24 hours. Source Link: https://u.today/babydoge-achieves-new-big-community-milestone I love BabyDoge. I expect big profits from babydoge coins in the future. Do you agree with me?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403189",
  "comments": [
    {
      "author": "bittick",
      "created_time": "June 20, 2022, 03:54:10 PM",
      "body": "Twitter followers meant nothing, this can be bunch of bots that follow this meme token that has no value. The babydoge army was also very annoying. I just also remind you that if total address was also nothing. With multi billions of supply and this is not a big surprise for me but the total active wallet must become the main thing to determine this. You can expect a big profit in the future but not so big like when elon was hyping the meme token",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "June 20, 2022, 08:23:24 PM",
      "body": "Another meme-coin with a scary number of zeros after the decimal point. If such projects grow, it is only during periods of general market euphoria, when liquidity flows into everything.  In bearish periods, as well as in periods of recovery, investing in such projects is of little interest to anyone because the project does not carry any utilitarian value, just another pump&dump project which can pumping, if some Influencer takes it on and starts to PR it. Without that no one needs such projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VRExpress",
      "created_time": "June 21, 2022, 06:03:31 AM",
      "body": "I've seen enough milestone achieved by this babydoge but all hail goes to the CEO himself, we really can't tell which project as a devoted CEO or developers but once you have enough reasons not to doubt its ok to support, but for me I am sticking with Shiba inu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}