{
  "id": "topic_5430664",
  "title": "MetaMallVerse",
  "author": "MetaMallVerse",
  "created_time": "December 20, 2022, 11:52:27 PMLast edit: December 21, 2022, 12:30:03 AM by MetaMallVerse",
  "content": "The Ultimate Virtual Shopping Experience for the MetaverseThe Meta Mall Verse (MEMV) is a virtual world where users/brands can build, own, and sell their inventory in the BSC blockchain using credit cards or crypto, MEMV is the platform’s utility token. Our vision is to offer a deeply immersive metaverse in which brand/store owners will create virtual worlds and real-life inventories collaboratively and without a central authority. We will build a voxel metaverse platform where users/brands are able to craft, play, share, collect, and trade without central control, enjoying secure copyright ownership with the ability to earn cryptocurrency (MEMV).Our next-generation technology will engage brands, consumers, store owners, and users in never-before-seen ways. Through building profitable businesses powered by a decentralized economy, we raise awareness and present the real-world utility of crypto tokens beyond the speculative bubble. Cryptocurrencies empower all of us to create independent and more equitable ecosystems and build new opportunities. Our goal is to move this future forward by finding new and engaging ways to accelerate mass adoption and bring non-crypto people on board. Our ultimate mission is to take crypto adoption to the next level. We believe blockchain is the most important invention of our time, perhaps equal only to the worldwide web. And just like the Internet, blockchain has the potential to give humanity the means to make the world a better place.TECHNICAL INFORMATIONToken Name: MetaMallVerse (MEMV)Total Supply: 1.000.000.000 (1 Billion)Blockchain: Binance Smart Chain (BSC)Decimals: 18Whitepaper v.1 Link: https://memv.net/MEMV-Whitepaper-v1.pdfIMPORTANT DATESICO Starts: 21st Dec. 2022ICO Ends: 30th Jan. 2023Token Distribution: 31st Jan. 2023Exchange Listing: 1st Feb. 202360% of the total MEMV supply (600.000.000) will be available for sale during our ICO.To find out more about Token and Funds allocations, please visit MEMV.NETRound 1 ---> Starts: 21 December 2022 / Ends: 31 December 2022 - Price Per MEMV: $0.05 - Round Supply: 100.000.000 MEMV - Bonus: +20% MEMV Round 2 ---> Starts: 01 January 2023 / Ends: 10 January 2023 - Price Per MEMV: $0.08 - Round Supply: 150.000.000 MEMV - Bonus: +10% MEMV Round 3 ---> Starts: 11 January 2023 / Ends: 20 January 2023 - Price Per MEMV: $0.13 - Round Supply: 150.000.000 MEMV - Bonus: +5% MEMV Round 4 ---> Starts: 21 January 2023 / Ends: 30 January2023 - Price Per MEMV: $0.20 - Round Supply: 200.000.000 MEMV - NO BONUSWebsite: MEMV.NET - MEMV.IOTwitter: https://twitter.com/MetaMallVerseTelegram: https://t.me/memvioDiscord: https://discord.com/invite/bcxv7wYY9GFacebook: https://www.facebook.com/MetaMallVerseInstagram: https://www.instagram.com/memvnet/Tiktok: https://tiktok.com/@metamallverseMedium: https://medium.com/@metamallverseBounty Thread: https://bitcointalk.org/index.php?topic=5430649.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430664",
  "comments": [
    {
      "author": "MetaMallVerse",
      "created_time": "December 21, 2022, 12:30:43 AM",
      "body": "Reserved For Updates",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 21, 2022, 12:11:36 PM",
      "body": "Plagiarism DetectedHello, upon reading your whitepaper I found that the said document is heavily plagiarizes several sources. I invite you to defend yourself on the accusation I raised against your project here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MetaMallVerse",
      "created_time": "December 24, 2022, 11:28:09 AM",
      "body": "Quote from: holydarkness on December 21, 2022, 12:11:36 PMPlagiarism DetectedHello, upon reading your whitepaper I found that the said document is heavily plagiarizes several sources. I invite you to defend yourself on the accusation I raised against your project hereHello, Thank you for raising this concern, we have hired a new writer group and they are working on the new version of the whitepaper. Next week we are expecting to publish it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 24, 2022, 02:07:06 PM",
      "body": "Quote from: MetaMallVerse on December 24, 2022, 11:28:09 AMQuote from: holydarkness on December 21, 2022, 12:11:36 PMPlagiarism DetectedHello, upon reading your whitepaper I found that the said document is heavily plagiarizes several sources. I invite you to defend yourself on the accusation I raised against your project hereHello, Thank you for raising this concern, we have hired a new writer group and they are working on the new version of the whitepaper. Next week we are expecting to publish it. Please address this concern on the given thread, so you can give your answer to the said accusation properly and people following the situation can get the update of the development of the case. And it is not as simple as \"we hired a new writer group\", you didn't take your whitepaper seriously, \"hired a third party\" to write your ideas, how should people trust your project?Edit: was opening this thread prior to the dev posting their reply to the accusation thread, attending to some matter at home and posted this one above just now, hence missing the latest updated reply of dev's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MetaMallVerse",
      "created_time": "December 26, 2022, 07:53:47 AM",
      "body": "We are working on our product, we are chasing our dream. Plagiarism may look like a serious problem to you I agree. However, this won't stop us if this is what you are looking for. We will prove ourselves with the product we are creating, not with the blah blah words written here and there. Once again thank you for raising the concern. We are fixing the issue about the whitepaper and lesson learned. These are the final words to be said in this matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pingu39",
      "created_time": "March 11, 2023, 06:37:22 PM",
      "body": "I think your project is great and trustworthy. I see that it is in the exchange and that bounty has been paid in one part. I am interested when you will launch bounty 2, have you suspended it for now. I miss first one,don't want miss second.I think the project is worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}