{
  "id": "topic_5475531",
  "title": "Beraklitus",
  "author": "Beraklitus",
  "created_time": "November 26, 2023, 03:41:20 AM",
  "content": "İptal ettirdiğim hattım Kucoin borsasında kayıtlı.Kaydedecek yeni bir hattım da yoktur.Bu kullanılmayan eski numarayı Kucoin destekten nasıl kaldırırız?Parayı çekebilmek için numarayı kaldıracağım.Aktif olmayan hatta SMS gidiyor. Yardım ederseniz sevinirim.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475531",
  "comments": [
    {
      "author": "ajanwalker",
      "created_time": "November 26, 2023, 06:41:15 AM",
      "body": "Support ile iletişime geç ama senden epey bir evrak vs isteyeceklerdir.Kyc yapmadıysan eğer kyc ile ise başlarsın. Daha sonra önceki hattın sana ait olduğunu ispat etmen lazım. Biraz uğraşman gerekecek. support ne belge isterse verirsin ancak o şekilde olur başka yolu yok",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 26, 2023, 11:12:34 AM",
      "body": "ajanwalkerin yazdığı süreçten geçmek gerekecek, bunun sorunsuz halledilebilmesinin tek yolu istenilen her bilgiyi vermek, düzgün borsalar bu konuda taviz vermezler ve bence de vermemeleri gerekir. Bazı borsalarda bu süreç günlere malolabiliyor ama yanlış hatırlamıyorsam geçmişte Kucoin hesabı ile ilgili bu tarz sorun yaşayan bir iki kişi işini saatler içerisinde halletmişti. Umarım seninki de böyle olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beraklitus",
      "created_time": "November 26, 2023, 12:21:29 PM",
      "body": "Destekle iletişime zaten geçmiştim. Giriş sayfasında iki adimli doğrulama/ telefonu kaldırma basamaklarını önerdiler. Girişte böyle bir şey bulamadım. İstenilen her türlü evrakı yüklerim, sorun olmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 26, 2023, 05:26:14 PM",
      "body": "Quote from: Beraklitus on November 26, 2023, 12:21:29 PMDestekle iletişime zaten geçmiştim. Giriş sayfasında iki adimli doğrulama/ telefonu kaldırma basamaklarını önerdiler. Girişte böyle bir şey bulamadım. İstenilen her türlü evrakı yüklerim, sorun olmaz.Hocam o zaman tekrar iletişime geç ve resimli tarif iste. Ben bulamadım de. Dedikleri gibi oluyorsa eğer başka şeyler ile uğraşmadan halledersin.Geçmiş olsun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "November 26, 2023, 08:39:04 PM",
      "body": "Quote from: Beraklitus on November 26, 2023, 12:21:29 PMDestekle iletişime zaten geçmiştim. Giriş sayfasında iki adimli doğrulama/ telefonu kaldırma basamaklarını önerdiler. Girişte böyle bir şey bulamadım. İstenilen her türlü evrakı yüklerim, sorun olmaz.Borsaların müşteri hizmetleri servisinde çalışan kişiler çoğu zaman yeterince donanımlı kişiler olmuyor. Sizin anlattığınız şeyi anlamamış olma veya her zamanki sorulardan biri zannedip (telefon no değiştirme) doğrudan hazır metini size göndermiş olabilir. Bu yüzden başka çalışanlarla da görüşmeyi deneyin içlerinden sizi anlayacak herhangi biri çıkana kadar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 27, 2023, 07:39:55 AM",
      "body": "Quote from: Beraklitus on November 26, 2023, 12:21:29 PMDestekle iletişime zaten geçmiştim. Giriş sayfasında iki adimli doğrulama/ telefonu kaldırma basamaklarını önerdiler. Girişte böyle bir şey bulamadım. İstenilen her türlü evrakı yüklerim, sorun olmaz.Belli ki destekteki(!) kişi önündeki cevap listesinin bilmemne numaralı maddesine uyan bir durum olduğunu düşünüp ona göre cevap vermiş, maalesef pek yetkin (ve yetkili) değiller. Biraz uğraşman gerekebilir, uğraşmaktan kastım sorunun farklı olduğunu ve çözüm getirmeleri gerektiğini anlamaları için ısrarlı olmak.Kaldı ki, eğer yanlış bilmiyorsam Kucoin Türkiye'de resmi izinlerini almış olarak faaliyet gösteriyor, dolayısıyla bir takım yükümlülükleri var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "November 29, 2023, 08:54:13 AM",
      "body": "telegram'dan iletişim kurman ve oradaki adminlerden yardım istemen daha faydalı olabilir ama telegram gruplarına gidip ortalık yere \"benim böyle böyle bir sorunum var\" diye mesaj yazma çünkü dolandırıcılardan günlerce süren mesajlar alırsın. telegram kanallarına gidip adminleri bulup onlara doğrudan mesaj gönderebilirsin. ayrıca, bu olay benim başıma gelseydi, eski numarayı arayıp durumu izah ettikten sonra mesaja gelen şifreyi benimle paylaşmasını isterdim. teknolojiye uzak biriyse bu yaklaşımı bir dolandırıcılık girişimi olarak algılayabilirdi (ki bence bu normal olurdu) ama yardımcı olmayı kabul ederse 10 nümero bir iş yapmış olurdu. :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 29, 2023, 04:03:33 PM",
      "body": "Quote from: trendcoin on November 29, 2023, 08:54:13 AMtelegram'dan iletişim kurman ve oradaki adminlerden yardım istemen daha faydalı olabilir ama telegram gruplarına gidip ortalık yere \"benim böyle böyle bir sorunum var\" diye mesaj yazma çünkü dolandırıcılardan günlerce süren mesajlar alırsın. telegram kanallarına gidip adminleri bulup onlara doğrudan mesaj gönderebilirsin. ayrıca, bu olay benim başıma gelseydi, eski numarayı arayıp durumu izah ettikten sonra mesaja gelen şifreyi benimle paylaşmasını isterdim. teknolojiye uzak biriyse bu yaklaşımı bir dolandırıcılık girişimi olarak algılayabilirdi (ki bence bu normal olurdu) ama yardımcı olmayı kabul ederse 10 nümero bir iş yapmış olurdu. Böyle konularda gayet dikkatli olduğunu düşünen birisi olarak yıllar önce o salaklığı yaptım ve sonrasında da yazdığın gibi, hatta günlerce değil, haftalarca keriz avcılarından kaçmak zorunda kaldım. Binance destekten birisiyle(!) üstelik uzun uzun da yazışarak (yani salaklıkta ısrar ederek) verdiği adrese swaplandığı için değişimi gereken şimdi hatırlamadığım tokenı bir güzel gönderdim, niyeyse yeni hali geri gelmedi . Bana yaklaşık 150 dolara malolan (boğadaki rakamı unutmak istiyorum) 15 dakikalık pahalı bir ders oldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 29, 2023, 05:23:29 PM",
      "body": "Quote from: bobita on November 29, 2023, 04:03:33 PMQuote from: trendcoin on November 29, 2023, 08:54:13 AMtelegram'dan iletişim kurman ve oradaki adminlerden yardım istemen daha faydalı olabilir ama telegram gruplarına gidip ortalık yere \"benim böyle böyle bir sorunum var\" diye mesaj yazma çünkü dolandırıcılardan günlerce süren mesajlar alırsın. telegram kanallarına gidip adminleri bulup onlara doğrudan mesaj gönderebilirsin. ayrıca, bu olay benim başıma gelseydi, eski numarayı arayıp durumu izah ettikten sonra mesaja gelen şifreyi benimle paylaşmasını isterdim. teknolojiye uzak biriyse bu yaklaşımı bir dolandırıcılık girişimi olarak algılayabilirdi (ki bence bu normal olurdu) ama yardımcı olmayı kabul ederse 10 nümero bir iş yapmış olurdu. Böyle konularda gayet dikkatli olduğunu düşünen birisi olarak yıllar önce o salaklığı yaptım ve sonrasında da yazdığın gibi, hatta günlerce değil, haftalarca keriz avcılarından kaçmak zorunda kaldım. Binance destekten birisiyle(!) üstelik uzun uzun da yazışarak (yani salaklıkta ısrar ederek) verdiği adrese swaplandığı için değişimi gereken şimdi hatırlamadığım tokenı bir güzel gönderdim, niyeyse yeni hali geri gelmedi . Bana yaklaşık 150 dolara malolan (boğadaki rakamı unutmak istiyorum) 15 dakikalık pahalı bir ders oldu.Abi telegramda beni de fena öpmüşlerdi. O zaman için 200 dolar civarıydı ama şuan 2000 doların üstünde. ( 1 eth çaldırdım)Telegram da dikkatli olmak lazım. 😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}