{
  "id": "topic_5403833",
  "title": "LoveWalter",
  "author": "LoveWalter",
  "created_time": "June 24, 2022, 01:30:02 AM",
  "content": "Here is a question for you brilliant people out there:1. How come I can’t get my mining software to put out more than 8-10 kilohashes?2. BUT I let my miner go over night and woke up to check on it during the night and it was putting out like 350 kilohashes.By the morning it was down to about 6 kilohashes again and I tried this for the last 3 nights. Anyway, what could be the cause of this? I have my OC all fine tuned, and I didn’t do anything special to any setting or replace the processor or anythingWhy the huge jump in kilohashes, unless it was a pool thing, maybe a ton more people connected to the pool? Anyway - if the computer can put out that much, I may have a use for it to mine somethingAnyways I wanted to ask what are your thoughts, if anyone knows?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403833",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "June 24, 2022, 01:04:43 PM",
      "body": "Quote from: LoveWalter on June 24, 2022, 01:30:02 AM1. How come I can’t get my mining software to put out more than 8-10 kilohashes?You will have to tell more about what you're doing and what you think you want to achieve.As in the pinned post, you need an ASIC to mine Bitcoin. You cannot mine Bitcoin with PC, if that's what you're doing.So the answer would be: \"that's because you're some 10 years late for PC mining and in 2022 you need to buy ASIC\".If you're mining altcoins, on the other hand, then please ask in altcoin mining area of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 24, 2022, 03:38:10 PM",
      "body": "If its all about kilo you talking about weight?The more the heavy you are mining is the more profit you can earn?Bitcoin can't be able to mine without Asic unless you talking about mining with altcoin or token?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoveWalter",
      "created_time": "June 24, 2022, 07:37:36 PM",
      "body": "Hey,Thank you both for the response. I should answer a few things that I never answered: 1. I should have said this in my first message, and I totally forgot. Iam not mining Bitcoin. I have mined and I’m currently mining either Bitcoin Gold, Ethereum Classic or Monero.2. Iam not using an ASIC. I’m using just a personal GPU. What I want to achieve is simple…I’m just mining for fun, it is just something that I have been doing for quite sometime. To address your concern about being “10 years to late to mining”, that is possible I only started mining just a little bit after mining became a thing, so I might not know what I’m doing.3. I do not really have any, “achievement goal” that I’m pursuing, I mine for fun, and the little bit of extra income that is made > at some point during the year I’ll login to my different wallets and convert everything to LiteCoin or Doge or Ethereum and exchange it for cash > then transfer it into the girlfriend and I’s joint accountBut the reason for my question was to see if anyone knew why mine (or anyones) mining software would put out a huge amount of Kilohashes at night then just go back down to putting out 8-10 during the day (PST, and “per day” meaning between the hours of about 7am and 130pm, sorry I didn’t specify that in my last message, sorry.Oh and as far as posting in “alt-coins”, well I wanted to do that initially but someone that I was chatting to mentioned that, my topic should go in the genera discussion forum. Next time I’ll post something like this, there. Thank you again,JeffQuote from: NeuroticFish on June 24, 2022, 01:04:43 PMQuote from: LoveWalter on June 24, 2022, 01:30:02 AM1. How come I can’t get my mining software to put out more than 8-10 kilohashes?You will have to tell more about what you're doing and what you think you want to achieve.As in the pinned post, you need an ASIC to mine Bitcoin. You cannot mine Bitcoin with PC, if that's what you're doing.So the answer would be: \"that's because you're some 10 years late for PC mining and in 2022 you need to buy ASIC\".If you're mining altcoins, on the other hand, then please ask in altcoin mining area of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoveWalter",
      "created_time": "June 24, 2022, 07:43:48 PM",
      "body": "I forgot to mention, I totally understood what you were getting at, and since I’m not mining Bitcoin or using an ASCI, I’ll need to post in the other forum and I’ll just provide a link to this post here incase anyone needs to see it,Thank you for the response!! JDQuote from: NeuroticFish on June 24, 2022, 01:04:43 PMQuote from: LoveWalter on June 24, 2022, 01:30:02 AM1. How come I can’t get my mining software to put out more than 8-10 kilohashes?You will have to tell more about what you're doing and what you think you want to achieve.As in the pinned post, you need an ASIC to mine Bitcoin. You cannot mine Bitcoin with PC, if that's what you're doing.So the answer would be: \"that's because you're some 10 years late for PC mining and in 2022 you need to buy ASIC\".If you're mining altcoins, on the other hand, then please ask in altcoin mining area of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "June 25, 2022, 01:38:42 AM",
      "body": "Those coins each use a different algorithm. Different algorithms mine at different speeds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "June 25, 2022, 07:58:28 PM",
      "body": "Quote from: LoveWalter on June 24, 2022, 07:37:36 PMHey,Thank you both for the response. I should answer a few things that I never answered: 1. I should have said this in my first message, and I totally forgot. Iam not mining Bitcoin. I have mined and I’m currently mining either Bitcoin Gold, Ethereum Classic or Monero.Monero is more profitable to mine on multi-core processors, asics are used for mining Bitcoin Gold, so this coin is not mined on processors and video cards. For Ethereum Classic, there are ASICs and video cards.What equipment and settings do you have?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}