{
  "id": "topic_5454537",
  "title": "eightdots",
  "author": "eightdots",
  "created_time": "May 30, 2023, 04:41:48 PM",
  "content": "Birçoğumuz bildiği ve kullandığı ekran kartları pazarının lideri Nvidia değerini 1 triyon dolarının üzerine taşıdı. Yıllardır sektöründe en üst seviyede yerini alıyor. Biz ekran kartı olarak tanışsak da sektörde yapay zekâ alanında da yıllardır dominant bir şirket. Bu yapay zekâ teknolojileri tüketicilerin karşısına DLSS, ışın izleme ve DLAA gibi teknolojiler ile çıkarken profesyonel sahada Nvidia’nın yazılımları ve donanımları, sektörde ‘tek geçer’ olarak sayılıyor.Mesela bu \"tek geçer\" kavramı benim tercihlerim açısından da doğrular nitelikte. Ekran kartı alırken Nvidia'dan şaşmadım ve başka bir marka ekran kartı düşünmedim. Bu da piyasada oluşturduğu güven sayesinde gerçekleşiyor.Konuyu açtığım dakika itibariyle güncel hisse fiyatı aşağıdaki gibi.Kaynak:https://www.log.com.tr/nvidia-yz-sayesinde-1-trilyon-dolari-geride-birakti/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454537",
  "comments": [
    {
      "author": "LGD2Business",
      "created_time": "May 30, 2023, 07:48:35 PM",
      "body": "NVIDIA ekran kartı olarak hayatımıza girdi ama asıl yatırım yaptıkları alanlar haberde bahsedildiği gibi yapay zeka ve belki de önümüzdeki 100 seneye damgasını vuracak teknoloji bu olacak o yüzden bu alanda geliştirme yapan şirketlerin karlılığı artacaktır. Bunun yanında mobil işlemci konusuna da el attılar ve yakında telefonların günümüz bilgisayarlarıyla yarışacak seviyede çok daha güçlü işlemcilere sahip olmasını sağlarlarsa şirket hisseleri değerlenmeye devam edecektir. Dünyadaki herkesin en az bir telefonu olduğunu ve nüfus artış hızını düşündüğümüzde sürekli aktif bir pazarda en değerli parçalardan birini üretiyor olacaklar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "May 30, 2023, 08:46:09 PMLast edit: June 02, 2023, 10:31:56 PM by SUPERSAIAN",
      "body": "AI konusunda oldukça avantajı eline almış durumda NVIDIA şirketi her türlü alt yapı, geliştirmeye sahip sektörün öncüsü bir firma oldular. NVIDIA duymayan yoktur ekran kartı söz konusu olduğunda madenciler, oyuncular yaptıkları üretim ve tedariği düşünemiyorum bile. hep NVIDIA kullandım rakip amd var en yakın hiç bir zaman tercihim olmadı. Yakın zamanda güncellemek istiyorum Türkiye de vergilendirme sayesinde çok daha pahalıya geliyor lanet olasıca kartlar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 31, 2023, 12:36:11 PM",
      "body": "NVIDIA gerçekten kaliteli ekran kartları üreten bir firma. Aldığım hiçbir ürününden pişmanlık duymadım. Bunlara ek olarak biliyorsunuz artık Geforce Now servisi ile bulut oyunculuğun da önünü açtı. En popüler servis onlarda sanıyorum. Bunlar yetmezmiş gibi SoC vs üretimi de var nvidia nın. Tegra çip markası var Nintendo Switch lerde bulunan. Shield adında android tv kutusu var yine tegra çipli, apple ile beraber piyasanın en iyisi. Giderek büyüyen bir marka. Mining için de kullanıldığını tahmin ediyorum. Hak ettiği değerlere ulaşmış.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "June 01, 2023, 08:30:32 PM",
      "body": "Aklıma veri merkezlerinin devasa boyutlara ulaşmasaydı ve madencilik olmasaydı NVIDIA'nın değerini bu kadar yüksek olur muydu geldi. Madencilik olmasaydı da adından sıkça söz ederdik elbette ancak değerinin büyük bir bölümünü madenciliğe borçlu bana göre. Bunda veri merkezlerinin artmasının da etkisi vardır. Son zamanlarda yapay zeka sektörünün ani ve hızlı gelişiminin de şirket ve hisseler üzerinde pozitif etkileri var. Yapay zekanın hızla geliştiğini ve her alanda hakimiyet sağlayacağını düşünürsek ilerleyen yıllarda NVIDIA'yı dünyanın en değerli beş şirketi arasında görürüz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "June 02, 2023, 06:29:11 AM",
      "body": "5 dolarlık bir gerileme yaşamış olsa da Nvidia sektörün en önemli taşlarından birisi. Ekran kartı seçimlerimde her zaman ilk tercihim Nvidia olmuştur. Nispeten daha az sorun çıkardıklarını çevremden de duymuştum bende deneyimledim. Bir ara AMD’ye geçmiştim ve belki bana öyle geldi çok sorun yaşamıştım. Sektörü taşıyan taşıyıcı kolonlardan birisi oldukları için potansiyelleri bu kadar yükseldi. 1 trilyon dolar inanılmaz bir rakam. Tebrik edilmesin de ne edilsin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "June 02, 2023, 08:43:17 AM",
      "body": "1 Trilyon dolar çok büyük bir para. Yapay zekanın gelecek seneler için vazgeçilmez olacağını tahmin etmek çok zor değil. Bu aşamada 1 trilyon doları da geçecek bir değeri şimdiden ön görmek mümkün. Yalnız şöyle bir şeyi merak ediyorum. Şimdi 1 trilyon dolar olan bu hisseyi 2x yaptırmak çok çok zor. Bu aşamada böyle büyük hacimlere sahip hisseleri almak mantıklı mı değil mi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "June 02, 2023, 11:47:56 AM",
      "body": "Kripto para sektörünün tamamının 1 trilyon dolar hacmi olduğunu düşünürsek Nvidia’nın geldiği yeri tahmin etmek daha kolay olacaktır. Dünyanın en zengininin 216 milyar dolar kişisel serveti olduğunu düşünürsek NVIDIA’nın ne kadar sağlam temelli bir firma olduğunu bir kere daha anlayacağız. Geçmiş dönemde daha yüksek fiyatlardan işlem  görmüştü ama sanırım hisse senedi adetinde bir yükseliş söz konusu olmuş çünkü 2020 yılında 500 dolar olduğuna dair bir kaç yazışma okuduğumu hatırlar gibiyim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 16, 2023, 10:14:39 PM",
      "body": "NVIDIA şu an rakip olarak görülecek AMD markasının çok önünde. Ve aralarında ki kalite her geçen gün artıyor. Dünyadaki teknoloji youtuberlarını takip ettiğimde NVIDIA'nın yeni çıkan ekran kartını AMD'nin son çıkan ekran kartıyla karşılaştırmak yerine NVIDIA'nın bir önceki kartı ile karşılaştırıyorlar. Aradaki fark bu kadar fazla. Ayrıca yapay zeka olayı çok gelişti ve NVIDIA bu alanda da çok önemli adımlar attı. Stable Difisuon ile bir çalışma yapmak istiyorsan AMD ile onun driverları ile uğraşmak çok can sıkıcı boyutlarda olabilir ama NVIDIA bu konuda direk rahatlık sağlıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "September 15, 2023, 07:53:16 PM",
      "body": "Son zamanlarda yükselen hisselerde Nvidia'nın isminin geçmesinden dolayı konuyu açmıştım. Birkaç ekleme yapmak istiyorum.Nvidia Corp.’un CEO’su Jensen Huang, NVDA hisselerinin önemli bir kısmını satması büyük tepkiye neden oldu ve sayısız haber yapıldı. Bu satış Nvidia hisselerinin yaklaşık olarak 1 sene boyunca sürekli artmasından sonra geldi. Bu satışlara rağmen, NVDA’nın fiyatı sert düşüş yaşamadı ve yoluna devam ediyor.1Nvidia'nın bugünkü hisse değeri;2Bu haberden sonra oyun dünyasıyla ilgilenen biri olarak Nvidia'nın oyunlar için yaptığı yatırıma bir örnek vermek istiyorum.AMD sponsorlu oyunların çoğunda DLSS yok iken Nvidia sponsorlu oyunların çoğunda FSR var. Nvidia'nın oyuna ve oyunculara verdiği önem satışlarına yansıyor.3Kaynak:1https://gameishard.gg/tr/news/nvidia-ceo-sirket-tum-zamanlarin-en-yuksek-seviyesine-ulasirken-hisse-senetlerinin-bir-kismini-satti/159797/#:~:text=Nvidia%20Corp.'un%20CEO',milyon%20dolarl%C4%B1k%20sat%C4%B1%C5%9F%C4%B1%20da%20i%C3%A7ermektedir.2https://www.google.com/finance/quote/NVDA:NASDAQ?sa=X&ved=2ahUKEwi7ka2Lr62BAxXVRPEDHTjJDroQ3ecFegQIYhAa3https://twitter.com/GeeklikOtesine/status/1682098532260409344",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 15, 2023, 08:28:47 PMLast edit: September 15, 2023, 08:47:40 PM by ZekiBeyy",
      "body": "Nvidia oyuncuların gözdesi tabi bu kendi başına mümkün olmuyor. GPU teknolojisini sürekli geliştiriyorlar özellikle RTX40 serisi ile DLSS 3.0 ve yapay zeka ile oyunlara bambaşka bir soluk getirdiler bu gibi gelişmeler sonucunda oyuncuların bir numaralı tercihi bence Nvidia. Mining yaparken Amd ve Nvidia ekran kartları kullanmıştım, Nvidia Amd ye oranla bence daha stabil ve sorunsuz çalışıyor. Oyun oynayan biri olarak tercihim Nvidia ve hali hazırda RTX 3060 ve RTX 4070 Tİ kullanıcısıyım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "September 16, 2023, 09:54:52 AM",
      "body": "Quote from: eightdots on September 15, 2023, 07:53:16 PMNvidia Corp.’un CEO’su Jensen Huang, NVDA hisselerinin önemli bir kısmını satması büyük tepkiye neden oldu ve sayısız haber yapıldı. Bu satış Nvidia hisselerinin yaklaşık olarak 1 sene boyunca sürekli artmasından sonra geldi. Bu satışlara rağmen, NVDA’nın fiyatı sert düşüş yaşamadı ve yoluna devam ediyor.Demek ki şirket aynı plan dahilinde çalışmaya devam ediyor ve karlılığı her geçen gün artıyorsa büyük hissedarların yaptıkları satışlar olumsuz etki yapmıyormuş. Türkiye'de böyle satışlar olduğu zaman hemen panik havası oluşur manipülasyon mu var diye konuşulurdu.Dünya borsalarına yatırım yapanların en çok tercih ettiği kağıtlardan biri, dünyanın her yerinden yatırımcı çekebilen bir firma Nvidia. Zaten satış rakamlarıyla pazarı domine ettikleri sürece bu ilgi artarak devam edecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}