{
  "id": "topic_5455869",
  "title": "EarnOnVictor",
  "author": "EarnOnVictor",
  "created_time": "June 09, 2023, 03:17:15 PM",
  "content": "I was kinda surprised when I read the news from Financial Times that the cross-section of the UK's MPs that seems to see it as needless to regulate cryptocurrency suggested that it should be viewed as \"a form of gambling\" and be regulated as such.Without relying on my own understanding of \"gambling,\" I quickly used the help of the Oxford Dictionary through Google, and it states;1. Play games of chance for money; bet.2. Take risky action in the hope of a desired result.The second one seems to fit crypto best, so it's clear they know what they are saying.Now, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455869",
  "comments": [
    {
      "author": "KiaKia",
      "created_time": "June 09, 2023, 03:41:00 PM",
      "body": "Crypto is not slots or roulette, where the entire idea is based on luck, this makes it different from gambling, Bitcoin as an example is a digital currency and a good store of value, now trading comes along and it is the only thing that's close to gambling in crypto, you bet on upside or downside of the market movement, if you are right, you win, if not, you lose. Bitcoin is volatile, and this whole gambling idea is pointing to the upside and downside of the volatility, does this makes it a gambling?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 09, 2023, 03:41:24 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMNow, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?No!This can only be applicable to altcoins because, in my opinion, all altcoin investors are gambling with the hope of making a large profit due to uncertainty because they do not know what will happen to the project at any given time.However, Bitcoin investment is distinct because we all understand how transparent the entire Bitcoin process is; therefore, we are not gambling with our money since we are confident that if we are patient, we will be rewarded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 09, 2023, 03:52:14 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PM1. Play games of chance for money; bet.2. Take risky action in the hope of a desired result.The second one seems to fit crypto best, so it's clear they know what they are saying.Now, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?Bitcoin is not gambling, only what it requires is speculation, but some people do not learn about bitcoin price history and speculation but they just want to invest, more especially during bull run when they fomo. Most altcoins are gambling. If you need proof that bitcoin is not gambling, I can give you detailed analysis about it as it seems more to be a store of value over long term period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "June 09, 2023, 04:18:10 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMNow, do you agree that crypto should be seen as a form of gambling? There's nothing gonna change if we agree or not with what they think of crypto as a form of gambling. They are even calling stocks as a way of betting and so, there's not a lot of difference from what they're labeling it.Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMAnd if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?Nothing really.It will just gonna be thought as another risky thing to get involved with. And those that understands it like us, we won't care a lot with what these media or anyone calling it as a form of gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "June 09, 2023, 04:31:56 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMNow, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?In our country, Politician consider crypto as gambling because of the risk involved. Bitcoin is popular here because it was use by many big time ponzi operators that result to huge losses of many people especially from those living on the rural area that doesn’t familiar on Hyip. They are blaming Bitcoin instead of the Hyip because Bitcoin is what they use to invest.Categorizing crypto as gambling is very subjective and it depends on how someone use crypto. Because holding crypto can’t be categorized as gambling since it’s very passive.So far, Crypto is not restricted in our country despite of massive losses from scams. Government is just very eager to advertise their propaganda that crypto is gambling and very high risk.Here’s the news about one of our Senator accused crypto as glorified casino: https://www.gmanetwork.com/news/money/economy/853335/gatchalian-warns-uninformed-vs-investing-in-crypto-calls-it-a-glorified-casino/story/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "June 09, 2023, 04:33:22 PM",
      "body": "They can say that crypto is \"a form of gambling\" because they may not understand it. Crypto is neutral and we use it as an investment. And if someone has the knowledge to choose their coins, they will benefit. The essence of investing in crypto is how we can find more useful information so we can choose the coin.And people don't need to choose a lot of coins because investing in Bitcoin, which is the main coin in crypto, is enough. Maybe those people need to learn and understand what crypto is and how to use it.Traders should also learn more about trading to find coins to ride on when the market is down. UK lawmakers can legislate on crypto but crypto is not a form of gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onset",
      "created_time": "June 09, 2023, 04:50:01 PM",
      "body": "Purchasing fiat is a risky investment too. You never know when a war begins and money gets a very quick and strong price correction. Almost anything we do is a risk and you could say we’re gambling around all the things we do. You risk overcooking when you cook food. You risk swimming in water that’s been contaminated with some sort of weird parasite or whatever.Crypto is an alternative to fiat. It’s risky, I can’t deny that, but it’s not gambling to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 09, 2023, 04:55:08 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PM2. Take risky action in the hope of a desired result.The second one seems to fit crypto best, so it's clear they know what they are saying.They don't. If we take that definition by face value then;• Investing in real estate,• Buying any form of stock,• Starting a business,• Running for a political office,• Even proposing to your partner.All of the above should be considered as gambling and regulated as such.They do not know what they are saying neither are they trying to understand it, they just want to slam some form of regulation on Bitcoin and are finding a way to justify it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wahyuagung26",
      "created_time": "June 09, 2023, 04:59:09 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMNow, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?Crypto is not an embodiment of gambling, Crypto is more directed to digital currency and is also used as a storage place for digital assets that are valuable and have fluctuating properties. and But in fact there are also those who use it as a place to do gambling in digital form. They use Crypto as a tool for them to gamble and it is nothing more than a betting tool.If you examine them using up and down cycles like forex or some kind of Binomo platform maybe they use to do gambling with Crypto assets, and basically it was created not for the purpose of gambling. and this also depends on how the owner of an asset manages, sometimes they bet, and most of the owners choose to invest crypto currency in the form of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "June 09, 2023, 05:02:57 PM",
      "body": "Change the word crypto to Bitcoin maybe this thread will still be here, but if it stays with the word crypto maybe Mod will move to the altcoin board.Bitcoin is not the gamble they think it is because bitcoin has a pretty good value with a history that has what is seen as the notion that bitcoin is gambling?I see that many of those who invest in bitcoin earn quite a lot over a long period of time, they know how the bitcoin cycle is so this should not be considered a gamble, if this is a statement from the government that is what they want because the government is always there to make a way who trust bitcoin to doubt their statement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "June 09, 2023, 05:13:09 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMI was kinda surprised when I read the news from Financial Times that the cross-section of the UK's MPs that seems to see it as needless to regulate cryptocurrency suggested that it should be viewed as \"a form of gambling\" and be regulated as such.Without relying on my own understanding of \"gambling,\" I quickly used the help of the Oxford Dictionary through Google, and it states;1. Play games of chance for money; bet.2. Take risky action in the hope of a desired result.The second one seems to fit crypto best, so it's clear they know what they are saying.Now, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?If so, then these British MPs should classify the stock market and securities as gambling. For this market also falls under these two points of the Oxford Dictionary from Google.Again, these are just the words of two deputies, which doesn't mean that cryptocurrencies must be classified as gambling and regulated in this way. Until such a law is adopted, this is nothing. Also, this is a possible regulation of only one country, which doesn't guarantee that this scenario will be repeated in all other countries.It is necessary to treat the tabloid press more simply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "June 09, 2023, 05:16:52 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMNow, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?No, I totally disagree. Gambling is betting where we bet money on something in order to win money from it. Gamblers expect luck, while traders and investors expect price volatility to make profits. Gambling, trading, investing are not the same although there are some users who do it as if they were gambling on their trade and investment.You probably know what I mean, so I don't agree that crypto is basically gambling. Price speculation is also not gambling as long as there are fundamental factors that are expected to affect prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "June 09, 2023, 05:18:09 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PM[snip]Now, do you agree that crypto should be seen as a form of gambling?Not for Bitcoin, but for other crypto besides Bitcoin it can lead to gambling.Many politicians do not fully understand Bitcoin, but I believe that the British MP you mentioned is most likely not directing the word \"crypto\" in question to Bitcoin but to altcoins.If what is meant is altcoins, we can judge for ourselves how the journey of altcoins will end. Many altcoins are headed for disposal even though there is a small percentage that one can expect a suitable return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GigaBit",
      "created_time": "June 09, 2023, 05:51:46 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMNow, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?Some people think Bitcoin or crypto currency as gambling for a few reasons, but is Bitcoin or cryptocurrency really gambling? We know that Bitcoin is so volatile with in a moment an investor dreams of higher profits, it can be brought down again. This high volatility is what primarily relates Bitcoin to gambling. Generally Bitcoin and gambling are totally different from each other. But there are some altcoins where some have managed to earn so much money by investing. Many altcoins have been dead again with high returns, some have earned big money simultaneously some have lost big amount of money. Considering these aspects, it is very similar to gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 09, 2023, 08:32:43 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMThe second one seems to fit crypto best, so it's clear they know what they are saying.Now, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?I don’t expect the government to actually paint cryptocurrency good to the people because they belief the stereotype will actually work to discourage people away from it. So reading this doesn’t get me surprised. Although I would agree on the second state on some dump and pump coins/tokens I think bitcoin should be taken out of the context. Bitcoin is volatile and also it is a ROI yes, but it doesn’t lose a total value like how a stake amount in gambling goes to zero. Although this days aside holding one’s bitcoin, other trading features have made crypto more like a gambling thing but even at such you can never lose your funds entirely with bitcoin. But the Alticoins and also the NFTs are somewhat a gamble when one hold them or trade in them because they have the ability to go to down to an insignificant amount or grow into huge amounts of money which are the characteristics of gambling",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 09, 2023, 08:34:01 PM",
      "body": "Quote from: EarnOnVictor on June 09, 2023, 03:17:15 PMI was kinda surprised when I read the news from Financial Times that the cross-section of the UK's MPs that seems to see it as needless to regulate cryptocurrency suggested that it should be viewed as \"a form of gambling\" and be regulated as such.Without relying on my own understanding of \"gambling,\" I quickly used the help of the Oxford Dictionary through Google, and it states;1. Play games of chance for money; bet.2. Take risky action in the hope of a desired result.The second one seems to fit crypto best, so it's clear they know what they are saying.Now, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?If cryptocurrencies were officially regarded as a form of gambling and subject to regulation in line with that classification, restrictions or restrictions on cryptocurrency operations and investments could be introduced.  This could include limitations on trading volumes, registration or licensing requirements for exchange platforms, and measures to protect investors from potential fraud or financial risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "June 09, 2023, 08:42:06 PM",
      "body": "Quote from: Hyphen(-) on June 09, 2023, 03:41:24 PMQuote from: EarnOnVictor on June 09, 2023, 03:17:15 PMNow, do you agree that crypto should be seen as a form of gambling? And if this eventually comes through, what should we expect as the constraints it might still bring to the crypto space?No!This can only be applicable to altcoins because, in my opinion, all altcoin investors are gambling with the hope of making a large profit due to uncertainty because they do not know what will happen to the project at any given time.However, Bitcoin investment is distinct because we all understand how transparent the entire Bitcoin process is; therefore, we are not gambling with our money since we are confident that if we are patient, we will be rewarded. Crypto will only fall as gambling if you are investing on the coins that have no real value from the start. However, if you’re into bitcoin, that is not gambling since you know exactly how you’ll be profitable in the long run, unlike gambling that will only make you more susceptible to losses if you stay for long. With bitcoin, you know you’ll have a bright future if you simply follow its rule, that is buy at its low price and sell when the price surges high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wrathofcoins",
      "created_time": "June 09, 2023, 08:46:07 PM",
      "body": "Well, if you took the literally definition of gambling and you expand that, maybe it can be correlated, but mading that ended on all your movements in life also are\"gambling\".So putting money on bonds its gambling because it have a 1% risk of default. I dont think at this point we can have this discuss, this its a discussion from 2012/2015.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "June 09, 2023, 08:48:28 PM",
      "body": "Your investment would be a gamble if you don't have any plans for it. Unlike with gambling, an investor could actually manage the risk such as putting a stop loss depending on one's preference unlike in gambling wherein once you bet n mount, either you lose or win. Such concept confuses many people but they're actually different from one another. The only thing which binds these two concepts is risk of losing money especially in crypto industry wherein volatility is obvious. Proper risk management would yield to profit. Patience would also contribute to the result which I guess is another difference in comparison to gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}