{
  "id": "topic_5412905",
  "title": "mpyllan",
  "author": "mpyllan",
  "created_time": "September 08, 2022, 04:48:19 PM",
  "content": "More nations will adopt Bitcoin, as El Salvador did, according to KPMG. Despite the market downturn, the firm sees strength and increased Bitcoin adoption. KPMG, an audit and tax firm presented a report in which it assures that the bitcoin (BTC) and cryptocurrencies ecosystem has achieved sustained maturity and considers that more countries will follow the example of El Salvador and the Central African Republic in the adoption of the digital asset.  The Pulse of Fintech indicates that mid-year investment \"remained well above all years before 2021\" despite several factors that have affected the market, such as the conflict between Russia and Ukraine, rising inflation in countries such as the United States, and the collapse of Terra,  https://www.vanticatrading.com/post/kpmg-crypto-adoption-is-coming",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412905",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "September 08, 2022, 05:47:08 PM",
      "body": "KPMG’s report (*) is rather broad(ish) in terms of talking about fintechs, but shallow in terms of cryptocurrency, and more specifically, bitcoin. In fact, the reference they make is delimited to the following:QuoteGrowing focus on currency sovereigntyIn the wake of El Salvador adopting Bitcoin as legal tender in 2021, there has been increasing interest in the use of cryptocurrencies in order to support crypto sovereignty and move away from the use of existing currencies like the US Dollar. During H1’22, the Central African Republic became the second country to make Bitcoin legal tender. Other developing nations could follow their lead in H2’22 and beyond.That adds nothing really to what we know, and I was really expecting to see some fact-based potential named, at least on a region basis. Pretty scarce content in the report in relation to BTC.(*) https://assets.kpmg/content/dam/kpmg/xx/pdf/2022/08/pulse-of-fintech-h1-22.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wagmi",
      "created_time": "September 08, 2022, 09:32:28 PM",
      "body": "It is coming in any case. New technology will always prevail against outdated technology. Remember about using horses to travel? At some point, cars were invented and nobody is using horses anymore. Because horses were slow, dirty and had a huge maintenance cost. Cars were much better and replaced horses for travel. It is very similar to crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "September 09, 2022, 08:37:03 PM",
      "body": "Quote from: wagmi on September 08, 2022, 09:32:28 PMIt is coming in any case. It's inevitable and the adoption is already happening. For all of the years that it's been there, these companies are lately realizing the truest potential of it. The reports that are coming out about its imminent massive adoption is already there and they're just like publishing it for the sake of those newbies.But folks that have been here for quite while, already have seen this coming and it's an unstoppable adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}