{
  "id": "topic_5463632",
  "title": "The Cryptovator",
  "author": "The Cryptovator",
  "created_time": "August 17, 2023, 09:03:35 PM",
  "content": "As we're all acquainted with trading signal channels, it's worth noting that I'm well aware that the content found there is often deceptive. I don't personally adhere to any of their advice, but I'd like to share my experience in understanding their tactics and how they deceive people.A few months ago, I was introduced to a free signal channel by someone. I've been observing their posts for a while, marveling at how accurate their forecasts seem to be. They maintain the authenticity of their past predictions by not editing them, which fosters trust and encourages people to join their paid signal group. Recently, I uncovered their strategy. They make predictions for both bullish and bearish trends, spaced a few days apart. They depict upward and downward price movements in separate posts. When the chart goes up, they refer back to their bullish post, and when it goes down, they point to their bearish post. This clever approach lures users into subscribing to their premium channel.When following a trading signal group, it's important to remain vigilant. These groups employ various tactics to capture our attention, so it's essential to be discerning.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463632",
  "comments": [
    {
      "author": "Egii Nna",
      "created_time": "August 17, 2023, 09:31:04 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMWhen following a trading signal group, it's important to remain vigilant. These groups employ various tactics to capture our attention, so it's essential to be discerning.OP This is a great awareness that will help many people in this forum, most especially the newbies and also many other members that are yet to start trading, because mostly people join new trading channels without adequate investigation, but even with your investigation, you have to be more vigilant. If not, you might fall victim to scammers, who will end up running with your money or even having some of your secret keys because these scammers are very intelligent and clever. So thanks for updating us, and we will be more vigilant and careful of those new trading channels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "August 17, 2023, 10:38:11 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMAs we're all acquainted with trading signal channels, it's worth noting that I'm well aware that the content found there is often deceptive. I don't personally adhere to any of their advice, but I'd like to share my experience in understanding their tactics and how they deceive people.Normally traders who risk their money using signals to trade, I’m not classifying them among professionals in trading. My reason is because they are not what trading requires; they only set up signals to work for them, which puts them at a higher risk than people who use their brains to trade. However,  it always surprises me when someone relies on trading without thinking of how trading is supposed to be because the signals can stop working at anytime. I believe when these types of people experience big losses, they will have themselves to blame for the fact that they, and even from day one, I’ve never trusted this issue of using trading signals, so I believe this experience that you share with us can not only help the newcomers but even others who are using signals to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "August 17, 2023, 10:57:34 PM",
      "body": "Thanks for this postIts a reliefI'm always bewildered by their inhumane accuracyIts unfortunate I had to learn this nowDue to my relatively new association with cryptoI used to doubt my analysis because of others signal'sBut accumulated losses helped me learn to trust in myselfTake my losses and do my own research after seeing theirs.I guess that's why #DYOR# can never be underestimated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "August 17, 2023, 11:00:46 PM",
      "body": "It is pretty easy to understand that it is all fake, and the money they stand to make is that which you pay to join the group, think about it, if they had accurate trading signals, they'll not be selling it, they'd just use the signals to trade themselves and make money.Victims of these groups are usually people who are new to trading and the greedy too, they want to make money pretty fast from trading and they think that's how it works. Even if you don't want to do the hardwork of learning how to trade, and you decide to get trading signals from wherever, do not pay for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kodec5",
      "created_time": "August 18, 2023, 08:58:59 AM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMAs we're all acquainted with trading signal channels, it's worth noting that I'm well aware that the content found there is often deceptive. I don't personally adhere to any of their advice, but I'd like to share my experience in understanding their tactics and how they deceive people.A few months ago, I was introduced to a free signal channel by someone. I've been observing their posts for a while, marveling at how accurate their forecasts seem to be. They maintain the authenticity of their past predictions by not editing them, which fosters trust and encourages people to join their paid signal group. Recently, I uncovered their strategy. They make predictions for both bullish and bearish trends, spaced a few days apart. They depict upward and downward price movements in separate posts. When the chart goes up, they refer back to their bullish post, and when it goes down, they point to their bearish post. This clever approach lures users into subscribing to their premium channel.When following a trading signal group, it's important to remain vigilant. These groups employ various tactics to capture our attention, so it's essential to be discerning.OP please do not blame my ignorance can you help me elaborate more on how this signal works? I believe you have passed a very useful message",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 18, 2023, 09:17:01 AM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMAs we're all acquainted with trading signal channels, it's worth noting that I'm well aware that the content found there is often deceptive.Yes they are in most cases because they will always have something to offer their subscribers even when what they are saying is off beat, they are there to make money and probably influence investors but the truth is that we can even perform than they can do if we sincerely knows what we are doing.Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMThey maintain the authenticity of their past predictions by not editing them, which fosters trust and encourages people to join their paid signal group.Let's just imagine how the whole things works here, we are into trading just to earn some more sats and yet subscribed to some centralized services to give us wrong predictions there's no accuracy and certainty in, these people are making money from us and we are not making money from their subscription.Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMRecently, I uncovered their strategy. They make predictions for both bullish and bearish trends, spaced a few days apart. They depict upward and downward price movements in separate posts. When the chart goes up, they refer back to their bullish post, and when it goes down, they point to their bearish post. This clever approach lures users into subscribing to their premium channel.Any user who is not ready to learn will always be in look for platforms and organizations like that for help on how to trade, that isbthe price for ignorance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 18, 2023, 12:10:03 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMAs we're all acquainted with trading signal channels, it's worth noting that I'm well aware that the content found there is often deceptive. I don't personally adhere to any of their advice, but I'd like to share my experience in understanding their tactics and how they deceive people.A few months ago, I was introduced to a free signal channel by someone. I've been observing their posts for a while, marveling at how accurate their forecasts seem to be. They maintain the authenticity of their past predictions by not editing them, which fosters trust and encourages people to join their paid signal group. Recently, I uncovered their strategy. They make predictions for both bullish and bearish trends, spaced a few days apart. They depict upward and downward price movements in separate posts. When the chart goes up, they refer back to their bullish post, and when it goes down, they point to their bearish post. This clever approach lures users into subscribing to their premium channel.When following a trading signal group, it's important to remain vigilant. These groups employ various tactics to capture our attention, so it's essential to be discerning.This is why I am not a fan of these trading signals. Nothing is promised or guaranteed here when they are calling for long, short, buy, sell, etc. I did however tried a trading signal one time from my Polish friend. Sad to say that most of his calls are losses and only a few handful are wins. And on top of that, he’s selling a VIP course which is a paid monthly subscription about his signals that would mean something fishy.Even though he is my friend, but I do not follow him anymore. Not a fan of paid VIP trading signal courses, even if it’s coming from my friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 18, 2023, 12:27:22 PM",
      "body": "Yeah, that's kind of an old trick where you predict more than one outcome and only refer to the one that came true. A more clever way is to fit them into one prediction instead of separate ones by creating a complicated statement that can be interpreted either way Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMWhen following a trading signal group, it's important to remain vigilant. These groups employ various tactics to capture our attention, so it's essential to be discerning.Technically these things are \"pump and dump\" groups not signal groups and usually their main purpose is to get some shitcoins they had bought before, pumped so that THEY can sell and make profit. There used to be some of them active on this forum with specific topics giving \"signals\". Here is the oldest one I could remember and find: https://bitcointalk.org/index.php?topic=765426.0 you can see how he used to scam people specially with his shill accounts.I say stay away from them altogether instead of trying to go in and not be fooled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "August 18, 2023, 12:36:00 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMAs we're all acquainted with trading signal channels, it's worth noting that I'm well aware that the content found there is often deceptive. I don't personally adhere to any of their adviceVery deceptive people and the worst thing about all this is that they trade on demo accounts to create that picture of profitability when in reality  they are dead broke.Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMA few months ago, I was introduced to a free signal channel by someone. I've been observing their posts for a while, marveling at how accurate their forecasts seem to be. They maintain the authenticity of their past predictions by not editing them, which fosters trust and encourages people to join their paid signal group. Recently, I uncovered their strategy. They make predictions for both bullish and bearish trends, spaced a few days apart. They depict upward and downward price movements in separate posts. When the chart goes up, they refer back to their bullish post, and when it goes down, they point to their bearish post. This clever approach lures users into subscribing to their premium channel.From their fraudulent strategy of luring easy subscriptions this is a always win strategy that can only be uncovered if you keep track of these trades over a long period of time like you did! And another indicator to know if these guys are the real deal is if they have a these groups which arent open to the public just run... don't even waste your resources  with them, go learn how to trade for your personal gain as resources are readily available everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "August 18, 2023, 12:53:34 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMA few months ago, I was introduced to a free signal channel by someone. I've been observing their posts for a while, marveling at how accurate their forecasts seem to be. They maintain the authenticity of their past predictions by not editing them, which fosters trust and encourages people to join their paid signal group. Recently, I uncovered their strategy. They make predictions for both bullish and bearish trends, spaced a few days apart. They depict upward and downward price movements in separate posts. When the chart goes up, they refer back to their bullish post, and when it goes down, they point to their bearish post. This clever approach lures users into subscribing to their premium channel.Common thing we can see on a group where they offer trading signals since at first they are showing up some good result to convince people that there signals given is reliable. After that the same on what you experience they are now offering the same scheme called premium signals where they want to lure people and tell that they can earn a earn more using their premium signals. This is the start of scamming so people really need to be aware that this classic scam exist and they should not pay those guys but instead they should learn to trade for theirselves to avoid get scammed by this paid groups.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 18, 2023, 01:13:45 PM",
      "body": "It become worse if the trading signal is in telegram where the admin can easily delete his and someone else post without leaving any trace, so new people will believe his prediction is almost 100% correct. Giving a screenshot and sending a video about his trading experience aren't solid proof, the only solid proof I think is he do a live trading and withdraw it into his bank account, withdrawing the profit is needed to make sure it's a real money, not demo account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "August 18, 2023, 02:04:10 PM",
      "body": "I only believe that there are people who really master trading and always profit from every prediction. they will use the prediction itself to make them rich. not looking for people to join the group, let alone for paid channels.at first, they made a free group. but with predictions and also limited discussion. and they will offer paid groups for more complete discussions and predictions with people they call experts.We have encountered many such schemes, don't ever be fooled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 18, 2023, 02:36:28 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMThey maintain the authenticity of their past predictions by not editing them, which fosters trust and encourages people to join their paid signal group. Recently, I uncovered their strategy. They make predictions for both bullish and bearish trends, spaced a few days apart. They depict upward and downward price movements in separate posts. When the chart goes up, they refer back to their bullish post, and when it goes down, they point to their bearish post. This clever approach lures users into subscribing to their premium channel.This method only deceives new members and fails to deceive old members in their channel like you.It only impresses people who don't follow their channel signal and only watch signals to asses signal accuracy. If for instance, I follow a signal and buy or sell it, I will do know result of my position and accuracy of given signal. If I only follow their signals and only use memory to assess their signal accuracy, I still can remember what signal they call and how it ends within a few days.But it's interesting to know the deceiving method and your sharing will help many newbies who rely on signal groups.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "August 18, 2023, 06:13:22 PM",
      "body": "You should never join these trading signal channels. They are not worth it. There are many users on TradingView who provide their perspective on various SYMBOLS for free. Here is how you can access them. https://www.tradingview.com/markets/cryptocurrencies/ideas/Here you will see most upvoted recent ideas related to Bitcoin and Ethereum, you can see how they are calculating and it's upto you to agree or not. Much better than following or paying for trade signals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 18, 2023, 06:20:58 PM",
      "body": "Quote from: ImThour on August 18, 2023, 06:13:22 PMYou should never join these trading signal channels. They are not worth it. There are many users on TradingView who provide their perspective on various SYMBOLS for free. Here is how you can access them. https://www.tradingview.com/markets/cryptocurrencies/ideas/Here you will see most upvoted recent ideas related to Bitcoin and Ethereum, you can see how they are calculating and it's upto you to agree or not. Much better than following or paying for trade signals.This is what I’m using too on my trade since tradingview charter is very open for discussion about their TA. They provide too a detailed explanation and solid charts to support their predictions unlike telegeam signal channel that typically drop a buy signal with only buying price as info.The only disadvantage on tradingview charters is sometimes you will be confused once you read others idea especially when they are conflicting to each other while they both provide a reasonable explanation on how they come up with their prediction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "August 18, 2023, 07:18:42 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMWhen following a trading signal group, it's important to remain vigilant. These groups employ various tactics to capture our attention, so it's essential to be discerning.People who do observe not observe so well will not quickly be able notice this gimmick. Trading signal channels are usually started by people who have plans to make money from fees people will pay to join the signal group, so their intentions will not always be good because they will want to do everything possible to make sure that people who join them stay and that more people join them in the group. If I will trade, I will like to learn and be independent of the need for a signal group.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 18, 2023, 07:27:41 PM",
      "body": "LoL, this is not a new trick, @Oshosondy knows better  .  I have also come across two threads where same issue was  talked about. Most of those signal providers are only using those fake signal to decive traders into paying for subscription and at the end of the day, they are even earning more than you by just selling those fake signals, while you (as the trader) is buying fake signal and having losses in your trade, you are enriching those moda fuckers. fuck'm all, fuck trading signal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 18, 2023, 09:38:02 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on August 18, 2023, 07:27:41 PMLoL, this is not a new trick, @Oshosondy knows better  .  I assure you, this is a new experience for me. Despite frequently encountering losses in my trading based on my experience, I find contentment in my choices as they are entirely my own, uninfluenced by external factors. There are numerous ways that can lead us astray, but due to my honesty, I sometimes struggle to promptly identify deceit. Having recently acquired this knowledge, I am eager to share it with the community. This way, those unfamiliar with these types of cheating can make well-informed decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "August 18, 2023, 09:57:58 PM",
      "body": "Quote from: The Cryptovator on August 17, 2023, 09:03:35 PMA few months ago, I was introduced to a free signal channel by someone. If you get a free product, then you are the product. It should be pretty obvious that no one will share accurate predictions or insider information for free. Instead these channels will typically mislead beginner traders into investing in shitcoins. You just can't trust anyone in trading, it's a zero sum game with no cooperation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}