{
  "id": "topic_5446232",
  "title": "mailsats",
  "author": "mailsats",
  "created_time": "March 25, 2023, 03:32:21 AM",
  "content": "I have been feeding this cat for years... this outside cat who visits... every day around dinner time...I am in a situation now where I must move.I feel bad now, because there is no guarantee that the people who will soon occupy my place will feed this cat if it comes around...The cat was doing fine before I move in, so maybe it will be OK again? I feel bad because I figure he has gotten used to my daily offerings.Has anyone else been through this, or can offer advice? Am I worrying too much?Thanx",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446232",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "March 25, 2023, 07:39:41 PMLast edit: March 25, 2023, 10:43:09 PM by DeathAngel",
      "body": "Is the cat owned by somebody else & is it fed by them, if you are aware? If not then if you are able to, maybe you could take the cat with you to your new home. If you have been feeding the cat for years then you have obviously formed a bond with it. Maybe if it was possible you could take the cat with you to the new home. I’m a sucker that would probably really consider taking the cat with me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Qiubell5",
      "created_time": "March 25, 2023, 11:28:06 PM",
      "body": "You feed the cat for years. and i thought, you really love that cat. How about you just take the cat with you. if you don't take the cat with you, when you move to a new house. You will definitely feel anxious and worried. so I thought just bring the cat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mailsats",
      "created_time": "March 26, 2023, 05:15:18 AM",
      "body": "Quote from: Qiubell5 on March 25, 2023, 11:28:06 PMYou feed the cat for years. and i thought, you really love that cat. How about you just take the cat with you. if you don't take the cat with you, when you move to a new house. You will definitely feel anxious and worried. so I thought just bring the cat.Here's the thing, the cat has been in the area before I moved in. So it considers the area ( outdoors ) it's home...It's a townhome complex.So yes, it has gotten used to the food I give it... but if I just relocate it when I move, that seems like it would also be a bad thing to do, because it has lived in this area for years, and considers it home ( I have no idea if it gets food from other people and/or hunts ).I am going to send a photo of it to the strata and ask if they know if someone owns it.( I refer to it as 'it' not he/she because I don't know it's gender )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "March 26, 2023, 05:22:46 AM",
      "body": "I do not think you need to worry about this cat. Because he was doing fine before you moved in he will survive on his own. It is sad to leave him but if you do not take him with you you can not feel bad about him.He will miss the daily offerings yes. If you are lucky then the next person who lives in your place will leave him offerings. If you want you can leave a letter for the next people so if this cat comes looking for his offerings he does not get kicked away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mailsats",
      "created_time": "March 26, 2023, 05:41:50 AM",
      "body": "Quote from: mich on March 26, 2023, 05:22:46 AMI do not think you need to worry about this cat. Because he was doing fine before you moved in he will survive on his own. It is sad to leave him but if you do not take him with you you can not feel bad about him.He will miss the daily offerings yes. If you are lucky then the next person who lives in your place will leave him offerings. If you want you can leave a letter for the next people so if this cat comes looking for his offerings he does not get kicked away. Ya, I mean I don't know if yanking it out of it's environment ( when I move ) is the best idea...yes, the cat would get food... but it would have to adapt to a whole new area... and I don't think turning it into an indoor cat after years of being an outdoor cat is a good idea.Ya I like the idea of leaving a note for the new tenants, it would be nice if they were cat people, but there's no guarantee... I think most people would see it as an unnecessary expense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "March 26, 2023, 06:08:29 AM",
      "body": "The cat might be sad for a few days but it will eventually move on. They are intuitive enough to figure out that new people are now living at this house. Cats are natural hunters so they will know how to survive when you are gone. You are probably not the only person in your area who feeds stray cats so I am sure it will be fine and find a new place to visit for dinner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mailsats",
      "created_time": "March 26, 2023, 08:09:45 AM",
      "body": "Quote from: FinneysTrueVision on March 26, 2023, 06:08:29 AMThe cat might be sad for a few days but it will eventually move on. They are intuitive enough to figure out that new people are now living at this house. Cats are natural hunters so they will know how to survive when you are gone. You are probably not the only person in your area who feeds stray cats so I am sure it will be fine and find a new place to visit for dinner.Thanks... I hope you're right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "March 26, 2023, 08:58:22 AM",
      "body": "cats are survival , they can be stray all their life and can find food even in trash cans. so don't pitty yourself you have done great for the year of feeding him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "March 26, 2023, 09:59:13 AM",
      "body": "she will be fine mate , someone will feed him after you.Quote from: FinneysTrueVision on March 26, 2023, 06:08:29 AMThe cat might be sad for a few days but it will eventually move on. They are intuitive enough to figure out that new people are now living at this house. Cats are natural hunters so they will know how to survive when you are gone. You are probably not the only person in your area who feeds stray cats so I am sure it will be fine and find a new place to visit for dinner.Yeah but eventually she will move on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Klima Dorres",
      "created_time": "April 05, 2023, 05:49:48 AM",
      "body": "So, it is important to note that cats are tough animals, and they are also skilled hunters.If the cat was fine before you started feeding it, it will likely be able to adapt to changing circumstances and find a way to survive on its own. It's a normal situation.So, even if we don't feed it, the cat can survive unless it's an emergency, for example, a sore leg. The point is we don't know whether after we feed it, the cat eats something again or not. Can't control where they go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shielding2002",
      "created_time": "April 11, 2023, 09:57:00 AM",
      "body": "I think you should take the cat to your new apartment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Khafsat Basayev",
      "created_time": "April 17, 2023, 02:25:47 PMLast edit: May 11, 2023, 07:22:26 AM by Khafsat Basayev",
      "body": "My personally, it's possible that the cat was doing fine before you moved in, so maybe it will be okay again without your daily offerings. But I can see why you're worried about the cat's well-being. Also might be a good idea to try and find someone who can take over feeding the cat once you move. Maybe a neighbor or someone in the area who you know is an animal lover.I suggest that you try to make arrangements for the cat's care before you move, so that you can feel reassured that the cat will have a food source. And if you can't find anyone to take over feeding the cat, it might be worth considering reaching out to a local animal shelter or rescue organization for advice on how to best help the cat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "April 17, 2023, 03:59:20 PM",
      "body": "Quote from: Shielding2002 on April 11, 2023, 09:57:00 AMI think you should take the cat to your new apartment I think Op has the right to this, since he/she's taking care of the animal better than what it might be getting elsewhere... and it also depends on whether the animal is willing to follow him, if not, I will just advise he begins to reduce the amount of food or care he gives it until the day he leaves. That will give it the opportunity to adjust gradually and able to cope when it nolonger sees its care giver.I once in a while take care of a stray mother cat and her child but I let them be for now because they are ferocious hunters and can be quite independent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}