{
  "id": "topic_5470959",
  "title": "Miles2006",
  "author": "Miles2006",
  "created_time": "October 19, 2023, 07:24:13 PM",
  "content": "20 October 2020A day Nigerians will never forget, 3 years remembrance, ENDSARS. Dear Nigerians remember that on this day 20th of October 2020 the endsars movement was formed to fight the suffering, harassment, unjust detentions, continuous abuses.Some Nigerians youth who protested peacefully because they were tired of the abuses and suffering were murdered and brutalize by angry soldiers at lekki toll gate.I kept on wondering who sent the gun men to murder and injure peaceful protesters but no answer. Today we honour the youths and heros who sacrificed there lifes at the endsars toll gate in lekki.On this sombre three years anniversary the youths of Nigeria demands: release all political prisoners accountability and compensation for grieving families and including dignified burials. permanent memorial at lekki toll gate release of all judicial inquiry reports  prosecution: youths demands justice for souls lost on 20 October 2020Rest in peace to those we lost at lekki toll gateSource: https://socialistworkersleague.org/2023/10/07/endsars-3rd-year-memorial-a-resounding-call-for-justice-and-unwavering-remembrance-of-our-heroes/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470959",
  "comments": [
    {
      "author": "Justbillywitt",
      "created_time": "October 20, 2023, 08:09:44 AM",
      "body": "R.I.P to all Nigerians who lost their lives at the Lekki toll gate. It's such a shame that what the Nigerian you were demanding for for 3 years ago are still unresolved. I pray that one day Nigeria will be liberated from the hands of those that are destroying the country. What baffles me is that some youths will still be praising these old leaders who has continually been recycling themselves into political offices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "October 20, 2023, 09:08:53 AM",
      "body": "Rest in peace to every young Nigeria youth who fought on that day for the betterment of the country,  I believe efforts that has being made to make the country is not a wasteful one. The country will surely be a place someday every common Nigeria wish. I believe Nigeria will get to a stage that it won't be comfortable for bad politicians to stay anymore. A time is coming when citizens we justice,  we shouldn't give up as if the effort we put to make the country is of waste, victory don't just happen in a day. Victory is as a result of different struggles,  so I believe say one day this country go better,  it will be a country we all go dey proud to call it our own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "October 20, 2023, 10:24:19 AM",
      "body": "We will never forget 20.10.20, the date democracy, demand for good governance and human right was killed in Nigeria. We missed the opportunity for our voices to be heard and the 1% elite assume immutable and immortality same day. The electoral violence of 2023, abuse of office, human right abuse and police brutality have come to stay just because the mission of 20.10.20 failed. The same people that ordered the killings are now in power, where do we run to? I don't know how long darkness will rule over us! I am not seeing any help coming soon because all the institutions and agencies have been bought. Our solace is now on God even though He has given us everything with which to prosper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uche6215",
      "created_time": "October 20, 2023, 04:13:42 PM",
      "body": "The killing of the Nigerian youth in that year was the full indication of the fail state. Nigerian government don't want to develop the country and dat was y they use the military to killed the youths. That protest was for the good of the Nigerian police and the military but they misunderstood the real meaning of the protest and killed them. That killing pain the meaningful Nigerian and not the president or it supporters. Responsible women, and men cried that day. And that shows that Nigeria is not for the betterment of it citizens for to kill them.There was a strong unity in the among the Nigerian youth and they work together to achieve the purpose of the protest. I pray for the loss souls, May their should rest in peace Amen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "October 20, 2023, 06:21:53 PM",
      "body": "I want to especially send my sincere condolences to the family of those young people that were killed during the Lekki toll gate saga and a rest well message to the souls of the deceased on that unfortunate incident. What actually transpired in that incident is a bizarre adventure to me and I don't know why we had to lose those young guys to that incident. Everyone had it's own opinion to the incident but my humble opinion was that they could have avoided that violence if they had went back home immediately after the peaceful protest. Some celebrities were at that event but they did not encounter the incident because they left for their homes after the protest was said to have been called off but the bitterness in some of the youths could have triggered those casualties. We also heard that the project was highjacked by some bad influences that were sponsored to cause damages but I think God knows best what actually happened.Regardless of whatever it was that happened, the army is nor suppose to shoot. You don't shoot innocent and unharmed citizens in the name of provocation. That's a bad decision that the army made.I also don't think the government handled the case properly. There's not enough transparency and wide condemnation of the incident and the decision of the army by the government itself.However the case, it sent some messages to the government itself and the uniform men to be more professional in their duty and value for life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baki202",
      "created_time": "October 20, 2023, 10:08:24 PM",
      "body": "Quote from: Justbillywitt on October 20, 2023, 08:09:44 AMR.I.P to all Nigerians who lost their lives at the Lekki toll gate. It's such a shame that what the Nigerian you were demanding for for 3 years ago are still unresolved. I pray that one day Nigeria will be liberated from the hands of those that are destroying the country. What baffles me is that some youths will still be praising these old leaders who has continually been recycling themselves into political offices.A lot of our peoplr done put effort to put this country in order and even people self die ontop this matter but the Government they find by all means to stop people from having their say but, that lekki toll gate matter pain me oh because they shoot their citizens ontop say them they try fix things wey don spoil for country but has they no want truth, them they use there power oppress innocent people, i believe one thing oh all na time, even politicians go hear am when revolution burst na that time their eyes go clear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "October 20, 2023, 10:24:09 PM",
      "body": "Quote from: Miles2006 on October 19, 2023, 07:24:13 PM20 October 2020A day Nigerians will never forget, 3 years remembrance, ENDSARS. Dear Nigerians remember that on this day 20th of October 2020 the endsars movement was formed to fight the suffering, harassment, unjust detentions, continuous abuses.Some Nigerians youth who protested peactefully because they were tired of the abuses and suffering were murdered and brutalize by angry soldiers at lekki toll gate.I kept on wondering who sent the gun men to murder and injure peaceful protesters but no answer. Today we honour the youths and heros who sacrificed there lifes at the endsars toll gate in lekki.On this sombre three years anniversary the youths of Nigeria demands: release all political prisoners accountability and compensation for grieving families and including dignified burials. permanent memorial at lekki toll gate release of all judicial inquiry reports  prosecution: youths demands justice for souls lost on 20 October 2020Rest in peace to those we lost at lekki toll gateSource: https://socialistworkersleague.org/2023/10/07/endsars-3rd-year-memorial-a-resounding-call-for-justice-and-unwavering-remembrance-of-our-heroes/Omo it's still fresh in my memories. I've always asked myself, what if I was there protesting like others too, what would have happened to me.Omo till now, SARS still dey worry people for road, it's as if they didn't learn anything from that protest in 2020. R.I.P to our hero's that died on that day.  Whenever I remember that day, it sends chills down my spine 😭, people killed for merely protesting, protest is a civil right in every civilized society, but Nigeria police and army see am as a challenge them, they just ended the lives of young Nigerian for nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roseline492",
      "created_time": "October 20, 2023, 10:50:53 PM",
      "body": "That particular yeah of End SARS can never be forgotten easily, what pains me the most is that even after they killed those innocent people the federal government did not even care to abolish the sars. Instead what they did was to change there name to another thing, it was so sad for those innocent people to have died in vain and up till now the federal government has not apprehended any of those hoodlums. It was actually a pity the way they died so painful, but however they will always be remembered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}