{
  "id": "topic_5400044",
  "title": "Jossque",
  "author": "Jossque",
  "created_time": "May 24, 2022, 06:28:31 PM",
  "content": "Benim severek dinlediğim bir grup olan MvÖ nft koleksiyonu çıkarıyor.https://nft.morveotesi.com/https://twitter.com/mvoofficial/status/1529152707134619649",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400044",
  "comments": [
    {
      "author": "Retro Harmony",
      "created_time": "May 24, 2022, 07:21:28 PM",
      "body": "Elbette grubun fanatikleri vardır buna bir şey demek doğru olmaz ama grup denilince Türk olarak aklıma gelen Eurovision yarışmasında birinci olmadığı için hala konuşulan manga ve en iyi gruplardan ayna geliyor. Bunlar nft çıkarsa belki daha fazla satardı. Mor ve ötesi ne kadar satılır bilemiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "May 24, 2022, 07:35:23 PM",
      "body": "Quote from: Retro Harmony on May 24, 2022, 07:21:28 PMElbette grubun fanatikleri vardır buna bir şey demek doğru olmaz ama grup denilince Türk olarak aklıma gelen Eurovision yarışmasında birinci olmadığı için hala konuşulan manga ve en iyi gruplardan ayna geliyor. Bunlar nft çıkarsa belki daha fazla satardı. Mor ve ötesi ne kadar satılır bilemiyorum. Manga 4-5 ay önce ücretsiz mint edilen nft koleksiyonu çıkarmış sanırsam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Konkordato",
      "created_time": "May 25, 2022, 06:38:52 AM",
      "body": "Nereye evrilecek bu NFT olayı bilmiyorum.. Amerikadaki sanatçıar da artık kendi NFT'lerini oluşturmaya başladı. Ben hala bu olaya sıcak bakmıyorum. Ekosisteme hiç katkı sağlamayan bir olay. Kolay para kazanalım hızlısından para kazanalıma döndü bu işler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "May 25, 2022, 01:36:35 PM",
      "body": "Hemen hemen Dünyadaki bir çok sanatçı PR calışmaları için NFT koleksiyonlarını üretiyorlar ardından da satışa çıkarıyorlar. Satışa çıkan NFT'lerden çok kazanç ettiklerini zannetmesem de bu sanatçının popülerliği yaptığı işlere göre bir çok parametreye göre değişkenlik gösterir. NFT'lerin sanatçılar için iyi bir araç olduğunu rahatlıkla söylüyebilirim. Mor ve ötesi grubunun NFT'leri çok sınırlı üretmesi ve paket satın alanlara ekstra hediyeler vadetmeleri ekstra güzel olmuş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "May 25, 2022, 07:41:37 PM",
      "body": "Quote from: Jossque on May 24, 2022, 06:28:31 PMBenim severek dinlediğim bir grup olan MvÖ nft koleksiyonu çıkarıyor.https://nft.morveotesi.com/https://twitter.com/mvoofficial/status/1529152707134619649Şu MvÖ'yü Mazhar Vuat Özkan diye okudum ya  Asıl Deli NFT'si yapacaklardı bir tane olacaktı bir ben deli nft'sine sahibim deme ayrıcalığına sahip olacaktı alan kişi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 26, 2022, 08:00:14 PM",
      "body": "Bu tarz olayları ben birçokları gibi adam skme olarak görmüyorum açıkçası. Bana biraz hayranlara yani fandom a hediye olarak düüşünülmüş gibi geliyor yoksa Türkçe müzik yapan Türk grupların milyonlarca dolar kaldırabileceğini sanmıyorum bu işten. Maksat haber olmak, medyada biraz ön planda yer almak, 3-5 fanatik hayranı mutlu hissettirmek vesaire olmalı. Başkaca bir şey değil. PR yani.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "illetyus",
      "created_time": "May 27, 2022, 08:26:53 PM",
      "body": "Quote from: Pierre 2 on May 26, 2022, 08:00:14 PMBu tarz olayları ben birçokları gibi adam skme olarak görmüyorum açıkçası. Bana biraz hayranlara yani fandom a hediye olarak düüşünülmüş gibi geliyor yoksa Türkçe müzik yapan Türk grupların milyonlarca dolar kaldırabileceğini sanmıyorum bu işten. Maksat haber olmak, medyada biraz ön planda yer almak, 3-5 fanatik hayranı mutlu hissettirmek vesaire olmalı. Başkaca bir şey değil. PR yani.Piyasa için çok faydalı oluyor. Kitlesel bir benimsenme söz konusu. Ne kadar sanatçı varsa piyasaya giriyor. Ve bu sanatçılar kendi fan kitlilerine bir şeyler satmaya çalışarak kripto uzayına yeni kullancıların katılmasını sağlıyorlar. 2020'den beri söylüyorum ve hala aynı düşüncedeyim. NFT dünyası coin-token dünyasından daha büyük olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}