{
  "id": "topic_5408013",
  "title": "FMCPAY_GLOBAL",
  "author": "FMCPAY_GLOBAL",
  "created_time": "July 29, 2022, 08:35:21 AM",
  "content": "Bitcoin (BTC) delivered a swift six-week high on July 29 as the aftermath of the latest macro developments boosted risk assets.Data from Cointelegraph Markets Pro and TradingView captured local highs of $24,445 for BTC/USD on Bitstamp, its best since the week beginning June 13.After consolidating around $23,000, bulls got a second wind to propel the market higher on the back of the United States Federal Reserve's latest rake hikes and GDP data confirming that the U.S. was in a recession.Risk assets outperformed across the board, with Bitcoin and altcoins joining gold, giving traders and analysts cause for positivity on the outlook. (Source: Cointelegraph)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408013",
  "comments": [
    {
      "author": "P2PECS",
      "created_time": "July 29, 2022, 08:38:23 AM",
      "body": "I like the price to recover but to call this recent rise a bull run is to have no idea what you are talking about or to want to mislead people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "July 29, 2022, 08:57:41 AM",
      "body": "It looks like an increase in the price of bitcoin or crypto prices is likely to occur in the next few days, but you still have to be aware that in general the crypto market is still sideways, not yet a significant bull run.and I also read the latest news and announcements from the Fed which excited investors to enter the crypto market,and so far there has been no negative sentiment that could hit the market. And what you have to watch out for is that later many traders or even whales will start accumulating profits or profit taking, thus making sales that make crypto prices fall a little.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 29, 2022, 09:52:37 AM",
      "body": "Until bitcoin price breaks a semi-significant price level (or a resistance) such as $25k and remains above it, we can not call this a \"bull run\" just like when it goes back down to touch $20k but won't go below it we can't call it a \"bear market\". It is just fluctuations during an accumulation phase creating a sideways market. This could take a while and it doesn't need any reason to happen either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 29, 2022, 09:58:59 AM",
      "body": "This would be fairly early for a stable price rise (bull run), even by standards of previous cycles that were occurring in more or less stable (stabler) economic times compared to now. This is a whole new ballpark we are playing in with the looming economic crisis all around the world and the war causing additional problems, I doubt people are flocking into any investments, let alone crypto, so any stable rises would be highly unlikely at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 29, 2022, 11:56:22 AM",
      "body": "If risk assets were performing well/in correlation with bitcoin then they'll probably be correlating for longer.I'm not sure there's much fundamentally backing the growth increases though (except attempting to protect wealth maybe). So I don't think anyone would be reasonable to be short term bullish until we get past a resistence like the one at $28-30k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "July 29, 2022, 12:30:41 PM",
      "body": "Quote from: P2PECS on July 29, 2022, 08:38:23 AMI like the price to recover but to call this recent rise a bull run is to have no idea what you are talking about or to want to mislead people. Maybe the price hasn't started to recover because it's still under $30k, let alone $40k.But bitcoin's move to $23k now shows a good move because bitcoin still has a big chance to rise again this year.But it's all still a mystery because no one knows when the bull run will come again.But if the price can go up to $25k-$30k in the next month or even get back to $40k, that's a sign for bitcoin to recover.So we just wait for it to come while trying to buy at low prices and keep it or buy at low prices and sell at high prices to make a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 29, 2022, 01:29:29 PM",
      "body": "Quote from: P2PECS on July 29, 2022, 08:38:23 AMI like the price to recover but to call this recent rise a bull run is to have no idea what you are talking about or to want to mislead people. Have to agree here, despite the encouraging recovery so far, this is far from a bull run. The interesting aspect is that price is near to closing back above the 200 WMA ($22.8K) as well as 50 Month MA ($22.6K), indicating that the current bear trend could be coming to an end. But this doesn't imply a bull market is to come either, only a relief rally anywhere up to $50K, a \"mini bull-run\" as it were.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "July 29, 2022, 08:57:28 PM",
      "body": "This 6-week high was not enough to call it Bullrun or an indication of its coming. Not that I say it was too early but the price is not at the level and even if it reaches $30k this quarter or this year, that is still far from the last Bullrun record. Whatever the reason for the current pump and the market remains in bear condition. Can imagine how long we have been like this in a previous bear season, so probably it happens again this time! The prices wen high and low due to some market influence but that was not enough to say that we are in the full recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 29, 2022, 09:25:48 PM",
      "body": "Quote from: P2PECS on July 29, 2022, 08:38:23 AMI like the price to recover but to call this recent rise a bull run is to have no idea what you are talking about or to want to mislead people. Probably a breakout and a possible bull run but its too early to say.We might see some corrections along the way since BTC is still having a hard time to break the resistance. Maybe OP is talking about the future trend, since bull run will come at any time. With the given chart, the volume is quiet interesting, we see a huge spike but again its not enough to call this a bull run, it may still take time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "July 29, 2022, 09:26:45 PMLast edit: June 11, 2023, 11:42:32 PM by STT",
      "body": "Its not yet proven but BTC is teetering on the brink of closing the gap to 30k area.   I dont imagine we go much further then 30k in one go, perhaps a peak above then reverse back type of move.    Problem is or the required movement I really need to see is a lower Dollar and this relates to solid hard event news, its not a speculative move but actual macro economic worries like energy shortage in the EU economy or YEN unwinding vs Dollar.   If these things dont move we dont get the weaker Dollar, BTC can move with a strong dollar but its a mighty weight on its back I think so expect compressed prices whatever range we are in.Dollar index peaked, its fallen and for me to expect proper gains to expand in BTC or any speculative asset I need DXY below 105.   For us to be off to the races with all the big hopes of much higher BTC then the blue line needs to be overhead and this is negative trend for Dollar which we broke with Dollar strength this year.   So bigger BTC prices imo dont occur with DXY above 97 and I doubt any rally can sustain into medium term with us above 105.    I do presume DXY is a fair guide to risk sentiment and speculative Dollar flow otherwise we are walking not running.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 29, 2022, 11:55:00 PM",
      "body": "\"Bull run\" means a medium to long-term trend, something that lasts at least 3 months, but generally 6+ months. A short term positive term is known as a \"rally\". We currently have a relief rally - a bounce back after a very sharp decline. If the price again drops to them same low, it is known as a \"dead cat bounce\". Just like there are corrections in a bull market, there are relief rallies in a bear market. Right now it's a bit too early to say that a bull market has started or that the price already touched the bottom of the cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "July 29, 2022, 11:59:32 PM",
      "body": "Quote from: bitzizzix on July 29, 2022, 08:57:41 AMIt looks like an increase in the price of bitcoin or crypto prices is likely to occur in the next few days, but you still have to be aware that in general the crypto market is still sideways, not yet a significant bull run.and I also read the latest news and announcements from the Fed which excited investors to enter the crypto market,and so far there has been no negative sentiment that could hit the market. And what you have to watch out for is that later many traders or even whales will start accumulating profits or profit taking, thus making sales that make crypto prices fall a little.^ Because it is too early to celebrate about BTC bull run.The market was experienced a sideways these days probably because we have heard different good news about BTC but it does not mean we are in a bull trend right now. It could be next week BTC will drop again because there are too many weak people who will probably cut their profit during a small BTC price up. I would advice anyone to buy BTC in a DCA way it will probably surely have a profit or hold it in a long term purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "July 30, 2022, 12:07:34 AM",
      "body": "I really wouldn't expect anything less from bitcoin. It could go skyrocket from here, or it could crash and be 15k as well, either option is feasible at this point. Lets just realize that bitcoin is unpredictable, if you can accept that then its going to be easier to do whatever else we can do from there on out. I see this as an absolute win for the time being, and yes its going to take a while before we could move on further to a higher price, but at the very least this could be a great start for it. Basically, what I mean right now is that we are doing just fine, its not amazing, but a month from now could mean that we could be 30k and then a month later 45k, thats how it all starts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "July 30, 2022, 12:14:16 AM",
      "body": "But could anyone confirm the bear market is over? By what I  mean is that is the price not going to drop below 17K anymore? When the speculators published some postsaboutBTC going below $17k weeks ago, there must have been holders dumping in anticipation of that next support to break. 6 Weeks of uptrend seem a go signal to buy for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 30, 2022, 01:47:44 AM",
      "body": "Quote from: P2PECS on July 29, 2022, 08:38:23 AMI like the price to recover but to call this recent rise a bull run is to have no idea what you are talking about or to want to mislead people. I think the same, I mean a bull run is a sustained growth in the price of an asset and the growth that we are seeing is nowhere near enough to classify the current movement as a bull run, it is a nice recovery and that is it, however I see this recovery with good eyes as it gives bitcoin some breathing room, when the price was below the 20k level every single small drop in the market seemed as if it could have the potential to cause a new crash, but now bitcoin has some margin to maneuver and maybe we can avoid seeing a new low during this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "July 30, 2022, 02:16:35 AM",
      "body": "Quote from: dragonvslinux on July 29, 2022, 01:29:29 PMQuote from: P2PECS on July 29, 2022, 08:38:23 AMI like the price to recover but to call this recent rise a bull run is to have no idea what you are talking about or to want to mislead people. Have to agree here, despite the encouraging recovery so far, this is far from a bull run. The interesting aspect is that price is near to closing back above the 200 WMA ($22.8K) as well as 50 Month MA ($22.6K), indicating that the current bear trend could be coming to an end. But this doesn't imply a bull market is to come either, only a relief rally anywhere up to $50K, a \"mini bull-run\" as it were.Another good post mate, yeah, so far the we are still above both the 200 WMA and the 50 month MA. So that is a good indication as least that we are relieved that we won't see a huge price decreased, not unless there is another negative news that will affect the price drastically.So hopefully as we go on the last quarter of the year, we will have this so called mini bull run. If we did then you think that the 4 year cycle is going to be broken?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "July 30, 2022, 09:26:32 AM",
      "body": "Quote from: bittraffic on July 30, 2022, 12:14:16 AMBut could anyone confirm the bear market is over? By what I  mean is that is the price not going to drop below 17K anymore? When the speculators published some postsaboutBTC going below $17k weeks ago, there must have been holders dumping in anticipation of that next support to break. 6 Weeks of uptrend seem a go signal to buy for me.For now everything is still speculative. It may be too early to judge the market to have finished the bear run because of 5/6 weeks recovery. As it is, it is looking like trap not until the price stables up. Two days ago the price also dropped back to $22k , for me I will just keeping watching the move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inanilujimi",
      "created_time": "July 30, 2022, 10:24:07 AM",
      "body": "It's still not over $40k, we've already seen the 2021 bullrun and it's hard to see the market especially bitcoin gaining that momentum again. maybe for 2024 or 2025 we could see a bullrun back. for me this is part of a bear market recovery, hopefully by the end of the year btc can break through $35k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 30, 2022, 10:50:07 AM",
      "body": "Quote from: bittraffic on July 30, 2022, 12:14:16 AMBut could anyone confirm the bear market is over? By what I  mean is that is the price not going to drop below 17K anymore? When the speculators published some postsaboutBTC going below $17k weeks ago, there must have been holders dumping in anticipation of that next support to break. 6 Weeks of uptrend seem a go signal to buy for me.I think to be able to say that we are out of the bear market, we need some validations, maybe in the range of $40k-$50k. At least that is more than 50% of the lower low of $17k. So it's a long way to go for us, we barely made it to $25k in this last small runs in the last week or so. And we can say that we are still not out of the woods yet, we need to progress more to the price that I mentioned. So we will have to wait and see, we still have 5 months to improved the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}