{
  "id": "topic_5495872",
  "title": "MarissaLopez",
  "author": "MarissaLopez",
  "created_time": "May 09, 2024, 12:36:04 PM",
  "content": "Bitcoin is recorded as the first and most well known crypto currency in the world.not disputing the fact that there have been so many controversies surrounding it,it is still believed that Bitcoin will always survive and continue to be a leading form of digital currency cutting across the World globally.   Although there are certain risk factors involved with Bitcoin but it's not been limited by that and most likely will tend to survive and thrive in the future,moreso reasons why Bitcoin will likely survive are thus;1. Decentralized Nature2. Security3. Limited supply 4. Potential adoption.Decentralized Nature: This means that no single entity such as a government or bank has control over it,and this makes it resistant to corruption or interference by any centralized authorities.Security: Bitcoin uses cryptography to secure the transactions that happens in the network making it highly resistant to fraud and hacks.Limited supply:  Bitcoin has a fixed supply of coins of over 21 million that makes it not inflated and scarce like fiat currencies.Potential adoption:  Generally a massive number of business owners and individuals are accepting Bitcoin as a mode of payments thereby reducing it's demise.     In conclusion since Bitcoin has survived such attacks from government ,hacks,criticisers, scammers,covid, insurgency etc.bitcoin will still survive in the years to come even if the World war begins and it will do so due to its decentralized Nature,technological advancement and lots more and thus skyrocket to being the leading digital currency.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5495872",
  "comments": [
    {
      "author": "Yamane_Keto",
      "created_time": "May 09, 2024, 12:54:45 PM",
      "body": "Bitcoin will remain a leader in any respect. In terms of market capacity, it may be displaced in the future. In terms of fees, there are cheaper blockchains. In terms of privacy or development, there are better projects, but in the end, Bitcoin remains Bitcoin, and with all the problems of scalability, there is still betting on it, which will gain it demand that will make it. Among them are among the best cryptocurrency options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "May 09, 2024, 01:20:18 PM",
      "body": "Keeping the technical aspects aside in layman's terms I would say it has survived for over a decade and faced all sort of challenges from being threatened to be banned to being called scam and being targeted as a medium of terror funding but it has survived of of these accusations and sabotage that's itself is enough for us to understand Bitcoin is not a bubble or weak asset and it would continue to sustain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "May 09, 2024, 01:27:06 PM",
      "body": "Quote from: Yamane_Keto on May 09, 2024, 12:54:45 PMBitcoin will remain a leader in any respect. In terms of market capacity, it may be displaced in the future. In terms of fees, there are cheaper blockchains. In terms of privacy or development, there are better projects, but in the end, Bitcoin remains Bitcoin, and with all the problems of scalability, there is still betting on it, which will gain it demand that will make it. Among them are among the best cryptocurrency options.That is true and people should stop denying the inevitable. Bitcoin will not always be the currency at the top as technology will advance and we will be able to understand the realm of digital currencies better. For sure we will be able to create a cryptocurrency that checks all the boxes and even though this hypothetical project will replace bitcoin, it can not go unnotice that none of it would have been possible without the creation of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "May 09, 2024, 01:35:44 PM",
      "body": "Despite the positive and a lot of negative events that had happened in the past years, Bitcoin is still alive and kicking. Based on the chart above, you can clearly see that it is very bullish and just waiting for us to fill in our bags so we won't miss the next ATH. Aside from being the pioneering decentralized digital currency, Bitcoin is also a future proof currency and investment asset. Achieving financial freedom through it is just a bonus or perk for being part of it's existence as long as someone is able to get even some portion of it on their wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baki202",
      "created_time": "May 09, 2024, 01:54:40 PM",
      "body": "Quote from: Yamane_Keto on May 09, 2024, 12:54:45 PMBitcoin will remain a leader in any respect. In terms of market capacity, it may be displaced in the future. In terms of fees, there are cheaper blockchains. In terms of privacy or development, there are better projects, but in the end, Bitcoin remains Bitcoin, and with all the problems of scalability, there is still betting on it, which will gain it demand that will make it. Among them are among the best cryptocurrency options.Starting from were the whole crypto started from so what do you expect from market control definitely bitcoin will control the markets. And even during the bear market, bitcoin will standout. And if you look at it other altcoins started from bitcoin. And that is why anything that happens in the market bitcoin is always responsible and will always determine the outcome of the market. It’s not necessarily you go for bitcoin because I will always consider my capital before investing. There are a lot of them that you can invest in is just for you to make the right decision when selecting your asset to investing so that you don invest and the next thing will be that the project will crash due to bear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "May 09, 2024, 03:30:41 PM",
      "body": "Quote from: MarissaLopez on May 09, 2024, 12:36:04 PMmoreso reasons why Bitcoin will likely survive are thusBitcoin would keep staying on top other coins because it's a reputable crypto currency and  most largest in a scale of adoption that has also attained the greatest security mechanized features and also the potentialities to maintain stable valuability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "May 09, 2024, 04:05:12 PM",
      "body": "Bitcoin is the first crypto coin and is also used as a legal currency in many countries. so Bitcoin can never be expected to be a scam. Bitcoin is getting more and more popular day by day and people are showing interest in it. so it is certainly expected that Bitcoin will survive forever. many people are profiting by using long-term investments in Bitcoin, which is why many people are now investing in Bitcoin instead of keeping their money in the bank too. so now investing on bitcoin is a very smart thinking",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 09, 2024, 04:11:14 PM",
      "body": "Quote from: Yamane_Keto on May 09, 2024, 12:54:45 PMBitcoin will remain a leader in any respect. In terms of market capacity, it may be displaced in the future. Don't you think your statement is somehow contradicting? If you believe Bitcoin can be displaced in the future why would it remain the leader in any respect?Quote from: Yamane_Keto on May 09, 2024, 12:54:45 PMIn terms of fees, there are cheaper blockchains. In terms of privacy or development, there are better projects, but in the end, Bitcoin remains Bitcoin, and with all the problems of scalability, there is still betting on it, which will gain it demand that will make it. Among them are among the best cryptocurrency options.In terms of fee and privacy, there are already some options that can be used in the Bitcoin network but only a few in the crypto community acknowledge. In the end, everything points out that most people are only after profit-making from the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "May 09, 2024, 04:13:11 PM",
      "body": "Quote from: MarissaLopez on May 09, 2024, 12:36:04 PM     In conclusion since Bitcoin has survived such attacks from government ,hacks,criticisers, scammers,covid, insurgency etc.bitcoin will still survive in the years to come even if the World war begins and it will do so due to its decentralized Nature,technological advancement and lots more and thus skyrocket to being the leading digital currency. I agree with some of the arguments you give that Bitcoin has been tested under all conditions, but if the role of the Third World occurs this cannot necessarily be credited. A world war that occurs on a large scale could turn off electricity and internet sources, this could affect the journey of bitcoin, because if that happens people will not care about investment but rather how to survive in conditions of chaos.If world conditions are normal like now then I am sure bitcoin will continue to gain a place for humans because now we are starting to feel that this system has shown advantages than before. Bitcoin is a source of freedom for anyone involved in it because people can reach the stage of financial freedom independently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "May 09, 2024, 04:20:33 PM",
      "body": "Quote from: MarissaLopez on May 09, 2024, 12:36:04 PM1. Decentralized Nature2. Security3. Limited supply 4. Potential adoption.Bitcoin has come so far and it has come to stay and nobody can remove it because of it decentralized nature, individuals and government have been fighting to stop bitcoin when it started to became popular but all were not succeeded and the Cybersecurity of bitcoin is very tight that no hacker can penetrate to the bitcoin server and change the narrative. And in all countries individuals adopt bitcoin massively than the government. The countries tht have adopted bitcoin are just few. But there is a new trend that is going on the State level, countries are stated disturbing cryptocurrency exchanges by banning the p2p in their countries. Which is the lastest ways to crackdown cryptocurrency activities in the world since they can't control the decentralized cryptocurrencies then they went to the Centralized Exchanges to  list the details of people that are using cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 09, 2024, 04:32:28 PM",
      "body": "Quote from: MarissaLopez on May 09, 2024, 12:36:04 PMDecentralized Nature: This means that no single entity such as a government or bank has control over it,and this makes it resistant to corruption or interference by any centralized authorities.p2p has made it more easy and simple to achieve, you don't have to go through a centralized institution or authority before you can be able to achieve the use of bitcoin.Quote from: MarissaLopez on May 09, 2024, 12:36:04 PMSecurity: Bitcoin uses cryptography to secure the transactions that happens in the network making it highly resistant to fraud and hacks.If you don't create a vulnerability for others to attack you of your asset in bitcoin, then the blockchain technology has all it uses to make that safety achieved along with the bitcoin protocols.Quote from: MarissaLopez on May 09, 2024, 12:36:04 PMPotential adoption:  Generally a massive number of business owners and individuals are accepting Bitcoin as a mode of payments thereby reducing it's demise.People chose to make use of bitcoin in their financial economy because of the various opportunities seen in it adoption in which other currencies or financial assets could not offer them including government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "May 09, 2024, 04:48:45 PM",
      "body": "Quote from: MarissaLopez on May 09, 2024, 12:36:04 PM1. Decentralized Nature2. Security3. Limited supply 4. Potential adoption.These alone should tell you that Bitcoin is the best and will always be the best cryptocurrency that is here to give us financial freedom. With Bitcoin, you can save your money without any doubt and fear of inflation, because Bitcoin is decentralized and holding Bitcoin gives you profit because the price is volatile and it’s possible general global adoption and its halving theory will make its value more high and will always be recognized because cryptocurrency has come to ATH and Bitcoin is their pioneer and they can not survive without it because it’s price controls the entire market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "R100K-Martin-Lunger",
      "created_time": "May 09, 2024, 04:53:52 PM",
      "body": "I agree 100%. There's inherent value in Bitcoin. You have pretty much summed up why. That said, I also think you can benefit from diversifying your portfolio and investing in altcoins as well. After all, when Bitcoin's value rises, the alts always follow. Naturally, one should study the alts out there and make informed choices. I use a crypto trading bot to ensure my portfolio remains balanced with the right percentage of BTC and promising and established altcoins to maximize my profits when Bitcoin reaches 100k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "May 09, 2024, 04:56:23 PM",
      "body": "Bitcoin's existence depends on human needs, so as long as people still have needs, it will not disappear, but if we no longer need it, it will soon be forgotten . Personally , I believe that the bitcoin revolution is only in its infancy and that bitcoin could be around for a long time to come. But to say it will last forever, no one can be sure, so don't rush to draw conclusions for the future when we have nothing to prove. The world is constantly evolving, bitcoins have been created and I wouldn't be surprised if in the future something better than bitcoins is created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "May 09, 2024, 05:00:18 PM",
      "body": "Actually, no one knows for sure whether Bitcoin will always survive or not, because Bitcoin can still be said to be a new technology even though it is already a decade and a half old. However, Bitcoin can be said to have succeeded in becoming the center of attention of all groups and continues to be adopted.So I think Bitcoin will continue to survive as long as it provides financial benefits because most people want it, and besides that Bitcoin has many other great uses for those who use and hold it. And only major disasters and full-blown world wars that cause the internet to malfunction or shut down make Bitcoin unusable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "May 09, 2024, 05:04:25 PM",
      "body": "Quote from: MarissaLopez on May 09, 2024, 12:36:04 PM     In conclusion since Bitcoin has survived such attacks from government ,hacks,criticisers, scammers,covid, insurgency etc.bitcoin will still survive in the years to come even if the World war begins and it will do so due to its decentralized Nature,technological advancement and lots more and thus skyrocket to being the leading digital currency.In the context of war, we don't really need bitcoin because what we need is self -salvation.Bitcoin There are no two of the many aspects that I realized for more or less even two years of time I was to learn it. In market capitalization, Bitcoin is still the best even though one day there will be another coin that is able to pass it.In terms of hedge, I still admit Bitcoin as the best in the long run.Privacy, Bitcoin is also the best. As an electronic cash system, Bitcoin is also very good.Of all the advantages of Bitcoin, Bitcoin will not be a follower like another coin that follows Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "May 09, 2024, 05:04:39 PM",
      "body": "Quote from: suzanne5223 on May 09, 2024, 04:11:14 PMDon't you think your statement is somehow contradicting? If you believe Bitcoin can be displaced in the future why would it remain the leader in any respect?I think that was a typo error, and what Yamane meant to write was 'leader in (many) respect' and I quite agree with his/her assertion. Whether another coin dethrones it in future as the number cryptocurrency, bitcoin will always be a leader in the industry. It's the first crypto to hit a trillion marketcap, first crypto to be traded as an ETF, first crypto to hit a billion transaction and many other landmark achievements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "May 09, 2024, 05:10:22 PM",
      "body": "Quote from: kotajikikox on May 09, 2024, 01:27:06 PMQuote from: Yamane_Keto on May 09, 2024, 12:54:45 PMBitcoin will remain a leader in any respect. In terms of market capacity, it may be displaced in the future. In terms of fees, there are cheaper blockchains. In terms of privacy or development, there are better projects, but in the end, Bitcoin remains Bitcoin, and with all the problems of scalability, there is still betting on it, which will gain it demand that will make it. Among them are among the best cryptocurrency options.That is true and people should stop denying the inevitable. Bitcoin will not always be the currency at the top as technology will advance and we will be able to understand the realm of digital currencies better. For sure we will be able to create a cryptocurrency that checks all the boxes and even though this hypothetical project will replace bitcoin, it can not go unnotice that none of it would have been possible without the creation of bitcoin.This is difficult to know, I consider gold to be many times better than fiat, and despite this gold was displaced from its dominant position by governments that wanted to abuse the characteristics of fiat to their benefit, my point is that not necessarily the most advanced coin will remain at the top, and bitcoin is in such a dominant position already, that it will take a concerted effort or a coin that was so much better than bitcoin to replace it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 09, 2024, 05:50:01 PM",
      "body": "OP: I think it's not about bitcoin surviving, that is, your context, I understand, but, It seems that you always have to justify its existence, when it is no longer necessary, it is Bitcoin. So, that idea from the title of your topic, it is as if it were in crisis, or that something unforeseen could happen to it, I like the idea better, that no matter what happens in the future, Bitcoin will always be useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}