{
  "id": "topic_5441060",
  "title": "Bazzu",
  "author": "Bazzu",
  "created_time": "February 24, 2023, 06:31:57 AM",
  "content": "I just bought a velo coin, and the price is really high at the moment, but I was wondering how you think about the velo coin, ?and I dare to buy velo coins, because I saw the price history of velo coins that used to reach prices of up to 0.5 dollars more, and if one day I sell velo coins at a price of 0.5 dollars more I will definitely make big profits.what do you think,,, I want to know your opinion....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441060",
  "comments": [
    {
      "author": "MAAManda",
      "created_time": "February 24, 2023, 07:56:43 AM",
      "body": "After doing some research, I think that this Velo project is most likely a promising project. They are already listed on various top tier CEXs such as Bitfinex, Bithumb, Crypto.com, Gate.io, Huobi, Kucoin, MEXC, OKX and Poloniex. At first glance, people will think that this project is a recent project, but it's not. They even hit their ATH about 2 years ago at $2.07. People will think what I'm saying because this project hasn't really had a great run of their products.Image Source: UniverseIn the product they call as Universe a.k.a their DEX, they don't even have enough enthusiasts yet, we can see it from the image above. Investing in Velo is like gambling with a sizable percentage of profit (IMO). If you invested 2 months ago, by now your investment has been 10x, I personally intend to invest a small amount of my money and will continue to monitor the price movement of $VELO. BTW, thanks for the information, mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "February 24, 2023, 08:48:32 AM",
      "body": "^^ Thanks for the indepth research mate, I haven't heard this project before.Although this is what I found out:Not sure if we have to take this as negative news. But if the project looks promising, then just like any other coins, it might be a good hold and see how far it can go till the next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judeafante",
      "created_time": "February 24, 2023, 02:09:24 PM",
      "body": "Quote from: Bazzu on February 24, 2023, 06:31:57 AMI just bought a velo coin, and the price is really high at the moment, but I was wondering how you think about the velo coin, ?and I dare to buy velo coins, because I saw the price history of velo coins that used to reach prices of up to 0.5 dollars more, and if one day I sell velo coins at a price of 0.5 dollars more I will definitely make big profits.what do you think,,, I want to know your opinion....There are a lot of projects with good potential that are out of our radar the price was down 99.47%Mar 08, 2021 (almost 2 years) but if you invest 2 months ago you are in a good profit the volume is good and it's being traded in a lot of good exchanges, if you really want to know the potential of this token better join their telegram group and follow their channel so you can ask important questions about the project and ask their roadmap, on their channel and social profiles you can check if they are continuously developing the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "February 24, 2023, 02:09:32 PM",
      "body": "Quote from: Kemarit on February 24, 2023, 08:48:32 AM-snip-Not sure if we have to take this as negative news. The effect of delisting crypto.com will not be too significant, Velo still has alternatives to other large exchanges with much larger trading volumes as well. The prospects for the future to be honest I'm not too sure this token will touch ATH again, I think the goal of this project is not very sustainable. Also considering the 2018 altcoin bull market season it has largely failed to recover despite being listed on the top exchanges of its time.I wouldn't risk big money even if I had reliance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zorigi",
      "created_time": "February 24, 2023, 11:28:27 PM",
      "body": "velo coin, indeed about 3 months ago it seemed like there were rarely buyers, and the price was very low... but today I saw the market and this velo coin experienced a high increase.and now the trading volume is getting better.and op because you have bought it I hope your investment in velo coins is successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "February 24, 2023, 11:30:58 PM",
      "body": "Quote from: Bazzu on February 24, 2023, 06:31:57 AMI just bought a velo coin, and the price is really high at the momentYou've already lost me here. It's not advisable to buy when the price is at the top because you know what's next to it is the dumping of those who have bought earlier.The ATH was around $1 and you think that it will be there again? If I were you, I'll have to cut my loss in here if it doesn't look good anymore and will choose another one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "February 24, 2023, 11:59:21 PM",
      "body": "See it here.https://coinmarketcap.com/currencies/velo/Investing in new altcoins can be likened to gambling in some ways, as both involve taking risks with the potential for significant gains or losses.So, do proper research before putting your investment here.  It seems it boils down to shitcoin and the hype was done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "February 25, 2023, 02:18:52 AM",
      "body": "This is my first time seeing Stellar altcoins built on the Stellar network.I can also see that the all-time high of this altcoin is way higher! If you take a look at the record, the all-time high is $2.07 and the current price is $0.01204 which is around -99%.I can see that just incase this project will become successful, the ROI here will be huge, for example, this will be back at its all-time high price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bazzu",
      "created_time": "February 25, 2023, 03:37:36 AM",
      "body": "right now in the market this coin is still holding on to its price even though there has been an increase, and there are more and more people buying it, whether it's for short term or long term purchases.so it's very risky. but if the price continues to rise, there is definitely the potential for big profits.Your advice is very useful, Thank you...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "February 25, 2023, 06:54:52 AM",
      "body": "Quote from: GreatArkansas on February 25, 2023, 02:18:52 AMThis is my first time seeing Stellar altcoins built on the Stellar network.Oh so thats still alive. I really fond of them but their development is really slow, so hearing that they expanded their wings and got a project under them is really shocking.Quote from: GreatArkansas on February 25, 2023, 02:18:52 AMI can also see that the all-time high of this altcoin is way higher! If you take a look at the record, the all-time high is $2.07 and the current price is $0.01204 which is around -99%.I can see that just incase this project will become successful, the ROI here will be huge, for example, this will be back at its all-time high price.Thats really a big blow to early investors. But anyone who entered now is probably a steal if ever the market recovered and provided that the project continue their building.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tespata",
      "created_time": "February 26, 2023, 04:50:41 AM",
      "body": "In this market situation, it is almost impossible to make a profit, many good projects are not successful and as a result, most of the investments fail.velo coin It is also uncertain whether it will actually yield big profits as there have been many shocks which have resulted in loss of confidence.If you can back with big profit then your investment will be successful I looked around a lot about this project and it is difficult to be sure that it will give a big profit If successful, I may try to invest as much as possible so that the project is successful It is possible to take profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bazzu",
      "created_time": "February 28, 2023, 03:38:18 AM",
      "body": "Quote from: Tespata on February 26, 2023, 04:50:41 AMIn this market situation, it is almost impossible to make a profit, many good projects are not successful and as a result, most of the investments fail.velo coin It is also uncertain whether it will actually yield big profits as there have been many shocks which have resulted in loss of confidence.If you can back with big profit then your investment will be successful I looked around a lot about this project and it is difficult to be sure that it will give a big profit If successful, I may try to invest as much as possible so that the project is successful It is possible to take profit.indeed in investing in altcoins it will be difficult to predict for the future, but at least investing a small portion, is a natural thing,, so indeed most of the investment in altcoins is always speculating as well as me...and your opinion is right because we must be vigilant in investing in altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ekanayake90",
      "created_time": "October 31, 2024, 07:11:29 PM",
      "body": "Even though the project is old there were two recent fundraising events as per records. Also there is a possibility of this getting listed on binance as well",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}