{
  "id": "topic_5457906",
  "title": "swogerino",
  "author": "swogerino",
  "created_time": "June 28, 2023, 04:13:46 PM",
  "content": "So after many years of hearing it I need to use it as in Nicehash mining the Lightning Network wallets can receive mining as a minimum from 0.00000001 Bitcoin and not like the normal 0.0005 Bitcoin which is quite a lot for my mining power at only 0.30 dollars a day or 0.27 Millibitcoin.Electrum wants some money to open it at a minimum of 200.000 Satoshi to open a Channel,at least version 4.2.1 which I am using,is there any other wallet which can transact in the Lightning Network with less than this amount or I should add 200.000 Satoshi in Electrum and start receiving payments there?Sorry if this is not the right section.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457906",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "June 28, 2023, 04:51:01 PM",
      "body": "I think only a wallet of Satoshi doesn't require a minimum amount to open a channel. Meaning it is ready to use if you install the wallet of Satoshi you can use it to receive BTC from NiceHash.The wallet looks like an open-source wallet the only problem is it requires email to make a cloud backup. That's a bit risky than opening your own channel on Electrim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 28, 2023, 05:01:52 PM",
      "body": "Quote from: BitMaxz on June 28, 2023, 04:51:01 PMI think only a wallet of Satoshi doesn't require a minimum amount to open a channel. Meaning it is ready to use if you install the wallet of Satoshi you can use it to receive BTC from NiceHash.The wallet looks like an open-source wallet the only problem is it requires email to make a cloud backup. That's a bit risky than opening your own channel on Electrim.I am never a big fan of smartphone wallets and Satoshi wallet looks like there is only for iOS or Android which of course I have no intention of getting,I use Linux and only keep my crypto in Linux wallets.I believe to be using Electrum now when the time comes and if I feel like it,0.002 Bitcoin to start a channel is a bit of an expensive price for me and I have another question now,is that money there to be left there in order to receive payments or I can use it and it is needed only to open the channel cause if it is this last option then it is more of a reasonable amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 28, 2023, 06:26:17 PM",
      "body": "Quote from: swogerino on June 28, 2023, 04:13:46 PMor I should add 200.000 Satoshi in Electrum and start receiving payments there?Note that opening a channel isn't enough: you'll need to send some of your LN balance before you have receiving capacity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 28, 2023, 06:37:49 PM",
      "body": "Quote from: LoyceV on June 28, 2023, 06:26:17 PMQuote from: swogerino on June 28, 2023, 04:13:46 PMor I should add 200.000 Satoshi in Electrum and start receiving payments there?Note that opening a channel isn't enough: you'll need to send some of your LN balance before you have receiving capacity.Well,I can send it if some casino accepts it so I can spend the money there,I don't know but most likely I have not seen this in Stake casino when I deposit they only accept standard Bitcoin payments,why so many hustles before sending and receiving money in this network,anyway I will check how it goes as it is better for me to send what I get from my Faucetpay directly to Nicehash to add to my balance faster so I can withdraw directly there without going through the lightning network,I am a guy who loves simplicity and I don't see any simplicity in the lightning network so far,at least in the beginning it is not at all user friendly but may be I am wrong as I only checked this network now.So let's suppose I open the channel and have receiving capacity,I have this forever then or I have to keep pumping money to the channel in order to use it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 28, 2023, 09:17:59 PM",
      "body": "Quote from: BitMaxz on June 28, 2023, 04:51:01 PMI think only a wallet of Satoshi doesn't require a minimum amount to open a channel. Meaning it is ready to use if you install the wallet of Satoshi you can use it to receive BTC from NiceHash.The wallet looks like an open-source wallet the only problem is it requires email to make a cloud backup. That's a bit risky than opening your own channel on Electrim.The wallet of satoshi's problem isn't the email, which you can get around by inserting an alias, but this wallet is of the custodial type and obviously the backup of the lighting channels takes care of everything.  This is not a bad thing indeed, for small amounts I prefer to have the certainty of not thinking about the backup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 29, 2023, 08:34:11 AM",
      "body": "Quote from: swogerino on June 28, 2023, 06:37:49 PMSo let's suppose I open the channel and have receiving capacity,I have this forever then or I have to keep pumping money to the channel in order to use it?I think you should read up a bit on how LN works before using it. Think of a LN channel as a certain amount of money, that can move back and forth between your wallet and the LN node. If all of it is on your side, you can't receive anything.Since you're talking about small amounts, you could consider a custodial wallet. That way, you don't have the hassle of opening your own channels.Quote from: swogerino on June 28, 2023, 05:01:52 PMI am never a big fan of smartphone walletsMe neither, but LN is especially useful for small payments \"on the road\". That's probably why there are more mobile wallets than desktop versions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "June 29, 2023, 09:04:26 AM",
      "body": "Quote from: swogerino on June 28, 2023, 06:37:49 PMWell,I can send it if some casino accepts it so I can spend the money there,I don't know but most likely I have not seen this in Stake casino when I deposit they only accept standard Bitcoin payments,why so many hustles before sending and receiving money in this network,anyway I will check how it goes as it is better for me to send what I get from my Faucetpay directly to Nicehash to add to my balance faster so I can withdraw directly there without going through the lightning network,I am a guy who loves simplicity and I don't see any simplicity in the lightning network so far,at least in the beginning it is not at all user friendly but may be I am wrong as I only checked this network now.So let's suppose I open the channel and have receiving capacity,I have this forever then or I have to keep pumping money to the channel in order to use it?Once you have opened a channel, the channel is going to be there until you (or the other side, or both of you) decide to close it.Let's say you have a channel with 1BTC outgoing and 1BTC incoming capacity. This means that you are NOT able to spend more than 1BTC using the lightning network and you also cannot receive more than 1BTC using the lightning network.You can't pump money to an open channel. The channel can only send and receive BTC from the lightning network. It can never exceed the capacity limit. (If there is any development on this, as a new feature, I would be delighted to know).The channels form a network. This means that if you want to pay someone (let's say you want to pay Alice 0.1BTC), then Alice MUST have an open channel with at least 0.1BTC incoming capacity. At the same time, if you don't have a direct channel with Alice, then your nodes must be indirectly connected somehow. I agree that LN is not very easy and simple for new users. But let's not ignore that there is continuous development going on.Finally, if you don't want to open your own channels and don't want to have your own node at all, let me suggest you MUUN wallet. You can send on-chain BTC there and then you can use it both ways (On-Chain and LN).MUUN does the \"dirty\" job behind the scenes. I only suggest it because it is extremely simple.If you are more interested in going deep and learning more stuff, I suggest setting up a node and connect to it using ZEUS wallet through tor. Then open a channel (let's say 0.01BTC) with a large node (check here for examples: https://1ml.com/) and then send some sats to someone, in order to gain incoming liquidity.Finally, I suggest ACINQ node. There is no reason at all. I just like its stats!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 30, 2023, 12:51:40 PM",
      "body": "Quote from: LoyceV on June 29, 2023, 08:34:11 AMQuote from: swogerino on June 28, 2023, 06:37:49 PMSo let's suppose I open the channel and have receiving capacity,I have this forever then or I have to keep pumping money to the channel in order to use it?I think you should read up a bit on how LN works before using it. Think of a LN channel as a certain amount of money, that can move back and forth between your wallet and the LN node. If all of it is on your side, you can't receive anything.Since you're talking about small amounts, you could consider a custodial wallet. That way, you don't have the hassle of opening your own channels.Quote from: swogerino on June 28, 2023, 05:01:52 PMI am never a big fan of smartphone walletsMe neither, but LN is especially useful for small payments \"on the road\". That's probably why there are more mobile wallets than desktop versions.If I will want to try out I am going for that Satoshi wallet as that only option for me without going through the hassles of creating channels and all relevant info,I have read about it when I wanted to use it,I even watched a dozen youtube videos which all included using money to open the channel,something I never would want to do except in rare cases as that of mining through Nicehash to receive payments much faster.In the end it will be a nice addition to have a LN wallet in my phone as it won't hurt much for the super small amounts I will receive,so calling this a day and closing this topic,thanks to all who helped me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}