{
  "id": "topic_5418259",
  "title": "udayantha11",
  "author": "udayantha11",
  "created_time": "October 25, 2022, 10:00:55 AM",
  "content": "As previous trends , logically. we had our BTC top 1 year back(69000$). So after one year we can not expect another ATH going to happen. Market need sometime for next momentum. Even other markets too.If we guess that we can expect next market preparation  after next halving ,. Hence , we have exactly 1 year and 5 months. Clearly can see consolidation area in next year(2023). So definitely we can grab , more buying opportunities rather now.We had Bull market , Now we are at the end of the bearish momentum. Consolidation area is incoming.This is my market reading. I know everyone does have different opinions. Lets share",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418259",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "October 25, 2022, 10:07:30 AM",
      "body": "The market will not be stagnant before 2024. 2024 bull market can be more massive, but that does not mean there would not be bull run and another bear market until 2024.Quote from: udayantha11 on October 25, 2022, 10:00:55 AMIf we guess that we can expect next market preparation  after next halving ,. Hence , we have exactly 1 year and 5 months.We do not yet know the month halving will occur in 2024, this time is difficult to predict when block 840000 would be mined. Estimated time would be more accurate as we are getting closer.Quote from: udayantha11 on October 25, 2022, 10:00:55 AMWe had Bull market , Now we are at the end of the bearish momentum. Consolidation area is incoming.Exactly, no matter the extent the bear market could be, those that hold around $20000 in bitcoin price will make profit. The next bear market, if massive, it would result to another bull market is what I am predicting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "October 25, 2022, 10:15:05 AM",
      "body": "Quote from: udayantha11 on October 25, 2022, 10:00:55 AMAs previous trends , logically. we had our BTC top 1 year back(69000$). So after one year we can not expect another ATH going to happen. Market need sometime for next momentum. Even other markets too.If we guess that we can expect next market preparation  after next halving ,. Hence , we have exactly 1 year and 5 months. Clearly can see consolidation area in next year(2023). So definitely we can grab , more buying opportunities rather now.We had Bull market , Now we are at the end of the bearish momentum. Consolidation area is incoming.This is my market reading. I know everyone does have different opinions. Lets share Well if you have been in the market and have seen previous cycles, yes the catalyst for the next bull run is the bitcoin halving, and it is still very far.Consolidation has been happening in the last 4 months, the price has been trading sideways, we might as well take that advantage and accumulate.For 2023, yeah, maybe we can see lower lows for this bear market, there are predictions that it could be around $10k-$15k, but we will have see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 25, 2022, 10:39:12 AM",
      "body": "What we all have mutual in thinking is about the halving by 2024. And then after that, we're going to see the shoot up for bitcoin's price just like the old times. This is a cycle that we have come to see the pattern and that's why we're eager to accumulate at these times.Some may say that we'll still heading for the bottom and might likely see those low prices again, that's okay. But we're speculating that after the 2024 halving, we'll see that bitcoin is going to break its last ATH. Maybe by that time, it's the $100k aim that we've been waiting for and it will be the next ATH price or even more than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "October 25, 2022, 11:52:15 AM",
      "body": "Market doesn't need any momentum, as long as everyone are buying Bitcoin and no countries ban Bitcoin, I can expect Bitcoin price would make new ATH every year or two year and it doesn't need until halving event happen.Do you really think next year the market will recover? Western economy isn't in good condition and inflation rate is increase, we might see a real disaster on the next year. But there's nothing wrong if you want to accumulate Bitcoin right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 25, 2022, 12:01:22 PM",
      "body": "Do you consider lower prices are bad for Bitcoin and Bitcoin investors?If people in 2020 hoped that they can use a time travelling machine to go back to either 2018 or 2019 and buy Bitcoin at cheap price like $10,000 or $20,000, now they actually have that chance.$19,000 recently or $17,000 weeks ago, did they take it to buy Bitcoin? If they rejected that chance because of being fearful when they should be greed, they will never buy Bitcoin. Even if Bitcoin falls more to $15,000 or $10,000, they will consider it as risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 25, 2022, 12:43:40 PM",
      "body": "Quote from: udayantha11 on October 25, 2022, 10:00:55 AMAs previous trends , logically. we had our BTC top 1 year back(69000$). So after one year we can not expect another ATH going to happen. Market need sometime for next momentum. Even other markets too.If we guess that we can expect next market preparation  after next halving ,. Hence , we have exactly 1 year and 5 months. Clearly can see consolidation area in next year(2023). So definitely we can grab , more buying opportunities rather now.We had Bull market , Now we are at the end of the bearish momentum. Consolidation area is incoming.This is my market reading. I know everyone does have different opinions. Lets share I just didn’t mind about the movement of the price even now. I just do DCA (dollar-cost averaging) with Bitcoin with my extra “not beer” money as long as I have. Bearish momentum will likely going to happen for a long while, but there will be no promises or guarantees on when will it last. We just have to prepare ourselves to expect the unexpected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "October 25, 2022, 01:11:15 PM",
      "body": "Quote from: hd49728 on October 25, 2022, 12:01:22 PMDo you consider lower prices are bad for Bitcoin and Bitcoin investors?If people in 2020 hoped that they can use a time travelling machine to go back to either 2018 or 2019 and buy Bitcoin at cheap price like $10,000 or $20,000, now they actually have that chance.$19,000 recently or $17,000 weeks ago, did they take it to buy Bitcoin? If they rejected that chance because of being fearful when they should be greed, they will never buy Bitcoin. Even if Bitcoin falls more to $15,000 or $10,000, they will consider it as risk.Greed is the main seed of every bad deed. People don’t care when opportunities come, when it gets over, people cry about it. Similarly happening right now. People are not showing enough trust on Bitcoins and therefore missing this golden opportunity to buy this great coin at such a cheap price. Bitcoins might not increase in it’s value overnight, but it will increase eventually, slowly slowly. As the supply of the coin is limited, so whenever the demand for the coin increases, the price will automatically grows up. OP’s market reading is quite impressive. Let’s see what happens next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "October 25, 2022, 01:54:57 PM",
      "body": "If the market is going to fall deeper than it is now, then let it happen, prepare your money to buy it, and don't let the opportunity pass. Maybe it's true right now bitcoin needs more time to reach the last ATH or, let's say to return to a higher price than now. And right now, bitcoin is still in a bear phase, so we don't know when this will end. Many say that next year will be a momentum for bitcoin to rise again, but that is only their prediction. We can also make predictions like that, but bitcoin is moving wilder than ever, so it's still a mystery to us. But there is a possibility that this trend will change considering that more and more people are joining bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "October 25, 2022, 02:25:29 PM",
      "body": "Quote from: udayantha11 on October 25, 2022, 10:00:55 AMAs previous trends , logically. we had our BTC top 1 year back(69000$). So after one year we can not expect another ATH going to happen. Market need sometime for next momentum. Even other markets too.If we guess that we can expect next market preparation  after next halving ,. Hence , we have exactly 1 year and 5 months. Clearly can see consolidation area in next year(2023). So definitely we can grab , more buying opportunities rather now.We had Bull market , Now we are at the end of the bearish momentum. Consolidation area is incoming.This is my market reading. I know everyone does have different opinions. Lets shareBitcoin is bearish at the moment, but it is still holding the 18K support although we had touched this support a number of times. It is just a matter of time before this support will be broken and bitcoin may reach 14-15K level.Bitcoin is behaving exactly as it should be and i am sure the bitcoin bottom for this year will be very near. However, people are excited on the 500 or 100$ bitcoin pump when they should know that in Marco we are bearish and therefore the short trade can be more profitable as compared to the long trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vinaa77",
      "created_time": "October 25, 2022, 09:02:48 PM",
      "body": "Quote from: udayantha11 on October 25, 2022, 10:00:55 AMIf we guess that we can expect next market preparation  after next halving ,. Hence , we have exactly 1 year and 5 months. Although estimates are not always accurate, I agree with what you say. I also expect the market to bounce back in 2024, or a year and a half from now. But will the Bitcoin market surpass ATH? I'm sure, Bitcoin will surpass ATH. And make a new record in the bullrun in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "October 25, 2022, 10:06:04 PM",
      "body": "Bitcoin is not bearish at the moment its just dead calm which does not mean its dead, linguistically close but no cigar.   The confusion on that is understable when BTC is full of so much hype at times its like a foam party of nonsense and I find that quite worrying when people are too full of nonsense they forget this is a world first unparalleled phenomena.  The BTC blockchain is not a hype driven clown car, its something unique in the universe never in existence before the inception of the first BTC block and it should be respected properly as a long term unique asset.  If BTC wants to go sideways for the next six months I will respect that, its not negative for not going up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "October 25, 2022, 10:24:51 PM",
      "body": "The thing I just want you to understand is that, bearish market is something i know quit well that it doesn't have an end except the market determines the future of the market, i can't give you analysis that today cryptocurrency can be rise or fall today, all those things are assumptions because the future of the cryptocurrency acceleration is dependable on the demands and supply of the market, so be in bearish or out of bearish is the concernment of the demands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "October 26, 2022, 02:59:50 PM",
      "body": "Definitely, no one should be expecting a big pump in price now or in 2023. Am not an analyst but I can say we are probably in the accumulation phase. The price is low enough for people to start accumulating except people really believe btc will go below 19k. But once btc halving is done, the market will start gathering momentum again. IMO I think now is as good a time because it is not easy to time btc price and buy the bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "October 26, 2022, 03:16:14 PM",
      "body": "Quote from: hd49728 on October 25, 2022, 12:01:22 PMDo you consider lower prices are bad for Bitcoin and Bitcoin investors?If people in 2020 hoped that they can use a time travelling machine to go back to either 2018 or 2019 and buy Bitcoin at cheap price like $10,000 or $20,000, now they actually have that chance.$19,000 recently or $17,000 weeks ago, did they take it to buy Bitcoin? If they rejected that chance because of being fearful when they should be greed, they will never buy Bitcoin. Even if Bitcoin falls more to $15,000 or $10,000, they will consider it as risk.Since they are dissatisfied with the price going down which results in a panic I think lower prices are not making investors worse but the opportunity they will take.People who think Bitcoin is too low, they will not be able to buy Bitcoin, they just keep stalling for a low price but don't buy when it goes down, afraid of the risk of losing it in the sense of going down even more, while when it goes up they regret it but that's greedy human nature always thinking bad things about it. in his presence there is an opportunity to buy at a low price.When the bear market wants a more severe decline or not, we have to be able to face a volatile market, don't just speculate without doing anything and just stand still without buying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "October 26, 2022, 06:10:00 PM",
      "body": "Quote from: Despairo on October 25, 2022, 11:52:15 AMMarket doesn't need any momentum, as long as everyone are buying Bitcoin and no countries ban Bitcoin, You are far with the reality that we see in bitcoin. It is not possible to see everyone, every country liking bitcoin. Bitcoin having enemies also and so haters will criticize always. Countries already banning bitcoin and maybe banning is momentum bitcoin need to keep growing.Quote from: Despairo on October 25, 2022, 11:52:15 AMI can expect Bitcoin price would make new ATH every year or two year and it doesn't need until halving event happen.I think 2017 and this year have been history that the ATH have maintained for long before another halving. This year I'm not expecting new ATH before another halving in 2024.Quote from: Despairo on October 25, 2022, 11:52:15 AMDo you really think next year the market will recover? Western economy isn't in good condition and inflation rate is increase, we might see a real disaster on the next year. But there's nothing wrong if you want to accumulate Bitcoin right now.Bitcoin price also increase in negative effect of the economy. During covid-19, it went higher. Sometimes because bitcoin is decentralized, it freely unregulated can fluctuate differently from your expectation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "October 26, 2022, 07:45:29 PM",
      "body": "Quote from: livingfree on October 25, 2022, 10:39:12 AMWhat we all have mutual in thinking is about the halving by 2024. And then after that, we're going to see the shoot up for bitcoin's price just like the old times. This is a cycle that we have come to see the pattern and that's why we're eager to accumulate at these times.Some may say that we'll still heading for the bottom and might likely see those low prices again, that's okay. But we're speculating that after the 2024 halving, we'll see that bitcoin is going to break its last ATH. Maybe by that time, it's the $100k aim that we've been waiting for and it will be the next ATH price or even more than that. Hopefully, bitcoin price after halving will even surpass our expectation, and that to see it $100k or beyond. So while bear market continues, then let’s grab this opportunity of buying bitcoin at a bargain price. After all, it’s not that bitcoin will be bearish the whole time, bullish trend will also develop and returns to the market when everything’s around positive. Patience is what we need the best this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "October 26, 2022, 08:33:41 PM",
      "body": "I somewhat agree with you on this reading, I hope we have reached the end of the bear market and are starting a new phase now with the clear green rally in the market since yesterday, not a huge rally but it could be a good indication of the end of the bear market, but still some time Maybe several months until we could see a real rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "October 26, 2022, 08:59:14 PM",
      "body": "Quote from: TravelMug on October 25, 2022, 10:15:05 AMQuote from: udayantha11 on October 25, 2022, 10:00:55 AMAs previous trends , logically. we had our BTC top 1 year back(69000$). So after one year we can not expect another ATH going to happen. Market need sometime for next momentum. Even other markets too.If we guess that we can expect next market preparation  after next halving ,. Hence , we have exactly 1 year and 5 months. Clearly can see consolidation area in next year(2023). So definitely we can grab , more buying opportunities rather now.We had Bull market , Now we are at the end of the bearish momentum. Consolidation area is incoming.This is my market reading. I know everyone does have different opinions. Lets share Well if you have been in the market and have seen previous cycles, yes the catalyst for the next bull run is the bitcoin halving, and it is still very far.Consolidation has been happening in the last 4 months, the price has been trading sideways, we might as well take that advantage and accumulate.For 2023, yeah, maybe we can see lower lows for this bear market, there are predictions that it could be around $10k-$15k, but we will have see. It’s not a problem actually if bitcoin will create possible lower lows by next year because it only means our opportunity to buy bitcoin and other coins is extended, thus giving us greater chances to be profitable when the final bull market is here. Although it’s still uncertain if we will witness a new all time high after bitcoin halving, but whatever it is, we should still not resort into panicking as it will only bring a total loss for all of us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "October 26, 2022, 09:40:08 PM",
      "body": "Quote from: Despairo on October 25, 2022, 11:52:15 AMMarket doesn't need any momentum, as long as everyone are buying Bitcoin and no countries ban Bitcoin, I can expect Bitcoin price would make new ATH every year or two year and it doesn't need until halving event happen.Do you really think next year the market will recover? Western economy isn't in good condition and inflation rate is increase, we might see a real disaster on the next year. But there's nothing wrong if you want to accumulate Bitcoin right now. When everything is bad especially looking at the world economic right now, then it’s best to just grab the chance and maximize bitcoin accumulation this time while everything is low priced and affordable. With or without halving, bitcoin will still be profitable in the long run provided that it’s own demand never stops and continue to rose high. No issue with the bears, the problem is when you don’t care buying when it’s in fact the perfect time to buy and hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}