{
  "id": "topic_5454786",
  "title": "sokani",
  "author": "sokani",
  "created_time": "June 01, 2023, 04:10:48 PM",
  "content": "I stumbled on this animated YouTube video that gave a simplified introduction to bitcoin by Cryptomatics and I thought it is worth sharing. For those of us who have kids and would want to educate them at their tender age about bitcoin, I think this video is a great start and a must watch. I would also recommend newbies to check it out as studies has shown that learners respond faster and better to visual contents than textual contents and I believe this would help to fasten their bitcoin learning process.https://youtu.be/pIm2uPXSAWw",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454786",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "June 01, 2023, 04:55:09 PM",
      "body": "It's an educational animation for an average child to understand; the creator of such an animation must have had pupils for whom he or she prepared this video because the children of this generation are more interested in learning via online and video watching since they are always active using their iPad, and such a video can also be displayed on a projector while explaining things in simple terms for an average man's understanding.The animated video is not just limited to children, though, because it has enough information for everyone who doesn't have an idea of what Bitcoin is and how it works. A lot of information could be gotten from here to make you understand how to use it, and it's different from banking, so you can move ahead with more research if you fall in love with the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "June 01, 2023, 08:40:10 PM",
      "body": "Well this is suitable for beginners but Not only for children but seems also suitable for explaining to parents who are interested in bitcoin. With an explanation accompanied by pictures, it can make someone more quickly understand what is conveyed.I also ended up watching it to the end.But of course not for children who don't understand the financial system. but for children who are old enough to understand the basics of the financial system.so I would probably prefer to find this video more suitable for beginners trying to understand the basics of bitcoin. provided that he also has basic insight into the current financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "June 01, 2023, 08:54:23 PM",
      "body": "This is an excellent approach to explain and illustrate the use of bitcoin. Recently, I discovered that individuals like to visualize rather than read or go to class to learn new things because it offers them a better comprehension and a full experiential grip in the mind.  This way of learning is simple enough for individuals who only comprehend sign language rather than the language of listening to an explanation. This is a good approach to simplifying the learning process and making bitcoin more understandable to many people including beginners, and not just children.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 01, 2023, 09:08:57 PM",
      "body": "Such thread has been created by a user in the forum but I can't recall the user and the title of the thread but the title of that cartoon is Bitcoin and the Beast. The Turtle Twins  that was the first bitcoin cartoon videos for children to learn. So I would have preferred you to locate that thread and make comments there instead of creating new similar topic thread  to it. Edit: I have finally seen the thread. Here it is.  Bitcoin and the Beast",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "June 01, 2023, 09:13:00 PM",
      "body": "It was a 4:30 minutes long video. I've firstly noticed about telling that Bitcoin is the first digital currency, I mean that's true in beginners term but straight to the fact, it's not. Much better if it's said that it's the first cryptocurrency in the introduction. However, at the conclusions part, it has mentioned the right thing of what I am saying about being the first crypto.That was a good video but it didn't reiterate about the scams and phishings when it had tackled about safety. It's said that it rarely happens for the theft and only said more about the forgetting of password of the wallet.Well, it's fair enough and this is a good introduction for the newbies and those that haven't heard about Bitcoin. Thanks for sharing op!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "June 01, 2023, 09:20:52 PM",
      "body": "We should be careful in giving links of information to people who are looking for it since there are times that video presentation often gives wrong information about the subject or topic.  Just like this line that can be watched on the link of @OPIt was established that Bitcoin is not the first digital currency, and the first Digital currency is known as ecash created by David Chaum's company DigiCash in 1990[1]Quote from: boyptc on June 01, 2023, 09:13:00 PMIt was a 4:30 minutes long video. I've firstly noticed about telling that Bitcoin is the first digital currency, I mean that's true in beginners term but straight to the fact, it's not. Much better if it's said that it's the first cryptocurrency in the introduction. However, at the conclusions part, it has mentioned the right thing of what I am saying about being the first crypto.That was a good video but it didn't reiterate about the scams and phishings when it had tackled about safety. It's said that it rarely happens for the theft and only said more about the forgetting of password of the wallet.Well, it's fair enough and this is a good introduction for the newbies and those that haven't heard about Bitcoin. Thanks for sharing op!Yeah I also noticed that line, so I can assume that there will be errors like this on the presentation.  I believe this tutorial isn't good if we wanted to establish factual information and avoid confusion.  So my take, it isn't a good source of information due to the fact that there maybe wrong information that is inputted on the video.  Aside from that, kids won't be having fun watching this video unlike the other animation stated on the other thread.[1] https://www.investopedia.com/tech/were-there-cryptocurrencies-bitcoin/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 01, 2023, 09:55:18 PM",
      "body": "Well, it's good you shared; it might really be helpful for most people. A few days ago, I also came across this thread, in which the video that was shared by the OP is also very educational animated Bitcoin tutorial for kids as well. In the past, I tried to search for some animated videos like that that my nephew would learn from, and although I got some on YouTube too but couldn't make the best choice, these are really good ones that are also coming to the forum. Children mostly learn fast with visual learning, rather than getting them bored with long talks and speeches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "June 01, 2023, 09:59:23 PM",
      "body": "Quote from: sokani on June 01, 2023, 04:10:48 PM<snip>I watched it before too. These kind of contents helped me understand things better, usually for concepts. I noticed that there were some concerns being discussed here about the first digital cash... I am not sure if the video creator had that mistaken. However, as a learner, you should also have to try verifying information you get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 02, 2023, 02:17:15 AM",
      "body": "Quote from: sokani on June 01, 2023, 04:10:48 PMI believe this would help to fasten their bitcoin learning process.Thanks for sharing a video. But sometimes the kids didn't interest to watching educational cartoon videos on youtube because boring and exhausting to hear introductions. I know this from my nephew, his age is 4 years old. He ignores me when I perform videos like this to him. because he is happier when I show him action cartoon videos like Spongebob, Tayo, Dora and etc. This is a big problem for us and the next generation because massive video on youtube has changed the kids' perspectives and don't want to watch and hear about education/introduction that makes them bored. The kids now is more curious when I invite them to a natural thing, my nephew is happy when I take together to a rain shower or draw a picture with a pencil. With this case, I have idea to create flip book cartoon with bitcoin introduction theme, this is more natural thing, where I think make them curious to watch the introduction because something like this is never have been seen before.for example: 1. https://www.youtube.com/watch?v=3LG4OSk1gE0 2. https://www.youtube.com/watch?v=J2xrN5WQuxwI never find yet any flip book about bitcoin, maybe next I have to create itself just for my nephew.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 02, 2023, 04:14:46 AM",
      "body": "Not sure why a lot of people are so obsessed with shoving Bitcoin down their kid's throats. Let them enjoy their childhood for god's sakes. Bitcoin, investing, and finance are good to teach to children but at least wait til they're 16 or so.Still a decent video for kidsnoobs though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 02, 2023, 04:55:52 AM",
      "body": "The video is nicely done. Although the animation is like for children, I think it's not really for children. There are certain terms and concepts that are most probably alien to them.  It's basically for beginners. It's a great overview of what Bitcoin is, short yet comprehensive. Anybody could easily digest it, but it would also make them ask questions later. Since the video is generally an overview, it might be interesting to add more to it, ones that are more focused on specific topics. Together, it becomes sort of a Bitcoin course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "June 02, 2023, 07:16:48 AM",
      "body": "Quote from: BitDane on June 01, 2023, 09:20:52 PMWe should be careful in giving links of information to people who are looking for it since there are times that video presentation often gives wrong information about the subject or topic.  Just like this line that can be watched on the link of @OPIt was established that Bitcoin is not the first digital currency, and the first Digital currency is known as ecash created by David Chaum's company DigiCash in 1990[1]Bitcoin can be considered as a first successful cryptocurrency /digital currency based on blockchain but it is not a first digital currency. Before Bitcoin, there are some earlier digital currency, Digicash, Cybercash, E-gold and HashCash.Bitcoin Prehistory TreeSaylor.org Academy. Bitcoin Prehistory",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "June 02, 2023, 09:30:45 AM",
      "body": "Quote from: sokani on June 01, 2023, 04:10:48 PMI stumbled on this animated YouTube video that gave a simplified introduction to bitcoin by Cryptomatics and I thought it is worth sharing. For those of us who have kids and would want to educate them at their tender age about bitcoin, I think this video is a great start and a must watch. I would also recommend newbies to check it out as studies has shown that learners respond faster and better to visual contents than textual contents and I believe this would help to fasten their bitcoin learning process.https://youtu.be/pIm2uPXSAWwI watched the video from start to finish. This video is actually very educational video. Not only for kids this video is also suitable for a beginner. What is Bitcoin explained in this video? How does bitcoin work? Also Bitcoin is discussed more In short everything about Bitcoin is discussed here. I would encourage my child to watch all of these videos. I will show the video to my child. But I wouldn't pressure him professionally to learn about Bitcoin. Because at this age he should study and become a man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}