{
  "id": "topic_5430603",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "December 20, 2022, 06:07:46 PM",
  "content": "What is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430603",
  "comments": [
    {
      "author": "CoinEraser",
      "created_time": "December 20, 2022, 06:58:00 PM",
      "body": "Such a change is certainly possible. It has happened many times in the past. A few years ago, many other coins were in the top 20. Some will certainly remain in the top 20, while others will lose their position. However, you cannot predict which coins will stay and which will go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 20, 2022, 07:25:11 PM",
      "body": "Quote from: Crypt0Gore on December 20, 2022, 06:07:46 PMWhat is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow? I am guessing SOL and even Tron could drop out. But i would have to predict what coins are going to be replacing them in top 20. Not newcomers that would fall in top 20 but might as well be coins just below them, new bottom 2 on top 20 list could be Toncoin and Cosmos, unless there's something else, a new unknown black horse rising from the bottom of top 300+ marketcap. Like shiba did, from the bottom to top.Without stablecoins there would be even more change in top cmc list. I made a thread where you can see them changing over the yearshttps://bitcointalk.org/index.php?topic=5418571.msg61196924#msg61196924",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "December 20, 2022, 08:26:05 PM",
      "body": "Yeah nearly at every halving cycle comes with Bitcoin bull run that affects altcoins. And everytime some coins leave top ranks.I think Shiba may drop out of it if not enough meme coin speculation happens.I also think we may see Solana or Avax to move more than others. They may drop to lower ranks.I think huobi may have issues in future so huobi token as well.Tron doesn't deserve its current position and I expect it to go like 5-10 ranks down.New coins may hit top 20.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "December 20, 2022, 08:35:15 PM",
      "body": "Quote from: Crypt0Gore on December 20, 2022, 06:07:46 PMWhat is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow? There's no such thing about certain or being permanent even if we do talk about Bitcoin on which in every bull run and based up on overall the years of experience then there's no way that you couldnt tell that everythingcould really be replacen in a snap which it isnt really that surprising that those current rank #20's would really be going down on next bull run which does have been seen back in the past too.This is why always expect that those kind of change ranks could really happen and there's no assurance that it would really be still the same on the next bullrun that comes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stedsm",
      "created_time": "December 20, 2022, 08:51:14 PM",
      "body": "TBH (except a glitch that took place in a coin's martketcap number), I have never seen anything replacing Bitcoin at least from its top position, and if I'm not wrong, even Ethereum had always been holding 2nd position since it was born. If you speak about top 20, regardless of the first 2, others may change their positions based on their usage and number of total coins in circulation based on which their martketcap will increase or decrease if their value does/doesn't continue to rise/fall with time and other crypto tokens take over/get behind them. In crypto, nothing is permanent so holding a position also possess the same saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 20, 2022, 09:24:07 PM",
      "body": "No one knows this, but if Solana does not recover, then SOL is the first contender for the departure from the top 20. Also, it is not known how SHIB will behave, will large investors try to support it further, or will switch to some other meme coin. In my opinion, one should not expect any miracles from SHIB in the next market cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "December 20, 2022, 11:12:40 PM",
      "body": "The position change in the top 20 is very possible to happen, it is something not surprising. If there is hype on some coins (outside of the top 20), then they gradually reach the top 20, then there should be a change in the position of the top 20. Also, if among the top 20 coins, there are coins to lose the hype because of bad issues. The coins may drop out of the top 20 positions, too. But it is difficult to determine which coins to experience this. However, I assume meme coins are possible to experience this if there is no longer hype on meme coins and Elon never tweets about it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 20, 2022, 11:56:10 PM",
      "body": "Quote from: Crypt0Gore on December 20, 2022, 06:07:46 PMWhat is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow? I think Solana is going to be one of them. I've just seen the news that a lot of its developers are leaving and maybe transferring to another project that they think is more potential than it.(https://cryptoslate.com/solana-active-developers-decline-90-in-2022-but-sol-devs-dispute-findings)But I guess, this happens to most projects where developers are finding new opportunities to work with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "December 21, 2022, 03:20:49 AM",
      "body": "In each bull run, ranks change a lot. More new potential top altcoins appear at top.In and after each bear market, ranks change a lot. More potential top altcoins fall down or get rekted like Solana, TerraCoinmarketcap has a page for Historic ranking of top coins. Cryptocurrency Historical Data SnapshotSee how top coins change since 2013 to 2022.Binance BNB ranked 16th in 2018 and Binance USD ranked at a same position in 2021. Now BNB is at 4th and BUSD is at 6th.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "December 21, 2022, 07:19:38 AM",
      "body": "Quote from: Crypt0Gore on December 20, 2022, 06:07:46 PMWhat is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow? Lol look at those new project that you are calling to be changing the market , are they successfull in long term? or just for short term?I may trust new project but for short term only and not for Holding , I have seen them growing and falling so my trust will remain for long time running coins like Bitcoin and of course Ethereum and Binance , also considering Ripple even there are lot of problem facing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "December 21, 2022, 12:38:11 PM",
      "body": "Quote from: rodskee on December 21, 2022, 07:19:38 AMQuote from: Crypt0Gore on December 20, 2022, 06:07:46 PMWhat is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow? Lol look at those new project that you are calling to be changing the market , are they successfull in long term? or just for short term?I may trust new project but for short term only and not for Holding , I have seen them growing and falling so my trust will remain for long time running coins like Bitcoin and of course Ethereum and Binance , also considering Ripple even there are lot of problem facing.Probably they only climb up the ranks because of hypes but once it dies down, their ranks can also fall again and the old top crypto can go back on their previous positions but there are top coins too who can go bad or can turn into a scam same with luna where they can lose their positions permanently.Coins that are above them are now going to move in their position. New coins that are sincere (non hyped) may take some time to climb the top ranks but it's worth it because they can sustain their positions. I think cmc ranking can change at anytime depending on the coins performance, and doesn't only change right after every bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lobo13hf",
      "created_time": "December 21, 2022, 01:34:06 PM",
      "body": "I'm sure that is what happened in every bullrun quite literally the position is changing mainly because some former big coins are losing their volume and market capitalization when some other new coins that have significantly better innovation comes in and disrupt the ranking. the thing with this position changing simply shows that even if the coin that you hold is among the highest rank, it could easily get overtaken by newest ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "janggernaut",
      "created_time": "December 22, 2022, 10:44:14 PM",
      "body": "Quote from: Stedsm on December 20, 2022, 08:51:14 PMTBH (except a glitch that took place in a coin's martketcap number), I have never seen anything replacing Bitcoin at least from its top position, and if I'm not wrong, even Ethereum had always been holding 2nd position since it was born. If you speak about top 20, regardless of the first 2, others may change their positions based on their usage and number of total coins in circulation based on which their martketcap will increase or decrease if their value does/doesn't continue to rise/fall with time and other crypto tokens take over/get behind them. In crypto, nothing is permanent so holding a position also possess the same saying.Nope, XRP (Ripple) ever taken 2nd place from ETH back then, just for a while though before it dropped to top 10 back then on 2017. Quote from: blockman on December 20, 2022, 11:56:10 PMQuote from: Crypt0Gore on December 20, 2022, 06:07:46 PMWhat is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow? I think Solana is going to be one of them. I've just seen the news that a lot of its developers are leaving and maybe transferring to another project that they think is more potential than it.(https://cryptoslate.com/solana-active-developers-decline-90-in-2022-but-sol-devs-dispute-findings)But I guess, this happens to most projects where developers are finding new opportunities to work with.SOL will always stay on here. Couldn't hold myself to not buying SOL on current price as it's already below 95% from it's ATH before. When people leaving the solid project, thats greatest opportunity to buy and hodl it for long term",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stedsm",
      "created_time": "December 22, 2022, 10:51:07 PM",
      "body": "Quote from: janggernaut on December 22, 2022, 10:44:14 PMQuote from: Stedsm on December 20, 2022, 08:51:14 PMTBH (except a glitch that took place in a coin's martketcap number), I have never seen anything replacing Bitcoin at least from its top position, and if I'm not wrong, even Ethereum had always been holding 2nd position since it was born. If you speak about top 20, regardless of the first 2, others may change their positions based on their usage and number of total coins in circulation based on which their martketcap will increase or decrease if their value does/doesn't continue to rise/fall with time and other crypto tokens take over/get behind them. In crypto, nothing is permanent so holding a position also possess the same saying.Nope, XRP (Ripple) ever taken 2nd place from ETH back then, just for a while though before it dropped to top 10 back then on 2017.I agree, though I've spoken about the ones that have been hodling their positions since a very long time. However, there were also Peercoin, Namecoin, and if I'm not wrong, Litecoin (LTC) was holding 2nd position till ETH came into existence. \"In 2013 only 14 coins were listed: Bitcoin, Litecoin, PPCoin (later Peercoin), Namecoin, Feathercoin, TerraCon, DevCoin, Freicoin, Novacoin, CHNCoin, BBQCoin, MinCoin, BitBar and IxCoin. Remarkably most of these projects are still around today in one form or another, but only two of the top 10 still remain there: Bitcoin and Litecoin.\"Here is the source to the above mentioned statement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "December 22, 2022, 11:56:20 PM",
      "body": "Quote from: lobo13hf on December 21, 2022, 01:34:06 PMI'm sure that is what happened in every bullrun quite literally the position is changing mainly because some former big coins are losing their volume and market capitalization when some other new coins that have significantly better innovation comes in and disrupt the ranking. the thing with this position changing simply shows that even if the coin that you hold is among the highest rank, it could easily get overtaken by newest ones.We know that innovation and discoveries or simply those projects which are far more better will really getting more attention and to those dated ones would really be replaced by something better.The community or the market would be always eyeing out into those projects which does offer more better utility which is something that would really be a normal approach for those smart investors.Its not surprising that ranking would really be changing up and just like the rest been mentioning that it does vary on market capitalization or simply with the demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "December 23, 2022, 07:52:57 AM",
      "body": "Solana is the coin that has the most chance of getting out of the top 20 during the bull market later, and you just have to pay attention to coins that have problems in their development, they will easily get out of the top list, and also changes in trend will be very strong reasons for the coins that are currently available being replaced in the top position, can be prolonged or only be temporary, the point is that nothing is eternal in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "December 23, 2022, 02:48:01 PM",
      "body": "After seeing the development of the crypto market for a long time, every next bull market will make many coins fail to maintain their position and be replaced by new projects that are more promising than previous projects. And the next bull market can change the position because many coins can increase at any time and take the top spot. We won't know which coin can take the top spot and can only speculate because we look at every project in the top 100 list and say that this project could improve in the next bull market. But that's not a guarantee because other projects will also want to compete for the top list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "December 23, 2022, 04:50:00 PM",
      "body": "it is bound to happen and it has been happening a lot over the past few years when new altcoins that are cheap and have good future potential are pumped by bullish situations.but it certainly won't last long usually just a few periods and eventually it will also drop back below the top 20.and Solana Matic, one of the new altcoins in the past that had a chance to pump and take over the top 20 on coinmarketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 23, 2022, 08:20:39 PM",
      "body": "Quote from: Crypt0Gore on December 20, 2022, 06:07:46 PMWhat is the crypto projects in top 20 that will fail to retain their position in the next bull market? There is a saying that in every bull market new projects will take over the top 20, do you think another project can rob the positions that Avalanche, Matic, Polkadot and Solana tomorrow? The position is not permanent for any particular project as you said, it is a bear market and some of the top projects are going through the same pressure as any other project in cmc. So it is very likely that some of them will not retain their current position except the market reverse and the projects maintain their market capitalization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}