{
  "id": "topic_5462993",
  "title": "Kryptowerk",
  "author": "Kryptowerk",
  "created_time": "August 12, 2023, 01:02:59 AM",
  "content": "I recently was lucky enough to aquire a 0.0025 Bluebits chip (2017).Now all that's missing to complete a full 4-chip set is the 0.005 bluebits chip.If you are the owner of one of these and want to sell or trade, please send me a dm.I would be most happy to make a trade for my 0.0025 (green colored) Bluebits chip  - you missing the green one, me missing the blue one to complete our collection. Would add-on the difference in loading (0.0025 BTC) of course.If you are interested in a Bitsend 4-chip set instead, also happy to trade this one.Please dm.I heard the 0.005 was blue colored but never seen it, so not sure.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462993",
  "comments": [
    {
      "author": "Kryptowerk",
      "created_time": "August 17, 2023, 03:19:37 PM",
      "body": "BUMP.Would possibly also be up to trade against a redeemed cas coin with hologram.If you got any and willing to trade, please send me a DM.Pics of the rare Bluebits chip:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "August 18, 2023, 10:04:18 PMLast edit: August 18, 2023, 10:14:34 PM by ChiBitCTy",
      "body": "Interesting. Not sure I’ve seen these before. Though it’s very possible I own some lol. I know I’ve got other funded chips besides these I’m posting below, but not sure which. I will check in the coming days and let you know. I also know someone who would likely have this blue chip you seek. Obviously these were made by the same outlet.. EDIT: LMAO, I legit didn't even pay attention to who's thread this was.  You are the go to guy for these chips on here and who I was going to reach out to, pretty sure you sold me these chips that I posted here and others.  Do you remember if you ever sold me a bluebits chip?     I'm an idiot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "August 18, 2023, 11:07:07 PM",
      "body": "Quote from: ChiBitCTy on August 18, 2023, 10:04:18 PMInteresting. Not sure I’ve seen these before. Though it’s very possible I own some lol. I know I’ve got other funded chips besides these I’m posting below, but not sure which. I will check in the coming days and let you know. I also know someone who would likely have this blue chip you seek. Obviously these were made by the same outlet.. EDIT: LMAO, I legit didn't even pay attention to who's thread this was.  You are the go to guy for these chips on here and who I was going to reach out to, pretty sure you sold me these chips that I posted here and others.  Do you remember if you ever sold me a bluebits chip?     I'm an idiot.  Haha, no worries. Yes these 4-chip BTX sets are pretty rare if not more rare than some of the old Bluebits BTC chips.Not sure if I ever sold you one of these old BTC chips, though.However I never had a 0.005 BTC chip in my possession. Not even sure how it looks and kind find photos. Rumor has it it's a blue chip? lolAccording to their github there are around 50 created and only 19 redeemed so far. https://btc.cryptoid.info/btc/tx.dws?280521064.htm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "August 24, 2023, 01:03:20 PM",
      "body": "Weekly bump in hopes of the Bluebits-OG sees this.Maybe some Bluebits hodler only logs in every few months or so, I mean there must be some of these 0.005 chips out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}