{
  "id": "topic_5443800",
  "title": "Kara3",
  "author": "Kara3",
  "created_time": "March 06, 2023, 08:36:28 PM",
  "content": "While growing up things were quite easy, an I also know that life was also easy for the common man, not until 2018 that things start changing for the worst, from then till now the rate at which inflation have struck my country to an all time high is so alarming.  Everyday price of things keeps on changing but the salaries of a civil servants still remain the same, the money that we use too feed from, buy water, pay rent, pay for light an even save from, now it can't even service our monthly needs for even half of the month. Most times I feel for people that have many children because too get basic needs in today's economy is very difficult,  the annoying part is that the government an it agencies are doing nothing or less about the cost control of goods and services in the state.An this has created a torn in the lives of many as situations keeps on getting worse by the day.Am wondering if it's same experience in other part of the world.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443800",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "March 07, 2023, 12:26:39 AM",
      "body": "In the Great Depression of 1929, nobody could afford the cost of things. So, what did people do? They got together and formed their own mini-governments called co-ops. Some of these co-ops are still around today.What did a co-op do? Everybody in the co-op did what they could to make and supply something that other people needed. If they didn't have a profession, they simply became labor for those who did.Some people supplied land they owned. Others built buildings on the land. Others tilled the ground. Professional farmers grew all kinds of crops. Everybody worked. They supported themselves.Is it almost time to form some new co-ops? Co-ops can be made legally stronger these days, because they could be started as Private Membership associations. PMAs have been legally set in place as a sound structure, keeping standard government out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 07, 2023, 03:24:47 PMLast edit: March 07, 2023, 03:38:00 PM by Zlantann",
      "body": "Quote from: Kara3 on March 06, 2023, 08:36:28 PM~snip~Everybody must learn to cut their cost of living by all means. Learning addition skills and securing extra jobs might be another means of overcoming this hard life. The government must also make policies that will help alleviate the suffering of the masses. Quote from: BADecker on March 07, 2023, 12:26:39 AM~snip~I don't disagree with everything your said about cooperative. It is one of the potent solutions to the current food and other essential commodities crisis most people are facing due to this global economic problems. But currently, human needs has become very complex and might not be handled by cooperative. Human need more than food and other basic needs to live a comfortable life. And most of these essential commodities are controlled by big companies that are not willing to lose their influence on they have on the people. Data and airtime for internet and phone communication might not be basic needs but they are so essential that some people might not be able to survive without them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "March 07, 2023, 03:47:27 PM",
      "body": "the same condition actually happened in my country. and probably also occurs in the majority of all countries today. because inflation is currently happening globally. even Bank interest rates continue to be raised which means the inflation rate is still high.But in a situation like now we can't just expect action from the government. we have to have our own solution. start from frugal living. cut unnecessary costs. etc.we know this feels not easy. but we are forced to get used to and adapt to the situation and conditions that are happening. And as long as we still have jobs and income, we are still lucky. will be more worrying for those who do not have a job. because they must be living a life that is not easy nowadays. even in some countries the crime rate also seems to have increased. as a result of increasingly uncertain economic pressures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "March 07, 2023, 04:42:07 PM",
      "body": "sorry to hear that, some countries may experience higher inflation rates due to factors such as political instability, economic policies, or natural disasters, while others may have lower inflation rates due to more stable economic conditions or effective government policies.However, it's not uncommon for many people around the world to experience the same difficulties you described. Inflation can be a global issue that affects people's ability to afford basic necessities like food, housing, and healthcare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "March 07, 2023, 04:48:47 PM",
      "body": "In my country there is also inflation, but the level is not too high so that it still allows people to survive and again the government in my country is quite focused on reducing the inflation rate.I noticed your story seems more difficult than what I could imagine, maybe there are many parties related to the increase in inflation in your country, such as money laundering, excessive printing of money by the government and the lack of supply of commodity needs which causes scarcity and or hoarding of goods to increase market demand that aims to make more profit than sales, you need to pay attention to things like that and discuss with elements of society to find a way out in your current position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "March 07, 2023, 05:09:27 PM",
      "body": "It depends on each one experience... For me, only COVID years were suck, and the rest is fine because I'm doing rather well (thank God).The key here is your income level, the higher, the more it has resistance to bad economic conditions. We can't control the economy, but we can somewhat control our income. Look for better jobs or do multiple jobs (side hustling), if you are on the correct track, your well-being will always be better even if the economy is bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "March 07, 2023, 06:09:20 PM",
      "body": "You could blame it on inadequate production of goods/services to meet demand, and fiat currencies printed out of thin air mainly for consumption. If a particular product is in high demand and getting scarce, the price would naturally go up. So it's better to produce more of the products to meet demand than consuming them more probably by people who aren't very productive yet are getting alot of money they don't deserve. The problem with fiat currency is that they are easy to produce and not necessarily by hardwork...this typical makes them inflationary, because they are printed, accessed quickly and used up quickly, likely by people who don't deserve them... while it takes time and energy to earn currencies (like Bitcoin) that are based on hardwork and this makes the products they would be bought with to remain in the market longer, consequently making their supply to be higher than demand (especially in hardwork based society)while the workers are producing more products. Am for paying more to people who contribute/produce more and less to people who contribute/produce less. That could help in slowing down inflation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "March 07, 2023, 06:44:31 PM",
      "body": "Life is really becoming very difficult for unskilled people. I think that world is changing and people don't want to see that. Everyone wants unskilled jobs and there are tons of people who are willing to do unskilled job for little money. And people, who finish universities, find it very difficult to gain experience or do internship because competition is very high and old people don't want to say no to their chairs.But there is one big problem. There is a huge demand on skilled electricians, skilled plumbers, etc. Old people are retiring, new people don't want to learn while salaries in these fields are higher than in fields where you need 4 years degree + masters. The problem is mentality. If you are a plumber, people think that you are uneducated, no girl wants a guy who works as a plumber and looks dirty during his work, everyone wants a fit man with Porsche. This makes young men depressed and all they do is smoking weeds and drinking beers.Bonus! Politicians are accelerating this process because they want slaves, they throw away a little booze and tell people how okay it is that cost of living is increasing and how okay is it to be depressed and don't have money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 07, 2023, 06:49:58 PM",
      "body": "Quote from: Kara3 on March 06, 2023, 08:36:28 PMWhile growing up things were quite easy, an I also know that life was also easy for the common man, not until 2018 that things start changing for the worst, from then till now the rate at which inflation have struck my country to an all time high is so alarming.  Everyday price of things keeps on changing but the salaries of a civil servants still remain the same, the money that we use too feed from, buy water, pay rent, pay for light an even save from, now it can't even service our monthly needs for even half of the month. Most times I feel for people that have many children because too get basic needs in today's economy is very difficult,  the annoying part is that the government an it agencies are doing nothing or less about the cost control of goods and services in the state.An this has created a torn in the lives of many as situations keeps on getting worse by the day.Am wondering if it's same experience in other part of the world.Yes, it's the same here in the Philippines. Due to inflation, things have changed and it's really felt by normal to average citizens. Those people that are in power, don't feel much about it because they're earning more money and that's why if they really care, they'll make efforts of doing something within their powers. I also felt that during pre-pandemic, it was not that expensive at all but then with too many factors that have combined, everything has risen in its price. It's easier if things will be back again with less inflation and goods are less expensive but that's another thing to talk about because it is very unlikely that we'll see that moment again. This is the reason why each of us should do anything that we can to battle this inflation through having another source of income or jobs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "March 07, 2023, 06:59:44 PM",
      "body": "Since 2020, the condition is same in most part of the world but not for everyone. The rich is getting richer while poor is getting poorer that is the cycle happens st every worst situations. About the inflation rate recently the cost of groceries are getting higher and I can feelmit but it isn't that worse but surely it will affect the working class people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "March 07, 2023, 07:17:38 PM",
      "body": "Quote from: Kara3 on March 06, 2023, 08:36:28 PMWhile growing up things were quite easy, an I also know that life was also easy for the common man, not until 2018 that things start changing for the worst, from then till now the rate at which inflation have struck my country to an all time high is so alarming.  Everyday price of things keeps on changing but the salaries of a civil servants still remain the same, the money that we use too feed from, buy water, pay rent, pay for light an even save from, now it can't even service our monthly needs for even half of the month. Most times I feel for people that have many children because too get basic needs in today's economy is very difficult,  the annoying part is that the government an it agencies are doing nothing or less about the cost control of goods and services in the state.An this has created a torn in the lives of many as situations keeps on getting worse by the day.Am wondering if it's same experience in other part of the world.This problem is not only in your country, but in most countries around the world. It is getting difficult day by day for a common man to bear all the expenses of the family. The effects of inflation are affecting the middle income countries very hard, even in the developed countries it is becoming difficult for people to live. Because the impact of economic recession may cause more impact in the coming days and make our life more difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "March 07, 2023, 07:28:41 PM",
      "body": "The situation is different for everyone but yeah the cost of living is so high this days so many people are really struggling to eat one square meal.The very low income earners are not finding it funny in my locality, there is very little offline jobs and the majority don't have the right education to look outside the usual tradional jobs for opportunities online.It is hard for the majority of people but it also depends on how you able to sustain yourself through other ways. And the sad part of it is the situation may likely continue for some time as the government are not able to address the situation with inflation. Instead of going down, it keeps rising and making things very difficult for the common people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "March 07, 2023, 07:37:38 PM",
      "body": "Here in the EU it's bad since the covid lockdowns. First you couldn't go out, had limited access to services and all that, the police were chasing people who refused to wear masks. There were cases where you'd try to have a smoke so you'd uncover your face for a while and the police would chase you like a thief or some criminal. Then we got first signs of energy crisis where all the bills would go up by 10%. The only things that I don't have to pay more for are my phone and internet. Both of them cost me exactly what I had to pay 2 years ago but apart from that everything went up, especially garbage disposal, water and heating. Food also went up by a lot. Some things, especially vegetables that require additional heat and light in winter like tomatoes and peppers went up by 50%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "March 07, 2023, 11:08:57 PM",
      "body": "The cost of living started to increase as an on-set effect of the money printer first spinning up in the EU. Then, the contagion continued to spread and started to effect the rest of the globe. If it weren't for the economic strings pulled during COVID and the luck that people actually stayed indoors around the globe, causing a temporary economic shutdown and recovery, then the effect of the coming hyperinflation event would be much worse today.This is the very reason Bitcoin was created. Bitcoin use case will go into full effect as this situation rapidly gets worse. Who to blame? Corrupt government, greedy banks, ignorant people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "March 07, 2023, 11:53:19 PM",
      "body": "All around the world, inflation have hit harder and the living costs have reached the peak. During the same time more job cuts and lack of employment opportunities makes the scenario even worse. In recent years the oil price increase due to the war have caused big impact all around the world. When the fuel price increases, automatically each and everything from the basic needs increase in the price. It takes time, if not we're gonna get adopted to the situation. This is how the world gonna move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "March 07, 2023, 11:59:03 PM",
      "body": "The living cost may be different in any country yet i think that cost of living can still be considered as very high even when it came from the developed countries too. The bad thing is after covid there is not good recovery that happened with the global economic. The war that happened between ukraine and rusia was making the condition become even worst. The stability of countries in the world got affected caused by that. Some countries were not even able to pay the debt. The economic growth become even less than what was already expected. This also affects the minimum salaries that have applied in any country. Any goods become even more expensive than before. that's why almost all people are looking for income from doing side jobs. it's caused by the main job is not even enough anymore to keep your life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "March 08, 2023, 01:07:16 AM",
      "body": "Quote from: Kara3 on March 06, 2023, 08:36:28 PMWhile growing up things were quite easy, an I also know that life was also easy for the common man,If you think about it ,back in the day resources were plenty to go around for everyone but populations have grown and the process has turned out to be a competition to fight for the few limited resources out there...Quote from: Kara3 on March 06, 2023, 08:36:28 PM not until 2018 that things start changing for the worst, from then till now the rate at which inflation have struck my country to an all time high is so alarming.Unfortunately things like inflation are influenced by external factors beyond an individuals control and also how stable a countries political, technological influence is on an economy and it's people.Quote from: Kara3 on March 06, 2023, 08:36:28 PM  Everyday price of things keeps on changing but the salaries of a civil servants still remain the same, the money that we use too feed from, buy water, pay rent, pay for light an even save from, now it can't even service our monthly needs for even half of the month.The best way to survive low salaries is not to rely on one stream of income,try getting into other side hustles to help supplement the salary to make life much easier financially.Quote from: Kara3 on March 06, 2023, 08:36:28 PM Most times I feel for people that have many children because too get basic needs in today's economy is very difficult,Issue of kids..well If people are going to have tons of kid's it means they have the resources to take care of them, if not it's unfair to put your responsibility on others who know that they need to live within their means chose to be ignorant about it, let's take responsibility for our actions...hope am not stepping on people's toes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "March 08, 2023, 02:09:06 AM",
      "body": "Quote from: mu_enrico on March 07, 2023, 05:09:27 PMIt depends on each one experience... For me, only COVID years were suck, and the rest is fine because I'm doing rather well (thank God).The key here is your income level, the higher, the more it has resistance to bad economic conditions. We can't control the economy, but we can somewhat control our income. Look for better jobs or do multiple jobs (side hustling), if you are on the correct track, your well-being will always be better even if the economy is bad.Exactly, the key here is our income, don't expect the government to find a way or a solution to help us. Let's save ourselves, if our primary income is not enough to cover our daily needs, we should get extra jobs to earn extra income. Society is becoming harsher and harsher, and we should also find a way to adapt to everything, not wait for the government or someone to save us. We cannot expect that the world will be forever peaceful and free of any turbulence. I stopped lamenting about life and rushed to find a part-time job to save myself, now I have a very stable income and almost no longer worry about inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "March 08, 2023, 02:27:01 AM",
      "body": "No matter how we blame our government, they still can't move a single thing on this. Even mandating an increase in the minimum wage of employees takes time; how much more lowering the value of those things? Only you can help yourself, so it is better to move and find another source of income so that you can earn more and be able to buy our needs. As of the moment, those who are really having difficulties right now would be more struggling, so if ever we have a chance, let's help them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}