{
  "id": "topic_5454079",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "May 26, 2023, 10:22:33 AM",
  "content": "В данном топике хотелось бы порассуждать, сколько раз Россия нарушала подписанные международные договоры и документы. И чего теперь стоит подпись российских представителей на таких документах, и стоит ли эта подпись бумаги, на которой она стоит.   Да, вся последующая инфа взята из открытых источников, в основном из Википедии, проверить ее легко и просто. Поэтому мне лениво давать точные ссылки на оригиналы документов. Если у кого есть сомнения в моих – инфа легко находится.    А все дело в том, что 25.05.2023 Россия подписала документ о РАЗМЕЩЕНИИ ядерных вооружений в Беларуси. А перед этим, всего примерно 3 месяца назад она подписала с Китаем договор о НЕРАСПРОСТРАНЕНИИ ядерного оружия. А еще перед этим, в 1970 году СССР подписала договор о НЕРАСПРОСТРАНЕНИИ ядерного Оружия. А в 1995 году вот уже 170 стран мира подписали ПРОДЛЕНИЕ этого договора. О нераспространении. А тут его взяли, и распространили…    А в 1994 году был подписан Будапештский Меморандум, в котором говорится, что в обмен на Отказ Украины от ЯО на своей территории, Россия, США и Великобритания ГАРАНТИРУЮТ территориальную неприкосновенность Украины.    А еще когда-то, подписывая договор о Ленд Лизе, СССР гарантировал США его своевременную оплату. Оплату той техники, которая была неизрасходована в процессе боевых действий. И тоже его нарушила. Оплатила только часть суммы, и заняло это более 50 лет, когда уже инфляция изменила курс доллара в разы.   А еще Аэрофлот, который брал в лизинг иностранные самолеты, гарантировал, что вернет все эти самолеты по первому требованию лизингодателей, и опять все нарушил. Не вернул. То есть – украл.    А еще Россия, вступая в договор о ратификации ЕСПЧ обещала, что будет своевременно и четко исполнять все предписания этого органа. Но как только Навальный вернулся в Россию из Германии – его тут же арестовали.    А  еще СССР обещал в секретном протоколе к Пакту Молотова-Риббентроппа, что не будет захватывать Северную Буковину, которая исторически НИКОГДА не была частью России или СССР. Но захватил однако.    И это только малая часть тех нарушений международных договоров, которые нарушила Россия (СССР) за последние примерно 100 лет. Я тут писал чисто по памяти. Это может быть просто заготовкой, черновиком для большой серьезной статьи. Если кто-то возьмется.. Инфа эта несекретна – все можно нагуглить в инете.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454079",
  "comments": []
}