{
  "id": "topic_5432984",
  "title": "Newlifebtc",
  "author": "Newlifebtc",
  "created_time": "January 04, 2023, 12:41:32 PM",
  "content": "I can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432984",
  "comments": [
    {
      "author": "Twentyonepaylots",
      "created_time": "January 04, 2023, 03:35:10 PM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases. I find it very contradicting. I want you to know first the meaning of 'Reliable' and 'Volatile', coz what is something volatile cannot be reliable. Volatility comes with a risk, and you can't be sure if there's a risk on anything. While we praise bitcoin as fast, fungible, and secured, there's this fiat that pops up everywhere when banks want it that all of us needs to have for the system they have built on a shallow soil. Bitcoin has a use, but not for primary utility. You can't rely on bitcoin when you want to feed yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "January 04, 2023, 03:59:59 PM",
      "body": "I find it odd that two threads were created about this \"BITCOIN BANKING\" term. The other one is this. The term Bitcoin Banking doesn't really fit what you mean, you could just say investing in BTC and have them in a wallet.Anyway. The wallet wouldn't sync though if not connected to the internet. Obviously, you need to connect to be able to send it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 04, 2023, 04:08:19 PM",
      "body": "i personally find hoarding bitcoin easier than saving fiat. i dont need to ask a bank manager to deposit funds  i just whip out a bitcoin address and boom its done. 10min confirm and the funds are in my address.depositing fiat cash into a bank account is more of a hassle. above certain amounts banks ask where did money come from or where its going to. and suchas for the other person asking about volatility.if your worried about the ups or downs of a given day/month. you are not investing/saving long enough and instead day fearing the price by looking at the price too oftenpersonally when i first got my main stash of coins in the 2012-2014 period. i was monitoring prices daily. but i soon learned if im not cashing out that day, why worry about that days price.years later looking at the price and comparing it to the last time i price checked.. im happy with results (deflation wins after a few years of setting funds aside and not worrying about daily play pricing)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "January 04, 2023, 04:23:35 PM",
      "body": "They never understand the meaning of decentralised workflow. Why would you call it bitcoin banking and on top of that also compare it with the other banking system which we use for fiat. There is no comparison. The one we are in is free from the rules and regulations and thats why it is decentralised. The one you and me use for fiat is restricted, there are always rules and limitations and that's the main reason it is classified under centralised category. They are not the same. What you differentiated is solely based on technical differences. They can't be compared because both are good at it in their own space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "January 04, 2023, 05:08:46 PM",
      "body": "Quote from: Twentyonepaylots on January 04, 2023, 03:35:10 PMQuote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases. I find it very contradicting. I want you to know first the meaning of 'Reliable' and 'Volatile', coz what is something volatile cannot be reliable. Volatility comes with a risk, and you can't be sure if there's a risk on anything. While we praise bitcoin as fast, fungible, and secured, there's this fiat that pops up everywhere when banks want it that all of us needs to have for the system they have built on a shallow soil. Bitcoin has a use, but not for primary utility. You can't rely on bitcoin when you want to feed yourself.I think being reliable hasn't to do with volatility. For me, being reliable can mean that we can easily need the money when we need it and that is something Bitcoin can offer but not in the banks because often times they can lock up/ freeze our accounts or do some other alibi's when we are about to withdraw money. Risk is everywhere or on anything. Yes BTC is is risky due to its volatile state but the point is, its value can recover and it can even rise more. Banks or banks money (fiat) are much stable but there are inflations which can lessen the value of our fiat money. This can only be an added risk to what I said earlier about banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 04, 2023, 06:04:59 PM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.Lol! We all love bitcoin here! But that does not mean we will criticize the banking system and find flaws in it or even think about replacing the banking system. That should not be the case! Bitcoin can not challenge the retail banking segment in terms of speed and convenience. It can only challenge it in terms of anonymity. If you want to talk about speed and fees, bitcoin can only challenge international settlements. The entire banking system can't be replaced!Bitcoin is convenient for some and banking is convenient for some! They must not be compared because they are structurally different. If you send money to an incorrect account by mistake - you may get it back in the centralized banking system, but in bitcoin, there's no way! Every system has its pros and cons, let's respect that and choose what's convenient for you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 04, 2023, 07:56:59 PM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMthe only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.OP, it's probably that English is not your native or the second language either or you don't really know what you're talking about, and these lead to cases like the statement above which are just going to confuse people and more importantly, are completely wrong.The bitcoin network was never down!Of course the second thing about this happening in rare cases is also wrong but the most important thing is that the network is never down, there might be congestion issues, and your tx will take longer to get confirmed but at no point, has there been a situation when you sent a tx and there was no node to receive it and no miner to mine a block.Quote from: avikz on January 04, 2023, 06:04:59 PMThey must not be compared because they are structurally different. If you send money to an incorrect account by mistake - you may get it back in the centralized banking system, but in bitcoin, there's no way! Every system has its pros and cons, let's respect that and choose what's convenient for you! But some will never stop comparing them, and what's more frustrating doing so while taking only the good parts of one and comparing it to the negative of the other and declaring a straight winner, for a merchant this is perfect, every sale is final, for a customer, not so much!If we could have built a perfect system we would all be using it by now, but there isn't one, and probably will never be!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "January 04, 2023, 08:32:02 PM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.More reliable than...? A carrier pigeon? Faster than.. A message in a bottle? Anyone who understands Bitcoin and the blockchain couldn't possibly compare them to a well functioning banking system that is able to deliver instant money between accounts. Admittedly some countries are way behind when it comes to instant transfers between people's accounts, but other places like Europe have had this functionality for over a decade already. The existing banking network is much more efficient on most counts, but Bitcoin does have it's benefits - primarily sitting outside government interference and it is reasonably good for transporting medium to large size sums across borders avoiding unnecessary fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "January 04, 2023, 09:40:26 PM",
      "body": "Quote from: Flexystar on January 04, 2023, 04:23:35 PMThey never understand the meaning of decentralised workflow. Why would you call it bitcoin banking and on top of that also compare it with the other banking system which we use for fiat. There is no comparison. The one we are in is free from the rules and regulations and thats why it is decentralised. The one you and me use for fiat is restricted, there are always rules and limitations and that's the main reason it is classified under centralised category. They are not the same. What you differentiated is solely based on technical differences. They can't be compared because both are good at it in their own space. I think there is a comparison and you just stated the comparison between the two entities.Quote from: Twentyonepaylots on January 04, 2023, 03:35:10 PMYou can't rely on bitcoin when you want to feed yourself.But you can cash it out and buy yourself food.  The way you say bitcoin won't feed yourself simply imply that Bitcoin is worthless which is far from the truth.  Quote from: Twentyonepaylots on January 04, 2023, 03:35:10 PMQuote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases. I find it very contradicting. I want you to know first the meaning of 'Reliable' and 'Volatile', coz what is something volatile cannot be reliable. Volatility comes with a risk, and you can't be sure if there's a risk on anything. While we praise bitcoin as fast, fungible, and secured, there's this fiat that pops up everywhere when banks want it that all of us needs to have for the system they have built on a shallow soil. Bitcoin has a use, but not for primary utility. I think you are thinking too deeply, @op wanted to imply that keeping Bitcoin in self-custody is way better than a bank.  It does not tackle the price of Bitcoin which you are pointing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "January 04, 2023, 09:48:08 PM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.Its good for your online transactions but still banks will stat and they will continue to offer services as usual because fiat money is still needed and many are still hesitant to adopt cryptocurrency and Bitcoin. Regulation is preventing Bitcoin from taking its full capacity and we cannot blame them for doing this because Bitcoin is a big threat to the bank and that is the thing that they cannot accept easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "January 06, 2023, 06:08:16 AM",
      "body": "Quote from: goaldigger on January 04, 2023, 09:48:08 PMQuote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.Its good for your online transactions but still banks will stat and they will continue to offer services as usual because fiat money is still needed and many are still hesitant to adopt cryptocurrency and Bitcoin. Regulation is preventing Bitcoin from taking its full capacity and we cannot blame them for doing this because Bitcoin is a big threat to the bank and that is the thing that they cannot accept easily.How do you think that regulation will work for Bitcoin? The reason why Bitcoin was created is to give users the freedom from centralized power aka the government and everything about regulations smells government so I don't see how regulation will work here. The only projects that can be regulated in crypto space are the likes of XRP and other centralized projects including crypto exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "January 06, 2023, 06:35:10 AM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.    - What kind of bitcoin banking are you referring to? just be a specific mate for the knowledge of other members here in the forum who are not familiar with this kind of discussion in the forum.Is this Bitcoin banking you are referring to in regard to non-custodial wallets? or for centralized and decentralized exchange platforms?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "January 06, 2023, 06:41:11 AM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.There are two different conclusions that can be drawn from the term \"reliable\" that you used to describe bitcoin banking as fast and reliable. It is trustworthy because it is decentralized and does not require third-party approval before sending or receiving funds over the internet. We can say that it is safe to use for everyone.The nature of the coin's volatility is the second case. If I have a coin and it falls below the amount I left it the day before, I will be disappointed that I have lost some money; can this be called reliable again? So people's perspectives and approaches to it differ; after all, it is an alternative to save money to using the centralized means of saving money in fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "January 06, 2023, 07:35:30 AM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.The two important points I could infer from what you write here are \"reliable\" and \"fast.\" Are Bitcoin transactions fast? I would say yes, it's fast but not faster, especially when the user knows well about the mempool and uses a higher gas fee for the transactions while sending the BTC to an external wallet. The transaction should be completed in about 10 minutes, so it's still reasonable. While sending within the same wallet could be way faster.Now, it depends on what you are comparing it with, if it's fiat banking within the same country, then they are faster than Bitcoin, unless for the Swift Wire Transfer. Aside from banks, online payment systems' transfers are done instantly, not in minutes.Furthermore, the reliability of Bitcoin is being put into doubt these days because hacking is more pronounced, and even wallet companies and exchanges are less trusted these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "January 06, 2023, 10:24:51 AM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.You mean Be your Own Bank? (BYOB), there are still challenges though, first there should be at least an internet and then you need to make sure that the bitcoin address is correct because transactions are irreversible.Fast as in within minutes? maybe if you are using LN.But typically it make take a couple of hours if you are doing a normal bitcoin transaction and you also have to look at the network, if it is congested and you are in a hurry you might need to increased your fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "January 06, 2023, 12:55:32 PM",
      "body": "Quote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with down network but this is in rare cases.The good thing about Bitcoin is that no matter where you are, as long as you have an internet connection, you can send money through it, apart from the fact that the transaction is fast and the assets you have here are also safe.Just think that at any time you can make a deposit or withdrawal depending on the situation you need every day of your life. It is also one of the most trusted good investments for the future and is accepted by well-known large companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "January 06, 2023, 04:31:48 PM",
      "body": "Quote from: gunhell16 on January 06, 2023, 12:55:32 PMQuote from: Newlifebtc on January 04, 2023, 12:41:32 PMI can boldly say that Bitcoin Banking is more reliable and fast because Bitcoin transactions is been done through wallet, the only problem that may occur is if the wallet is not correct another challenge is if the transaction is been encountered with a down network but this is in rare cases.The good thing about Bitcoin is that no matter where you are, as long as you have an internet connection, you can send money through it, apart from the fact that the transaction is fast and the assets you have here are also safe.Just think that at any time you can make a deposit or withdrawal depending on the situation you need every day of your life. It is also one of the most trusted good investments for the future and is accepted by well-known large companies.Since I switched to Bitcoin banking, I started to enjoy the convenience that it could give. I never thought that I could transact freely without having to line up in banks or even ATMs just to withdraw and deposit. It's a time and life saver for everyone whose time is always limited during the day because of errands to run. I hope more people would appreciate and experience the same thing and see the importance of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 06, 2023, 07:34:56 PM",
      "body": "I believe in bitcoin so much but not so much I would be blind on some fact, yes you mentioned some disadvantages but you failed to add hack, ignorance, scam and so on.Bitcoin transactions is more preferable to me than that of the traditional banking system but joining bitcoin I haven’t failed to acknowledge some of the disadvantages and I have avoided losses through that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barbara44",
      "created_time": "January 06, 2023, 09:25:23 PM",
      "body": "That is not called bitcoin banking, that's just bitcoin itself. You could say bitcoin is more reliable and faster than fiat, and in some cases you are right, while in some other cases it's not. Right now, I can open up my phone and with just 7-8 clicks could pay my bill, could bitcoin do that? Of course not, which means in that case fiat is better than crypto.But, does it include it all? Of course not, I could send someone in USA 15 million dollars within 1 minute thanks to crypto, could I do it with fiat? Of course not. As you can see, which one is better depends on the situation and not a single true answer for all situations, it just doesn't work that way at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}