{
  "id": "topic_5422550",
  "title": "mandown",
  "author": "mandown",
  "created_time": "November 22, 2022, 07:24:52 AMLast edit: November 22, 2022, 08:00:03 AM by mandown",
  "content": "Paramız durmadan değer kaybediyor her geçen gün enflasyon altında eziliyoruz. Ne zaman dışarı çıksam 250-400 arası cebimden para çıkıyor bu ne saçma iştir. afedersin iyice işin boku çıkmaya başladıArkadaş günlük işçi yevmiyesi 150 lira 1Kg tereyağı 177 lira10 liranın altında meyve yok.2 kg yoğurt 50 lirabebek bezi fiyatları paket başı 500 liraBunlar lüks değil standart hayatın olağan durumunda kullanılan ürünler.Bilgisayar fiyatlarını saymıyorum bile geçtiğimiz yıl m1 mac almıştım 12 binliramıydı neydi şimdi 12 binliraya işe yarar bilgisayar malesef yok. Geçenlerde lcw'ye gittim birkaç ürün alayım dedim oda nesi abi 3 gün çalışacaksınki 1 swet alasın.Burada çıkıp kimse işçi maliyetleri demesin kalbinizi kırarım. sütün üretim maliyetine asgari ücret ne kadar giriyor acaba? veya marul'un. Milleti yıllarca yediler algıyla asgari zammın fiyatları etkilediği yalanına etkilemiyor değil ama abartıldığı kadar değil.Fiyat algımda bozuldu bir ürünün pahallı olup olmadığını artık anlayamıyorum. Sizde durumlar nedir?Not: SEFALET ENDEKSİNDE BİRİNCİYİZ.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422550",
  "comments": [
    {
      "author": "Phoenix Anka",
      "created_time": "November 22, 2022, 07:40:31 AM",
      "body": "LCW eskiden en uyguna veren kıyafet mağazasıydı ancak artık girince işlerin hiçte öyle olmadığını fiyat etiketlerine bakarak görebilirsiniz. Bu fiyatlarla ne kadar daha dayanılabilir bilmiyorum. Bir çok işyeri bunlara rağmen çalışandan çalmaya devam ediyorlar. Çalışanların maaşları üç kuruş aslında öyle çok bir maaşları yokken 5500 lira asgari ücret ödemeyen onlarca iş yeri var. Market alışverişi de keza o şekilde oldu artık. 1 kilo baklagil 40/50 lira olmuş. Pazara gidip 300-400 liradan aşağı dönebilen varsa alnından öperim biz 4 kişilik aile olarak beceremiyoruz. Ayda 2000 lira sadece pazara gidiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 22, 2022, 10:59:30 AM",
      "body": "Biraz önce 2-3 tane mandalina 3 portakal, 2 armut aldım bir de 3 adet kivi. 50 TL tuttu yaklaşık olarak.Aşırı pahalı geldi. Sabit maaş olunca da yetmiyor. Mutlaka ek gelir lazım. Tam da boğa mevsiminin olması gereken zaman ama ona da epey vakit var gibi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "November 22, 2022, 12:05:06 PM",
      "body": "Afedersin hocamda bir şeyin boku çıkar demişsin bokunun boku çıktı. 1 kilo ithal muz 50 TL en çok tükettiğim meyve. Yanına 3-5 bir şey daha alsam 500 lira sefaletin dibini yaşıyoruz moralimi bozmamaya çalışıyorum da nereye kadar. Temel ihtiyaçlara masraf yapmaktan artık tatil,elektronik gibi harcamaları tamamen listemden çıkarmış vaziyetteyim sadece hayatta kalmaya çalışıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "November 22, 2022, 12:09:07 PM",
      "body": "Quote from: ajanwalker on November 22, 2022, 10:59:30 AMBiraz önce 2-3 tane mandalina 3 portakal, 2 armut aldım bir de 3 adet kivi. 50 TL tuttu yaklaşık olarak.Aşırı pahalı geldi. Sabit maaş olunca da yetmiyor. Mutlaka ek gelir lazım. Tam da boğa mevsiminin olması gereken zaman ama ona da epey vakit var gibi Artık 50 TL para değil maalesef. Bakın harcamalarınıza herhangi bir marketten peynir zeytin almaya kalksanız kaç paramız gidecek? Maaşa ek gelir herkese şart. Maalesef Kemal Sunal filmlerine döndük her yerde ek iş arayan insanlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "November 22, 2022, 12:23:23 PM",
      "body": "Quote from: ajanwalker on November 22, 2022, 10:59:30 AMBiraz önce 2-3 tane mandalina 3 portakal, 2 armut aldım bir de 3 adet kivi. 50 TL tuttu yaklaşık olarak.Aşırı pahalı geldi. Sabit maaş olunca da yetmiyor. Mutlaka ek gelir lazım. Tam da boğa mevsiminin olması gereken zaman ama ona da epey vakit var gibi walla iyi almışın  :)ben sandım 100 200 verdim diycenenflasyon var btc düşüyor, altcoinler düşüyor, altın düşüyor, ilginçtir borsa yükseliyor. birçok arkadaşım tanıdığım borsaya kayalı baya oldu iyi de kazandı, ben elimdeki parayı koruyamıyorum maalesef para parayı çekiyor, yüksek meblağ para olsa btc ve altın alır beklerim, bir de arazi... enflasyona da alışmak gerek, insan çabuk adapte olan bir canlı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 22, 2022, 02:20:24 PM",
      "body": "Quote from: mandown on November 22, 2022, 07:24:52 AMParamız durmadan değer kaybediyor her geçen gün enflasyon altında eziliyoruz. Ne zaman dışarı çıksam 250-400 arası cebimden para çıkıyor bu ne saçma iştir. afedersin iyice işin boku çıkmaya başladıArkadaş günlük işçi yevmiyesi 150 lira 1Kg tereyağı 177 lira10 liranın altında meyve yok.2 kg yoğurt 50 lirabebek bezi fiyatları paket başı 500 liraBunlar lüks değil standart hayatın olağan durumunda kullanılan ürünler.Bilgisayar fiyatlarını saymıyorum bile geçtiğimiz yıl m1 mac almıştım 12 binliramıydı neydi şimdi 12 binliraya işe yarar bilgisayar malesef yok. Geçenlerde lcw'ye gittim birkaç ürün alayım dedim oda nesi abi 3 gün çalışacaksınki 1 swet alasın.Burada çıkıp kimse işçi maliyetleri demesin kalbinizi kırarım. sütün üretim maliyetine asgari ücret ne kadar giriyor acaba? veya marul'un. Milleti yıllarca yediler algıyla asgari zammın fiyatları etkilediği yalanına etkilemiyor değil ama abartıldığı kadar değil.Fiyat algımda bozuldu bir ürünün pahallı olup olmadığını artık anlayamıyorum. Sizde durumlar nedir?Not: SEFALET ENDEKSİNDE BİRİNCİYİZ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kastoriante",
      "created_time": "November 22, 2022, 03:44:44 PM",
      "body": "Reis'in suçu yok ha! İyi bir şey varsa tek başına Reis yapmıştır. Kötü bir şey varsa dış güçler, CHP, AKP'den ayrılanlar, halk, ev sahibi, marketler vs.yapmıştır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "November 22, 2022, 04:39:50 PM",
      "body": "Fiyat algım gerçekten saçma sapan bir hal aldı. Beklenmedik yerlere o kadar çok para harcıyoruz ki ne ucuz ne pahalı kavrayamaz hale geldik. Bir yandan yüksek fiyatlara alıştım diğer yandan bu nasıl bu para olur diye şaşırıyorum.LCW ya da Koton ayarında dandik yerlerde tişört 200, sweat 400 olunca internet indirimlerinde 500 liraya gördüğüm her şeyin üstüne atlar hale geldim. 1000 liraya polar görünce ucuz gelmeye başladı, diğer yandan 1 sene önce o paraya aynı markanın en baba montunu alıyorduk.Hangimizin maaşı 4-5'e katladı? Özel sektörde sağlam bir yeriniz yoksa her geçen gün fakirleşiyorsunuz, buna rağmen alışveriş merkezlerinin otoparkında araba koyacak yer bulamıyoruz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 22, 2022, 05:02:55 PM",
      "body": "Ceterus paribus diyelim ve market fiyatlarının dışındaki tüm etmenleri sabit tutalım ve sadece market fiyatlarına odaklanalım.Ahmet A mağazasının müdavimi olsun. Ahmet arkadaşımız haftalık olarak ihtiyaçlarını gidermek için cumartesi günleri bu markete giderek yumurta süt et vb ürünleri alarak mutfak alışverişini tamamlamaktadır. Bu alışveriş ile bir haftayı götürmektedir. İlk hafta gittiğinde cebinden 200 tl çıkmıştır. İkinci haftaya geldiğinde ise aynı ürünleri alabilmesi için cebinden tamı tamına 250 tl çıkmıştır. Kendi kendine hayıflanır ulan ne zamnlandı be diye. 3 hafta ise 300 tl ile günü sonlandırmıştır. 4.hafta 350 tl şeklinde devam etmektedir. Ahmet'in maaşı sabittir ancak aldığı ürünlerin fiyatı artmaktadır. Bunda bazı sebepler vardır bunlara bir göz atalım.1) Herkes Ahmet'in yaptığı gibi yapmamaktadır. Zam gelecek düşüncesiyle her hafta bir öncekinden daha fazlasını alarak stok yapmaktadırlar.2) Market satın alacağı ürünlere zam gelecek düşüncesiyle fiyatları arttırmaktadır.3) Ürünler ithal olduğu için dövizlerin yükselmesi bu ürünlerin birim maliyetini arttırmaktadır.4) Ürünlerin yerli olanları ise imalat sürecinde gerekli olan şeylerin dövizin yükselmesine bağlı olarak birim fiyatını arttırmasıdır. 5) Yerli üreticinin teşvik edilmemesi. Yani yerli üretime verilecek teşvikin sonuçlarının uzun vadeli olması sebebiyle ve yerli üreticinin hakettiği fiyattan çok daha azına ithal edilebilmesi (anlık noktada) ithal yoluna gidilmesinin önünü açmaktadır.Ahmet arkadaşımız bu ülkenin %42'sinden bir tanesidir (https://www.veripie.com.tr/turkiyenin-42si-asgari-ucretle-calisiyor/).  Market fiyatlarından etkilenen bu ülkenin neredeyse yarısından bir tanesidir. Ancak sosyal medyada hali vakti yerinde olan (Nasıl olduğu muamma olan çoğunluktan bir kısmı) aşırı sağcı zihniyetin şükür et demesine maruz kalmış birisidir. Bir eli yağda bir eli balda olanların ülke çok iyi demesine dişi sıkarak ya sabır demiş birisidir. Yukarıda benim saymayı unuttuğum birçok nokta olabilir. Burada Ahmet'in tek suçu 1. basamaktaki durumu yerine getirmemesidir. Gerçi kendi yuvasını düşünüp böyle birşeyi yaptığı zamanda bu fiyatların sorumlusuymuş gibi muamele görecektir. Yani Ahmet'in işi zordur Mehmet'in işi zordur bu ülkede. Ancak bizi kıskanan Alamancı Hans'ın işi kolaydır, Eyy amariga'daki John'un işi kebaptır, ya habibi diyen arap burada rahatlıkla şişasını ( Nargile ) tüttürebilir ama bizim Ahmet'imiz Mehmet'imiz ömrünü tüketir. Ne zaman ki bu ülkede üretilen bir mamül yurtdışında bizden daha pahalıya satılır, ne zaman ki bizim 18-25 yaşındaki gençlerimiz yaz tatilinde Amerika'ya mı gitsem, Avrupa'ya mı gitsem der işte o zaman düzelir bu devran. O zamana kadar biz bunları konuşuruz, elin adamı hayatını yaşar bu topraklarda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "November 23, 2022, 06:36:22 PM",
      "body": "Birader bı telefonunu çıkar, çıkar bı telefonunu, telefonunu bı çıkar 😅😅😅 bu mevzular ne zaman gündeme gelse aklı kit kesim aynı cumleyi üç farklı versiyonu ile kullanabilmenin ötesinde bir argüman uretemiyor. Ve maalesef bu kesim ülkenin en az yarısı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}