{
  "id": "topic_5475199",
  "title": "Hewlet",
  "author": "Hewlet",
  "created_time": "November 23, 2023, 12:53:13 PM",
  "content": "There's this challenge I'm having when it comes to posting a link inside a text on the forum, what I mean is that, I have seen people dropping links I there threads and comment in this Fillippones thread https://bitcointalk.org/index.php?topic=5412657.0 they kind of encript the link inside the text and what you see is only the text that could be the title of there post of replies, i wanted to do this but I have tried it severally but couldn't. I would appreciate if someone can help out with this or at least drop a useful link that can guide me on how to go about this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475199",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "November 23, 2023, 12:55:02 PM",
      "body": "This is how you do it.  Code:[url=YOURLINKHERE]YOUR TEXT HERE[/url]Just copy it and edit it the way you like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 23, 2023, 12:59:34 PM",
      "body": "Just like this: You are HewletCode:[url=https://bitcointalk.org/index.php?action=profile;u=3573630]You are Hewlet[/url]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "November 23, 2023, 01:00:48 PM",
      "body": "Cantasy has actually shown the right way to encrypt your link into a text, but moving forward here is something I normally do when something is new to me on the forum posts. I just click on the quote option of that user that I think is post arrangement is unique and everything comes out plain. You will see exactly how he included each link and other stuffs like even creating a table",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "November 23, 2023, 01:02:25 PM",
      "body": "Instead of generating duplicate posts, use the forum search function the next time. Given that you have been on the forum for some time and have progressed somewhat, I think you need to be familiar with using the Ninjastic search engine and the forum search button. Go through the post below your answer is there. How to add hyperlink to a keyboard or phrase on this forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "November 23, 2023, 01:35:20 PM",
      "body": "Some members has shared how can you post a link with any text so I am adding something different I will show that how can you set a picture on link. By touching the picture you will be redirected to the link. First of all copy you should have two things first the video or website link and second is the photo link on which you want to set on the link. Use this code.Code:[url= Paste the link here of video or website][img]post the photo link here[/img][/url]Here is the example.Code:[url=https://youtu.be/41JCpzvnn_0?si=BAzd17dJKhs-hhuP][img]https://i.ibb.co/VT3jCn7/Screenshot-20231123-182327-You-Tube.jpg[/img][/url]Here is the result touch the photo you will be redirected to the link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "November 23, 2023, 01:51:55 PM",
      "body": "Quote from: Nheer on November 23, 2023, 01:02:25 PMInstead of generating duplicate posts, use the forum search function the next time. Given that you have been on the forum for some time and have progressed somewhat, I think you need to be familiar with using the Ninjastic search engine and the forum search button. Go through the post below your answer is there. How to add hyperlink to a keyboard or phrase on this forumExactly, but the forum search is not working perfectly especially when you are new and don’t know how to use it, that is why we experience so many duplicate threads from newbies and sometimes from old members because they couldn’t find any thread that is related to the post they are about to do.The link you provided is an old link, although it explains everything the OP need, and @Cantsay have provided the OP with the right response he/she needs.To the OP, when next you see a comment or post that you are finding it difficult to do the same, you can quote the post and see the pattern of the post’s arrangement and learn to make your own in that same pattern, I think you can learn fast with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "November 23, 2023, 02:02:12 PM",
      "body": "Quote from: Hewlet on November 23, 2023, 12:53:13 PMHow can I encrypt a link inside a text before posting? Hi Hewlet. The method has been answered by several users. Good luck. Appreciate those who have answered.Quote from: Nheer on November 23, 2023, 01:02:25 PMInstead of generating duplicate posts, use the forum search function the next time. Given that you have been on the forum for some time and have progressed somewhat, I think you need to be familiar with using the Ninjastic search engine and the forum search button. He's not wrong by asking how to insert links into posts because OP doesn't know. You are also not wrong with this answer because with your answer, OP will use the search function to avoid duplicate posts with the same purpose.Quote from: Nheer on November 23, 2023, 01:02:25 PMGo through the post below your answer is there. How to add hyperlink to a keyboard or phrase on this forumI've experienced things like the OP, but I didn't ask by making a post to get answers. I took the liberty to utilize the quote button function on user posts which I considered to have advantages in making neat posts to find out how the user did it.Not just how to insert links, but all the things I didn't know including how to create tables and how to create text colors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 23, 2023, 02:12:59 PM",
      "body": "Both Cantsay and _act_ gave the right illustration of how to do that, however i will advise a strong warning on doing this for every newbie because there must not be any mistake in doing so, you mus not add to the link address or the format used to make the link embedded likewise you must bot remove from it neither, as simple as it is can lead to having another meaning if you made a mistake from how you're editing the format by single omission or addition, i may not encourage newbies for doing that especially when the links are much except such newbie is well exposed and have enough patience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 23, 2023, 02:35:43 PM",
      "body": "Instructions on how to use BBCodeSMF Bulletin Board CodeAdding link in your text is easy, some members told you, but with two more sources I share, you can learn to use more BBcode.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 23, 2023, 02:36:51 PM",
      "body": "Quote from: Hewlet on November 23, 2023, 12:53:13 PMThere's this challenge I'm having when it comes to posting a link inside a text on the forum, what I mean is that, I have seen people dropping links I there threads and comment in this Fillippones thread https://bitcointalk.org/index.php?topic=5412657.0 they kind of encript the link inside the text and what you see is only the text that could be the title of there post of replies, i wanted to do this but I have tried it severally but couldn't. I would appreciate if someone can help out with this or at least drop a useful link that can guide me on how to go about this.You have gotten the illustration already so I think it's best now you actually lock this thread to avoid more similar and out of points answer to this particular question. I think you should also try out the superbot notifier so that you would get notified whenever someone quotes or mentioned you to keep track of your discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Winterfrost",
      "created_time": "November 23, 2023, 02:42:02 PM",
      "body": "You've already received an answer to your question. However, I like to double-check links before clicking on them by hovering my mouse over the link. The actual link will appear in the bottom left corner of your browser. This simple step can help prevent you from visiting harmful or phishing websites or accidentally downloading malware in your device. Always put it into consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "November 23, 2023, 02:44:11 PM",
      "body": "There's no need to panic and there's no need to consider this as a challenge for you, mate, because here on this forum there will always be help coming when someone experiences an obstacle or challenge like the one you mentioned. And from some of the comments that have been given by many people here, I think you just need to follow directions that are easier for you to understand such as those made by @Cantsay, @_act_ and @Publictalk792. All three are quite clear and very accurate in giving directions to you as the OP",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lamkuthang",
      "created_time": "November 23, 2023, 04:25:38 PM",
      "body": "Or follow the same method by quote one of the posts that relates to your point and include what you need. To make it easier, you can also use step@Hewlet or @Fara Chan. It's easy as long as you want to and I used to be like that too, but I still look for ways to make it easy and right and even if I'm wrong, that's normal my friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "November 23, 2023, 08:25:30 PM",
      "body": "You are talking about the hyperlink option, it can not be called encrypting a text with a link instead we call it a hyperlink and we do that by using the link tags, to apply them write a text in which you want to insert link and after writing that text select the whole text and then press this button that looks like globe which will automatically insert link tags around your selected tax.And then you have to write = is equal to sign in the first tag like this  and after the sign of = you have to insert the link that you want to hyperlink here. I hope this short guide will be of some help to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}