{
  "id": "topic_5447716",
  "title": "GalactusProtocol",
  "author": "GalactusProtocol",
  "created_time": "April 05, 2023, 07:54:55 PM",
  "content": "Evening Captains, Me and the team at Galactus Protocol are proud to bring you a new Videogame and crypto ecosystem.We are launching on the Arbitrum network, migrating to ZkSync and expanding to all other chains.Our presale start date is april 6th 2023 (thursday) At 3:00pm ESTThe presale will be hosted in the telegram with an AMA.Softcap 30eth, hardcap 80eth.We will be giving out tutorials on how to use our website, and buy from our Dex in telegram.We are partnering with numerous creators to make it great!This project is NOT a simple pump and dump crypto token, it is an entire mutliplayer video game experience.Stake to earn, Play to earn, and the best part is it's all Free to play, and NOT pay2win.Our socials and links will be posted to our linktree and twitter.linktr.ee/GalactusProtocoltwitter.com/GalactusPRTCLt.me/GalactusProtocolIf you have any questions, feel free to ask me here or on telegram.We're a bit new to Bitcointalk but I've used a forum before so I can work my way around.We hope to see you join the fight, For Galactus!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447716",
  "comments": [
    {
      "author": "FP91G",
      "created_time": "April 07, 2023, 12:38:37 PM",
      "body": "Where are the video games? I only found 30 seconds and it's very short.https://www.youtube.com/watch?v=uCeP29qppfY",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 31, 2023, 07:06:06 PM",
      "body": "Quote from: FP91G on April 07, 2023, 12:38:37 PMWhere are the video games? I only found 30 seconds and it's very short.https://www.youtube.com/watch?v=uCeP29qppfYYeah there's not much to review. Browser says that \"Your connection isn't private\" on the homepage. Even the lores in the medium seem like something i tried to do with chatgpt for a fictional game. Airdrop needs my phonenumber and email which is a big no-no.I guess we'll just have to wait for the product. I mean no one should buy anything or register to any sort of airdrop when there's only a videoclip about a game, that actually could be a little bit interesting. Not enough for adoption unless they have something out of this world, and original game design.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}