{
  "id": "topic_5461545",
  "title": "InfinityCrypto",
  "author": "InfinityCrypto",
  "created_time": "July 31, 2023, 04:59:48 AM",
  "content": "Is DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461545",
  "comments": [
    {
      "author": "Pandji02",
      "created_time": "July 31, 2023, 05:24:50 AM",
      "body": "DOGE is a memecoin. Not a bad one but still. Do you really think it can be the cause for the bright crypto future?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "July 31, 2023, 07:24:09 AM",
      "body": "-      yep you're right mate, a class of meme coin first here booming cryptocurrency. Think about it for a long time that it was only around 15-20 sats before, then after a few years when Elon Musk made an announcement, suddenly the value process of doge went up in the market.That's why, if I go shopping, it's doge meme coin is still seen as more trusted to keep up with the trend of the Bitcoin bull run next year. And I think it's still possible that the value will kick when the bull run comes...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 31, 2023, 07:27:49 AM",
      "body": "Quote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?Because of what Elon Musk is doing with it and you think it is the coin to first be considered? Bitcoin is the coin to be considered. Doge is just a meme coin (coin of no reason than to speculate its prices), although while many other coins have no utilities even as they are not meme coins. Quote from: Pandji02 on July 31, 2023, 05:24:50 AMDOGE is a memecoin. Not a bad one but still. Do you really think it can be the cause for the bright crypto future?Doge has nothing to do with crypto bright future. Let us expect more manipulation from Elon Musk though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rybako",
      "created_time": "July 31, 2023, 07:33:38 AM",
      "body": "DOGE Coin’s rise is a fleeting internet meme phenomenon, because it’s based on a dog that can’t even spell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cvetik56",
      "created_time": "July 31, 2023, 07:41:38 AM",
      "body": "Quote from: _act_ on July 31, 2023, 07:27:49 AMQuote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?Because of what Elon Musk is doing with it and you think it is the coin to first be considered? Bitcoin is the coin to be considered. Doge is just a meme coin (coin of no reason than to speculate its prices), although while many other coins have no utilities even as they are not meme coins. Quote from: Pandji02 on July 31, 2023, 05:24:50 AMDOGE is a memecoin. Not a bad one but still. Do you really think it can be the cause for the bright crypto future?Doge has nothing to do with crypto bright future. Let us expect more manipulation from Elon Musk though.Yes, indeed. They say that DOGE brought a lot of people to crypto. But a lot of them saw how it went from $0.7 to $0.1 and lower and abandoned crypto for good. It's definitely not the coin to consider it as some kind of messiah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 31, 2023, 01:00:47 PM",
      "body": "DOGE is a meme coin based only on that,a meme dog which looks cute I must admit  however it is not based on any technological power aimed at solved some real problems by it.Any coin in such category is to be taken not that seriously as it is only here for fun mostly and whatever happens happens,if it increases it will make many people happy,the ones who bought it after it massively exploded because of a philanthropist like Elon Musk backed it up,soon to go down and deeper.We cannot expect anything from this coin and surely this coin is not some coin which we can take as a measurement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "July 31, 2023, 01:46:10 PM",
      "body": "Quote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?How does a particular coin’s rise will lead to entire rise of the cryptocurrency. To be honest I don’t see any capability in this coin. These coins are only used by the bulls to make profits for themselves. They just increase the hype of the coin. And before that they buy large amount of coins. Now seeing the hype people starts buying the coin and this leads to increase in demand. Hence price goes up and the bulls sells the coins and make huge profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "July 31, 2023, 02:28:54 PM",
      "body": "Some used doge coin as a signal to determine the trend in the crypto market while there are also people who saw that as nothing rather than pump and dump coin. It depends on you about how you are valuing it right now. I meant i can't sure about that caused by there are so many coincidences while meme bull trend sometime was just a short term trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 31, 2023, 02:53:18 PM",
      "body": "Quote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?Crypto has risen a long time ago thanks to Bitcoin. It's not a sign of the rise of crypto but it's a sign that there are still people that believe in meme coins. Well, can say that Dogecoin could be or couldn't be an exception but since you are able to mention the fleeting meme craze then that could be it. If it's not for Dogecoin then there will be no shiba coin, pepe, and other inu coins that have been made due to the fact that many investors have followed them a lot for the bull run. Let's say that the craze was totally big during those times but it's also dried up during the bear market so many investors have lost their grip with those types of projects that have been proliferated by that season. And if there will be remaining meme coins in the market, many will not have any single doubt with the one that they're going to choose and that's Doge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "July 31, 2023, 03:45:48 PM",
      "body": "Quote from: Nrcewker on July 31, 2023, 01:46:10 PMQuote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?How does a particular coin’s rise will lead to entire rise of the cryptocurrency. To be honest I don’t see any capability in this coin. These coins are only used by the bulls to make profits for themselves. They just increase the hype of the coin. And before that they buy large amount of coins. Now seeing the hype people starts buying the coin and this leads to increase in demand. Hence price goes up and the bulls sells the coins and make huge profits.NO, I think it started with the rise of bitcoin after the halving and went bullish then other cryptocurrencies followed the market cycle causing the rise or called altcoin season.Behind Doge there is Elon Musk as an influence on this meme coin at least by recently changing the twitter logo to doge it is a sign that he loves the dogecoin meme coin, behind all that it would be very believable if one more tweet from Elon musk then he is creating hype for his coin.The possibility of doge coins can explode again, but don't be too trusting anything can happen later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 31, 2023, 03:52:39 PM",
      "body": "If DOGE reflects the future of cryptocurrencies, cryptocurrencies have no future. Cryptocurrencies are a means of payment, a decentralized system, not a manipulated asset whose price depends on one person's tweet. I see a perfect future of cryptocurrencies without shitcoins like DOGE, where people are zombified through social media and they go to buy these shitcoins at a high price. DOGE used to be perceived by the community as a utilitarian coin for liquidity transfer, now DOGE is tightly associated only with Ilon Musk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "July 31, 2023, 05:00:49 PM",
      "body": "Quote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?I don't know about Dogecoin's rise being a sign of the future of cryptocurrencies but I do know that Doge isn't just an ordinary memecoin. No, it's not even though it was created as joke. I've used it a few times and I can say that it's speed and ease of transaction confirmation is commendable. For those saying it's just a meme coin, they should pause and ask themselves why Doge is still thriving till date. What happened to most of the top listed coins that are dead now while Doge isn't?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 31, 2023, 10:53:04 PM",
      "body": "Quote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?Imagine this, where is Dogecoin place if Elon Musk did not hype it, it will remain an unpopular meme coin we all come to love in the past before the hype people are praising Dogecoin and its community for staying put over the years when it's just a clone of Bitcoin with a very huge supply until one day a powerful and richest man on Earth decides to hype and the rest is history, majority of investors are profit driven where the money is this is where investors will lean towards as long as Elon supports Doge it will remain on top, but it will never topple Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "July 31, 2023, 11:05:09 PM",
      "body": "its just meme phenomenon nothing more, it was heavily shilled by elon without any proper reasoning other than for meme so I could pretty much classify this as just meme.the thing with these meme coin rally in general is that, despite the fact that they gained so massive market capitalisation, they don't really innovate and contributes towards the development of technology.at best they are just being used for speculation tool and heavily manipulated ones at that.so basically its just meme and speculation, nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "August 01, 2023, 01:35:30 AM",
      "body": "Quote from: InfinityCrypto on July 31, 2023, 04:59:48 AMIs DOGE Coin's Rise a Sign of the Future of Cryptocurrencies, or a Fleeting Internet Meme Phenomenon?The later one, Just like stock markets, there's individuality to each cryptocurrency while there's herd mentality when it comes to bull and bear trend. But the meme trend, i.e. making the price of a coin rise without any prospects of future is more prominent on cryptocurrencies than on stocks. It's like gamestop rise but daily and on different coins. Dogecoin is still a good coin to predict for swings as it's one of the coin of interest of iconic billionaire Elon Musk. Any further xts from him anytime, the coin would jump a 20%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dlightag",
      "created_time": "August 01, 2023, 08:41:58 AM",
      "body": "DOGE was a meme Coin at the earliest stage most people didn't invest on the Coin, before was adopted by the Elon musk, using DOGE Coin as a means of payment in his company, that makes DOGE Coin price pump unbelievable, that is still have future potential in the cryptocurrency industries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "August 01, 2023, 10:16:33 AM",
      "body": "Quote from: dlightag on August 01, 2023, 08:41:58 AMDOGE was a meme Coin at the earliest stage most people didn't invest on the Coin, before was adopted by the Elon musk, using DOGE Coin as a means of payment in his company, that makes DOGE Coin price pump unbelievable, that is still have future potential in the cryptocurrency industries. Many didn't invest but at the same time many have bought and kept it. Many were able to cash out during Elon's time of hyping it and when it has reached the peak.I remember that Vitalik also have sold his Dogecoins and made it to the public that he's going to donate his profits. IIRC.I just can't remember if Elon actually adopted Dogecoin as payment to any of his companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "August 01, 2023, 11:43:50 AM",
      "body": "It brought attention when Elon Musk joined the Dogecoin run. But before that, it was just silent, and not most people know about it. It's just there, existing. Now, because of what EM did many developers tried to recreate the same thing and expect to witness the same effect as how Doge did. But, let's face it, that won't happen, I hope. I am good with one meme coin in the market, creating more will diversify the money that is supposed to go to other projects with real use base backgrounds. Or, are we just going to waste our time and money joking around with this type of coin which we all know will not really help the technology of the future? They are just there for the hype and for whales to make money after manipulating it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 01, 2023, 12:00:21 PM",
      "body": "DOGE’s rise can be seen as both a sign of the future of cryptocurrencies & a fleeting internet meme phenomenon. Its popularity & value showcase the increasing acceptance of digital currencies as well as the power of online communities to drive investment. The thing is DOGE’s origins as a meme and its lack of substantial technological advancements raise doubt about its long term viability & whether it can compete with more established cryptocurrencies. Only time will tell its true significance in the crypto world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}