{
  "id": "topic_5457528",
  "title": "tg88",
  "author": "tg88",
  "created_time": "June 25, 2023, 01:14:13 PM",
  "content": "Vi esse video hoje do Denny Torres e me chamou bastante atenção, tive que assistir  JASMINER - NOVA ASIC DE MINERAÇÃO - ASIC silenciosa e eficienteO vídeo mostra uma ASIC de ETC que consome 400 watts e tem uma potencia de aproximadamente 1 Ghs oque é super eficiente. A maquina pesa 15 Kg  e custa ~2200 dólares e é ai que eu fiquei curioso.... Como ele trouxe isso pro Brasil e quanto pagou de taxa?No vídeo ele descreve que utilizou um serviço de redirecionamento mas não deixa claro qual o valor pagou de imposto e acho que foi proposital pois ele pagou bem pouco imposto... Após muito procura nos comentários ele acaba citando o valor que foi apenas R$ 800 em taxas.Precisa ter coragem mas comprova que é possível ter acesso a ASIC's no Brasil a preço competitivo.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457528",
  "comments": [
    {
      "author": "rdluffy",
      "created_time": "June 25, 2023, 01:54:57 PM",
      "body": "Ainda vou assistir o vídeo, mas isso já me chamou a atenção:Quoteconsome 400 watts e tem uma potencia de aproximadamente 1 GhsCara, se falasse pra nós lá em 2017~2018 eu nem acreditaria. Com as nossas antigas RX 580, era 400 watts em 2 placas, atingindo máximo de 60mhs hahahaIncrível como em questão de poucos anos eles atingiram uma eficiência enorme em relação às antigas placasSe você pensar no preço também o complicado é importar e você não saber as taxas ou se irão barrar na alfândega, mas 2200 dólares nem é muita coisa se você comparar também com RTX 3080 custando 10 mil reais há algum tempo atrás",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 26, 2023, 12:40:38 AM",
      "body": "Quote from: rdluffy on June 25, 2023, 01:54:57 PMAinda vou assistir o vídeo, mas isso já me chamou a atenção:Quoteconsome 400 watts e tem uma potencia de aproximadamente 1 GhsCara, se falasse pra nós lá em 2017~2018 eu nem acreditaria. Com as nossas antigas RX 580, era 400 watts em 2 placas, atingindo máximo de 60mhs hahahaIncrível como em questão de poucos anos eles atingiram uma eficiência enorme em relação às antigas placasSe você pensar no preço também o complicado é importar e você não saber as taxas ou se irão barrar na alfândega, mas 2200 dólares nem é muita coisa se você comparar também com RTX 3080 custando 10 mil reais há algum tempo atrásVocê previu o conteúdo sem ne mesmo assistir o vídeo, achei engraçado pois no vídeo ele faz exatamente um \"flashback\" dá época que ele iniciou na mineração e tinha quase 1 Ghs na rede ETH justamente usando RX 580 e gastando um absurdo de energia pra isso... É bem interessante, achei o vídeo muito bem feito.Mas realmente tem que ter coragem para importar algo de valor mais considerável e com um peso desses 15 kg é pesadão, difícil passar sem chamar atenção.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jpouza",
      "created_time": "June 26, 2023, 10:36:00 AM",
      "body": "Quote from: tg88 on June 25, 2023, 01:14:13 PMVi esse video hoje do Denny Torres e me chamou bastante atenção, tive que assistir  JASMINER - NOVA ASIC DE MINERAÇÃO - ASIC silenciosa e eficienteO vídeo mostra uma ASIC de ETC que consome 400 watts e tem uma potencia de aproximadamente 1 Ghs oque é super eficiente. A maquina pesa 15 Kg  e custa ~2200 dólares e é ai que eu fiquei curioso.... Como ele trouxe isso pro Brasil e quanto pagou de taxa?No vídeo ele descreve que utilizou um serviço de redirecionamento mas não deixa claro qual o valor pagou de imposto e acho que foi proposital pois ele pagou bem pouco imposto... Após muito procura nos comentários ele acaba citando o valor que foi apenas R$ 800 em taxas.Precisa ter coragem mas comprova que é possível ter acesso a ASIC's no Brasil a preço competitivo.Resumindo, ele não pagou o que deveria de impostos.  Assistia o canal dele desde quando ele contava toda a história da vida dele...até que ele conseguiu se sair bem da saia justa que estava, hj tem até painel solar na casa com autonomia para 1000W.Como todas ASICS desde os primórdios, esses modelos sendo vendidos na atualidade já devem ter sido usados pela própria empresa já faz algum tempo, apesar do lucro atual que ele demonstou de 2,86USD/dia, a probabilidade é que para a fabricante esse valor já não seja viável, frente a isso, colocam os equipamentos a venda por um preço relativamente alto e disponibilizam para o público em geral, é uma estratégia boa para capitalizar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 26, 2023, 07:17:49 PM",
      "body": "Quote from: jpouza on June 26, 2023, 10:36:00 AMComo todas ASICS desde os primórdios, esses modelos sendo vendidos na atualidade já devem ter sido usados pela própria empresa já faz algum tempo, apesar do lucro atual que ele demonstou de 2,86USD/dia, a probabilidade é que para a fabricante esse valor já não seja viável, frente a isso, colocam os equipamentos a venda por um preço relativamente alto e disponibilizam para o público em geral, é uma estratégia boa para capitalizar.E para os mineradores em geral é viável?Precisa de quase 4 anos, para conseguir recuperar esse valor de compra.Realmente, começo achar que algo no setor da mineração, que anda-me a escapar...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 26, 2023, 11:45:59 PM",
      "body": "Quote from: joker_josue on June 26, 2023, 07:17:49 PME para os mineradores em geral é viável?Precisa de quase 4 anos, para conseguir recuperar esse valor de compra.Realmente, começo achar que algo no setor da mineração, que anda-me a escapar...  No caso dele que já fez investimento em painéis solares e possui um canal sobre o assunto com quase 200 mil inscritos acho que vale a pena nem que seja só para movimentar e alcançar o ROI da ASIC e dos painéis. No nosso caso já não vale a pena a menos que estivesse visualizando que ETC tenha um amplo uso no futuro que faria sua cotação multiplicar algumas vezes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jpouza",
      "created_time": "June 27, 2023, 01:33:43 AM",
      "body": "Quote from: joker_josue on June 26, 2023, 07:17:49 PMQuote from: jpouza on June 26, 2023, 10:36:00 AMComo todas ASICS desde os primórdios, esses modelos sendo vendidos na atualidade já devem ter sido usados pela própria empresa já faz algum tempo, apesar do lucro atual que ele demonstou de 2,86USD/dia, a probabilidade é que para a fabricante esse valor já não seja viável, frente a isso, colocam os equipamentos a venda por um preço relativamente alto e disponibilizam para o público em geral, é uma estratégia boa para capitalizar.E para os mineradores em geral é viável?Precisa de quase 4 anos, para conseguir recuperar esse valor de compra.Realmente, começo achar que algo no setor da mineração, que anda-me a escapar...  ASIC nunca foi e nunca será viável aos pequenos miners domésticos.Somente as farms que tem escala ou quem é maker sai ganhando nesse jogo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 27, 2023, 06:33:54 AM",
      "body": "Quote from: tg88 on June 26, 2023, 11:45:59 PMNo nosso caso já não vale a pena a menos que estivesse visualizando que ETC tenha um amplo uso no futuro que faria sua cotação multiplicar algumas vezes.Como achas que o ETC iria ter um amplo uso no futuro? Em que situações isso poderia acontecer?Quote from: jpouza on June 27, 2023, 01:33:43 AMASIC nunca foi e nunca será viável aos pequenos miners domésticos.Depende... Alguém que entrou logo no inicio, consegue ir gerindo a troca de ASIC e continuar a ser viável.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jpouza",
      "created_time": "June 27, 2023, 09:31:36 AM",
      "body": "Quote from: joker_josue on June 27, 2023, 06:33:54 AMQuote from: tg88 on June 26, 2023, 11:45:59 PMNo nosso caso já não vale a pena a menos que estivesse visualizando que ETC tenha um amplo uso no futuro que faria sua cotação multiplicar algumas vezes.Como achas que o ETC iria ter um amplo uso no futuro? Em que situações isso poderia acontecer?Quote from: jpouza on June 27, 2023, 01:33:43 AMASIC nunca foi e nunca será viável aos pequenos miners domésticos.Depende... Alguém que entrou logo no inicio, consegue ir gerindo a troca de ASIC e continuar a ser viável.Não tem como joker, as máquinas não são disponibilizadas logo de início.Lembro-me dessa estratégia sendo usada desde a falida KnCMiner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 27, 2023, 10:47:07 AM",
      "body": "Quote from: jpouza on June 27, 2023, 09:31:36 AMNão tem como joker, as máquinas não são disponibilizadas logo de início.Quando falo entrar no inicio, falo quem entrou na mineração ASIC em 2013-2014.Quem entrou nessa altura, consegui ir renovando as maquinas, mesmo sendo um minerador pequeno.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jpouza",
      "created_time": "June 27, 2023, 11:05:53 AM",
      "body": "Quote from: joker_josue on June 27, 2023, 10:47:07 AMQuote from: jpouza on June 27, 2023, 09:31:36 AMNão tem como joker, as máquinas não são disponibilizadas logo de início.Quando falo entrar no inicio, falo quem entrou na mineração ASIC em 2013-2014.Quem entrou nessa altura, consegui ir renovando as maquinas, mesmo sendo um minerador pequeno.O que eu quero dizer é que as máquinas com melhor eficiência/hashrate não são disponibilizados ao público quão logo fabricadas, são usadas pelos makers em grande escala.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 27, 2023, 11:36:18 AM",
      "body": "Quote from: jpouza on June 27, 2023, 11:05:53 AMO que eu quero dizer é que as máquinas com melhor eficiência/hashrate não são disponibilizados ao público quão logo fabricadas, são usadas pelos makers em grande escala.Sim, sim! É algo lamentavel que acontece.Por isso, é que eu tenho pena não ter os conhecimentos técnicos necessários para montar o meu próprio miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 28, 2023, 12:32:26 AM",
      "body": "Quote from: joker_josue on June 27, 2023, 06:33:54 AMComo achas que o ETC iria ter um amplo uso no futuro? Em que situações isso poderia acontecer?Aqui nesse caso estava apenas supondo que ele comprou a ASIC pensando nisso, mas de minha parte não vejo potencial para subidas... Quando o mercado entra em euforia acaba levando tudo junto, não duvidaria de uma grande alta no próximo ciclo mas não é uma aposta que estou disposto a fazer ou participar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 04, 2023, 02:41:51 PM",
      "body": "Quote from: tg88 on June 25, 2023, 01:14:13 PMO vídeo mostra uma ASIC de ETC que consome 400 watts e tem uma potencia de aproximadamente 1 Ghs oque é super eficiente.Achei bastante interessante ele comparando ASIC de ETC com ASIC de BTC.Ele falando que as ASIC de bitcoin fazem um barulho bizarro e que o consumo de energia é bizarro. Que tem gente que liga as ASIC e ve que o sistema de eletricidade da casa nao comporta, e ainda gasta um extra com eletricista para arrumar!  Nao sabia disso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "July 05, 2023, 12:31:34 AM",
      "body": "Quote from: bitmover on July 04, 2023, 02:41:51 PMAchei bastante interessante ele comparando ASIC de ETC com ASIC de BTC.Ele falando que as ASIC de bitcoin fazem um barulho bizarro e que o consumo de energia é bizarro. Que tem gente que liga as ASIC e ve que o sistema de eletricidade da casa nao comporta, e ainda gasta um extra com eletricista para arrumar!  Nao sabia disso.As ASIC de BTC costumam consumir algo em torno de 4000 Watts, pra quem tem energia 220v até que é bem tranquilo dimensionar (isso considerando apenas uma unidade).  Algumas ASIC em com 2 cabos de força e ai fica melhor ainda pois a pessoa pode dividir em 2 tomadas distintas... Porem algumas vem com um único cabo de força e ai exige uma tomada de 20A oque já não é tão comum na maioria das casas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 10, 2023, 01:22:44 PM",
      "body": "Quote from: tg88 on July 05, 2023, 12:31:34 AMQuote from: bitmover on July 04, 2023, 02:41:51 PMEle falando que as ASIC de bitcoin fazem um barulho bizarro e que o consumo de energia é bizarro. Que tem gente que liga as ASIC e ve que o sistema de eletricidade da casa nao comporta, e ainda gasta um extra com eletricista para arrumar!  Nao sabia disso.As ASIC de BTC costumam consumir algo em torno de 4000 Watts, pra quem tem energia 220v até que é bem tranquilo dimensionar (isso considerando apenas uma unidade).  Algumas ASIC em com 2 cabos de força e ai fica melhor ainda pois a pessoa pode dividir em 2 tomadas distintas... Porem algumas vem com um único cabo de força e ai exige uma tomada de 20A oque já não é tão comum na maioria das casas.Uma boa instalação elétrica, é meio caminho para evitar problemas de futuro, e até para economizar energia.Se a instalação elétrica for bem feita, evita-se consumos desnecessários/desperdiçados, sub aquecimento, e exceção de tensão. Por isso, compensa sempre gastar esse extra, com ou sem ASIC, pois isso irá dar eficiência energética a sua casa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}