{
  "id": "topic_5459330",
  "title": "chainganginc",
  "author": "chainganginc",
  "created_time": "July 10, 2023, 03:12:56 PM",
  "content": "Can somebody help my ID wont scan because the picture is faded.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459330",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "July 10, 2023, 03:15:20 PM",
      "body": "I'm not that familiar with the service you're mentioning, but if you're trying to verify your identity, that's not something people could help you with. I also doubt the support would help. Your best bet would be to use another form of identification (passport for example) if you have one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 10, 2023, 05:00:38 PM",
      "body": "Since you are trying to pass an exchange KYC verification in order to make your withdrawal, you either have to use other means of identification like OmegaStarScream has suggested or, better yet, you don't have any other form of ID. Take your old one to the ID provider so that they can reprint the card in a more readable format, and then you can use it and resubmit your KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 10, 2023, 06:58:58 PM",
      "body": "Quote from: chainganginc on July 10, 2023, 03:12:56 PMCan somebody help my ID wont scan because the picture is faded.This can only be handled by you and you alone because you stated that the picture on your ID is faded which means it can't work since the KYC document Picture was supposed to match with your picture upload, the best possible shot for you is that you have two options which are.1: either you try using your other document/IDs2: if that is the only ID you got, you have the option of going to your government office to get the ID reprint for you, here in my country you only pay the cost of printing into a government account and you will get your National ID reprinted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 10, 2023, 11:47:54 PM",
      "body": "What exchanges do you have?I once helped someone through with a faded card, that can be helped with a good lighting angle. Or if you've ever taken a picture of your ID card in good condition, you can print it on paper with the image sharpened. The scan process may have to be repeated until it is detected by the machine.Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}