{
  "id": "topic_5406441",
  "title": "darxiaomi",
  "author": "darxiaomi",
  "created_time": "July 15, 2022, 06:13:46 PM",
  "content": "Well i cant put more words, the video says it all.https://www.youtube.com/watch?v=NsB15QKz9No&ab_channel=EBDSportsI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406441",
  "comments": [
    {
      "author": "fiulpro",
      "created_time": "July 15, 2022, 06:24:23 PM",
      "body": "Well fixed matches are everywhere sometimes the people who are actually competing decides to let go of their winnings to earn even more through sports betting, match fixing and they get sold off to rich people and that is why in many countries match fixing is considered illegal ofcourse, it would not only alter the course but would also make the whole idea of sports obsolete, there is something called team spirit, playing fair and square this i do think that it is essentially for the games to be fair and square. Max fixing is well known and also comes with a lot of damage and you can also go to the jail if you are found out, you also might not be allowed to compete again. Lets see what happens here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "keyscore44",
      "created_time": "July 15, 2022, 06:31:38 PM",
      "body": "Quote from: darxiaomi on July 15, 2022, 06:13:46 PMWell i cant put more words, the video says it all.https://www.youtube.com/watch?v=NsB15QKz9No&ab_channel=EBDSportsI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.Therefore, betting on matches in the lower leagues is very risky. I haven't been doing this for a long time, because it's a pure lottery. In many countries, such behavior would be punishable by a huge penalty for the players and an even greater penalty for the club. Hopefully the same will happen in this case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "July 15, 2022, 07:00:14 PM",
      "body": "It's a common thing in the lower class leagues, don't worry about it. If you are a person who likes to bet on football matches, as much as possible you should stay away from matches that are in the lower leagues. Although something like this can also happen in top-class leagues (for example the case of Juventus in the past), but it is unlikely that something like that will happen there. Now, I want to ask you. Is the match in the video a Nigeria Professional Football League (NPFL) match? not of course, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 15, 2022, 07:32:32 PM",
      "body": "The day when a match team A in a small league was leading by 5 goals but later equalsized by team B at late minutes and later won it has been the day I believed and knew that matches can be fixed. Anything can happen in football but I always think that some matches are fixed. About the FA Cup final between Remo Stars and Ijebu United seem more like a planned event, a goal keeper do not go for the ball at all while the player for the other team just played the penalty out. The best is to not bet on small leagues, big leagues can not be manipulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 15, 2022, 07:34:23 PM",
      "body": "Quote from: darxiaomi on July 15, 2022, 06:13:46 PMI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.No, it does not damage the trust. It's known to all. If you are in gambling then you should know that it's always high risk to gamble in lower leagues. Match fixing is very common in those leagues. If you gamble on those leagues then go against the favorite but do not put a lot of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 15, 2022, 08:05:58 PM",
      "body": "Quote from: keyscore44 on July 15, 2022, 06:31:38 PMTherefore, betting on matches in the lower leagues is very risky. I haven't been doing this for a long time, because it's a pure lottery. In many countries, such behavior would be punishable by a huge penalty for the players and an even greater penalty for the club. Hopefully the same will happen in this case.Even in the higher leagues of a sport have been known for match fixing. Take the Premier League as an example, Sturridge was investigated for match fixing, and I believe even banned for it. I'm sure his ban expired in January, it was at least six months. So, whether actually guilty or not, there's been accusations made, which were considered valid enough to ban for a period of time, even if the final decision was that the player was innocent. Also, I'm absolutely sure I've seen certain boxers take a dive. There's one that sticks in my mind, but he wasn't a big name so can't remember who it was, but the replay basically showed his opponent missing, and him curling over in pain. There was also a fight Ricky Hatton's son fought, which he basically lost every round, and I don't know how anyone else could see it differently, but ended up winning the decision. There's also the Wilder vs Fury fight, which the decision for a draw was absolutely crazy. In fact, home advantage in boxing is considered pretty big even with commentators saying you have to do put a statement out there if you want to win away from your home country/town.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "July 15, 2022, 08:08:45 PM",
      "body": "just like what BitcoinGirl.Club have said, it doesn't really damage the trust in sports betting. fixed matches are known to exist and have been happening for a long time. not only does it happen in small leagues just like the one in the video, it also happens in big leagues. even with the issue of fixed matches happening in big leagues, you still see a lot of gamblers participating in sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snipie",
      "created_time": "July 15, 2022, 08:20:51 PM",
      "body": "QuoteI found out that Remo stars players deliberately threw away their first 3 spot kicks and their Goalkeeper also remained motionless when the opponents took theirs as a MARK OF PROTEST for the unfair officiating in the game.Well, this doesn't mean that there isn't corruption and match fixing but things like that happen regularly in basically every competition especially in small competitions and leagues. I remember few months ago a South African team was barred permanently for something like that? If I am not mistaken..In the past and even in World Cup, there was many cases of European teams backing each other to eliminate other continent teams... Such thing is less obvious to notice nowadays.For the shown match, it was obvious that the goalkeeper and the player who kicked the ball left were able to hide these comic move and make it look quite normal defeat..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 15, 2022, 08:24:51 PM",
      "body": "Yes, fixed matches still exist in lower leagues, especially in football. Nothing new about that. That is the reason it is wise to get the best information you can. Being a football fan, you surely know a few things about the game. But do you know as much as you should know?It is for this reason that you should avoid placing bets on teams you do not know enough or on lower leagues where match-fixing is a common practice. Every gambler must be aware of this. In other words, don't blindly trust betting websites and bookmakers if you don't know anything about the sport you are betting on. Don't blindly place a bet that can cost you a lot of money just because you think it's a sure thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "July 15, 2022, 08:26:46 PM",
      "body": "Quote from: BitcoinGirl.Club on July 15, 2022, 07:34:23 PMQuote from: darxiaomi on July 15, 2022, 06:13:46 PMI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.No, it does not damage the trust. It's known to all. If you are in gambling then you should know that it's always high risk to gamble in lower leagues. Match fixing is very common in those leagues. If you gamble on those leagues then go against the favorite but do not put a lot of money.Did you encounter success by doing that? Or do you know someone making profits with this strategy? Because it doesn't make sense to systematically choose the underdog in those matches IMO. Matches are not always fixed for a win of the underdog, they are also fixed for a victory of the favorite.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "July 15, 2022, 08:33:59 PM",
      "body": "Quote from: darxiaomi on July 15, 2022, 06:13:46 PMI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.Nope, this event doesn’t damage or even tarnished the reputation of gambling at all. More likely, this damaged the player’s reputation and sport reputation. However, I think that the player or team that intentionally throw the game have received compensation for doing so. Fixed matches happens very often on low tier games and matches as they are most likely to prone to bribing. But this kind of things doesn’t really affect gambling too much as only few gamblers bet on these kind of events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "July 15, 2022, 08:37:01 PM",
      "body": "Comedy video, he couldnt take the risk of just a simple slow shot or anything less subtle then deliberate miss.  Whose to say he didnt slip by accident or was ill that day, infinite arguments to explain why its possible to get away with this.  Its mostly going to damage any sponsorship for teams in that league so anti cheating and fix should be organized by the players themselves.      Cartels will spend alot of time and money even to sway the players, its most likely to happen in low paying teams but its down to reputation also.   Even happens in online games, I think a famous F1 driver got into trouble during the covid lockdowns when he let someone else drive for him in an online event.  A seriously bad choice from a rich person not recognizing how bad that looks, too often bad judgement occurs so its down to every part involved not just players I guess who are often inexperienced and naïve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 15, 2022, 08:37:57 PM",
      "body": "This happens in Ogun State FA Cup (Nigeria) final between Remo Stars and Ijebu United.the explanation that I read, this was like a kind of protest from the team, probably opposed to having to play penalties.certainly the result is really gross if not practically ridiculous. shooting penalties like that is practically impossible at any level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Harkorede",
      "created_time": "July 15, 2022, 08:39:30 PM",
      "body": "Quote from: darxiaomi on July 15, 2022, 06:13:46 PMWell i cant put more words, the video says it all.https://www.youtube.com/watch?v=NsB15QKz9No&ab_channel=EBDSportsI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.I happened to have stumbled upon this video yesterday on Twitter and It's from Nigeria, It's a state game between two local government areas, and I don't think the fixture would have made it anywhere into the bookies, the type matches in Nigeria aren't available in the bookies because they're well aware of how corrupt it is.  The Nigeria Premier League is quite different from this and it's not free of match fixing too, but it's more often than not always favor of the home teams, and if you check properly you'll see the very low ratio of teams winning away from home, but there have some improvement from it used to be some 6-7 years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 15, 2022, 08:43:50 PM",
      "body": "Quote from: darxiaomi on July 15, 2022, 06:13:46 PMWell i cant put more words, the video says it all.https://www.youtube.com/watch?v=NsB15QKz9No&ab_channel=EBDSportsI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.That is quite normal to me.I know in the lower leagues,the amateur leagues mostly this shit happens a lot of times.They use a pretext like bad handling of the game from the referees and they do funny shit like the one we saw in the video.I also start to believe those people who know a fixed game in a lower league exist,this video is living proof of that,unfortunately they only play the game themselves and don't pass the information to anyone else,and increase their cash stash.Every other person who claim he knows how a game will end is just jerking around with us trying to make some easy money himself.That is the sad reality unfortunately but in the end this does not damage gambling,you will never see such behavior in the Premier League for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "July 15, 2022, 08:44:02 PM",
      "body": "Quote from: MAAManda on July 15, 2022, 07:00:14 PMIt's a common thing in the lower class leagues, don't worry about it. If you are a person who likes to bet on football matches, as much as possible you should stay away from matches that are in the lower leagues. Although something like this can also happen in top-class leagues (for example the case of Juventus in the past), but it is unlikely that something like that will happen there. Now, I want to ask you. Is the match in the video a Nigeria Professional Football League (NPFL) match? not of course, right? Wont really be that common or something that do happen on big leagues and tournaments which there are lots of fans are watching which it would really be hard for them to act specially on match fixing.Its true that this could happen on lower class leagues or local ones but of course it would really be ethical that sport governing bodies should still make out some act or decision on shit things like this.Match fixing isnt something new into this industry thats why dont freak out and trying to tell the public that this would really be over and could damage gambling industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 15, 2022, 08:52:58 PM",
      "body": "Quote from: swogerino on July 15, 2022, 08:43:50 PMQuote from: darxiaomi on July 15, 2022, 06:13:46 PMWell i cant put more words, the video says it all.https://www.youtube.com/watch?v=NsB15QKz9No&ab_channel=EBDSportsI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear....I know in the lower leagues,the amateur leagues mostly this shit happens a lot of times.....Remo Stars (the team that misplaced all penalties) is actually at 3rd place of ... Premier League of Nigeria ! This was not an amateur match and probably this is the reason it become so \"famous\" around the world. Another very similar scandal also occurred in Sierra Leone with two games that achieved 95-0 and 91-1\"science fiction\" results!https://twitter.com/ourAfricanFooty/status/1543922597137682432",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johhnyUA",
      "created_time": "July 15, 2022, 09:06:46 PM",
      "body": "Quote from: darxiaomi on July 15, 2022, 06:13:46 PMI really think this damage the trust in the sports bets , or anything related to the sport gambling, i know a lot can say its a kind of protest but still really unclear.Ahahah. Despite this is very funny video, I can say that this is mostly the problem with betting on championships in the third world countries, not with the normal football. The reason why players get such big salary is to avoid shit like that. This video isn't damage my trust for the bets in any kind. Because of mentioned above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "July 15, 2022, 09:07:03 PM",
      "body": "If this ever happens in the big leagues, then that one guy who intentionally missed the shot and the goalkeeper who didn't do his job will be fined and get fired immediately. I think this only happens on the lower leagues or not wherein match fixing is rampant and under the table bets are done, or on leagues with extreme corruption that everyone feels like this is all normal, but on a professional level and well-known leagues, this will never happen. There may be some match fixing that happens but not this intentional, that's for sure. It's laughable that stuff like this happens and someone was able to record it. A true gem in sports indeed, albeit a negative one",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}