{
  "id": "topic_5409108",
  "title": "nullius",
  "author": "nullius",
  "created_time": "August 08, 2022, 10:10:11 AM",
  "content": "Hot on the heels of one of the shocking sudden demolition of one of the most promising post-quantum key agreement algorithms...Popular news article:  2022-08-02:  “Post-quantum encryption contender is taken out by single-core PC and 1 hour”.  Ars Technica.Cryptographic research paper:  Wouter Castryck and Thomas Decru.  “An efficient key recovery attack on SIDH (preliminary version).”  2022-07-30: received; 2022-08-05: last of 2 revisions.  https://eprint.iacr.org/2022/975...we find this:Quote from: https://blog.cr.yp.to/20220805-nsa.html2022.08.05: NSA, NIST, and post-quantum cryptography: Announcing my second lawsuit against the U.S. government. #nsa #nist #des #dsa #dualec #sigintenablingproject #nistpqc #foiaBERNSTEIN v. NATIONAL INSTITUTE OF STANDARDS AND TECHNOLOGY (1:22-cv-02319)https://www.courtlistener.com/docket/64872195/bernstein-v-national-institute-of-standards-and-technology/DJB’s blog summarizes the history of NSA sabotage of cryptographic standards.  He describes the atrocious state of the NIST post-quantum cryptography standardization process.  He concludes:Quote from: Daniel J. BernsteinI've filed seven FOIA requests with NIST since mid-2020. NIST has released a few dribbles of information, but in general NIST's responses have been very slow and obviously not complete.For example, I filed a FOIA request in June 2021 asking for \"copies of all NIST records of communication between NSA and NIST regarding the NIST Post-Quantum Cryptography Standardization Project\". This request has, so far, produced zero records. NIST has stonewalled, ignoring the FOIA deadlines.My seventh FOIA request, in March 2022, said the following:QuoteAnalyzing NSA's impact on this project will require not just seeing NSA's communication with NIST, but also tracing how NIST's decisions were made and analyzing the influence of the information that NIST received from NSA. If each step of this analysis requires dealing with another round of stonewalling from NIST then the analysis will obviously not be done in time to help the public make safe decisions regarding post-quantum cryptography.NSA's documented history of sabotage, along with its evident sway over NIST, makes NSA's influence on NIST a high priority to review, but it also seems likely that other entities have also been trying to sabotage NIST's process. As far as I can tell, NIST has no procedures in place to prevent attackers from influencing the project through pseudonyms, proxies, etc. Anything short of a full review of project records could easily miss evidence of attacks.Even without sabotage, getting cryptography right is challenging. Public review has identified security flaws in dozens of submissions and has identified many errors in the limited additional information released by NIST. Having NIST keep most of its analysis secret is a recipe for disaster. Given that NIST promised to be \"open and transparent\", and recently claimed to have \"shown all our work\", it's hard to understand why the full project records aren't already available to the public.I asked for the full NISTPQC records, and for \"all records of NIST/NSA meetings mentioning the word 'quantum', whether or not NIST views those meetings as part of this project\".NIST has produced zero records in response to this FOIA request. Civil-rights firm Loevy & Loevy has now filed suit on my behalf in federal court, the United States District Court for the District of Columbia, to force NIST to comply with the law.Good luck to Professor Bernstein here.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409108",
  "comments": []
}