{
  "id": "topic_5466352",
  "title": "xLays",
  "author": "xLays",
  "created_time": "September 10, 2023, 08:53:35 PM",
  "content": "Has anyone here on Bitcointalk used catex.io & dex-trade.com? I'm planning to trade my token P2PS which is only listed on these mentioned exchanges. Your thoughts on this exchange's safety considering that if no one has used it here?Trust Pilot Catex.io - 2.3/5 STAR REVIEWTrust Pilot - Dex-Trade  - 2.8/5 STAR REVIEW",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466352",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "September 10, 2023, 09:38:24 PM",
      "body": "Not gonna lie, this is my first time hearing about both exchanges. A quick search around the forum shows they mostly list low tier coins/tokens, but the reviews are really so bad on Trustpilot. I would use such exchanges with extra caution.Maybe send test amounts or wait for the token to get listed in a trustworthy exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 10, 2023, 09:50:49 PM",
      "body": "The more obscure the exchange is, the higher the risk. But if you can take the risk, I would suggest to split your funds into pieces and trade with one part each time. The trick is, if they ever froze your account, only a part is lost.If you however find a community for this coin where it's okay to post trade offers, you could try to list your offer in p2p exhanges like agoradesk or robosats and also advertise in the mentioned community for extra exposure.Note: Robosats allows you to manually input a payment method so it should work; agoradesk has the \"Cryptocurrency\" option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 10, 2023, 10:46:17 PM",
      "body": "I heard about catex but never used them before, actually they have open accusation[1] of holding somene funds but that's wayback 2019 i don't know if they were resolved.About the other one, never heard of them since i didnt use dex exchanges other than pancake swap and other related exchanges.Question: Where did you get your P2PS? From their forum bounty or outside the forum? Because i know bounty tokens cannot be transfered yet or send to exchanges. Unless you buy tokensfrom those exchanges.[1] https://bitcointalk.org/index.php?topic=5171824.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "September 11, 2023, 04:46:08 AM",
      "body": "Quote from: xLays on September 10, 2023, 08:53:35 PM-snip-I'm planning to trade my token P2PS which is only listed on these mentioned exchanges. Found this in Twitter, P2PS is also listed exchange Coinstore.com. Not sure about KYC policy, just be prepared for this if you want to go ahead with it. Specifically for this exchange I won't be considering Trustpilot reviews too much for a while, it seems like they received a spam attack of negative reviews last Aug 21, up to 8 pages long.I don't mean to recommend anything here. DWYOR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "September 13, 2023, 03:59:00 PM",
      "body": "Quote from: xLays on September 10, 2023, 08:53:35 PMTrust Pilot Catex.io - 2.3/5 STAR REVIEW@PX-Z, have told you about the catex.io website and other members have warned you, but in other places I also found about catex.io which is unfriendly and off the mark.Example: https://bitcointalk.org/index.php?topic=5244363.0, That's a sign that it's not good to use, their team hasn't been active here for a long time.Quote from: xLays on September 10, 2023, 08:53:35 PMTrust Pilot - Dex-Trade  - 2.8/5 STAR REVIEWAs well as the Dex-trade.com exchange, @Little Mouse once asked about the website, for example: Dex-trade.com review needed, However, the results of the discussion still yielded no common ground, aka zero.So from the two data above, for me these two exchange websites are not good and not good for carrying out exchange activities there, consider carefully if you want to use them and be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 13, 2023, 11:30:52 PM",
      "body": "I'm using catex.io years ago because some of the coins that I mine before are only listed on their exchange.It works fine on that time but I do not know if it works the same if you trade today.If I were you instead of spliting them as suggested above try to deposit a small amount and try to withdraw.If it success to any exchange you mentioned above gradually trade and withdraw small amount to avoid losing much if the withdrawal is stuck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 14, 2023, 01:41:36 AM",
      "body": "If you don't feel safe using them, maybe you can look for alternatives to sell your tokens. Are there no DEXes that support your tokens? You can also consider doing a P2P trade on this forum if you don't plan to sell it asap. My experience using low-tier exchanges is never good, I'd consider using them as a last resort after P2P or DEX. You can also encourage the team behind that project to list on other exchanges. If they don't think that is important, maybe the token doesn't have a bright future so taking more risk can be acceptable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 14, 2023, 06:12:10 AM",
      "body": "Quote from: xLays on September 10, 2023, 08:53:35 PMHas anyone here on Bitcointalk used catex.io & dex-trade.com? I'm planning to trade my token P2PS which is only listed on these mentioned exchanges. Your thoughts on this exchange's safety considering that if no one has used it here?First of all how did you even get a hold of this token if it's not listed anywhere? Is it from an airdrop?This is the disadvantage of using airdrops. You get a whole bunch of coins that are not listed on any exchanges, so you can't buy or sell them except by finding someone to do a P2P trade with. And the chances of finding anyone with such obscure tokens and something of value to trade with is nil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 14, 2023, 10:32:57 AM",
      "body": "I'm only familiar because I've heard probably years ago about catex but never have used it. Those trust rating that these exchanges have got are poor and low. I guess you've got no other option but to dump that immediately and you're just looking for an exchange where you can sell them immediately. If you're going to sell that token, there are also other 3 exchanges where it's listed but they seem to be uncommon as well. Is this the token you're about to trade? https://coinmarketcap.com/currencies/p2p-solutions-foundation/#Markets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xLays",
      "created_time": "September 14, 2023, 01:03:02 PM",
      "body": "Quote from: tabas on September 14, 2023, 10:32:57 AMI'm only familiar because I've heard probably years ago about catex but never have used it. Those trust rating that these exchanges have got are poor and low. I guess you've got no other option but to dump that immediately and you're just looking for an exchange where you can sell them immediately. If you're going to sell that token, there are also other 3 exchanges where it's listed but they seem to be uncommon as well. Is this the token you're about to trade? https://coinmarketcap.com/currencies/p2p-solutions-foundation/#MarketsYes it is. With contract address: https://etherscan.io/token/0x4527a3b4a8a150403090a99b87effc96f2195047Quote from: NotATether on September 14, 2023, 06:12:10 AMQuote from: xLays on September 10, 2023, 08:53:35 PMHas anyone here on Bitcointalk used catex.io & dex-trade.com? I'm planning to trade my token P2PS which is only listed on these mentioned exchanges. Your thoughts on this exchange's safety considering that if no one has used it here?First of all how did you even get a hold of this token if it's not listed anywhere? Is it from an airdrop?This is the disadvantage of using airdrops. You get a whole bunch of coins that are not listed on any exchanges, so you can't buy or sell them except by finding someone to do a P2P trade with. And the chances of finding anyone with such obscure tokens and something of value to trade with is nil.Not gonna lie but I don't know where it came from and I can't remember if I joined their bounty and airdrop campaigns. P2P is one of my options to sell this token but I'm sure no one is buying this kind of token since based on my research it was most likely a scam.I also joined their official Telegram group, which is very active. Then I tried to ask some questions like why I can't transfer my tokens to any address and why their website still has the ICO page open. After that they blocked me on Telegram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 14, 2023, 02:26:11 PM",
      "body": "Quote from: xLays on September 14, 2023, 01:03:02 PMI also joined their official Telegram group, which is very active. Then I tried to ask some questions like why I can't transfer my tokens to any address and why their website still has the ICO page open. After that they blocked me on Telegram.So it's a bullshit project, they prevent you from asking more questions which makes their community start to wonder why they stay.I looked at both exchanges, it just looks like bot trading or fake orders. I suggest just forget about it, unless you're willing to spend a few dollars for network fees to get these tokens out of your wallet to the exchanges above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 14, 2023, 03:26:40 PM",
      "body": "Quote from: xLays on September 14, 2023, 01:03:02 PMNot gonna lie but I don't know where it came from and I can't remember if I joined their bounty and airdrop campaigns. P2P is one of my options to sell this token but I'm sure no one is buying this kind of token since based on my research it was most likely a scam.I also joined their official Telegram group, which is very active. Then I tried to ask some questions like why I can't transfer my tokens to any address and why their website still has the ICO page open. After that they blocked me on Telegram.If it is a scam, then forget about selling it because nobody is going to buy it, neither should you want to dump it on someone else. If they blocked you on their official Telegram group which you say is active, just because you asked them questions; then the project managers could still be scamming people with their scam tokens. Too many scam projects and tokens are created daily and it should teach people to stop participating in airdrop or bounty campaigns, but they always believe they'll get one successful one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "September 14, 2023, 09:20:25 PM",
      "body": "I am just curious how you got those tokens. I am not familiar with these two exchanges and just learned about them for the first time. So just trade your token with caution. Because I won't dare use an exchange that isn't well known among the crypto community. I am not sure if you got these tokens for free through an airdrop or something else. If free, you may try with a small amount and see how it actually works. Then, if everything is fine, you may make a real-time decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 15, 2023, 02:08:58 AM",
      "body": "Quote from: xLays on September 14, 2023, 01:03:02 PMI also joined their official Telegram group, which is very active. Then I tried to ask some questions like why I can't transfer my tokens to any address and why their website still has the ICO page open. After that they blocked me on Telegram.That sounds really odd. If the group is that active how can there be little to no activity on their marketing side? Sounds like they just hired a bunch of bots to keep the group alive and scam people. The fact that they still use ICO to attract users is also a red flag since most of them are dead nowadays. I'd suggest to burn them if it is a scam. Help others and yourself from being scammed by them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 15, 2023, 05:53:47 AM",
      "body": "Quote from: xLays on September 14, 2023, 01:03:02 PMNot gonna lie but I don't know where it came from and I can't remember if I joined their bounty and airdrop campaigns. Another possibility is, it could be randomly airdropped to your address. Some teams do it in order to lure people/create buzz, though from what I saw, it's typically the shady projects who do it.From the thing you've told us, there are more indicators you're dabbling into something shady, I would err on the side of caution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}