{
  "id": "topic_5452411",
  "title": "Spack17",
  "author": "Spack17",
  "created_time": "May 11, 2023, 05:42:50 PM",
  "content": "On this Sunday, general election will take place in Turkey which is seen as the most important election in 2023. Recep Tayyip Erdoğan who has been in power for 21 years seems behind in surveys. The most credible survey company in Turkey have their final survey before the elections like this:Recep Tayyip Erdoğan's developing an intimacy with Putin in the recent years has been a fact that everyone who follows Turkey knows. Today the opposition's candidate Kemal Kılıçdaroğlu appealed to Russia on Twitter to not interfere with the elections.https://twitter.com/kilicdarogluk/status/1656705798557384727?s=20Do you think Turkish people can manage to send an authoritarian leader by the elections? Do you see it possible for Russia to interfere with the Turkey elections?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452411",
  "comments": [
    {
      "author": "Zlantann",
      "created_time": "May 11, 2023, 08:08:53 PM",
      "body": "Quote from: Spack17 on May 11, 2023, 05:42:50 PMOn this Sunday, general election will take place in Turkey which is seen as the most important election in 2023. Recep Tayyip Erdoğan who has been in power for 21 years seems behind in surveys. The most credible survey company in Turkey have their final survey before the elections like this:Polls can be good indicators of the outcome of elections but they can't be trusted. There are so many polls that didn't accurately predict the outcome of elections. If they were accurate Hilary Clinton would have defeated Donald Trump in the 2016 United States presidential election because almost all the polls predicted that she would will the elections. Don't also forget that Recep Tayyip Erdoğan enjoys a lot of support from nationalists, and religious conservatives who believe that Turkey shouldn't promote  closer ties with the West.QuoteRecep Tayyip Erdoğan's developing an intimacy with Putin in the recent years has been a fact that everyone who follows Turkey knows. Today the opposition's candidate Kemal Kılıçdaroğlu appealed to Russia on Twitter to not interfere with the elections.Turkey is a great asset to Russia. Turkey and Hungary are core supporters of Russia in NATO. Russia will do everything possible to ensure that Erdoğan wins the election because if he losses Kremlin has lost a close ally. This is because the main opposition candidate Kemal Kilicdaroglu is pro-west. QuoteDo you think Turkish people can manage to send an authoritarian leader by the elections? Do you see it possible for Russia to interfere with the Turkey elections?This election is unpredictable because both main candidates have a lot of supporters. Let the election be free and fair from manipulations so that the best candidate can win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}