{
  "id": "topic_5483205",
  "title": "DapanasFruit",
  "author": "DapanasFruit",
  "created_time": "January 28, 2024, 06:57:27 AM",
  "content": "Made mistakes with your Bitcoin in the past...that you still regret or at least considered to be a wrong move especially considering the price of BTC these days? Three years ago, I got bored with the movement of Bitcoin so I look for other good alternatives which I can use to replace...unfortunately I decided to go for BTCV all in. And it was a big horror because two months after the price of BTCV dropped to just 30% to when I bought them...got no choice but to cut loss. Please share your story here if you have one so we can learn a lesson or two...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5483205",
  "comments": [
    {
      "author": "mk4",
      "created_time": "January 28, 2024, 07:11:25 AM",
      "body": "Back then I moved around 2-3% of my total BTC stack to BCH just for the \"what if\" factor despite knowing that it would most likely end up failing. It was the first BTC hard fork that had a somewhat-decent amount of community support and I felt uneasy having zero exposure; knowing also that Jihan Wu and Roger Ver had a lot more influence back then.So yea, it was a slightly costly mistake, but definitely nothing I can't come back from.Idk what that BTCV thing is tho lmao how did you even end up that deep in the trenches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "January 28, 2024, 07:27:45 AM",
      "body": "If we knew what the future would hold, perhaps many people would be more greedy. I once sold bitcoin at a price of nearly $400, but to say it was a complete mistake I don't think so, because I'm still here and my confidence in the opportunity that bitcoin brings is growing.The story that OP mentioned here is probably the common psychology of many people, they only feel comfortable when the investment profits immediately, or the loss is not too much. I feel like it's more of a short-term trend than a long enough process to see fluctuations. Ask people who have invested for over 5 years if they've ever seen their investment decrease by 90% but still keep it then receive a large profit. Not everyone has the same opinion, as well as approaches to investing, so take every story as a lesson to look back at what your own investment is getting, it's not necessary to always say in terms of monetary profit, but also things like knowledge accumulated and applied back to that field.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "January 28, 2024, 07:34:38 AM",
      "body": "Quote from: mk4 on January 28, 2024, 07:11:25 AMBack then I moved around 2-3% of my total BTC stack to BCH just for the \"what if\" factor despite knowing that it would most likely end up failing. It was the first BTC hard fork that had a somewhat-decent amount of community support and I felt uneasy having zero exposure; knowing also that Jihan Wu and Roger Ver had a lot more influence back then.So yea, it was a slightly costly mistake, but definitely nothing I can't come back from.Idk what that BTCV thing is tho lmao how did you even end up that deep in the trenches.I also made a mistake involving BCH, but mine was straight up stupid.For some reason I sent btc to a bch address, and they were never seen again. In the very beginning for me, like 10 years ago, I also made mistakes like not writing down and saving the seed phrase. I was super new and had no clue about it. I had 2 phones from 2013-2015 die on me with some btc on it. These btc would now be quite some money and these funds are lost forever on some address, just to never be touched again.Another mistake I did in the past was \"panic selling\", well many of us have been there I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "January 28, 2024, 07:45:46 AM",
      "body": "Quote from: bluebit25 on January 28, 2024, 07:27:45 AMIf we knew what the future would hold, perhaps many people would be more greedy. I once sold bitcoin at a price of nearly $400, but to say it was a complete mistake I don't think so, because I'm still here and my confidence in the opportunity that bitcoin brings is growing.Totally agree, that bolded part is definitely going to happen and in my opinion, it's going to be the end for bitcoin right before it begins because with a lot of people knowing the future, they would immediately increase the price of bitcoin because as soon as there's some bitcoin that's freshly mined, they'll immediately buy it and will end up with no one trying to sell out or bitcoin being too expensive because people knows that it's going to be more valuable someday. I've been the same and the fact that we're still here investing in bitcoin and moving forward means that there's nothing wrong with what we're doing and that there's going to be more opportunities to learn and do something different. I did sold my bitcoin too but at a much higher bitcoin price back then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hitsnorth",
      "created_time": "January 28, 2024, 07:52:29 AM",
      "body": "Thankfully I never sold my BTC and didn't try to move to something else. I made some mistakes with altcoins, but it's not that big deal. BTC is the only one that I was just constantly accumulating and holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Barikui1",
      "created_time": "January 28, 2024, 07:56:58 AM",
      "body": "During my early days in the crypto industry, I had upto $158 in my wallet balance, I was told to buy only Bitcoin by the guy mentoring me, which I agreed to it, a few days later, a friend of mine told me that their is not much profit from Bitcoin, so he suggested a coin to me called Gft, I ignored the advice of my mentor and go with that of my friends.I bought that gft at a price of $0.1100 with all my usdt, it was not even up to a week, when the price of that token fell to $0.6000, and my capital of $158 was not even up to $80 again, after upto 7 weeks, it was still coming down, I just have to cut my lost, and sold all the coin at $74, right now that coin is trading at $0.0230, after then, I learn my lesson the hard way, I never told the guy mentoring me, because I know that he would be really mad at me,  since then, I stay off any coin that is not Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "January 28, 2024, 08:07:12 AM",
      "body": "You are making me remember of my friend that has the same reason for disposing and selling his bitcoin. The reason doesn't make sense. He has got bored as well and that led him to sell.I think that was on 2018 and bored in a way that it was a bear market and prolly he lost hope by that time. A mistake that can no longer be corrected but can still recover somehow through accumulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "January 28, 2024, 08:49:20 AM",
      "body": "Quote from: DapanasFruit on January 28, 2024, 06:57:27 AMMade mistakes with your Bitcoin in the past...that you still regret or at least considered to be a wrong move especially considering the price of BTC these days? Three years ago, I got bored with the movement of Bitcoin so I look for other good alternatives which I can use to replace...unfortunately I decided to go for BTCV all in. And it was a big horror because two months after the price of BTCV dropped to just 30% to when I bought them...got no choice but to cut loss. Please share your story here if you have one so we can learn a lesson or two...By the way please, that influencer vibe of that image does not help the reputation of Bitcoin it makes it seem scammy when it's not at all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "January 28, 2024, 09:18:48 AM",
      "body": "There has been lot of such instances which I regret right from selling BTC when it was roughly $1000 at the beginning of 2017 and then boom the price reached $20K the same year in December, one more incident which I have repeatedly mentioned in the forum wherein I lost my seed phrase for Blockchain wallet without giving much important considering the price of Bitcoin that time and now I cannot recover it. Also I had converted some of my funds from Bitcoin to a shit coin named Nebilo and lost almost everything and it was not even 10% worth the amount I had invested. These are few of the blunders I have made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "January 28, 2024, 09:27:08 AM",
      "body": "I would say a grave mistake I had done in the past  is not believing in bitcoin and not investing in it right even before the last halving took place I was already aware of the existence of cryptocurrencies it is just that I was so uninterested that I did not want to learn any more of it I thought there was no future in learning such and just accepted that this would be my fateYears later I finally learn more and now I know better I wish I had already invested way back then",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "January 28, 2024, 10:00:48 AM",
      "body": "I made many mistakes, so I decided to forget them. I don't want to remember it because it will make me regret it. Exchanging Bitcoin to buy a new coin expected to rise high is the mistake we most often experience. And it has happened so often that we still do it, perhaps even now.We just assume that what we have done to make an error is normal. It makes us still do it and we may still do it if we forget the previous mistake. Another story is when an investment offer is too attractive, which makes us want to try it. Many of us have experienced that.Well, those are all stories we have experienced that have made us regret it. But we can still get up and learn from those mistakes so they don't happen again. We can only keep trying to be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "January 28, 2024, 10:33:26 AM",
      "body": "I don't have a lot to say here but you did the right thing by taking risks, what you did wrong was going all in, imagine if you did this on Ethereum, will you be complaining today? As for those who have interest in alternative coins I always tell them to diversify their portfolio, because if one or two goes wrong you will be fine if one did very well. Bitcoin is still the best bet but believe that, newer opportunities will always come, we can't always stick with Bitcoin, the opportunity keeps shrinking every year and it keeps getting harder to mine.Also, bear market always get boring, even the most prepared will start doubting their moves at a point, I am in no shape to feel like this anymore as I have gone pass this already, you need a lot of patience in crypto investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "January 28, 2024, 10:36:32 AM",
      "body": "Quote from: DapanasFruit on January 28, 2024, 06:57:27 AMMade mistakes with your Bitcoin in the past...that you still regret or at least considered to be a wrong move especially considering the price of BTC these days? Three years ago, I got bored with the movement of Bitcoin so I look for other good alternatives which I can use to replace...unfortunately I decided to go for BTCV all in. And it was a big horror because two months after the price of BTCV dropped to just 30% to when I bought them...got no choice but to cut loss. I consider it an experience because to be honest there are a number of people who are not in a good condition at the start of investing or trading in bitcoin. People's habits will differ from one case to another, such as you selling Bitcoin and choosing the alternative of buying BTCV and in the end you regret that what you did in the past was not right. In contrast to me, I didn't have a good analysis of Bitcoin's journey in the market, so when the price of Bitcoin fell, I panicked and sold Bitcoin below the purchase price. That experience is still a long memory for me when I first got to know Bitcoin and because of my carelessness and lack of knowledge I allowed losses to come my way.Quote from: DapanasFruit on January 28, 2024, 06:57:27 AMPlease share your story here if you have one so we can learn a lesson or two...There are many stories for everyone's initial introduction to bitcoin and there are probably many people who were quite unlucky at the beginning of their purchase. There are even people who bought bitcoin when the price was cheap and now they have gained quite a large investment value when selling bitcoin on the way to ATH. It's just a matter of luck with early involvement at the knowledge stage and both have different sides to the story for people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "January 28, 2024, 10:41:05 AM",
      "body": "Quote from: boyptc on January 28, 2024, 08:07:12 AMYou are making me remember of my friend that has the same reason for disposing and selling his bitcoin. The reason doesn't make sense. He has got bored as well and that led him to sell.I think that was on 2018 and bored in a way that it was a bear market and prolly he lost hope by that time. A mistake that can no longer be corrected but can still recover somehow through accumulation. 2018 and especially 2019 were the period when people lost hope on Bitcoin as it was an extended bull run and altcoin bloodbath, Bitcoin was under $5k in 2019, I remember so many people selling it off and whales silently buying it and accumulating it. Even now people made same mistakes until recently they sold Bitcoin for under $20k only to regret it now, I think I have learned a good lesson I have started accumulating Bitcoins through DCA and don't withdraw any funds unless it's for emergency purpose and people should learn from previous mistake instead of falling for fuds and panic selling or selling for huge loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "January 28, 2024, 10:44:32 AM",
      "body": "Quote from: boyptc on January 28, 2024, 08:07:12 AMYou are making me remember of my friend that has the same reason for disposing and selling his bitcoin. The reason doesn't make sense. He has got bored as well and that led him to sell.I think that was on 2018 and bored in a way that it was a bear market and prolly he lost hope by that time. A mistake that can no longer be corrected but can still recover somehow through accumulation. I think thats why we shouldnt be impulsive in making decisions. But if the money actually help him, then it is not a loss after all. your friend can totally jump back into Bitcoin whenever he wants. Crypto's always open for a comeback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "January 28, 2024, 10:51:22 AM",
      "body": "My story that I really regret not holding Bitcoin or trying to understand it well, knowing that my first bitcoin use and transaction was on 2015 and I remember the price was around 400$, the best and only place to buy Bitcoin those time was LocalBitcoins. My mistake and bad moves were using Bitcoin as a way of transferring, purchasing and getting paid with it, I never had the idea of holding a good amount of it for the future and it was my regret.Years after realizing the importance of holding any amount someone can afford of bitcoin is always a positive thing, I started understanding everything, believed in bitcoin and started investing in this revolutionary coin rather than any other way of savings ( banks, gold…). Especially living in a country where cryptocurrencies are prohibited, it’s hard to deal and exchange our currency for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "January 28, 2024, 11:12:03 AM",
      "body": "Apart from not having Bitcoin from the start I think I don't have to regret on Bitcoin or I haven't made any wrong move yet. the only thing I would have said is my regret is not use my snacks money to purchase Bitcoin after I knew about Bitcoin but I guess at that point investment was not what I was thinking about. Fun fact; I'm just a very few years older than Bitcoin lol.. maybe I'm lucky to even get exposed at my age. For you Op, its normal to get bored if your not certain or if your not motivated like the way people gets motivation from this forum. but you only went too far by dropping much of your stash to that altcoin but well we gat to leave past behind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "January 28, 2024, 12:07:29 PM",
      "body": "I wouldn't say I've made any blunders with my Bitcoin buys.  Well, besides maybe kicking myself for not going all in when the price was cheaper early on.  But that ain't really a mistake I guess.  I havent been tricked by any scams or got hacked to lose my crypto either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "January 28, 2024, 12:20:29 PM",
      "body": "That's why many investors are saying that it's better to invest in bitcoin than those coins that are not trustworthy. The thing is, many new coins are emerging in the market, but not all of them have a long life span. What I mean is that not all coins that are launched can survive long in the market. That's why it's better to invest in known crypto currencies than those new ones, but how will new good or potential crypto currencies emerge if we do not try to risk those new coins? That's why if someone here wants to explore and discover new coins that have potential, then they better be ready to take the risk and better be good at judgement, because I'm one of those investors who would like to seek new coins that have the potential or coins that I could take advantage of because they were recently launched.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}