{
  "id": "topic_5406531",
  "title": "tvplus006",
  "author": "tvplus006",
  "created_time": "July 16, 2022, 02:54:46 PMLast edit: July 16, 2022, 03:48:09 PM by tvplus006",
  "content": "What happened: Ponzi scheme 2,3% PROFIT DAILYFlag type 1 (support/oppose): https://bitcointalk.org/index.php?action=trust;flag=3006 Thread Link: https://bitcointalk.org/index.php?topic=5406508.0 Archived: https://archive.ph/bspqxScammer Profile Link: https://bitcointalk.org/index.php?action=profile;u=3490266Website: https://mayotrade.com/Archived: https://web.archive.org/web/20220716150008/https://mayotrade.com/Quote   Domain Name: MAYOTRADE.COM   Registry Domain ID: 2430432312_DOMAIN_COM-VRSN   Registrar WHOIS Server: whois.PublicDomainRegistry.com   Registrar URL: http://www.publicdomainregistry.com   Updated Date: 2022-06-24T17:51:00Z   Creation Date: 2019-09-06T08:04:50Z   Registry Expiry Date: 2023-09-06T08:04:50Z",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406531",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "July 16, 2022, 03:37:36 PM",
      "body": "First saw it appeared in the gambling section hours earlier and try to defend why he is posting in the gambling section, he even got himself a copper account so he can maximize his promotion here, he is so naive and not aware that the community will give him red tag and flag for posting here in Bitcointalk.There's a big difference between investing in the Ponzi scheme and playing in a casino, on a project he is promoting you are going to lose money without getting anything, while playing in a casino, you can lose your money but at least you'll have fun and be entertained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "July 17, 2022, 11:32:02 PM",
      "body": "The promoter of that Ponzi scheme is not aware that he'll get tagged promoting his Ponzi scheme here, he even gets himself a copper account and posts it on the gambling section thinking that his site is a gambling site, obviously, he did not know the full definition of a casino or gambling site, good for him and a warning to those who will promote their Ponzi scheme here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "July 17, 2022, 11:43:16 PM",
      "body": "I think I tagged their account earlier today after reading a request for flag against them. These types of scams show no sign of abating because there will always be gullible users that fall in to their traps.Even if they catch a few victims a year they will be making some sort of income at the expense of others, that is why they keep on doing what they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "July 21, 2022, 05:49:45 AM",
      "body": "Quote from: Mayo Trade on July 16, 2022, 01:57:09 PMHi,https://bitcointalk.org/index.php?board=5.0Please check the 4th row of this. There it's mentioned 'Gambling and all \"investments\" that are so risky they might as well be gambling (HYIPs, pyramid schemes, etc.)'. Please correct me if I'm wrong or if you have any suggestions.First time I've seen a Ponzi promoter wearing a copper account and defending that his project is gambling related, he doesn't know how to differentiate between a Ponzi Scheme and gambling projects, you can't ever win in a Ponzi scheme if you are a late investor and you are losing money without any return, compared to gambling that you will at least enjoy and get excited on the game, so even if you lose in gambling you are still compensated on your experience, you'll not get anything from investing in Ponzi schemes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 21, 2022, 08:38:45 PM",
      "body": "Quote from: aioc on July 21, 2022, 05:49:45 AM...you can't ever win in a Ponzi scheme if you are a late investor and you are losing money without any return...It depends solely on the greed of the organizers of the ponzi scheme. I know many such cases when not only the last investors of the pyramid lost their money, but also those who joined first. For some scammers, it is enough to get a few tens of dollars so that they close the existing site and continue their fraud on a new one the next day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}