{
  "id": "topic_5468834",
  "title": "BitGoba",
  "author": "BitGoba",
  "created_time": "October 01, 2023, 11:11:57 PM",
  "content": "Spend Sats is a regularly updated database of online businesses accepting bitcoin https://spend-sats.comFeel free to add your business",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468834",
  "comments": [
    {
      "author": "WillyAp",
      "created_time": "October 02, 2023, 02:53:56 PM",
      "body": "Quote from: BitGoba on October 01, 2023, 11:11:57 PMFeel free to add your businessThat button leads to connect your wallet. Hardly any business listet. I wonder why?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "October 02, 2023, 04:47:40 PM",
      "body": "Quote from: WillyAp on October 02, 2023, 02:53:56 PMQuote from: BitGoba on October 01, 2023, 11:11:57 PMFeel free to add your businessThat button leads to connect your wallet. Hardly any business listet. I wonder why?https://lightninglogin.live/learnhttps://github.com/lnurl/luds/blob/legacy/lnurl-auth.md",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "October 02, 2023, 05:05:21 PM",
      "body": "it is a new possibility of simple logging in via bitcoin lightning wallet or alby lightning  walletLightning Login gives users the enhanced speed, convenience, and security of password-free logins.You don't need to worry it is completely safe, many sites use lightning loginhttps://geyser.fund/https://stacker.news/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "October 02, 2023, 05:16:33 PM",
      "body": "This site is new and I have been working on it myself for the past monthI plan to improve it and add many more services and shopsI'm a hardcore bitcoiner, this directory is a gift to other bitcoiners so they can spend their bitcoins in the upcoming bull market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "October 02, 2023, 08:15:31 PM",
      "body": "Love to share some tips, I would change the logo a bit to make it more \"Modern\" look at bitcoinwide. I would also change the font and try using bold fonts on titles. The current font looks a bit messy (could be my browser)Also, nobody wants to sign-in with their wallet on a brand-new service. It does not matter that you can't access it, bitcoin is meant to be private, so users don't even want to share their bitcoin address.I would also create an info page for each listing with additional information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "October 03, 2023, 08:40:32 AM",
      "body": "Most web platforms use social sign-in like facebook or tviter methods which severely compromise your privacy, or they use simple email/password combinations which are easy to forget. Lightning Authentication solves this problem by allowing you to authenticate without giving up any private informationLightning is a second layer payments network built on top of Bitcoin, designed for making faster and smaller payments. But Lightning isn’t just for payments. Everyone who uses it will have a unique identifying number, which won’t be connected to any personal information.Your unique Lightning ID is not tied to any personal information and can be used as Proof of Identity in platforms that support Lightning Authentication. This means that any individual can prove their identity using a Bitcoin/Lighting node without the need social media accounts, or even an email/password combination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 04, 2023, 07:29:15 PM",
      "body": "Quote from: BitGoba on October 01, 2023, 11:11:57 PMSpend Sats is a regularly updated database of online businesses accepting bitcoin https://spend-sats.comIs this website made and owned by you?This category needs some updating.I wouldn't really put everything under hardware wallet category, and some entries needs typing corrections.You need to add letter L to Cryptostee, and move this to new Backup Seed category (same as Vulcan, Seedor, etc.).https://spend-sats.com/spendbitcoin/hardware-wallets/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "October 18, 2023, 06:03:13 AM",
      "body": "Quote from: BitGoba on October 02, 2023, 05:16:33 PMThis site is new and I have been working on it myself for the past monthI plan to improve it and add many more services and shops<snip>The site seems to be decently functional. It'll surely be helpful for people who are looking for potential stores where bitcoin is allowed as a mode of payment. The UIUX design has a lot of room to grow though. But I am confident that you'll be able to make gradual enhancements.Have you considered generating revenue from this website? I believe it has the potential to be an excellent platform for crypto businesses to advertise their products and services, which could attract a significant number of them.Welcome to the forum, and best of luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}