{
  "id": "topic_5461721",
  "title": "fathafraink",
  "author": "fathafraink",
  "created_time": "August 01, 2023, 07:09:07 PM",
  "content": "I feel sad when there are government sites that experience hacks such as deface, and others. Recently I discovered that there were hacks on Indonesian government websites, oddly enough, not just one site but many. Strangely, when I report to a government website that provides reporting, I am required to register my identity, shouldn't the reporter's identity be hidden?Until I made this post, there are several sites that have not been repaired by the government site holders:- https://silaris.kemenkumham.go.id/images/slot-gacor/- https://essh.sulselprov.go.id/- http://sisukma.itsimrs-rsudklungkung.id/- https://sister.mahadewa.ac.id/js/what do you think about government sites that are easy to attack? shouldn't government sites have adequate security?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461721",
  "comments": [
    {
      "author": "WillyAp",
      "created_time": "August 13, 2023, 12:12:22 PM",
      "body": "In cases where the government does not care about IT Infrastructure, some state employees sell access, or do stuff like parked pages.Many hacks have a connection with staff members, used for emails: sending phishing scripts and such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "October 13, 2023, 12:23:37 PM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMwhat do you think about government sites that are easy to attack? shouldn't government sites have adequate security?While government servers and sites have been compromised many times over the years.It is possible the vaticans servers have never been hacked or defaced publicly.Which is both interesting and funny to think about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Best-mary",
      "created_time": "October 13, 2023, 01:03:14 PM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMI feel sad when there are government sites that experience hacks such as deface, and others. Recently I discovered that there were hacks on Indonesian government websites, oddly enough, not just one site but many. Strangely, when I report to a government website that provides reporting, I am required to register my identity, shouldn't the reporter's identity be hidden?Until I made this post, there are several sites that have not been repaired by the government site holders:- https://silaris.kemenkumham.go.id/images/slot-gacor/- https://essh.sulselprov.go.id/- http://sisukma.itsimrs-rsudklungkung.id/- https://sister.mahadewa.ac.id/js/what do you think about government sites that are easy to attack? shouldn't government sites have adequate security?If government should let their site get hacked easily without doing something about it or improving their security. Then the nation should be ready for something not pleasant coming",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "October 14, 2023, 08:12:24 AM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMI feel sad when there are government sites that experience hacks such as deface, and others. Recently I discovered that there were hacks on Indonesian government websites, oddly enough, not just one site but many. Strangely, when I report to a government website that provides reporting, I am required to register my identity, shouldn't the reporter's identity be hidden?Until I made this post, there are several sites that have not been repaired by the government site holders:- https://silaris.kemenkumham.go.id/images/slot-gacor/- https://essh.sulselprov.go.id/- http://sisukma.itsimrs-rsudklungkung.id/- https://sister.mahadewa.ac.id/js/what do you think about government sites that are easy to attack? shouldn't government sites have adequate security?Not just Indonesia, even our country, the Philippines has been hacked as well, https://news.abs-cbn.com/video/news/10/12/23/2-more-govt-agencies-allegedly-suffer-data-breach-expertQuoteTwo more government agencies have allegedly been the subject of data breaches, a tech expert said Thursday, following news of similar cyber attacks against the Philippine Statistics Authority and the Philippine Health Insurance Corp.And then this criminals demanding a $300,000 ransom money and now the leaked data is on the dark web already. So the Philippines should expect a lot of phishing in the next coming months or years due to this breached.It was the Medusa malware that infected the PhilHealth system and unfortunately, our government agency doesn't have enough protection to this kind of cyber attacks. And it seems that Asia is now being targeted by this criminal groups because they know that they are weak and could easily be hack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TakeItEasy",
      "created_time": "October 20, 2023, 04:28:53 PM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMI feel sad when there are government sites that experience hacks such as deface, and others. Recently I discovered that there were hacks on Indonesian government websites, oddly enough, not just one site but many. Strangely, when I report to a government website that provides reporting, I am required to register my identity, shouldn't the reporter's identity be hidden?Until I made this post, there are several sites that have not been repaired by the government site holders:- https://silaris.kemenkumham.go.id/images/slot-gacor/- https://essh.sulselprov.go.id/- http://sisukma.itsimrs-rsudklungkung.id/- https://sister.mahadewa.ac.id/js/what do you think about government sites that are easy to attack? shouldn't government sites have adequate security?This is all about the government's care of their online database, how they treat it, and in what ways they expect it to work for them. As you will be familiar with Information Technology (IT) if a country is strong in this then no one can easily hack their website and no one can easily look at their entire online system. But if a country doesn't give any care to this department then mostly hackers attack their websites and their main task is to hack the entire website's data. And I have seen that countries' banks have been hacked and hackers stole the money that was in their banks. I don't understand with this much strong security of a bank, how a bank could be hacked. And most people's money was stolen previously. So, this website I didn't think had a strong security system that's why they are hacked easily. Otherwise, if the security of a website in a country is strong enough then it is too difficult for a hacker to hack it. Any Government should take quick action against this act.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "November 01, 2023, 09:33:00 AM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMI feel sad when there are government sites that experience hacks such as deface, and others. Recently I discovered that there were hacks on Indonesian government websites, oddly enough, not just one site but many. Strangely, when I report to a government website that provides reporting, I am required to register my identity, shouldn't the reporter's identity be hidden?Until I made this post, there are several sites that have not been repaired by the government site holders:- https://silaris.kemenkumham.go.id/images/slot-gacor/- https://essh.sulselprov.go.id/- http://sisukma.itsimrs-rsudklungkung.id/- https://sister.mahadewa.ac.id/js/what do you think about government sites that are easy to attack? shouldn't government sites have adequate security?To my understanding I believe  some of this site claiming to be hacked could be self hacked sometimes to cover up their mess, ammend databases or to even change figures or destroy them entirely. Most government site aren't free from third parties  Most especially when it comes  to figures  and datas, I believe  that's y most of them run classified datas mostly online free",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uhwuchukwu53",
      "created_time": "April 13, 2024, 12:31:44 PM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMwhat do you think about government sites that are easy to attack? shouldn't government sites have adequate security?This is strong question, naturally anything government is meant to be the most secured and first in all but the issue is that the government is not sincere to itself, as most hacking is done by the so called government to covered up there mess , in reference to my nation I have seen situation government uses diverse means to cover up there mess to avoid escalating to the public like burning of public office where vital documents to be revail on their mess is, demolition of property in relation to where crime in which their official that can revail the mess it etc . Knowing fully well that nothing goes beyond the control of the government any hacked with government detecting and controlling has their hand indirectly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "May 04, 2024, 09:58:36 AM",
      "body": "Quote from: Uhwuchukwu53 on April 13, 2024, 12:31:44 PMQuote from: fathafraink on August 01, 2023, 07:09:07 PMwhat do you think about government sites that are easy to attack? shouldn't government sites have adequate security?This is strong question, naturally anything government is meant to be the most secured and first in all but the issue is that the government is not sincere to itself, as most hacking is done by the so called government to covered up there mess , in reference to my nation I have seen situation government uses diverse means to cover up there mess to avoid escalating to the public like burning of public office where vital documents to be revail on their mess is, demolition of property in relation to where crime in which their official that can revail the mess it etc . Knowing fully well that nothing goes beyond the control of the government any hacked with government detecting and controlling has their hand indirectly.Because of the massive corruption in governments, people don't totally trust them anytime that they come out to say that there's a hack in any of their ministries, because most often it's the government officials that initiates these hacks, that is why they won't invest maximally to fortify their systems against hacks. Normally government datas are supposed to be the most secured, to protect their assets and sensitive information. Government officials are the ones that knows sensitive information that can compromise their ministry's database, and in order to steal, they'll collaborate with hackers to do their dirty jobs. In the past when we see or hear about a government sector building on fire, people's assertion will be that they've stolen money or sensitive materials and information for financial gains, and they've intentionally started the fire to hide every evidence. This goes to show the level of distrust that people have for our government, because of the obvious corruption in the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "May 05, 2024, 12:38:19 PM",
      "body": "Quote from: Kelward on May 04, 2024, 09:58:36 AMThis goes to show the level of distrust that people have for our government, because of the obvious corruption in the system.The people love conspiracy theories, and the same people who love conspiracy theories are not aware that they show a lack of trust in themselves.People nowadays seem not to know much about psychology.The UK their NHS system was hacked.https://www.theguardian.com/technology/2022/aug/11/nhs-ransomware-attack-what-happened-and-how-bad-is-itA high % of worldwide officials worldwide are plainly stupid, government, UNO, you name it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "June 07, 2024, 07:47:32 AM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMwhat do you think about government sites that are easy to attack? shouldn't government sites have adequate security?Obviously no Private, organisation or private sectors is bound to be attacked by hackers. We all just need to build a well security project and always keep the security programs updated because those hackers approaches gradually and doesn't succeed to invade the sites at a time. So if the security engineers could always stay on track and active, of course they could always determine when the sites is likely to be compromised.I think it's even better when the government security system is being more attacked than the private sectors because they always think they'd always have the best security regulations. We can just imagine the security differences between the centralized and the decentralized financial networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sbercoin.one",
      "created_time": "June 08, 2024, 03:25:45 PM",
      "body": "Quote from: fathafraink on August 01, 2023, 07:09:07 PMwhat do you think about government sites that are easy to attack? shouldn't government sites have adequate security?First of all, it should be borne in mind that the security of government sites is handled by exactly the same employees who deal with the security of any other sites. It's always just a matter of salary. The government competes for employees on a par with corporations and other market participants.  Therefore, ensuring security in this case means hiring more employees and playing them a higher salary than anyone else. But the activities of government organizations are very heavily regulated, not only the services responsible for web-site security are fighting for budgets, but also for border security, traffic safety, and so on. There are a lot of different institutions that would like to increase their budget and probably the security of the web-site is not in the first place here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcSeo",
      "created_time": "October 29, 2024, 11:43:22 AM",
      "body": "Quote from: Hydrogen on October 13, 2023, 12:23:37 PMQuote from: fathafraink on August 01, 2023, 07:09:07 PMwhat do you think about government sites that are easy to attack? shouldn't government sites have adequate security?While government servers and sites have been compromised many times over the years.It is possible the vaticans servers have never been hacked or defaced publicly.Which is both interesting and funny to think about.\"...It is possible the vaticans servers have never been hacked or defaced publicly......\"  Who told you that?RegardsBitseo 》 from Rome",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "October 29, 2024, 11:51:26 AM",
      "body": "That raises concerns about national security, as those websites contain vital information that could be used against a country. It’s true that no website is hack-proof, but the government should invest in the best firewalls and hire the most skilled professionals to maintain strong security for their servers.If we consider this, the government acts as the regulator and is involved in the IT industry as well. So, if they can be hacked, it raises questions about their reliability in regulating this industry. Such news could significantly reduce public confidence in their ability to protect sensitive information and maintain cybersecurity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshio-man",
      "created_time": "October 31, 2024, 03:26:56 PM",
      "body": "Not only Indonesia government that is facing this kind of challenge, there are some governments website has been hacked but they found solution quickly to recover all the things they have lost, and get the hackers arrested for tapered with their website, some of the government website hackers use to hack easily, some of the government officials use to have hands in the issues  by given the hackers all the details concerning the website, which you will not know that government officials involve because there are some records they use to delete from the website for the government not to know that they have involved in some negative things in the country,  if the government discovered such act, they will be sentence to life imprisonment in my country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 31, 2024, 04:51:06 PM",
      "body": "Governments should certainly have websites that are hard to hack. They should have the very top levels of online security. There are some very sophisticated hackers though & governments websites are a big target though so I think they are always going to have a problem with people trying to compromise them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m4r1o",
      "created_time": "November 18, 2024, 02:57:38 PM",
      "body": "Quote from: DeathAngel on October 31, 2024, 04:51:06 PMGovernments should certainly have websites that are hard to hack. They should have the very top levels of online security. There are some very sophisticated hackers though & governments websites are a big target though so I think they are always going to have a problem with people trying to compromise them.yes but very often this doesn't happen, I'm Italian and I don't know if you know the scandal that recently happened to the government, they profiled everyone and accessed the sources directly from the database so I really say that no site is safe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m4r1o",
      "created_time": "December 30, 2024, 12:47:16 PM",
      "body": "Quote from: WillyAp on August 13, 2023, 12:12:22 PMIn cases where the government does not care about IT Infrastructure, some state employees sell access, or do stuff like parked pages.Many hacks have a connection with staff members, used for emails: sending phishing scripts and such. exactly, there are many states that are not very interested in investing in the IT infrastructure of a company, and in this case we are talking about a company because the state is a company and as such it must be protected, but it is not interested in investing and hiring people fits the role and these are the pathetic results",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 30, 2024, 12:58:20 PM",
      "body": "Quote from: m4r1o on December 30, 2024, 12:47:16 PMexactly, there are many states that are not very interested in investing in the IT infrastructureIt's not necessarily \"the state\". It's more complicated.They hire inexperienced people or companies for implementing and maintaining the IT infrastructure parts. They do this because they usually have to give at lowest costs (because of the laws) and still get some money back (corruption) or hire \"friends\" (still corruption).Somebody hired for the job will do the minimum possible at minimum costs (see above), without any fears that they will be held responsible for anything.If the infrastructure is hacked or broken, we get to yet another \"maintenance/upgrade\" cycle/contract like this.If it's done with people, not companies, those are usually (at least in my country) hired for life, no matter how incompetent or lazy they are, leading - sooner or later to asking for the aid of a company too (in the terms already described).This being said, I find it pure luck that there aren't more, bigger and worse hacks over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}