{
  "id": "topic_5456003",
  "title": "Bialke",
  "author": "Bialke",
  "created_time": "June 11, 2023, 03:25:11 AM",
  "content": "On February 9th, 2011 Bitcoin had a market position (price) of 1 USD.Now, on June, 11th, 2023, the market position of Bitcoin is ~25,000 USD. But is this right? A lot of \"money people\" or \"Bitcoin maximalists\" are telling this story. But this is not true at all. Inflation corrected is around 30 to 40 percent of the ~25.000 USD. So it is basically a market position (in relation of the value of 2011) of ~12,000 USD.This is also really good,but it shows two things:1. Bitcoin is FIAT-bounded, and through exchange rates, has a worse inflation rate as FIAT.2. Nearly every aggregator and exchange which is showing Bitcoin rates not indlation corrected is scamming! (To pump FIAT in the market.)Prove me wrong, I would love to be wrong! But I am not.Edit:And this is just the inflation related to Bitcoin-Fiat/good. What is about the \"chain-inflation\"? First Bitcoin has 21 million, first fork has 21 million, and so on - and all this Bitcoin eating from the same bowl...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456003",
  "comments": [
    {
      "author": "d5000",
      "created_time": "June 11, 2023, 03:45:47 AMLast edit: June 11, 2023, 04:49:02 AM by d5000",
      "body": "Quote from: Bialke on June 11, 2023, 03:25:11 AM1. Bitcoin is FIAT-bounded, and through exchange rates, has a worse inflation rate as FIAT.I may not understand properly what you mean here, but isn't it the other way around?Even if your 30-40% \"inflation adjustment\" is true (I believe it is closer to 25% since 2013, because there were long stretches of very low inflation rate, only in the last 2 years it accelerated), you get an inflation (=deflation) rate of -96% for the last 10 years (taking for 2013: a price of $500, and for 2023, a price of $15000), which (estimated without calculating it) is about -15% per year.If you have a good valued $100000, then in 2013 its price in BTC was BTC200, in 2023 its BTC6,70.At this moment, Bitcoin is deflationary. This may change, but we're still not there.Quote from: Bialke on June 11, 2023, 03:25:11 AMWhat is about the \"chain-inflation\"? First Bitcoin has 21 million, first fork has 21 million, and so on - and all this Bitcoin eating from the same bowl...Yeah, but the main chain Bitcoin is still $15000 (in 2013 prices) or $25000 (in 2023 prices) worth, because you must add the market cap/price of the fork chains, not subtract it. The fork coins aren't fungible with the mainchain BTC. Or would you pay $10000 or more for a BSV?If I'm completely misunderstanding, please elaborate   (sorta interesting topic, by the way).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "June 11, 2023, 04:00:20 AM",
      "body": "I fail to understand your logic behind this calculation or I am too stupid to understand it. I would like you to explain me this like I am a five.Why are we even comparing 11th June, 2023 Bitcoin price with 2011 price? What Inflation corrected in market for Bitcoin? I am not even drunk mate.Still your thread is way above my level of understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 11, 2023, 04:26:39 AM",
      "body": "Can you explain further your 30-40% thing? Cant see how you ended up with that number.1. FIAT is just the trading pair. That's how markets work — you pair the asset with the most used asset for trading, which is fiat.2. ? ? ?\"Chain-inflation\": I can create my own version of the USD, but it wouldn't do crap with the economics of the USD. Same with with the bitcoin-forks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 11, 2023, 09:03:08 AM",
      "body": "Quote from: d5000 on June 11, 2023, 03:45:47 AMI may not understand properly what you mean here, but isn't it the other way around?You get it right, it's the other way round. Quote from: ImThour on June 11, 2023, 04:00:20 AMWhy are we even comparing 11th June, 2023 Bitcoin price with 2011 price? What Inflation corrected in market for Bitcoin? I am not even drunk mate.Still your thread is way above my level of understanding.Actually, what he says is not wrong, but it is partly true and partly not.Quote from: mk4 on June 11, 2023, 04:26:39 AMCan you explain further your 30-40% thing? Cant see how you ended up with that number.Cumulative inflation, as calculated by him.Quote from: mk4 on June 11, 2023, 04:26:39 AM1. FIAT is just the trading pair. That's how markets work — you pair the asset with the most used asset for trading, which is fiat.Yes, but what he says is not wrong. It's like me telling you that I bought a house for $500,000 and sold it after 10 years for $550,000. On the face of it I have made a profit but if cumulative inflation over that period is 30% I have lost money in real terms, not to mention that I have to pay capital gains tax on a profit that if we discount inflation I have not made. What the OP is doing is deflating, I think it is called, the price of bitcoin measured in fiat, which is not bad but he is wrong when he says that bitcoin is inflationary, as the accumulated profitability beats inflation by far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 11, 2023, 09:51:21 AM",
      "body": "Quote from: Bialke on June 11, 2023, 03:25:11 AM1. Bitcoin is FIAT-bounded, and through exchange rates, has a worse inflation rate as FIAT.Your assumption makes little sense to me, first being paired to fiat does not make Bitcoin \"fiat bound\". What does fiat bound even mean?And Bitcoin did not suffer inflation at all to have had a worse inflation that fiat currencies, it's a deflationary asset.Quote from: Bialke on June 11, 2023, 03:25:11 AM2. Nearly every aggregator and exchange which is showing Bitcoin rates not indlation corrected is scamming! (To pump FIAT in the market.)This makes no sense again. Your banks are also supposed to show you the value in your account adjusted for inflation, no?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 11, 2023, 10:25:38 AM",
      "body": "I don't quite understand your point. How is Bitcoin worse than fiat in terms of inflation rate, or the effects thereof? In 2011, what can you buy with 1 dollar? Fast forward to 2023, can you say that you will have to pay $10 in order to buy that same thing? Probably not? But supposing the prices have multiplied 10 times, Bitcoin's growth not only kept up, it greatly surpassed the rate of inflation. If from 2011 to 2023 the prices of goods rose to as high as x10, the price of Bitcoin grew more than x1000. How, then, can Bitcoin be worse than fiat when while fiat's purchasing power weakened Bitcoin's increased? As far as \"chain-inflation\" is concerned, Bitcoin forks aren't Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "June 11, 2023, 10:38:28 AM",
      "body": "Quote from: Upgrade00 on June 11, 2023, 09:51:21 AMQuote from: Bialke on June 11, 2023, 03:25:11 AM1. Bitcoin is FIAT-bounded, and through exchange rates, has a worse inflation rate as FIAT.Your assumption makes little sense to me, first being paired to fiat does not make Bitcoin \"fiat bound\". What does fiat bound even mean?And Bitcoin did not suffer inflation at all to have had a worse inflation that fiat currencies, it's a deflationary asset.Partially i sensed it to be without fiat one would not be able to purchase bitcoin at the first place, being that for a trade to occur you must first make a deposit of fiat then possibly convert or trade to usdt before buying bitcoin. This is what i senses by op saying fiat bound, actually when dealing with bitcoin and fiat they both has interrelationship whereby to spend your bitcoin need a fiat and maybe, might be the same to stores that accepts bitcoin but in real life we must need to sell to fiat before finally spending it. However, Op should try to making his post a bit comprehensible for better interaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 11, 2023, 11:03:29 AM",
      "body": "Quote from: ImThour on June 11, 2023, 04:00:20 AMI fail to understand your logic behind this calculation or I am too stupid to understand it. I would like you to explain me this like I am a five.Why are we even comparing 11th June, 2023 Bitcoin price with 2011 price? What Inflation corrected in market for Bitcoin? I am not even drunk mate.Still your thread is way above my level of understanding.I am just laughing here, not at op but at my self, can't believe how stupid I've become to not understand  any single thing the op is talking about, and to be sincere, I had my thinking along the same line as yours, amongst the reason why bitcoin was created, one of them was to serve as a means through which people could save their money from being affected by inflation, and from my perspective, bitcoin has done a wonderful job in that area, I don't know how or where op got the idea of inflation affecting bitcoin, I think we all need a clearer explanation from op..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 11, 2023, 11:26:35 AM",
      "body": "the OP chose a $1 btc on specific date of 2011 to try to set a bad premiss.. .. because in 2011 the price of bitcoin ranged from $0.30-$30meaning he could have chose any other random date of 2011 and it would have produced different resultsEG if he picked the $0.30 price date, the 'inflation correction\" of today would show a different amount to his inflation adjusted position of $12k calculationinshort if he picked the price of july 11th next month for a 2011-2023 comparison .. his maths would be totally different to this months math. making his math pointless inshort if he picked the price of May 11th last month for a 2011-2023 comparison .. his maths would be totally different to this months math. making his math pointless ...if you want to talk about inflation/deflation... use the CPI(consumer price index) as a measure. or more simply \"the bread loaf purchase\"if in 2011 1btc was 1 loaf of bread and $1fiat  was one loaf of breadin 2023 1btc is 10,000 loaves of bread and $1 is 0.4 of a loaf of breadyep you CANT buy bread for $1 now, because now it averages $2.50yet with bitcoin you can buy 10,000 loaves of bread for 1btcbitcoin does not follow or react to fiat inflation.. bitcoin has its own market where deflation occurs. not inflation.the mechanisms of fiat is that it buys you less produce. due to how the fiat market worksthe mechanisms of bitcoin is that it buys you more produce. due to how the bitcoin market works",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 11, 2023, 12:01:24 PM",
      "body": "Get your point (I'm slightly inebriated so maybe that helps, but hey, Sunday afternoon) but if you're adjusting for inflation, at least show the basis for that. I don't really buy the inflation adjustment in my country, or maybe even the US (we're always talking the dollar) but at least there is a straightforward formula for that (CPI, as franky suggests). I personally like the big mac index even though it's no longer as good a ruler as before (for me).And even the way you chose to set your price for 2011 is poor, you don't pick arbitrary dates (franky points out too), you get at least the average price (again, how you do this matters).Either way you choose, you won't prove your statement... so please, prove yourself right properly? Eager to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "June 11, 2023, 04:25:52 PM",
      "body": "You raise some provocative points here, with an edgy touch! Has Bitcoin's growth been as stellar as we've been led to believe? What happens when we throw inflation into the mix? While your inflation-adjusted analysis holds water, I think it's worth noting that the appreciation of Bitcoin, even accounting for inflation, is impressive. Sure, 12k USD isn't 25k USD, but it's still an astronomical growth! Who among us, in 2011, could've predicted that?On the claim that Bitcoin is FIAT-bounded, well, aren't all assets? Gold, stocks, properties, they're all quoted in terms of fiat. It's a byproduct of how our current financial system operates. As for Bitcoin forks, I must ask - do they genuinely count towards Bitcoin's \"chain-inflation?\" Each fork is a separate entity, with different demand, supply, and market perception. They're from the same family tree, yes, but they're not identical twins. You may argue that these forks dilute the Bitcoin brand, but that's an entirely different conversation, isn't it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bialke",
      "created_time": "June 11, 2023, 05:01:37 PM",
      "body": "Quote from: franky1 on June 11, 2023, 11:26:35 AMthe OP chose a $1 btc on specific date of 2011 to try to set a bad premiss.. .. because in 2011 the price of bitcoin ranged from $0.30-$30meaning he could have chose any other random date of 2011 and it would have produced different resultsEG if he picked the $0.30 price date, the 'inflation correction\" of today would show a different amount to his inflation adjusted position of $12k calculationinshort if he picked the price of july 11th next month for a 2011-2023 comparison .. his maths would be totally different to this months math. making his math pointless Yes Sir, you are right. To pick 1 USD was arbitrarily. To chose 0.0001 or 0.30 or 500 USD would also be. This is not my point exactly. (It is more compex of course: Mining costs, past overall wins and loses of traders, ....)Quote from: Blitzboy on June 11, 2023, 04:25:52 PMYou raise some provocative points here, with an edgy touch! Has Bitcoin's growth been as stellar as we've been led to believe? What happens when we throw inflation into the mix? (...)Yes Sir, exactly - this is my point more. Sorry, for the language barrier. It makes it a little bit hard to explain.[Quote from: mk4 on June 11, 2023, 04:26:39 AMCan you explain further your 30-40% thing? Cant see how you ended up with that number.1. FIAT is just the trading pair. That's how markets work — you pair the asset with the most used asset for trading, which is fiat.Yes, Ma'am/Sir,this is the challenge: BTC is mostly just in trading pairs with FIAT or with other assets, which have also just trading pairs with FIAT. I think trading pairs f.E with futures (goods) or real goods would be better. Better to compare and to step away from FIAT's inflation.I also think to compare right (inflation corrected) you cannot take just one market position, you should also have a view of the overall market position and trading volume.My main point was, that the huge win with Bitcoin is not a hundert percent true. But yes, of course, when you get one on the 0.0001 or 20 USD level, then you made huge profits.For the calculation I took the USD yearly inflation - what is mostly around 1,5 to 5 percent a year, and in the last three years 8 to 10 percent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "June 11, 2023, 06:01:12 PM",
      "body": "Are you curious about why the price of Bitcoin has increased in relation to fiat currency inflation? It may seem contradictory since Bitcoin is also part of the economy and can be affected by inflation. However, the price of Bitcoin has risen primarily because of increased investor interest and demand. Bitcoin has a limited supply, and with more people investing in it, the demand has surpassed the available quantity, leading to a higher price. This is the fundamental reason behind the price surge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bialke",
      "created_time": "June 11, 2023, 06:35:06 PM",
      "body": "Yes, I am curious about that! You are right.If I set my investment to September 2021, a 1000 USD, then Bitcoin is nice at all! Basically through volitility I would have just ~500 USD now, and and two years of FIAT inflation (to which Bitcoin is bounded) with one year of ~7 and one year of ~9 percent.And no, it is not true that Bitcoins Coins are limited. (Yes, they are, but it is not everything of the deal!) 1000 USD FIAT in the market are cool - when Bitcoin was around, with 21 million coins, but then came Bitcoin fork \"Bitcoin XYZ\" with also 21 million coins. Or for example \"Etherium\". Also bounded to FIAT. It means that the FIAT in the market was splitted.And minor concerns are things like the inflation bug(s) of Bitcoin. Or betrayings on Bitcoin vendor machines. How much FIAT was involved there?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MtYermom",
      "created_time": "June 11, 2023, 06:44:46 PM",
      "body": "Quote from: Bialke on June 11, 2023, 03:25:11 AMNow, on June, 11th, 2023, the market position of Bitcoin is ~25,000 USD. But is this right? I want to sell you a coin for 40 000! Do I get buyers?I want to buy a coin for 20 000! Do I get sellers?I want to buy/sell for around 25000, I can get trades all over the world, then that must be the price!Inflation is as relevant as the cum stains left on a hotel bed in June, 11th, 2011!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "June 11, 2023, 07:03:33 PMLast edit: June 12, 2023, 12:19:04 AM by d5000",
      "body": "Quote from: Bialke on June 11, 2023, 06:35:06 PMIf I set my investment to September 2021, a 1000 USD, then Bitcoin is nice at all! Basically through volitility I would have just ~500 USD now,Can I get a link to the strange mathematical school you're adhering? In September 2021, Bitcoin was at $5-10. You would have got 100-200 BTC for your $1000. You could sell them today for $2.5 / $5 million, which in real terms (taking into account inflation rate) would be $1.5 to $3 million.Or, as you are mentioning volatility, are you referring to a trader who always \"buys high\" and \"sells low\" and thus today has only $500 left? In this case, it's not Bitcoin's fault I continue to consider that it's an interesting idea to talk about Bitcoin's real interest rate. Which is lower than its nominal interest rate, of course. But it continues to be a good investment.Also you talk about \"market position\". A market position is bound to a specific time, i.e. you have to compare it with other assets at current prices, or you can compare their real interest rates, but fiat inflation is equal for all of them (at least, if you take into account a single fiat currency for comparison, like the US dollar).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "June 11, 2023, 07:03:53 PM",
      "body": "Bitcoin become a part of the economy now,most of the unemployed people working in the bitcoin to earn the money.The bitcoin supply was limited now,So based on the demand and supply the bitcoin price will increase subsequently.The demand for bitcoin will increase and not possible one for the entire demand fulfilled by the supply.Because the mining of bitcoin is stopped but the demand increase with every year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bialke",
      "created_time": "June 11, 2023, 07:25:26 PM",
      "body": "Quote from: d5000 on June 11, 2023, 07:03:33 PMIf I set my investment to September 2021, a 1000 USD, then Bitcoin is nice at all! Basically through volitility I would have just ~500 USD now,Quote Can I get a link to the strange mathematical school you're adhering?  Out of topic:Once I tried to explain why -2 x -2 is a positive result. But in a way with a real life example. This is how strange my mathematics is. (But yes, you are right, Sir or Ma'am!)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "June 11, 2023, 09:26:33 PM",
      "body": "Quote from: Bialke on June 11, 2023, 03:25:11 AMOn February 9th, 2011 Bitcoin had a market position (price) of 1 USD.Now, on June, 11th, 2023, the market position of Bitcoin is ~25,000 USD. But is this right? A lot of \"money people\" or \"Bitcoin maximalists\" are telling this story. But this is not true at all. Inflation corrected is around 30 to 40 percent of the ~25.000 USD. So it is basically a market position (in relation of the value of 2011) of ~12,000 USD.This is also really good,but it shows two things:1. Bitcoin is FIAT-bounded, and through exchange rates, has a worse inflation rate as FIAT.2. Nearly every aggregator and exchange which is showing Bitcoin rates not indlation corrected is scamming! (To pump FIAT in the market.)Prove me wrong, I would love to be wrong! But I am not.Edit:And this is just the inflation related to Bitcoin-Fiat/good. What is about the \"chain-inflation\"? First Bitcoin has 21 million, first fork has 21 million, and so on - and all this Bitcoin eating from the same bowl... Don't know what bitcoin you're using, but from my experience bitcoin since 2011 has remained Deflationary. It has retained and even increased upon its initial value if we'll use the 2011 value of bitcoin as a standard. It's not fiat-bounded, as bitcoin could persist without the support of the dollar or any other currency for that matter. In some countries it's even being used as a substitute for the dollar or their national currency. So it seems to me that all your claims about bitcoin have been wrong. Idk about that bro, might wanna check your maths instead of trolling people here? Might wanna check the charts before supposing stuff?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}