{
  "id": "topic_5466999",
  "title": "Avantika jaiswal",
  "author": "Avantika jaiswal",
  "created_time": "September 16, 2023, 02:31:50 PM",
  "content": "Here is some special tools who analysis your data and on chain transection to evaluate your rank.Go and check . https://blocksbyte.com/layerzero-airdrop-rank/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466999",
  "comments": [
    {
      "author": "poodle63",
      "created_time": "September 16, 2023, 04:07:03 PM",
      "body": "It was only a speculation. Layer zero will have different qualification to determine the rank of wallet for its airdrop. I have been seeing a bunch of platforms that were also doing some speculations. That site is pretty much the same as dune. I think that we just need to regularly interact with its network to be qualified for the airdrop if there will any. Layer zero airdrop is still speculation at this moment, but people could try to interact on its network to anticipate it. I will not even take the result from such platform caused by its not a reliable data. That kind of platform was just mislead me. I have seen many people were being delusional caused by they were following speculations being made by others who didn't also know what metrics will be used by layer zero team to determine which accounts will qualify for airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ampere",
      "created_time": "September 16, 2023, 09:01:58 PM",
      "body": "Quote from: Avantika jaiswal on September 16, 2023, 02:31:50 PMHere is some special tools who analysis your data and on chain transection to evaluate your rank.Go and check . https://blocksbyte.com/layerzero-airdrop-rank/If you are completing transactions on the layer zero platforms; i will advise and encourage you to please flee from all websites etc that are preaching ranks and tracker; one thing you do not want to happen is exposing your potential gem wallet to spammers. Stop visiting bait websites becauser you want to measure your layer zero activities.What to do? Focus on completing different tasks on the layer zero network, daily, weekly or monthly; increase your volume every time you can and keep it simple while waiting for layer zero announcement. Keep yourself safe!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 16, 2023, 09:28:05 PM",
      "body": "Quote from: ampere on September 16, 2023, 09:01:58 PMIf you are completing transactions on the layer zero platforms; i will advise and encourage you to please flee from all websites etc that are preaching ranks and tracker; one thing you do not want to happen is exposing your potential gem wallet to spammers. Stop visiting bait websites becauser you want to measure your layer zero activities.What to do? Focus on completing different tasks on the layer zero network, daily, weekly or monthly; increase your volume every time you can and keep it simple while waiting for layer zero announcement. Keep yourself safe!!!I qualified for Arbirtrum without any fancy tools to tell me if I'm on track or not. I feel like if one just naturally uses a protocol and tries it out in their spare time, it would be enough to get them to qualify. At the end of the day, the criteria will most likely differ from already existing criteria these fancy site use from Arbirtrum/OP/etc.Also, if the tool doesn't allow for connecting wallet, I'm not sure it should be much of a problem? Unless they save the wallet address inputted by users and try to phish them with it.  Seems far-fetched to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 16, 2023, 11:19:08 PM",
      "body": "Quote from: nelson4lov on September 16, 2023, 09:28:05 PMI qualified for Arbirtrum without any fancy tools to tell me if I'm on track or not. I feel like if one just naturally uses a protocol and tries it out in their spare time, it would be enough to get them to qualify. ..This is indeed the case, if you use the blockchain in a natural way, then you will undoubtedly get airdrop. That's just its size will differ significantly from those who specifically performed additional transactions and interacted with various contracts. In the airdrop you mentioned from Arbitrum, its size ranged from $800 to 10 thousand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "September 17, 2023, 12:04:04 AM",
      "body": "if the qualification didn't come out from the team themselves i'd definitely doubt it.there has been many rumours going around and what matters most is when the team of the project itself making an announcement because by then it will be official about the qualification and not some random guess.I mean, like what happened in SUI everyone was literally guessing the qualification would be NFT minting, interacting with dapps and many more but when the team make official announcements in regard of eligibility for the whitelisting, it shocked entire community because it only requires to join discord before certain time so I don't trust these qualifications coming from 3rd party so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "September 17, 2023, 01:07:36 AM",
      "body": "It's just for reference because in reality, if people are active regularly and don't have sybils, it's the basis for you to be in a position to receive rewards. Some tools appear to test the same perhaps just to increase the drama of those who are expecting an airdrop from the project soon. I also think that the market will have a big project that will be airdropped to the community and it is likely that L0 will be a name that gets attention as it has been mentioned many times in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "September 17, 2023, 09:03:18 AM",
      "body": "Quote from: nelson4lov on September 16, 2023, 09:28:05 PMUnless they save the wallet address inputted by users and try to phish them with it.  Seems far-fetched to me. Well, that's the problem. Most websites like that have a risk of phishing. I also don't really believe the data that has been attached. Honestly, I don't even know what the function of the website you have linked is even though I have read it several times. Can anyone explain what (not how the site works) the function of what is offered on the site is for?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "September 17, 2023, 09:22:08 AM",
      "body": "Quote from: Godday on September 17, 2023, 09:03:18 AMWell, that's the problem. Most websites like that have a risk of phishing. I also don't really believe the data that has been attached. Honestly, I don't even know what the function of the website you have linked is even though I have read it several times. Can anyone explain what (not how the site works) the function of what is offered on the site is for?The website in the OP is not phishing as you can't even connect your wallet. It provides a summary of an address activity on LayerZero, detailing metrics such as volume bridged, transaction count, number of chains and contracts interacted with, etc.I wouldn't take the rank seriously as there are no criteria for the airdrop yet, but the activity summary is quite informative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 17, 2023, 10:21:02 AM",
      "body": "Quote from: Godday on September 17, 2023, 09:03:18 AMWell, that's the problem. Most websites like that have a risk of phishing. I also don't really believe the data that has been attached. Honestly, I don't even know what the function of the website you have linked is even though I have read it several times. Can anyone explain what (not how the site works) the function of what is offered on the site is for?They just showing you the potential of your airdrop wallet based on your activity. They used parameters to quantify potential ranks. You just inputting your wallet address. I believe no super tech could hack you right sway without having the seed phrase for that matter. That kind of site are common on airdrop socials where developers are witty enough to create checkers like these. No need to panic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cadaver20",
      "created_time": "September 17, 2023, 01:48:33 PM",
      "body": "Quote from: Avantika jaiswal on September 16, 2023, 02:31:50 PMHere is some special tools who analysis your data and on chain transection to evaluate your rank.Go and check . https://blocksbyte.com/layerzero-airdrop-rank/I am totally new to this. What will happen knowing my rank in layer zero? How much is this site trusted? Is it right to expose our wallet here? Every day we hear about some kind of hack. So we must be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoababe",
      "created_time": "September 18, 2023, 12:52:10 AM",
      "body": "Quote from: Cadaver20 on September 17, 2023, 01:48:33 PMQuote from: Avantika jaiswal on September 16, 2023, 02:31:50 PMHere is some special tools who analysis your data and on chain transection to evaluate your rank.Go and check . https://blocksbyte.com/layerzero-airdrop-rank/I am totally new to this. What will happen knowing my rank in layer zero? How much is this site trusted? Is it right to expose our wallet here? Every day we hear about some kind of hack. So we must be careful.Its just to scan your wallet to know the number of transactions you've made on the layer zero blockchain. This is mostly for thier Future token airdrop eligibility sake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 18, 2023, 04:01:41 AM",
      "body": "All these sites do is check how many transactions, how large these transaction were, how many, how many bridges, how many different smart contracts you used and how often you made these transactions. You can basically check this yourself.Every airdrop is different and we won’t know what the criteria will be. One new method to eliminate Sybil is to check if the address was used on the Ethereum network. If it wasn’t used at all then it has a high chance of being labeled an airdrop farmer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "September 18, 2023, 05:58:48 AM",
      "body": "There has not even been an indication that there will be a Layer Zero airdrop. On the contrary to be honest, they have stated several times that there would not be any.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Teraboy",
      "created_time": "October 01, 2023, 09:44:54 PM",
      "body": "Quote from: edmundduke on September 18, 2023, 05:58:48 AMThere has not even been an indication that there will be a Layer Zero airdrop. On the contrary to be honest, they have stated several times that there would not be any.well thats the thing with retroactive airdrop in general, devs can deny that there will be an airdrop, but people will just complete task regardless of that.because simply put, people know that layerzero already have their token ready, so maybe they will have an airdrop, despite denying that there will be any airdrop at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 02, 2023, 01:42:26 AM",
      "body": "Quote from: edmundduke on September 18, 2023, 05:58:48 AMThere has not even been an indication that there will be a Layer Zero airdrop. On the contrary to be honest, they have stated several times that there would not be any.Exactly! These people who are hoping about Layer Zero airdrops are more likely doing some gambling, gambling their time, efforts, and money (used for gas).Well, it's part of all the consequences or challenges if you are an airdrop hunter.We still don't know if Layer Zero will be able to give airdrop to people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}