{
  "id": "topic_5443736",
  "title": "coinremitter",
  "author": "coinremitter",
  "created_time": "March 06, 2023, 11:05:46 AM",
  "content": "While reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\". The greatest opportunity for the people of Africa to discover more about crypto and new web3 technology. Moreover, there is a chance that people would also start paying and accepting crypto.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443736",
  "comments": [
    {
      "author": "_BlackStar",
      "created_time": "March 06, 2023, 11:27:15 AM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMMoreover, there is a chance that people would also start paying and accepting crypto.It's not sure how many African countries will adopt bitcoin as means of payment in the future, but several people have announced that they are starting to accept bitcoin as payment for their businesses. After El Salvador, I think some African countries will announce bitcoin adoption, but maybe it's only matter of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "March 06, 2023, 12:11:15 PM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMWhile reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\". The greatest opportunity for the people of Africa to discover more about crypto and new web3 technology. Moreover, there is a chance that people would also start paying and accepting crypto.If you also have links to the article you read, also try and include it in your thread; you never know, someone else may be curious enough to read it as well. Some people don't just reply on incomplete information, but trying to get the headline is sometimes difficult. I'm not sure what the headline you read is, but the recent article I saw about this is here.According to records at Chainalysis, Kenya, Nigeria, South Africa, and Tanzania had among the highest rates of cryptocurrency adoption worldwide in 2022. No record yet exists for 2023, which probably should be released in the middle of the year or at the end of the year, but talking about the Web3 technology, its use cases in Africa are growing and will continue to grow, and there are a few factors that are making its usability grow in Africa, for example, remittance payments.Quote from: https://www.google.com/amp/s/businessday.ng/amp/opinion/article/the-driving-forces-behind-crypto-adoption-in-africa-in-2022/In Africa, remittances make up 1.3 percent of GDP and are expected to grow at an annual rate of 5.2 percent through 2025. The World Bank has estimated that there are about 400 million migrant workers in Africa, with about 50 percent of these migrants living outside their home country.African households receive $100 billion in remittances each year – more than they spend on education and healthcare combined!However, it is well known that several African nations now set a cap on the amount that can be transferred as well as charge steep rates. As a result, the number of remittance payments made using cryptocurrencies has been consistently increasing because of lower restrictions and fees, hence causing an upward scale in the crypto adoption rate as shown by Analysis.Quote from: https://www.google.com/amp/s/businessday.ng/amp/opinion/article/the-driving-forces-behind-crypto-adoption-in-africa-in-2022/A recent study also shows that African cross-region transfers make up a more significant share of its cryptocurrency market than any other region globally, with Sub-Saharan Africa receiving over $ 48 billion of estimated remittances in 2019.I am speculating that this year will yield more significant growth in crypto and Web3 User case than last year or 2019.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "March 06, 2023, 12:17:30 PM",
      "body": "Quote from: _BlackStar on March 06, 2023, 11:27:15 AMAfter El Salvador, I think some African countries will announce bitcoin adoption, but maybe it's only matter of time.After El Salvador, Central African Republic, a small country with almost 5 million citizens, has accepted Bitcoin as a legal tender. But without being accepted as a legal tender, it is fast growing and being accepted as a means of payment.This is not limited to Africa, Bitcoin adoption globally is growing at a very fast rate.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "March 06, 2023, 12:30:11 PM",
      "body": "This is quite true. A survey carried out by Luno sometime in 2020 showed that Nigeria, S/Africa and others had grown in the adoption of cryptocurrency. To me, these countries are gaining great exposure about web3 through the internet and Bitcoin seems to be an alternative for trading, storage of value etc for some of their unstable currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justtoons",
      "created_time": "March 06, 2023, 12:37:35 PM",
      "body": "Cryptocurrencies are acceptable for business transactions in many  Africa countries. Hence, if cryptocurrency is approved as a form of payment, it may really contribute to and speed up Africa's development while also endangering national finances. I believe that the governments of African nations should give cryptocurrency a chance to succeed or fail.As time goes on, they'll start to realize how important it is to use cryptocurrency for financial transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jayce",
      "created_time": "March 06, 2023, 12:45:52 PM",
      "body": "Yeah obviously crypto is growing in Africa, and thanks to one of our friends Merit.s who also makes a big contribution by introducing bitcoin in school of his city. You can read it here Teaching teenagers about bitcoin.I'm not sure how the economic situation in Africa, but there are numerous blockchain startups in the continent[1], means that crypto and blockchain ain't new thing there. [1] https://startuplist.africa/industry/blockchain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 06, 2023, 12:51:13 PM",
      "body": "Growth in terms of what? At least link in some sources?Not looking good as of Google Trends though. (5 year chart)https://trends.google.com/trends/explore?date=today%205-y&geo=ZA&q=crypto,bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 06, 2023, 01:13:28 PM",
      "body": "I know Africa is massively engaging in crypto, but I never knew the percentage had grown up to this certain amount. If the analysis is correct, then we are improving even as most of the African countries' governments will find it hard to get the public to approve it. Quote from: mk4 on March 06, 2023, 12:51:13 PMGrowth in terms of what? At least link in some sources? I believe this is where the information was gotten from.  Africa Business",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "March 06, 2023, 01:35:44 PM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMWhile reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\". One thing I know for sure is that these articles are generalized,you will find that they are talking about a few countries such as Nigeria, South Africa,Kenya which should be among the most tech savvy but they will consider these few countries as Africa which shouldn't be the case. But either way, the Blockchain truely knows no barriers a reason it's so successful and with the continued interest in these technologies price is guaranteed to go to the moon. Quote from: coinremitter on March 06, 2023, 11:05:46 AM Moreover, there is a chance that people would also start paying and accepting crypto.This is what all countries need,not just Africa...and reading about several technological advancements happening like 5G, starlink etc this means easy access to the internet which also means cryptocurrencies come closer too...guess everything is falling in place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 06, 2023, 04:24:20 PM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMWhile reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\". The greatest opportunity for the people of Africa to discover more about crypto and new web3 technology. AFAIK, it's been two years since the growth started to get reported there and that continent made headlines for how fast the growth of adoption there. Quote from: coinremitter on March 06, 2023, 11:05:46 AMMoreover, there is a chance that people would also start paying and accepting crypto.It's already been adopted there. If you just lurk on this section, you'll see a lot of stories on how they've accepted bitcoin as payment from their businesses and services offered. Also, many of them started to educate their friends and neighbors by conducting a sharing seminar that they are organizing. It's not just a chance but it's an actuality that has already happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "March 06, 2023, 04:34:26 PM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMWhile reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\". The greatest opportunity for the people of Africa to discover more about crypto and new web3 technology. Moreover, there is a chance that people would also start paying and accepting crypto.Maybe the article you read in somewhat outdated? and that numbers was around the bull run in 2021,Quoten a report released on Tuesday, Chainalysis said Africa’s crypto market increased in value by more than 1,200% between July 2020 and June 2021, with high adoption in Kenya, South Africa, Nigeria and Tanzania. The company added that the popularity of P2P platforms could have been one of the driving factors toward greater crypto adoption in the region, given some countries have restricted or banned residents from sending money to exchanges through local banks.According to Chainalysis, the entire continent received $105.6 billion worth of crypto between July 2020 and June 2021. Yet, it had a share of the market’s overall transaction volume made up of “retail-sized transfers” larger than any other region in the world — roughly 7% as opposed to the 5.5% global average. In addition, P2P platforms — including Paxful and LocalBitcoins — account for 1.2% of all crypto transactions in Africa. https://cointelegraph.com/news/africa-s-crypto-market-has-grown-by-more-than-1-200-since-2020-chainalysisSo it make sense that time that it will grow tremendously because of the bull run, so it might be interesting what will be the numbers today. But I wouldn't be surprised if the numbers keeps growing, and maybe it could also be use by the continue as remittance as Nigeria ranks in the top 10 amongst global money remittances.Even Binance P2P Supports New Payment Methods for African Countries. So for sure, it's really untapped sector right now and it's value will increased overtime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EdenHazard",
      "created_time": "March 06, 2023, 04:46:26 PM",
      "body": "They are all against the american centralized monetary system and found a glitch then make crypto as a safe haven to defend themselves from the western evil weakening their national currency , they know and feel already the benefit ... no wonder they are into crypto in the recent year pretty fast growth.We will see a chaotic africa or a winning one in africa depends on how they maintain these growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "March 06, 2023, 04:56:41 PM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMWhile reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\". The greatest opportunity for the people of Africa to discover more about crypto and new web3 technology. Moreover, there is a chance that people would also start paying and accepting crypto.The news comes as no surprise to me given how quickly cryptocurrency adoption and awareness have spread in Africa. Namibia, an African country, now accepts bitcoin as payment. Despite not being one of the top African countries with a lot of influence, the country made a bold move. Whatever the case may be, bitcoin awareness and adoption in Africa has exceeded expectations, this has helped many unemployed youths exit poverty and find a source of livelihood.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "March 06, 2023, 05:09:33 PM",
      "body": "African's interest on the block chain technology didn't occur as a surprise, since the institution of the internet African countries like Nigeria, Kenya etc have been active participants of the internet, so adopting any form of internet money like crypto, PayPal, payoneer etc to enhance their online businesses is a norm. Though, the fiat currencies used in Africa are low and may not make huge impact on the cryptocurrency market. Only a few Africans can invest up to 20k - 30k dollars into bitcoin. Hence, they create crypto startups that generates lots of dollars, but I wonder why it rarely converts to an increase in the price of cryptocurrency. I think the growth is in quantity and not quality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "March 06, 2023, 05:37:21 PM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMWhile reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\". The greatest opportunity for the people of Africa to discover more about crypto and new web3 technology. Moreover, there is a chance that people would also start paying and accepting crypto.Crypto adoption is not only increasing in Africa but worldwide because people have begin to understand the important of decentralization and its benefits. As for Africa,I see it as something that have come to stay in the continent and people are embracing its adoption because it is safe to invest in,due to the depreciation in Fiat currency and inflation on the economy.OP, next time you should put the link of the information so that we don't start talking based on the look of things from our own side. Nigeria for example have so many crypto users who don't just use but also enlighten their friends and people around them about bitcoin, for easy adoption. Nigeria are always ready to key into a new technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "March 06, 2023, 07:15:41 PM",
      "body": "Quote from: coinremitter on March 06, 2023, 11:05:46 AMWhile reading some articles, Just found the headline \"Crypto market has grown in Africa by 1200%\".These kinds of headlines are expected, what do you expect of bitcoin? Bitcoin has shown massive growth in Africa just as you it is growing it other continents of the world. It is good news that bitcoin is recording growth, these kind of information is encouraging to newbies especially the new ones looking for hope that they have not made the wrong choice in bitcoins. If these kind of information is shared more often to new people in bitcoins they will be encouraged to stay and stick with bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "March 06, 2023, 07:30:49 PM",
      "body": "according to web and news article , africa’s crypto market has grown by more than 1,200% since 2020 , reaching a total value of over $100 billion,here some of the challenges and risks of using crypto in Africa are:volatility:  the price of crypto can fluctuate significantly over time, making it hard to predict and manage the value of one’s assets,scams: crypto crime is a serious threat, as scammers can use various methods to trick or fierce people into giving up their crypto or personal information,cyber threats: crypto users need to protect their devices and wallets from hackers, malware, and phishing attacks that can compromise their security and privacy,.lack of regulation: crypto regulation is still evolving and varies across different countries in Africa, creating uncertainty and inconsistency for crypto businesses and users,lack of reliable internet and financial literacy: crypto adoption requires access to stable and affordable internet connectivity, as well as basic knowledge and skills on how to use and store crypto safely and responsibly,i pray for africans, for better life most of them are going through very bad times and health issues",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bestdss",
      "created_time": "March 06, 2023, 07:56:30 PM",
      "body": "Proudly African! Cryptocurrency grew over Africa with the speed of light, the adoption among the youths was very fast especially in Nigeria. Almost all 90% of Nigerian youths in one way or the other has a clue to cryptocurrency to the extent that it began to threaten the banks of loosing customers and money and the central bank in conjunction with the government moved to stop crypto in the county but unfortunately, cryptocurrency moved above their powers and what they can stop till today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 06, 2023, 08:01:54 PM",
      "body": "I'm sorry for the bad time you are having in Africa but I would not use the word Cryptocurrency but rather Bitcoin.  This alone can free up your finance and if managed safely and accurately you will not be taking much risk in maintaining it.  As you say you also need a proper school education, the forum could be a good source of resources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}