{
  "id": "topic_5459452",
  "title": "Heyui67",
  "author": "Heyui67",
  "created_time": "July 11, 2023, 06:10:39 PM",
  "content": "Actually I made deposit with 250$..They gave me 100$ bonus no depositThey locked 350$ untill I wager 4k on slotsI made wager 1k.. I was down to 80 $Then got back to 350$I want to withdraw before I ilose everything but they refuseIf I don't wager will i lose deposit amount??This is scam I didn't request that bonus",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459452",
  "comments": [
    {
      "author": "Cointxz",
      "created_time": "July 11, 2023, 06:18:46 PM",
      "body": "Bitstarz has bad reputation here in the forum. You can refer to their trust page for the negative feedback history against their previous scam accusation to forum members. Bitstarz Trust Page: https://bitcointalk.org/index.php?action=trust;u=307265Quote from: Heyui67 on July 11, 2023, 06:10:39 PMI want to withdraw before I ilose everything but they refuseIf I don't wager will i lose deposit amount??This is scam I didn't request that bonus Is there no option to forfeit the bonus on their bonus page? Their bonus ToS is indeed scammy if they doesn't allowed to withdraw while you already wager x4 of your deposit. Also bonus should be automatically forfeited once the bonus amount is already loses. Use trusted casino next time.Typically, I ask for proof but since the casino reputation involved is negative reputation here, Asking for proof doesn’t make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "July 11, 2023, 07:21:01 PM",
      "body": "Quote from: Heyui67 on July 11, 2023, 06:10:39 PMI want to withdraw before I ilose everything but they refuseIf I don't wager will i lose deposit amount??You won't be able to withdraw without completing the wager if they are refusing it. Here is the terms of BitStarz no deposit bonus:Quote from: https://www.bitstarz.com/bonus-terms-and-conditionsIn addition, no winnings accrued in connection with any Free Bonus may be withdrawn/transferred until the wagering requirements have been met.)And here is the terms of the deposit bonus:Quote from: https://www.bitstarz.com/termsBefore fulfilling the bonus turnover conditions if you transfer or withdraw the main deposit amount, bonus funds and all winnings from this bonus will be forfeited.For the no deposit bonus, you aren't allowed to withdraw without completing the wagering requirement (you have taken this bonus). And for the deposit bonus, you are allowed to withdraw your deposited funds. But they will forfeit your winnings. You should ask their support whether they will allow you to withdraw the deposited funds only or not (for the no deposit bonus).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGrizzly",
      "created_time": "July 11, 2023, 10:17:20 PM",
      "body": "Sorry to hear that Bitstarz.com is not allowing you to take your money out.Scam Report FormatCode:[b][color=black]What happened:: [/color][/b][b][color=black]Scammers Profile Link: [/color][/b][b][color=black]Reference Link: [/color][/b][b][color=black]Amount Scammed: [/color][/b][b][color=black]Payment Method: [/color][/b][b][color=black]Proof of Payment: [/color][/b][b][color=black]PM/Chat Logs: [/color][/b][b][color=black]Additional Notes: [/color][/b]Copy and paste it in new thread then fill all data.Scam report example:What happened::  I saw escrow.ms's lolipop thread 4 days ago and placed a order for 1000 lolipops. After I sent him payment, he just went offline and never came back. I think he's a big liar and a scam artist. Stay away from him.Scammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=76380Reference Link: https://bitcointalk.org/index.php?topic=260070.0Amount Scammed:  2 BTC/$176.40Payment Method: BitcoinsProof of Payment: http://blockchain.info/tx/b80f35cebae98fcbd8eb0e2eaea6def41f90ad01086ad830ba23094ac3c3b165PM/Chat Logs:  https://i.imgur.com/8UbLVSc.pngAdditional Notes:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 11, 2023, 10:55:05 PM",
      "body": "Quote from: Heyui67 on July 11, 2023, 06:10:39 PMActually I made deposit with 250$..They gave me 100$ bonus no depositPretty much a standard practice of a scam casino. I thought that the no deposit bonus should be completely separate from the deposit you made and wagering requirement for the two should be different.I also slightly blame you for not reading the terms of service and also the reviews about the casino. They have a very bad reputation in this forum alone, that should have given you more than enough information not proceed and use the casino.What made you sign up for Bitstarz among all the casinos around?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "July 12, 2023, 11:31:04 PM",
      "body": "Quote from: logfiles on July 11, 2023, 10:55:05 PMWhat made you sign up for Bitstarz among all the casinos around?In my opinion, due to not taking the time to do the necessary research and being drawn into YouTube channels that promote BitStarz as a paid promotion, blogs as well, and even what I saw is that the BitStarz team is doing shill reviews on Trustpilot. Their scam casino platform has a rating of 4.5 out of 5. They write these fake and positive reviews to trap and mislead players and to make their reputation look as pure as water.First and foremost, the OP shouldn't have relied on a single source in making the decision to deposit money and play at any casino he came across or heard about; there are a lot of scam casinos out there that look legit. I hope he contacts their support and also writes his case on Trustpilot and attaches the link of this thread so he might find from them a solution to withdraw his deposit if they find that the OP poses a danger to the false reputation that they are building and understands from them how things will go.[1] https://www.trustpilot.com/review/bitstarz.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}