{
  "id": "topic_5468597",
  "title": "BitGoba",
  "author": "BitGoba",
  "created_time": "September 29, 2023, 09:55:14 PM",
  "content": "As a bitcoin enthusiast I started this directoryhttps://spend-sats.comIf you know stores and services that accept sats, feel free to add them to the directory",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468597",
  "comments": [
    {
      "author": "decodx",
      "created_time": "September 29, 2023, 09:59:44 PM",
      "body": "Quote from: BitGoba on September 29, 2023, 09:55:14 PM<...>When did you start that directory?  I noticed there are only 17 online stores listed at the moment. It might be a good idea to think about adding more stores to make it more helpful for users. You can expand your information sources by checking out sites like BitPay's directory or CoinGate's list. And, of course, don't forget the power of a good old Google search. Don't be lazy. Do your own research!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 29, 2023, 11:22:21 PM",
      "body": "There are already so many hosting services that accept bitcoin payment not just Namecheap, like Hostsailor and Hostinger. Well, much more in gambling industry. In email, its Tutanota and ProtonAlso, the slider of categories is annoying in mobile mode, it keep sliding when i manually slide it especially when sliding back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 30, 2023, 03:11:19 AM",
      "body": "design is good and the existing list is small that may need some updating, but why do I need to pay to vote for the service? Voting for the service is not useful to me, even if it is a Satoshi, someone can do it, and it may be misused.a scam company may request that its name be added. It pays 10k satoshi to appear as if it is a reliable company. The opposite may happen, which is to vote negatively for a competing service",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 30, 2023, 06:52:49 AM",
      "body": "There are many sites with huge collections of stores and services that accept Bitcoin all over the place. I was looking for something similar a few months ago when I had to visit a foreign country for a bit and bookmarked the following websites. I am sure there are plenty of stores there you can take a look at.https://cryptowallet.com/academy/who-accepts-bitcoin-payments/https://spendbitcoins.com/https://usebitcoins.info/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "September 30, 2023, 11:51:27 AM",
      "body": "Quote from: PX-Z on September 29, 2023, 11:22:21 PMThere are already so many hosting services that accept bitcoin payment not just Namecheap, like Hostsailor and Hostinger. Well, much more in gambling industry. In email, its Tutanota and ProtonAlso, the slider of categories is annoying in mobile mode, it keep sliding when i manually slide it especially when sliding back.Tutanota and Proton unfortunately no longer accept bitcoinI added Hostsailor and Hostinger",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 30, 2023, 02:35:50 PM",
      "body": "I would add this list of gift card providers, made by OmegaStarScreamhttps://bitcointalk.org/index.php?topic=5208530.0I really like to spend on gift cards, as they are easily to trade or convert in goods. Ans there is also some good privacy in buying it.Quote from: BitGoba on September 30, 2023, 11:51:27 AMTutanota and Proton unfortunately no longer accept bitcoinI added Hostsailor and HostingerI can confirm proton.me still accepts bitcoin as payment method You just need to choose a fiat currency, then choose bitcoin as payment method I just did that on my app.https://proton.me/support/pay-with-bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 30, 2023, 03:50:02 PM",
      "body": "Quote from: BitGoba link=topic=5468597.msg62924015#msg62924015Tutanota and Proton unfortunately no longer accept bitcoinProton still accepts bitcoin based on their support article[1] and with the above reply. Ah yes, Tutanota doesn't accept bitcoin anymore, i dont know when they decided to stop accepting though.[1] https://proton.me/support/payment-options",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "October 02, 2023, 11:29:57 PM",
      "body": "Quote from: Ratimov on September 30, 2023, 06:55:58 AMI have put together a good collection of services where you can spend your satoshi: {LIST}Where to spend Bitcoin?Very wonderful initiative. The solution this gives, in some cases, it might just be transformed into a project. Making people and other projects accept bitcoin has been a global responsibility and I believe this is a step in the right direction towards that, and more people seeing this will also be motivated towards having to join the list as this is also a form of publicity for the projects in the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 03, 2023, 01:47:55 AM",
      "body": "It is not difficult to create a list, as the data available in this forum that can be collected from members is large, but in how to keep the list up to date. You need to test it continuously at least once a month and delete or add any modification that occurs to the service, which means more work, especially if the list is huge. If you continue to keep it up to date and comprehensive, the site will succeed, but it requires a lot of activity.if you searching in this forum and Google will give you huge lists, which you will test and update.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "October 08, 2023, 07:29:16 PM",
      "body": "The website is clear and minimalist, allowing to find the information quickly, I like that. I discovered several services that I didn't known they were accepting Bitcoin payments, it's a good thing because I am always happy to use my Bitcoin for buying something in real life which is for what Bitcoin has been designed at first. Unfortunately your gambling section is very poor and you don't list casinos with the best reputation(like 1xbet) I think you could look at the Gambling section of the forum to find some good ones to add. The one I'm promoting in my signature(Livecasino) could deserve it for example IMO. Anyway thank you for sharing it here, that's a nice service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "October 08, 2023, 11:40:09 PM",
      "body": "Perhaps you can add more yourself? since the list is new, I would say it's actually good to fill it up with a good amount of entries first in order to attract userbase.I saw you have categories for VPNs and Mixers so here:2023 List Bitcoin Mixers Bitcoin Tumblers Websites List of VPN Service Providers - 2023In addition, kycnot.me also has a services section, see: https://kycnot.me/?type=service",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}