{
  "id": "topic_5471105",
  "title": "halloweenn666",
  "author": "halloweenn666",
  "created_time": "October 21, 2023, 03:16:40 AM",
  "content": "Varsayımım  ; 19- 20.yy da başlayan sanayi devrimi ağır çalışma koşullarını beraberinde getirdiGunluk kalori ihtiyacı 4000 hatta 5000 leri buldu, bu açığı kapatmak için kola fast food toz şeker gibi gıdalar çıktı ve beyaz ekmek hayatımızda daha yer tutmaya başladı bu da yemeklerde daha fazla kalori almamızı sağladı. Ayrıca günde 3 öğün beslenme hayatımıza girdi. Böylece insanlar ağır çalışma koşulları altında aç kalmıyor enerji kaybını bu yoğun kalori alımları ile destekliyorduAncak işler 21.yy doğru yaklaşırken 1970 lerden sonra değişmeye başladı ağır çalışma koşulları yerini robotlara bıraktı günlük kalori ihtiyacı 3000-2500 seviyesine doğru düşmeye başladı ama beslenme alışkanlıkları ise değişmedi 18.yy dan itibaren hayatımıza giren şekerli gıdalar fast food protein bakımından az olmasına rağmen  yoğun kalori içeren icecek ve yiyecekler bize bağımlılık yapmıştı, böylelikle insanlarda 1970 lerden sonra obezite sorunları oluşmaya başladı,21. Yy hemen baslarında ise obezite dünya sorunuydu. İnsanlar 2000 li yıllarda artan kilolar sağlık sorunlarına ciddi masraflar ödemeye başladı, spor salonları moda oldu.Çözüm nedir : 19. 20. Yy başlayan şekerli icecek furyası yerini şekersiz kalorisi az içeceklere bırakmalı Ekmek tüketimi yerine sebze et tüketimi desteklenmeli Fast food yerine lokantalar yaygınlaşmalıGünde 3 öğün yerine iki öğüne dönüş yapılmalı Toz şeker ve glikoz içeren paketli ürünlerin üzerine obez yapar ibaresi vurulmalı, şeker ilavesiz paketli ürünler tercih edilmeli.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471105",
  "comments": [
    {
      "author": "RaltcoinsB",
      "created_time": "October 21, 2023, 05:53:43 AM",
      "body": "Son zamanlarda gördüğüm en faydalı başlıklardan birisi bu eskiden kahvaltı diye bir kavram yok diye bir kaç post gördüm ama doğru veya yanlış bilmiyorum araştırmadım eskiden iki öğün yenildiğini duymuştum çoğu zaman üç öğünün insanın gereğinden fazlasını almasına sebep oluyor diye diyetisyenlerden duyduğum olmuştu doğru yanlış bilmiyorum ama fast food şu anda dünyanın en büyük ticaretlerinin döndüğü ortamlardan birisi kişiye önce sağlığını kaybettirip sonra onu tekrar kazanması için tüm servetini harcatan bir şey oldu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 21, 2023, 06:49:01 AM",
      "body": "çünkü fast food ucuz. içinde ne olduğu bilinmeyen malzemelerden yapılan, lezzetli ve doyurucu gıdalar ile insanlar günleri geçirebiliyor. bunun yanına bir de çocukluktan itibaren hiç spor yapmama eklenince 10 yaşındaki çocuklar 70-80 kilo oluyor. kendi ülkemize bakalım:(artık fast food bile çok pahalı ülkemizde)- et ürünlerine ulaşmak maddi anlamda çok zor.- çalışan kısım bırak spor yapmasını nefes bile alamıyor. (günde 2-3 saati yolda geçiyor.)- karnını doyurması lazım,- geleneksel yemeklerimizde kullanılan yağların kalitesi- memlekette sebze bile artık pahalıdiye listemiz uzar da gider. bu sağlık sorununu yenmemiz için devletin de işin içine girip ciddi bir aydınlanma yapması gerekiyor. obezite ile ilgili ileride doğacak sağlık sorunları sisteme yük olacak. diyabet, kalp vs bir sürü hastalığı tetikliyor ama daha önemli işlerimiz var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "October 21, 2023, 07:11:54 AM",
      "body": "Fast Food’un içinde geçenlerde burada da açılan katkı maddeleri de çok olduğu için bağımlılık benzeri etkileri de oluyor.Yapay tatlandırıcılar ile istenilen tat kolaylıkla elde edilirken, baskın bir koku ile size yedirilen ürünleri sanki lezzetli gibi bir algı ile yediriyorlar.Dünyada genel obezite problemi var bu Türkiye’ye özel bir durum değil.Türkiye’de fast food bile pahalandığını için insanlar artık evden yemek götürüyor işine.Bu anlamda da fast fooda ulaşımın zorluğunun pozitif yönlerini de belki görmek gerek.En azından insanlar fast food yiyemiyor cümlesi ekonominin kötü zeminin taşırken, sağlık yönünden pozitif bir şeyi ifade ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 21, 2023, 08:13:29 AM",
      "body": "şeker var bende ilaç kullanıyorum, ilacı almasam şeker fırlıyor, ilacı alırsam da kilo...mecburen ilaç alıp dikkatli beslenmeye başladım arada yürüyüş de yapacam, pantolonlar dar gelmeye başladı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jakdanyel",
      "created_time": "October 21, 2023, 09:36:58 AM",
      "body": "Obezitenin dünya genelinde iki sebebi var biri varlık biri yokluk.Birbirinin tam zıttı olan bu iki kavramın insan vücudu üzerinde bazen aynı sonuca yol açabilmesi gerçekten çok ilginç.Varlık kısmına hiç girmeyeceğim yokluk kısmı zaten konu içerisinde biraz anlatılmış olsa da halkımız bu konuda çok bilgisiz.Örneğin sokak röportajlarında ekonomiden yakınan göbekli bir abimize yiyeceğin kadar yemişsin hala isyan ediyorsun diyen çok sayıda dayı gördük.İşin aslı öyle değil proteine ve sağlıklı besin kaynaklarına ulaşamayan kişiler genellikle ucuz şeker ağırlıklı besinlere yöneliyor bu da insan vücudu üzerinde yağlanmaya yol açabiliyor bu konumdaki insanlara önerebileceğim maalesef çok bir şey yok.Varlıktan bu hale gelen insanların ise bu durumdan kurtulmak için çabalaması gerekiyor çünkü obezite masum gibi gözükse de birçok hastalığın tetikleyicisi konumuda yani  sadece fiziksel görünüşü etkileyen bir olay değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "October 21, 2023, 12:20:52 PM",
      "body": "Quote from: halloweenn666 on October 21, 2023, 03:16:40 AMÇözüm nedir : 19. 20. Yy başlayan şekerli icecek furyası yerini şekersiz kalorisi az içeceklere bırakmalı Ekmek tüketimi yerine sebze et tüketimi desteklenmeli Fast food yerine lokantalar yaygınlaşmalıGünde 3 öğün yerine iki öğüne dönüş yapılmalı Toz şeker ve glikoz içeren paketli ürünlerin üzerine obez yapar ibaresi vurulmalı, şeker ilavesiz paketli ürünler tercih edilmeli.Güzel bir konu olmuş, şu anda aslında teknoloji ve teorik bilgi olarak insanlık her zamankinden daha donanımlı durumda, obezitenin çoğu sebebi biliniyor ve sağlıklı yaşamın birçok kuralı da net olarak biliniyor, fakat diğer arkadaşların da çok doğru ifade ettiği gibi 1) Ekonomik sebeplerden2) Cehaletten (ki tüketici kesimin cahil kalması büyük şirketlerin tercih ettiği bir durum) obezite gibi epidemiklerin önüne geçilemiyor...Genel olarak en az işlem görmüş ve üzerine en az müdahale edilen yiyeceklerden oluşan bir diet ana kural olmalıdır, fabrikada üretilen gıdaların çoğunu elemeliyiz yani. Atalarımızın da yediği formlarda olan gıdalar, 100% et (serbest dolaşan, bu da ayrı bir konu), meyve, sebze, süt ürünleri (saf sütte keçi daha uygun) vb doğal ürünler insan vücudunun alıştığı ve işleyebileceği gıdalar. İşlenmiş şeker, beyaz un, katkı maddeleri, koruyucular işin içine girince bu laboratuar mahsulü maddelerle yeni tanışmış insan vücudu şaşırıyor ve olumsuz tepkiler veriyor... İşlenmiş gıdalar bugün \"yasaklı\" kabul edilen birçok maddeden daha zararlı aslında...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spack17",
      "created_time": "October 21, 2023, 12:30:53 PM",
      "body": "Günlük öğün sayısının düşürülmesi önerisine ben de katılıyorum son zamanlarda intermittent fasting denen olay çok yaygın ve popüler.Popüler şeylere başta mesafeli de yaklaşsam bu olay gerçekten öyle değil.intermittent fasting uyguladığımdan beri kilom normale döndü ve kendimi daha zinde hissetmeye başladım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 21, 2023, 06:20:00 PM",
      "body": "hikaye sanayi devriminden başlıyor, yani doğru bir yerden başlıyor ama tek kriter sağlık olursa avcı toplayıcı döneme doğru yol alırız buradan...ben bu tür ince hesap-kitap işlerine akıl sır erdiremedim, bu dünyayı da öyle veya böyle yaşadım diyorum; tıka basa yiyip üç-beş sene daha az yaşamayı, sağlıklı beslenme adı altında kendimi zorlamaya tercih ettim. yani, aslında tatlı hariç şeker kullanmıyorum ve az ekmek tüketiyorum ama cips-mips, katkı maddeli bilmem ne veya boyalı süt tozu dondurma falan gibi tadını lezzetli bulduğum şeyleri yakaladığımda acımadan yiyorum. :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 21, 2023, 07:16:47 PM",
      "body": "Günümüz obezitesini sanayi devrimine bağlayabiliriz ancak temeli daha önceye de dayandırırsak daha iyi bir hasbihalde bulunabiliriz. Öncellikle insanlık tarihinde avcı toplayıcı diye bir devir bulunmakta bu dönemde insanlar ufak gruplar halinde avcılık yapabilecekleri alanlarda yaşıyor ve avlarının popülasyonu azaldığında ise daha farklı noktalara hareket ediyorlardı. Hatta bu süreçte hızını alamayıp kıta değiştirmiş olanlar vardı diye hatırlıyorum. Zaman geçtikçe avcı toplayıcıdan tarıma geçiş yapıldı ve bunda da en büyük pay \"BUĞDAY\"da. Yabani buğdayları gerek ateş gerekse süpürge gibi farklı nedenlerle kullanmak isteyen insanlar tohumlarının parçalanıp uyku ihtiyacını giderdikleri yere serpilmesini ve burada buğdayların yetiştiğini görmeyle yavaştan avcı toplayıcılıktan tarıma geçmiş oldular. Bu mantığı saçma bulabilirsiniz ancak çıkarımlarda gerçekten mantıklı ve yararlıdır. Örneğin Çatalhöyük'te yapılan çalışmalarda kadın bireylerin daha genç yaşlarda öldüklerini buluyorlar ve bunun nedeninin ise evlerde baca sisteminin düzgün olmaması ve ateş yakıldığında oluşan isin onları yavaş yavaş zehirleyerek öldürdüğü kanaatine varılıyor. Buğday kısmına geri dönelim. Tarıma geçiş olmadan önce insanlar sürekli avlarının peşlerinde hareket etmekten yüksek bir kalori harcamasında bulunuyorlardı. Hatta bazen avladıkları hayvandan aldıkları kalori harcadıklarından daha az olabiliyordu. Bu durumda obezite gibi bir sorunla karşılaşılmaz diyebiliriz. O çağları tasvir eden görüntülere bakarsanız adamlarda göbeği bırakın karın kası varmış gibi resmederler  Tarıma geçildiğinde hareket ettikleri alan azalmış ve belirli miktarlarda düzenli besin tüketimi ve daha düzenli bir yaşam stili ile yine obezite durumuna rastlamayız. Bu süreçten sanayi devrimine kadar olan süreçte bü tekdüzen yaşam stili hemen hemen dünya genelinde aynıdır. Aynıdır derken alınan kalori ve yakılan kalori düzeyi hemen hemen aynıdır. Sanayi devrimine gelindiğinde ise artık insanlar normalden daha az emek harcıyor ve imkanları daha öncesine göre daha da artmış olduğundan bir rehavet durumuna geçilmiştir. Keza artık sanayi devrimi ile üretilen besinlerin içeriğinde yapay maddeler bulunmaktadır. Son 30-40 seneye kadar bu gelişme obeziteye sebep vermemiş türlü türlü rahatsızlıklara sebep olmuştur. Sanayi devrimi sadece insanın iş gücünü azaltmamış boş zamanlarını da arttırmıştır nitekim rekreasyonel aktiviteler yine sanayi devrimi ile başlamıştır yani turizm. Yani kısacası kalori yakacağı işlerin sayısı ve süresi azalmış ve en iyi ihtimalde kaloride artış olmasa bile o göbek çıkmaya başlamıştır. Bu denklemde alınan kalori artışı olursa da işte o zaman obezite bizi karşılar. Keza teknolojinin gelişmesi ile besinlerin kimyası bozulmuştur gerek GDO olsun gerek zamanından önce hasat almak için basılan kimyasallar olsun insanlığın obeziteye karşı dirençsiz olmasını sağlamıştır. Yani temelinde obezitenin ana sorunu tersine tembel puma sendromudur  Tembel puma sendromu: Bir puma avını ayırt etmez bir ceylan içinde aynı çabayı verir bir tavşan içinde yani yediği besinin kalorisi bazen harcadığından daha azdır. Obezite de yer alan tersine tembel puma sendromu ise benim tabirimle: Harcadığımız kaloriden fazlasını yiyoruz ki obezite bizi karşılıyor  Aman param var ki yiyorum demeyin lütfen  Çözüm önerisi diyebileceğim tek şey: İlk önce bir diyetisyene kesinlikle danışın ve daha sonrası içinse nacizane tavsiyem acıktıkça açlık hissinin gideceği kadar yeyin bol bol yürüyün ve su için",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "October 21, 2023, 08:38:05 PM",
      "body": "Quote from: meser# on October 21, 2023, 07:16:47 PMGünümüz obezitesini sanayi devrimine bağlayabiliriz ancak temeli daha önceye de dayandırırsak daha iyi bir hasbihalde bulunabiliriz. Avcı toplayıcı dönemi bırakıp tarım devrimine geçmek bence hatalı bir tercih. Harari bu durumu eleştiriyor kitaplarında. Tarım devrimi ile yerleşik hayata geçtik ve medeniyetler inşa ettik ve birçok icat yaptık. Tüm bunları yiyecek stoklamayı başardığımız için yerleşik hayata geçmemize borçluyuz. Fakat milyonlarca yıllık evrimimiz yeni yaşam tarzımıza uyumlu olmadığı için fiziksel özelliklerimiz ve yetilerimiz yeni yaşam tarzımıza adapte olmakta zorlandı. Bu yüzden kilo ve fazla kiloya bağlı sağlık sorunları yaşıyoruz. Aslında yalnızca hareketsiz bir yaşama mahkum değiliz. Aynı zamanda daha sıkıcı bir yaşama da mahkumuz. Ormanda özgürce mantar arayıp beslenmek yerine fabrikalarda tüm gün kendini tekrar eden iş makinalarında operatör olarak çalışıp karın tokluğuna yaşıyoruz. Avcı ve toplayıcılar çeşit çeşit farklı bitkileri yiyen, çeşit çeşit farklı mantarları ve çeşit çeşit deniz ürünlerini yiyen insanlardı. Bizler sürekli aynı şeyleri yiyoruz. Bu konuda onlara göre kesinlikle dezavantajlıyız. Harari'nin kritiği çok önemli ve güçlü. Ben onun bu eleştirisini haklı buluyorum. Konuyu bu açıdan değerlendirince tarım toplumuna geçiş hatalı bir tercih.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "October 22, 2023, 03:41:37 PM",
      "body": "Çoğumuzun 3 kuşak öncesine kadar evde kışlık yiyecek depolanabiliyordu ama onunla da bütün kışı geçirmek zorunda kalıyorlardı. Bunlar dışında böyle yiyeceklerin bol olması normal köylü insan için çok zor bir şey. Şimdi istesek bir günde bir ordu adamı doyurabilecek yiyeceğe ulaşabiliyoruz. Daha da öncesinde yani tren öncesinde sadece yerel yiyecekler yenebiliyormuş, sadece kahve ya da bazı baharatlar gibi şeyler uzaklardan çok az miktarlarda getirilebiliyormuş. Bu yiyeceğe az ulaşmanın verdiği zorunluluk ile tüm insanlar sürekli çorba içiyormuş. Çin'den İngiltere'ye kadar. Ben anne tarafında da baba tarafında da sülalenin en küçüğüyüm. Dedelerim yaklaşık 100 sene önce doğmuşlar. Onların zamanında şimdiki kahvaltı gibi bir şey yokmuş, paso çorba içiyorlarmış. Zeytin ve çay yok. Lahananın bol yetiştiği bir bölge olduğu için evde sürekli kapuska pişiyormuş. 3 kuşak sonrası ben ise günde 2000 kaloriyi az olarak görüyorum, sadece 2000 kalori alabilmek için çok büyük çaba sarf etmem gerekiyor, diyet yapıyorum. 3 kuşak ve öncesi için günde 2000 kalori zor alınabiliyormuş, çoğu da ekmekle. Un da sınırlı öyle çok ulaşamıyorlar ki. Ayrıca şimdi çalışmak dediğimiz şey çoğumuz için masa başında oturmak. Arabayla da gidiyorsan belki günde 5 dakika yürümüyorsun. Eski zamanlarda tarlada vs çalışılmıyorsa zaten sıkıntıdan hareket eder insan. Ve binbir tane iş oluyor, insan hareket etmek zorunda kalıyor, atıyorum ateş yakmak gibi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "October 22, 2023, 07:17:00 PM",
      "body": "Quote from: meser# on October 21, 2023, 07:16:47 PMYani temelinde obezitenin ana sorunu tersine tembel puma sendromudur  Tembel puma sendromu: Bir puma avını ayırt etmez bir ceylan içinde aynı çabayı verir bir tavşan içinde yani yediği besinin kalorisi bazen harcadığından daha azdır. Obezite de yer alan tersine tembel puma sendromu ise benim tabirimle: Harcadığımız kaloriden fazlasını yiyoruz ki obezite bizi karşılıyor ...Güzel bir yorum, bu puma sendromuna, puma zihniyeti, hatta avcı zihniyeti (predator mindset) de diyebilirsiniz ki insan bunu modern hayatta da yakalayabilecek kadar zeki bir canlıdır, ki zaten rekabetçi sporların temelinde yatan prensip de budur. Bazı insanlar vardır mutlaka rastlamışsınızdır ne kadar yerlerse yesinler fit ve atletik yapılarını korumayı başarırlar, bu kadınlar için de geçerli ve doğrudan aktivite seviyeleri ve enerji kullanımıyla ilgili bir konu.Avcı mantalitesini zihin ve irade olarak yakalayabilirseniz hareketlerinizin ve yürüyüşünüzün bile değiştiğini fark edeceksiniz, bu noktadan sonra zaten spor sizi bulacak, duvara dayanarak hatta hiçbir destek almadan bile müthiş kalistenik egzersizler yapılabilir, ama enerji harcamak ve bu zor fitness hareketlerini yapabilmek için önce bir avcı olduğunuza içgüdüsel olarak ikna olmak gerekir, en az doğru diet kadar önemli bu ayrıntıyı da belirtmek isterim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 22, 2023, 08:33:52 PM",
      "body": "Quote from: Vispilio on October 22, 2023, 07:17:00 PMQuote from: meser# on October 21, 2023, 07:16:47 PMYani temelinde obezitenin ana sorunu tersine tembel puma sendromudur  Tembel puma sendromu: Bir puma avını ayırt etmez bir ceylan içinde aynı çabayı verir bir tavşan içinde yani yediği besinin kalorisi bazen harcadığından daha azdır. Obezite de yer alan tersine tembel puma sendromu ise benim tabirimle: Harcadığımız kaloriden fazlasını yiyoruz ki obezite bizi karşılıyor ...Güzel bir yorum, bu puma sendromuna, puma zihniyeti, hatta avcı zihniyeti (predator mindset) de diyebilirsiniz ki insan bunu modern hayatta da yakalayabilecek kadar zeki bir canlıdır, ki zaten rekabetçi sporların temelinde yatan prensip de budur. Bazı insanlar vardır mutlaka rastlamışsınızdır ne kadar yerlerse yesinler fit ve atletik yapılarını korumayı başarırlar, bu kadınlar için de geçerli ve doğrudan aktivite seviyeleri ve enerji kullanımıyla ilgili bir konu.Avcı mantalitesini zihin ve irade olarak yakalayabilirseniz hareketlerinizin ve yürüyüşünüzün bile değiştiğini fark edeceksiniz, bu noktadan sonra zaten spor sizi bulacak, duvara dayanarak hatta hiçbir destek almadan bile müthiş kalistenik egzersizler yapılabilir, ama enerji harcamak ve bu zor fitness hareketlerini yapabilmek için önce bir avcı olduğunuza içgüdüsel olarak ikna olmak gerekir, en az doğru diet kadar önemli bu ayrıntıyı da belirtmek isterim.Ufak değişikler bile gerçekten hayatınızın kalitesini arttırabilir. Keza binlerce lira verip gidip spor salonlarında yapılamayan vücutları örnek olarak Amerika'da hapishanedeki zenciler çok rahatlıkla yapabiliyor. En fazla ağırlık setleri oluyor ki ağırlık setlerine ihtiyaç olmadan kendi ağırlığınla vücut geliştirebililirsin. Örnekte vermiş olduğunuz kişilerden birisi de benim. Ne kadar yersem yiyeyim 65 kilonun üstüne çıkamam. Ama adım sayarımda her gün en az 12-13.000 adım atmış oluyorum bu da 7-8 km civarına tekabül ediyor. Ayrıca sigara içen bir birey olarak nefes tıkanıklığı çok nadir yaşarım o da halı sahada ikinci devrede falan yaşarım onda da yere bir iki dakika uzanır nefes alışverişimi düzene sokar tekrar depara devam ederim. Bunda en büyük neden kendimi diyafram nefesine adapte etmiş olmam. Misal diyafram nefesi gibi merdivenleri kullanırım hep 4 kattan fazla çıkmam gerekiyorsa anca o zaman asansör kullanırım. Bu tarz ufak alışkanlıkları hayatına ekleyen insan rahatlıkla daha iyi bir hayat standartına sahip olacaktır.  1 her zaman 0'dan büyüktür. Yapılan ufak şeyler domino taşı etkisi gibi hayatınızda büyük değişikliklerin önünü açacaktır. O yüzden istikrar ve güçlü bir zihniyetle bu tarz sorunlar önlenir daha iyi bir geleceğe merhaba denir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "October 22, 2023, 08:45:25 PM",
      "body": "Quote from: meser# on October 22, 2023, 08:33:52 PMUfak değişikler bile gerçekten hayatınızın kalitesini arttırabilir. Keza binlerce lira verip gidip spor salonlarında yapılamayan vücutları örnek olarak Amerika'da hapishanedeki zenciler çok rahatlıkla yapabiliyor. En fazla ağırlık setleri oluyor ki ağırlık setlerine ihtiyaç olmadan kendi ağırlığınla vücut geliştirebililirsin. Bu da çok önemli bir ayrıntı, ABD hapishanelerinde bir araştırma yapılıyor ve görülüyor ki azılı suçlular berbat yemeklere ve hücre hapsine rağmen çok daha iri yapılı ve kavgacı olarak hapishaneden çıkıyorlar...Bu konuda Convict Conditioning diye gerçek hapishane mahkumlarından öğrenilen taktiklerin anlatıldığı sırf vücut ağırlığı egzersizlerine odaklanan bir kitap var, bir klasik kabul edilir bu alanda, amazon linkini bırakıyorum ama bedava da download edebilirsiniz:https://www.amazon.com/Convict-Conditioning-Weakness-Survival-Strength/dp/1942812159Burada kritik bir noktayı daha vurgulayalım çeşitli çalışmalar yapılıyor neden bu mahkumlar bu kadar güçlü oluyor falan diye ve uzmanlar hayatta kalma içgüdüsünün ve çok tehlikeli bir ortamda diğer suçlularla bulunmanın testosteron oranlarına müthiş bir katkı yaptığını keşfediyorlar, yani çok tehlikeli bir grup adamı aynı ortamda hapsedince rekabet ve testosteron seviyesindeki patlama kuvvet ve fiziksel mücadele gibi konularda zirve yapmalarına yardımcı oluyor, doğru zihniyetin ve irade gücünün önemini kanıtlayan bir bulgudur bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 22, 2023, 09:05:29 PM",
      "body": "Quote from: Vispilio on October 22, 2023, 08:45:25 PMQuote from: meser# on October 22, 2023, 08:33:52 PMUfak değişikler bile gerçekten hayatınızın kalitesini arttırabilir. Keza binlerce lira verip gidip spor salonlarında yapılamayan vücutları örnek olarak Amerika'da hapishanedeki zenciler çok rahatlıkla yapabiliyor. En fazla ağırlık setleri oluyor ki ağırlık setlerine ihtiyaç olmadan kendi ağırlığınla vücut geliştirebililirsin. Bu da çok önemli bir ayrıntı, ABD hapishanelerinde bir araştırma yapılıyor ve görülüyor ki azılı suçlular berbat yemeklere ve hücre hapsine rağmen çok daha iri yapılı ve kavgacı olarak hapishaneden çıkıyorlar...Bu konuda Convict Conditioning diye gerçek hapishane mahkumlarından öğrenilen taktiklerin anlatıldığı sırf vücut ağırlığı egzersizlerine odaklanan bir kitap var, bir klasik kabul edilir bu alanda, amazon linkini bırakıyorum ama bedava da download edebilirsiniz:https://www.amazon.com/Convict-Conditioning-Weakness-Survival-Strength/dp/1942812159Burada kritik bir noktayı daha vurgulayalım çeşitli çalışmalar yapılıyor neden bu mahkumlar bu kadar güçlü oluyor falan diye ve uzmanlar hayatta kalma içgüdüsünün ve çok tehlikeli bir ortamda diğer suçlularla bulunmanın testosteron oranlarına müthiş bir katkı yaptığını keşfediyorlar, yani çok tehlikeli bir grup adamı aynı ortamda hapsedince rekabet ve testosteron seviyesindeki patlama kuvvet ve fiziksel mücadele gibi konularda zirve yapmalarına yardımcı oluyor, doğru zihniyetin ve irade gücünün önemini kanıtlayan bir bulgudur bence.Dediğin gibi iş zihniyette bitiyor hocam. Bir tane adam vardı onun videolarını izlemiştim acı olgusunu beyninden kaldırarak imkansız olarak görülen şeyleri rahatlıkla yapabiliyordu. Hatta buna benzer bir hikayemi anlatayım bir tane video ekleyerek anlatayım:https://www.youtube.com/watch?v=N2WD_7qOSL4&ab_channel=ekazanclar Bu \" Devlerle yüzleşme \" filminden bir sahne. Bu sahneyi gördükten sonra baya bi aramıştım çok sonra tesadüfen bulmuştum. Ama o videoyu ilk gördüğüm zamanlarda düzenli 2-3 km falan koşuyordum. Ama bu videoyu izledikten sonra şu repliği habire tekrarlayarak koşmaya başlamıştım \"Daha ileri gidebilecekken bırakmak istemiyorum.\" o gün kendi rekorumu kırmıştım tam 9 küsür km koşmuştum.  Zihnimiz nadasa bıraktığımız verimli bir tarla aslında zamanı geldiğinde güzelce temizler bakımını yaparsak verimli sonuçlar alırız ama gerekeni yapmazsak bağ olmaz dağ olur. Çünkü sürekli olarak zihnimiz kendini korumaya kalkar yani birşeyde zorlandığımız anda güvenli limana kaçmaya kalkar. Örneğin koşuya başladığınızda nefes nefes kaldığınız anda bırakmak istersiniz; ya da bir iki gün spora gidersiniz hamlık ağrılarınız başlar 1 gün izin vereyim kendinize dersiniz daha sonra da devam edemezsiniz. Ama tam o nokta da devam ederseniz zihninizin kilidini açarsınız ve çok daha ilerilere gidebilirsiniz. Yukarı da verdiğiniz örneğe baktığmızda bu da böyle birşey bu nokta da bulunduğu ortamın kişiye vermiş olduğu adrenalin ve kendilerini koruma gereksinimi onları ilerlemeye iter. Bu durumu sadece fiziksel anlamda düşünmezsek iş ve eğitim hayatımızda da böyle bir gerçek bizi bekliyor. Bu mecburiyetin farkına varmadığımız süreçte hayatımızın her anında bizden daha iyi olan bireyler olur. Okulun 1. olamayız; iş yerinde ayın elemanı olamayız, bölgenin en iyi ikinci firması oluruz. Gerçektende zihni kodlayabilmek çok önemli bu bahsettiğiniz kitabı müsait olduğum bir zamanda edinip kesinlikle okuyacağım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "October 22, 2023, 09:14:24 PM",
      "body": "Fast food hızlı gıdanın bu kadar patlamasının bir çok sebebi var. Şehir hayatında her işe hızlı yetişmek zorundayız, yoksa diğer işlere yetişmek çok zor genelde hızlandırmak için yemekle uğraşmaz şehir insanı hemen hızlıca yemek işini halledip aktif olan işleri halletmeye çalışılır bu çaba her açıdan sağlıksız, uzun vadede obeziteye bir çok sağlık sorununa yol açıyor hazır beslenme şekli. Evde yapılmış tencere yemeği yediğim zaman bile o an kendimi çok iyi hissediyorum, hazır yemek yediğim zaman sadece anlık doygunluk hissi geliyor ardından çabucak gidiyor ve acıkıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 23, 2023, 07:58:28 AM",
      "body": "şu avcı-toplayıcı ve buğday meselesi üzerine harari muhabbeti geçmiş (konuya avcı-toplayıcı zehrini kim saldıysa onun yüzünden yaşanmış bunlar hep). o herif tarım devrimini yanlış bir tercih olarak yorumlamıyor. o dönemde yaşayan insanlar için hiçbir faydası yokken bunu neden tercih ettiler diye soruyor. açıkçası bu görüşe ben de katılıyorum ama tarım devrimi ve yerleşik hayat mükemmel bir konfor alanı oluşturmuşken ben de aynı şeyi yapardım diyorum. ayrıca, bugünkü gelişmişliğimizi o gün tercih edilen konfor alanına borçluyuz; daha ne olsun işte...ben eskiden yağ oranım biraz bile artsa çok fazla dert ederdim ama ronnie coleman'nın off sezondaki halini gördükten sonra fikirlerim 180 derece değişti. tek kişilik koltuğa mabadım sığmaya devam ettikçe kendimi veya benzer durumdaki başka birini obez olarak tanımlamam. not: dünya sağlık örgütünün vs. bilimsel verilere dayanarak yaptığı açıklamalara taş devrinden cevaplar verdiğim mutlu bir günü yaşıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "October 23, 2023, 09:10:34 AM",
      "body": "Benim yıllarım kilo vermek ve almamaya çalışmakla geçti. Ne yesem yarıyor. Çok az yemeye gayret ettiğim zamanlarda da yine birikim yapabiliyorum. Artık çok sıkıldım. Bu az ya da çok yemekten ziyade yediklerimizin bizim metabolizmamız üstündeki olumsuz etkilerden kaynaklandığını ve vücudun enerjiye çevirmek yerine allerjik yada intölerans duydugu yiyercekleri yağ dokusuna çevirmesinden kaynaklandığını düşünüyorum. Buğday.; olmaz sa olmazlardan benim bünyem buna karşı tepki veriyor. Az ekmek yada unlu birşeyler yesem hemen kilo almaya başlıyorum. Arpa, yulaf, çavdar bunlara allerjim olduğundan bunları tüketemiyorum zaten. Kısacası ben çok yediğimden değilde vücudumuzun tepkili olduğu gıdaları tükettiğimizde daha fazla kilo alma eğilimi içine girdiğini düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "October 23, 2023, 10:40:35 AM",
      "body": "Quote from: gospodin on October 21, 2023, 06:49:01 AMçünkü fast food ucuz. içinde ne olduğu bilinmeyen malzemelerden yapılan, lezzetli ve doyurucu gıdalar ile insanlar günleri geçirebiliyor. bunun yanına bir de çocukluktan itibaren hiç spor yapmama eklenince 10 yaşındaki çocuklar 70-80 kilo oluyor. kendi ülkemize bakalım:(artık fast food bile çok pahalı ülkemizde)- et ürünlerine ulaşmak maddi anlamda çok zor.- çalışan kısım bırak spor yapmasını nefes bile alamıyor. (günde 2-3 saati yolda geçiyor.)- karnını doyurması lazım,- geleneksel yemeklerimizde kullanılan yağların kalitesi- memlekette sebze bile artık pahalıdiye listemiz uzar da gider. bu sağlık sorununu yenmemiz için devletin de işin içine girip ciddi bir aydınlanma yapması gerekiyor. obezite ile ilgili ileride doğacak sağlık sorunları sisteme yük olacak. diyabet, kalp vs bir sürü hastalığı tetikliyor ama daha önemli işlerimiz var.Evet kendi ülkemiz açısından değerlendirirsek tablo çok daha vahim oluyor. Burger King ve muadili fast food restoranları eskiden ülkemizde alım gücü açısından daha iyi durumdaydı. Fakat artık onlar bile inanılmaz oranda pahalandı. Onu bile parası olan yiyebiliyor artık. Spor konusuna gelecek olursak evden çalışan insanlar ancak daha rahat bir düzen oturtabilirler. Sebze, et fiyatları zaten uçtu gitti aylık et tüketim miktarımız çoğu ülkeye kıyasla aşırı düşük kalıyor. Alım gücümüz düşük diye biz de sürekli ekmek, makarna vb. ile obeziteye davetiye çıkarıyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}