{
  "id": "topic_5460130",
  "title": "Shortmaster",
  "author": "Shortmaster",
  "created_time": "July 17, 2023, 07:24:39 PM",
  "content": "So If USA vs russia fight with nukes how everything look like People who never experinced nuke war what they should know? Will the internet connection Will be disturbed Also when it's war i still want to trade online.Like how powerful the nuclear Are ... How to keep still good life Even when nuke hit ? Is home basement good idea ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460130",
  "comments": [
    {
      "author": "be.open",
      "created_time": "July 17, 2023, 08:18:22 PM",
      "body": "Quote from: Shortmaster on July 17, 2023, 07:24:39 PMSo If USA vs russia fight with nukes how everything look like People who never experinced nuke war what they should know? Will the internet connection Will be disturbed Also when it's war i still want to trade online.Like how powerful the nuclear Are ... How to keep still good life Even when nuke hit ? Is home basement good idea ? If you want to increase your chances of surviving massive strategic nuclear strikes, stay away from big cities and ocean shores. This does not give any guarantees, but it significantly reduces the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 17, 2023, 08:30:24 PM",
      "body": "Certainly, a house would not be a good idea in a nuclear strike.Even ordinary shelters will not be useful, you need shelters that are immune to nuclear strikes.The best solution is to move away towards deserts and distant mountains. Of course if you have enough time!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "July 18, 2023, 03:17:05 AMLast edit: July 18, 2023, 03:31:38 AM by Queentoshi",
      "body": "Quote from: Shortmaster on July 17, 2023, 07:24:39 PMSo If USA vs russia fight with nukes how everything looks like People who never experinced nuke war what they should know? It is very obvious how things will look like, there will be lots of death and destruction. Many innocent children will die or become orphans to the chaos. I do not wish to experience a crisis that is of that degree. Quote from: Shortmaster on July 17, 2023, 07:24:39 PMIs home basement good idea? Your house can be crumbled on top of you. It is not built for nukes or to withstand their pressure. If it is an unavoidable situation, densely populated cities and areas will be the target for the nukes for more damage, relocating from society to an off-grid location can be what will bring survival for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 18, 2023, 01:53:21 PM",
      "body": "If you are not rich enough to migrate and change where you reside after the tension between these super powers goes out of control, then you need to face the truth and just face your fate because there will be no escape when they begin to detonate those nukes that are more powerful than the one they have tested. I hope my country will not be one of those listed to be fired by nukes because if that's gonna happened, then there would be no more escape because the escape just means more suffering because the after-effects of the result of nuclear destruction are more severe because it kills the people slowly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 18, 2023, 04:21:21 PM",
      "body": "Kinetic bombardment - https://en.wikipedia.org/wiki/Kinetic_bombardment\"These designs are envisioned as a bunker buster.[12][14] As the name suggests, the 'bunker buster' is powerful enough to destroy a nuclear bunker.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "July 18, 2023, 06:08:28 PM",
      "body": "Quote from: Shortmaster on July 17, 2023, 07:24:39 PMSo If USA vs russia fight with nukes how everything look like People who never experinced nuke war what they should know? Will the internet connection Will be disturbed Also when it's war i still want to trade online.Like how powerful the nuclear Are ... How to keep still good life Even when nuke hit ? Is home basement good idea ? Any survival in a nuclear war will be short term. In the long run extinction of the human race as well as most (if not all) life on earth is guaranteed. In fact, if such a war would happen, the lucky ones will be the people who get incinerated within a millisecond. Everyone else will die slowly from radiation poisoning or just starvation. Because plants will not grow during nuclear winter. Sure, the ultra rich might have self sustaining bunkers but that will be all for naught on a dead, radioactive planet. They will simply be the last to die. But let me save you the suspense: You are not part of the ultra rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 18, 2023, 10:40:19 PM",
      "body": "Quote from: Shortmaster on July 17, 2023, 07:24:39 PM-cut-Is home basement good idea ? You would really want to live in the tiny basement rest of your life until you either get robbed and god knows what by someone with a bigger gun. Or wander around in radioactivity in something in total anarchy and chaos when there's no clean water, food or anything really. Much more merciful would be die instantly in that blast. There probably will be some survivors that will keep living in some high tech silo-like bunkers but i wouldn't want to be part of that group. It would consist of wealthy people with less real life skills then needed to actually survive in that situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "July 19, 2023, 02:04:29 PM",
      "body": "Quote from: Shortmaster on July 17, 2023, 07:24:39 PMPeople who never experinced nuke war what they should know? Anyone speaking from experience would be dead.Your basement will do nothing and absent of a self sustainable bunker in the Swiss mountains, your chances of survival will not be high.Even if you're not any where near the blast radius, supply chains will be disrupted, water supplies contaminated, and no food. Nukes would be utterly destabilizing and survival would be luck of the draw with the hope your own country wouldn't be targeted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 19, 2023, 02:51:03 PM",
      "body": "Quote from: Gyfts on July 19, 2023, 02:04:29 PMQuote from: Shortmaster on July 17, 2023, 07:24:39 PMPeople who never experinced nuke war what they should know? Anyone speaking from experience would be dead.Your basement will do nothing and absent of a self sustainable bunker in the Swiss mountains, your chances of survival will not be high.Even if you're not any where near the blast radius, supply chains will be disrupted, water supplies contaminated, and no food. Nukes would be utterly destabilizing and survival would be luck of the draw with the hope your own country wouldn't be targeted.However, nobody is speaking from real, personal scientific experience. Watch the video to see what really has been happening with nukes, and why they have been declared far more dangerous than they really are.Witness the nuclear fear scam. Scientist eats uranium. - https://www.youtube.com/watch?v=QmJN-LMPnX0.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 25, 2023, 06:20:07 PM",
      "body": "Quote from: Shortmaster on July 17, 2023, 07:24:39 PMSo If USA vs russia fight with nukes how everything look like People who never experinced nuke war what they should know? Will the internet connection Will be disturbed Also when it's war i still want to trade online.Like how powerful the nuclear Are ... How to keep still good life Even when nuke hit ? Is home basement good idea ? I don't want to experience a nuke war between these two world powers. The world especially Europe and America will be devasted by the war. There will be a refugee crisis and I wonder where most people will go to to escape this war. There are few neutral nations in Europe so the war will be widespread. Your basement will be useless because there will be the use of chemical warfare that will elude medical response. Depending on how long the war will last many people will die of cold and starvation. Power supply will be cut and the food in the basement might not be easily replaced. Quote from: be.open on July 17, 2023, 08:18:22 PMIf you want to increase your chances of surviving massive strategic nuclear strikes, stay away from big cities and ocean shores. This does not give any guarantees, but it significantly reduces the risk.What about moving to a nation that will not be part of the war? I know that many South American and African countries will be safe. It will be better to face the economic problems of these developing nations than to experience the devastation of nuclear war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}