{
  "id": "topic_5407950",
  "title": "Symmetrick",
  "author": "Symmetrick",
  "created_time": "July 28, 2022, 05:49:25 PMLast edit: November 30, 2023, 01:00:35 AM by Symmetrick",
  "content": "ㅤ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407950",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "July 28, 2022, 05:55:04 PM",
      "body": "Quote from: Ratimov on July 28, 2022, 05:49:25 PMI increasingly see people's opinions that in order to preserve value, to diversify their investments, you need to invest in the top 10 cryptocurrencies,There are different opinions on the best way to invest, but I mostly do not agree with the idea of judging by the apparent market cap of a currency in relation to others to pick your asset:• For one, market capitalization is not a proper indicator of a good asset and can be easily manipilated to give a false sense of security,• And my second reason, is what you've highlighted in your thread. The top coins are not fixated, the top 10 today would almost definitely not be the same in 5 years time or even in 5 months.Do an actual research if you want to invest, don't just bank on what majority is doing or possibly inflated figures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "July 28, 2022, 06:09:33 PM",
      "body": "Quote from: Ratimov on July 28, 2022, 05:49:25 PMNow, during the crypto-winter period, I increasingly see people's opinions that in order to preserve value, to diversify their investments, you need to invest in the top 10 cryptocurrencies, because they symbolize reliability, and value and definitely will not leave the market. I believe Bitcoin maintains its position as the number one crypto because of its true decentralization in nature, consensus, and no censorship. However, all the top 10 cryptocurrencies on the CMC list may not leave the market but it's not all of them that are good for long-term investors, especially those that are centralized.Quote from: Ratimov on July 28, 2022, 05:49:25 PMBut are these people wondering if the cryptocurrencies they see as diversification will still be in their top 10 spots in, say, 3 years?The CMC slot from 2-10 always changes every 4years and I don't think the slot should be the main focus if their investment yields something profitableQuote from: Ratimov on July 28, 2022, 05:49:25 PMLeaders change, depreciate, get stuck in terms of development and price growth, and only one asset remains unchanged. Bitcoin.This is one of the reason why investors are advised to make Bitcoin the top of their list",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "July 28, 2022, 06:24:09 PM",
      "body": "Quote from: Ratimov on July 28, 2022, 05:49:25 PM~snip~Then what happens: in hell diversification and limit yourself to investing only in bitcoin? (You can also add eth, since it has also been holding on to positions 2-3 for a long time and doesn't plan to leave the top-10). If look at this picture, it turns out that diversification is not such a good idea. Quote from: Upgrade00 on July 28, 2022, 05:55:04 PMDo an actual research if you want to invest, don't just bank on what majority is doing or possibly inflated figures.To do this, need to have the necessary skills, abilities and knowledge, which most likely will be lacking. In theory, your advice is good, but in practice, few people are willing and able to follow it. Especially when it comes to newbies. Many will prefer a simple and easy way - investing based on the capitalization of the cryptocurrency on coinmarketcap, that is, the top-10.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 28, 2022, 06:37:37 PM",
      "body": "Apparently, it's the idea all along for most when it comes to making an altcoin investment in the bear market. The coins in the top 10 often seens to stand out and holds promises and is mostly believed to have less potency of dumping as this is often the case for altcoins during the long winters but, we know that's not entirely what is obtainable.Looking at the presented table right now, I could note how XRP have fallen over the years and it's surprising its been a major competitor to ETH and now, its gradually falling off the top 10. That's the reality to it as per market capitalization, its time definitive and means very little.Bitcoin becomes the only coin that is sure to maintain its position as per being pioneer currency and the changes that occurs on the coin is what is reflected on other coins. Its bound to lead everytime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 28, 2022, 06:46:01 PM",
      "body": "Quote from: m2017 on July 28, 2022, 06:24:09 PMIf look at this picture, it turns out that diversification is not such a good idea. Diversification doesn't truly exist in a highly correlated market. The crypto space in one of such markets where currencies mirror the price actions of others, so when there is a crash, majority of coins get effected, similar to when there's a spike up.A diversified portfolio would contain assets from different niches, real estate, crypto, stocks, gold etc.Quote from: m2017 on July 28, 2022, 06:24:09 PMTo do this, need to have the necessary skills, abilities and knowledge, which most likely will be lacking. In theory, your advice is good, but in practice, few people are willing and able to follow it. Especially when it comes to newbies. Many will prefer a simple and easy way - investing based on the capitalization of the cryptocurrency on coinmarketcap, that is, the top-10.You should not be investig your hard earned money, if you can not take out the time to actually research on what you are investing in. If one blindly jumps into an investment, there is a high possibility you would get rekt in the long run.Researching is not rocket science either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 28, 2022, 06:56:58 PM",
      "body": "Quote from: Ratimov on July 28, 2022, 05:49:25 PMLeaders change, depreciate, get stuck in terms of development and price growth, and only one asset remains unchanged. Bitcoin.Bitcoin has indeed performed well, very far more than any other crypto currency asset that has ever been created, but this is not or should not be a surprise, I personally would have been surprised if Bitcoin, being the frontier in the crypto space allowed itself to be overthrown by another crypto asset.Aside Bitcoin being one with the most market capitalization and highest in rank, Bitcoin I think also is the most safe and reliable crypto asset to invest in, it is one with the most volume on almost all exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 28, 2022, 06:58:48 PM",
      "body": "Quote from: Ratimov on July 28, 2022, 05:49:25 PM But are these people wondering if the cryptocurrencies they see as diversification will still be in their top 10 spots in, say, 3 years?After a lot of experience in the market and how i have lost money on plenty diversification, some of the things that I have learnt are;- Diversification can be good and can also be bad. If you choose to diversify your cryptocurrency investment before you can accommodate it, your money may be swallowed up or reduced in the process of being invested in speculated cryptocurrencies that they told you will last the test of time. -You can diversify in crypto for the short-term, but for long-term investments in cryptocurrency, bitcoin should be your number one choice always.- If you must diversify your investment, don't over do it. Pick one or two other coins in addition to BTC and be content. Buying over 10 cryptocurrency may do you no good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "July 28, 2022, 06:58:54 PM",
      "body": "It's possible that over the next few years for the top position and becoming a king will be the same as in previous years.This clearly proves that bitcoin is quite feasible for those who already understand and indeed until now the movement of bitcoin will still be something interesting because until now especially with the news everywhere that makes them more exposed and will definitely be more in demand.About top 10 coins don't know why I just always see some of them for altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "July 28, 2022, 07:01:31 PM",
      "body": "Bitcoin is best for many reasons not limited to:Longest running blockchainLargest market capAnonymous creator (no one liable)Accepted most placesPerfect algorithm and scalingAnything else?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 28, 2022, 07:17:18 PM",
      "body": "Quote from: Upgrade00 on July 28, 2022, 06:46:01 PMQuote from: m2017 on July 28, 2022, 06:24:09 PMIf look at this picture, it turns out that diversification is not such a good idea. Diversification doesn't truly exist in a highly correlated market. The crypto space in one of such markets where currencies mirror the price actions of others, so when there is a crash, majority of coins get effected, similar to when there's a spike up.A diversified portfolio would contain assets from different niches, real estate, crypto, stocks, gold etc.Exactly, I don't understand why people say they diversified their portfolio when buying BTC, ETH, and LTC, If one goes up it's highly likely the others will too, if BTC drops for sure the others will take a dive too, so what's the diversification in it? It's like buying Shell and Chevron stocks or AMD and Intel and saying you're safe because your portfolio is diverse.I really don't get why would someone choose to spread his money over multiple coins to avoid risks when obviously it's not going to do anything.Quote from: Smartvirus on July 28, 2022, 06:37:37 PMLooking at the presented table right now, I could note how XRP have fallen over the years and it's surprising its been a major competitor to ETH and now, its gradually falling off the top 10.The only surprise is why that coin is still in the top ten as it offers nothing compared to other cryptocurrencies and their business plan of having something run on their private chain is really hard to understand, why would a private company run its private finances on somebody else's architecture when it could simply do its own centralized and far more secure solution?Why would a bank use their chain and not create their own ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "July 28, 2022, 07:38:27 PM",
      "body": "Most definitely, btc should be about %70 of a portfolio for stability and most especially for a long-term goal guarantee. It is true that most of the top 10 we have in the market today may not be in a few years to come, several factors can result in that, but as long as btc covers more than half of your investment I believe the impact (if any unexpected eventualities occur) will not be too the detriment. So far only very few alts have a long-term goal capability imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "July 28, 2022, 07:50:06 PM",
      "body": "Quote from: Ratimov on July 28, 2022, 05:49:25 PMA small historical reminder that bitcoin is the only cryptocurrency that has remained in its positions for many years:One of the things i enjoyed so much about bitcoin is the consistency in maintaining the lead over all other cryptocurrencies, i will say this as a matter of fact that it's not easy to have achieve this far, meaning a system of protocols must have been put in place to have come about this experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "July 28, 2022, 08:39:50 PM",
      "body": "The overview with all coins is good and I hope BTC stays like this for a long time. If I could choose the overview, I would like to see Bitcoin with all the biggest companies in the world. Currently in first position is Apple with 2.4 trillion € market value and Microsoft with 1.8 €. Bitcoin currently with 455 billion. So I hope we see new ATHs and that Bitcoin becomes more valuable than Apple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "July 28, 2022, 09:23:29 PM",
      "body": "That actually shows its credibility as well designed true decentralized coin and is a model to every other cryptocurrencies out there, Bitcoin is the original first cryptocurrency ever created and all other ones are just copying and trying to be like the king (original will always original) .There are a lot of things that contributed in making Bitcoin King of other cryptocurrencies which includes most secured crypto, scarcity etc and since the invention Bitcoin has been there while a lot of them have come and go and couldn't withstand the test of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Detritus",
      "created_time": "July 28, 2022, 10:35:37 PM",
      "body": "I learned about cryptocurrency 6 ago, since then I have always see Bitcoin rated the top 1 cryptocurrency, some times I wish I got to know about it when it was yet $1k. Today Bitcoin price got to $24k and according to a Crypto analyst who said that if Bitcoin crossed $30k, it means that the bull market is about to start, I just hope it does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 28, 2022, 11:58:26 PM",
      "body": "All the altcoins have the same lifecycle - create hype, pump the coin, fail to deliver on promises, coin falls to obscurity. People don't notice this an believe in \"good projects\" because they like to have hope of making quick x10 gains on \"the next big thing\". Altcoin market is just a casino with very bad odds, but just like with real casinos, people tend to focus on the rare stories of big wins and ignore the reality of frequent losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 29, 2022, 12:10:18 AM",
      "body": "This is one of the many reasons why I trusted Bitcoin and the risk is very low if you put your money into Bitcoin compared to other altcoins.Altcoins seem to be only hype over time, this infographic shows how Bitcoin is being the number since day 1.There are a lot of altcoins that tried to beat Bitcoin to be the highest market cap but failed. I am surprised why XRP is on the top since before I believe Ethereum must be the second after Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 29, 2022, 04:04:35 AM",
      "body": "Why only starting in 2015? Bitcoin is number one since the day it was born and it remains number one until now, more than a decade later. It will probably remain to be the number one in the next decades to come. The rest of the list come and go. There was actually a short video clip on the changes that happened in the top 10 since altcoins came into the market. I cannot find it anymore. The message was stronger with that one because it showed that no single altcoin in the top 10 during the early years of crypto remains there today. With Bitcoin, of course, as the exception.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "July 29, 2022, 04:08:43 AM",
      "body": "For now bitcoin is still the king, the price of bitcoin is predicted to continue to increase, for now bitcoin is still the crypto asset that is most interested by investors, although there are currently many other coins that are trying to compete with bitcoin, but for now bitcoin is still become the main choice of investors and is still the king, although ethereum is now growing rapidly and has become one of the assets that influence the development of blockchain today, but bitcoin is still king and ethereum can't beat bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}