{
  "id": "topic_5475662",
  "title": "LesterD",
  "author": "LesterD",
  "created_time": "November 27, 2023, 11:48:44 AM",
  "content": "Magandang araw mga kababayan! May nais lamang ako ibahagi sa inyo para sa mga hindi pa nakakaalam dahil may nakita akong isang thread dito sa local patungkol sa Business idea gamit ang Bitcoin.Nakita ko na ang ilang concern ay patungkol sa fees kapag kailangan mo mag-send ng payment or receive ng Bitcoin na talagang masakit talaga sa bulsa lalo na sa sitwasyon ngayon.Naisipan ko gawin ang thread na ito para makatulong sa mga gumagamit ng BTC o balang araw ay magamit ninyo kapag magsesend din kayo sa ibang tao locally or international. Ang ginagawa ko para makatipid sa fees pag nagsesend ng BTC ay gumagamit ako ng Binance Funding.Ito ang mga steps..STEP 1Pumunta lamang sa wallet/assets, tapos funding, then click PAYSTEP 2Ito ang pagkatapos ng step 1, makikita ang SEND at RECEIVE. STEP 3Click send tapos makikita ang options (email,phone,binanceID or PayID ng receiver)STEP 4Pagkatapos ilagay ang receiver ID, piliin lamang ang Bitcoin (fyi, pwedeng any crypto or kahit stablecoin)STEP 5Enter the amount, then confirm. Kung makikita ninyo, walang fee na nakalagay at instant ang transfer dito ng funds. Kahit BTC pa yan. Para sa mga namroblema sa fee, maaari niyo ito magamit para makatipid kahit papano.FYI: Binance to Binance lang po itoDISCLAIMER: Hindi ko pinopromote ang binance at lalong hindi parte ng binance team. Nais ko lamang makapagbigay alam sa mga naghahanap ng ibang paraan para makatipid sa transaction fees.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475662",
  "comments": [
    {
      "author": "bhadz",
      "created_time": "November 27, 2023, 01:53:08 PM",
      "body": "Off chain transaction yung tawag sa ganyan at kalimitan halos lahat ng exchanges puwedeng gawin ito. Maganda ito kung need mo din ng pera tapos sa kakilala mo nalang isesend yung payment mo o payment niya. Sa coins.ph puwede din itong gawin, magandang ideya nga yan para sa mga gusto magtipid pero dapat mapagkakatiwalaan lang yung katrade mo o sesendan mo ng transaction gamit ang binance pay. Salamat kabayan sa pagshare. Isang paraan nga ito para makatakas sa medyo mataas taas na fee at gustong magtipid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "November 27, 2023, 03:11:25 PM",
      "body": "Salamat kabayan sa binigay mo na ito, talagang makakatulong itong ginawa mo sa ating lokal na nais makadiscount sa transaction na gagawin sa Bitcoin. Honestly, hindi ko pa ito nasusubukan, though gumagamit naman ako ng funding pero not in Bitcoin dahil madalas lang ay sa usdt ang transaction ko. At halos napansin ko nga na walang bawas, dito palang napakalaking bagay na nito, sana'y makita pa ito ng iba pa nating mga kababayan dito sa ating lokal para hindi na sila mamoblema pa sa fee's na ating dinaranas ngayon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "November 27, 2023, 04:51:38 PM",
      "body": "AFAIK, Automatic narerefund yung fees once Binance wallet lang din yung receiver ng coins. Nakikita ko lagi yung note about sa transaction king same Binance exchange ang papasahan since internal transfer lang ang mangyayari kaya walang transaction ID or fee.Hindi ko lang sure kung ganito pa dn ngayon since hindi ko pa ulit ito nasusubukan. Ang kagandahan lang nyang Binance pay bukod sa tipid sa fees ay kahit binance pay ID lang ang gamitin para magsend ng tokens sa ibang user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "November 28, 2023, 10:20:22 AM",
      "body": "May ganito palang way sa binance para makapag send ng pera ng walang fee. Ginagamit ko laging function ang withdrawal lalo na kung makikipag trade funds ako ng usdt ko to gcash/bank ng kakilala ko. Lagi pa naman ako nagbabayad ng fee at kung minsan kailangan pa ng minimum amount para makapagsend sa iba. Akala ko sa coinsph lang pwede makapagsend ng walang fee at dahil hindi na ako gumagamit ng coinsph, malaking tulong ito lalo na sa kagaya kong hindi dumadaan sa P2P pag nag wiwithdraw. Maraming salamat sa info na ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "atamism",
      "created_time": "November 28, 2023, 07:46:50 PM",
      "body": "Quote from: DabsPoorVersion on November 28, 2023, 10:20:22 AMMay ganito palang way sa binance para makapag send ng pera ng walang fee. Ginagamit ko laging function ang withdrawal lalo na kung makikipag trade funds ako ng usdt ko to gcash/bank ng kakilala ko. Lagi pa naman ako nagbabayad ng fee at kung minsan kailangan pa ng minimum amount para makapagsend sa iba. Akala ko sa coinsph lang pwede makapagsend ng walang fee at dahil hindi na ako gumagamit ng coinsph, malaking tulong ito lalo na sa kagaya kong hindi dumadaan sa P2P pag nag wiwithdraw. Maraming salamat sa info na ito. Oo nga, salamat naman at may ganitong info na lumabas dito sa forum at sa Pilipinas Board pa kaya malaking tulong ito sa mga nagsisimulang Kabayan natin. Ganyan din ang ginagawa ko noon wayback 2019, hindi ko alam na may ganito na palang process na walang fee sa Binance. Hindi ko na kailangan magbayad ng fee in the future dahil sa thread na ito. Halos na Coinsph din ako noong nagsisimula ako hanggang sa lumabas ang Binance. Sa Binance na rin lumawak ang aking isipan patungkol sa kung ano ang pwedeng gawin dito. Kaya maraming salamat sa info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 28, 2023, 11:58:11 PM",
      "body": "Quote from: bhadz on November 27, 2023, 01:53:08 PMOff chain transaction yung tawag sa ganyan at kalimitan halos lahat ng exchanges puwedeng gawin ito. Maganda ito kung need mo din ng pera tapos sa kakilala mo nalang isesend yung payment mo o payment niya. Sa coins.ph puwede din itong gawin, magandang ideya nga yan para sa mga gusto magtipid pero dapat mapagkakatiwalaan lang yung katrade mo o sesendan mo ng transaction gamit ang binance pay. Salamat kabayan sa pagshare. Isang paraan nga ito para makatakas sa medyo mataas taas na fee at gustong magtipid.So eto pala  ang off chain transaction na tinatawag hehehe, madalas ko naririnig to sa labas ng local pero hindi ko masyado iniintindi since rare occasion lang naman ang mga ganitong congestion kaya di ako masyado concern sa transaction fees ,but now since talagang mahigpit ang pangangailangan ko sa pagbabawas ng fees tingin ko eh magagamit ko na tong feature kaso same exchange lang pala dapat to hindi pwedeng from one exchange to another exchange kaya medyo limitado din pala ang pag gamit dahil madalas ibang exchange ang ka transact ko.but thanks nga kay kabayan dahil mas detalyado at madaling sundin ang ginawa nyang thread, ma try nga agad to .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "November 29, 2023, 02:34:14 PM",
      "body": "Quote from: kotajikikox on November 28, 2023, 11:58:11 PMQuote from: bhadz on November 27, 2023, 01:53:08 PMOff chain transaction yung tawag sa ganyan at kalimitan halos lahat ng exchanges puwedeng gawin ito. Maganda ito kung need mo din ng pera tapos sa kakilala mo nalang isesend yung payment mo o payment niya. Sa coins.ph puwede din itong gawin, magandang ideya nga yan para sa mga gusto magtipid pero dapat mapagkakatiwalaan lang yung katrade mo o sesendan mo ng transaction gamit ang binance pay. Salamat kabayan sa pagshare. Isang paraan nga ito para makatakas sa medyo mataas taas na fee at gustong magtipid.So eto pala  ang off chain transaction na tinatawag hehehe, madalas ko naririnig to sa labas ng local pero hindi ko masyado iniintindi since rare occasion lang naman ang mga ganitong congestion kaya di ako masyado concern sa transaction fees ,Ngayon alam mo na kabayan, hehe. Natutunan ko lang din yan dito sa forum sa mga magagaling nating mga forumers at mga ibang kababayan na alam din ang tawag dito. Quote from: kotajikikox on November 28, 2023, 11:58:11 PMbut now since talagang mahigpit ang pangangailangan ko sa pagbabawas ng fees tingin ko eh magagamit ko na tong feature kaso same exchange lang pala dapat to hindi pwedeng from one exchange to another exchange kaya medyo limitado din pala ang pag gamit dahil madalas ibang exchange ang ka transact ko.but thanks nga kay kabayan dahil mas detalyado at madaling sundin ang ginawa nyang thread, ma try nga agad to .Oo kabayan, same exchange to exchange lang yan puwede at hindi puwede exchange 1 to exchange 2 dahil magkaiba na yun at magiging normal na transaction nalang ang mangyayari. Kaya sa mga nagtitipid pa rin sa fee kahit na medyo mababa na ngayon, puwede pa rin itong option. Pero kung hindi naman na masyadong malaki ang fee, puwede na ulit at balik na normal na transactions na ginagawa natin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LesterD",
      "created_time": "December 01, 2023, 12:56:48 PM",
      "body": "Quote from: bhadz on November 29, 2023, 02:34:14 PMQuote from: kotajikikox on November 28, 2023, 11:58:11 PMQuote from: bhadz on November 27, 2023, 01:53:08 PMOff chain transaction yung tawag sa ganyan at kalimitan halos lahat ng exchanges puwedeng gawin ito. Maganda ito kung need mo din ng pera tapos sa kakilala mo nalang isesend yung payment mo o payment niya. Sa coins.ph puwede din itong gawin, magandang ideya nga yan para sa mga gusto magtipid pero dapat mapagkakatiwalaan lang yung katrade mo o sesendan mo ng transaction gamit ang binance pay. Salamat kabayan sa pagshare. Isang paraan nga ito para makatakas sa medyo mataas taas na fee at gustong magtipid.So eto pala  ang off chain transaction na tinatawag hehehe, madalas ko naririnig to sa labas ng local pero hindi ko masyado iniintindi since rare occasion lang naman ang mga ganitong congestion kaya di ako masyado concern sa transaction fees ,Ngayon alam mo na kabayan, hehe. Natutunan ko lang din yan dito sa forum sa mga magagaling nating mga forumers at mga ibang kababayan na alam din ang tawag dito. Quote from: kotajikikox on November 28, 2023, 11:58:11 PMbut now since talagang mahigpit ang pangangailangan ko sa pagbabawas ng fees tingin ko eh magagamit ko na tong feature kaso same exchange lang pala dapat to hindi pwedeng from one exchange to another exchange kaya medyo limitado din pala ang pag gamit dahil madalas ibang exchange ang ka transact ko.but thanks nga kay kabayan dahil mas detalyado at madaling sundin ang ginawa nyang thread, ma try nga agad to .Oo kabayan, same exchange to exchange lang yan puwede at hindi puwede exchange 1 to exchange 2 dahil magkaiba na yun at magiging normal na transaction nalang ang mangyayari. Kaya sa mga nagtitipid pa rin sa fee kahit na medyo mababa na ngayon, puwede pa rin itong option. Pero kung hindi naman na masyadong malaki ang fee, puwede na ulit at balik na normal na transactions na ginagawa natin.Nakakatuwa na makapagbahagi ng kaalaman dito lalo na dito lang din ako natututo ng maraming bagay pagdating sa kalakaran sa crypto at kung ano ano pa. Tama yun na same exchange lang siya working dahil ang pangunahing hinihingi sa pagsesendan ng pera sa Pay ay ang binanceID at valid email ng binance user. Malaking tulong ito kasi hindi na kailangan magsend through withdrawal na nakakakonsumo pa ng withdrawal fee. Wala nang magtatalo kung sino ang sasagot ng withdrawal fee between receiver and sender sa ganitong sitwasyon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "December 05, 2023, 10:04:06 AM",
      "body": "I have finally tried to use this feature of Binance.Bale may kailangan akong bayaran worth $23 at naalala ko itong thread na ito. Following the steps then totoo nga na walang fee or kaltas sa ipapadalang payment sa other binance user. Sayang lang may ilang buwan nalang para magamit ang Binance hindi ko man lang nasulit itong Pay na ito. Pero ayos na din dahil nakatipid sa transaction fee at instant pa ang transfer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angrybirdy",
      "created_time": "December 05, 2023, 10:32:34 AM",
      "body": "Quote from: LesterD on December 01, 2023, 12:56:48 PMQuote from: bhadz on November 29, 2023, 02:34:14 PMQuote from: kotajikikox on November 28, 2023, 11:58:11 PMQuote from: bhadz on November 27, 2023, 01:53:08 PMOff chain transaction yung tawag sa ganyan at kalimitan halos lahat ng exchanges puwedeng gawin ito. Maganda ito kung need mo din ng pera tapos sa kakilala mo nalang isesend yung payment mo o payment niya. Sa coins.ph puwede din itong gawin, magandang ideya nga yan para sa mga gusto magtipid pero dapat mapagkakatiwalaan lang yung katrade mo o sesendan mo ng transaction gamit ang binance pay. Salamat kabayan sa pagshare. Isang paraan nga ito para makatakas sa medyo mataas taas na fee at gustong magtipid.So eto pala  ang off chain transaction na tinatawag hehehe, madalas ko naririnig to sa labas ng local pero hindi ko masyado iniintindi since rare occasion lang naman ang mga ganitong congestion kaya di ako masyado concern sa transaction fees ,Ngayon alam mo na kabayan, hehe. Natutunan ko lang din yan dito sa forum sa mga magagaling nating mga forumers at mga ibang kababayan na alam din ang tawag dito. Quote from: kotajikikox on November 28, 2023, 11:58:11 PMbut now since talagang mahigpit ang pangangailangan ko sa pagbabawas ng fees tingin ko eh magagamit ko na tong feature kaso same exchange lang pala dapat to hindi pwedeng from one exchange to another exchange kaya medyo limitado din pala ang pag gamit dahil madalas ibang exchange ang ka transact ko.but thanks nga kay kabayan dahil mas detalyado at madaling sundin ang ginawa nyang thread, ma try nga agad to .Oo kabayan, same exchange to exchange lang yan puwede at hindi puwede exchange 1 to exchange 2 dahil magkaiba na yun at magiging normal na transaction nalang ang mangyayari. Kaya sa mga nagtitipid pa rin sa fee kahit na medyo mababa na ngayon, puwede pa rin itong option. Pero kung hindi naman na masyadong malaki ang fee, puwede na ulit at balik na normal na transactions na ginagawa natin.Nakakatuwa na makapagbahagi ng kaalaman dito lalo na dito lang din ako natututo ng maraming bagay pagdating sa kalakaran sa crypto at kung ano ano pa. Tama yun na same exchange lang siya working dahil ang pangunahing hinihingi sa pagsesendan ng pera sa Pay ay ang binanceID at valid email ng binance user. Malaking tulong ito kasi hindi na kailangan magsend through withdrawal na nakakakonsumo pa ng withdrawal fee. Wala nang magtatalo kung sino ang sasagot ng withdrawal fee between receiver and sender sa ganitong sitwasyon. Tama, Maganda nga dito sa forum na may ganito kasi halos lahat tayo natututo at nagkakaroon ng idea lalo na sa mga bagong labas na info at balita about sa crypto. Maganda itong binance funding kasi wala na talagang fee kapag nag sesend, kaso nga lang parang limited time nalang natin sya magagamit dahil alam naman natin kung anong issue ng binance ngayon sa bansa, Hopefully maayos na before this year ends para hindi na magkaroon ng malaking adjustments yung mga user at magamit pa natin ng matagal itong binance funding feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}