{
  "id": "topic_5402104",
  "title": "hmel",
  "author": "hmel",
  "created_time": "June 10, 2022, 04:36:23 PM",
  "content": "Hi guys. Not sure if it's accepted to write in English in this subforum, so please excuse me in advance.I wanted to know which banks are crypto friendly in Spain. Where should I open a bank account that will not cause me problems with transfers to/from crypto exchanges. Primarily Kraken.Are there any problems with regards to AML, etc... Say I want to buy a house and I sell some BTC on kraken and wire them to my Spanish bank account. Do you foresee any problems? What other options can you recommend?Thanks in advance!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402104",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "June 10, 2022, 05:05:36 PM",
      "body": "Los posts en los foros locales deberían ir en el idioma local, y generalmente son eliminados de no serlo. No obstante, el tema planteado es interesante y local, y por mi parte, intentaré responder.Realmente no estoy familiarizado con la situación actual en función de cada banco, pero si intentamos echarle un vistazo no hace demasiado tiempo en este hilo:Mover dinero entre bancos y exchangesVimos que parecía haber una falta general de información, y que podíamos encontrarnos con casos de personas a las cuales les bloquearon la cuenta tras interactuar con un Exchange determinado. También había casos de gente sin problemas, por lo que no pudimos concluir pares <Exchange, banco> libres de problemas. Probablemente, también dependa de un amplio abanico de aspectos adicionales que valoran, los cuales desconocemos. AML es una práctica segura.Comprar una cada supone un desembolso decente, por lo que seguro que los importes movidos hacen saltar alguna alerta que otra. Si todo es plenamente justificable, quizás lo mejor sería ser transparentes con el banco, y pedirles asesoramiento para poder hacer la operación con los menos problemas posibles.Nota: Sería mejor aunque sea usar Google Translate para redactor en Español, con el fin de cumplir con las normas del foro, aunque sea más complicado mantener una conversación así.Posts on a local board should essentially be in the local language, and otherwise generally end-up getting deleted. Nevertheless, the topic is interesting and local, so I’ll try to provide the little info I can on the matter.I’m not really too acquainted with the current situation on a bank basis, but we did try to figure it out not that long ago on this thread:Moving money between banks and ExchangesWe found that there was a general lack of information and some people do complain that their accounts were blocked after interacting with a given Exchange. There were also people that were ok, so there seemed to be no specific set of <Exchange,Bank> combinations that we could conclude as problem free. Likely it depends on a wide range of factors they evaluate, which we are oblivious to. AML is a sure thing.Buying a house would entail a decent amount of money, so therefore likely a bunch of alerts will be triggered. If all is clearly justifiable, perhaps the best cause of action would be to talk to the bank themselves, being transparent, and expecting their assessment for a smoother landing. Note: It would be better to Google Translate into Spanish for the sake of complying with the rules, although it may make the conversation a bit more sturdy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "womanderful",
      "created_time": "June 11, 2022, 07:00:13 AM",
      "body": "Quote from: hmel on June 10, 2022, 04:36:23 PMI wanted to know which banks are crypto friendly in Spain. Where should I open a bank account that will not cause me problems with transfers to/from crypto exchanges. Primarily Kraken.Are there any problems with regards to AML, etc... Say I want to buy a house and I sell some BTC on kraken and wire them to my Spanish bank account. Do you foresee any problems? What other options can you recommend?It's hit and miss, just like with phone carriers. You can only try your luck and see what happens.In case of kyc requirements, be prepared to reveal the identity of the sellers of the house.Edit: oh FWIW when I opened an account at Bankinter, I filled a form including a question \"Where will the funds for your first deposit come from?\" and among the options there's a nice checkbox \"[ ] Cryptocurrency\" there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vane91",
      "created_time": "June 13, 2022, 12:34:07 AM",
      "body": "the problem is not the banks. openbank works fine. the problem is you will have to pay taxes if resident in spain. and the bank may ask where the money came from. but fine for small amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "June 17, 2022, 10:55:54 AM",
      "body": "Esto no es un consejo, sino más bien un apunte sobre una noticia que he visto esta mañana, que puede (o no) facilitar las cosas para aquellos que quieren usar sus criptomonedas para comprar una vivienda.Cuento menos, uno podría explorar lo que ofrecen, a fin de dialogar acerca de todas las dudas que pudiesen surgir en lo relativo a este medio de pago, con gente del sector:https://es.beincrypto.com/sol-grupo-bit2me-facilitaran-operaciones-inmobiliarias-criptomonedas-espana/https://www.elsolgrupo.com/el-sol-crypto/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "womanderful",
      "created_time": "June 20, 2022, 07:33:39 AM",
      "body": "Quote from: DdmrDdmr on June 17, 2022, 10:55:54 AMhttps://es.beincrypto.com/sol-grupo-bit2me-facilitaran-operaciones-inmobiliarias-criptomonedas-espana/A bit2me los miré yo hace un año y medio. Como esa noticia es la típica que usa verbos en tiempo futuro (\"los clientes podrán\", \"bit2me ofrecerá\"), voy a hacer como que no la he leído.Tienen como una red de inmobiliarias en caso de que queramos vender inmuebles. Entiendo que no puedes anunciarlo en idealista sino que tienes que ir mediante alguna de esas agencias.Para comprar inmuebles, bit2me no ayuda con la búsqueda, la casa la tiene que buscar uno (o así era hace año y medio). Luego, si el vendedor acepta bitcoin, supongo que bit2me haría las veces de intermediario de confianza. Si el vendedor acepta fiat, bit2me hace de exchange normal y corriente (vendes btc, mandas el fiat a tu banco y luego haces la danza normal del cheque bancario y vas a la notaría con el cheque).Vamos, que lo que es bit2me+inmo, solo es por si quieres vender casa. Para comprar, bit2me ofrece servicios normalitos que también sirven para comprar un chicle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}