{
  "id": "topic_5399914",
  "title": "LeGaulois",
  "author": "LeGaulois",
  "created_time": "May 23, 2022, 10:33:25 PM",
  "content": "hi german neighbors I'm looking for someone from Germany who can guide me a bit.As you know, in your country the citizens don't have a tax to pay on capital gains if the person owns the coin for at least 365 days.The Bundesministerium der Finanzen (Ministry of Finance?) confirmed it again a few days ago. According to this PDF, I found.https://www.bundesfinanzministerium.de/Content/DE/Downloads/BMF_Schreiben/Steuerarten/Einkommensteuer/2022-05-09-einzelfragen-zur-ertragsteuerrechtlichen-behandlung-von-virtuellen-waehrungen-und-von-sonstigen-token.pdf?__blob=publicationFile&v=1The language barrier is a big problem (as I don't speak German) and a translator gives me too much non-sense.- Can you be more specific if that also includes: masternode, stacking, lending...- Does it also apply to a company? Let's say a company has its own activity (selling shoes) but also invests in the crypto sphere. Whatever if it's to 'hodl' 365 days, masternodes, and other ways.- In my country, the citizens need to report every year each account they have with exchange platforms (even closed accounts). Do you have something like such there?- What document do you provide to prove that you bought the coins 365 days ago?tyvm.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399914",
  "comments": [
    {
      "author": "HeRetiK",
      "created_time": "May 31, 2022, 11:34:13 AM",
      "body": "Not from Germany but close by, so I should be able to give you at least partial answers:Quote from: LeGaulois on May 23, 2022, 10:33:25 PM- Can you be more specific if that also includes: masternode, stacking, lending...The way staking, lending, etc. gains are being taxed has been a contentious matter over the years (supposedly it was unclear whether the 1 year holding timeframe would apply for coins used in staking and lending or whether the timeframe would be 10 years in this case) but as it stands the situation seems to be as follows: No tax on value appreciation after 1 year of holding; however the staking profits themselves get taxed as income, similar to mining (since that would make the taxation rate of mining, staking, lending, etc. the same I don't think there's a practical difference). Where it gets complicated is that the staking / lending profits are EUR-based so to determine your taxation correctly you need to keep track of the EUR-value of every single staking / lending payout you receive, which may cause you to pay taxes on unrealized gains. After that you then also need to pay taxes on any gains gained by appreciation of your coins, unless of course you hold them for at least 1 year.Quote from: LeGaulois on May 23, 2022, 10:33:25 PM- Does it also apply to a company? Let's say a company has its own activity (selling shoes) but also invests in the crypto sphere. Whatever if it's to 'hodl' 365 days, masternodes, and other ways.Tax-free gains after the 1 year holding period don't apply for companies. If the coins are part of company holdings, realized gains will be taxed regardless of the holding period.Quote from: LeGaulois on May 23, 2022, 10:33:25 PM- In my country, the citizens need to report every year each account they have with exchange platforms (even closed accounts). Do you have something like such there?I've never heard of anything like this from the German Bitcointalk members, but I'm not sure to be honest.Quote from: LeGaulois on May 23, 2022, 10:33:25 PM- What document do you provide to prove that you bought the coins 365 days ago?In theory it should be sufficient to just provide your on-chain information. In practice one can run into a problem of technical ineptitude depending on which clerk is handling your case, with multiple back-and-forths required until the matter is settled. In the end on-chain information should be enough though (although it's definitely a good idea to also have records of your exchange trades and transactions, which some banks might even require once you get onto their radar for handling cryptocurrencies).For reference, in case you haven't seen it, here's the German Tax thread:https://bitcointalk.org/index.php?topic=1976285.3340",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tanija",
      "created_time": "June 08, 2022, 03:00:38 PM",
      "body": "I would like to chip in with my questions, as they are about the same topic:I'm contemplating moving to Germany as the crypto taxation regime is really favorable, but I would like to check some things.Lets assume I become tax resident by living in Germany and I'm cashing out crypto that I own longer than one year. 1.) Am I required to file tax return if there is no other income? Meaning I fill in the tax return, file it and pay zero tax or I don't have to file?2.) What are the consequences for other payments? For example the compulsary health insurance. Is my health insurance monthly cost calculated from the amout I cash out?If there is someone who did this, please let us know how it went",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "June 08, 2022, 03:42:43 PM",
      "body": "Quote from: tanija on June 08, 2022, 03:00:38 PMLets assume I become tax resident by living in Germany and I'm cashing out crypto that I own longer than one year. 1.) Am I required to file tax return if there is no other income? Meaning I fill in the tax return, file it and pay zero tax or I don't have to file?If there's no taxable income you don't have to file a tax return (Steuererklärung); unless explicitely requested to do so by the Finanzamt.If you're required to file a tax return for your other income, there's no need to mention crypto gains that have been held for longer than a year (from what I've gathered from the German Bitcointalk members there wouldn't even be a field to enter income that isn't tax relevant because it's... well, not tax relevant)Quote from: tanija on June 08, 2022, 03:00:38 PM2.) What are the consequences for other payments? For example the compulsary health insurance. Is my health insurance monthly cost calculated from the amout I cash out?If there is someone who did this, please let us know how it went I think the amount you have to pay for health insurance depends on your taxable income and since non-taxable gains are not part of your taxable income they should have no impact on your insurance cost. However Germany's health care system works quite different from where I live so it's more of an educated guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}