{
  "id": "topic_5453083",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "May 17, 2023, 01:01:05 PM",
  "content": "Ontem tive uma conversa com um dos fundadores do projeto da Praia Bitcoin, que já conversamos aqui sobre. Algumas coisas super legais que queria compartilhar com vocês. 1. Rolante, no Rio Grande do Sul é considerada a ''cidade mais Bitcoiner do Brasil''. Eu nunca tinha ouvido falar, mas eles tem quase 100 estabelecimentos na cidade que aceitam Bitcoin e a cidade tem 21 mil habitantes só, então é realmente algo expressivo em termos pelo menos de conhecimento. Não tenho ideia de valor movimentado. 2. O projeto da praia tem essa iniciativa de Frutas por 1 centavo, que são pagas em Bitcoin na Lighthing e eles buscam incentivar um ''comercio circular'', onde ajudam um comercio e os fornecedores do comercio a aceitarem Bitcoin, de forma que seja realmente usada como moeda de troca. 3. Eles também criaram um POS com LN nativa para facilitar para os comerciantes, em Jeri tem 30 já operacionais e querem levar 100 até o final do ano. E eles estão criando e estruturando a empresa em El Salvador. Fiquei bem feliz com a conversa, porque mostra um nivel de desenvolvimento prático pra adoção que acho realmente importante.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453083",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "May 17, 2023, 01:23:50 PM",
      "body": "Realmente era interessante termos uma ideia dos valores movimentados, pois isso iria permitir termos uma ideia da aceitação da comunidade e essa forma de pagamento.Eles tem algum site, que liste o tipo de negócios que aceitam bitcoin? Seria algo interessante terem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "May 17, 2023, 02:12:19 PM",
      "body": "Que legal, essa é uma coisa que não tinha ouvido falar, em nenhum site de notícia / twitter etc.Coisas que só o fórum proporciona  Eu estava pensando sobre a LN esses dias, e acho que o crescimento e uso dela vai vir mesmo do uso pessoalmente, como esse, e projetos como esse de incentivar o uso, é muito louvável.Até hoje eu nunca me deparei com um comércio com pagamento na LN.Uma das maiores barreiras que precisam ser derrubadas é as pessoas entenderem o BTC como liberdade financeira, porque se você colocar um pagamento em BTC para um comerciante, e ele receber 100 reais em BTC hoje, e amanhã esses BTC valerem 90 reais é muito difícil de explicar e ser aceito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "May 17, 2023, 04:42:49 PM",
      "body": "Recentemente estive bem próximo da cidade de Rolante, na época ainda não sabia dessa hiperbitcoinização que está ocorrendo por lá, pois seria um motivo a mais para visitar a cidade já que ela tem umas trilhas e cachoeiras bem legais.Quote from: rdluffy on May 17, 2023, 02:12:19 PMQue legal, essa é uma coisa que não tinha ouvido falar, em nenhum site de notícia / twitter etc.Coisas que só o fórum proporciona  Dá uma olhada nesse post do twitter que achei e me surpreendeu bastante, tem até supermercado aceitando pagamento em btc:https://twitter.com/bitcoineaqui/status/1653792466946912256",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 17, 2023, 06:32:32 PM",
      "body": "Quote from: rdluffy on May 17, 2023, 02:12:19 PMUma das maiores barreiras que precisam ser derrubadas é as pessoas entenderem o BTC como liberdade financeira, porque se você colocar um pagamento em BTC para um comerciante, e ele receber 100 reais em BTC hoje, e amanhã esses BTC valerem 90 reais é muito difícil de explicar e ser aceito.Só vais deixar de sentir isso, quando todo o circuito de um produto é pago em BTC. Então ai essa questão cambial deixa de ser uma questão.Logicamente, eu sei que isso será muito difícil de se alcançar nas próximas décadas, mas quem sabe um dia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "guid8",
      "created_time": "May 18, 2023, 05:50:21 PM",
      "body": "É incrível ver como a adoção do Bitcoin está se expandindo e encontrando seu lugar em diferentes partes do Brasil.Estamos caminhando para um futuro em que as criptomoedas se tornarão uma parte cada vez mais integrada do nosso cotidiano. Vamos torcer para que mais projetos como o da Praia Bitcoin e de Rolante surjam e continuem impulsionando essa evolução!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 18, 2023, 07:24:07 PM",
      "body": "Quote from: rdluffy on May 17, 2023, 02:12:19 PMQue legal, essa é uma coisa que não tinha ouvido falar, em nenhum site de notícia / twitter etc.Coisas que só o fórum proporciona  Eu estava pensando sobre a LN esses dias, e acho que o crescimento e uso dela vai vir mesmo do uso pessoalmente, como esse, e projetos como esse de incentivar o uso, é muito louvável.Até hoje eu nunca me deparei com um comércio com pagamento na LN..Galera de notícias não gosta de acontecimentos e fatos muito fundamentalistas, precisam alimentar a necessidade incessante doa investidores de notícias bombásticas todo tempo. Mas sem dúvida em negócios locais é onde a Lan encontra seu terreno mais fértil. Se eu já preciso fazer aquela compra todos os dias, faz super super sentido que eu possa fazer com BTC e LN. Em qualquer atividade não muito recorrente Acho que o incentivo é bem menor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeneralTulsa",
      "created_time": "May 20, 2023, 01:41:08 AM",
      "body": "Quote from: Disruptivas on May 17, 2023, 01:01:05 PMOntem tive uma conversa com um dos fundadores do projeto da Praia Bitcoin, que já conversamos aqui sobre. Algumas coisas super legais que queria compartilhar com vocês. 1. Rolante, no Rio Grande do Sul é considerada a ''cidade mais Bitcoiner do Brasil''. Eu nunca tinha ouvido falar, mas eles tem quase 100 estabelecimentos na cidade que aceitam Bitcoin e a cidade tem 21 mil habitantes só, então é realmente algo expressivo em termos pelo menos de conhecimento. Não tenho ideia de valor movimentado. 2. O projeto da praia tem essa iniciativa de Frutas por 1 centavo, que são pagas em Bitcoin na Lighthing e eles buscam incentivar um ''comercio circular'', onde ajudam um comercio e os fornecedores do comercio a aceitarem Bitcoin, de forma que seja realmente usada como moeda de troca. 3. Eles também criaram um POS com LN nativa para facilitar para os comerciantes, em Jeri tem 30 já operacionais e querem levar 100 até o final do ano. E eles estão criando e estruturando a empresa em El Salvador. Fiquei bem feliz com a conversa, porque mostra um nivel de desenvolvimento prático pra adoção que acho realmente importante. Fiquei interessado, como funciona esse POS atrelado a LN? Qual o nome? Tenho interesse em colocar no meu estabelecimento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 20, 2023, 05:27:51 PM",
      "body": "Quote from: GeneralTulsa on May 20, 2023, 01:41:08 AMFiquei interessado, como funciona esse POS atrelado a LN? Qual o nome? Tenho interesse em colocar no meu estabelecimento.O pessoal do projeto '' Praia Bitcoin '' ou também ''Palavra de Satoshi'', se tu tiver instagram, dá pra mandar msg em algum desses dois perfis:https://www.instagram.com/bitcoinbeachbrhttps://www.instagram.com/palavradesatoshi/Aqui tem uma foto se tu quiser ver: https://www.instagram.com/p/CrbncRYJJI-/?hl=enNo site deles https://apoie.praiabitcoin.org/ também tem o número do whats: +55 (88) 99988-5652Ele tinha me dito que cada máquina custava 350.000 sats (o Vinicius faz bastante o esforço de contabilizar tudo em sats, é bem legal de ver) , mas sei que lá em Jericoacoara eles fazem no sistema em que as máquinas são só emprestadas. Mas ai tu também pode configurar seu próprio node e quem sabe fazer com que as taxas fiquem com o seu proprio negócio ao invés de algum intermediario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "May 20, 2023, 05:37:24 PM",
      "body": "Quote from: Disruptivas on May 17, 2023, 01:01:05 PM1. Rolante, no Rio Grande do Sul é considerada a ''cidade mais Bitcoiner do Brasil''. Eu nunca tinha ouvido falar, mas eles tem quase 100 estabelecimentos na cidade que aceitam Bitcoin e a cidade tem 21 mil habitantes só, então é realmente algo expressivo em termos pelo menos de conhecimento. Não tenho ideia de valor movimentado. Caraca meu, para uma cidadezinha dessas isso é uma mobilização e tanto do comércio.Me ficou a dúvida de quem é que teve a ideia de começar isso... se é a algo que surgiu de alguém já com bastante grana e houve algum incentivo ou se foi algo pequeno mesmo que se alastrou por amor.De toda forma, eu também não sabia disso em Rolante (nem conhecia a cidade) e duvido que muita gente sabe.Exemplos assim deveriam ser mais divulgados, principalmente em sites que são desse meio, de forma a incentivar o turismo nessa cidade e fazer com que o negócio cresça e se expanda.Meu único medo é quando isso incomodar alguém poderoso",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 20, 2023, 07:33:16 PM",
      "body": "Quote from: alegotardo on May 20, 2023, 05:37:24 PMMeu único medo é quando isso incomodar alguém poderoso Se o poderoso também gostar de bitcoin e ainda ganhar um \"extra\" por apoiar esse tipo de negocio. Tudo vai correr bem. Desde que no final todos pagarem os seus impostos, e fazer as declarações certinhas, não deve haver problemas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 21, 2023, 11:02:10 AM",
      "body": "Quote from: alegotardo on May 20, 2023, 05:37:24 PMCaraca meu, para uma cidadezinha dessas isso é uma mobilização e tanto do comércio.Me ficou a dúvida de quem é que teve a ideia de começar isso... se é a algo que surgiu de alguém já com bastante grana e houve algum incentivo ou se foi algo pequeno mesmo que se alastrou por amor.Meu único medo é quando isso incomodar alguém poderoso Eu conheço outra história de adoção local, agora não me lembro onde, mas era no Nordeste há alguns anos atrás. Também lembro que em SP em 2018 tinha algumas iniciativas. Que eu me lembre, a do Nordeste não era uma empresa e a de SP era uma empresa de Gateway de pagamento por trás. Mas mesmo tendo incentivo ou não, sinto que grande parte da real motivação de quem atua no front - ajudando os estabelecimentos a aceitarem - é por amor mesmo. Mesmo o exemplo da praia Bitcoin, que também estão estruturando uma empresa, os caras são completamente apaixonados por Bitcoin. E por serem apaixonados, fizeram uma empresa. Não o inverso. Sobre os poderosos, acho que por enquanto tá longe de ser um problema. Mas nunca se sabe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 21, 2023, 11:44:26 AM",
      "body": "Quote from: Disruptivas on May 21, 2023, 11:02:10 AMMesmo o exemplo da praia Bitcoin, que também estão estruturando uma empresa, os caras são completamente apaixonados por Bitcoin. E por serem apaixonados, fizeram uma empresa. Não o inverso. Apesar do Bitcoin apelar muito a pessoa fazer tudo por ela mesma e conseguir assim ter um total controlo sobre o seu dinheiro e sistemas que utiliza, temos de ser realistas e perceber que para a grande maioria das pessoas isso não será fácil.Por isso, sou da opinião que o caminho passa um pouco por empresas fazer tipo um kit chave na mão, para os comerciantes alinharem na ideia. Mas, defendo que esse kit chave na mão, permita que a pessoa tenha o controlo total da sua wallet sendo ela a única titular da seed de acesso. Ou seja, a empresa coloca tudo a funcionar, e depois a pessoa só tem de criar uma carteira e indicar os endereços para onde vai o bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 02, 2023, 08:42:06 PM",
      "body": "Agora Rolante recebeu o titulo de cidade com mais estabelecimentos que aceitam bitcoin do mundo, com 108 estabelecimentos que recebem pagamento em btc contra 21 da bitcoin beach em El Salvador por exemplo. Inclusive o projeto Bitcoin Beach Brazil tambem tem mais estabelecimentos que o de El Salvador com 28 estabelecimentos. Bem interessante ver o Brasil no topo dessa lista:https://btcmap.org/communities/leaderboardFonte: Cidade brasileira é destaque mundial na adoção de Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 02, 2023, 08:52:58 PM",
      "body": "Quote from: tg88 on June 02, 2023, 08:42:06 PMAgora Rolante recebeu o titulo de cidade com mais estabelecimentos que aceitam bitcoin do mundo, com 108 estabelecimentos que recebem pagamento em btc contra 21 da bitcoin beach em El Salvador por exemplo. Inclusive o projeto Bitcoin Beach Brazil tambem tem mais estabelecimentos que o de El Salvador com 28 estabelecimentos. Bem interessante ver o Brasil no topo dessa lista:https://btcmap.org/communities/leaderboardFonte: Cidade brasileira é destaque mundial na adoção de BitcoinVi que a imagem andou a circular pelo Twitter. E super surpeendente considerando o tamanho das cidades destaque. Acho que é uma versão fractal da questão da adoção ser maior em paises ''menos desenvolvimentos''. Não são também, dentro dos proprios paises com maior adoção, as grandes cidades o destaque. São as pequenas cidades, com economias mais condesadas, onde é mais fácil falar com alguém e convencer o seu vizinho de algo que a adoçao é destaque.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 02, 2023, 10:53:34 PM",
      "body": "Quote from: tg88 on June 02, 2023, 08:42:06 PMAgora Rolante recebeu o titulo de cidade com mais estabelecimentos que aceitam bitcoin do mundo, com 108 estabelecimentos que recebem pagamento em btc contra 21 da bitcoin beach em El Salvador por exemplo. Inclusive o projeto Bitcoin Beach Brazil tambem tem mais estabelecimentos que o de El Salvador com 28 estabelecimentos. Bem interessante ver o Brasil no topo dessa lista:Bem interessante mesmo. Parabéns.Consegue-se já ter uma noção de como está aceitação dos clientes? Volume de negocio em fiat vs bitcoin.Quote from: Disruptivas on June 02, 2023, 08:52:58 PMVi que a imagem andou a circular pelo Twitter. E super surpeendente considerando o tamanho das cidades destaque. Acho que é uma versão fractal da questão da adoção ser maior em paises ''menos desenvolvimentos''. Não são também, dentro dos proprios paises com maior adoção, as grandes cidades o destaque. São as pequenas cidades, com economias mais condesadas, onde é mais fácil falar com alguém e convencer o seu vizinho de algo que a adoçao é destaque. Isso acaba por ir ao encontro do que falamos no outro tópico. Em que os mais desfavorecidos economicamente, acabam por estar mais dispostos a mudança, pela perspetiva de que o amanhã estarão bem melhores. Resta saber se será mesmo assim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 03, 2023, 01:19:15 PM",
      "body": "Quote from: joker_josue on June 02, 2023, 10:53:34 PMConsegue-se já ter uma noção de como está aceitação dos clientes? Volume de negocio em fiat vs bitcoin.Eu tenho visto cada vez mais placas de lugares qeu aceitam bitcoin no Brasil todo.Outro dia estava viajando e vi uma tabacaria com o nome BITCOIN bem grande estampado, maior que o nome da tabacaria. Já vi também postos de gasolina que aceitam no Brasil.Mas ainda acho dificil um frentista de posto de gasolina ou o empregado de um estabelecimento conseguir fazer tudo pra receber sem que o cliente perca tempo... Deve ter que pedir para o gerente ou algo do tipo, dai eu nunca tentei abastecer ou pagar usando bitcoin em nenhum lugar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 03, 2023, 03:05:38 PM",
      "body": "Quote from: bitmover on June 03, 2023, 01:19:15 PMMas ainda acho dificil um frentista de posto de gasolina ou o empregado de um estabelecimento conseguir fazer tudo pra receber sem que o cliente perca tempo... Deve ter que pedir para o gerente ou algo do tipo, dai eu nunca tentei abastecer ou pagar usando bitcoin em nenhum lugar.Ué, como assim fazer tudo sem que o cliente perca tempo? Normalmente - pelo menos na minha experiencia- os lugares que aceitam, tem uma maquininha especifica que usam e é EXATAMENTE a mesma coisa que pagar um PIX. Eles criam um QR, tu lê e pronto - ninguem fica esperando a validação dos 10 minutos- já sai a ''nota fiscal''  na hora que eu envia os sats. Acho que o processo da forma como a maioria dos lugares já fazem ou podem fazer é super rápido, tao rapido como as transações convencionais",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 03, 2023, 03:06:58 PM",
      "body": "Quote from: bitmover on June 03, 2023, 01:19:15 PMMas ainda acho dificil um frentista de posto de gasolina ou o empregado de um estabelecimento conseguir fazer tudo pra receber sem que o cliente perca tempo... Deve ter que pedir para o gerente ou algo do tipo, dai eu nunca tentei abastecer ou pagar usando bitcoin em nenhum lugar.Pois isso é muitas vezes o problema. A falta de formação.As coisas são decididas pelos departamentos comercial ou pela gerência, mas depois não dão a formação adequada para os funcionários serem capaz de lidar com essas decisões.Ainda ontem fui lavar o carro com um cupon , e funcionário andou uns 3-5 minutos de um lado para o outro, a fazer duas ou três chamadas, até conseguir aplicar o desconto. E isto são coisas simples, imagina se no final eu tivesse dito que queria pagar em bitcoin (caso o local aceita-se, o que não era o caso).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "July 26, 2023, 07:32:11 PM",
      "body": "Notícia interessante sobre Rolante!A Fundação Hospitalar de Rolante (FHR) é a primeira instituição de saúde no país a aceitar doação em Bitcoin. O hospital lançou uma campanha para comprar um tomógrafo que custa R$ 1.310.000,00. A campanha aceita doações via Lightning Network.A iniciativa faz parte de um projeto de inovação do hospital chamado Inovar Mais! Genaro Figoli, que também é ex- Secretário de Saúde municipal, adiantou em primeira mão que após a compra do tomógrafo, pacientes que pagarem a tomografia com Bitcoin, terão 50% de desconto.         Pra quem quiser saber mais: https://br.beincrypto.com/hospital-de-rolante-pede-doacao-em-bitcoin-para-comprar-tomografo-cidade-aceita-btc-em-mais-de-140-locais/Rolante também vai sediar um evento bem interessante em setembro, pra quem quiser ir conhecer uma das cidades mais Bitcoiners do mundo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}