{
  "id": "topic_5405021",
  "title": "tokyohd",
  "author": "tokyohd",
  "created_time": "July 03, 2022, 02:45:02 PM",
  "content": "Bitcoin promoters are betting on an eventual recovery that will vindicate their strength of conviction. However, even if the flagship cryptocurrency manages to surge to as high as $100,000 during another bull market, it will still be a failure, according to Nassim Taleb.  The famed mathematician explains that the leading cryptocurrency has failed as a hedge against inflation. In fact, it has actually acted with opposite properties.   As reported by U.Today, Taleb believes that the ongoing cryptocurrency winter may degrade into a full-blown “ice age,” meaning that prices will not recover for a long period of time (if ever). The “Black Swan” author has also taken aim at “bitidiots” like El Salvador President Nayib Bukele who still claim that Bitcoin is cheap in a recent tweet. The self-proclaimed “world’s coolest dictator” continues to gamble away taxpayer money. Earlier this week, Bukele bought another 80 Bitcoins despite the fact that El Salvador, one of the poorest countries in the western hemisphere, had lost more than $50 million because of his ill-timed Bitcoin purchases. Details: https://u.today/bitcoin-will-be-a-failure-even-if-it-hits-100000-says-black-swan-author",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405021",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 03, 2022, 03:05:50 PM",
      "body": "Quote from: https://twitter.com/nntaleb/status/1543133769837826049?s=20&t=4xzcEel1LyydYuqNSzJ5YABitdiots like @bukele still claim bitcoin is \"cheap\".Truth is that EVEN if it rose to 100K, it has failed.Not only did it NOT DELIVER as a hedge ag. inflation, war, etc., but has acted w/opposite properties.Change your mind facing evidence.That is why we need to make a proper research because the so called learned people can be critics and mislead people.Even if I buy bitcoin at $3800 or as high as $7000 in 2020, the price is still at $19000 presently, not yet dropped below $10000. Is that not an hedger against inflation? How about buying before 2020 at lower price, it is a hedge against inflation.Bitcoin is beyond what can be called having promoters, no one that knows the true design of bitcoin that will not buy and encourage people to buy, but the critics are easy to know. Nassim Nicholas Taleb is a bitcoin critic, he is not the first of them that criticized bitcoin and yet there has been more adoption and bitcoin making it to all-time-high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 03, 2022, 03:10:14 PM",
      "body": "That statement does not even look logical at a quick glance.Lets say BTC is $20000 today and by the end of NEXT year it is at $100000 unless everything costs 5x as much due to inflation then it's a good hedge against inflation.If it stays @ $100k until everything costs 5x as it does today it's still close enough.Math it's a thing......Logic is a thing too.....-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "July 03, 2022, 04:47:01 PM",
      "body": "Quote from: tokyohd on July 03, 2022, 02:45:02 PMBitcoin promoters are betting on an eventual recovery that will vindicate their strength of conviction. However, even if the flagship cryptocurrency manages to surge to as high as $100,000 during another bull market, it will still be a failure, according to Nassim Taleb.  The famed mathematician explains that the leading cryptocurrency has failed as a hedge against inflation. In fact, it has actually acted with opposite properties.   As reported by U.Today, Taleb believes that the ongoing cryptocurrency winter may degrade into a full-blown “ice age,” meaning that prices will not recover for a long period of time (if ever). The “Black Swan” author has also taken aim at “bitidiots” like El Salvador President Nayib Bukele who still claim that Bitcoin is cheap in a recent tweet. The self-proclaimed “world’s coolest dictator” continues to gamble away taxpayer money. Earlier this week, Bukele bought another 80 Bitcoins despite the fact that El Salvador, one of the poorest countries in the western hemisphere, had lost more than $50 million because of his ill-timed Bitcoin purchases. Details: https://u.today/bitcoin-will-be-a-failure-even-if-it-hits-100000-says-black-swan-authorWell everyone is right in their own way and entitled to their own opinion. He has said what he knows best as an expert and professional in the making but that does not stop Bitcoin from being the first and Genesis of blockchain. You see I would not be surprised the critics are the Whales tommorow because they are going at causing fud making holders to panic sell at cheaper price for the dear of loosing out while causing dip and the critics would be there in hidden identity buying the dip. That's why I do not take these comments by all these people serious as they know the game they play and what they are upto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "July 03, 2022, 04:56:53 PM",
      "body": "How is BTC a failure when it started with zero and have reached up to $69k during the bullrun and its still going to reach higher in the next cycle. Taleb is just like his fellow Buffet who is an old dog that never learn the new tricks. So out dated they can't manage to understand what his book described as Black Swan. In fact its BTC that is the real Black Swan in this era that is destroying the old Swans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 03, 2022, 05:08:33 PM",
      "body": "If the bitcoin reaches those prices, no one will listen to these analyzes, so there is no point in them, especially at the present time, which everyone knows that it is difficult to reach these levels during the next two years.What he is trying to say is just flattening historical phrases like “Bitcoin is a bubble” “Bitcoin is a Ponzi scheme” “Nobody but drug dealers use Bitcoin” “Only failed states accept Bitcoin.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 03, 2022, 05:13:15 PM",
      "body": "On the contrary, bitcoin will still be a success even if the price of 1 btc hits $1. Bitcoin’s success or failure has nothing to do with its price. It is all about a functioning network. If bitcoin hits $1 tomorrow, the fundamentals will still be there staying like a rock. Marketcap, price … these are useless metrics. Full blocks is what really matters and they are almost always full which means people are lining up to use this elite blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 03, 2022, 05:39:50 PM",
      "body": "if a so called \"mathematician\" is basing his answer on say the ATH or even a mythical number not even reached.. then he is not knowing/using/understanding/seeing all the variables.. thus he is not a great mathematicianhere is the thing the ATH is not the stable zone of value. the value variable is not at the ATHthe value variable is found below the the low of a periodbitcoins value and deflationary numbers are beneath the price speculation. this bitcoin value has been increasing progressively each cycle..2009-2012 ($0.0X-$XX)2013-2016 ($XX-$XXX)2017-2019 ($XXX-$XXXXX)2020-2022 ($XXXX-$XXXXX)the important part is the green numbers per cycleif the only number he see's/understands is the whimsy of speculative PRICE. he is missing the point entirely.but he atleast admits he is a mathematician and not an economist.. after all we all do math so we all are able to be mathematiciansbut hey.. if he does not know that the current price is a correction back to value. then his whole calculation is wrong from the beginning. no one should be thinking the ATH is a store of value/expected stable price.. the ATH are always temporary events of temporary speculation that correct.. its a indicator of the realm that next cycle value can move into. but not a sign of what value is nowthe VALUE of a train ticket is not the highest price you can find. its the cheapest. the highest is the \"premium\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "July 03, 2022, 06:07:14 PM",
      "body": "So what does a “Black Swan” writer care about Bitcoin contributions? simply because he was dubbed a former options trader and risk analyst? what's in it? (I read about it on Wikipedia)Criticized the financial system and proposed the idea of an \"antifragility\" method in which he rejected the resilience of recovering after a downturn. Whereas what he built was trying to restore the economy after the failure. lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 03, 2022, 06:13:21 PM",
      "body": "Any opinion is always welcome, especially when he has a TA, but in this case he exceeds in alternate comments, perhaps to give notoriety to the little influence of his true opinion, I think that this man is looking to start earning a salary as a frequent commentator and receive enemas from the American television companies that pay bonuses to their commentators (consultants).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 03, 2022, 06:18:20 PM",
      "body": "Quote from: CryptSafe on July 03, 2022, 04:47:01 PMWell everyone is right in their own way and entitled to their own opinion. He has said what he knows best as an expert and professional in the making but that does not stop Bitcoin from being the first and Genesis of blockchain. Everyone is entitled to their opinions, but everyone is not right in their own way. There are charts and history which one can take a quick glance at and educate themselves about whatever subject they wish to discuss on.This is not even a logical criticism of Bitcoin in any way.Undervaluing the effect of the market price and how it doesn't matter if it rises, while criticizing the current bear period is counterintuitive",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "July 03, 2022, 06:44:19 PM",
      "body": "So mathematician does agree that bitcoin can reach to 100K USD? Then its completely fine since we can easily profit from that much money per bitcoin. Dude, we are talking about 100K per bitcoin which is huge up liftment of bitcoin. Most importantly to make bitcoin that much worth it will need market in trillions of dollars. The depth would be enormous for it and it would be impossible to take down bitcoin at that level. How could it be failure if it's reaching 100K mark?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "July 03, 2022, 07:26:19 PM",
      "body": "Quote from: Charles-Tim on July 03, 2022, 03:05:50 PMQuote from: https://twitter.com/nntaleb/status/1543133769837826049?s=20&t=4xzcEel1LyydYuqNSzJ5YABitdiots like @bukele still claim bitcoin is \"cheap\".Truth is that EVEN if it rose to 100K, it has failed.Not only did it NOT DELIVER as a hedge ag. inflation, war, etc., but has acted w/opposite properties.Change your mind facing evidence.That is why we need to make a proper research because the so called learned people can be critics and mislead people.I agree, the smarter he is, the more he can make statements that are made to appear to be based on credible research. But behind it all, he just wanted to make noise after noise to make people feel his words were statistical words.I'm not going to take the tweet seriously, it was made as a fishing rod to want to be the center of attention. Despite his thoughts, there was nothing to worry about. After Bitcoin reaches 6 digits, Bukele will mark the tweet before it disappears. Need to save the screenshot for later proof. Bitcoin has always had a way of silencing the mouths of critics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChrisPop",
      "created_time": "July 03, 2022, 07:39:06 PM",
      "body": "It does not matter who said what. Ray Dalio, one of the biggest macro investors confirmed that he personally owns Bitcoin. Bitcoin was not designed to be a hedge against inflation! We keep making this assumption. It could become a hedge against inflation, but for that to happen it probably needs to receive higher adoption. It is legal tender only in a few states for now. People need to fortify their confidence in this asset until it becomes a instrument that protects you against inflation in the short term. Until then the inflation protection is only long-term (as shown by historical returns) and early adopters will reap the rewards like always.It is just an opinion of an author who also was a trader back in the days. Do not confuse writing skills and/or trading experience with knowledge about history, technology and economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "July 03, 2022, 07:44:30 PM",
      "body": "Quote from: cabron on July 03, 2022, 04:56:53 PMHow is BTC a failure when it started with zero and have reached up to $69k during the bullrun and its still going to reach higher in the next cycle. Taleb is just like his fellow Buffet who is an old dog that never learn the new tricks. So out dated they can't manage to understand what his book described as Black Swan. In fact its BTC that is the real Black Swan in this era that is destroying the old Swans.He must be speaking from someone who bought at 69k experience and not From below otherwise his view on this subject would be clearly different. Btc have managed to keep fighting. The problem is not about not knowing but ready to acknowledge the real fact. They always like to say the negative even when the truth is right in front of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 03, 2022, 08:59:50 PM",
      "body": "I pity people who even have time to listen to his trash and even follow him.Just look at his argument. It's totally illogical and probably based on stupid emotions. I am pretty sure he's finding it hard to swallow his words. He probably never expected Bitcoin to even go beyond 20K in the previous bull run.Look at all  this tweets  Quote1. \"View BTC is as a contagious disease. It will spread, spread & its price will rally until saturation, that is ~every sucker stupid enough to buy the story is invested. When all suckers are in, the prevailing belief will make it an 'obvious' investment. That's maximal fragility.\" (January 17)2. \"Almost nothing in financial history has been more fragile than bitcoin.\" (July 3)3. \"Bitcoin has been a magnet for imbeciles.\" (He was blasting critics who accused him of being too rigid in his views about bitcoin, even though he shifted from being excited about its potential to deciding it was worthless in 2020.) (July 30)4. \"Bitcoin may interest some for speculative purposes but anyone who claims that #bitcoin is a hedge against anything, financial or otherwise, is a certified fraud.\" (September 20)5. \"1- Bitcoin is no hedge for adversity 2- Bitcoin is no hedge for inflation 3- Bitcoin is no hedge for deflation 4- Bitcoin is no currency 5- Bitcoin is nothing.\" (December 4)6. \"It is an awkward, clunky & already obsolete product of low interest rates. It should collapse with inflation.\" (December 28)7. \"If after this morning you still think that #BTC is a hedge against world events, or represents 'diversification', you must stay out of finance, & take up some other hobby s.a. stamp collecting, bird watching or something less harmful to yourself & others.\" (November 26)8. \"I am not 'bearish' on #BTC. It is a tulip-bubble (without the aesthetics & disguized as a \"currency\"), hence it is as irrational to buy it as it is to SHORT it, perhaps even more. Gabish?\" (October 21)Source: https://www.msn.com/en-us/money/markets/black-swan-author-nassim-taleb-compared-bitcoin-to-a-disease-called-it-a-speculative-bubble-and-warned-it-was-worthless-here-are-his-8-best-tweets-about-the-crypto/ar-AASTQ31",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 03, 2022, 09:03:14 PM",
      "body": "Quote from: DaveF on July 03, 2022, 03:10:14 PMThat statement does not even look logical at a quick glance.Reads to me like someone jumping on a trend, with how the current market is looking, and the wider issue of a global recession, people will be believing this for a while, and that might increase sales for their books. I wouldn't look at this statement, and expect a sound, logicically approach. It's simply a marketing scheme, which will likely work. Doesn't matter if they're wrong in the long term, people would've already forgot. However, when you look at it short term, people are going to be like; \"they were right!\", and look at his work. Since, it's very probable that if we hit $100k tomorrow, we'd have a price correction not long after that, and then they'd be able to bask in that glory for a little while. To be honest, I'm not overly familiar with their work, but if you're going to make bold predictions at least go into depth on why you think so. Overall, nothing statement which likely has an agenda attached to it. Also, ignore people's titles, mathematician doesn't really make his reasoning any more sound. Judge people on their logic, not their titles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "July 03, 2022, 09:16:30 PM",
      "body": "QuoteThe “Black Swan” author has also taken aim at “bitidiots” like El Salvador President Nayib Bukele who still claim that Bitcoin is cheap in a recent tweet. The self-proclaimed “world’s coolest dictator” continues to gamble away taxpayer money. Earlier this week, Bukele bought another 80 Bitcoins despite the fact that El Salvador, one of the poorest countries in the western hemisphere, had lost more than $50 million because of his ill-timed Bitcoin purchases.Word.He's right about Bukele being an idiot and burning taxpayers' money.He's also right about bitcoin turning into a memestock, just another risk-on asset.In all of this he's missing bitcoin's true potential, and I don't blame him. Given how crypto has become a cesspool of scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 03, 2022, 09:20:12 PM",
      "body": "I'd really like this guy in an argument with someone from the other side because he doesn't make much sense.Inflation in the last few years was at on the average above 3% in most developed countries. In the last 3 years Bitcoin went from a 5k price range to the average of 7k in 2020 and 20k in 2021. Right now it's trading below the average which is why people say that it's cheap, but it still is above the average range from 2019 and 2020, so if you bought between January 2019 and November 2020, you hedged well against inflation. If you bought at 3k in 2019 you're up 600%, if you waited until 10k you're still up 100%. Holding money in the bank would mean a minimum loss of 2% a year so you'd be down 6%. Please explain how it's a failure, Mr. Taleb?Quote from: edgycorner on July 03, 2022, 09:16:30 PMIn all of this he's missing bitcoin's true potential, and I don't blame him. Given how crypto has become a cesspool of scams.Somebody should tell him that crypto is not bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 03, 2022, 09:28:34 PM",
      "body": "Quote from: tokyohd on July 03, 2022, 02:45:02 PMBitcoin promoters are betting on an eventual recovery that will vindicate their strength of conviction. However, even if the flagship cryptocurrency manages to surge to as high as $100,000 during another bull market, it will still be a failure, according to Nassim Taleb.If people like this can have the boldness of coming out in claiming this just to deceive people and discourage them to achieve the height he himself never thought of, i would have love to ask him what has he made out of fiat currency over all these while, now that bitcoin has come to help and cover up the lapses and failures in the traditional system of payment yet many are running to take good positions in it while someone like him will sit down and continue with the fold of hands, discouraging others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}