{
  "id": "topic_5440575",
  "title": "lee dongzhe",
  "author": "lee dongzhe",
  "created_time": "February 20, 2023, 03:23:26 PM",
  "content": "The value of bitcoinPreambleSince the birth of Bitcoin on January 3, 2009, people have had various or even completely opposite views on Bitcoin. The content boils down to whether Bitcoin has value? What is its essential value? This article is about exploring the value of Bitcoin.Chapter 1 The Essence of Bitcoin1. Definition of BitcoinWhat is Bitcoin? Bitcoin is currency.Bitcoin is different from paper money that is usually used. It exists in digital form, so it is called digital currency. Digital currency exists in electronic form, also called electronic currency. Bitcoin is formed by encryption, also called encrypted currency. Bitcoin is in the Internet system. In existence, also known as network currency or virtual currency, Bitcoin is open to all mankind, also known as super-sovereign currency. Although Bitcoin has various names, its essence is currency. It is the digital currency that appeared in the history of currency following natural physical currency, cast metal currency, paper currency, and later. Since Bitcoin is a new digital currency, various countries have different policies and legal definitions of Bitcoin. Some countries regard it as a commodity, some as an asset, some as a virtual currency, and some as a As legal tender, some countries prohibit its use. Bitcoin is a commodity, an asset, and a currency. A commodity is an asset when its value is measured in money. The main function of a commodity is as a medium of commodity exchange, and when it is widely used by people, it is money. Currency is the medium of commodity transaction, and currency serves as the value scale function and the value storage function of the medium. The dollar is both a currency and a commodity. Although special commodities in the form of banknotes such as the US dollar have become mainstream currencies at present, they have higher transaction costs and slower transaction speeds than Bitcoin, and they also cause inflation due to excessive issuance.2. The Design of BitcoinOn October 31, 2008, Satoshi Nakamoto published a paper titled \"Bitcoin: A Peer-to-Peer Electronic Cash System\" on the Internet.In the design of Bitcoin, Satoshi Nakamoto followed the basic principles of currency design - the principle of value truth and the principle of value storage. The principle of value authenticity is that counterfeit currency cannot be used as real currency. This is the first problem that any currency issuing person or organization must guard against. When counterfeit money is rampant, money loses its credibility and cannot be used as a medium for commodity transactions. The store of value principle is that money has the function of storing value. The currency issuing organization cannot artificially dilute the value of the currency to obtain the benefits of making currency. On the issue of the true principle of currency value, Satoshi Nakamoto believes that the existing digital signature technology has solved the problem of counterfeiting digital currency, but has not solved the double payment problem of digital currency. The double payment problem is that, in commodity transactions on the Internet, a currency stock that uses two or more payments is a special form of counterfeit currency. Although the double-spending problem can be solved through a third-party financial service institution, there is no guarantee that the third-party financial institution does not violate the principle of store of value. Therefore, Satoshi Nakamoto believes that it only makes sense to solve the double-spending problem on a peer-to-peer basis, that is, under the premise of decentralization.Satoshi Nakamoto, through digital signature, hash encryption, time stamp, proof of work, etc. creatively used the technical achievements of predecessors to solve the double payment problem in the point-to-point state of digital currency. Since then, a digital currency based on the principle of value truth and value storage, Bitcoin, was born.3. Issuance of BitcoinBy running the Bitcoin open source software, after the birth of the genesis block, a blockchain is generated about every ten minutes. Each blockchain is a Bitcoin transaction record in units of about 10 minutes, and about 210,000 blocks are generated in four years. blockchain. For every 210,000 blockchains generated, the output of Bitcoin is halved. The first 210,000 blockchains, each blockchain, reward 50 bitcoins, a total of 10.5 million bitcoins are generated in four years, the second 210,000 blockchains, each blockchain, reward 25 A total of 5.25 million bitcoins will be generated in four years, and so on, about 21 million bitcoins will be generated by 2140. 21 million bitcoins are the pre-agreed total amount of bitcoins to be issued, and the incentives for future public transaction records are run by handling fees. At present, 741,123 blockchains have been generated (Jun17, 2022, 4:01AMUTC), and 19,069,752 bitcoins have been issued, accounting for about 90% of the total issuance. Unlike paper money that is issued at any time, Bitcoin is the first currency to be issued in total. Not only is the total amount of issuance stipulated, but the issuance process runs according to the procedure of halving every four years. This means that for the first time in the history of currency, a contract currency was born. The agreed currency refers to the currency for which the total amount of issuance and the issuance process are agreed.4. Bitcoin performanceCompared with paper money, Bitcoin has faster transaction speed, lower transaction cost and safer transaction. The significant improvement in the transaction performance of currency brings huge economic benefits to the society. The transfer of paper currency to digital currency is a natural trend in the evolution of currency performance.5. Bitcoin’s systemBanknotes, credit cards, debit cards, card-type electronic cash, etc. are all run on the bank's banknote system. Internet transactions independent of the banking system have not yet been established. Bitcoin is a digital currency system that exists independently of the banking system. Bitcoin was the first peer-to-peer internet currency. It is the result of the evolution of Internet commodity trading. On May 22, 2010, Bitcoin traded with pizza. Although 10,000 bitcoins are only exchanged for two pizzas, this is the first time that bitcoins have come from the Internet to the physical world and exchanged with real objects. More and more physical objects are transacting with Bitcoin. At the same time, Bitcoin is currently traded with the vast majority of legal currencies in the world, 24 hours a day. The birth of Bitcoin means the birth of a new monetary system. It is not only a force to transform the traditional financial system, but also a value cornerstone for building a digital space.Chapter 2 The Value of Bitcoin1. Additional currency issuanceIt is difficult for human beings to resist the temptation to use additional currency to obtain wealth. Historians explained that the demise of the Western Roman Empire was related to the constant mixing of cheap metals such as copper and lead into gold coins to dilute the purity of gold. This act directly violated the interests of the soldiers and weakened their combat effectiveness. In the UK, when precious metals were used as currency, the devaluation of currency also occurred, and the worn and sheared currency with insufficient value entered the circulation field, and Gresham's Law said that bad money drives out good money. In 1717, Newton set the price of gold at 3 pounds 17 shillings and 10.5 pence per ounce (purity of 0.9), which laid the foundation for the gold standard system in Britain and the world. , the British economy was in trouble, forcing Britain to end the gold standard in 1931. The Bretton Woods system established in 1944 replaced the pound with the dollar as the world's central currency, the dollar was pegged to gold, and the currencies of other countries were pegged to the dollar. At that time, 35 US dollars could be exchanged for one ounce of gold. Later, due to the large amount of currency issued by the United States, 35 US dollars could not be exchanged for gold. On August 15, 1971, the Nixon administration suddenly announced that it would abandon the peg between the US dollar and gold, thus entering the ancient and greedy track of boldly issuing currency. History has once again proved that currency issuing organizations cannot resist the temptation to quickly obtain wealth by issuing additional currency. This is the power of greed that human society has a hard time navigating. Jesus' dispersal of money changers in the Temple in Jerusalem did not change people's greed for money. Additional currency is the second form of taxation. It is more insidious and far-reaching than taxes. Taxation is obtained by the tax collector from the taxed person, and there is resistance and resistance from the taxed person. It requires the tax collector to spend time and labor, but additional money is issued. As long as the currency issuing organization prints the currency, it can obtain benefits without resistance. It also doesn't require a lot of time and labor. Now the issuance of currency is generally called inflation, and people have become accustomed to chronic inflation. While there is a vague sense that money is slowly losing value, there is no time and energy to explore the secrets behind it. People accept the depreciation of the value of money as a fact. Few people actually face it. But in this world, there are always honest and righteous souls. Hayek confronted it, he believed that the government monopoly on issuing money, issuing more money, and diluting money was stealing. Satoshi Nakamoto faced it and came up with a solution - Bitcoin. In Bitcoin's genesis block, he wrote the headline in The Times of the day, \"The Chancellor on the Brink of a Second Bank Bailout\". (EThe Times 03/Jan/2009 Chancellor on brink of second bailout for banks) This plan will not only change the history of money, it will also affect the process of freedom.2. Credit currencyCurrency is a special commodity developed with the development of commodity trading. Currency valuable currency and credit currency. Value currency refers to the currency that uses its own material value as a medium for commodity transactions, mainly referring to natural physical currency and cast metal currency. Credit currency refers to the currency that uses credit as the medium of commodity transaction, mainly referring to paper currency and digital currency. Although cast metal currency has the advantages of rarity, durability, and divisibility as a value currency, it is not conducive to long-distance, large-scale and safe transactions due to the weight of metal currency itself. Paper money as a credit currency is produced to solve the problems existing in minted metal currency. The first paper currency to appear in the world was Jiaozi, which appeared in Sichuan during the Song Dynasty in China around the 11th century AD. It was born to solve the heavy iron money that is not easy to carry in commodity transactions. In the 16th century, the goldsmith certificate appeared in England, which originated from the gold storage business of goldsmiths. When storing gold, the receipt you receive is the Goldsmith's Voucher. The circulation of goldsmith vouchers becomes paper money. Paper money is a credit currency generated on the basis of metal currency, and is circulated by exchanging metal currency as credit.At first, the amount of paper money as an exchange certificate for metal currency was equal to the amount of metal stored. Later, it was found that some metal currency had always existed in the storage warehouse, so I thought of printing more paper money than the actual metal reserves, and secretly possessed gold and other metal currencies for profit. . Although this act of issuing more banknotes than the actual metal currency reserves has been legally recognized, its essence cannot change the covert theft that dilutes the metal currency and devours the value. This act, like Eve and Adam stealing the forbidden fruit from the tree of knowledge of good and evil, is a step towards greed in economic history. Here lies the secret of credit currency. It is the original additional currency and the basic cause of economic fluctuations.Credit money has the power to create money. The issuance of additional currency, generally speaking of inflation, is actually a means for the currency issuing organization to obtain benefits. Currency of value, other than the obvious theft that dilutes the purity of gold, has no power to create money. The creation of credit currency is essentially different from that of non-issued currency banks in depositing, lending, and expanding credit. One is the problem of creating money out of thin air, and the other is the problem of expanding lending credit.Under the gold standard, paper money can be exchanged for gold. In the event of a crisis such as war, the holders of banknotes actively exchange gold for gold, and the government cannot exchange gold at the original rate, and the gold standard declares bankruptcy. In 1971, after the U.S. dollar was detached from the gold peg, additional currency was issued, causing inflation. Credit money will continue to lose its original value. If the inflation rate is 2% per year, after 100 years, $100 is equivalent to $13.26, and the inflation rate is 3% per year. After 100 years, $100 is equivalent to $4.75, and the currency is 5% per year. Inflation rate calculation price, after 100 years, 100 US dollars is equivalent to 0.59 US dollars, calculated at an annual inflation rate of 8%, 100 years later, 100 US dollars is equivalent to 0.024 US dollars, calculated at a 10% inflation rate every year, 100 years later, 100 US dollars Equivalent to 0.003 USD. The part that loses value is the interest of the currency issuing organization. For the hyperinflation that occurs, it is equivalent to the direct plunder of wealth, and the result is the bankruptcy of the government. Credit currency not only has the media function of commodity transaction, but also has the function of value swallowing.3. Monetary base systemPeople's eyes are easily attracted by the currency itself, and it is difficult to find the system behind the currency. Whether it is value currency or credit currency, the currency itself is part of the transaction record. Just as a cell phone is a subsystem of a communication system, money is a subsystem of a transaction-recording system. As the medium of commodity exchange, currency has completed a transaction and settled when a transaction occurs with the commodity. In addition to real-time settlement transactions, commodity transactions also include non-real-time settlement transactions. Non-real-time settlement transactions can be traded through transaction records. Real-time settlement transactions are a special form of non-real-time transactions, which are completed transactions. The record of transactions is the underlying system of money. The earliest writings found in the two rivers are the records of commodity transactions.Paper money evolved from receipts for guests to deposit gold or metal currency. This receipt is part of the transaction record. With this receipt, guests can withdraw gold or metal currency. As long as there is a transaction record system recognized by both parties, the property rights relationship can be clarified, and transactions can be conducted on the basis of mutual trust. The names of the banknotes that appeared in the Song Dynasty in China were Jiaozi, Huizi, and Guanzi. In these names, there are sub-words and the meaning of sub, which implies the existence of the currency parent system. As a kind of bill, currency is a portable local transaction record. Currency, as a subsystem of transaction records, forms a complete currency system only when it is combined with transaction records.4. Public transaction recordsOn the island of Yap in the Pacific Ocean, round stones were discovered as currency. People open records there, changes of owners, it's a large currency that can't be carried. Modern people have long forgotten the true face of money. As if only shiny gold, paper money with a mysterious halo was the currency. This stone, as if traveling through time and space, came to modern society and publicly recorded Bitcoin transactions. Humans on earth, hundreds, thousands of years, can participate in the huge silica of publicly traded records, formed through the Internet. This is an open, public distributed database. In this database, networked computers continuously record bitcoin transactions.Since the birth of the bank, no currency issuing bank has disclosed its own transaction records. If the transaction records are made public, the bank exposes the situation of issuing currency, diluting currency, and eating value. This unprecedented data project of public transaction records is the mother of the new currency of mankind. The mother of money is not shells, gold, paper money but transaction records. All currencies operate on a system of transaction records. In order to continue to operate, the public transaction record, as the incentive transaction recorder, also known as the miner, gave birth to a new currency - Bitcoin. The continuous and public record of transactions is the foundation of Bitcoin's value. If Bitcoin is the golden apple, then public transaction records are the soil in which the golden apple grows.5. Agreed currencyThe value of Bitcoin lies in the agreed currency based on public transaction records.Currency is a commodity, and at the same time, as a medium of commodity transaction, it occupies a special position in the commodity world. If the currency issuer issues a large number of low-cost banknotes according to their own interests and exchanges them for physical commodities, then the currency not only functions as a medium for commodity transactions, but also functions as an exchange for high-priced physical commodities with ultra-low-priced paper currency commodities,and finally make the currency issuing organization achieve the purpose of embezzling wealth by issuing additional currency. This requires that the credit currency must have the function of storing value. If the currency continuously loses the function of storing value, it means that the currency issuing organizer systematically appropriates the currency value of the general currency owner. Once the credit currency is issued more than the metal currency and gains benefits from it, it has separated from the mere function of the medium of commodity trading and has the function of engulfing value. The value-devouring function of credit currency comes from the power of credit currency.The transaction of commodities forms the market, and the market is a collection of transactions. In order to improve the efficiency of commodity trading, the market gives the medium of commodity trading - credit currency special power, that is, in the market based on equivalent exchange, credit currency is given the power to exchange commodities, which is far lower than the value of commodities. This is the mysterious monetary power of credit money. Currency power means that in the market of equivalent exchange, only currency, a commodity, has the power to exchange ultra-low prices for high prices by relying on some kind of credit. But this power exists to effectively perform the function of a commodity medium of exchange, not to gain profit. If paper money, indiscriminately using the power granted by the market, and exchanging ultra-low prices for high-priced currency power to obtain benefits, will eventually be spurned by the market, and it will fall to its original paper value. This is the hyperinflation that human society has experienced countless times. The root of chronic inflation is also the result of currency issuers who misuse monetary power to obtain benefits.Once the greed of human nature dominates the credit currency, various means and opportunities will be used to strengthen the value-devouring function of the credit currency. The gold standard is a restraint on greed. In 1931, greed broke through it. The Bretton Woods system's dollar-gold peg was also a restraint on greed. In 1971, greed broke through it. If 35 dollars cannot be exchanged for one ounce of gold, why? What about not adjusting $100 or $350 for an ounce of gold? No, what is needed is that the U.S. dollar is no longer constrained by gold, and what is needed is that the U.S. dollar suppresses gold. In the seventh century BC, after the first gold and silver coins were minted in the history of Lydia, government powers wanted to control the right to issue money. Once the government power monopolizes the right to issue currency, the currency will enter the track of preservation, depreciation and destruction. Only the melted and regenerated gold and silver have survived the decline of the regime and maintained their original value. The history of money is the history of store-of-value versus value-devouring struggles. People are eager to protect the monetary value exchanged for their labor, but they issue monetary organizations, use monetary power indiscriminately, constantly increase the issuance of currency, devour the monetary value, and finally end in the collapse of the credit currency.Bitcoin stipulates the total amount of issuance and the issuance process. This agreement means that Bitcoin restricts the power of currency, cuts off the value-devouring function of credit currency, and is faithful to the original function of currency as a medium for commodity transactions. Bitcoin is a decentralized and open currency system, and there is no central institution that exists by issuing additional currency and devouring the currency value of others. At the same time, Bitcoin, as the agreed currency, naturally becomes a limited resource. In the long run, it forms the interests of the first mover. With the growth of Bitcoin demand, the supply of currency depends on the division of units. At present, the smallest unit is Satoshi.When currency issuing organizations continue to issue more currency, devour value, and make credit currency continuously lose its function of storing value, although they gain their own benefits, in the long run, they will lead to the road of destruction. Value, but destroys credit and destroys value. It is like a luscious drug, eroding the body of currency issuers, making currency issuers gradually lose the power to create value, making them thieves of value. They broke the ancient commandment of \"Thou shalt not steal\", waiting for the punishment of time. As long as you get benefits by issuing currency, you are getting benefits by stealing, which not only devours the value of currency, but also devours the foundation on which human beings depend - the benchmark of honesty. If a society cannot judge what stealing is, then it is more harmful than stealing itself. Human society will become a paradise for thieves, and civilization will decline.Power and money are the two great beasts that human society cannot control. Through thousands of years of efforts, human beings have established a democratic system in which sovereignty lies in the people. In a democratic country, power is basically restricted, but it is difficult for people to restrict the currency hidden behind power. Currency is both familiar and unfamiliar to people. Existence, people yearn for money, but stay away from money, people crave money, but hate money, people worship money, but despise money. Currency is full of secrets, and it is difficult for people to know the real face of currency. The birth of currency, the issuance of currency, the flow of currency, and the ownership of currency all operate in a covert way. As a measure of value, credit currency has the special power to exchange low prices for high prices. Without restrictions on the power of credit currency, it will inevitably form. Credit currency devours commodities, devours value, and finally distorts the free market. The right to issue currency is the hidden force behind all power. It is like a ghost, wandering in and out of the sovereign. It is invincible, and wherever it goes, everything will silently give way. Although the currency issued by the country is a sovereign currency, it is not a sovereign currency, but a privileged currency. Sovereign currency should bring benefits to the people whose sovereignty is in the people, instead of benefiting a few currency issuer interest groups. The currency of the sovereign people is constantly losing value, how can we say sovereign currency? It is more difficult for human beings to supervise money than to supervise power. The currency issued by the central bank is a liability on the loan table, and a large amount of liability occurs every year, but this is a liability without creditors, and it is a silent liability. In fact, there is this creditor, and this silent creditor is the majority of the nationals who rely on honest labor and create value to obtain currency and continue to lose currency value.The U.S. dollar has been separated from the value currency-after gold, the U.S. dollar has changed from a gold-based credit currency to a regime-based credit currency, also known as legal currency or symbol currency. The credit basis of paper money has changed from value currency to state power. The credit currency of which the state power is the credit is defined as the power currency. The issuance of power currency can only be decided by those who participate in formulating monetary policy and running the currency. Although monetary policy takes into account factors such as economic prosperity, employment rate and inflation rate, the essential purpose of the policy of power currency is to continuously expand the additional issuance capacity of currency. Only the additional issuance capability of currency brings the benefits of currency issuing organizations. The ability to increase the issuance of money is the expansion of monetary power. The additional issuance capability of a currency is measured according to the additional issuance scale, duration, and issuance space, which is determined by the competitiveness of the currency. The world has become a competitive arena for money. The competitiveness of a currency of power comes from economic strength and ultimately depends on military strength. Power currency and military power are closely linked, interdependent and symbiotic. Power currency is formed based on monetary power, and the purpose of power currency is to expand monetary power. Currency comes from commodity transactions and from the market, but when paper money changes from gold and silver and other value currencies as the basis of credit to power as the basis for credit, currency will form a force that distorts the market. The currency of power obtains benefits by continuously issuing more currency, exchanging the power of high price with the low price of currency, destroying the market order of equivalent exchange. The currency of power will not only destroy free and competitive markets, but will also destroy democracy, peace and civilization. Power currency is the result of the expansion of monetary power, and it is also the basis for further expansion of monetary power. Power currency is a currency based on force, and it is a credit currency with extremely inflated monetary power.In addition to the media function of commodity transactions, the function of value scale, and the function of value preservation, currency also has the function of value devouring. The value-devouring function is an important function of the rapidly developing currency after paper money became the mainstream currency, especially after the US dollar was separated from gold in 1971. The value-devouring function is that the currency issuer gradually loses the function formed in the value-preserving function of the currency of most people. The value of one side is swallowed, and the value of the other side is lost. The value-devouring function of currency has been generally recognized by the society with an inflation rate of 2%. A 2% inflation rate is a 2% value swallowing rate. This is the benefit obtained by the currency issuer by destroying the credit, and it is the result of the misuse of the power of credit currency. This is a gold coin mixed with cheap metals such as copper and lead. The value phagocytosis function, like cancer cells, devours the body of the free market. Only when the value-devouring function of money is cut off can free money be born. The Bitcoin designed by Satoshi Nakamoto, based on public transaction records, stipulates the total supply and the supply process, restricts the power of the currency, cuts off the value-devouring function of the credit currency, and enables the currency to enter the track of freedom and justice.  endBitcoin is an honest currency like gold. As a credit currency, Bitcoin is not based on the value currency such as gold and silver, but on the basis of public transaction records. It returns to the origin of currency - the transaction record system. Bitcoin originated from the junction of the currency system and the Internet system, and is the product of the evolution of the currency system and the Internet system. Currency has evolved to digital information with microparticles as the carrier, and the Internet has developed into a digital universe. At the boundary of micro and macro evolution in opposite directions, Bitcoin has exploded with huge value energy, which further promotes the process of digital civilization. Currency is not just a medium of commodity exchange, it is the existence of a digital form of social resources. No one can do without money. The currency question is a question of survival, a question of freedom, a question of peace, and a question of civilization. Currency is the product of civilization, and it is also the force that promotes civilization. Humans need free and just money, just as they need free and just power. Only time will know the future of Bitcoin. Maybe it will disappear in the world of money one day. However, the spirit of agreement possessed by Bitcoin designed by Satoshi Nakamoto constrains the power of money and points out the fair direction of money.Design turns ideas into reality. The pyramid designed by Imhotep, the separation of powers designed by Montesquieu, the Bitcoin designed by Satoshi Nakamoto...their designs affect the development of human society. In a world of money full of desire, the light from the soul will be seen through Bitcoin.                                                     above 2022.7.10Lee DongZhe  references1. Satoshi Nakamoto, \"Bitcoin: A Peer-to-Peer Electronic Cash System\".2. Hayek, The Liberalization of Currency Issues.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440575",
  "comments": [
    {
      "author": "Argoo",
      "created_time": "March 21, 2023, 02:26:57 PM",
      "body": "This thread was published on February 20, that is, a month ago. Her text has been opened for reading 40 times, but no one has left a comment yet. Apparently, this is due to the fact that hardly anyone has read it to the end. It is too long, and the theoretical information presented in it is tiring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 21, 2023, 04:08:57 PM",
      "body": "With all the long grammars and a whole page full text just in the explanation of the value of bitcoin and how it takes relate in comparison to gold, please can we learn to begin to make things look simple for ourselves, where do you expect someone to have that enough time to sit down while analysing your content one by one when you could simply summarize it all in three lines, afterall the discussion had been made on it kind several times, even the Satoshi Nakamoto whitepaper isn't as voluminous as this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "March 21, 2023, 04:48:50 PMLast edit: March 21, 2023, 08:10:13 PM by CryptoHeadlineNews",
      "body": "Quote from: Argoo on March 21, 2023, 02:26:57 PMThis thread was published on February 20, that is, a month ago. Her text has been opened for reading 40 times, but no one has left a comment yet. Apparently, this is due to the fact that hardly anyone has read it to the end. It is too long, and the theoretical information presented in it is tiring.Just merely seeing how long the thread is, I already feel discouraged to even want to read it, because I see it as a total waste of time, as there is nothing O.P will say that has never been said before on this forum in a more simplified form, and I guess that's the same reason why ever since posted, it never got a single comment. So I think O.P just need to learn word paragraphing and how to summarize sentence and stop posting long content like this, because if he/she continues like this, so will his contents keep getting buried without getting a single reaction, as this looks like a final year school project.So I will advise O.P to download a mobile app called \"Grammarly\" which is available both on android & IOS, as that app will help enable you to write good sentence structure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 21, 2023, 06:16:48 PM",
      "body": "I have spent sometimes to read this threads, is too much and this can discourage the mindset from picking any meaningful thing. All you're saying it's concerning the values of bitcoin, to traders, investors and government but the threads is vogues. Please next time adjust your findings in a moderate form for easy comprehension and accession. I guess you're a newbie like me, we should reads, learn and follows our seniors posts and threads and we apply same principles. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 21, 2023, 07:33:15 PM",
      "body": "Quote from: Argoo on March 21, 2023, 02:26:57 PMThis thread was published on February 20, that is, a month ago. Her text has been opened for reading 40 times, but no one has left a comment yet. Apparently, this is due to the fact that hardly anyone has read it to the end. It is too long, and the theoretical information presented in it is tiring.I am not even sure that OP have read the information in this thread. If he had read and understand what he has posted, it would have been summarized and arranged in a brief writeup so that members can find it attractive to read. From what I have read so far, this information is educating but I don't think many user have the time to go through such long material. As a newbie you must study the writings in his forum so that you can have knowledge of the length and arrangements thay can attract members to your posts. I have also observed that members in this forum pay more attention to your personal experience that can be helpful to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "March 21, 2023, 08:38:54 PM",
      "body": "Op just scanned 1/3 of the post for reducing the search time and bro it's more than 50% plagiarism dear it's against major rules, and you are direct in violation and I can't even expect a newbie to posting a full thread of around 4000 words. Dear anyone who is new I will suggest to him some good complied articles or white-paper that should be easy for him to read and learn I think you should lock this thread as first of all it totally copies and pastes data rather than posting the whole text here you can provide some source link.Secondly, I am not a person who will read the whole thread of 4000 words based on a title just the Value of Bitcoin. I am still trying to understand the motive behind posting this copied white paper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}