{
  "id": "topic_5403280",
  "title": "Beronica",
  "author": "Beronica",
  "created_time": "June 20, 2022, 02:15:35 AMLast edit: June 28, 2022, 03:28:55 AM by Beronica",
  "content": "Faucet Securityhttps://www.faucetsecurity.comFree antibot security challenge serviceCaptcha alternativeSecure website protectionEffective against botsSimple api and documentationNo registration Faucet Security is a free antibot security challenge service for your website. This service offers your website protection in place of, or in addition to Recaptcha. Security challenges are an effective way to prevent bots and cheaters from causing problems for your business.Paying .00001 BTC CPM for valid challenge solves from 24 hour unique IP addresses. Payments are sent through the faucetpay.io micropayment processor.The code is 100% original and not based on existing scripts. Our objective is to provide additional security for your website in a manner that is newbie friendly, but still effective.Check out this live example to see the security challenge in action: https://www.faucetsecurity.com/example.phpPlease, ask if you have any questions!(support@faucetsecurity.com)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403280",
  "comments": [
    {
      "author": "Beronica",
      "created_time": "July 09, 2022, 11:04:37 PM",
      "body": "Try our demo BTC faucet.1 satoshi every 5 mins.This faucet is on fire, claim now!BTC https://www.faucetsecurity.com/faucet.php BTCThe faucet serves as a promotion to demonstrate how the captcha appears on a faucet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beronica",
      "created_time": "July 31, 2022, 10:14:33 PM",
      "body": "Try our BTCitcoin faucet!Add our faucet to your daily list!You earn 1 satoshi every 5 mins!BTC https://www.faucetsecurity.com/faucet.php BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beronica",
      "created_time": "August 07, 2022, 09:14:42 PM",
      "body": "Tired of bots and cheaters?Add our code to your forms and see the results!Need alternative ways to monetize your content?Our security challenge serves ads, generating revenue.A portion of that revenue is paid to publishers in Bitcoin.Update:Our example faucet has moved to a new location.The old url automatically redirects to the new one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}