{
  "id": "topic_5447761",
  "title": "Stable090",
  "author": "Stable090",
  "created_time": "April 06, 2023, 06:59:48 AM",
  "content": "I've noticed that newcomers to the cryptocurrency market tend to invest blindly, which is why most of them ultimately end up losing money or making no profit at all. As a result, they label bitcoin and other cryptocurrencies as scams without realizing that the issue is actually from them. There are some fundamental concepts we need to understand before investing in cryptocurrency, which i will be mentioning few in my post.1, Don’t invest what u can’t really afford to lose; In cryptocurrency don’t just invest blindly, or don’t invest due to what you hear from people about cryptocurrency, lots of people will tell you they are making money from cryptocurrency investment which will encourage you to invest all your money there. If you are investing, you don’t have to invest all your money or even sell your properties or take loan because you want to invest, in cryptocurrency anything can happen so always make sure you invest any amount you can afford to lose, don’t be deceived by what you hear people say on the internet, most people you meet on the internet will only show you their profit when they are winning and they will keep their losses to themselves.2, Keep the long term in mind; Crypto space is not a place where you think you can just come and make easy and fast money, crypto space is not a Ponzi scheme when you will be promised high return in short period of time without any risk. If you are planning to invest in cryptocurrency, you should always have it in mind that you are investing for long period of time, you should be ready to HODL your coin for long period of time if you are expecting a maximum profit. Also i don’t think you can lose your money if you invest in bitcoin and you are ready to hold for long term.3, Secure your key; Before you starting investing in cryptocurrency, you should take your time to learn about wallet Security and how to secure your private key, if you can’t secure your wallet, then you might endup losing all your investments. If you are not in control of your key, then the coin those not belong to you, make sure you don’t leave your crypto assets on any exchange, because the exchange will be the one controlling your assets, and you can easily lose your assets if anything happens to the exchange, the exchange can decide to freeze your assets at an moment’s. make sure your crypto assets is store on a non custodial wallet and make sure your key is stored properly. Make sure you store your key in a place where nobody can have access to it, anyone that have access to your key can easily send out all your assets without you knowing. One of the best way to secure your private key is by carving it on a metal steel and hiding it, it can’t be damaged either by water or by fire.4, Do your own research before investing; Newbies in cryptocurrency recently don’t really known much about cryptocurrency, they are just desperate to invest because they heard people making money from cryptocurrency, if you are planning to join cryptocurrency, you should make sure you do your research first and know the basics of what you are planning to invest in. When you are planning to purchase any coin, make sure you do your research first, don’t invest due to the hype on the coin, don’t invest because your friend ask you to invest or because people ask you to invest in it, invest in it because you believe it worth investing in.5, Pick a Good Crypto Exchange; We are  having lots of exchange’s recently but some of them are scam exchange and some are having low reputation, you don’t have to risk your money trading in  exchange with low reputation no matter the attractive offers they are having, if you are going to be trading make sure you are making use of exchange with reputation to  be at a safer side. You can visit CoinGecko  or to see rank of crypto exchanges and their trading volume.(https://www.coingecko.com/)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447761",
  "comments": [
    {
      "author": "Seinlocko",
      "created_time": "April 06, 2023, 08:08:02 AM",
      "body": "that's all true, investing in bitcoin does require lessons in the points you wrote.I will add, don't forget to always be in no hurry when investing in crypto, because mental mastery is very important when investing in crypto.and don't forget to always be careful, because it's true that many parties have fake crypto, which is deliberately made to deceive many people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "April 06, 2023, 10:50:40 AM",
      "body": "Quote from: Stable090 on April 06, 2023, 06:59:48 AM5, Pick a Good Crypto Exchange; We are  having lots of exchange’s recently but some of them are scam exchange and some are having low reputation, you don’t have to risk your money trading in  exchange with low reputationYou can lose your cryptocurrency if you put it on exchanges. Big or small, high or low reputation, you can always lose your cryptocurrency if you don't own its private key.It is easily to find scam exchanges that have low reputation, low trading volume, newly born but let's see how a Tier-1 exchange like FTX collapsed within a week and caused serious losses for many people who have accounts on FTX and stored their cryptocurrencies in their accounts.What went wrong with FTX exchange?Reminder: do not keep your money in online accountsQuoteYou can visit CoinGecko  or to see rank of crypto exchanges and their trading volume.(https://www.coingecko.com/)You can use Coinmarketcap, Coingecko but their algorithms for Trust score, Reputation score can be biased. Like Coinmarketcap was acquired by Binance and months ago, when Binance got massive fud, rank for Binance on Coinmarketcap is different (higher) than on Coingecko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "April 06, 2023, 12:10:37 PM",
      "body": "Quote from: SquirrelJulietGarden on April 06, 2023, 10:50:40 AMQuote from: Stable090 on April 06, 2023, 06:59:48 AM5, Pick a Good Crypto Exchange; We are  having lots of exchange’s recently but some of them are scam exchange and some are having low reputation, you don’t have to risk your money trading in  exchange with low reputationYou can lose your cryptocurrency if you put it on exchanges. Big or small, high or low reputation, you can always lose your cryptocurrency if you don't own its private key.It is easily to find scam exchanges that have low reputation, low trading volume, newly born but let's see how a Tier-1 exchange like FTX collapsed within a week and caused serious losses for many people who have accounts on FTX and stored their cryptocurrencies in their accounts.What went wrong with FTX exchange?Reminder: do not keep your money in online accountsAm not asking anyone to keep their coin on exchange, we all know it’s a bad idea leaving coin on exchange, but if you want to trade, you still have to make use of exchange, so if you are trading always make sure you use a reputable exchange. Even if Goingecko is biased we all know Binance is a reputable exchange and I don’t think they will rank a exchange with low reputation in first or second.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "April 06, 2023, 12:22:34 PM",
      "body": "Quote from: Stable090 on April 06, 2023, 12:10:37 PMQuote from: SquirrelJulietGarden on April 06, 2023, 10:50:40 AMQuote from: Stable090 on April 06, 2023, 06:59:48 AM5, Pick a Good Crypto Exchange; We are  having lots of exchange’s recently but some of them are scam exchange and some are having low reputation, you don’t have to risk your money trading in  exchange with low reputationYou can lose your cryptocurrency if you put it on exchanges. Big or small, high or low reputation, you can always lose your cryptocurrency if you don't own its private key.It is easily to find scam exchanges that have low reputation, low trading volume, newly born but let's see how a Tier-1 exchange like FTX collapsed within a week and caused serious losses for many people who have accounts on FTX and stored their cryptocurrencies in their accounts.What went wrong with FTX exchange?Reminder: do not keep your money in online accountsAm not asking anyone to keep their coin on exchange, we all know it’s a bad idea leaving coin on exchange, but if you want to trade, you still have to make use of exchange, so if you are trading always make sure you use a reputable exchange. Even if Goingecko is biased we all know Binance is a reputable exchange and I don’t think they will rank a exchange with low reputation in first or second.That statement you made, we all know is wrong, not everyone knows that's it's a bad idea to leave their coin on the exchange, you can't expect a newbie to know that, every newbies only know that exchanges is where people buy and sell crypto, that's it. They have no clue about what's safe and what's not safe, using the exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "April 06, 2023, 10:12:26 PM",
      "body": "This is very educative and enlightening to both the newbies and the existing members but unfortunately it's very lengthy. I had to pause like three times and continue reading again after some break. Try to make your post very short and understand next time in order not to make the readers bore while reading your post. A lengthy post scared many away from reading despite it being informative and useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "April 06, 2023, 10:41:02 PM",
      "body": "... everytime I think of my trading life outside the forum, I realize that it would have been really coarse without the forum.I see alot of threads coaching 'em rookies on how to succeed without much stress; this are actually the same brocards that any successful personell in here was given ...and you see, one thing is to know what to avoid, another thing is to listen and avoid them as you were told ...cus 'em phony be making the whole scammy projects very enticing. So I'd conclude by saying: dude, this is a nice writeup... There isn't much of some self-invented clues added,but for each educating thread, an awareness is created.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "April 06, 2023, 10:48:54 PM",
      "body": "The best part in crypto is to secure your wallet because we may be scammed in many ways like Scam by exchange, Scam by Project investment, hacked wallet. So always everyone should keep their funds secured. The best way to secure crypto is to use decentralized exchanges and non custodial wallets. Never store your funds in a Cex exchange or wallet. And it's important to do research in every step of doing any investment. Remind it that Scammers are everywhere in crypto world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "April 06, 2023, 11:08:13 PM",
      "body": "You can add not to be swayed by hype and market pump when investing.  This plays a huge role whether you can decide rationally or not.  If you invest because someone hyped you then you may not get the grasp of the true reason why you need to invest on that market.  Aside from that, as investor, we should keep all in rational state.  We should not be affected by emotions.  As much as possible we must stay neutral in order to process things we are researching in a most effective way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "April 07, 2023, 02:09:30 AM",
      "body": "Quote from: Seinlocko on April 06, 2023, 08:08:02 AMdon't forget to always be in no hurry when investing in crypto, because mental mastery is very important when investing in crypto.Sometimes that's not enough, a few of them have some sort of thinking and unsteady stance. For example, Today they are very enthusiastic but tomorrow they change their mind and reverse direction. we can't force a kind person like this, because his mind is not yet open, and still think that crypto is a scam investment scheme in the world. They will not believe you until prove the truth (profit)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "April 07, 2023, 02:50:08 AM",
      "body": "The five important points that you wrote should not be missed Newbies who want to start investing in crypto assets. Using cold money is highly recommended so as not to damage psychologically when you experience a loss or the worst possibility is that the money will be lost due to the Coin being held missing from circulation. The thing that newbies often experience when investing is panic, they find it difficult to control their emotions when some of the money starts to decline. Newbies need to control their emotions when facing dump conditions because the movement can only be on two sides, up and down.In addition, Newbie needs to choose coins that are familiar. Shitcoins or low fundamental coins are best avoided because the risk is much greater than the top coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "April 07, 2023, 04:08:11 AM",
      "body": "Quote from: Stable090 on April 06, 2023, 06:59:48 AM1, Don’t invest what u can’t really afford to lose; In cryptocurrency don’t just invest blindly, or don’t invest due to what you hear from people about cryptocurrency, lots of people will tell you they are making money from cryptocurrency investment which will encourage you to invest all your money there. If you are investing, you don’t have to invest all your money or even sell your properties or take loan because you want to invest, in cryptocurrency anything can happen so always make sure you invest any amount you can afford to lose, don’t be deceived by what you hear people say on the internet, most people you meet on the internet will only show you their profit when they are winning and they will keep their losses to themselves.  when ever I want to invest in cryptocurrency I don't invest a huge amount of money I always the risk behind the market, which is what most the beginners don't understand they thing when they invest big the profit coming going to be huge amount of money without considering the risk behind the market. Quote from: Stable090 link=topic=5447761.msg62042857#msg62042857 date=16807643884, [bDo your own research before investing;[/b] Newbies in cryptocurrency recently don’t really known much about cryptocurrency, they are just desperate to invest because they heard people making money from cryptocurrency, if you are planning to join cryptocurrency, you should make sure you do your research first and know the basics of what you are planning to invest in. When you are planning to purchase any coin, make sure you do your research first, don’t invest due to the hype on the coin, don’t invest because your friend ask you to invest or because people ask you to invest in it, invest in it because you believe it worth investing in.Beginners should understand that there is no way to invest in crypto without knowledge and expect to profit; whatever someone wants to do, they must be knowledgeable about it before getting into it; some of the beginners in crypto today lack knowledge of bitcoin, particularly those trading bitcoin; most of them join because people close to them have made it in the market, which is not how it is supposed to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "April 07, 2023, 09:29:56 AM",
      "body": "Quote from: Stable090 on April 06, 2023, 06:59:48 AM2, Keep the long term in mind; Crypto space is not a place where you think you can just come and make easy and fast money, crypto space is not a Ponzi scheme when you will be promised high return in short period of time without any risk. If you are planning to invest in cryptocurrency, you should always have it in mind that you are investing for long period of time, you should be ready to HODL your coin for long period of time if you are expecting a maximum profit. Also i don’t think you can lose your money if you invest in bitcoin and you are ready to hold for long term.As newbies keep long term  in mind they should also know that not all coin are worth holding for long. A simple start is always safer for investors with little or no idea about how crypto market works. Starting with Bitcoin and hodling for long term profit is best while the watch and study other coin then gradually risk a small fraction of their investment thereby testing other volatile coin but it must always be an amount that is worth risking as pointed out. Quote5, Pick a Good Crypto Exchange; We are  having lots of exchange’s recently but some of them are scam exchange and some are having low reputation, you don’t have to risk your money trading in  exchange with low reputation no matter the attractive offers they are having, if you are going to be trading make sure you are making use of exchange with reputation to  be at a safer side. You can visit CoinGecko  or to see rank of crypto exchanges and their trading volume.(https://www.coingecko.com/)No matter how good an exchange is they should never be trusted with our coin. A highly reputable exchange can close for any reason. Reputation now lies in our ability to safe guard our digital assets our selves. If we must buy from CEX we also should be fast to move them where we have full custody and control of our funds. Most preferable buying from DEX is far safer and secure",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "April 07, 2023, 10:58:44 AM",
      "body": "Quote from: BitcoinPanther on April 06, 2023, 11:08:13 PMYou can add not to be swayed by hype and market pump when investing.  This plays a huge role whether you can decide rationally or not.  If you invest because someone hyped you then you may not get the grasp of the true reason why you need to invest on that market.  Aside from that, as investor, we should keep all in rational state.  We should not be affected by emotions.  As much as possible we must stay neutral in order to process things we are researching in a most effective way.Apart from Bitcoin, the whole crypto ecosystem is full of noise and hype, nothing more. They are just rebranded altcoins to move liquidity from one project to another. Tell me if there is any altcoin in the whole of Coingeko or Coinmarketcap that isn't hype for people to buy, after the hype fades away, they begin to plunge and lose all the momentum it has gathered making some groups while the rest of them hate crypto forever. It is only Bitcoin that doesn't have this characteristic of a group of people that controls it, it grows on its own time frame, I even doubt if all altcoins will really grow without the intervention of Bitcoin Halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "April 07, 2023, 11:12:49 AM",
      "body": "The only place you need to have some respect for the word reputation is if the platform is safe to trade and withdraw your money, don't play the reputation game by leaving your funds on any exchange, there is no reputation when it comes to money, anything can happen to any cryptocurrency exchange at any time. The most trusted people can have the cruelest darkest secrets, once you are done with trading on any crypto exchange withdraw your funds back into your crypto wallet that you own the private key. Newbies only ask questions after they have messed things up, if all newbies can ask questions before making an attempt many would have been safe from scammers, some newbies like using less popular exchanges, I can't figure out where they get such idea from",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "April 07, 2023, 12:58:14 PM",
      "body": "Quote from: Stable090 on April 06, 2023, 06:59:48 AM1, Don’t invest what u can’t really afford to lose;  Some people have committed suicide due to they have lost their funds through hackers or failure of some projects.the act of greediness by investing what they can't afford to lose with aim of huge profits have make lose their life savings.infact you will never have rest of mind if you invested much in crypto industry. Quote from: Stable090 on April 06, 2023, 06:59:48 AM2, Keep the long term in mind; The aim of making profits in crypto industry doesn't just happen between the short period of time especially when you need good profits in your cryptocurrency investment, you need serious patient and able to hold your coins for long term. Quote from: Stable090 on April 06, 2023, 06:59:48 AM4, Do your own research before investing; Someone need proper research on his/her own before investing in any project, if not it may end up in scam projects, and if his/her decide to follow some people research may also ended up in project that doesn't have future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "April 07, 2023, 01:30:55 PM",
      "body": "Quote from: BitcoinPanther on April 06, 2023, 11:08:13 PMYou can add not to be swayed by hype and market pump when investing.  This plays a huge role whether you can decide rationally or not.  If you invest because someone hyped you then you may not get the grasp of the true reason why you need to invest on that market.  Aside from that, as investor, we should keep all in rational state.  We should not be affected by emotions.  As much as possible we must stay neutral in order to process things we are researching in a most effective way. If you are doing your own research, you won’t be easily swayed by any hype or FUD that will control your decision. You should be investing because you know it’s the right choice, and that will make you ultimately profitable later on. And as much as mental stability is concern, we should also secure emotional stability so that if ever our investments fail, we will never be completely ruined or affected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 07, 2023, 02:59:44 PM",
      "body": "Quote from: Finestream on April 07, 2023, 01:30:55 PM And as much as mental stability is concern, we should also secure emotional stability so that if ever our investments fail, we will never be completely ruined or affected.In relation to this concerning our emotional stability and how it affects our investment, naturally what controls that emotion is our zeal for money. If we have greedy tendency for money or appetite for it our investment will be in such fast and quick means to getting it and that can lead to wrong investment. Some investors believe to buy cheap and shit coins and wait for luck to have large profit but most times such coins end up falling lower than their entering price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}