{
  "id": "topic_5466206",
  "title": "elevates",
  "author": "elevates",
  "created_time": "September 09, 2023, 12:38:41 PMLast edit: September 09, 2023, 12:50:36 PM by elevates",
  "content": "It is done and dusted as India changes the status quo of G20 to G21 under its presidency. African Union is now part of the new G21 group, a brilliant geopolitical move by India. India is hosting the current G20 summit for the first time and being a host if a country can change the status quo of a powerful economic group for the first time, then it is a big achievement. 55 sovereign states are part of the African Union as per Wikipedia. I may be wrong if I am then do correct me. In recent times India has been dominating global politics and every big economy has been trying its level best to get themselves on their good books. The next news that we all are waiting for from this summit is the G20 crypto regulation framework. This will be followed by all of these nations with some minor changes according to their local requirement.  BTW, The Chinese president was not present in this meeting nor did Zelensky and Putin. I can understand the problem with Putin & Zelensky, what I did not understand was why the Chinese premier thought of canceling his visit. A few days back he was present at the BRICS summit which for me looks kind of awkward. Do you guys think he canceled his visit because of the existing border issue with India or something else?img source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466206",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "September 09, 2023, 01:44:34 PM",
      "body": "This is a very good development and I hope it will be able to achieve the reason why the AU and the old members agree on the term. But instead of trying to make it G20 which disfigures the round figure of such like it, why not maintain the G20 irrespective of how many members they have? By the name, it would have easily defined the started member states.As it is now, China is trying to do anti-US and Western states, it's possible the vacuum will still help in maintaining the G20 name without disfiguring it to G21.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 09, 2023, 05:47:22 PM",
      "body": "Quote from: EarnOnVictor on September 09, 2023, 01:44:34 PMBut instead of trying to make it G20 which disfigures the round figure of such like it, why not maintain the G20 irrespective of how many members they have? By the name, it would have easily defined the started member states.The number was already meaningless for decades as one of the seats is held by the EU while the same EU has other 3 seats DE,IT,FR and also Spain is a permanent guest member while having the 15th largest economy in the world. So the whole G20  was just as inaccurate as G21 or G44.But it's a bit of political stuff here, by changing the number is acknowledging them as a full member, not some random invite, it's the gesture that counts here. Anyhow, one big FY to BRICS, along with the new development rail and shipping corridor that rivals the Chinese Silkroad it basically showed the world again where the real money is.Quote from: elevates on September 09, 2023, 12:38:41 PMI did not understand was why the Chinese premier thought of canceling his visit. A few days back he was present at the BRICS summit which for me looks kind of awkward. Do you guys think he canceled his visit because of the existing border issue with India or something else?Because he didn't want to be there and cheer and applaud at projects that left China sidelined, that's why! The whole thing was engineered as a Western response to the BRICS soup kitchen project and he won't want to stand there and be humiliated while seeing how his plans and influence go down the drain.Just think how he could smile when seeing funding in the tens of billions of projects that are designed to take out the whole manufacturing from China and move it to India and middle east?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "September 10, 2023, 07:32:09 AM",
      "body": "Quote from: stompix on September 09, 2023, 05:47:22 PMsnip~~You are right about the rail and port agreement between India, the United States, Saudi Arabia, and the European Union. it is meant to counter China's One Belt, One Road. That is the primary reason why the Chinese President did not attend the G20 summit. Another reason that I found out is that Xi Jinping suffering from a Cerebral Aneurysm. I saw on X that this might be another reason that he skipped the G20 meeting as he was not well. Well, there are other reasons that are circulating the Internet for his absence from the summit. Still, without his presence, India was able to successfully host the G20 summits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "September 10, 2023, 10:08:40 AM",
      "body": "India is choosing the tactically correct path. While China is trying to yuanize and put the BRICS countries under its thumb, India is creating a new alliance. India is moving away from the bloc with China, which has growing problems, and from toxic Russia, and taking control into its own hands. My assumption is that India is building an alliance on the basis of BRICS+Arfrican Union to create a geo-economic and possibly political alliance for the new century. India is discarding the \"sick, contagious and flabby\" players of the world stage and taking its rightful place. At the same time, India is doing one more smart thing - moving away from ties with pariah countries, toxic countries, and similar \"world losers\", in favor of the Western vector, Western markets, and Western values!I am sincerely happy for India, most likely - a new leader in the Asian-Southeast and African region !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "September 10, 2023, 02:21:00 PM",
      "body": "Quote from: EarnOnVictor on September 09, 2023, 01:44:34 PMThis is a very good development and I hope it will be able to achieve the reason why the AU and the old members agree on the term. But instead of trying to make it G20 which disfigures the round figure of such like it, why not maintain the G20 irrespective of how many members they have? By the name, it would have easily defined the started member states.As it is now, China is trying to do anti-US and Western states, it's possible the vacuum will still help in maintaining the G20 name without disfiguring it to G21.Every year China renews the map and makes changes to it. This year they made a barrier to the sea in the southern part of the map and made it a border. On the western side, they came to the Indian side. The Indian foreign office protested to China. In fact, China does this every year and the states do nothing about China's expansionism. China is not participating in the G20 because it does not want to confront the US and other Western countries there. They don't want to answer to anyone while China's expansionist policy continues. We have moved to a bipolar world and the G20 and G10 need to be revised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "September 10, 2023, 08:03:13 PM",
      "body": "Quote from: DrBeer on September 10, 2023, 10:08:40 AMIndia is choosing the tactically correct path. While China is trying to yuanize and put the BRICS countries under its thumb, India is creating a new alliance. India is moving away from the bloc with China, which has growing problems, and from toxic Russia, and taking control into its own hands. My assumption is that India is building an alliance on the basis of BRICS+Arfrican Union to create a geo-economic and possibly political alliance for the new century. India is discarding the \"sick, contagious and flabby\" players of the world stage and taking its rightful place. At the same time, India is doing one more smart thing - moving away from ties with pariah countries, toxic countries, and similar \"world losers\", in favor of the Western vector, Western markets, and Western values!I am sincerely happy for India, most likely - a new leader in the Asian-Southeast and African region !India is doing alot these days. Aside from the expansion and BRICS initiative supposed to include them and other African countries, they recently made a successful landing on the moon among other countries who have previously done so like the U.S, Russia, China. Chinese government is simply trying to stay put until it has successfully actualized its BRICs or yeunization as you sited. Countries are just merely trying to be careful with their relationship these days as world tension is building up, and a new world order which will cause a considerable change is brewing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "September 10, 2023, 08:26:55 PM",
      "body": "The India Prime Minister Modi had done the diplomatic move,this may help the African union in different ways.Because as we now,the economy of African countries was not good now,So this will help them to do some export to the other nation and increase their economy.The African Union should use this opportunity in a good way to build their economy.As we know their was no good relationship with India and China due to the border issue.The Aksai Chin may be the reason for this move by the Chinese President,the Ukraine and Russia move was unexpected one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "September 10, 2023, 10:02:14 PM",
      "body": "Quote from: Bananington on September 10, 2023, 08:03:13 PMQuote from: DrBeer on September 10, 2023, 10:08:40 AMIndia is choosing the tactically correct path. While China is trying to yuanize and put the BRICS countries under its thumb, India is creating a new alliance. India is moving away from the bloc with China, which has growing problems, and from toxic Russia, and taking control into its own hands. My assumption is that India is building an alliance on the basis of BRICS+Arfrican Union to create a geo-economic and possibly political alliance for the new century. India is discarding the \"sick, contagious and flabby\" players of the world stage and taking its rightful place. At the same time, India is doing one more smart thing - moving away from ties with pariah countries, toxic countries, and similar \"world losers\", in favor of the Western vector, Western markets, and Western values!I am sincerely happy for India, most likely - a new leader in the Asian-Southeast and African region !India is doing alot these days. Aside from the expansion and BRICS initiative supposed to include them and other African countries, they recently made a successful landing on the moon among other countries who have previously done so like the U.S, Russia, China. Chinese government is simply trying to stay put until it has successfully actualized its BRICs or yeunization as you sited. Countries are just merely trying to be careful with their relationship these days as world tension is building up, and a new world order which will cause a considerable change is brewing.India's advantage is wisdom, compromise, and real achievements - both in economics, politics, including as a \"manager\" of whole groups of countries. And most importantly, India is not trying to oppose itself to the world, and not trying to plunge its friends and partners into \"slavery\", as China is trying to do now. This is a big plus for India ! When the BRICS countries and the African Union understand the renal essence of China's dedollarization-yuanization, they will have no other option but to turn to India, a wise and mutually beneficial country. It is foolish to deny that the BRICS/African Union countries have \"complexes\" about the Global West, and they will not soon turn there. And \"between two fires\" (the West and China with its enslavement plans), they will choose India !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 10, 2023, 10:52:51 PM",
      "body": "This is a good move from India, they can try to make an effective progress through this, it's not all about forming a clique that matters but seing governments coming together to a cause of a progressive unity and development among themselves, we are expecting them together with other leaders to form a leadership worth emulation, think more about the people than themselves, also make policies that will lead to massive development more than ever before, am so excited seing some of the African countries in attendance, this will give them more insights to what more is expected of them to deliver to the people they govern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "September 10, 2023, 11:49:38 PM",
      "body": "Quote from: 348Judah on September 10, 2023, 10:52:51 PMThis is a good move from India, they can try to make an effective progress through this, it's not all about forming a clique that matters but seing governments coming together to a cause of a progressive unity and development among themselves, we are expecting them together with other leaders to form a leadership worth emulation, think more about the people than themselves, also make policies that will lead to massive development more than ever before, am so excited seing some of the African countries in attendance, this will give them more insights to what more is expected of them to deliver to the people they govern. When a country have got wider plans with the associated nations it is being praised. This is really a great move in terms of politics, but the person who had been praised for such an addition should have the same mind way of thinking ruling the people within the country. Everything is connected to electrol politics, but there should be humanity. The ruling government have been very clear with the divide and rule. The target is to divide people based on religion and win the elections. A leader that is being driven by religion can never make things successful and what he does is a show off. The addition or the discussion doesn't gonna make any changes. The ruling government have tried to change its name just because the name INDIA is used by the opposition alliance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "September 11, 2023, 11:30:20 AMLast edit: September 12, 2023, 01:38:40 AM by Sayeds56",
      "body": "Quote from: EarnOnVictor on September 09, 2023, 01:44:34 PMThis is a very good development and I hope it will be able to achieve the reason why the AU and the old members agree on the term. But instead of trying to make it G20 which disfigures the round figure of such like it, why not maintain the G20 irrespective of how many members they have? By the name, it would have easily defined the started member states.As it is now, China is trying to do anti-US and Western states, it's possible the vacuum will still help in maintaining the G20 name without disfiguring it to G21.Instead of viewing it as a mere numerical change, we should focus on the potential implications of extending membership to the entire African continent. This represents profoundly positive development that can potentially create new opportunities for the people of African nations to grasp, subsequently enhancing  the quality of life for themselves and their families.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "September 12, 2023, 04:41:39 AM",
      "body": "Quote from: elevates on September 09, 2023, 12:38:41 PM✂✂✂✂BTW, The Chinese president was not present in this meeting nor did Zelensky and Putin. I can understand the problem with Putin & Zelensky, what I did not understand was why the Chinese premier thought of canceling his visit. A few days back he was present at the BRICS summit which for me looks kind of awkward. Do you guys think he canceled his visit because of the existing border issue with India or something else?✂✂✂✂A lot of drama is going on behind the curtains. For the last few years, India have been actively trying to move the manufacturing units from China to it's territory with a lot of success being achieved this year. On top of that, China believes that India is the reason why a number of participants have recently pulled out from the Belt and Road Initiative (BRI). And during the past few months, India managed to replace pro-China regimes with pro-India governments in smaller countries such as Nepal and Sri Lanka. China appears to be in the backfoot at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 12, 2023, 05:22:11 AM",
      "body": "It's lovely to see all positive comments. I believe the current success of India is a very strong indicator of future growth. Especially the shipping corridor which will connect the EU and African Union from India. Smaller and economically poor countries have now understood that China is not their friend. They have learnt from Sri Lanka's failure and they have seen how India has extended a billion dollar support during the crisis. Also India has a history of non violance it is indeed one of the oldest civilizations in the world which used to control 37% of world GDP before British came in. When it comes to a power balance game, everyone will choose a good partner and not an expansionist one like China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "September 12, 2023, 11:33:31 AM",
      "body": "Quote from: romero121 on September 10, 2023, 11:49:38 PMWhen a country have got wider plans with the associated nations it is being praised. This is really a great move in terms of politics, but the person who had been praised for such an addition should have the same mind way of thinking ruling the people within the country. Everything is connected to electrol politics, but there should be humanity. The ruling government have been very clear with the divide and rule. The target is to divide people based on religion and win the elections. A leader that is being driven by religion can never make things successful and what he does is a show off. The addition or the discussion doesn't gonna make any changes. The ruling government have tried to change its name just because the name INDIA is used by the opposition alliance.India is a democratic country, it is one of the biggest democracies in the world. It does have the largest population in the world and small issues do happen which get reported in the media. Indian political focus under the Congress was to suppress the majority and uphold the biggest minority, which is the Indian Muslim. Under the ruling party that has been stopped and a lot of development work has been done for that community. If you think the ruling party is indulging in divide and rule politics then you have zero idea about India. PM Modi is the reason why India a country from the Indian subcontinent had hosted the G20 summit. He is the reason why India is projected to become a third biggest economy in the world by 2030. He is the reason why every big global economy wants to invest in India. You won't understand anything as you put religion first in all the accomplishments India achieved under his leadership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "September 12, 2023, 11:54:59 AM",
      "body": "Quote from: elevates on September 12, 2023, 11:33:31 AMIndia is a democratic country, it is one of the biggest democracies in the world. It does have the largest population in the world and small issues do happen which get reported in the media. Indian political focus under the Congress was to suppress the majority and uphold the biggest minority, which is the Indian Muslim. Under the ruling party that has been stopped and a lot of development work has been done for that community. If you think the ruling party is indulging in divide and rule politics then you have zero idea about India. PM Modi is the reason why India a country from the Indian subcontinent had hosted the G20 summit. He is the reason why India is projected to become a third biggest economy in the world by 2030. He is the reason why every big global economy wants to invest in India. You won't understand anything as you put religion first in all the accomplishments India achieved under his leadership. India's key advantage is that it is civilized and deliberate. India does not make itself the \"navel of the earth\", nor does it deny progress, development and universal values. It does not try to \"make friends against anyone\", but tries to bring other countries into the CIVILIZED world for effective and equal interaction. Especially now is a great moment - the \"Chinese fairy tale\" may be starting its sunset and slipping into totalitarianism and opposition to Western civilization, as well as using predatory methods of absorbing other countries' resources and economies. India is wiser and has a great chance to become the leader of the so-called \"Global South\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "September 12, 2023, 12:06:10 PM",
      "body": "India is a country that has a dense population, and this is a resource to build a better country by relying on human resources, India needs a lot of support and investment to become a prosperous country, we know that many intelligent people come from from India and now serving in big world companies, it shows that India has the motivation to make its country better.This expansion aims to increase possibilities and increase cooperation with many countries. If the Indian people receive education like China during the development years, I think India will be more advanced than China itself through this event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "September 12, 2023, 03:34:18 PM",
      "body": "Quote from: Juse14 on September 12, 2023, 12:06:10 PMIndia is a country that has a dense population, and this is a resource to build a better country by relying on human resources, India needs a lot of support and investment to become a prosperous country, we know that many intelligent people come from from India and now serving in big world companies, it shows that India has the motivation to make its country better.This expansion aims to increase possibilities and increase cooperation with many countries. If the Indian people receive education like China during the development years, I think India will be more advanced than China itself through this event.Indeed, India has vast and dense population, that can be a valuable resource for its development and progress if educated and trained properly to meet the challenges of emerging technologies. Investing in education is crucial for India and African nations who have recently gained membership status of BRICS organization. This investment is vital to effectively take benefit of potential opportunities that this organization can bring among member counties in terms of mutual investment and trade collaborations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 12, 2023, 04:21:36 PM",
      "body": "Quote from: 348Judah on September 10, 2023, 10:52:51 PMThis is a good move from India, they can try to make an effective progress through this, it's not all about forming a clique that matters but seing governments coming together to a cause of a progressive unity and development among themselves, we are expecting them together with other leaders to form a leadership worth emulation, think more about the people than themselves, also make policies that will lead to massive development more than ever before, am so excited seing some of the African countries in attendance, this will give them more insights to what more is expected of them to deliver to the people they govern. There is no difference between economic partnership and political partnership because they work together. If an economic bloc has political issues with another bloc, they are going to collaborate in support for one another. So it is also a clique that india is fostering whichever way that we look at it. India is gradually getting into competition with China and even US wiih her large population. The success of the summit is laudable since it has increased in numerical strength which will further give india space in competing in African economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 12, 2023, 04:54:22 PM",
      "body": "Quote from: Juse14 on September 12, 2023, 12:06:10 PM...This expansion aims to increase possibilities and increase cooperation with many countries. If the Indian people receive education like China during the development years, I think India will be more advanced than China itself through this event.I have read before in several economic and societal insights that the biggest resource of India is indeed her people and education is essential if they expect to play a big part in the coming multy polarized world the BRICS is aiming to build. Though, If you asked me, I still remain quite skeptical on how far friendly relations between China and India can go, keeping in mind those are countries which have current territorial disagreements. Also, even though we could argue that India should also keep their eyes on the energy market and not depend on Russia or China in the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}