{
  "id": "topic_5422199",
  "title": "albon",
  "author": "albon",
  "created_time": "November 19, 2022, 01:00:20 PM",
  "content": "Hello guys,With this ordeal going on it seems much-lost faith and bailed as if the whole market is going to vanish. This kind of thing happens more often in the stock market with inside trading, embezzlement, etc. In reality, it’s a perfect time to get in with everything dropping so low. It will come back and come back bigger than ever after this dies down and there will be improvements to hopefully prevent this from happening again. So do not lose hope and know that the bad time will inevitably pass, and you may not be able to make up for this opportunity again. Just my opinion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422199",
  "comments": [
    {
      "author": "livingfree",
      "created_time": "November 19, 2022, 01:32:07 PM",
      "body": "It's true that it's good to pick up those coins that are dropping and low. But to remind everyone, there could be people that are still optimistic about the FTT. Just like Luna, UST, Lunc and USTC. FTT isn't different from them, it's unlikely to recover and anyone who will try to think that it'll still recover, you're just putting the risk on your hand and money by thinking like that.It's close to impossible that these tokens and coins will recover even we go back to the bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "November 19, 2022, 03:44:29 PM",
      "body": "True but some people are doing the opposite thing like they are feeling worry to accumulate the tokens that already dropped so hard to the bottom. The only problem is people got scared when everything gone down caused by they have not yet sold at the peak price. The current situation would be good for people who have sold at the peak price but for those who never sell at the peak price and they have no any money to accumulate the cheap tokens from the market. It may take even longer for market to recover. So many incidents have been draining the trust from people to the crypto especially cex. This how i don't like when everything being dominated by centralized ecosystem and people put less trust to the something build in the code. I've been accumulating some. i feel good with the current price of cryto. Another big cycle may come soon again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "November 19, 2022, 03:49:55 PM",
      "body": "What has happened recently it’s really something that it’s only in crypto with that kind of fast volatile movement. I think that’s unique to crypto markets since it is 24/7. For sure there are those type of insider trading and other stuff that you have mentioned in Cryptos, but it’s just really hard to pinpoint it.I think when all of this is over, it’s going to be a boring again and people hopefully would get more into it again. One of the greatest time to buy it now I think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "November 19, 2022, 03:59:45 PM",
      "body": "In every market downfall, investors are either excited, frustrated, or anxious. Some people would try to pull out their investment  from exchanges and wallets, while some cannot stand still and wait for the market price to go up again. We've seen such instances before and the market always manage to climb back. It is just that we are still facing problems which contributed to the market crash months ago.Given that there are sudden positive changes with the market price but I doubt that this is already the start of bullish season. And this is why there are investors who are looking forward with the market price increase because profit will be assured on their end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 19, 2022, 04:09:30 PM",
      "body": "Quote from: crwth on November 19, 2022, 03:49:55 PMWhat has happened recently it’s really something that it’s only in crypto with that kind of fast volatile movement. I think that’s unique to crypto markets since it is 24/7. For sure there are those type of insider trading and other stuff that you have mentioned in Cryptos, but it’s just really hard to pinpoint it.I think when all of this is over, it’s going to be a boring again and people hopefully would get more into it again. One of the greatest time to buy it now I think.you mean the FTX fiasco to be over?  its going to take long. media is overly up to blast it so the senate and congress will finally put a regulatory body. that's what SBF is bribing for.coming back bigger is what all believers of crypto is hoping for. one could only wish he has more money right now to buy while at this low point. but the fear still here yet. they are still waiting for the cascading effect of FTX, the crypto doomsayers had been saying it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 19, 2022, 04:10:58 PM",
      "body": "Quote from: albon on November 19, 2022, 01:00:20 PMHello guys,With this ordeal going on it seems much-lost faith and bailed as if the whole market is going to vanish. This kind of thing happens more often in the stock market with inside trading, embezzlement, etc. In reality, it’s a perfect time to get in with everything dropping so low. It will come back and come back bigger than ever after this dies down and there will be improvements to hopefully prevent this from happening again. So do not lose hope and know that the bad time will inevitably pass, and you may not be able to make up for this opportunity again. Just my opinion.Weak hands are always into the opposite side, when they see market crashes and FUDs all over about cryptocurrency by mainstream media then they lose hope completely and sell their crypto assets for loss meanwhile the experienced investors utilizes this perfectly by accumulating as much as they can.This happens everytime when bear market hits, when a big crypto related company broke, a big project becomes total failure but at the end this is not the end of the world and we all have to pass through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "November 19, 2022, 04:15:24 PM",
      "body": "All alts follow Bitcoins, so as Bitcoins are down, all market is red also. It doesn’t mean that the end of cryptos are near. It’s just basically another opportunity for the buyers to buy these high priced coins in affordable price. So we need to take this bear market positively, and take full profits from it. Moreover this is the end of the year, this time as seen previously, all the cryptos take the pace, so buy enough and hold for sometime. Then enjoy profits later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "November 19, 2022, 04:30:41 PM",
      "body": "This is true we all panic about the market going dip everyday by day without knowing it's creating a new chance for you and I to venture into the market. I believe people always asked about when is bull and whenever is bull they will keep asking when is bear but my greatest surprised is that they don't always utilized the opportunity when it comes to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "November 19, 2022, 04:32:31 PM",
      "body": "Quote from: livingfree on November 19, 2022, 01:32:07 PMIt's true that it's good to pick up those coins that are dropping and low. But to remind everyone, there could be people that are still optimistic about the FTT. Just like Luna, UST, Lunc and USTC. FTT isn't different from them, it's unlikely to recover and anyone who will try to think that it'll still recover, you're just putting the risk on your hand and money by thinking like that.It's close to impossible that these tokens and coins will recover even we go back to the bull run.Case of FTX I don't think it's the same as Luna, Luna crashed but then with help from exchanges you can see it still hasn't been delisted from the exchange. Currently, binance is still supporting the Lunc team as well as supporting the token burn although it has not made any difference yet. But in the case of FTT, exchanges gradually delisted it from their exchanges and put an end to FTT. This is also better for investors, many investors are still hopeful or still want to gamble with FTT because they still hope it will recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 19, 2022, 04:41:08 PM",
      "body": "Those who has been on the crypto space always understand about the pricing and instability, they should note it's seasonal this actions is what propelled the buying and selling and shouldn't expect the market to be stagnant in a position rather should move, the acts of this movement is what causes bull and the bear market. I have been here for some couple of years now I don't get disturb or even panic over the market because I know it will all turned bull anytime sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "November 19, 2022, 05:38:14 PM",
      "body": "Quote from: albon on November 19, 2022, 01:00:20 PMHello guys,With this ordeal going on it seems much-lost faith and bailed as if the whole market is going to vanish. This kind of thing happens more often in the stock market with inside trading, embezzlement, etc. In reality, it’s a perfect time to get in with everything dropping so low. It will come back and come back bigger than ever after this dies down and there will be improvements to hopefully prevent this from happening again. So do not lose hope and know that the bad time will inevitably pass, and you may not be able to make up for this opportunity again. Just my opinion.Markets like this will continue to occur because Bear and Bull are cycles that usually occur in the market. it is also a natural selection for altcoins to keep growing.Don't take the wrong step, maybe you have often heard \"Whales always buy below\"Quote from: livingfree on November 19, 2022, 01:32:07 PMIt's true that it's good to pick up those coins that are dropping and low. But to remind everyone, there could be people that are still optimistic about the FTT. Just like Luna, UST, Lunc and USTC. FTT isn't different from them, it's unlikely to recover and anyone who will try to think that it'll still recover, you're just putting the risk on your hand and money by thinking like that.It's close to impossible that these tokens and coins will recover even we go back to the bull run.True, it is difficult to get back up if you have received bad value from investors, maybe you can only survive and slowly collapse like the previous cryptos.If the community and investors have been disappointed so that they experience losses, it is impossible to repair the reputation that has been tarnished.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "November 19, 2022, 09:15:34 PM",
      "body": "Similar incidents takes place, whenever something happens we need to learn and understand the market. The market being speculative, it reacts to Influencers who have hold over the market. In two days time the exchange that is placed on the second position after Binance completely got collapsed out of the liquidity problem. The same is being used as the opportunity by Binance.The market will have its recovery, but it takes time. We need the patience. In the past when similar incidents happen, people used to loss their hope and leave the market. Now things were different, people consider it an opportunity and find ways to grow the investment. This is why market stands strong at times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "November 19, 2022, 09:42:03 PM",
      "body": "Recover and up trend will always happen, the best thing to do now is to get ready and be prepared for every possibility, buying cheaper coins can be a good option but I don’t suggest to catch those failed project because of a cheaper price, you still have to consider their fundamentals. Buy more now and stay optimistic, the whole cryptomarket will soon rise again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "November 19, 2022, 09:56:43 PM",
      "body": "That is what we thought about crypto and we believe about the history repeat itself. That is why people are still buying despite of the bear situation because they are too positive that one day the market will recover and give them rewards. Buy and Hold...2017, 2021, next. It is very certain that Bullrun will come again and ain't hopeless to see another ATH. What we need is to extend our patience and keep strong from not getting distracted by negative news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lalabotax",
      "created_time": "November 19, 2022, 09:56:59 PM",
      "body": "Of course, in every decline or crash of the market, there will definitely be an increase later. Don't panic, stay calm and be aware of the various possibilities in the future. This is not the end of crypto, so no need to worry. Because the crypto market has its own cycle to keep going up and down. If we become so panic, this will lead us to make wrong decision and make some mistakes and lose our money. SO, face this market era and believe that the market will be bigger soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "November 19, 2022, 10:00:51 PM",
      "body": "Quote from: albon on November 19, 2022, 01:00:20 PMHello guys,With this ordeal going on it seems much-lost faith and bailed as if the whole market is going to vanish. This kind of thing happens more often in the stock market with inside trading, embezzlement, etc. In reality, it’s a perfect time to get in with everything dropping so low. It will come back and come back bigger than ever after this dies down and there will be improvements to hopefully prevent this from happening again. So do not lose hope and know that the bad time will inevitably pass, and you may not be able to make up for this opportunity again. Just my opinion.Well there is not much that we can do about the current happenings and the condition that the whole market is in. So we just can endure it and hope for better time. I think times like this make very clear again, that the first and most important role for investing into crypto is to never invest more than you can afford to lose. And by that i mean if you are having 3000$ on your bank account only put 1000$ or so into crypto and not all of the 3000 $ because you still need some savings if your crypto investment goes completely wrong.If you are following this rule, then you can be pretty relaxed even through markets like this. Of course it is never nice to lose money but if it is \"excess money\" than at least it is not that bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 19, 2022, 10:13:02 PM",
      "body": "Quote from: albon on November 19, 2022, 01:00:20 PMHello guys,With this ordeal going on it seems much-lost faith and bailed as if the whole market is going to vanish. This kind of thing happens more often in the stock market with inside trading, embezzlement, etc. In reality, it’s a perfect time to get in with everything dropping so low. It will come back and come back bigger than ever after this dies down and there will be improvements to hopefully prevent this from happening again. So do not lose hope and know that the bad time will inevitably pass, and you may not be able to make up for this opportunity again. Just my opinion.Well historically, the market has been in a bubble and burst cycle. So right now, its the bear market and on of the worst in recent years, although we have the Covid crisis in March 2020 and the price went down to $3k and everyone is afraid as the price of bitcoin might go to zero and altcoins dying.But that was two years ago and we are still standing. And maybe in the next two years, we will simply forget all this things and we will eventually rise and go on another bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "November 19, 2022, 10:16:01 PM",
      "body": "There are bear and bull seasons not only for the crypto money sector, but also for platforms where all stock market activities are seen. As a result, there will be sharp decreases in the markets after a while, as the continuous rises cannot continue. Because while someone adds wealth to their wealth, some people unfortunately have to lose money. For new investors and small investors, hard falls and bottoms always give the opportunity to become rich. Because every descent also has a serious rise. It is inevitable to make a lot of money with the right investments and the right moves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "November 19, 2022, 10:36:11 PM",
      "body": "Definitely, the market will continue to grow bigger.  Just you wait after this bear market, the cryptocurrency capitalization will boom again.  Aside from the bear market transitioning to the Bull market, the crypto adoption still continues.  With the new users and new funds injecting to the cryptocurrency market, there is no doubt that market will come back bigger.  Aside from that I read from one of the thread here that St. Kitts and Nevis legalize Bitcoin Cash (BCH) as a means of payment[1].  If this happen, the event will bring more investors to the cryptocurrency market.[1] https://bitcointalk.org/index.php?topic=5422150",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}