{
  "id": "topic_5398891",
  "title": "GazetaBitcoin",
  "author": "GazetaBitcoin",
  "created_time": "May 16, 2022, 12:41:52 PMLast edit: February 06, 2024, 08:06:38 AM by GazetaBitcoin",
  "content": "Autor: fillipponeTopic original: Securing Your Seed Phrase with Washers IntroducereCustodia seed-ului este un subiect care mereu a fost apropiat de inima mea. Pentru prima dată, Bitcoin este un sistem care pune în mâna utilizatorilor responsabilitatea suveranității lor financiare. Aceasta presupune o balanță dificilă între oportunități și riscuri, dată fiind natura intrinsecă a Bitcoin. Dreptul de proprietate asupra bitcoin aparține persoanei care poate semna digital o tranzacție folosind cheia privată corespunzătoare și nimănui altcuiva. Persoană, instituție sau bot, oricine controlează cheia privată controlează și fondurile bitcoin. În mod evident, aceasta implică o importanță fundamentală a custodiei asupra bitcoin, atât referitor la posibilitatea de a semna tranzacții, cât și referitor la posibilitatea unor efecte adverse, prezente sau viitoare, de natură personală, socială sau tehnologică, ce ar putea fi întâmpinate în câțiva ani. Pericolele tehnologice, personale și legale trebuie evaluate atunci când se alege dispozitivul de stocare: Pentru un ghid amplu de alegere a metodei de păstrare a seed-ului puteți citi acest articol, scris tot de Jameson:Cum Realizăm o Copie de Siguranță a Seed-uluiDesigur, aspectul important este acela că Bitcoin conferă opțiuni pentru custodie personală, ceea ce este ceva exclus în finanțele tradiționale, aceasta reprezentând o caracteristică unică, ce îi împuternicește pe bitcoineri în diverse scenarii, dar este și ceva trist, deoarece așa ceva va fi tot mai rar în câțiva ani. Problema custodiei personale este una dificilă, iar cantitatea de monede bitcoin pierdute este un avertisment pentru oricine vrea să meargă pe acest drum: provocările sunt în cele mai diferite forme. Am cercetat acest subiect timp de câțiva ani și acesta a fost unul dintre primele articole care mi-a stârnit curiozitatea: Oferirea de satoshi generațiilor viitoareQuoteRecent, am primit sarcina de a oferi, în dar, niște satoshi unui nou-născut, care ar trebui să intre în posesia lor după ce va crește, în aproximativ 18 ani de acum înainte. Provocarea a fost mai delicată decât m-am așteptat la început, întrucât există multe căi de a stoca bitcoin, fiecare presupunând un anumit compromis și, în același timp, este greu de prezis situația industriei Bitcoin peste douăzeci de ani în viitor.Citind acest articol am realizat că păstrarea în custodie a cheii private prin intermediul unui portofel fizic avea câteva avantaje incontestabile: independență față de dezvoltările tehnologice ale portofelelor și ale suportului IT securitate, privită din perspectiva avarierii suportului fizic ușurință în utilizarea dispozitivului primit în dar.Ulterior, navigând pe Internet, am găsit o pagină pe website-ul lui Jameson Lopp, un Cypherpunk renumit și un expert în securitate, unde testase diverse Dispozitive Metalice de Stocare a Seed-ului: Test de Stres al Dispozitivelor Metalice de Stocare a Seed-uluiÎn prima rundă de teste, unul anume mi-a captat atenția, întrucât era prima implementare a ideii de ștanțare a seed-ului pe șaibe, a lui SAFU Ninja:  Recenzie SAFU NinjaIdeea extraordinară este descrisă pe blog: Creează-ți Singur, Ieftin și Ușor, Dispozitivul Metalic de Stocare Bitcoin – Safu Ninja Noutatea constă în realizarea dispozitivului de stocare, folosind piese ce pot fi obținute cu ușurință de la magazinele de feronerie, pentru ștanțarea seed-ului. Evident, partea cea mai importantă a muncii a constat în ștanțarea literelor pe șaibe, proces ce s-a dovedit a fi unul lung, obositor, și care nu a condus mereu la rezultate perfecte, atunci când a fost realizat manual. Ca urmare, niște meșteșugari au realizat o matriță adecvată scopului, pentru a facilita orientarea corectă, spațiile de separare și ștanțarea corectă a literelor. Cea mai cunoscută matriță este cea creată de Cryptocloacks.Cu această matriță se pot ștanța literele în mod precis și cu spațiere și poziționare corecte. De asemenea, matrița lui n0nce este disponibilă pe BitcoinTalk.org. Matrița cu Șaibe de Oțel a lui n0nce Avantajul acestei matrițe constă în două aspecte: în primul rând, este vorba de un dispozitiv modular, care se poate astfel adapta la dimensiuni diferite, atât ale șaibelor (dispozitivul a fost creat în mod special pentru a ștanța șaibe de dimensiuni mari), cât și, mai presus de orice, ale percutorului.În al doilea rând, n0nce a creat un design îmbunătățit al matriței Blockmit, fortificând-o în diverse părți și îmbunătățind design-ul cu toleranțe scăzute, pentru a reduce jocul mecanic dintre părți. În restul ghidului voi folosi ca referință matrița lui n0nce, însă modul de operare este același. La anexă vom analiza detaliat diferențele celor două dispozitive.Așa cum corect a observat și Federico Tenga, standardul BIP39 prezintă “riscul de învechire” și, mai important, riscuri determinate de calea de derivație utilizată. Din acest motiv, el a utilizat formatul WIF in teste.Deși am înțeles perfect și îi împărtășesc motivele de îngrijorare, am decis ca, în cadrul primei iterații a proiectului, să apelez la mult mai folositul standard BIP39. Cred că acesta prezintă o balanță mai bună a riscurilor și beneficiilor referitoare la posibilitatea efectivă de recuperare efectuată de destinatarul mesajului. Nimic nu împiedică un hack asupra cheii în acel format al șaibelor: este doar un șir de 51 caractere, deci ar fi nevoie de 7 șaibe. Primul care a descris întregul proces pe Internet a fost econoalchemist: Securizarea unei fraze seed Bitcoin pe șaibe din oțel inoxidabil (pe scurt)Ce pot spune, este un tip foarte tare. Un test complet, care conține și o lampă cu foc! Evident, nu aspir atât de departe și aș fi mulțumit doar să ștanțez șaibele cât de bine pot, astfel încât să fie rezistente la foc, rugină și presiune. Și, tind să cred, nu vor diferi prea mult față de testele realizate de econoalchemist și Lopp. [TOP]Lista de CumpărăturiAșa cum a fost menționat, avantajul unei companii este acela că are piese deja disponibile. Aceasta ajută, cu certitudine, la obținerea unui oarecare nivel de securitate, dat de anonimat, întrucât nimeni nu va ști ce faci. Într-adevăr, așa cum sugerează în mod direct și ghidul lui Safu, dacă ai anumite piese la îndemână acasă, folosește-le pe acelea, în loc să cumperi altele. Dacă știi pe cineva care are un percutor, împrumută-l spunându-i că trebuie șă ștanțezi niște chei, în loc să cumperi (desigur, fără a menționa ceva despre bitcoin). Să luăm următoarele modele ca sugestii: ȘaibeȘaibele cu diametru exterior de 24 mm și diametru interior de 8 mm, din oțel inoxidabil, sunt suficiente. Acestea pot fi găsite la orice feronerie. Pentru cheie sunt necesare 24 șaibe, iar pentru dispozitive adiționale de securitate mai este nevoie de 4 șaibe. Asigură-te că ai la dispoziție mai multe șaibe de rezervă, pentru încercări și inevitabile erori.  Recomand ca șaibele să fie din oțel inoxidabil. Cele mai rezistente la coroziune tipuri de oțel sunt 304 și 321.ȘurubAvem nevoie de un șurub de 60 mm, cu piuliță, diametru de 8 mm (cei mai ageri au observat deja că diametrul este același cu cel al șaibelor!).Materialul trebuie să fie, și în acest caz, oțelul inoxidabil. BarosEste nevoie și de un baros. Un ciocan nu este suficient, întrucât greutatea este necesară pentru a imprima destulă forță percutorului, pentru a ștanța corect șaiba. Din nou, nimic sofisticat. NicovalăCine ar fi crezut că pasiunea pentru bitcoin l-ar fi făcut să cumpere o nicovală!Dată fiind forța necesară pentru a ștanța corect șaibele, este nevoie de un suport robust, care să nu se strice de la impactul loviturilor. Această nicovală mică, de 1kg, cea mai mică pe care am găsit-o, este perfectă pentru tine. Desigur, una mai mare este mai bună, dar dacă vrei să economisești niște bani poți folosi partea plată a barosului sau o bază metalică. Evident, aspectul important este acela de a avea o suprafață suficient de mare pentru a garanta o stabilitate bună a matriței și a forței aplicate cu ciocanul. Ca o chestiune ce ține de preferință, trebuie să spun că mi se pare că această mini-nicovală este foarte bună pentru lucru. ȘtanțeReferitor la setul de ștanțare, am ales următorul set percutor de 6 mm: este un set de 36 caractere, toate fiind litere, numere, și caracterul “&”. Calitatea este bună, iar dimensiunea ștanțelor este adecvată. Nu am găsit niciun defect în timpul utilizării, iar calitatea ștanțării nu s-a deteriorat în timpul lucrului. Etichete de SiguranțăAcestea sunt etichete adezive care, odată lipite, se rup, lăsând suprafața marcată. Pentru a închide containerul va fi nevoie de etichete de siguranță, cele care lasă o urmă atuci când deschidem. Este esențial să fie numerotate individual, astfel ca numărul de serie să poată fi ștanțat pe șaibe. Container ermeticDorim să introducem seed-ul într-un container etanș, atât pentru aspectul estetic, cât și pentru a-i putea verifica integritatea. Am găsit acest container, care are frumoasa culoare portocalie de la bitcoin. Printre altele, diametrul intern este de 25 mm, deci este perfect pentru șaibele noastre. Dacă te decizi să cumperi alt container, asigură-te că diametrul și spațiul interior sunt suficiente pentru păstrarea seed-ului. În acest moment, schema este aproape completă. Mai jos este o imagine de ansamblu a tuturor materialelor necesare.Alte materiale necesare O pereche de mănuși.Un pistol de lipit. Pentru a sigila șaibele. Etichete circulare, pentru securizarea sigiliilor.Cheia privată, în format BIP39.Marker permanent.Aceasta este o recapitulare a tuturor costurilor posibile (cu excepția timpului):Șaibe+Șurub+PiulițăEUR  3.00 (Preț în funcție de greutate)Matriță BlockmitgratisMatriță n0nceEUR 30.00BarosEUR 12.99NicovalăEUR 9.90ȘtanțeEUR 28.79100 Etichete de SiguranțăEUR  12.99ContainerEUR  15.27MănușiEUR  2.50Bandă AdezivăEUR 03.99Cârpe din MicrofibrăEUR 01.00Pistol de LipitEUR 09.50Autocolante CirculareEUR 00.90Marker PermanentEUR 8.13TOTAL EUR 138.96[TOP]Verificarea Ștanțării și Sigilarea Seed-uluiProcedura este foarte simplă. Se introduce șaiba în matriță, având grijă să fie acoperită partea de jos a matriței cu bandă adezivă. Aceasta ajută la imobilizarea șaibei în cadrul suportului, pentru a nu avea opriri la fiecare lovire de baros. Astfel, nu doar că vei evita ștanțarea literelor la distanțe diferite, dar, cel mai important, dacă nu ești satisfăcut de modul de ștanțare al literei, poți încerca să o reștanțezi, suprapunând literele. Acesta este avantajul principal în utilizarea unei matrițe: când lucrezi doar cu mâna, o literă poate fi “stricată” cu ușurință, dacă percutorul nu este lovit în mod optim; în schimb, cu o matriță, procesul de gravare este unul solid și, dacă este executat corect, fiecare literă este imprimată clar și precis. Operațiunea este foarte simplă, și este bine ilustrată de următorul gif: Cele două caneluri superioare sunt folosite pentru a identifica ordinea corectă a cuvintelor, în timp ce restul de 8 caneluri inferioare sunt utilizate pentru ștanțarea cuvintelor. Să ne reamintim că în standardul BIP39 cuvintele au o lungime maximă de 8 litere, iar primele 4 litere sunt suficiente pentru a le identifica în mod unic. Nu trebuie să ne îngrijorăm cu privire la pierderea de date, dacă una sau două litere nu sunt perfect citețe. Plasăm matrița pe nicovală și lovim o dată. Procedăm astfel pentru toate literele și toate cuvintele. Un videoclip, sau, poate două videoclipuri, fac mai mult decât 100 de cuvinte: Stație de lucru exterioară. Observați în prim plan șaibele aruncate. Detalii ale procesului de ștanțare. Vă sfătuiesc să lucrați cu calm. Personal, mie mi-a luat cam o oră și jumătate să ștanțez totul. Am făcut multe greșeli la început și, probabil, dacă nu aș fi luat treaba de la început, aș fi terminat în mai puțin de o oră, dar bine că am avut tot timpul necesar. Evident, trebuie verificat și reverificat faptul că seed-ul a fost scris corect, că au fost scrise corect cuvintele și, mai presus de tot, ordinea. Verificați de două ori, apoi și de trei ori. Nu comparați cu hârtia pe care o aveați tipărită (n.b. – cu seed-ul), ci comparați direct cu portofelul software, pentru a evita erori la transcrierea seed-ului. Verificați cuvânt cu cuvânt, literă cu literă.  Inserați șaibele pe șurub, într-o ordine numerotată, și păstrați mereu suprafața negravată pe aceeași parte. Când ați gravat tot seed-ul, vă sfătuiesc să includeți niște șaibe “speciale”.Prima sugestie este să gravați un număr de telefon de urgență. Nu spune nimeni că utilizatorul care va recupera seed-ul trebuie să fie un expert Bitcoin, și nu este sigur nici faptul că vei avea cum să ajuți respectiva persoană, dacă va dori să intre în posesia fondurilor. De aceea, poți include pe șaibe numărul de telefon al unei persoane de încredere, care îi poate ajuta pe cei care vor încerca să recupereze banii. În plus, pe lângă a avea un om de încredere (“Fură doar un minim de fonduri de care ai nevoie pentru a trăi decent”, i-am spus, amenințându-l voalat că voi bântui orice proprietate pe care ar decide să o cumpere cu banii mei) era și un expert din punct de vedere tehnic, în caz că ar fi intervenit ceva.Am ștanțat numărul de telefon pe o șaibă, față și verso, identificând-ul cu inițialele P1 și P2.Numărul de telefon gravat pe ambele părți; poate era bine să adaug și codul țării!În comparație cu ce am făcut eu, ar fi bine să fie gravat și prefixul internațional (caracterul “+” ar putea fi realizat din două “I”-uri încrucișate). Această parte nu are prea multă legătură cu acuratețea, cât cu a evidenția că este vorba de un număr de telefon.A doua sugestie este aceea de a insera în seed numărul de serie al etichetelor de securizare care vor închide containerul. Când seed-ul este deschis, destinatarul va putea confirma corespondența numărului de serie ștanțat pe șaibe cu acela al etichetelor care tocmai au fost rupte, astfel încât se poate asigura că seed-ul nu a fost alterat. Ulterior, am mai adăugat încă două șaibe, care aveau scrise pe o parte XX SECURITY și cele două coduri de serie, ale etichetelor de securitate corespunzătoare, pe cealaltă parte, acestea urmând apoi să sigileze container-ul. Ceva de genul: Șaibele trebuie să fie gravate cu numărul de serie al etichetei de securitate.Partea din spate.   Odată având totul gravat, am ajuns să dețin următorul echipament: 24 șaibe, conținând cuvintele din seed, una conținând numărul de telefon, iar două având copii ale sigiliilor.Ajuns în acest punct, am semnat și datat două etichete albe și le-am lipit pe șaibele de la extremități. Acesta este primul mecanism de securitate. Imagine de ansamblu a întregului bloc, gata de a fi sigilat.Carcasă metalică sigilată: este compusă din trei piese, partea centrală putând cuprinde câteva șaibe în plus față de cele pe care le-am folosit. În acest moment blocul poate fi sigilat cu lipici la ambele capete, fiecare șaibă având gravate datele corespunzătoare. Odată acoperit în întregime cu lipici, deschiderea blocului ar fi evidentă.Blocul este gata de a fi introdus în tub, care apoi este sigilat cu etichetele de securitate izolate anterior. Tubul este gata de a fi închis. Se poate vedea sigiliul cu lipici fierbinte. Partea semi-transparentă arată eticheta semnată. Containerul închis și etichetat.În mod clar, etichetele trebuie plasate transversal pe deschiderea containerului, pentru a fi eficiente în cazul deschiderii. Dacă tubul este deschis, etichetele ar fi rupte și, dacă ar fi poziționate, numărul serial nu ar corespunde.Este o soluție care are, clar, niște limite: dacă un hoț ar fi determinat, el ar putea înlocui întregul bloc cu unul similar, cu măsuri de securitate asemănătoare (altă propoziție, alte etichete, alte sigilii). Este important să nu arăți nimănui cum ai sigilat seed-ul și ce măsuri de protecție ai luat împotriva furtului.  Unele sugestii finale: Faceți câteva încercări înainte de a începe ștanțarea, pentru a vedea cât de tare trebuie lovit cu barosul pentru ca literele să fie ștanțate corect.Greșelile sunt inevitabile, dar obișnuiți-vă să verificați mereu dacă acțiunea a fost executată corect: poziționarea corectă a șaibei în cadrul matrițeipoziționarea matriței în mod corect pentru ștanțarea fost verificată orientarea percutoruluia fost verificată cu succes operațiunea de gravare.Cele mai multe greșeli pe care le-am făcut au fost din cauza orientării eronate a percutorului. O idee bună ar fi să marcați o parte a caracterului (partea de jos, de pildă) cu un marker permanent, pentru a înțelege imediat cum trebuie plasat în matriță, având o orientare corectă. Rețineți, pentru a fi gravat corect, caracterul trebuie introdus în moduri diferite, variind dacă este utilizat pentru a ștanța numere secvențiale sau cuvinte. Aveți puțină grijă și când vă debarasați de șaibele “greșite”. Nu le lăsați la vedere, nu le aruncați pe toate laolaltă. Dacă aveți o literă orientată greșit, cuvântul tot poate fi citit și, dacă ați ștanțat eronat mai multe șaibe, posibilitatea de a deduce seed-ul este prea mare pentru a fi în siguranță. Înainte de a arunca șaibele, gravați mai multe litere una peste cealaltă, pentru a face cuvintele neinteligibile, apoi aruncați șaibele una câte una, în locuri diverse. Ar fi și mai bine dacă ați pune șaibele în ceva murdar, gen zaț de la cafea sau scutece (mulțumesc @LoyceV). Evident, aceleași sugestii ar trebui urmate și dacă aveți nevoie să aruncați întregul seed, chiar dacă nu mai conține niciun satoshi. Pierderea anonimității fondurilor ar putea înseamna, de asemenea, și pierderea siguranței proprii.Nu am folosit scotch pentu a atașa matrița pe nicovală, așa cum era sugerat în articolul original, întrucât se poate ține și cu mâna liberă. În schimb, banda adezivă cu care șaiba se ține de matriță este esențială, pentru a preveni mișcarea acesteia în timpul gravării. Dar, la acest pas, nu recomand utilizarea unei benzi dublu-adezive, ci a uneia care are adeziv doar pe o parte, cât timp este una solidă (bandă izolier sau \"Americană\").Fiți atenți să nu folosiți prea mult lipici. În ansamblul realizat de mine, șaibele intră la fix în tub; dacă puneți prea mult lipici s-ar putea să nu mai intre.Ștanțarea șaibelor pe ambele părți este posibilă. Dacă procedați așa, ați avea nevoie doar de jumătate din numărul total de șaibe. Aceasta ar permite folosirea unui container mai mic, sau adăugarea de informații extra pe restul șaibelor.După scrierea acestui ghid am observat că pe site-ul Safu Ninja apărea următorul link, care conține, la rândul șau un link, de unde se poate cumpăra un set pentru tot ce am scris în acest ghid. CAPSULĂ DE HODL 42Evident, cine vrea poate cumpăra dar, mergând pe ideea că “anonimitatea înseamnă securitate”, cred că nu ar fi indicat să lăsați un site obscur să știe că vreți să cumpărați un astfel de set pentru a stoca criptomonede. O mică paranteză referitoare la ideea de a divide seed-ul în locuri diferite Ideea de a diviza seed-ul în părți diferite este una controversată. Fiecare decizie strategică în acest sens trebuie luată după analiza riscurilor caracteristice cu privire la furtul sau pierderea seed-ului, experiența tehnologică, timpul când are loc realizarea copiei de rezervă, caracteristicile personale are celor care vor trebui să recupereze copia de rezervă etc.Împărțirea seed-ului în mai multe locații scade șansele unui furt, dar îngreunează mult lucrurile, implicând posibilitatea de a pierde seed-ul. Cu certitudine, în cazul unui multisig (2 din 3, de exemplu), cunoașterea faptului că unul dintre seed-uri este compromis poate ajuta la securizarea fondurilor fără teama de a interveni prea târziu, așa cum este cazul unui seed unic.Să spunem că acest ghid se concentrează pe modul de păstrare al unui seed unic, fară a intra prea mult în detalii de configurare (semnătură unică / redundanță / divizare / secretul lui Shamir / multisig). [TOP]ExtraO comparație a matrițelor suportate Când am început să mă gândesc la acest ghid, am realizat că partea cea mai dificilă va fi aceea de a putea face ca matrițele să ștanțeze șaibele. Desigur, din perspectiva anonimității, ar fi bine ca totul să fie făcut fără a căuta prin prea multe adrese pe Internet. Așa că am încercat să caut pe Internet. Am trimis un email unei firme de ștanțări de la mine din oraș, prin intermediul ProtonMail, în care am atașat schema Blockmit, iar răspunsul a fost următorul: QuoteSalut,prețul ar fi de aproximativ 30€ + TVA, cu livrare în 2 zile lucrătoare, cu printare 3D FDM în ABS.Cu stimă,Date fiind problemele legate de anonimitate și de costuri, am decis să fac o încercare și pe un canal de Telegram dedicat printării 3D, cu livrare personală a produsului. Din fericire, doi utilizatori au răspuns rapid. Primul mi-a scos gratis la imprimantă schema Blockmit, pentru că a fost drăguț și, mai presus de orice, pentru că a fost curios la ce o voi folosi. Al doilea utilizator (Telegram: @liiuk99) mi-a cerut 30 euro, motivând prețul printr-o calitate superioară a produsului oferit (din spusele sale, folosea o imprimantă și un filament de carbon de calitate superioară).  Am decis ca imprimata “profesională” să printeze schema lui n0nce, pentru a o compara cu cea Blockmit. Nu am experiență în printarea 3D. Totuși, din ce am văzut pe Internet și din ce imi spusese și cel cu printarea gratis, costul materialului este unul neglijabil. Așa că am vrut să văd dacă este vreo diferență între cele două obiecte, după ce ele erau printate. Din păcate, cel cu imprimanta \"profesională\" a refuzat să imi printeze și schema Blockmit, chiar dacă era doar pentru un test, așa că testul nu este în totalitate finalizat, dar cred că mi-am făcut deja o idee clară.    Comparație a celor două matrițe: cea a lui n0nce este vizibil mai mare și mai robustă. Totuși, am fost surprins și de robostețea celei Blockmit.Partea dorsală a piesei centrale a celor două matrițe: observați diferența de finisare.Produsul ieftin este “urât” din punct de vedere estetic și are joc mare între părți. Nu știu dacă este de la schemă sau de la calitatea tipăririi, dar există joc mare între cele două piese, fapt ce împiedică să “tipărești” literele exact în același loc. Mai mult, nici percutorul nu este perfect blocat în suportul său, întrucât poate oscila ușor. În final, odată introdus, acesta nu permite “retipărirea” cu precizie a literei, în caz că lucrurile nu ies bine la prima încercare. Pe partea cealaltă, matrița lui n0nce, pe lângă că este mai mare (justificând, parțial, costul mai mare de printare), pare să fie și mai robustă, și nu are pic de joc între cele două părți componente sau între componente și percutor. n0nce oferă schema cu două dimensiuni diferite pentru percutor. Din nefericire, am întâmpinat probleme: în pofida măsurătorii făcută cu atenție, gaura s-a dovedit a fi prea mică. A trebuit să cumpăr o pilă pătrată și să pilesc gaura, pentru a o mări suficient, astfel încât să intre percutorul. Pe lângă problema de costuri, imprimanta mea de încredere era întâmplător din același oraș ca mine, altfel livrarea ar fi fost mult mai scumpă și, peste toate, m-ar fi forțat să vin cu diverse tertipuri pentru a nu-mi dezvălui identitatea.Până la urmă, cred că este mai bine să fie niște găuri rigide, care să fie pilite în timpul ștanțării, decât unele mai mari, care previn poziționarea corectă și precisă a percutorului. Din acest motiv am cumpărat o pilă pătrată de la firma Leroy Merlin, care este de încredere. Era un accesoriu despre care nici nu știam că există, dar care s-a dovedit a fi perfect acestui scop: era suficient de largă pentru a intra în gaură, și elimina încet materialul în exces. Forma pătrată a pilei a fost esențială pentru a mări gaura cu acuratețe. După aproximativ 30 minute de pilire a tuturor pereților interiori ai găurii, aceasta a fost suficient de mare pentru percutor.n0nce a lansat o schemă nouă, cu o matriță complet ajustabilă. Design-ul este parametric și poate fi ajustat pentru orice șaibă și orice percutor. Aceasta favorizează substanțial refolosirea elementelor. Mă gândesc la toate elementele, nemaifiind nevoiți să cumpărăm unele care să corespundă dimensiunii matriței. Trebuie doar să alegem niște dimensiuni (diametrele și grosimile șaibelor, și dimensiunile percutorului), pentru a avea o schemă realizată manual, perfectă pentru nevoile fiecăruia!Mi-a luat 30 minute pentru a mări suficient gaura cu pila. Pila pătrată este fundamentală. Materialul este chiar dur.Am fost surprins de “rezistența” materialului, care nu s-a deformat în timpul pilirii, păstrându-se omogen și prezentând o rezistență excelentă la tratamentul aplicat. Printre altele, de la uzură, gaura va deveni inevitabil mai mare, iar percuția va fi mai puțin precisă. De fapt, în cadrul testelor, potrivirea a fost atât de precisă, încât, la început, percutorul “se chinuia” să treacă prin suport. La final, acesta era foarte larg, și nici măcar reștanțarea literelor nu mai era precisă. La finalul procesului de tipărire am încercat să compar cele două matrițe din perspectiva calității retipăririi.Contrar așteptărilor, matrița Blockmit se achită mai bine de sarcini decât cea a lui n0nce. Dar există un motiv foarte specific. După cum se poate vedea, calitatea de retipărire a matriței lui n0nce este mai slabă – un rezultat neașteptat. Comparația nu este corectă, întrucât matrița lui n0nce a fost folosită de-a lungul întregului experiment, în timp ce matrița Blockmit este practic nouă. Aceasta înseamnă că, din cauza uzurii și a loviturilor de baros, gaura din matrița lui n0nce s-a mărit considerabil, permițând acțiuni neomogene ale percutorului, fapt ce se reflectă în ștanțarea imprecisă a literelor pe șaibă. Deși nu am o dovadă matematică, sunt sigur că, dacă aș fi gravat 24 cuvinte cu matrița Blockmit, rezultatul ar fi fost și mai rău. Mai multe idei pentru prevenirea alterăriiSigilarea seed-ului este o chestiune complicată. Metoda mea, mai degrabă artizanală și neuniformă, nu mă mulțumește. O idee ar fi aceea de a face ca însuși containerul să prevină manipularea.Capsulă Pentru SeedQuoteUn recipient de plastic care protejează seed-ul.Așa cum o poți face și tu, și un potențial sabotor ar putea să-și printeze singur un astfel de container. Sugestia va fi mereu aceeași: fiți creativi în ceea ce privește culorile, scrisul și detaliile pe care le-ar putea ști oricine. O altă metodă entuziasmantă o constituie Sigiliul Entropie, care este un prototip necomercial al unui “sigiliu pe bază de entropie\". O implementare similară o constituie BitBox TeP.Există, de asemenea, și o versiune artizanală, care conține un sac de fasole, leguminoase sau altele de același gen, așa cum au explicat aici @dkbit și @o_e_l_e_o:Quote from: o_e_l_e_o on March 08, 2022, 06:40:00 PMQuote from: fillippone on March 08, 2022, 06:32:47 PMScuze, nu sunt suficient de inteligent pentru a înțelege cum funcționează asta. În plus, acum nu trebuie să ai grijă de un seed, ci de o poză?Iei un container de plastic, pentru mâncare, transparent.Îl umpli pe jumătate cu diverse soiuri de orez, grâu, leguminoase, semințe, confetti, bile colorate în diverse culori, etc.Plasezi între ele seed-ul.Umpli restul cutiei cu elementele de mai sus, până dă pe afară.Fixezi capacul, sigilând conținutul astfel încât să nu se miște.Faci o poze cutiei din unghiuri diferite.Ascunzi cutia.Când vei umbla în viitor la cutie, poți face comparație cu pozele făcute în trecut, pentru a vedea dacă arată la fel. Dacă a deschis cineva cutia, pentru a-ți accesa seed-ul, toate grăunțele s-ar fi mișcat înăuntrul cutiei, și ar arăta diferit față de poze.O idee ușor diferită constă folosirea unui sclipici pentru unghii. Nu Vrei Să-Ți Umble Nimeni La Laptop? Pune-i Sclipici de UnghiiÎn ambele cazuri, conceptul este același: creezi un tipar aleatoriu, pe care-l compari apoi cu ce vezi în fața ochilor. Chiar dacă asta nu-l împiedică pe hoț să acceseze seed-ul, măcar ai dovada evidentă a furtului. Valoarea acestor soluții manuale este irefutabilă, din perspectiva “securității prin anonimitate”, care este și ideea de bază a acestui ghid: dacă atunci când cumperi un “TeP” sau un “Sigiliu Entropie” le comunici atât producatorului, cât și curierului, că ai nevoie de un “container pentru ceva prețios”, când cumperi fasole sau sclipici nu te va întreba nimeni la ce-ți trebuie.Conceptul este interesant: totuși, limita constă în imposibilitatea de a avea un mecanism anti-manipulare care să fie încapsulat în obiectul propriu-zis, iar aceasta face ca soluția să fie imposibilă. Dacă era posibilă introducerea în “Sigiliul Entropie” a unei poze care să arate cum ar trebui să fie tiparul, ar fi fost perfect. În schimb, cine trebuie să facă verificarea corectitudinii trebuie să aibă atât partea de sus, cât și poza, pentru a verifica tiparul care “certifică” corectitudinea. Aceasta nu se poate realiza mereu. De asemenea, nu-mi place ideea de a avea nevoie de o aplicație: ce se întâmplă dacă aplicația nu este actualizată pentru o anumită perioadă, iar apoi este ștearsă din magazinele de aplicații? Se pierde dreptul de a verifica?Ultima alternativă constă în pungi anti-manipulare, care sunt vândute de Shift Crypto. Pungi Anti-ManipulareQuote Pungile noastre anti-manipulare sunt robuste, dar elementul esențial constă în banda de securitate, care ne permite să sigilăm pachetul și conținutul său în siguranță.Banda de securitate are caracteristici unice, astfel că poți depista rapid orice încercare de deschidere a produsului.Aceste produse sunt ca niște plicuri, cu sigilii, care dezvăluie deschiderea sau tentativa de deschidere, prin intermediul unor diverse verificări și marcaje.Mai jos sunt link-urile care m-au inspirat în scrierea acestui eseu: Capsula Mea Crypto din OțelUn ghid care te învață cum să-ți creezi singur un container pentru seed. Creează singur un portofel rece, cu șaibeUn ghid reușit, care a reprezentat o bună sursă de inspirație la scrierea acestui topic. Este in spaniolă, dar cred că nu există probleme majore în a înțelege conținutul. Sunt foarte impresionat de calitatea gravării din ghidul de mai sus, ceva ce eu nu am reușit. Dar nu e niciun motiv de îngrijorare, este doar ceva estetic. Probabil, ar trebui să pun în practică ceva din șmecheriile implicate în ștanțare. Matrița Lui n0nceSecuritate prin anonimitate[TOP]ConcluziiM-am distrat mult când am scris acest ghid. Trebuie să admit că mi-a placut partea de meșteșugărie pe care o implică această cale de securizare a seed-ului. În plus, cred că este amuzantă ideea de a securiza averea, de-a lungul generațiilor, cu un baros și o nicovală. Nu sunt sigur că această variantă de stocare a seed-ului este pentru toți, întrucât cred există următoarele pericole: Pericole personale: mici. Trebuie să ai încredere în altcineva pentru a-ți recupera fondurile sau, probabil, să ajuți pe cineva să-și recupereze fondurile.Pericole tehnologice: mari. Dacă nu te îngrijorează de tehnologia, prezentul și viitorul, nu are sens să faci nimic din ce scrie aici. Pericole legale: foarte mari. Bitcoin reprezintă suveranitate financiară: dacă renunți la sistemul financiar existent și te implici în tot acest proces, aceasta înseamnă că nu poți avea încredere în nimeni cu privire la custodia seed-ului. Deci, evaluați-vă cu atenție situația înainte de a plasa satoshi pe un seed securizat de niște șaibe!Acest ghid a fost inițial publicat în secțiunea italiană: [GUIDA] Backup Fisico della propria SeedPhrase su rondelle[TOP]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398891",
  "comments": [
    {
      "author": "GazetaBitcoin",
      "created_time": "May 16, 2022, 12:42:07 PMLast edit: April 02, 2023, 03:25:27 PM by GazetaBitcoin",
      "body": "Am bucuria de a vă prezenta în limba română topicul \"Securizarea Seed-ului cu Șaibe\", scris de fillippone la data de 13 martie 2022. Fillippone este un membru emblematic al forumului, implicat in diverse acțiuni de a promova Bitcoin și de a-i ajuta pe toți ceilalți membri, cu o atenție specială pentru începători. Printre scrierile remarcabile ale lui fillippone se numără, pe lângă acest topic, și “Tot ce voiai să știi despre trustul BTC Grayscale dar îți era teamă să întrebi!”, “5 modalități de a-l învăța pe omul obișnuit despre Bitcoin”, “#meritulesteviata cum să fii notificat pe Smartband despre merite și menționări”, “Tot ce voiai să știi despre Bitcoin futures dar îți era teamă să întrebi!”, “Tot ce voiai să știi despre opțiunile BTC dar îți era teamă să întrebi!”, “Modelul Stoc-Flux: Evaluând Bitcoin Bazat Pe Raritatea Sa”, sau “Cumpără Bitcoin fără KYC: ATM-ul Bitcoin din Milano care respectă anonimitatea”.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "May 16, 2022, 12:57:53 PM",
      "body": "Thank you, @gazetabitcoin, for your work. I hope our fellow Romanian users will have the opportunity to use this guide to secure their funds! Don't forget to let me know if you end up buying an anvil! Courtesy Romanian Translation:Mulțumesc, @gazetabitcoin, pentru munca ta. Sper că colegii noștri utilizatori români vor avea ocazia să folosească acest ghid pentru a-și asigura fondurile!Nu uita să mă anunți dacă ajungi să cumperi o nicovală!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "May 17, 2022, 08:39:14 AM",
      "body": "Quote from: fillippone on May 16, 2022, 12:57:53 PM[...]Amico mio, as usual, your Romanian skills are impressing me. And of course, your work is extremely useful for all the readers of your topics. For me, it was almost incredible what I read in this topic of yours. Probably, the sentence which still remained in my mind is this one:Quote from: fillippone on March 13, 2022, 12:21:33 AMWho would have thought that your passion for Bitcoin would lead you to buy an anvil!Of course, I'll let you know once I'll buy an anvil  Maybe after practicing everything that you described we can also try a part-time job, working as blacksmiths? Cheers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}