{
  "id": "topic_5453767",
  "title": "Ammaa",
  "author": "Ammaa",
  "created_time": "May 23, 2023, 12:32:02 PM",
  "content": "As the crypto market continues to expand and evolve, numerous upcoming tokens and coins are gearing up for launch, aiming to capitalize on the next bull run. In this article, we will explore a selection of coins and tokens that show great potential to secure a place among the top 100 on CoinMarketCap, a renowned platform providing comprehensive details on cryptocurrencies. These selections are based on a thorough analysis of successful crypto projects launched between 2013 and 2023, taking into account factors such as team composition, project objectives, adherence to roadmaps, and whitepapers.To identify the most promising upcoming tokens and coins, a deep analysis of highly successful crypto projects over the past decade was conducted. The focus was on projects such as APT, SUI, MEME coins, and gold-backed cryptocurrencies like Pax Gold and Tether Gold. Additionally, attention was given to coins launched by mainnets. The analysis primarily revolved around three key aspects: team members, project aims, and execution in alignment with roadmaps and whitepapers.Selection of Top Prospects:After careful consideration of the aforementioned factors, several projects emerged as strong contenders for a top 150 position on CoinMarketCap by 2024 or 2025. The following blockchain-based projects are expected to issue their own tokens and potentially rank highly: Zksync, Sei, Berachain, LayerZero, Fuel, Anoma, Polyhedra, Linera, and Quai. These projects exhibit strong teams and clear objectives, indicating the potential for successful execution.In addition to the blockchain-based projects, there are notable gold-backed cryptocurrencies that deserve attention. One such project is Bitxgold, a 100% gold-backed currency expected to be launched by Bitcoin billionaire Shahram Zandy Moghadam. What sets this project apart is its intention to register the project and company in the United Arab Emirates (UAE), which adds a layer of credibility and stability. The association with a prominent figure in the crypto space further enhances the potential for Bitxgold to make a significant impact in the market..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453767",
  "comments": [
    {
      "author": "bitkanu",
      "created_time": "May 23, 2023, 01:55:42 PM",
      "body": "I believe layerzero seems promising but the team said that they don't have plan in releasing any token yet therefore there won't be any layerzero token in the meantime, I think the coin that's promising and close to some good increase is sei.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nimogsm",
      "created_time": "May 23, 2023, 07:37:11 PM",
      "body": "I am now watching the SUI, but my expectations have not yet been met, the new projects that come out on their blockchain are frankly weak and there are already a lot of scams and new interesting projects yet to be seen. I'm waiting for one, but I'm not sure about it anymore against the background of what is happening now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "disconnectme",
      "created_time": "May 24, 2023, 06:11:07 AM",
      "body": "Quote from: nimogsm on May 23, 2023, 07:37:11 PMI am now watching the SUI, but my expectations have not yet been met, the new projects that come out on their blockchain are frankly weak and there are already a lot of scams and new interesting projects yet to be seen. I'm waiting for one, but I'm not sure about it anymore against the background of what is happening now.I don't think you should be surprised by the high number of scam projects feasting on gullible investors on the chain, it is a new network and people will flock to the place looking to be early to make money and since these scammers know this, they will pounce on this opportunity to scam them. I am very tired of all these high-valued chains with no substance to offer, I think $SUI will find it hard to make it unless they use incentives well to lure developers and the community, they failed to deliver airdrops and it will likely be a ghost chain soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irsykes",
      "created_time": "May 24, 2023, 10:15:30 AM",
      "body": "Quote from: bitkanu on May 23, 2023, 01:55:42 PMI believe layerzero seems promising but the team said that they don't have plan in releasing any token yet therefore there won't be any layerzero token in the meantime, I think the coin that's promising and close to some good increase is sei.while the hype of the economic project by holding tesnet, airdrop makes people try hard to pursue the task of the tesnet project and multiple accounts. sei looks like it would be good, but layerzero is better because behind the layerzero project the partner is a big well-known project in crypto circles. maybe someday layerzero will issue its token where the time is right",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "May 24, 2023, 04:15:01 PM",
      "body": "To be honest i have some suggestions for your thread1. Removing bitxgold from your thread2. If you didn't intend to remove it and then you shall change your title to be \"Bitxgold Expected to Make It to the Top 100 on CoinMarketCap\"I do know that if you wanna promoting that crap coin. other coins in your thread are good except it. My eyes are so hurt seeing you were mentioning such a crap coin in your thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "May 24, 2023, 06:16:56 PM",
      "body": "\"Zksync, Sei, Berachain, LayerZero, Fuel, Anoma, Polyhedra, Linera, and Quai\". In addition to these projects you have mentioned I would also include starknet, it seems you forgot to include it. Starknet, Scroll, Base, Zetachain are also strong contenders just like zksync and layerZero. Although some of this project are in testnet but from their development process it is easy to see their commitment into building something interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "May 24, 2023, 09:47:03 PM",
      "body": "This sounds like a complete shill of someone's bags.  There is no way anyone can predict altcoin positions in 2025 lol.  There is too many variables that we don't even know about yet that will determine the market in 2025.  These are all wild guesses at best",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "May 24, 2023, 11:21:28 PM",
      "body": "zksync is massive, it's got 1 million active addresses already in their blockchain which i'm sure gonna means that the demand will be huge.the rest i'm not so sure but sei already have half a million discord member in which many of them might be some duplicate accounts but regardless still reflects their overall demand in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 25, 2023, 01:01:03 PM",
      "body": "Quote from: Ammaa on May 23, 2023, 12:32:02 PMIn addition to the blockchain-based projects, there are notable gold-backed cryptocurrencies that deserve attention. One such project is Bitxgold, a 100% gold-backed currency expected to be launched by Bitcoin billionaire Shahram Zandy Moghadam.The idea of having a currency backed by in gold seems like an ideal solution to many problems, but what really happens is that there are no such currencies. All currencies that are stable or that try to link their value to a commodity will find that this link is not 100% supported, and therefore at some point the price will collapse. Because the time needed to liquefy gold is much slower than the dollar, and then the price will have lost part of its value, and more in the project trust.The solutions may seem more restrictive, but the decentralized models have not proven successful yet.The best is to invest in bitcoin as a long-term investment and a few altcoins after studying the project well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "May 25, 2023, 05:48:25 PM",
      "body": "I don't know about the other tokens you mentioned but I think zksync and layerzero has the best chance that they'll gonna make it on the top 100. I know a few about Fuel Labs since I made it in on their discord but I think it's still unknown if they'll have a token or I just have missed it. There's no guarantee that it will be this way, it's all just speculations though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Webetcoins",
      "created_time": "May 25, 2023, 08:20:29 PM",
      "body": "What about the already existing and launched cryptocurrencies that have the potential for growth? Such as SUI which was recently launched and has probably got the potential to be among the top 100 cryptocurrencies in the next decade since it comes from a good protocol and a good project with a good team and a good roadmap as well.And, when you talk about the analysis being based on execution, team, a roadmap, and the whitepaper, I don't see how meme coins fit in that category knowing they have none of these qualities but solely depend on community hype to grow in value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "May 25, 2023, 09:59:13 PM",
      "body": "Quote from: bittick on May 24, 2023, 11:21:28 PMzksync is massive, it's got 1 million active addresses already in their blockchain which i'm sure gonna means that the demand will be huge.the rest i'm not so sure but sei already have half a million discord member in which many of them might be some duplicate accounts but regardless still reflects their overall demand in the future.That maybe because of the rumor about the airdrop, but if those addresses are really willing to support this project and invest as well then that could be a potential top project in the next cycle. There’s a lot of new promising project, and most of them are able to land at the top 100 during their launching, if zksync will be like ARB, then I assume many will be more happy especially the hunters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "May 26, 2023, 11:18:27 AM",
      "body": "The only criterion by which coins can get into the TOP 100 on CoinMarketCap is the total capitalization of the coin. It is for this reason that we see there not only promising coins, but also such coins around which a hype has been created, such as Floki and Pepe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "May 26, 2023, 12:13:49 PM",
      "body": "Measure the volume of marketcap on CMC to evaluate the list of those projects, so there is no need to worry too much about technology, solutions, features,... I try to read all the messages from the content that OP mentioned but it reminds me of an exaggerated feeling about a certain object.Better yet, the OP needs to change some content or title to clarify your intent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 26, 2023, 01:18:44 PM",
      "body": "There's no guarantee in any coin as long as they still remains altcoins, they all have only little differences and many things in common that one may not bear enough under risk management, but once you have opted in for any of these cryptocurrencies, just accept your fate that you're on a chances of loosing or winning, many investors have made quite a gruesome amount of money from them but that was when they aren't as many as this in the market, invest in them and embrace the consequences as well either good or bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheSpiral",
      "created_time": "May 26, 2023, 01:48:00 PM",
      "body": "as far as a think Zksync token will be high demand able due to it's high usecase. now number if transaction is very much high and dex volume increasing daily. If they launch token in this year with some interesting Usecase and high apy reward than i believe that we will see this token under top 50.Starknet token are also probably will be launch this year because tokenomics already released and the best thing is that this token will also be used for gas fee which will definitely increase #strk demand. Layerzero is also going to launch it's token and we have seen so much token staked and bridge function. these tokens can  easily secure spot under 50 while their dex token will secure under top 200 spot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 26, 2023, 03:19:50 PM",
      "body": "Zksync is what I'm seeing a lot that has a lot of people who are interested but that's just what I think and I don't suggest people invest in it just as people become familiar with it. Everyone will say that such coins are interesting and they've got the potential in the next few years but, do not forget about that these altcoins market are strongly volatile and they might be at hype as of the moment and tomorrow you'll never know if they are still liquid or the devs have already made their exit.Quote from: killerfrost on May 26, 2023, 12:13:49 PMMeasure the volume of marketcap on CMC to evaluate the list of those projects, so there is no need to worry too much about technology, solutions, features,... That's what I'm into before about volumes of projects but when I've got to know that it can also be manipulated by the devs, it's no longer that important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jostorres",
      "created_time": "May 28, 2023, 06:55:16 PM",
      "body": "Quote from: disconnectme on May 24, 2023, 06:11:07 AMQuote from: nimogsm on May 23, 2023, 07:37:11 PMI am now watching the SUI, but my expectations have not yet been met, the new projects that come out on their blockchain are frankly weak and there are already a lot of scams and new interesting projects yet to be seen. I'm waiting for one, but I'm not sure about it anymore against the background of what is happening now.I don't think you should be surprised by the high number of scam projects feasting on gullible investors on the chain, it is a new network and people will flock to the place looking to be early to make money and since these scammers know this, they will pounce on this opportunity to scam them. I am very tired of all these high-valued chains with no substance to offer, I think $SUI will find it hard to make it unless they use incentives well to lure developers and the community, they failed to deliver airdrops and it will likely be a ghost chain soon.I think he already knows it but he have a different expectation on SUI just because it is a new project which are seem to be very promising and it did even pump in its early run. Maybe we just need to wait a little more.Let's give the project a little more time to improve more and that might be the time for us to see fewer scams if it won't totally be prevented. SUI can still make it alone even if not the projects under it. Even without incentives, developers are still attracted on them although most of these devs are just greedy and only think about the money more than offering something which can help the investors and the crypto space grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "May 28, 2023, 11:49:38 PM",
      "body": "Bitxgold shill. I see no intention from you to discuss it even further other than promoting your bitxgold which is a scam coin. Gold backed coin was never success. it's always having very low capitalization and volume. People never believe with such token to exist in the ecosystem. You can see that how many gold based projects are failed. It's caused by they were making it only for scamming others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}