{
  "id": "topic_5470920",
  "title": "cygan",
  "author": "cygan",
  "created_time": "October 19, 2023, 02:29:13 PM",
  "content": "Jack Dorsey's company Block has completed the first prototype of the 'hashboard' for the 'mining development kit (MDK)' and presented it to the public.the kit is designed to help developers create innovative applications for Bitcoin mining hardware. the design of the hashboard is focused on the open source character and the desired further development. it uses 100 Intel Blockscale 1000 series asic chips arranged in a grid pattern, which are compatible with the physical dimensions of conventional miner packages (three-board packages) and with common power supplies (apw12 power supply). to maximize energy efficiency, the asics are cooled by aluminum heat sinks.Block hopes that once the mdk hashboard is launched next year, it will not only improve industrial mining, but also be the basis for many innovative mining applications.if you want to know more about the hashboard, please read the article linked below:https://www.mining.build/meet-the-mdk-hashboard/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470920",
  "comments": [
    {
      "author": "NotFuzzyWarm",
      "created_time": "October 20, 2023, 02:14:45 PMLast edit: October 20, 2023, 05:15:19 PM by NotFuzzyWarm",
      "body": "Excellent - been waiting to hear about what Block is doing with the chips & IP they bought from Intel.Any info on the chip J/Th specs?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "October 20, 2023, 03:26:10 PM",
      "body": "I've been waiting for information on Intel chips for a long time. Intel sold this business at a loss.We have seen new ASICs of Bitmain and competitors, and these not new chips from Intel will find it difficult to compete with new ASICs with energy efficiency below 20 J/TH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "October 31, 2023, 04:57:12 AM",
      "body": "I thought intel cancelled the chip production ... so that would make this really useless ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "October 31, 2023, 02:46:01 PM",
      "body": "Quote from: kano on October 31, 2023, 04:57:12 AMI thought intel cancelled the chip production ... so that would make this really useless ...Intel cancelled *their* production but sold all the IP and production rights to Block.With all the design work done and a proven chip making process already established, Block just has to schedule a slot in Foundry production. Considering that a few years ago Intel reopened their Foundry services to outside companies, making more of the chips should not be a problem.Only problem I see with the chips is that they a less efficient than current bleeding-edge ones from BM, microBt or even Canaan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 31, 2023, 03:20:41 PM",
      "body": "Quote from: NotFuzzyWarm on October 31, 2023, 02:46:01 PMQuote from: kano on October 31, 2023, 04:57:12 AMI thought intel cancelled the chip production ... so that would make this really useless ...Intel cancelled *their* production but sold all the IP and production rights to Block.With all the design work done and a proven chip making process already established, Block just has to schedule a slot in Foundry production. Considering that a few years ago Intel reopened their Foundry services to outside companies, making more of the chips should not be a problem.Only problem I see with the chips is that they a less efficient than current bleeding-edge ones from BM, microBt or even Canaan.Yeah, I mentioned that in another discussion someplace. They made the announcement that they were buying the IP - production - whatever and then went silent until this announcement.So unless there has been a lot of silent work, they are a year behind with R&D on chips & tech that were not as efficient as others to begin with.NOW, they could have been doing a ton of things and not discussion them. But, seems doubtful.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 01, 2023, 02:40:15 AM",
      "body": "From their blog posts, doesn't seem like they plan to improve the efficiency or for their next chips at all. At least that doesn't seem to be the case for their next-generation board. Their target seems to be related to heat reuse, and while traditional mining is mentioned, I doubt that is their main goal. I'm pretty sure they know their chips are behind in performance. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 01, 2023, 08:23:59 PM",
      "body": "Quote from: joniboini on November 01, 2023, 02:40:15 AMFrom their blog posts, doesn't seem like they plan to improve the efficiency or for their next chips at all. At least that doesn't seem to be the case for their next-generation board. Their target seems to be related to heat reuse, and while traditional mining is mentioned, I doubt that is their main goal. I'm pretty sure they know their chips are behind in performance. CMIIW.IF and that is a big IF they are working on the next - next gen and plan to make it pin and board compatible with these chips I could see it.Buy this, and build and test. When the newer & faster chips are available then it's simple to produce.But, beyond that, it's better to use the faster and more efficient chips that are out there for heat reuse or anything else. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 03, 2023, 01:10:05 AM",
      "body": "Quote from: DaveF on November 01, 2023, 08:23:59 PMBut, beyond that, it's better to use the faster and more efficient chips that are out there for heat reuse or anything else. I guess that's true. This makes me wonder why they think launching this product is a good idea, pretty sure they realized that customers would prefer an efficient machine. Is there any market that will buy this, or do they really consider this as a research project and have a bigger margin for loss? However, they can probably avoid that if the customer needs to pre-order before they start making the rig.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "November 03, 2023, 02:13:14 PM",
      "body": "I'm also waiting for the characteristics of the new chips. If these chips are at the level of S19 series chips, then this product will not be competitive in the market. It takes a lot of money to develop something new.If you need to heat water, you can buy ASIC S19 series cheaply, which after halving will not be very profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}