{
  "id": "topic_5456293",
  "title": "fathafraink",
  "author": "fathafraink",
  "created_time": "June 14, 2023, 07:53:00 AM",
  "content": "Baik Teman-teman semua, kali ini saya akan memberitahu cara atau tutorial Mining token $BANANO (BAN). Mengenai informasi lengkap mengenai Banano, teman-teman bisa mengulik pada link Cmc berikut ya : https://coinmarketcap.com/id/currencies/banano/Cara Mining $BANANO Menggunakan CPU atau GPU :1. Pertama kita harus memiliki Wallet Banano ya teman-teman, silahkan daftar pada link berikut : https://vault.banano.cc/- Buat Wallet Baru- Setelah berhasil buat wallet, jangan lupa Simpan MNEMONIC PHRASE dan BANANO SEED di Notepad (baiknya jangan di Notepad Online, harus offline dan tersimpan aman di komputer kalian, usahakan agar tidak dilihat orang lain), setelah kalian simpan, kemudian klik \"I'VE SAVED MY SEED/MNEMONIC\"  seperti contoh berikut : - Kemudian masukkan password yang mudah kalian ingat (perlu dicatat juga di Notepad sperti tadi ya teman-teman )- Nah lalu, klik menu \"Accounts\"- Dan klik tombol berikut ( untuk menyalin address atau alamat yang telah kita buat )- Setelah address kita tersalin, silahkan buka situs bananominer.com- Kemudian Pastekan atau tempelkan address yang telah kita salin tadi, dan kemudian klik \"Start Now\"- Dan nanti kalian akan mendapatkan \"NAME\" dan \"Team Number\" , Kemudian klik \"Start Folding\" (catat ya teman, nanti akan kita gunakan untuk proses Mining )- Lalu Kalian akan diarahkan ke situs foldingathome.org, lalu kalian silahkan klik pada bagian \"fah-installer.exe\" seperti gambar berikut :Dan otomatis kalian akan mendownload aplikasi yang berformat exe tersebut, silahkan tunggu sampai selesai ya teman-teman.2. Kedua, kita akan menginstall fah-installer.exe yang telah selesai kita download tadi ya teman-teman.- Silahkan buka fah-installer.exe yang telah didownload : - Lalu klik \"Next\" - Klik \"I Agree\" - Lalu klik \"Next\"- Terakhir, klik \"Finish\"Dan setelah klik finish, jangan lupa untuk mencentang bagian PRIVATE NETWORKS dan PUBLIC NETWORKS dan kemudian klik \"ALLOW ACCESS\"- Nah kemudian browser kalian akan otomatis membuka client pada situs foldingathome.org, lalu kalian silahkan klik \"Change Identity\" : - Kemudian masukkan NAME dan TEAM NUMBER sesuai yang telah kalian catat tadi : ATAU Teman-teman juga bisa klik konfigurasi melalui aplikasi FAH-CLIENT.EXE yang telah di instal tadi, caranya, klik kanan pada icon FAH atau FoldingAtHome (seperti digambar) lalu klik \"Advanced Control\" , lalu klik \"Configure\".- Lalu klik pada bagian tab/menu \"Identity\" dan silahkan Masukkan NAME dan TEAM NUMBER yang telah teman-teman catat ya.3. Ketiga, kita akan menjalankan Penambangan atau Mining tersebut ya teman-teman.- Kembali ke bagian FAHControl, lalu pada tab menu Folding Power, silahkan klik dan tarik sampai ke bagian \"FULL\" (seperti gambar berikut) : - Lalu yang terakhir, klik Tab \"FOLD\" untuk memulai proses Mining atau Penambangan.Sepengalaman saya menambang BANANO, biasanya token atau coin BANANO akan segera masuk ke address wallet kita Setelah proses penambangan kita berhasil sampai 100% baik itu saat menggunakan CPU atau GPU. Untuk melihat proses Mining kita udah berjalan berapa persen, silahkan lihat pada Web Control atau FAHControl ya teman-teman.NOTE : Saya akan mengupdate Tutorial berikut jika ada pembaruan atau info baru yang didapat. Dan, Saya akan membuat video Tutorial juga sebagaimana yang telah saya lakukan untuk thread lainnya yang telah saya buat, tapi saya butuh waktu untuk membuatnya. Jika teman-teman ingin menanyakan sesuatu silahkan ya teman-teman, saya akan segera membalas pertanyaan teman-teman semua mengenai Mining $Banano.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456293",
  "comments": [
    {
      "author": "redwine49",
      "created_time": "June 14, 2023, 03:32:34 PM",
      "body": "itu aplikasinya aman ga gan?aku liat ini token tipenya POW. Trus untuk lihat hash ratenya dimana gan?apakah perlu membeli banano dulu sebelum mining gan?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fathafraink",
      "created_time": "June 15, 2023, 02:04:09 PM",
      "body": "Quote from: redwine49 on June 14, 2023, 03:32:34 PMitu aplikasinya aman ga gan?aku liat ini token tipenya POW. Trus untuk lihat hash ratenya dimana gan?apakah perlu membeli banano dulu sebelum mining gan?Selama ini Aplikasinya aman sih gan, karena ketika penginstallan aplikasi tersebut, tidak ada pemberitahuan bahwa adanya virus pada aplikasi tersebut, karena biasanya anti virus yang saya gunakan (Malwarebyte Anti-Malware) langsung sigap memberitahukan dan mencegah virus yang ada perangkat komputer saya.Mengenai Hashrate,saya tidak ada lihat sih gan, tapi pada bagian browser control atau Advanced Control ada informasi mengenai berapa persen proses mining yang telah kita lakukan, dan biasanya setelah proses mencapai 100%, tidak beberapa lama saya akan mendapatkan token banano langsung ke dompet saya gan. Dan mengenai pertanyaan terakhir agan, tidak perlu membeli banano dulu sebelum mining gan, jadi tinggal jalankan aja mining tersebut, lalu nunggu proses sampai 100% seperti yang saya katakan tadi, lalu akan dapat token $BANANO gan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 17, 2023, 01:13:28 AM",
      "body": "Quote from: fathafraink on June 14, 2023, 07:53:00 AM1. Pertama kita harus memiliki Wallet Banano ya teman-teman, silahkan daftar pada link berikut : https://vault.banano.cc/- Buat Wallet BaruAku belum sempat download, lalu ada pertanyaan mengganjal, apakah setelah wallet terinstall kita bisa membuat wallet secara offline dengan mematikan Internet?.Quote from: fathafraink on June 14, 2023, 07:53:00 AM- Setelah berhasil buat wallet, jangan lupa Simpan MNEMONIC PHRASE dan BANANO SEED di Notepad (baiknya jangan di Notepad Online, harus offline dan tersimpan aman di komputer kalian, usahakan agar tidak dilihat orang lain), setelah kalian simpan, kemudian klik \"I'VE SAVED MY SEED/MNEMONIC\"  seperti contoh berikut : kalau sering kubaca di thread SFi tentang menyimpan mnemonic, baiknya ditulis di kertas dari pada menyimpannya di notepad PC.Lalu untuk recovery, apakah kita butuh keduanya, baik itu SEED dan MNEMONIC?, kalau itu sebuah pilihan, menurutku mending simpan yang mudah diingat seperti MNEMONIC dari pada SEED.Quote from: fathafraink on June 14, 2023, 07:53:00 AM- Kemudian masukkan password yang mudah kalian ingat (perlu dicatat juga di Notepad sperti tadi ya teman-teman )Apakah password itu Optional saja atau Wajib?, karena sepengetahuanku seperti Wallet Electrum, pilihan password hanya Optional, kita bisa lanjut tanpa input password lagi.Quote from: fathafraink on June 14, 2023, 07:53:00 AMbaik itu saat menggunakan CPU atau GPU. Apa ada setelan khusus untuk mining menggunakan CPu ata GPU?, atau otomatis terdeteksi dan langsing mining menggunakan source yang ada di PC kita?.Aku pengen tahu, berapa banyak pemakaian RAM, CPU dan GPU di PC ente ketika running atau mining coin Banana. Mungkin kalau terkesan akan ikut mencoba mining karena PCku juga lagi tidak ada Job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fathafraink",
      "created_time": "June 20, 2023, 08:43:21 AM",
      "body": "Quote from: Sarah Azhari on June 17, 2023, 01:13:28 AMAku belum sempat download, lalu ada pertanyaan mengganjal, apakah setelah wallet terinstall kita bisa membuat wallet secara offline dengan mematikan Internet?.Saya rasa bisa gan, tapi agan perlu menginstall aplikasi android yang bernama KALIUM, dan agan bisa dapatkan di Playstore.Quote from: Sarah Azhari on June 17, 2023, 01:13:28 AMkalau sering kubaca di thread SFi tentang menyimpan mnemonic, baiknya ditulis di kertas dari pada menyimpannya di notepad PC.Lalu untuk recovery, apakah kita butuh keduanya, baik itu SEED dan MNEMONIC?, kalau itu sebuah pilihan, menurutku mending simpan yang mudah diingat seperti MNEMONIC dari pada SEED.Baiknya simpan offline sih gan,dan agan baiknya simpan Mnemonic juga beserta seed. Oh iya, bagaimana dengan melakukan print?Quote from: Sarah Azhari on June 17, 2023, 01:13:28 AMApakah password itu Optional saja atau Wajib?, karena sepengetahuanku seperti Wallet Electrum, pilihan password hanya Optional, kita bisa lanjut tanpa input password lagi.Optional aja gan, sama seperti metamask, jika kita menginstall ulang metamask di browser, maka agan bisa memasukkan password baru lagi.Quote from: Sarah Azhari on June 17, 2023, 01:13:28 AMApa ada setelan khusus untuk mining menggunakan CPu ata GPU?, atau otomatis terdeteksi dan langsing mining menggunakan source yang ada di PC kita?.Ya otomatis terdeteksi hardware yg ada pada perangkat kita gan, dan mengenai daya yang digunakan bisa diatur gan.Quote from: Sarah Azhari on June 17, 2023, 01:13:28 AMAku pengen tahu, berapa banyak pemakaian RAM, CPU dan GPU di PC ente ketika running atau mining coin Banana. Mungkin kalau terkesan akan ikut mencoba mining karena PCku juga lagi tidak ada Job.Saya tidak lagi mining banano gan, tapi dulunya, ketika saya melakukan mining, Ram yang dipakai hanya sekitar 1GB lebih, mengenai CPU atau GPU bisa kita atur pemakaiannya gan, antara Low-Medium-High, jika agan benar benar ingin melakukan mining dengan daya penuh baiknya pilih High, sedangkan Low adalah sebaliknya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 21, 2023, 09:04:44 AM",
      "body": "Quote from: fathafraink on June 20, 2023, 08:43:21 AMQuote from: Sarah Azhari on June 17, 2023, 01:13:28 AMAku belum sempat download, lalu ada pertanyaan mengganjal, apakah setelah wallet terinstall kita bisa membuat wallet secara offline dengan mematikan Internet?.Saya rasa bisa gan, tapi agan perlu menginstall aplikasi android yang bernama KALIUM, dan agan bisa dapatkan di Playstore.Kalau di ponsel sih setahuku sulit untuk generate wallet secara offline, karena harus sinkronisasi jaringan dulu, setahuku aplikasi semacam trust wallet pun harus online juga.Quote from: fathafraink on June 20, 2023, 08:43:21 AMQuote from: Sarah Azhari on June 17, 2023, 01:13:28 AMkalau sering kubaca di thread SFi tentang menyimpan mnemonic, baiknya ditulis di kertas dari pada menyimpannya di notepad PC.Lalu untuk recovery, apakah kita butuh keduanya, baik itu SEED dan MNEMONIC?, kalau itu sebuah pilihan, menurutku mending simpan yang mudah diingat seperti MNEMONIC dari pada SEED.Baiknya simpan offline sih gan,dan agan baiknya simpan Mnemonic juga beserta seed. Oh iya, bagaimana dengan melakukan print?Karena masih ada bau elektronik-nya aku belum pernah nge-print Mnemonic, takut diintai hacker. Oleh karena itu aku bertanya apa harus disimpan keduanya apa 1 saja, mnemonik. Pengalamanmu gimana?, soalnya ribet nulis seed yang musti teliti nulis karakternya.Quote from: fathafraink on June 20, 2023, 08:43:21 AMOptional aja gan, sama seperti metamask, jika kita menginstall ulang metamask di browser, maka agan bisa memasukkan password baru lagi.Yep, karena di metamask kita input mnemonik, wallet apa pun itu jika kita input menmonic, wallet tidak meminta password sama dengan sebelumnya.Quote from: fathafraink on June 20, 2023, 08:43:21 AMQuote from: Sarah Azhari on June 17, 2023, 01:13:28 AMApa ada setelan khusus untuk mining menggunakan CPu ata GPU?, atau otomatis terdeteksi dan langsing mining menggunakan source yang ada di PC kita?.Ya otomatis terdeteksi hardware yg ada pada perangkat kita gan, dan mengenai daya yang digunakan bisa diatur gan.Maksudnya?, apa kita bisa mengatur speed mining kita untuk mereduce penggunaan CPU atau GPU?. Dulu aku pernah mining di linux ubuntu, memang ada setelan berapa CPU yang bisa kita gunakan mining untuk mengurangi heat pada PC atau server.Quote from: fathafraink on June 20, 2023, 08:43:21 AMSaya tidak lagi mining banano gan, tapi dulunya, ketika saya melakukan mining, Ram yang dipakai hanya sekitar 1GB lebih, mengenai CPU atau GPU bisa kita atur pemakaiannya gan, antara Low-Medium-High, jika agan benar benar ingin melakukan mining dengan daya penuh baiknya pilih High, sedangkan Low adalah sebaliknya.Sebenarnya aku mau mining di server alias VPS, kalau terlalu high, nanti akan ada resiko dari pemilik provider seperti dibanned. karena pengalamanku yang sudah-sudah, ada beberapa setelan server yang hanya bisa diakses oleh provider VPS, jadi kalau pengaturan low dan highnya ada di aplikasi sih menurutku menarik untuk dicoba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}