{
  "id": "topic_5474071",
  "title": "Jamestown70",
  "author": "Jamestown70",
  "created_time": "November 14, 2023, 07:01:24 PM",
  "content": "My country pipo e go really make sense if you wey they seek for admission into the university learn at least skill wey fit fetch you income the reason why some of us find am hard in school na because we no learn handwork (skill) so the thing come become very difficult to even concentrate properly some days wey nothing day no food no money to go class go worry you and all this things really dey discourage somebody well well, those wey learn handwork before gaining admission into the university no really face much difficulty because them get service to render in exchange for cash aside ur schooling e dey very important to learn handwork before u enter school because that time your brain still dey young and not much responsibility to think of unlike when you finish school to come learn some settings kind of handwork that time go dey very very hard because you done dey think about your responsibility at hand and that time u fit no get chance unlike now wey you still dey mama and papa house this na my own experience and my regret.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474071",
  "comments": [
    {
      "author": "Obari",
      "created_time": "November 14, 2023, 07:12:51 PM",
      "body": "Normally you no suppose regret any move you don already take because this life already Dey predestined but nevertheless, no time really Dey late for anyone wey know wetin him wan achieve but at a time, e get one thing wey I believe say, wetin work for mr A fit no work for Mr B and what I’m saying in essence is that, we should take life easy and not force things to place but we should always try to do the right thing at the right time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "November 14, 2023, 07:24:27 PM",
      "body": "well op, the issue of education I'n Nigeria don really tire many people them. so many graduate no jobs na that wan person go say e no try learn hand work before e enter school? or let e pikin jump enter school? the school system no long dey sweet students Dem for body as stress here and there and no parents go wan dey hear everything wey e pikin go dey take am say make e come pay. that na why as a child, you suppose try find one hand work learn. no go dey put eyes for where your hand no reach just like so many of our youths don turn yahoo to hand work. as those things no go fit sustain you for future. if person get correct hand work, e fit use an take survive any situation wey the country throw give am. now d major reason why pikin go need to learn this hand work be say, work no dey we country.and even though sometime you graduate with first class.if you no get one or two connections you fit no still see work. so school now be like whole other world. and after how many years wey u go spend for there, e no go sharp say you come sit don for hux dey look mummy and daddy eyes. abeg make our youths them put head for where road dey",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dan Arewa",
      "created_time": "November 14, 2023, 07:30:11 PM",
      "body": "For north here wey we de, people de value hand work pass school because some people get d mentality of saying that after school no work, some of us no de even go school at all and they end up hustling and hawking. Education here is by chance and opportunity, if you get sponsor you will go school and if you no get you will stay at home and learn hand work. As you say it is good to learn hand work get skill before going to school or after university so that it can help us get money for food before we get government work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pi-network314159",
      "created_time": "November 14, 2023, 07:37:20 PM",
      "body": "This matter wey you bring so, e sweet my belly before person soppos w enter higher istitution person sopos don leran one or two so that as you dey enter school e no go affect you financially. But the thing depends on the type of handwork you learn o. Because e get some handwork you learn, you no ft dey use am for higher institution. Because school activities no go even allow you to dey do am .just like person wey learn mechanic or even driving of truck wey go dey make you dey travel leave school premises. Except say na barging or computer operator wey you fit open close to school, and you go dey do typing and photocopying or dey attached to a barbing saloon. But anyways some people wey no get skills when dem enter school dem learn before them dey come back. Na who no dey serious naim no go learn or who no get the zeal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 14, 2023, 08:09:12 PM",
      "body": "Op I like wattin you talk for this hand work matter, e dey very good for person to sabi hand work wey fit dey give am small small thing when em dey school, so that em fit dey use that one take dey manage emself before hunger use am run ground. But if every body learn hand work finish who dem go use or who dem no go use, so I leave this for only those wey like to learn, if person no wan learn no be still bad thing the only time wey e go turn bad thing na when the person no get anywhere wey money dey come from and e refuse to learn, that one na just hunger trouble naim the person dey fine. As you see me so outside this forum na electrician and plumber naim I be, and e don tay wey I get this hand work, naim I take dey survive and even when I enter school naim still me do so many things, so I no fit play with my hand work, but the issue nowadays na be say to even see work do don dey hard e no be like before wey two customers go dey call the same time, na plenty people don dey use solar for their things and those wey dey repair generator nor dey too get work like before again everywhere hard, but this one no affect does wey dey barb hair oo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "November 14, 2023, 09:07:45 PM",
      "body": "Quote from: Dan Arewa on November 14, 2023, 07:30:11 PMFor north here wey we de, people de value hand work pass school because some people get d mentality of saying that after school no work, some of us no de even go school at all and they end up hustling and hawking. Education here is by chance and opportunity, if you get sponsor you will go school and if you no get you will stay at home and learn hand work. As you say it is good to learn hand work get skill before going to school or after university so that it can help us get money for food before we get government work.Just what's going true my mind when I read the topic, normally for naija wey we dey no be all graduate dey work and 90% of graduate no dey use there school certificate rather na handwork or skill. And now because of all this things the young ones dey get the wrong impression say school na scam, and when I ask why many reasons dey, some go say to go school now na with big money and other reasons but there's nothing like school na scam, just because you're a graduate and you've not seen a job yet but rather you dey feed from handwork or skill that doesn't mean school na scam. Nowadays even business men and women, people who make  shoes, bags, wigs, dress, data management  etc, sometimes advertising of brands are necessary and making speech about your product or business, so this kind of example don show say e good to go school.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "November 14, 2023, 09:56:18 PM",
      "body": "Quote from: Dan Arewa on November 14, 2023, 07:30:11 PMFor north here wey we de, people de value hand work pass school because some people get d mentality of saying that after school no work, some of us no de even go school at all and they end up hustling and hawking. Education here is by chance and opportunity, if you get sponsor you will go school and if you no get you will stay at home and learn hand work. As you say it is good to learn hand work get skill before going to school or after university so that it can help us get money for food before we get government work.First don't generalize your belief to everyone in the north. Unless you want to say you guys over there don't understand the difference between skill and education. You go to school to get a professional knowledge on a particular field, there is no where it is written that it is a criteria for success or an opportunity to get a job. It all depends on you to make it a career and go forward in it. However, why on the process you seem to encounter some challenges that teaches you to stand alone as an individual and make decisions on your own. This shows that school is not only about your discipline but a full education that consist of physical knowledge, academical knowledge, moral knowledge and spiritual knowledge. If you did not have any preliminary studies will you be able to read and write fluently? Higher education is important as also learning a skill. Op is right on the track. This is because you will be of a higher advantage if you have a skill before going into the university. Depending on your skill type friends, course mate or neighbors will patronise you and it will help you earn money the right way instead of doing a lot of crazy things student do these days to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "November 15, 2023, 05:03:35 PM",
      "body": "Revised be the case. How about person learn skill finish then start to dey see money, u no think say the money him dey see go make am no think going to school again after seeing people passing out from schools for years without security job? Instead them stil com back to learn the skills way u way no be graduate do acquire and already earning from it? U no go see am as waste of funds instead u use the expected school money expand your establishment instead of the school?Meanwhile... Not be everyone way dey school dey experience financial challenges bcos most scholars dey schools bcos promises dey to back their scholars financial demands such as scholarships, parents and guardians.Again, you no think for a scholar chasing finance while schooling go depreciate em leaning capacity due to diverts of Activities?However, this skill acquirance as the case maybe don help some scholars during school days to my notice but not only skills but also trading and other social services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DPHOR",
      "created_time": "November 15, 2023, 05:10:38 PM",
      "body": "Wetin help me that year na the skills them wey I get before I gain admission, even as I enter I no too depends on my people or relatives to sustain for school sometimes I go leave lectures go hustle small ogwuaja skills them wey I get till I finished. You see ehh even some people wey dey get admission now no fit counts on anything since e be say them dey look for soft life and dem no wan do dirty job to stain their body make dem pass through stress for school. I go really tell few of our people wey get interest to enter school to first equip themselves with at least one or two to take gain ground for school.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 15, 2023, 06:40:29 PM",
      "body": "Yea, in my opinion, I think it's wise to learn a skill earlier on, even before we go to university, because depending on the skill one learns, they can earn from it while they are in school. For example, when I was still in university, there was this guy who was a forex trader. According to what people always talked about him, he was a very good trader and made a lot of profit quite often, but since the guy was not my friend, I can't verify that everything I was hearing about his level of profit-making was 100% accurate, but I know he was a sharp guy who was earning cash from whatever he was doing. While the guy was at the same university as me, he was organizing training for other university students and teaching them how to trade; those trainings were not free. So, it's wise to learn a skill, but what can determine the earnings you make is the kind of skill you learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 15, 2023, 08:53:21 PM",
      "body": "This na good advise my brother. Na wise man advise be this. Person wey get hand work fit even train his or her self up self if their guardian hand no strong or dem abandon dem. The economy no dey laugh because na live and the harsh reality suppose really make student before dem go enter ogba dem suppose learn something wey dem go still dey use sustain demselves with or without the parents.Some people dey do barbing of hair, laundry services etc.because dem don already learn those things from house.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 16, 2023, 03:35:35 AM",
      "body": "If you watch the way the country be now you go see say to get skill dey very important. because if you no get skill before you go school and you no learn am before you come back, life go dey missreble to you. Na most of this things naim they make people say school na scam meanwhile Dem forget say going to school no dey guarantee success. School na just a place of learning sothat from wetting them teach you you fit use am build your future. Just like we dey this forum who no dey educated no fit perticipate for this kind forum because you need at least the basic skill to read and write for communication. I think all of us wey dey here, no body Cary certificate apply work for here but na just opportunity and your basic knowledge. Some days ago a Nigerian man burn all him certificates because him see say no work for Nigeria. after his whole years in school just to discover say him dey drag work with illitrates. That one na indirectly saying say school na scam. Had it been say that man get better business wey him dey do to make money I no think If him go fit do that kind thing.So learning skill before going to school go reduce thinking for you when you don come back for school. And meanwhile any Nigerian wey dey go school make e no dey put him thinking so high say after him graduate for school him go work for oil companies like shell,Agip,Total,Saipem or Daewoo. Putting your expectations high might not be the problem but when you don graduate for school and things no come work out as planned, E go come be like say you just wasted your time. Morover na you no get plan B. In as much as we dey plan big make we dey also think of plan B, because Nigeria no be country you go build your hope on fantasy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lambaz",
      "created_time": "November 16, 2023, 04:49:39 AM",
      "body": "One of my most regret was never learning any skills before I went to university. Though it wasn't that bad then in the 2000's but to be fair if someone suggested that to be by then I would tag you enemy of my education coz why do you want to do that but see today, entrepreneurs are kings of the street.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 16, 2023, 05:21:44 AM",
      "body": "Quote from: Jamestown70 on November 14, 2023, 07:01:24 PMMy country pipo e go really make sense if you wey they seek for admission into the university learn at least skill wey fit fetch you income the reason why some of us find am hard in school na because we no learn handwork (skill) so the thing come become very difficult to even concentrate properly some days wey nothing day no food no money to go class go worry you and all this things really dey discourage somebody well well, those wey learn handwork before gaining admission into the university no really face much difficulty because them get service to render in exchange for cash aside ur schooling e dey very important to learn handwork before u enter school because that time your brain still dey young and not much responsibility to think of unlike when you finish school to come learn some settings kind of handwork that time go dey very very hard because you done dey think about your responsibility at hand and that time u fit no get chance unlike now wey you still dey mama and papa house this na my own experience and my regret. Getting skilled before starting an undergraduate journey isn't a bad thing and should be strongly encouraged but however, but it is not compulsory. Some people didn't even have the chance to be skilled at anything reasonably because they got admission immediately after they finished secondary school and were too young to think for themselves that much before the time of their admission.If not for the fact that our educational system isn't working well and that most of our parents didn't make the right financial preparation for there children regarding how to effectively see them through school, the undergraduate period is specially designed for academic purposes and should not be used for hustles and making of money. The reason why we've not seen much of strong graduates in our society today is because most of our youth are too focused on making money while in school at the detriment of the learning they are supposed to be undergoing.Getting skilled is good but I think we should understand that education offers one of the greatest combination of skill you've ever thought of. If you put in the effort to learn all the things you're required to learn from your first year in school to your final year, I will tell you this with all sincerity that you will not go out of school looking for job. There are a very handful of individual that are strong academically in our country at the present and this is because most persons are running after grades while other have moved on to looking for money before ever creating values for themselves. If you create enough value for yourself while in school, when you come am you might struggle a bit just to blend into the society but once you do, the rate at which you will rise will marvel people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Benedictare",
      "created_time": "November 16, 2023, 10:04:21 PM",
      "body": "Is based on the individuals and mindset, it is good,because you don't know where you  Will  find yourself in future.   Before in the university not a bad idea, but i don't think you should join education with your skill while in school because it is not always easy like you have said it, there will be lack of concentration in your academic which will also affect your performance and results because you will be after getting money for yourself most especially for those departments that are involved in practicals like the Health, Agriculture, Engineerin  faculties e.t. c,it will be very difficult to handle these two together unless you  are not ready for much learning and that will have to be in other faculty, even over there it will still affect you . Is either school or work     On the other hand after university you can still learn your skills ,its all about self determination you  can still learn no time is too late to achieve whatever you want in life as long as you are not being forced to do it, its your choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peter Faith",
      "created_time": "November 16, 2023, 11:25:30 PM",
      "body": "Quote from: Jamestown70 on November 14, 2023, 07:01:24 PMMy country pipo e go really make sense if you wey they seek for admission into the university learn at least skill wey fit fetch you income the reason why some of us find am hard in school na because we no learn handwork (skill) so the thing come become very difficult to even concentrate properly some days wey nothing day no food no money to go class go worry you and all this things really dey discourage somebody well well, those wey learn handwork before gaining admission into the university no really face much difficulty because them get service to render in exchange for cash aside ur schooling e dey very important to learn handwork before u enter school because that time your brain still dey young and not much responsibility to think of unlike when you finish school to come learn some settings kind of handwork that time go dey very very hard because you done dey think about your responsibility at hand and that time u fit no get chance unlike now wey you still dey mama and papa house this na my own experience and my regret. I think now most parents eyes don open ,,my area now as soon as pikin write waec Dem don go register him or her to learn one hand work or the other... because the way the society don be now especially our country here na hand work and business people take dey survive. Me sef get my own regret of not learning one but I go correct that mistake in the life of my children. Na so me I see this matter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "November 17, 2023, 09:26:43 PM",
      "body": "Quote from: Obari on November 14, 2023, 07:12:51 PMNormally you no suppose regret any move you don already take because this life already Dey predestined but nevertheless, no time really Dey late for anyone wey know wetin him wan achieve but at a time, e get one thing wey I believe say, wetin work for mr A fit no work for Mr B and what I’m saying in essence is that, we should take life easy and not force things to place but we should always try to do the right thing at the right time.being successful in life is solely not about how fast you are going but how well. We are all predestined for divers purposes it's just for you to figure out your purpose and strive to achieve it in the right direction. We all mustn't have a handwork/crafted skill before going for higher education.Having a skill and also been a degree holder is not an arbitrate that you are going to make success faster than someone who's without the two or is just a holder of the latter. Life has it way of twisting our destinies, what's substantial is that you don't get perturbed by the challenges and delays along your path. Skills or no skills, all am exacting is that it's not a misnomer to have a degree as a graduate without a skill, for the ideology behind this unpopular opinion about having a skill before going for higher education is because since there's no much available jobs you've to use your skill to earn a living while waiting for a white collar jobs. No regrets either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 17, 2023, 10:12:19 PM",
      "body": "You talk true and dis handwork na very important tin wey person suppose get before dem enter university. Dem introduce trade subjects for secondary school and many schools no really dey help develop d children in dat aspect of learning a good skill. If I be Governor, I go make dis trade subject very compulsory and every child must don learn at least one good skill before dem go fit even sit down register for JAMB. Dis will make it easier for d children when going further even when dey don start universities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "November 17, 2023, 10:46:54 PM",
      "body": "Quote from: Benedictare on November 16, 2023, 10:04:21 PM  Is based on the individuals and mindset, it is good,because you don't know where you  Will  find yourself in future.     On the other hand after university you can still learn your skills ,its all about self determination you  can still learn no time is too late to achieve whatever you want in life as long as you are not being forced to do it, its your choice.  I will agree with you in the aspect of not mixing studies and skill, doing both will reduce your performance no two ways about, it must surely clash either for practicals or lectures, which sometimes attendance is recorded.Talking about the self determination to learn skill after university is not at any point advisable, it is a very wrong planning and most persons often regret it. After spending 5-7yrs in university then spend another 2-3yrs in learning a skill, e no make nah, except God remains merciful give you job opportunity worth your certificate if not another round of suffer because it is never easy to serve to acquire any skill, as even to see job now be problem for the country. It is best after graduating from the university, instead of staying idle why not explore your skills and care for your self before using the certificate to get a better job and in a case where you have no handwork you become idle or do sales boys and girls when you should have explored your skill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}