{
  "id": "topic_5461136",
  "title": "journey7",
  "author": "journey7",
  "created_time": "July 26, 2023, 06:23:12 PM",
  "content": "Will Craig Wright's attorneys try to explain away his conduct by using the same Aspergers excuse that worked wonders in the Miami trial? The following evidence can’t be dismissed so easily...https://davekleiman.substack.com/p/craig-wright-sanctions-hearing-on",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461136",
  "comments": [
    {
      "author": "zasad@",
      "created_time": "July 27, 2023, 09:11:27 AM",
      "body": "Quote from: journey7 on July 26, 2023, 06:23:12 PMWill Craig Wright's attorneys try to explain away his conduct by using the same Aspergers excuse that worked wonders in the Miami trial? The following evidence can’t be dismissed so easily...https://davekleiman.substack.com/p/craig-wright-sanctions-hearing-onCraig Wright is a scammer who wants to own the copyright to bitcoin in order to receive royalties from all crypto companies for the rest of his life. But no one will allow him to do this, and he will lose court cases in all countries. And since he has financial problems, he is forced \"to spin like a snake in a hot pan\" (C).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mirror World",
      "created_time": "July 30, 2023, 12:29:39 PM",
      "body": "I read some about Craig on Reddit recently, why hasn't (any) one of the world's finest legal systems put him in jail yet? Even with money troubles, he seems to be able to find decent lawyers. Maybe with the current case his luck will run out, stay tuned...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 30, 2023, 04:31:41 PM",
      "body": "Quote from: journey7 on July 26, 2023, 06:23:12 PMWill Craig Wright's attorneys try to explain away his conduct by using the same Aspergers excuse that worked wonders in the Miami trial? You don't have to worry about the trial in Miami, Craig Wright is widely known as a liar and fraud, there is no strong law against his explanations in court, whatever reason he utters in court does not change anything for the Bitcoin community.You can see here clearly.Craig Steven WrightQuoteCraig Steven Wright is an Australian computer scientist and businessman. He has publicly claimed to be the main part of the team that created bitcoin, and the identity behind the pseudonym Satoshi Nakamoto. These claims are regarded as false by much of the media and the cryptocurrency community.QuoteSecurity researcher Dan Kaminsky said in his blog that Wright's claim was a scam and bitcoin developer Jeff Garzik agreed that evidence publicly provided by Wright does not prove anything.[35]Craig Wright's words have been going on for a long time, nothing has changed even though he has a myriad of reasons against the creators of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 02, 2023, 12:57:58 PM",
      "body": "Quote from: Mirror World on July 30, 2023, 12:29:39 PMI read some about Craig on Reddit recently, why hasn't (any) one of the world's finest legal systems put him in jail yet? Even with money troubles, he seems to be able to find decent lawyers. Maybe with the current case his luck will run out, stay tuned...If one clown is put in jail, another clown will take his place. If he wants to spend millions of money on useless courts, this will lead to his bankruptcy. One should not feel negative towards such people, but I do not want to wish him success. Let him continue to amuse the crypto community with his antics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 10, 2023, 08:18:04 PM",
      "body": "Quote from: zasad@ on August 02, 2023, 12:57:58 PMQuote from: Mirror World on July 30, 2023, 12:29:39 PMI read some about Craig on Reddit recently, why hasn't (any) one of the world's finest legal systems put him in jail yet? Even with money troubles, he seems to be able to find decent lawyers. Maybe with the current case his luck will run out, stay tuned...If one clown is put in jail, another clown will take his place. If he wants to spend millions of money on useless courts, this will lead to his bankruptcy. One should not feel negative towards such people, but I do not want to wish him success. Let him continue to amuse the crypto community with his antics.I'm not really sure if he can go broke because of his court case, he seems to have a lot of money already and that's why he is willing to go court and spend his millions.But I do agree that we all know that he is just a clown in crypto and he has lost all his reputation here. And with that, yeah, let him used all his money, but we all know what the truth is. And the more he tries to proved something that he is not, the more he is being mock by bitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 11, 2023, 03:35:51 AM",
      "body": "Wonder why Craig Wright continues to play the victim in this sitcom, he should save a little face and finish this skit.Everyone does not believe him even his wife who accused him of lying when he said he had access to her wallet, this is really insulting and he has to stop immediately!!!But he seems to be the kind of guy who likes fame (even if it's humiliating) and media exposure more than money, because he's still spending millions on his lost cause knowing full well he won't succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 11, 2023, 12:06:17 PM",
      "body": "Quote from: Baofeng on August 10, 2023, 08:18:04 PMQuote from: zasad@ on August 02, 2023, 12:57:58 PMQuote from: Mirror World on July 30, 2023, 12:29:39 PMI read some about Craig on Reddit recently, why hasn't (any) one of the world's finest legal systems put him in jail yet? Even with money troubles, he seems to be able to find decent lawyers. Maybe with the current case his luck will run out, stay tuned...If one clown is put in jail, another clown will take his place. If he wants to spend millions of money on useless courts, this will lead to his bankruptcy. One should not feel negative towards such people, but I do not want to wish him success. Let him continue to amuse the crypto community with his antics.I'm not really sure if he can go broke because of his court case, he seems to have a lot of money already and that's why he is willing to go court and spend his millions.But I do agree that we all know that he is just a clown in crypto and he has lost all his reputation here. And with that, yeah, let him used all his money, but we all know what the truth is. And the more he tries to proved something that he is not, the more he is being mock by bitcoiners.Craig Wright is a good specialist with a good education and extensive experience in the world of cryptography. He even managed to trick Gavin Andnrsen in 2016 when he was required to sign a message on one of the first 50 bitcoin wallets. There are huge profits at stake. This is the copyright of Bitcoin and the shilling of its own coin as Bitcoin SV.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "August 11, 2023, 01:30:20 PM",
      "body": "Quote from: YOSHIE on July 30, 2023, 04:31:41 PMQuote from: journey7 on July 26, 2023, 06:23:12 PMWill Craig Wright's attorneys try to explain away his conduct by using the same Aspergers excuse that worked wonders in the Miami trial? You don't have to worry about the trial in Miami, Craig Wright is widely known as a liar and fraud, there is no strong law against his explanations in court, whatever reason he utters in court does not change anything for the Bitcoin community.When CW started this drama newly, I wasn't bothered. I saw it like something that will fizzle out within a short period of time. But the law was not approaching his case aggressively how I ought they should threat it. They are instead being lenient and seeking evidences even where it does not exist.Right now I am no longer comfortable with CW. He is obviously not a fool, even if he is a liar. For him to continuously invest in his quest and chase for bitcoin ownership, he has a vision and for this case not to have ended since, there is a conspiracy. The community might be saying another thing because they know the truth, but the court can crazily decide another thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 15, 2023, 06:36:06 AM",
      "body": "Quote from: Mirror World on July 30, 2023, 12:29:39 PMI read some about Craig on Reddit recently, why hasn't (any) one of the world's finest legal systems put him in jail yet? Even with money troubles, he seems to be able to find decent lawyers. Maybe with the current case his luck will run out, stay tuned...Because they are too incompetent to understand the scale of crimes committed by CSW:CSW harrassed a bunch of Bitcoin Core developers in many jurisdictions, each with their own legal system, and most of them are only able to work with the information of court cases within their own country, plus a lot of the defendants can't afford a lawyer for the long term so he ends up soft-rugpulling them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 23, 2023, 11:35:03 AM",
      "body": "🤡 The clown makes the crypto community happy again 🤡https://twitter.com/Dr_CSWrightIf CSW cannot prove in court their rights to the authorship of bitcoin, then on Twitter it is possible. Although he should indicate the authorship of which bitcoin he claims.But perhaps Twitter will force him to change this entry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "August 23, 2023, 11:57:22 AM",
      "body": "Quote from: zasad@ on August 23, 2023, 11:35:03 AM🤡 The clown makes the crypto community happy again 🤡https://twitter.com/Dr_CSWrightIf CSW cannot prove in court their rights to the authorship of bitcoin, then on Twitter it is possible. Although he should indicate the authorship of which bitcoin he claims.But perhaps Twitter will force him to change this entry.On CSW Twitter title, I know too well that if this gets to the attention of Elon Musk, he will quickly rip off that title from him. No matter how manipulative Elon has been to the cryptocurrency industry, I trust him to know the truth about the CSW claim. It is evidently obvious that CWS is not Satoshi and cannot own the bitcoin copyright but what marvels me is the level and stage he has attained without being halted indefinitely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 23, 2023, 12:38:44 PM",
      "body": "Quote from: Zoomic on August 23, 2023, 11:57:22 AMQuote from: zasad@ on August 23, 2023, 11:35:03 AM🤡 The clown makes the crypto community happy again 🤡https://twitter.com/Dr_CSWrightIf CSW cannot prove in court their rights to the authorship of bitcoin, then on Twitter it is possible. Although he should indicate the authorship of which bitcoin he claims.But perhaps Twitter will force him to change this entry.On CSW Twitter title, I know too well that if this gets to the attention of Elon Musk, he will quickly rip off that title from him. No matter how manipulative Elon has been to the cryptocurrency industry, I trust him to know the truth about the CSW claim. It is evidently obvious that CWS is not Satoshi and cannot own the bitcoin copyright but what marvels me is the level and stage he has attained without being halted indefinitely. Now I don't think it will happen. A clown is supposed to make people laugh, and CSW is the author of BSV.There are people in the USA who identify themselves as cats, and CSW identify themselves as the \"Bitcoin Creator\".In the hospital, such people are placed in different wards 🤡",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}