{
  "id": "topic_5449980",
  "title": "ajaxtempest",
  "author": "ajaxtempest",
  "created_time": "April 24, 2023, 10:57:17 AM",
  "content": "https://heatbit.com/They are currently taking preorders for the mini 3 in 1 miner. Shipping is in Q4 2023.specsPower (if heating by mining only)300wHashrateUp to 10 TH/sMining chips5nm techPower efficiencyas low as 25 J/THConventional heating boost+ 1000wNoise at full power<40dBWeight8.8 lbs / 4 kgHeight18 '' / 46 cmDiameter7 ″ / 18 cmSafety standardsUL / CSA / CE50W for only air purifier mode1000W for only heater mode300W for mining mode.Pretty cute setup. Wonder if it has ethernet.IT was supposed to end yestarday for the discounted price but they have again renewed it.249$ for shared version499 for the full version.Sadly i cannot order it as they are not delivering it to my country. So what do you guys think? Is it legit?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449980",
  "comments": [
    {
      "author": "netghost",
      "created_time": "April 24, 2023, 06:33:34 PM",
      "body": "Only supports mining to nicehash, They have a previous product the Heatbit One so there must be some out there. the \"Shared Ownership\" option mines 50% for them. so the $249 option is a bit of a red herring.Martin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 24, 2023, 06:50:05 PM",
      "body": "Never heard of it so cannot comment. On scam or not. Kinda looks scammy but who knows.BUT they do take credit card payment. So if they do not ship by the end of the year you can always file a complaint with your CC company and get your money back.Not 100% ideal but it does give you some comfort of knowing that they can't entirely screw you.As for the 50% nicehash, according to them that is only until they generate $250 through mining then it's all yours. Once again, will they follow though? Is this some custom portal that if they go under you have a paperweight, don't have the answer to that either.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CochnocherCrypto",
      "created_time": "April 25, 2023, 06:08:00 PM",
      "body": "The HeatBit One has been popping up on eBay and a buddy of mine purchased one from Bitcoin Merch. CAN CONFIRM that the One is a real product - haven't seen one of the mini's in person yet though so can't say much about the less expensive offering. The \"shared\" offering doesn't really sit right with me but that doesn't mean its a \"scam\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "May 04, 2023, 09:34:59 PM",
      "body": "Not very nice that you can not simply put in your pool details, since this miner will probably be the most effective as a lottery solo miner. Still I like that it has a very stylish design and the price also seems fair for the package. A used S9 will also get you 15 THS at the cost of around 200 USD, but it will be without warranty and not in this beautiful packaging. If somebody buys one I would be happy about some kind of review!Edit: price is 600USD and this is to high in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajaxtempest",
      "created_time": "November 13, 2023, 04:10:49 PM",
      "body": "reviews are outhttps://www.youtube.com/watch?v=ShW25ZusLy4They bumped up the power for 400watts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flep182",
      "created_time": "November 17, 2023, 07:25:21 AM",
      "body": "Can't find any details on their website for setup options, the review video had more info on the app than the website. I wouldn't want this be linked to one pool/website only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajaxtempest",
      "created_time": "November 27, 2023, 03:07:21 PM",
      "body": "anyone bought it?I cancelled it as it is wifi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "April 13, 2024, 11:33:17 PM",
      "body": "Just jumping into this thread rather than starting a new one...Has anyone bought ont if these?I first came across this purely as a heating option then realised it was a Bitcoin miningrig and an air purifier, 3 in one sort of thing They are offering 3 purchase options:Heat with benefits (sold out)~14k sats per month - $239Equal Split~35k sats per month - $439Pay half of the cost but share 50% of the mining rewardFull Ownership~70k sats per month - $799For the miners what are the 5nm chips? how efficient are they?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "April 13, 2024, 11:48:44 PM",
      "body": "Quote from: aoluain on April 13, 2024, 11:33:17 PMFor the miners what are the 5nm chips? how efficient are they?It looks legit but the video review doesn't have any technical views or it might also be just content or a legit review but I don't see any technician views about the unit which makes me think that this might also be a scam. The price right now has increased a bit compared to the video I tried to order but there is no option for Paypal payment they only accept card and crypto payment if they accept Paypal you have a chance to try ordering the unit and reverse the payment once if the seller is a scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "April 14, 2024, 12:01:50 AM",
      "body": "you are better off with this itemhttps://altairtech.io/product/bitchimney/I built three high end models using the s19xp but I decided the price point is too high for that build.I will make three s19 builds which would be much cheaper.I do have a thread on the s19xp builds.after a lot of tweaking I can do 400 to 900 watts.but they cost me 1500 to build.if I used the s19 the price would be far lower  say 800 which themsame price  as this one with way more hash and efficiency.https://bitcointalk.org/index.php?topic=5485850.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}