{
  "id": "topic_5460426",
  "title": "Kalson9",
  "author": "Kalson9",
  "created_time": "July 20, 2023, 09:34:15 AM",
  "content": "As discipline and methodology in the social sciences,it studies,the relations of production in their complex interaction with the productive forces and the superstructure , Production is a process that take place between man and nature in the course of which man transforms natural substances into a product necessary for human life(llyin and motyley , 1986).However ,the productive forces are labour , power, objects of labour and means of labour processes. The superstructure denotes those elements such as ; the state ,belief, ideology , and education .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460426",
  "comments": [
    {
      "author": "komisariatku",
      "created_time": "July 20, 2023, 01:10:04 PM",
      "body": "Sounds like you need a longer prologue so I know what your question means.As little as I know, the idea of ​​political economy is an idea about political and economic power in a community/country. Early figures of political economy ideas appeared in the 17th century. This idea was born from the philosopher and economist Adam Smith. During its journey, in the 20th century, political economy split into two main camps, namely the left-wing movement pioneered by Karl Marx with the ideology of Marxism and the right-wing movement with liberal and conservative ideologies.To be able to carry out political economy, there are several foundations that need attention1# Political power2# Economic system3# Public policy4# Market5# Etc (I forget)  I think this discussion is too theoretical and I've forgotten a lot of theory. Maybe that's what I can answer and what little I still remember in my head",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "July 20, 2023, 01:42:38 PM",
      "body": "Quote from: Kalson9 on July 20, 2023, 09:34:15 AMAs discipline and methodology in the social sciences,it studies,the relations of production in their complex interaction with the productive forces and the superstructure , Production is a process that take place between man and nature in the course of which man transforms natural substances into a product necessary for human life(llyin and motyley , 1986).However ,the productive forces are labour , power, objects of labour and means of labour processes. The superstructure denotes those elements such as ; the state ,belief, ideology , and education .Theories only produce other theories. So if you have money then you have power over the economy, politics, and social status in the eyes of society. You don't need to get too far into this kind of thing, because if you return to the facts of life in the environment all political and social elements collide with each other. So everything starts from the basics, how can you control finances, how can you manage the system in the family and if you are a person working in a certain agency can you maneuver to stay afloat from competitors' political or economic games?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "July 20, 2023, 03:10:13 PM",
      "body": "Quotehttps://www.google.com/url?q=https://nou.edu.ng/coursewarecontent/POL%2520311%2520Nov%25202020.pdf&sa=U&ved=2ahUKEwjwtfP4wZ2AAxVRh1wKHT1rBQsQFnoECAoQAg&usg=AOvVaw3TT-yB3xSpm1xb3ne6P1OPPolitical economy focuses attention on not only the production and management of society's material wealth but also it's distribution among various segments or classes and conflict which arises from these processes. The approach evolved on the foundation of classical political economy and derives its roots from the works of Karl Marx building in the works of Adam Smith, David Ricardo and James Mill. Cited N.J. Nna, 1999 page2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 20, 2023, 11:24:16 PM",
      "body": "From looking at the meaning of political economy, I find that it is the study of the relationship between the government and its national public when public policy is enacted[1]So I think this is more on laying rules and policies of the government regarding the nation's economic activity.  From the given article it is stated that:QuoteThe field of political economy involves the study of how economic theories such as capitalism or communism play out in the real world.As political parties come to and leave power, economic policy often changes due to the ideology and goals of the party in power.Those who study political economy seek to understand how history, culture, and customs impact an economic system, and vice versa.Global political economy studies how political forces shape global economic interactionsThe rise of globalism and global trade means that the political economy of one country can impact both the economy and the politics of others.I believe this topic is too broad and too deep but of course, it is very interesting to see how this discussion progress.[1] https://www.investopedia.com/terms/p/political-economy.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "July 20, 2023, 11:44:48 PM",
      "body": "Actually is been awhile I draw out time to study about this but was little out of point so I just quickly sneak into google to get some smooth view of what it's; Political economy is a branch of political science and economics studying economic systems (e.g. markets and national economies) and their governance by political systems (e.g. law, institutions, and government). Widely studied phenomena within the discipline are systems such as labour markets and financial markets, as well as phenomena such as growth, distribution, inequality, and trade, and how these are shaped by institutions, laws, and government policy. Originating in the 16th century, it is the precursor to the modern discipline of economics. Political economy in its modern form is considered an interdisciplinary field, drawing on theory from both political science and modern economics. From wikipedia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "July 21, 2023, 09:57:20 AM",
      "body": "Quote from: naira on July 20, 2023, 01:42:38 PMQuote from: Kalson9 on July 20, 2023, 09:34:15 AMAs discipline and methodology in the social sciences,it studies,the relations of production in their complex interaction with the productive forces and the superstructure , Production is a process that take place between man and nature in the course of which man transforms natural substances into a product necessary for human life(llyin and motyley , 1986).However ,the productive forces are labour , power, objects of labour and means of labour processes. The superstructure denotes those elements such as ; the state ,belief, ideology , and education .Theories only produce other theories. So if you have money then you have power over the economy, politics, and social status in the eyes of society. You don't need to get too far into this kind of thing, because if you return to the facts of life in the environment all political and social elements collide with each other. So everything starts from the basics, how can you control finances, how can you manage the system in the family and if you are a person working in a certain agency can you maneuver to stay afloat from competitors' political or economic games?I agree that every institution affects each other. The same way politics affect economics, economics affects politics. However, it should be noted that politics doesn't just revolve government, it is a system that can be found anywhere and hence most (if not all) will say that everything is political if analyzed appropriately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "July 21, 2023, 10:22:11 AM",
      "body": "OP, you need to collect your thoughts much better, what I'm getting at this post is that you're talking about how politics affects the economy. This is just me but I think that the politics is a really big factor in a country's economy because the state has a control over all the stuff that's within that country, be it labor, agriculture, population, urbanization and tourism, the politicians create the policies that drives the country's economy to go up or down. So in conclusion, the less corrupt and incompetent a government is, the more that country's economy will prosper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 21, 2023, 11:47:58 AM",
      "body": "Quote from: Kalson9 on July 20, 2023, 09:34:15 AMSnipYour title does not correlate with the content you're talking about, if you're to go into full economic details and scope, it's something wide that we may not finished sooner, but channelling it to political economic affairs, talks about the roles of government politics in the establishment of a stable and flexible economy system, this is a global discussion that involves all economic settings of the world, how politics controls and relate with the economic development in the society, the role of man labour in every aspect of the economy and the government intervention in this altogether to have a stable political economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 21, 2023, 01:23:18 PM",
      "body": "You could have asked a question to reflect your topic which is a sensitive one and very good also. Listening those items like you did would have given responses that will make your thread very much intellectual one. Not withstanding the lacuna of merging your thoughts together, Political economy is not discussed differently from politics as it affects the economy. That said, we have to look at politics which is basically the alliances formed to get government policies formed, execution or order of priority, likewise the economic policies. So it is basically the policies of economy in order of priority, which policies interacts to influence which policies. Politics is about lobbying also, compromise, alignments and priority. How politics affects or influence government policies is of top consideration in policy formation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 21, 2023, 05:24:54 PM",
      "body": "I don't understand what your topic means and the content of your topic,next time your topic should align with the content. If you are talking about politics and the economy, every economy depends on the government ability to create various means to strengthen the country's economy. This is where politics plays a major role in a country's economy because if the government is not the type that has good vision for the development of the country,the economy will be affected in the sense that he will hardly open doors for people with new innovations and will do things due to nepotism. Politics has been a major hindrance to the growth of our society because there is politics in the church,in our families and so many places.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}