{
  "id": "topic_5410995",
  "title": "prpz",
  "author": "prpz",
  "created_time": "August 24, 2022, 02:04:48 AMLast edit: August 24, 2022, 02:26:28 AM by prpz",
  "content": "Just curious if anything has changed in regards to recovery of walletsI am assuming no and its gone forever I have the address super old12fTGYkX4chakBFwbShsr5VTmE7C1Kn25Apassword I knowit was original bitcoin wallet back in the day that was a huge file and took forever to syncobviously no backup file access to pc or 12 word phraselittle over 2.1 bitcoins that were deposited from my slush pool when I mined back in the day(have access to pool obviously ) would gladly split 50-50 with anyone if they have any ideas on retrieval",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410995",
  "comments": [
    {
      "author": "jackg",
      "created_time": "August 24, 2022, 02:13:22 AM",
      "body": "Any idea where the computer could be?You can't recover anything without the old wallet file or a backup still (and that'll probably never change as it'd be an attack on bitcoin's security).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "prpz",
      "created_time": "August 24, 2022, 02:17:23 AM",
      "body": "Thanks thought so!!!sold it 8 years ago probably in a dumpster now  thought id ask didn't expect anything I am at peace with itthanks for replying still",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 24, 2022, 02:19:21 AM",
      "body": "Quote from: prpz on August 24, 2022, 02:04:48 AMpassword and username Password for your wallet file is fine. It will help you to get access to that wallet and then private keys.However, I would like to askWhat is username?Do you imply about the file name of your wallet file?If what you have is a wallet file and corresponding password to unlock that file, you will be able to access all private keys in that wallet.If you lost your wallet password, you can't access private key. Then you will need private keys (from your backups) to import that wallet and use it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "prpz",
      "created_time": "August 24, 2022, 02:26:04 AM",
      "body": "Quote from: tranthidung on August 24, 2022, 02:19:21 AMQuote from: prpz on August 24, 2022, 02:04:48 AMpassword and username Password for your wallet file is fine. It will help you to get access to that wallet and then private keys.However, I would like to askWhat is username?Do you imply about the file name of your wallet file?Yes sorry I misspoke you are correct",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}