{
  "id": "topic_5472892",
  "title": "Catenaccio",
  "author": "Catenaccio",
  "created_time": "November 05, 2023, 04:14:06 AM",
  "content": "I don't know what are your plans if you already invested in Bitcoin. Bitcoin has only 21 million coins in total supply and each four years, block subsidy halves one time.After the four years cycle from 2032 to 2036, 99.21% Bitcoin in total supply will be mined by miners. Since 2036, after a halving in 2036, only less than 0.8% bitcoins in total supply is available for Bitcoin miners to get it from mining.If you are young enough, buy and hold your bitcoin till years like 2036, 2040 or 2044. I really believe Bitcoin will not make you disappointed.Controlled supply",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472892",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 05, 2023, 06:48:22 AM",
      "body": "Quote from: Catenaccio on November 05, 2023, 04:14:06 AMIf you are young enough, buy and hold your bitcoin till years like 2036, 2040 or 2044. I really believe Bitcoin will not make you disappointed.If you buy bitcoin now, be expecting price increase. Next year is another halving. Bull run will follow halving and the price of bitcoin will increase. If to hold bitcoin for a longer time like 20 years, bitcoin is a store of value if not sold for that long time. But do not think it is because there will not be reduce in bitcoin supply again that will be responsible for the price increase alone, although it would be part of it, but as more people are buying bitcoin and also as more bitcoin is bought, the demand is significant enough to make the price increase as the supply into the circulation is not much if compare to the demand, and this makes the price of bitcoin to have been increasing all these time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "November 05, 2023, 07:26:13 AM",
      "body": "Let's me be real here, how about those of us that doesn't have yet are we gonna be okay to invest after the 2024 halving. I feel like the way people are talking about the halving in 2024 that if you don't investment now it is over for you. But the charts show it happens every four years which is good if I don't get to invest/buy now I can still buy when I have the capital. But I am curious to know, when every Bitcoin is mined what will happen to Bitcoin? Does that mean that we will only be revolving around the 20,999,999.9769 . For me it surely sounds odd that the whole world will just have to make use of the limited number of Bitcoin. Can someone please enlighten me more on how it's gonna work from 2140 and above",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "November 05, 2023, 09:01:01 AM",
      "body": "Quote from: Churchillvv on November 05, 2023, 07:26:13 AMBut I am curious to know, when every Bitcoin is mined what will happen to Bitcoin? Does that mean that we will only be revolving around the 20,999,999.9769 . For me it surely sounds odd that the whole world will just have to make use of the limited number of Bitcoin. Can someone please enlighten me more on how it's gonna work from 2140 and above If there are miners turn on their ASICs to mine Bitcoin blocks, the Bitcoin network will continue to be live.Miners receive block subsidy for each block they find. If they solo mine a block, they take all the block subsidy but if they join a Bitcoin mining pool, they will receive share of the block subsidy, not all.Miners also receive bitcoin from Bitcoin users. By confirming Bitcoin transactions, they get transaction fee from Bitcoin users. They can refuse transactions with too low fee and it's like a bargain between Bitcoin miners and Bitcoin users. If Bitcoin users want to get a confirmation from miners, give miners fee they accept.After 2140, miners will only receive bitcoin from Bitcoin transaction fee, no longer receive it from Bitcoin block subsidy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 05, 2023, 09:10:24 AM",
      "body": "Average life expectancy is 73 years old which mean holding until 2044 are 20 years, you don't have to be \"young enough\" to invest Bitcoin and enjoy the reward.Quote from: Churchillvv on November 05, 2023, 07:26:13 AMBut I am curious to know, when every Bitcoin is mined what will happen to Bitcoin? Does that mean that we will only be revolving around the 20,999,999.9769 . For me it surely sounds odd that the whole world will just have to make use of the limited number of Bitcoin. Can someone please enlighten me more on how it's gonna work from 2140 and above Nothing.Bitcoin will reach it's maximum supply, that's all. There's no such \"burn mechanism\" or increase Bitcoin total supply, with this condition, people are expect Bitcoin price will be very very high and the fees will also increase too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "November 05, 2023, 09:13:44 AM",
      "body": "Quote from: Churchillvv on November 05, 2023, 07:26:13 AMBut I am curious to know, when every Bitcoin is mined what will happen to Bitcoin? Does that mean that we will only be revolving around the 20,999,999.9769 . For me it surely sounds odd that the whole world will just have to make use of the limited number of Bitcoin. Can someone please enlighten me more on how it's gonna work from 2140 and above The scarcer Bitcoin in circulation and the more held it is, maybe Bitcoin will be very valuable. After there is no block reward, it should be the turnover of mined bitcoins. All bitcoins will only circulate, be sent, received, bought, sold, and miners will only earn Bitcoins from transactions through payment fees. But I'm a little worried about the cost which could possibly be very expensive as well. If there is no consensus of new developers to address Bitcoin's scalability or network congestion issues. But these are only estimates, we cannot predict the future exactly. At this age I probably won't live again until 2100. CMIIW",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 05, 2023, 09:34:37 AM",
      "body": "I don't see a problem with buying Bitcoin, as most people will do that, but how long can you wait? Some may be able to keep Bitcoin for a year and others may be able to do so for 10 years, but the amount of profit is determined by buying at the right time and selling at the right time, and you must have the luxury of choosing the right time, otherwise you may lose your money. So investing in Bitcoin is not always profitable, but rather is governed by the simplest rules of all investments",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 05, 2023, 02:09:01 PM",
      "body": "Quote from: Churchillvv on November 05, 2023, 07:26:13 AMBut I am curious to know, when every Bitcoin is mined what will happen to Bitcoin? Does that mean that we will only be revolving around the 20,999,999.9769 . For me it surely sounds odd that the whole world will just have to make use of the limited number of Bitcoin. Can someone please enlighten me more on how it's gonna work from 2140 and above Everything about bitcoin will continue just the way it is now except the mining which will stop and this will stop miners from getting the block reward and the only incentive left will be that of transactions fee. For ordinary bitcoiner who don’t mine bitcoin, it will still be just like the payment method it was used to. But after all have been it will seriously be expensive, a bitcoin could be upto a million dollars, if not more. The bitcoin it’s self is in units so it will basically not be just 21 million bitcoin but will be 21 million x 100 million satoshi which is the total unit of one bitcoin, if you look at it this way then you will see that the number wouldn’t be limited as you think. And since the supply is limited the price of one satoshi could be close a dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 05, 2023, 02:42:13 PM",
      "body": "Quote from: Zaguru12 on November 05, 2023, 02:09:01 PMAnd since the supply is limited the price of one satoshi could be close a dollar. I love optimistic story but one satoshi worth $1 is very unrealistic because 1 BTC will has its price at $100M. Do you think it will happen?With $100M for 1 BTC, how about wealth of people with 100 or 1000 BTC?They will be richer than many nations, is it realistic?How is the 21 millions Bitcoin cap is defined and enforced?Why is Bitcoin's supply limit sets to 21 million?QuoteAt the time of Bitcoin's creation, the entire world's money supply stood at approximately $21 trillion. This figure, known as the M1 money supply, is made up of the total value of all the physical money in the world, including cash, coins, travelers' checks, and more. If Bitcoin were to grow to become the single world currency—replacing all those that the M1 figure is comprised of—then each BTC would be worth $1 million. Because there are 100 million satoshi in each Bitcoin, this would place the value of each satoshi at $0.01.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 05, 2023, 03:27:44 PM",
      "body": "Quote from: Jawhead999 on November 05, 2023, 09:10:24 AMAverage life expectancy is 73 years old which mean holding until 2044 are 20 years, you don't have to be \"young enough\" to invest Bitcoin and enjoy the reward.In order to enjoy it you would also need to be able to enjoy it, not in a wheelchair or with a stomach that can't take any soup, which not a problem for some since you don't have the teeth to eat anything else anyhow.   So drop another 10 years in that and you have the maximum age of one who would enjoy those benefits in the 43, so you've just cut about 34% of the world population, not to mention that's also the wealthier. Most of them won't wait till that date, just as some didn't wait for 60k!There are more priorities in life than waiting for an investment to turn profitable.Quote from: Churchillvv on November 05, 2023, 07:26:13 AMLet's me be real here, how about those of us that doesn't have yet are we gonna be okay to invest after the 2024 halving. I feel like the way people are talking about the halving in 2024 that if you don't investment now it is over for you. But the charts show it happens every four years which is good if I don't get to invest/buy now I can still buy when I have the capital. So you think this will keep happening till there is no end, past performance is no guarantee of future results, keeping the sam pace and the same returns experienced before would be impossible simply because of the lack of wealth in the universe that needs to be poured in.Never gets old:It works now because Bitcoin is still you and it's still relatively easy to raise something from a  market cap of $600 billion to 2 $ trillion, but what are you going to do when it needs $100 trillion more?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "November 05, 2023, 03:44:58 PM",
      "body": "So Bitcoin enters the 99% mined stage in 2032, less than 10 years from now. 1% of that will take another 100 years which is freaking crazy. I am sure until then, it will be focus more on collecting each bit and the prices will surely be something where not everyone on this planet could afford to hold 1 complete/full Bitcoin.It's going to be very crazy. The good days are ahead, and if you want to be part of that, you gotta HODL your bags now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "November 05, 2023, 04:23:56 PM",
      "body": "Quote from: Catenaccio on November 05, 2023, 04:14:06 AMAfter the four years cycle from 2032 to 2036, 99.21% Bitcoin in total supply will be mined by miners. Since 2036, after a halving in 2036, only less than 0.8% bitcoins in total supply is available for Bitcoin miners to get it from mining.Miner rewards may also change if Bitcoin continues to be actively mined until it runs out.Of the total circulating supply, it has reached 19,534,037 BTC (93%) and still remains 1,465,963 of the 21 million maximum limit according to marketcap data.It doesn't really matter where it is stored and who has the number of Bitcoins if we add up to 19,534,037.When Bitcoin is scarce, at that time Bitcoin will ... ...I think, as Bitcoin decreases in supply, the most important thing I need to think about is how much Bitcoin I hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "November 05, 2023, 04:50:58 PM",
      "body": "Quote from: Churchillvv on November 05, 2023, 07:26:13 AMLet's me be real here, how about those of us that doesn't have yet are we gonna be okay to invest after the 2024 halving. I feel like the way people are talking about the halving in 2024 that if you don't investment now it is over for you.People talk about Bitcoin halving in this way all of the time and the noise and expectation will increase as the halving draws closer. If you cannot buy Bitcoin now, there is nothing you can do but to watch the market and learn from events like the upcoming halving, of course you can buy Bitcoin after the 2024 halving, as a matter of fact you can buy Bitcoin anytime, but if you are buying solely to make ROI off it, you have to watch the timing and try not to buy when it is at the peak of the bull run.Quote from: Churchillvv on November 05, 2023, 07:26:13 AMBut I am curious to know, when every Bitcoin is mined what will happen to Bitcoin?  Bitcoin is limited in supply, so new Bitcoins would no longer be mined and miners would only earn via transaction fees. The Bitcoins in circulation would then be the difference between 21m coins and lost coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 06, 2023, 01:07:43 PM",
      "body": "Supply is not the only thing that creates value. There are many altcoins that burn and reduce supply. However, demand or price do not react positively to this news. Therefore, Bitcoin’s limited supply, even if it is good, will not determine the future of the cryptocurrency unless it is accompanied by growth in demand, which necessarily means More people continue to see Bitcoin as having value.focusing on supply only as if it is the reason for the price increase is wrong thinking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "November 06, 2023, 01:20:16 PM",
      "body": "Quote from: hugeblack on November 06, 2023, 01:07:43 PM[...]focusing on supply only as if it is the reason for the price increase is wrong thinking.That is indeed right.Bitcoin's price is influenced by a multitude of factors not only the supply --it only contributes to the price increase but it won't work alone. However --I cannot blame people for expecting that there is a price increase right after halving comes because it was proven by previous years and this was the most anticipated moment by bitcoin enthusiasts which is really happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Essential10",
      "created_time": "November 11, 2023, 02:19:48 PM",
      "body": "Both supply and demand are important in the future of Bitcoin. People who buy bitcoins hope for higher prices in the future. Those who invest in Bitcoin have specific plans but vary from person to person. The cryptocurrency market is likely to move higher in the future, but this may depend on the particular existence and type of investment. There may be alternatives and appropriate plans for each individual. Since Bitcoin's supply is fixed. Bitcoin price bulling through halving in a certain circle. Bitcoin halving in 2024 has a strong chance of going higher. I think holding bitcoins for a certain period of time can be a profitable way to go in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "November 11, 2023, 02:40:25 PM",
      "body": "Quote from: hugeblack on November 05, 2023, 09:34:37 AMI don't see a problem with buying Bitcoin, as most people will do that, but how long can you wait? Some may be able to keep Bitcoin for a year and others may be able to do so for 10 years, but the amount of profit is determined by buying at the right time and selling at the right time, and you must have the luxury of choosing the right time, otherwise you may lose your money. So investing in Bitcoin is not always profitable, but rather is governed by the simplest rules of all investmentsSome people have the mindset of keeping bitcoin for long term but due panic make them to sell when the time is not due, and what you said is right for how long you keep your bitcoin and when you sell your bitcoin also, is not to buy bitcoin and keep for longterm is the matter,  what matters most is when to sell, because someone can buy bitcoin this year 2023 as bitcoin price is at thirty seven thousand and after seven years and the person is ready to convert to fiat because of challenges and the price of bitcoin get lower the price and he/she bought the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "November 11, 2023, 03:18:36 PM",
      "body": "Quote from: Churchillvv on November 05, 2023, 07:26:13 AMBut I am curious to know, when every Bitcoin is mined what will happen to Bitcoin? Does that mean that we will only be revolving around the 20,999,999.9769 . For me it surely sounds odd that the whole world will just have to make use of the limited number of Bitcoin. Can someone please enlighten me more on how it's gonna work from 2140 and above I guess you already know how Bitcoin and every other cryptocurrency price get high and low. When the demand is high, and the selling pressure is low, the price gets high. When there is more selling pressure than buying, means people cashing out their Bitcoin, and then the price goes low. Now, what is the different between Bitcoin and other cryptocurrencies?Well, Bitcoin is decentralized and has a limited supply which is 21 Million and it's impossible to change. So, it's limited. Since the price depends on the demand, after 2140, the scarcity will increase and people will look for Bitcoin but the supply is still 21 Million. More people will adopt Bitcoin and you never know, you may see 1 BTC = 500K? or maybe more? On the other hand, most other cryptocurrencies are centralized and the devs can change the supply limit. Which is the reason there won't be any shortage of those coins and there won't be any scarcity as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 12, 2023, 05:58:13 PM",
      "body": "Quote from: Charles-Tim on November 05, 2023, 06:48:22 AMQuote from: Catenaccio on November 05, 2023, 04:14:06 AMIf you are young enough, buy and hold your bitcoin till years like 2036, 2040 or 2044. I really believe Bitcoin will not make you disappointed.If you buy bitcoin now, be expecting price increase. Next year is another halving. Bull run will follow halving and the price of bitcoin will increase. If to hold bitcoin for a longer time like 20 years, bitcoin is a store of value if not sold for that long time. But do not think it is because there will not be reduce in bitcoin supply again that will be responsible for the price increase alone, although it would be part of it, but as more people are buying bitcoin and also as more bitcoin is bought, the demand is significant enough to make the price increase as the supply into the circulation is not much if compare to the demand, and this makes the price of bitcoin to have been increasing all these time.I agree that you don't have to wait for 20 years before you can make significant profit to sell your bitcoin. Halving is every four years, followed by ATH and bull run, they are perfect times to sell, you can just target one of them to cash in on your investment profits. Of course you can wait for 20 or more years before selling your bitcoin, especially if you're younger and have target to achieve a project in the far future. But it shouldn't be just because of geometrical increases in price that'll make you wait for that long before selling. I wouldn't worry too much about when the last bitcoin is mined, whether there will be scarcity and price will skyrocket, that is a very long time, I'll be happy to hop on any bull run that suits me and cash in. Repeat and start investing again, that's the cycle for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "November 14, 2023, 03:28:09 AM",
      "body": "Quote from: Catenaccio on November 05, 2023, 04:14:06 AMI don't know what are your plans if you already invested in Bitcoin. Bitcoin has only 21 million coins in total supply and each four years, block subsidy halves one time.Crypto can change the financial world, and currently everything is still being worked on and this may have been set by the creator of BTC by including such a concept.Yes. It is true that there is still an opportunity for individual users to participate in the Bitcoin network to earn Bitcoins through mining activities but, on the other hand there are also some people who fear that the average user running the full version of the Bitcoin software may no longer be able to centralize the network.So. Anyone with a decently configured computer can think about earning some Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}