{
  "id": "topic_5410156",
  "title": "BetGalaxyADM",
  "author": "BetGalaxyADM",
  "created_time": "August 16, 2022, 11:57:00 PMLast edit: August 17, 2022, 11:35:58 AM by Mr. Big",
  "content": "Help One of my personal accounts seemed to (maybe, hopefully not) been compromised.The email for password reset isn’t coming to my email… and I’m sure my password im using is correct….Worried because I was in the middle of a big escrow deal.Any support on here that can help?Update:I was able to find the emails that my password and email address on my account were changed.I clicked the links to lock the account.How do I regain access?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410156",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "August 17, 2022, 12:06:38 AM",
      "body": "What is the username of the account that has been compromised?I am going to leave a warning on the profile until you regain it.Follow these instructions for the account recovery process - Recovering hacked/lost accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "August 17, 2022, 12:09:25 AM",
      "body": "I assume you are talking about the Bitcointalk account, you are quite vague. We can't help you if we don't know about which account you are talking here.However, if you have any Bitcoin address that you used on the forum, you easy can prove ownership of the account by signing a message on the same address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PaulBf1",
      "created_time": "August 17, 2022, 12:09:33 AM",
      "body": "Try to follow the instructions here: https://bitcointalk.org/index.php?topic=5089777.0If you have a bitcoin  address associated with that account and can use it to sign messages, follow these guidelines, and you will have your account restored once an administrator has had a chance to review your case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BetGalaxyADM",
      "created_time": "August 17, 2022, 12:29:52 AMLast edit: August 17, 2022, 08:54:44 AM by mprep",
      "body": "Quote from: JeromeTash on August 17, 2022, 12:06:38 AMWhat is the username of the account that has been compromised?I am going to leave a warning on the profile until you regain it.Follow these instructions for the account recovery process - Recovering hacked/lost accounts scott2kQuote from: examplens on August 17, 2022, 12:09:25 AMI assume you are talking about the Bitcointalk account, you are quite vague. We can't help you if we don't know about which account you are talking here.However, if you have any Bitcoin address that you used on the forum, you easy can prove ownership of the account by signing a message on the same address.Sorry, yes, bitcointalk account.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 17, 2022, 09:24:17 AM",
      "body": "Quote from: BetGalaxyADM on August 17, 2022, 12:29:52 AMscott2kFrom what I see (on Ninjastic Space) this scott2k account didn't post any bitcoin address (nor PGP key), hence I would not expect miracles in recovering that account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 17, 2022, 10:31:49 AM",
      "body": "I think the OP is more interested in finding out how his account got hacked. Based on his story, it was from the hacked account that PMs were sent, after which the escrow realized that everything was fine and sent his money to the seller's account.On the other hand, all PMs can be deleted in advance. The account itself is quite young to be of any value. It's easier to open a new account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "August 17, 2022, 09:22:09 PM",
      "body": "Quote from: BetGalaxyADM on August 17, 2022, 12:29:52 AMscott2kI have left negative feedback on the profile, but you haven't told as exactly how the account was hacked.Did you receive any random phishing Private message?Did you use a very weak guessable password?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "August 18, 2022, 10:42:39 AM",
      "body": "Quote from: BetGalaxyADM on August 16, 2022, 11:57:00 PMHelp One of my personal accounts seemed to (maybe, hopefully not) been compromised.Let's be frank here, the majority of those that make complaints in this regards have the highest blame upon them because their are the ones that have initiated the attacking process right from time by not careful in dealing with malicious stuffs online, i believe we have the freedom to surf the internet is not to get us harmed or scammed but because of our too much engagement in irrelevant activities, threads and download links pave way into our personal system and profile into hack, and once they launched an attack, there's free access to any length they would have wanted to, don't abuse the access to freedom of the use of the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "August 18, 2022, 02:16:41 PMLast edit: August 18, 2022, 02:39:14 PM by Mr.right85",
      "body": "Quote from: BetGalaxyADM on August 16, 2022, 11:57:00 PMOne of my personal accounts seemed to (maybe, hopefully not) been compromised.The email for password reset isn’t coming to my email… and I’m sure my password im using is correct….Worried because I was in the middle of a big escrow deal.I clicked the links to lock the account.How do I regain access?I don't seem to understand what you mean by clicking the links to lock the account but, if that could mean a restricted access to who ever the hacker might be, you might just be in a little luck and as what you would need now is the follow up which you are unto already.Now, the chances for you is quite slim as, judging by how young the account in question is, you might not have had a staked address on it and on that note, the forum might not be able to verify the legitimacy of your claims as it could go both ends.Perhaps user changed the account due to compromise as you now cry as well.Having to talk about deals and an escrow, hoping that the damage have not been done already, you might want to contact whom is offering the escrow service to demand  signed message from the funding address but that too depends on if, you did send the funds in this deal from your wallet directly and not an exchange.Which ever way, don't give up just yet, keeping seeking a means and in the main time, I guess tagging the account is one way to raise a red flag.QuoteI was able to find the emails that my password and email address on my account were changed.Except my eyes fails me but, the moderator log on your account only registers a password change with no records of an email change. So,Where is the claims on email coming from?Could it be that you changed your account password and just don't recall what it was?Just maybe, you used a random email address in registration and now you can't access nor change it without knowing the password to the account no more?Of course am just speculating but, you need to be on point to get some real help at OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 19, 2022, 09:46:17 PM",
      "body": "Quote from: Dunamisx on August 18, 2022, 10:42:39 AMQuote from: BetGalaxyADM on August 16, 2022, 11:57:00 PMHelp One of my personal accounts seemed to (maybe, hopefully not) been compromised.Let's be frank here, the majority of those that make complaints in this regards have the highest blame upon them because their are the ones that have initiated the attacking process right from time by not careful in dealing with malicious stuffs online, i believe we have the freedom to surf the internet is not to get us harmed or scammed but because of our too much engagement in irrelevant activities, threads and download links pave way into our personal system and profile into hack, and once they launched an attack, there's free access to any length they would have wanted to, don't abuse the access to freedom of the use of the internet. Quite sensible,  in other words,  we are the ones who attract the things that happen to us through out actions and inactions,  and it doesn't end at abusing the freedom of the use of the internet like you said.Many people create too many accounts, far more than what they can manage, and one thing I discover is that, the more accounts you create on a platform,  the weaker the passwords will become as you go on creating more and more,  let's say for example,  you want to create 10 different accounts on Facebook,  each with a different password,  you will discover that the first account you create will have a good password strength.Second account might also have a good password strength.Third, fourth, fifth and by the time you get to the tenth,  you have ran out of password ideas and you end up creating an account with a very poor password which can be easily hacked by Hackers.It is advisable to avoid alt-accounting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}