{
  "id": "topic_5471610",
  "title": "Woyzeck",
  "author": "Woyzeck",
  "created_time": "October 25, 2023, 12:49:59 PM",
  "content": "Подскажите как правильно хранить крипту на ноуте? Есть какая инфа?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471610",
  "comments": [
    {
      "author": "xandry",
      "created_time": "October 25, 2023, 01:01:32 PM",
      "body": "Quote from: Woyzeck on October 25, 2023, 12:49:59 PMПодскажите как правильно хранить крипту на ноуте? Есть какая инфа?Вы не поверите, но так же как на компьютере. Уточните вопрос, если ожидали другой ответ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "October 25, 2023, 01:24:59 PM",
      "body": "Quote from: Woyzeck on October 25, 2023, 12:49:59 PMПодскажите как правильно хранить крипту на ноуте? Есть какая инфа?1) По возможности отказаться от этой идеи и купить себе надежный аппаратный кошелек2) Использовать операционные системы менее подверженные вирусным атакам: дистрибутивы Linux, MacOS3) Хранить бэкапы в зашифрованных контейнерах под надежными и длинными паролями4) Использовать только популярные и проверенные кошельки с открытым исходным кодом, которые еще дополнительно шифруют свои файлы5) Хранить все пароли к зашифрованным файлам отдельно на физических носителях6) По возможности отказаться от этой идеи и купить себе надежный аппаратный кошелек",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 25, 2023, 02:45:14 PM",
      "body": "Quote from: Woyzeck on October 25, 2023, 12:49:59 PMПодскажите как правильно хранить крипту на ноуте? Есть какая инфа?Да весь форум забит такой инфой. Ваша мышка вам в помощь. Quote from: witcher_sense on October 25, 2023, 01:24:59 PMQuote from: Woyzeck on October 25, 2023, 12:49:59 PMПодскажите как правильно хранить крипту на ноуте? Есть какая инфа?1) По возможности отказаться от этой идеи и купить себе надежный аппаратный кошелекНоут (холодный), которыё никогда не подключался и никогда не будет подключаться к Интернету, наверное будет получше, чем любой  \"надежный аппаратный кошелек\",  хотя менее удобный в использовании.Quote from: witcher_sense on October 25, 2023, 01:24:59 PM2) Использовать операционные системы менее подверженные вирусным атакам: дистрибутивы Linux, MacOSОпять же, если ноут холодный, то выбор операционки  не   важный. Quote from: witcher_sense on October 25, 2023, 01:24:59 PM3) Хранить бэкапы в зашифрованных контейнерах под надежными и длинными паролями.Passport, кстати, предлагает такую опцию хранить бэкап в зашифрованном зип-контайнере, но я всё равно предпочитаю бумагу плюс шайбы, если речь идёт о СИД фразе. Quote from: witcher_sense on October 25, 2023, 01:24:59 PM4) Использовать только популярные и проверенные кошельки с открытым исходным кодом, которые еще дополнительно шифруют свои файлыСогласен.Quote from: witcher_sense on October 25, 2023, 01:24:59 PM5) Хранить все пароли к зашифрованным файлам отдельно на физических носителяхИспользовать надёжные манеджеры паролей, например, KeePass.Quote from: witcher_sense on October 25, 2023, 01:24:59 PM6) По возможности отказаться от этой идеи и купить себе надежный аппаратный кошелекНапример, Passport 2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "October 25, 2023, 03:39:01 PM",
      "body": "Если Ноут (холодный), ко как потом с него криптовалюту тратить?Тогда понадобится подключится к интернету или переносить кошелек на другой компьютер. Для меня ноут всегда стоил намного дороже, чем аппаратный кошелек.может вам быстро потребуется чтото поменять, а программные кошельки могут не отправить монеты без обновления базы блокчейна",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 25, 2023, 04:20:24 PMLast edit: October 25, 2023, 05:34:08 PM by satscraper",
      "body": "Quote from: safar1980 on October 25, 2023, 03:39:01 PMЕсли Ноут (холодный), ко как потом с него криптовалюту тратить?Тогда понадобится подключится к интернету или переносить кошелек на другой компьютер. Для меня ноут всегда стоил намного дороже, чем аппаратный кошелек.может вам быстро потребуется чтото поменять, а программные кошельки могут не отправить монеты без обновления базы блокчейнаКак тратить?  Создаёте на горячем ноуте  транзакцию, отдаёте её на подпись холодному ноуту, используя любой канал связи (лучше оптический), холодный ноут её подписывает и отправляет уже подписанную транзакцию горячему ноуту, используя тот же канал связи, а тот уже передаёт подписанную транзакцию в сеть.Приватные ключи хранятся на холодном ноуте -  соответствующие публичные ключи - на горячем.Обычное дело, ничего мудрённого в нём нет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "October 26, 2023, 05:48:16 AM",
      "body": "Quote from: satscraper on October 25, 2023, 04:20:24 PMКак тратить?  Создаёте на горячем ноуте  транзакцию, отдаёте её на подпись холодному ноуту, используя любой канал связи (лучше оптический), холодный ноут её подписывает и отправляет уже подписанную транзакцию горячему ноуту, используя тот же канал связи, а тот уже передаёт подписанную транзакцию в сеть.Приватные ключи хранятся на холодном ноуте -  соответствующие публичные ключи - на горячем.Обычное дело, ничего мудрённого в нём нет.Холодный ноут - это хорошая идея, но мне кажется обеспечить должную безопасность такого устройства не совсем тривиальная задача. В отличие от аппаратного кошелька, у ноутбука есть много лишних \"деталей\" типа WiFi-модулей, разъемов RJ-45 и других. В идеале это все нужно удалить из ноутбука перед использованием для минимизации векторов атаки, а также чтобы избежать случайного самоподключения к Интернету. Также в отличие от аппаратного кошелька, у ноутбука нет элемента безопасности, то есть пользователю нужно самому обеспечивать шифрование и дешифрование своих приватных ключей и обеспечивать должную изоляцию от внешних воздействий. Также в отличие от аппаратного кошелька, у ноутбука гораздо все хуже с коммуникацией: не совсем понимаю, что вы имеете в виду под \"оптическим каналом связи\", но вот если передавать транзакции через USB или SD-карты, то можно случайно занести туда что-то нехорошее. Короче говоря, если ноутбука подходящего нет, то лучше купить аппаратный кошелек и не париться, а если есть, то стоит еще дважды подумать и прочитать парочку гайдов как превратить ноутбук в холодное хранилище правильно. По-моему даже на форуме такие темы создавали.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 26, 2023, 07:22:23 AM",
      "body": "Quote from: witcher_sense on October 26, 2023, 05:48:16 AMХолодный ноут - это хорошая идея, но мне кажется обеспечить должную безопасность такого устройства не совсем тривиальная задача. В отличие от аппаратного кошелька, у ноутбука есть много лишних \"деталей\" типа WiFi-модулей, разъемов RJ-45 и других. Отвинчивается задняя крышка, выдёргиваются конекторы ведущие к Wi-Fi  и сетевым адаптерам  и все дела. Залача тривиальная. Нужно  только уметь  обращаться с отверткой. Quote from: witcher_sense on October 26, 2023, 05:48:16 AMТакже в отличие от аппаратного кошелька, у ноутбука нет элемента безопасности, то есть пользователю нужно самому обеспечивать шифрование и дешифрование своих приватных ключей Что либо шифровать на холодном компе это уже перебарщивание, но для параноиков в кубе можно весь диск зашифровать.Вы думаете в аппаратниках приватные ключи зашифрованы? Отнюдь. Их там вообще нет. Они высчитываются на лету и поставляются по запросу как есть. Quote from: witcher_sense on October 26, 2023, 05:48:16 AM не совсем понимаю, что вы имеете в виду под \"оптическим каналом связи\"  Вэб камера, QR  код, среда , в которой может распространяться свет, например обычный воздух  Quote from: witcher_sense on October 26, 2023, 05:48:16 AM лучше купить аппаратный кошелек и не париться, Вообщем, хороший аппаратник удобнее. Но надо учитывать  интересы ОР.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "October 26, 2023, 09:23:05 AM",
      "body": "Quote from: satscraper on October 26, 2023, 07:22:23 AMОтвинчивается задняя крышка, выдёргиваются конекторы ведущие к Wi-Fi  и сетевым адаптерам  и все дела. Залача тривиальная. Нужно  только уметь  обращаться с отверткой. Звучит действительно несложно, но главное потом не передумать использовать ноут только как холодное хранилище информации. А то еще кроме отвертки понадобится и паяльник.QuoteЧто либо шифровать на холодном компе это уже перебарщивание, но для параноиков в кубе можно весь диск зашифровать.Вы думаете в аппаратниках приватные ключи зашифрованы? Отнюдь. Их там вообще нет. Они высчитываются на лету и поставляются по запросу как есть. Но в случае с ноутбуком будет использоваться обычный софтовый кошелек и там механизм расчета приватных ключей может отличаться. Главная идея, что открытым текстом хранить конфиденциальную информацию опасно даже на холодном компе. В аппаратнике об этом не беспокоишься именно из-за изолированной природы элемента безопасности. А тут вся ответственность ложится на плечи юзера.QuoteВэб камера, QR  код, среда , в которой может распространяться свет, например обычный воздух  Параноики же заклеивают камеру даже на холодном ноутбуке.QuoteВообщем, хороший аппаратник удобнее. Но надо учитывать  интересы ОР. Интересы ОP не ясны, но если возникает вопрос как хранить правильно, то возможно он не готов у таким серьезным мерам как кустарное холодное хранилище.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "October 26, 2023, 09:52:10 AM",
      "body": "Quote from: satscraper on October 25, 2023, 02:45:14 PMQuote from: witcher_sense on October 25, 2023, 01:24:59 PM2) Использовать операционные системы менее подверженные вирусным атакам: дистрибутивы Linux, MacOSОпять же, если ноут холодный, то выбор операционки  не   важный.Я бы дополнил лишь тем, что купить придется все же более-менее современный ноут лишь из-за того, чтобы он поддерживал обновления ПО. Просто если пользователь купит какой-нибудь древний аппарат из 2010х с целью сэкономить но с заделом на будущее, то максимум он поставит Windows 10 или macOS 10.13 High Sierra, и через пару лет придется танцевать с бубнами, чтобы поставить свежий софт. П.С.Это больше совет и наблюдение. Имею для подобных целей старенький ноут, и его браузеры уже не открывают правильно некоторые страницы, а ОС уже не обновить на более новую версию. А обновление через перенос данных например на флешке, это уже удар по безопасности.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "October 26, 2023, 10:08:11 AM",
      "body": "Quote from: bakasabo on October 26, 2023, 09:52:10 AMЯ бы дополнил лишь тем, что купить придется все же более-менее современный ноут лишь из-за того, чтобы он поддерживал обновления ПО. Просто если пользователь купит какой-нибудь древний аппарат из 2010х с целью сэкономить но с заделом на будущее, то максимум он поставит Windows 10 или macOS 10.13 High Sierra, и через пару лет придется танцевать с бубнами, чтобы поставить свежий софт. П.С.Это больше совет и наблюдение. Имею для подобных целей старенький ноут, и его браузеры уже не открывают правильно некоторые страницы, а ОС уже не обновить на более новую версию. А обновление через перенос данных например на флешке, это уже удар по безопасности. В итоге это все выглядит бессмысленно, просто купить хороший аппаратник и не заморачиваться холодными ноутбуками, плюсов у такого решения очень много, начиная с того что вам не придется держать ноутбук, которым вы сможете по сути пользоваться только для осуществления транзакций, иногда это будет всего лишь несколько раз в пару месяцев, такое себе.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "October 26, 2023, 10:32:16 AM",
      "body": "Woyzeck, может конкретизируете свой вопрос? Какую конкретно крипту собираетесь хранить? Кто имеет доступ к Вашему устройство, собираетесь ли использовать это устройство еще для каких-либо действий (серфинг, скачивание торрентов и т.п.).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "October 26, 2023, 11:04:21 AM",
      "body": "Quote from: Woyzeck on October 25, 2023, 12:49:59 PMПодскажите как правильно хранить крипту на ноуте? Есть какая инфа?Тут нужно ещё отметить, что классическая криптовалюты не хранится на устройствах, она грубо говоря расположена в блокчейне, то есть в виртуальном пространстве.На устройствах, девайсах устанавливается кошелёк, для взаимодействия с блокчейном. Также на на устройствах, девайсах, в том числе на ноутбуке, могут в каком-то виде хранится ваши приватные и публичные ключи, для взаимодействия с вашими средствами на блокчейне. И это является вектором атаки для потенциального злоумышленника.Особенностей тут очень много, и в частности, можно сделать одно замечание (в числе прочих) - при прочих равных, кошельки на ноутбуках более уязвимы, чем кошельки на смартфонах. Это связано с тем, что на смартфонах изначально предполагается работа с приложениями, которые постоянно скачиваются на телефон, и там изначально организовано более изолированное пространство для  функционирования таких приложений. В ноутбуках, там всё гораздо хуже уже на уровне системы. Об этом даже на официальном сайте Биткоина написано.Но это только один тонкий момент, на самом деле их очень много, также как и векторов атак.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 26, 2023, 04:59:41 PM",
      "body": "Quote from: Smartprofit on October 26, 2023, 11:04:21 AMQuote from: Woyzeck on October 25, 2023, 12:49:59 PMПодскажите как правильно хранить крипту на ноуте? Есть какая инфа?Тут нужно ещё отметить, что классическая криптовалюты не хранится на устройствах, она грубо говоря расположена в блокчейне, то есть в виртуальном пространстве.Что за виртуальное пространство такое? У меня блокчейн (а значит UTXO, т.е. криптовалюта) хранится на моём внешнем SSD диске, подбираясь уже почти к 600 гигам. У других пользователей насколько я знаю он тоже на физических носителях. Quote from: Smartprofit on October 26, 2023, 11:04:21 AMОсобенностей тут очень много, и в частности, можно сделать одно замечание (в числе прочих) - при прочих равных, кошельки на ноутбуках более уязвимы, чем кошельки на смартфонах. Это связано с тем, что на смартфонах изначально предполагается работа с приложениями, которые постоянно скачиваются на телефон, и там изначально организовано более изолированное пространство для  функционирования таких приложений. В ноутбуках, там всё гораздо хуже уже на уровне системы. Об этом даже на официальном сайте Биткоина написано.Вот и theymos предполагает то же самое, хотя для меня это нонсенс, особенно если рассматривать Андроид, С IOS наверное так оно и есть.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "igor72",
      "created_time": "October 27, 2023, 08:01:39 AM",
      "body": "Quote from: satscraper on October 26, 2023, 04:59:41 PMЧто за виртуальное пространство такое? У меня блокчейн (а значит UTXO, т.е. криптовалюта) хранится на моём внешнем SSD дискеУ вас хранится копия блокчейна, без сети она бесполезна, ваши utxo должны быть на большинстве узлов, только тогда они имеют ценность. QuoteВот и theymos предполагает то же самое, хотя для меня это нонсенс, особенно если рассматривать Андроид, С IOS наверное так оно и есть.Антонопулос тоже так считает.Мне кажется, вы несправедливо андроид обижаете. Я бы предпочел кошелек на правильном андроиде, чем на закрытом и централизованном айфоне. Айфон хорош для мультимедии всякой.p.s. Топикстартер, похоже, уже забыл, что вопрос задавал ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 27, 2023, 08:15:47 AMLast edit: October 27, 2023, 09:16:38 AM by satscraper",
      "body": "Quote from: igor72 on October 27, 2023, 08:01:39 AMQuote from: satscraper on October 26, 2023, 04:59:41 PMЧто за виртуальное пространство такое? У меня блокчейн (а значит UTXO, т.е. криптовалюта) хранится на моём внешнем SSD дискеУ вас хранится копия блокчейна, без сети она бесполезна, ваши utxo должны быть на большинстве узлов, только тогда они имеют ценность. А что где-то хранится оригинал блокчейна?На всех узлах в том числе и на моём хранятся копии не отличимые одна от другой.Поэтому особого смысла в вашем замечании не вижу, тем более, что оно не имеет никакой связи к тому что я говорил - нет никакого виртуального пространства, в котором существует блокчейн.Взаbмодействующие узлы образуют вполне конкретное физическое пространство.Quote from: igor72 on October 27, 2023, 08:01:39 AMQuoteВот и theymos предполагает то же самое, хотя для меня это нонсенс, особенно если рассматривать Андроид, С IOS наверное так оно и есть.Антонопулос тоже так считает.Мне кажется, вы несправедливо андроид обижаете. Я бы предпочел кошелек на правильном андроиде, чем на закрытом и централизованном айфоне. Айфон хорош для мультимедии всякой.p.s. Топикстартер, похоже, уже забыл, что вопрос задавал ).Да я не обижаю. Я чего-то сматфонам не доверяю, ни Андроиду ни АЙОС. У меня и тот и другой, но на каждом минимум програм, в основном звонки и мессенджеры.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "October 27, 2023, 03:08:03 PM",
      "body": "Quote from: satscraper on October 25, 2023, 04:20:24 PMQuote from: safar1980 on October 25, 2023, 03:39:01 PMЕсли Ноут (холодный), ко как потом с него криптовалюту тратить?Тогда понадобится подключится к интернету или переносить кошелек на другой компьютер. Для меня ноут всегда стоил намного дороже, чем аппаратный кошелек.может вам быстро потребуется чтото поменять, а программные кошельки могут не отправить монеты без обновления базы блокчейнаКак тратить?  Создаёте на горячем ноуте  транзакцию, отдаёте её на подпись холодному ноуту, используя любой канал связи (лучше оптический), холодный ноут её подписывает и отправляет уже подписанную транзакцию горячему ноуту, используя тот же канал связи, а тот уже передаёт подписанную транзакцию в сеть.Приватные ключи хранятся на холодном ноуте -  соответствующие публичные ключи - на горячем.Обычное дело, ничего мудрённого в нём нет.ну да, вместо простого и маленького аппаратного кошелька нужно с собой носить 2 ноута или брать в путешествие и поездки. а с аппаратного кошелька можно и с телефона транзакцию отправить в экстренном варианте. по битку я видел инструкции, но с другими монетами сложности будут даже у крипана с опытом.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "October 27, 2023, 03:34:33 PM",
      "body": "Quote from: safar1980 on October 27, 2023, 03:08:03 PMну да, вместо простого и маленького аппаратного кошелька нужно с собой носить 2 ноута или брать в путешествие и поездки. а с аппаратного кошелька можно и с телефона транзакцию отправить в экстренном варианте. по битку я видел инструкции, но с другими монетами сложности будут даже у крипана с опытом.А зачем с собой холодное хранилище вообще таскать? Пусть себе лежит в надежном месте и не отсвечивает, а если надо взять криптовалюту в путешествие, то предварительно переводите себе на софтверный или аппаратный кошелек часть своих накоплений и спокойно перевозите. Но вот если само холодное хранилище надо перевезти, то тут возможно несколько вариантов. Самый лучший из них - это перевозить саму сид-фразу, на физическом носителе или в памяти (если это происходит в течении короткого периода времени). А аппаратный кошелек и тем более ноутбук привлекут много внимания, часто в аэропорту заставляют доставать и включать электронные устройства, на этом этапе их могут запросто конфисковать или сделать дамп памяти.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 27, 2023, 03:40:34 PMLast edit: October 27, 2023, 03:52:54 PM by satscraper",
      "body": "Quote from: safar1980 on October 27, 2023, 03:08:03 PMQuote from: satscraper on October 25, 2023, 04:20:24 PMQuote from: safar1980 on October 25, 2023, 03:39:01 PMЕсли Ноут (холодный), ко как потом с него криптовалюту тратить?Тогда понадобится подключится к интернету или переносить кошелек на другой компьютер. Для меня ноут всегда стоил намного дороже, чем аппаратный кошелек.может вам быстро потребуется чтото поменять, а программные кошельки могут не отправить монеты без обновления базы блокчейнаКак тратить?  Создаёте на горячем ноуте  транзакцию, отдаёте её на подпись холодному ноуту, используя любой канал связи (лучше оптический), холодный ноут её подписывает и отправляет уже подписанную транзакцию горячему ноуту, используя тот же канал связи, а тот уже передаёт подписанную транзакцию в сеть.Приватные ключи хранятся на холодном ноуте -  соответствующие публичные ключи - на горячем.Обычное дело, ничего мудрённого в нём нет.ну да, вместо простого и маленького аппаратного кошелька нужно с собой носить 2 ноута или брать в путешествие и поездки. а с аппаратного кошелька можно и с телефона транзакцию отправить в экстренном варианте. по битку я видел инструкции, но с другими монетами сложности будут даже у крипана с опытом.Отвечу, хотя понятия не имею зачем я это делаю. Сначала спрашивают о том как отправить с холодного ноута транзакцию, и после того как получили ответ, вдруг перескакивают на абсолютно несвязанную тему  поездок, причём делают в контексте своего первоначального вопроса и полученного ответа. Нонсенс.Да, во время поездок более удобный аппаратный кошелёк, который как я понял ОР не интересует. Он  задал конкретный вопрос о ноуте и  наверное уже получил ответ, раз больше здесь не появляется.Quote from: witcher_sense on October 27, 2023, 03:34:33 PM А аппаратный кошелек и тем более ноутбук привлекут много внимания, часто в аэропорту заставляют доставать и включать электронные устройства, на этом этапе их могут запросто конфисковать или сделать дамп памяти.Вы не поверите, но более двух десятков полётов в год в течении 15 лет , таскаю с собой и ноутбук и кошельки, ноль внимания. Правда кошельки стал брать только после того, как они у меня появились, лет пять как.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "October 28, 2023, 08:58:22 PM",
      "body": "Quote from: satscraper on October 27, 2023, 03:40:34 PMQuote from: safar1980 on October 27, 2023, 03:08:03 PMQuote from: satscraper on October 25, 2023, 04:20:24 PMQuote from: safar1980 on October 25, 2023, 03:39:01 PMЕсли Ноут (холодный), ко как потом с него криптовалюту тратить?Тогда понадобится подключится к интернету или переносить кошелек на другой компьютер. Для меня ноут всегда стоил намного дороже, чем аппаратный кошелек.может вам быстро потребуется чтото поменять, а программные кошельки могут не отправить монеты без обновления базы блокчейнаКак тратить?  Создаёте на горячем ноуте  транзакцию, отдаёте её на подпись холодному ноуту, используя любой канал связи (лучше оптический), холодный ноут её подписывает и отправляет уже подписанную транзакцию горячему ноуту, используя тот же канал связи, а тот уже передаёт подписанную транзакцию в сеть.Приватные ключи хранятся на холодном ноуте -  соответствующие публичные ключи - на горячем.Обычное дело, ничего мудрённого в нём нет.ну да, вместо простого и маленького аппаратного кошелька нужно с собой носить 2 ноута или брать в путешествие и поездки. а с аппаратного кошелька можно и с телефона транзакцию отправить в экстренном варианте. по битку я видел инструкции, но с другими монетами сложности будут даже у крипана с опытом.Отвечу, хотя понятия не имею зачем я это делаю. Сначала спрашивают о том как отправить с холодного ноута транзакцию, и после того как получили ответ, вдруг перескакивают на абсолютно несвязанную тему  поездок, причём делают в контексте своего первоначального вопроса и полученного ответа. Нонсенс.Да, во время поездок более удобный аппаратный кошелёк, который как я понял ОР не интересует. Он  задал конкретный вопрос о ноуте и  наверное уже получил ответ, раз больше здесь не появляется.Quote from: witcher_sense on October 27, 2023, 03:34:33 PM А аппаратный кошелек и тем более ноутбук привлекут много внимания, часто в аэропорту заставляют доставать и включать электронные устройства, на этом этапе их могут запросто конфисковать или сделать дамп памяти.Вы не поверите, но более двух десятков полётов в год в течении 15 лет , таскаю с собой и ноутбук и кошельки, ноль внимания. Правда кошельки стал брать только после того, как они у меня появились, лет пять как. я думаю что сейчас стоит иметь более универсальное решение для хранения криптовалют, потому что все плохое  может произойти быстро.ноутбуком в аэропорту никого не удивишь и крипто кошелек в телефоне может быть и спрятан с помощью софта. я полагаю что таможня не сможет проверить все телефоны и ноутбуки, и шанс попасть на проверку маленький.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}