{
  "id": "topic_5463915",
  "title": "btcchamp88",
  "author": "btcchamp88",
  "created_time": "August 20, 2023, 12:41:57 PM",
  "content": "hello im a advanced php developer.you need any help for a project? or want a new project from scratch?im experienced in programming php sql and set up btcpay server gateway and api.also do website hosting and programming for tor network40usd/h or long term relationship, front payment for the first hours/days. looking forward for a trustfull raltionship.telegram @torphphttps://t.me/torphpfeel free to contact me",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463915",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 20, 2023, 02:01:22 PM",
      "body": "Quote from: btcchamp88 on August 20, 2023, 12:41:57 PM40usd/h or long term relationship, front payment for the first hours/days. looking forward for a trustfull raltionship.telegram @torphphttps://t.me/torphpfeel free to contact meI don't think anyone is going to give you the payment upfront. You need to consider discussing with a forum member who will be helping you to holding the fund. He will perform as escrow between you and your client. You are new in the forum, no one will trust you with their money unless you deliver the job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "August 21, 2023, 02:35:07 AM",
      "body": "Quote from: btcchamp88 on August 20, 2023, 12:41:57 PMhello im a advanced php developer.you need any help for a project? or want a new project from scratch?im experienced in programming php sql and set up btcpay server gateway and api.also do website hosting and programming for tor network40usd/h or long term relationship, front payment for the first hours/days. looking forward for a trustfull raltionship.telegram @torphphttps://t.me/torphpfeel free to contact meIf you really want to work and you can do that perfectly then you should wait for the payment until you complete the project. For example, I will hire you for a project for 500$ if you complete 90% project and can't complete the rest then I will lose the amount which I will send as upfront. Based on rank and reputation you cant deserve any upfront payment. But if you see the person for whom you want to work has no reputation then you may use bitcointalk escrow service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "August 22, 2023, 09:46:20 AM",
      "body": "Quote from: btcchamp88 on August 20, 2023, 12:41:57 PMim experienced in programming php sql and set up btcpay server gateway and api.For reminder, OP created these threads few days ago. So i would advice reader of this thread to be skeptical towards OP's claim about experience with Bitcoin-related tool.Quote from: btcchamp88 on August 13, 2023, 08:05:55 PMhey i am beginner with btc Can someone explain how to send money from a debit card to a Bitcoin address without having to create a Bitcoin wallet? What is the easiest and quickest way to do this? Quote from: btcchamp88 on August 13, 2023, 08:36:16 PMneed helpHello room, I ve been having issues with my bitcoin bought from bitcoin.com and sent to my wallet it has been unconfirmed for 6 days now. Please can anyone help out on what can be done?sry im new in paying with btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 22, 2023, 01:46:18 PM",
      "body": "Quote from: ETFbitcoin on August 22, 2023, 09:46:20 AMQuote from: btcchamp88 on August 20, 2023, 12:41:57 PMim experienced in programming php sql and set up btcpay server gateway and api.For reminder, OP created these threads few days ago. So i would advice reader of this thread to be skeptical towards OP's claim about experience with Bitcoin-related tool.I would also add, how come he is an \"advanced php developer \" and has no past work or experience to share?I have done some php works in the past , even this api (php only) and I wouldn't say i am advanced",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}