{
  "id": "topic_5398296",
  "title": "Ulven",
  "author": "Ulven",
  "created_time": "May 12, 2022, 10:37:02 AM",
  "content": "أعتقد أن الكثير منكم يعلم السقف الذي وصلت إليه عملة لونا حاليا يا لا العجب 0,04$. على ما يبدو العملة المتجهة نحو الهاوية أنا صراحة إستغربت من المسألة بعدما كان سعر العملة في سقف 80$ ليصل إلى أدنى مستوى.هل تعتقدون أن العملة ستتعافى في المستقبل؟ أم أنها مجرد سيتكون؟",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398296",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "May 12, 2022, 11:04:50 AM",
      "body": "في  رأيي العملة انتهت تماما فحتى و ان قامت الشركة ببيع كل البيتكوين الخاص بها (هذا فرضا أنها لم تقم بذلك بعد) لرفع سعر العملة المستقرة الخاصة بها من جديد  أو البحث عن مستثمرين لمساعدتهم للقيام  في هذا، فلن يثق أحد في المشروع من جديد",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 12, 2022, 11:23:10 AM",
      "body": "والله صراحة انا انذهلت تماما عندما نظرت إلى الشارت، أعتقدت أن هناك خلل أو أنها عملة شبيهة لها نفس الاسم لكن للأسف تأكدت من الاخبار أن هذا ما حدث فعلا. لونا كانت من العملات القوية جدا ومن المشاريع الناجحة واستغرب كيف يمكن أن يحدث هذا، أعتقد أن السبب انهيار عملتها المستقر TerraUSD  بعد أن فقدت الربط مع الدولار الأمريكي. لا أتوقع أن تعود لونا إلى سعرها ابدا لأن السيولة المتبقية تم سحبها على ما يبدو، والناس تتهافت على شراء لونا بسعر رخيص على أمل أن تعود للارتفاع. للأسف ما حدث شكل ضربة لسمعة العملات المشفرة وتأكدت التحذيرات التي كانت دائما تتبناها الحكومات والجهات المعادية للعملات المشفرة بانها غير مستقرة وتحمل مخاطر عالية، هذا ما حدث فعلا للأسف لأن ماحدث سبب خسائر بملايين الدولارات.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "May 12, 2022, 04:11:51 PM",
      "body": "Quote from: OmegaStarScream on May 12, 2022, 11:04:50 AMفي  رأيي العملة انتهت تماما فحتى و ان قامت الشركة ببيع كل البيتكوين الخاص بها (هذا فرضا أنها لم تقم بذلك بعد) لرفع سعر العملة المستقرة الخاصة بها من جديد  أو البحث عن مستثمرين لمساعدتهم للقيام  في هذا، فلن يثق أحد في المشروع من جديدهذا يفكرني بعملة betconnect في أواخر 2017 إنهرت بشكل مفاجىء أنذاك، طبعاً مشكلة لونا كان بسبب تراجع ust.لقد تم بعد قليل من إلغاء إدراج العملة في العقود الأجلة:https://twitter.com/binance/status/1524766492629237762?s=21&t=VpryoMx36QFB28KgbU3Lcgو لا أعلم إن كان سيتم تشطيبها من المنصة في المستقبل القريب.يمكنكم تفقد ردود التغريدة يا للهول هناك العديد من المستخدمين  تعرضوا للخسارة Quote from: yhiaali3 on May 12, 2022, 11:23:10 AMوالله صراحة انا انذهلت تماما عندما نظرت إلى الشارت، أعتقدت أن هناك خلل أو أنها عملة شبيهة لها نفس الاسم لكن للأسف تأكدت من الاخبار أن هذا ما حدث فعلا. لونا كانت من العملات القوية جدا ومن المشاريع الناجحة واستغرب كيف يمكن أن يحدث هذا، أعتقد أن السبب انهيار عملتها المستقر TerraUSD  بعد أن فقدت الربط مع الدولار الأمريكي. لا أتوقع أن تعود لونا إلى سعرها ابدا لأن السيولة المتبقية تم سحبها على ما يبدو، والناس تتهافت على شراء لونا بسعر رخيص على أمل أن تعود للارتفاع. للأسف ما حدث شكل ضربة لسمعة العملات المشفرة وتأكدت التحذيرات التي كانت دائما تتبناها الحكومات والجهات المعادية للعملات المشفرة بانها غير مستقرة وتحمل مخاطر عالية، هذا ما حدث فعلا للأسف لأن ماحدث سبب خسائر بملايين الدولارات. هذا طبعاً يذكرنا بأن أفضل خيار للتداول هو البتكوين كما تعلم أخي المجال محفوف بالمخاطر من الواجب علينا إختيار المكان و الزمان حتى لا نفقد ما جمعناه بشق الأنفس.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 12, 2022, 04:29:19 PM",
      "body": "Quote from: yhiaali3 on May 12, 2022, 11:23:10 AMوالله صراحة انا انذهلت تماما عندما نظرت إلى الشارت، أعتقدت أن هناك خلل أو أنها عملة شبيهة لها نفس الاسم لكن للأسف تأكدت من الاخبار أن هذا ما حدث فعلا. لونا كانت من العملات القوية جدا ومن المشاريع الناجحة واستغرب كيف يمكن أن يحدث هذا، أعتقد أن السبب انهيار عملتها المستقر TerraUSD  بعد أن فقدت الربط مع الدولار الأمريكي. لا أتوقع أن تعود لونا إلى سعرها ابدا لأن السيولة المتبقية تم سحبها على ما يبدو، والناس تتهافت على شراء لونا بسعر رخيص على أمل أن تعود للارتفاع. للأسف ما حدث شكل ضربة لسمعة العملات المشفرة وتأكدت التحذيرات التي كانت دائما تتبناها الحكومات والجهات المعادية للعملات المشفرة بانها غير مستقرة وتحمل مخاطر عالية، هذا ما حدث فعلا للأسف لأن ماحدث سبب خسائر بملايين الدولارات. بصراحة لقد صدمني الخبر مثلكم جميعا و الان فقط لاحظته من خلال هذا الموضوع. و بمراجعة مواقع التحليل و الأخبار يبدو أنه لا أحد قادر على تقديم تفسير لما يحدث.ما خطر بذهني هو التطبيقات التي تم تطويرها بالاعتماد على تكنولوجيا لونا ماذا سيكون مصيرها. https://www.terra.money/من جهة أخرى لا أظن أن ما حدث هو أمر جديد لأننا تعودنا بسقوط العملات خصوصا تلك المتحيلة او التي لا تكون قائمة على أساس صلب. على العكس فربما سيدفع المستخدمين الى دراسة المشاريع قبل التفكير في تبنيها او الاستثمار فيها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "May 12, 2022, 08:17:42 PM",
      "body": "Quote from: Kavelj22 on May 12, 2022, 04:29:19 PMبصراحة لقد صدمني الخبر مثلكم جميعا و الان فقط لاحظته من خلال هذا الموضوع. و بمراجعة مواقع التحليل و الأخبار يبدو أنه لا أحد قادر على تقديم تفسير لما يحدث.ما خطر بذهني هو التطبيقات التي تم تطويرها بالاعتماد على تكنولوجيا لونا ماذا سيكون مصيرها. https://www.terra.money/من جهة أخرى لا أظن أن ما حدث هو أمر جديد لأننا تعودنا بسقوط العملات خصوصا تلك المتحيلة او التي لا تكون قائمة على أساس صلب. على العكس فربما سيدفع المستخدمين الى دراسة المشاريع قبل التفكير في تبنيها او الاستثمار فيها.أرى أن الإنهيار الذى حدث لعملة لونا لديه العديد من الاسباب لكن السبب الأكبر فى رئيي هو إرتباط عملة لونا بعملة تيرا المستقرة حيث انه يستطيع أى شخص ان يقوم بحرق لونا من أجل الحصول على عملة تيرا المستقرة فهذا كان له تأثير سلبى على عملة لونا أيضاً كما ذكرت بعض الصحف ان مؤسس مشروع تيرا تم اتهامه بعدم الشفافية بسبب قيامة بيع 1.5 مليار دولار من البتكوين لإقراض صانعى السوق مما أثر على مستقبل العملتين.Quote from: Ulven on May 12, 2022, 10:37:02 AMهل تعتقدون أن العملة ستتعافى في المستقبل؟ أم أنها مجرد سيتكون؟ الأمر خرج عن السيطره وعن إطار التحليلات والتوقعات رجوع لونا أمر مستحيل إلا إذا حدثت معجزه, والذى حدث لعملة كبيرة مثل لونا فى ليلة وضحاها قد يحدث هذا الأمر لأى عملة أقل منها لذا الأهم فى نظري هو الفريق ثم المشروع.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 13, 2022, 05:10:07 PM",
      "body": "Quote from: albon on May 12, 2022, 08:17:42 PMQuote from: Ulven on May 12, 2022, 10:37:02 AMهل تعتقدون أن العملة ستتعافى في المستقبل؟ أم أنها مجرد سيتكون؟ الأمر خرج عن السيطره وعن إطار التحليلات والتوقعات رجوع لونا أمر مستحيل إلا إذا حدثت معجزه, والذى حدث لعملة كبيرة مثل لونا فى ليلة وضحاها قد يحدث هذا الأمر لأى عملة أقل منها لذا الأهم فى نظري هو الفريق ثم المشروع.هذا فعلا وارد الحدوث لأي عملة تتحكم بها قوى مركزية يكون لديها امكانية التلاعب بمصير العملة (و غلمشروع ككل) دون ان يكون من هناك قادر على محاسبته. ما حصل مع لونا يعتبر كارثة حقيقية للمستثمرين اكثر من تأثيره على المشروع المنهار (مفهوم و فريق عمل)، هذا و قد دعمت المواقف التي اتخذتها منصات التداول بشطب عملة لونا من قائمة الخيارات المتاحة لديها للتداول و هو ما حسم الموقف خصوصا لدى أولئك الذين لازالوا يتصورون أن الحياة قد تعود لهذه العملة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "May 15, 2022, 06:26:15 PM",
      "body": "Quote from: albon on May 12, 2022, 08:17:42 PM الأمر خرج عن السيطره وعن إطار التحليلات والتوقعات رجوع لونا أمر مستحيل إلا إذا حدثت معجزه, والذى حدث لعملة كبيرة مثل لونا فى ليلة وضحاها قد يحدث هذا الأمر لأى عملة أقل منها لذا الأهم فى نظري هو الفريق ثم المشروع.فعلاً هذه ضاربة قاسية لكل من إستثمر في العملة لونا،أصبح غير ممكنا عودة المياه إلى مجاريها. و لكن المسألة تبدو غير طبيعية بكل تأكيد أصحاب المشروع هم من قاموا بهذا التلاعب و أفكر هل سيتم فتح تحقيق قضائي بخصوصهم.كانوا قد وعدوا المستثمرين في اليومين الماضييين أنهم سيعوضون المتضررين إلا أنهم كما هو ظاهر أنهم قاموا بضخ عملة mln قبل قليل ما جعل الكثير يخسر من جديد بحيث وصل سعر العملة إلى حوالي 85$ و لكن في ضرف وجيز قاموا بعملية التفريغ هذا تلاعب كبير.الحمد لله تمكنت من الشراء في سقف 46$ و البيع عند 70$ جعلني هذا أحقق بعض المكاسب أعتقد أن العملة سيتم تشطيبها قريباً من أغلب المنصات و منها بينانص.Quote from: Kavelj22 on May 13, 2022, 05:10:07 PMهذا فعلا وارد الحدوث لأي عملة تتحكم بها قوى مركزية يكون لديها امكانية التلاعب بمصير العملة (و غلمشروع ككل) دون ان يكون من هناك قادر على محاسبته. ما حصل مع لونا يعتبر كارثة حقيقية للمستثمرين اكثر من تأثيره على المشروع المنهار (مفهوم و فريق عمل)، هذا و قد دعمت المواقف التي اتخذتها منصات التداول بشطب عملة لونا من قائمة الخيارات المتاحة لديها للتداول و هو ما حسم الموقف خصوصا لدى أولئك الذين لازالوا يتصورون أن الحياة قد تعود لهذه العملة.لهذا يبقى البتكوين أفضل خيار لتخزين على المدى البعيد، كما أشارتم جميعا لا أعتقد بأن هناك طريقة سحرية تساعد لونا على التعافي من جديد في الواقع أغلب العملات البديلة ستكون شيتكوان و عملية إحتيال حتى و لو كانت مصنفة في المراكز ١٠٠ الأولى لذا الإنتباه أصبح لازم يجب وضع في الإعتبار بأن أي عملة مدرجة في كوان ماركيت عبارة عن سكام.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 15, 2022, 08:35:09 PM",
      "body": "Quote from: Ulven on May 15, 2022, 06:26:15 PMQuote from: Kavelj22 on May 13, 2022, 05:10:07 PMهذا فعلا وارد الحدوث لأي عملة تتحكم بها قوى مركزية يكون لديها امكانية التلاعب بمصير العملة (و غلمشروع ككل) دون ان يكون من هناك قادر على محاسبته. ما حصل مع لونا يعتبر كارثة حقيقية للمستثمرين اكثر من تأثيره على المشروع المنهار (مفهوم و فريق عمل)، هذا و قد دعمت المواقف التي اتخذتها منصات التداول بشطب عملة لونا من قائمة الخيارات المتاحة لديها للتداول و هو ما حسم الموقف خصوصا لدى أولئك الذين لازالوا يتصورون أن الحياة قد تعود لهذه العملة.لهذا يبقى البتكوين أفضل خيار لتخزين على المدى البعيد، كما أشارتم جميعا لا أعتقد بأن هناك طريقة سحرية تساعد لونا على التعافي من جديد في الواقع أغلب العملات البديلة ستكون شيتكوان و عملية إحتيال حتى و لو كانت مصنفة في المراكز ١٠٠ الأولى لذا الإنتباه أصبح لازم يجب وضع في الإعتبار بأن أي عملة مدرجة في كوان ماركيت عبارة عن سكام.ليس الى هذه الدرجة يا صديقي فهناك العديد من العملات التي يمكن الوثوق بمشاريعها الى حد ما. المشكلة مع منصة كوينماركت انها لا تضع قوانين صارمة لادراج العملات الجديدة و تكتفي بطلب رسوم معينة بالاضافة الى حجم تداول معين قد لا تتم مراجعته الا في بداية عملية الادراج. يتفاقم الأمر سوءا حين نعلم أن بينانص قامت باقتناء تلك المنصة و بالتالي فان قرارات الادراج أصبحت تخضع لسلطة أقوى يتحكم بها المصلحة و النفعية حتى لو كان ذلك على حساب المستخدمين.مثال عملة لونا يندرج الى حد ما تحت هذا المثال.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "May 16, 2022, 12:29:15 PM",
      "body": "Quote from: Kavelj22 on May 15, 2022, 08:35:09 PMليس الى هذه الدرجة يا صديقي فهناك العديد من العملات التي يمكن الوثوق بمشاريعها الى حد ما. المشكلة مع منصة كوينماركت انها لا تضع قوانين صارمة لادراج العملات الجديدة و تكتفي بطلب رسوم معينة بالاضافة الى حجم تداول معين قد لا تتم مراجعته الا في بداية عملية الادراج. يتفاقم الأمر سوءا حين نعلم أن بينانص قامت باقتناء تلك المنصة و بالتالي فان قرارات الادراج أصبحت تخضع لسلطة أقوى يتحكم بها المصلحة و النفعية حتى لو كان ذلك على حساب المستخدمين.مثال عملة لونا يندرج الى حد ما تحت هذا المثال.نعم أتفق معك أخي بخصوص تواجد بعض المشاريع الموثوقة و لكنها ليست أمنة رغم قوتها و مصداقيتها لهذا يمكننا دائماً عدم اليقين بأن المشروع سيبقى و ينمو إلى الأبد، أما بخصوص منصة كوان ماركيت هي كما أشارت لم تضع معايير تجعلنا نثق بها يتوجب علينا دائما تفقد منصات أخرى ثم المقارنة للوصول إلى نتيجة إيجابية.تحديث:عن أوتشان أناليس قامت لونا بإرسال كل البتكوين الإحتياطي إلى منصتي بينانص و جوميني في الأيام الماضية القليلة:https://news.bitcoin.com/onchain-analysis-report-says-terras-bitcoin-reserves-were-sent-to-binance-and-gemini/هذا يؤكد بأن المشروع ميت بشكل كامل، لقد وجدت الكثير من المستخدمين على مواقع التواصل الإجتماعي يتحدثون بأن لونا يمكنها أن تشهد إرتداد قوي لهذا ينصح الإبتعاد عنها رغم عدم شطبها من أغلب المنصات و يمكن أن يتم ذلك مستقبلا. حتى تتمكن العملة من العودة إلى الدولار تحتاج إلى رأسمال ضخم بعشرات الأضعاف من إجمالي السوق حاليا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 16, 2022, 12:57:08 PM",
      "body": "Quote from: Ulven on May 16, 2022, 12:29:15 PMتحديث:عن أوتشان أناليس قامت لونا بإرسال كل البتكوين الإحتياطي إلى منصتي بينانص و جوميني في الأيام الماضية القليلة:https://news.bitcoin.com/onchain-analysis-report-says-terras-bitcoin-reserves-were-sent-to-binance-and-gemini/هذا يؤكد بأن المشروع ميت بشكل كامل، لقد وجدت الكثير من المستخدمين على مواقع التواصل الإجتماعي يتحدثون بأن لونا يمكنها أن تشهد إرتداد قوي لهذا ينصح الإبتعاد عنها رغم عدم شطبها من أغلب المنصات و يمكن أن يتم ذلك مستقبلا. حتى تتمكن العملة من العودة إلى الدولار تحتاج إلى رأسمال ضخم بعشرات الأضعاف من إجمالي السوق حاليا.شكرا على التحديث. فعلا صديقي هذه مؤشرات على أن المشروع انتهى فعلا و المتضررون عليهم تقبل واقع الأمر و لا أظن أن أي تعويضات قد تصلهم.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "May 16, 2022, 01:12:01 PM",
      "body": "Quote from: Ulven on May 16, 2022, 12:29:15 PM-snip-هذا يؤكد بأن المشروع ميت بشكل كامل، لقد وجدت الكثير من المستخدمين على مواقع التواصل الإجتماعي يتحدثون بأن لونا يمكنها أن تشهد إرتداد قوي لهذا ينصح الإبتعاد عنها رغم عدم شطبها من أغلب المنصات و يمكن أن يتم ذلك مستقبلا. حتى تتمكن العملة من العودة إلى الدولار تحتاج إلى رأسمال ضخم بعشرات الأضعاف من إجمالي السوق حاليا.يبدو أنه تم بيع 80،000 بيتكوين و لم يتبق سوى 313 بيتكوين من مخزون العملة: https://finbold.com/luna-foundation-discloses-it-sold-over-80000-in-bitcoin-reserves-for-ust/و الذي أرى أنه شئ جيد، لأنه و على الأقل الان، نعلم أن السوق لن يكون تحت الضغط.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakabba",
      "created_time": "May 18, 2022, 05:10:35 PM",
      "body": "لم اعرف بعد كيف إنهار سعر هذه العملة التي تحمل مشروعا جيدا ، ربما يكون للحيتان دخل بذلك لقد خسر العديد من الناس أموالهم خلال هذا الإنهيار",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "May 18, 2022, 06:28:32 PMLast edit: May 18, 2022, 08:12:04 PM by Ulven",
      "body": "Quote from: Kakabba on May 18, 2022, 05:10:35 PM لم اعرف بعد كيف إنهار سعر هذه العملة التي تحمل مشروعا جيدا ، ربما يكون للحيتان دخل بذلك لقد خسر العديد من الناس أموالهم خلال هذا الإنهيار عندما كان سعر لونا أكثر من 80$ كان إجمالي العرض لرموز لونا 350 مليون و لكن بروتوكول إشتغال لونا مع تيست أنتج أكثر من 6500 مليار رمز هذا أدى إلى حدوث الإنهيار و مخزونهم الإحتياطي من البتكوين غير كافي لرفع سعر العملة من جديد لهذا يبقى سوق العملات الرقمية معرض لإنقلابات حادة في الأسعار بين عشية و ضحى، من المفروض على المستثمرين تقييم المشروع من عدة جوانب قبل الإستثمار لذلك كل أولئك الذين يحاولون الإستثمار بدون جهد أكثر عرضة للخطر.تحديث:على ما يبدو فريق لونا يحاولون عمل شوكة الآن هم في مرحلة تصويت و إذا قبل المجتمع سيقومون بعملية حرق لإنتاج رموز لوناكلاسيك:https://twitter.com/terra_money/status/1527007922001174530?s=21ما رأيكم هل سينجحون في هذا العمل؟.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 20, 2022, 02:41:24 AM",
      "body": "Quote from: Ulven on May 18, 2022, 06:28:32 PMتحديث:على ما يبدو فريق لونا يحاولون عمل شوكة الآن هم في مرحلة تصويت و إذا قبل المجتمع سيقومون بعملية حرق لإنتاج رموز لوناكلاسيك:https://twitter.com/terra_money/status/1527007922001174530?s=21ما رأيكم هل سينجحون في هذا العمل؟.صحيح أخي ألفين ، هناك تصويت على عمل هارد فورك لعملة لونا حيث سيتم تقسيم عملة لونا إلى سلسلة جديدة بدون UST سيطلق عليها اسم Terra في حين أن السلسلة الأصلية القديمة سوف يطلق عليها اسم Terra Classic وبعد الانقسام سيتم توزيع  العملة الجديدة على في 27 الشهر الحالي النحو التالي: 35% لحاملي عملة لونا قبل الهجوم10% لحاملي لونا بعد الهجوم10% لحاملي UST قبل الهجوم 20% لحاملي UST بعد الهجوم والباقي للمطورين ومجتمع الستاك والحوكمةقبل الانقسام سيتم أخذ لقطة قبل الهجوم في 7 أيار وسيتم أخذ لقطة أخرى في 27 أيار ليتم على أساسها توزيع العملة الجديدة. يمكن التصويت ورؤية النتائج من هنا: https://station.terra.money/proposal/1623الموافقون حتى الآن حوالي 80% والممتنعون أقل من 5% والرافضون أقل من 1%تبدو خطة جيدة وواعدة ولكن لا أحد يعلم إن كانت ستنجح أم لا، خاصة أن المجتمع فقد ثقته في العملة، لكن من المؤكد أنها ستشهد في الفترة الأولى حركة كبيرة جدا قد يؤدي إلى رفع سعر العملة بشكل كبير.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 20, 2022, 10:18:52 PM",
      "body": "Quote from: Ulven on May 18, 2022, 06:28:32 PMQuote from: Kakabba on May 18, 2022, 05:10:35 PM لم اعرف بعد كيف إنهار سعر هذه العملة التي تحمل مشروعا جيدا ، ربما يكون للحيتان دخل بذلك لقد خسر العديد من الناس أموالهم خلال هذا الإنهيار عندما كان سعر لونا أكثر من 80$ كان إجمالي العرض لرموز لونا 350 مليون و لكن بروتوكول إشتغال لونا مع تيست أنتج أكثر من 6500 مليار رمز هذا أدى إلى حدوث الإنهيار و مخزونهم الإحتياطي من البتكوين غير كافي لرفع سعر العملة من جديد لهذا يبقى سوق العملات الرقمية معرض لإنقلابات حادة في الأسعار بين عشية و ضحى، من المفروض على المستثمرين تقييم المشروع من عدة جوانب قبل الإستثمار لذلك كل أولئك الذين يحاولون الإستثمار بدون جهد أكثر عرضة للخطر.تحديث:على ما يبدو فريق لونا يحاولون عمل شوكة الآن هم في مرحلة تصويت و إذا قبل المجتمع سيقومون بعملية حرق لإنتاج رموز لوناكلاسيك:https://twitter.com/terra_money/status/1527007922001174530?s=21ما رأيكم هل سينجحون في هذا العمل؟.حسب رأيي لم يعد لهذا معنى.المشروع فقد مصداقيته و لم يسعفه مخزونه الاستراتيجي لتجاوز أزمته و العملة الجديدة طبعا لن تنجح بدون ثقة المستخدمين و هو ما يبدو أمرا بعيد المنال على المدى المتوسط و القريب.الان اظن من الاجدر مناقشة كيف سيستعيد السوق عافيته بعد ان تراجع الاستثمار لبقية العملات بما فيها البيتكوين نفسه.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "May 25, 2022, 01:51:24 PM",
      "body": "Quote from: Kavelj22 on May 20, 2022, 10:18:52 PMحسب رأيي لم يعد لهذا معنى.المشروع فقد مصداقيته و لم يسعفه مخزونه الاستراتيجي لتجاوز أزمته و العملة الجديدة طبعا لن تنجح بدون ثقة المستخدمين و هو ما يبدو أمرا بعيد المنال على المدى المتوسط و القريب.الان اظن من الاجدر مناقشة كيف سيستعيد السوق عافيته بعد ان تراجع الاستثمار لبقية العملات بما فيها البيتكوين نفسه.فعلاً هذا أشبه بتلاعب كبير لا يمكن تصديقه، الغريب أن صفحة تويتر الخاصة بالمشروع كان لديه حوالي 600k متابع قبل الهجوم و خلال الأسبوع الماضي إزداد عدد المتابعين إلى أكثر من مليون كما أن التحديث الذي بدأ فريق المشروع إلى إصداره بعد إكتمال التصويت فقد حقق هذا الإنجاز أكثر من 150 مليون تصويت هذا يؤكد على أن الأغلبية المصوتون هم مستخدمين جدد يحاولون على أعتقد أن يخلقوا نوع من الضجيج كما حدث سابقاً مع شيبا.إذن يمكننا تتبع الأحداث غداً لنرى كان هناك إشراق من جديد أم أنه مجرد تبريد أعصاب لأولئك الذين لم يعودوا يرغبون في رؤية رصيدهم خوفا من يصيبوا الأذى بأنفسهم و الله المسألة خطيرة سمعت أن هناك العديد من إنتحر.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 25, 2022, 08:17:39 PM",
      "body": "Quote from: Ulven on May 25, 2022, 01:51:24 PMفعلاً هذا أشبه بتلاعب كبير لا يمكن تصديقه، الغريب أن صفحة تويتر الخاصة بالمشروع كان لديه حوالي 600k متابع قبل الهجوم و خلال الأسبوع الماضي إزداد عدد المتابعين إلى أكثر من مليون كما أن التحديث الذي بدأ فريق المشروع إلى إصداره بعد إكتمال التصويت فقد حقق هذا الإنجاز أكثر من 150 مليون تصويت هذا يؤكد على أن الأغلبية المصوتون هم مستخدمين جدد يحاولون على أعتقد أن يخلقوا نوع من الضجيج كما حدث سابقاً مع شيبا.إذن يمكننا تتبع الأحداث غداً لنرى كان هناك إشراق من جديد أم أنه مجرد تبريد أعصاب لأولئك الذين لم يعودوا يرغبون في رؤية رصيدهم خوفا من يصيبوا الأذى بأنفسهم و الله المسألة خطيرة سمعت أن هناك العديد من إنتحر.حسب ما سمعت فقد تم رصد ثمانية حالات انتحار لأشخاص تضرروا من انهيار لونا. البقية الذين لا يرغبون في الانتحار فانهم بالتأكيد لازالوا يعلقون أمالا يوزعها مطورون تحت مسمى \"نسخة جديدة من لونا\" و هو ما يعد ضربا من الخيال.المتضررون قد لا يكونون فقط أفرادا فهناك منصات تداول تملك مدخرات بملايين الدولارات من عملة لونا و لا أستغرب ان يدعموا العملة الجديدة و لو ظرفيا لتعويض اكبر ما يمكن من خسائرها حتى على حساب المستخدمين.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 25, 2022, 11:39:54 PM",
      "body": "الغريب في الأمر انه لا يزال هناك عدد كبير من الأشخاص يقومون بشراء هذه العملة و يراهنون على أنها ستتعافى و يرتفع سعرها من جديد!برأيي هذه العملة انتهت و لا يمكن باي شكل من الأشكال ان تسترجع قيمتها مهما حاول مطورها. حتى اني استغرب ما الذي أعطاها كل تلك القيمة من الأساس!على كل حال، التذبذب السريع في سعر العملة في هذه الفترة يمكن أن يكون فرصة لصغار المتداولين لتحقيق بعض الربح في وقت قصير لكن لا انصح اي شخص ليس لديه الخبرة الكافية بالقيام بذلك.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "May 26, 2022, 08:02:00 AM",
      "body": "Quote from: Kavelj22 on May 25, 2022, 08:17:39 PMالمتضررون قد لا يكونون فقط أفرادا فهناك منصات تداول تملك مدخرات بملايين الدولارات من عملة لونا و لا أستغرب ان يدعموا العملة الجديدة و لو ظرفيا لتعويض اكبر ما يمكن من خسائرها حتى على حساب المستخدمين.و الأمر كذلك بالفعل، يبدو أن أغلب المنصات الكبيرة سوف يقوم بدعم العملة الجديدة يوم غد (من دون العملة المستقرة و التي تعتبر سبب المشاكل التي حدثت). أنا شخصيا ما زلت لا أرى أي مستقبلا للعملة بغض النظر عن ما اذا تم دعم العملة من قبل المنصات أم لا لأنه و بكل بساطة، لم تعد هنالك ثقة في المشروع و حتى كان هنالك اقبال كبير، فأنا لا أرى كيف يمكن للمستثمرين في العملة القديمة استرجاع أموالهم، خاصة و أن السبب الوحيد لارتفاع تلك العملة هو العملة المستقرة التي لن تكون متوفرة في النسخة الجديدة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}