{
  "id": "topic_5490355",
  "title": "M. C",
  "author": "M. C",
  "created_time": "March 26, 2024, 09:41:26 AMLast edit: March 26, 2024, 10:09:24 AM by M. C",
  "content": "Could someone provide insights or direct me to literature discussing the practical applications and use cases of Bitcoin Timestamps?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5490355",
  "comments": [
    {
      "author": "SquirrelJulietGarden",
      "created_time": "March 26, 2024, 09:47:16 AM",
      "body": "Quote from: M. C on March 26, 2024, 09:41:26 AMIs anyone know where I can find some litteratures about the use case of Bitcoin Timestamp ?https://learnmeabitcoin.com/technical/block/time/https://en.bitcoin.it/wiki/Block_timestampA block timestamp is valid with some conditions as you can read in two documents. It will possibly be valid after an hour or two if you don't look into details.Don't feel surprised if you see inaccuracy of timestamp of a new found block and some previous blocks.QuoteThe timestamp has to be within a certain range for it to be valid:It must be greater than the median time of the last 11 blocks (i.e. the time in the block 6 blocks below).It must be less than the network adjusted time +2 hours.So there is some flexibility in what the timestamp can be. For any newly-mined block, the time field could be anywhere between -1 to +2 hours (roughly) from the actual current time, and it would still be valid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "March 26, 2024, 09:51:48 AM",
      "body": "Firstly, your English is not clearly enough, you can use ai tools like grammarly to put your sentences in a better form, it's highly appreciated based on the fact that not everyone is an English native so we understand the poor writing. Secondly, you can read the genesis book [1] to know more about bitcoin time stamp. The website learnmeabitcoin has all the basic information of bitcoin including timestamp, so you can also read from it.[2] [1] https://en.bitcoin.it/wiki/Block_timestamp / https://en.bitcoin.it/wiki/Genesis_block[2] https://learnmeabitcoin.com/technical/block/time/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 26, 2024, 09:54:29 AM",
      "body": "It's not literature, but OpenTimestamp[1] is real usage of Bitcoin timestamp. Peter Todd write a detailed blog post about it[2] and use it to timestamp archive.org data[3].[1] https://opentimestamps.org/[2] https://petertodd.org/2016/opentimestamps-announcement[3] https://petertodd.org/2017/carbon-dating-the-internet-archive-with-opentimestamps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 26, 2024, 10:01:06 AM",
      "body": "Quote from: M. C on March 26, 2024, 09:41:26 AMIs anyone know where I can find some litteratures about the use case of Bitcoin Timestamp ?Firstly you can begin by understanding the relevance for the use of timestamp which is the detailed records on all transactions that has been performed and were recorded on the bitcoin blockchain network, all the above guides provided could give you more insight on that and it all depends on the needs and purpose at which you want to make the application, reading through the recommendations links will tell more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "March 26, 2024, 10:15:17 AM",
      "body": "Quote from: Dunamisx on March 26, 2024, 10:01:06 AMQuote from: M. C on March 26, 2024, 09:41:26 AMIs anyone know where I can find some litteratures about the use case of Bitcoin Timestamp ?Firstly you can begin by understanding the relevance for the use of timestamp which is the detailed records on all transactions that has been performed and were recorded on the bitcoin blockchain network, all the above guides provided could give you more insight on that and it all depends on the needs and purpose at which you want to make the application, reading through the recommendations links will tell more. Timestamps are used for validity and transparency.Usually, timestamps become necessary when there is the need to prove a validation time of one transaction may be it due to financial transactions between two parties in which contracts or documents are involved. Another purpose indicated that it is to avoid double spending. For miners, this is also used so that they can determine the difficulty of mining a block and adjust the parameters accordingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}