{
  "id": "topic_5466109",
  "title": "Heyui67",
  "author": "Heyui67",
  "created_time": "September 08, 2023, 12:52:49 PMLast edit: September 08, 2023, 02:54:47 PM by Heyui67",
  "content": "Stake sent false tranactionhttps://pasteboard.co/G8d7TGXCftrT.jpgI can't find it on network.. Support telling me to waitI cant see this as normalhttps://imageupload.io/D8hYslhp6UnuFBu",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466109",
  "comments": [
    {
      "author": "bitbollo",
      "created_time": "September 08, 2023, 01:05:03 PM",
      "body": "can you post here directly tx id? in this case is not easy to check with just a screenshot By the way I don't think this is a scam accusation, of course isn't... but this is just a simple delay or some error (likewise has been broadcasted another times).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 08, 2023, 01:05:37 PM",
      "body": "When did you make the withdrawal?According to what is one their website: https://www.esportsbets.com/guides/stake-com-how-to-withdrawWithdraw should not take more than 30 minutes. Let us hope the recent hack of over $40 million does not affect Stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heyui67",
      "created_time": "September 08, 2023, 01:09:08 PM",
      "body": "0x3b9c24a3b489deba2dbe1cecbe5ef6301a4e276194ed9df6621c412f67758b06HashSince hour ago",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "September 08, 2023, 01:10:07 PM",
      "body": "Quote from: Heyui67 on September 08, 2023, 12:52:49 PMStake sent false tranactionhttps://pasteboard.co/G8d7TGXCftrT.jpgI can't find it on network.. Support telling me to waitI cant see this as normal This transaction should have atleast 1 confirmation since polygon network is very quick to confirm transaction. How long do you already wait when you create this post because they might using an internal transaction that is still not sent to the blockchain. Stake has no reason to fake any TXID for withdrawal because you will not acknowledged funds received without any TXID.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 08, 2023, 01:36:51 PM",
      "body": "Quote from: Heyui67 on September 08, 2023, 01:09:08 PM0x3b9c24a3b489deba2dbe1cecbe5ef6301a4e276194ed9df6621c412f67758b06HashSince hour ago On your stake.com account, screenshot the same txid on your report and activity. Or bring what you know that can make people to believe what that you are talking about. Nobody will believe only txid, but people can believe the same txid screenshot from your stake.com account.Send PM about the problem to this their official account on this forum: Stunna",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heyui67",
      "created_time": "September 08, 2023, 02:05:16 PM",
      "body": "Why you talk to me like that of course i dont make tranaction with my hands or something.. Its their wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "September 08, 2023, 02:40:47 PM",
      "body": "Quote from: Heyui67 on September 08, 2023, 02:05:16 PMWhy you talk to me like that of course i dont make tranaction with my hands or something.. Its their wallet You have requested the withdrawal from your Stake account, isn't it? Go to the transaction page of your Stake account and take a screenshot of your withdrawal page, then submit it here as a proof. Also post the screenshot of your conversation with their support agent. Your provided evidence isn't enough to support your claim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rohang",
      "created_time": "September 08, 2023, 03:14:21 PM",
      "body": "It has happened to me before with ETH withdrawal, stake provided a hash which was not found on ether scanHowever after 5-10 mins it was broadcasted,  Maybe  there is indeed some issue in your case, but support will probably only investigate after few hours have passed and its still  not broadcasted. Rest assured  im sure you will get the transaction eventually",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 08, 2023, 03:48:18 PM",
      "body": "Quote from: Heyui67 on September 08, 2023, 02:05:16 PMWhy you talk to me like that of course i dont make tranaction with my hands or something.. Its their wallet We just want to make sure everything is covered and on the right place and not just a simple misunderstanding, and the fact that this board runs on evidences, so a supporting evidence of your withdrawal page that shows the txid will be nice.For example, the txid you provided isQuote from: Heyui67 on September 08, 2023, 01:09:08 PM0x3b9c24a3b489deba2dbe1cecbe5ef6301a4e276194ed9df6621c412f67758b06HashSince hour ago But according to the image of your conversation with their live customer support, the txid should be 0x89e88bbc01f5bbe347739b797b960b1b5df4922c86ccb09bcb212322eaf22ac3, while the txid from your screenshot of polygonscan is 0xa14bb...None of the three matched, so it's perhaps will be better and much more clear if you show us the info provided by your withdrawal page",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heyui67",
      "created_time": "September 08, 2023, 04:18:49 PM",
      "body": "Quote from: holydarkness on September 08, 2023, 03:48:18 PMQuote from: Heyui67 on September 08, 2023, 02:05:16 PMWhy you talk to me like that of course i dont make tranaction with my hands or something.. Its their wallet We just want to make sure everything is covered and on the right place and not just a simple misunderstanding, and the fact that this board runs on evidences, so a supporting evidence of your withdrawal page that shows the txid will be nice.For example, the txid you provided isQuote from: Heyui67 on September 08, 2023, 01:09:08 PM0x3b9c24a3b489deba2dbe1cecbe5ef6301a4e276194ed9df6621c412f67758b06HashSince hour ago But according to the image of your conversation with their live customer support, the txid should be 0x89e88bbc01f5bbe347739b797b960b1b5df4922c86ccb09bcb212322eaf22ac3, while the txid from your screenshot of polygonscan is 0xa14bb...None of the three matched, so it's perhaps will be better and much more clear if you show us the info provided by your withdrawal pagehttps://talkimg.com/images/2023/09/08/mYuRq.jpeg https://talkimg.com/images/2023/09/08/mYdUP.jpegYou are very smart you neglected the main issue and see if hash is right... There is no hash no transaction... I click from website link i dont make it at home kitchen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 08, 2023, 04:57:10 PMLast edit: September 08, 2023, 05:20:41 PM by holydarkness",
      "body": "Quote from: Heyui67 on September 08, 2023, 04:18:49 PMYou are very smart you neglected the main issue and see if hash is right... There is no hash no transaction... I click from website link i dont make it at home kitchen Wait. What? So when you provide this TXID, you copy and paste it from... where, exactly? All things considered, it'll be the more reason you provide us with a screenshot of your withdrawal page, if you don't mind it, to avoid further confusion and mix up.Edit: Tidying up the quote",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rohang",
      "created_time": "September 08, 2023, 05:17:25 PM",
      "body": "Quote from: holydarkness on September 08, 2023, 04:57:10 PMAll things considered, it'll be the more reason you provide us with a screenshot of your withdrawal page, if you don't mind it, to avoid further confusion and mix up.Maybe u dont use stake, but the withdrawal page does not show transaction id, it provides a link to the chain explorer, which is where im assuming OP got his tx id from.I checked both those ids and still nothing on the chain, i would advise OP to email stake support and ask for some higher up to look into it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 08, 2023, 05:38:12 PM",
      "body": "Quote from: rohang on September 08, 2023, 05:17:25 PMQuote from: holydarkness on September 08, 2023, 04:57:10 PMAll things considered, it'll be the more reason you provide us with a screenshot of your withdrawal page, if you don't mind it, to avoid further confusion and mix up.Maybe u dont use stake, but the withdrawal page does not show transaction id, it provides a link to the chain explorer, which is where im assuming OP got his tx id from.[...]Ahh... I see, thank you for this added context.So, OP, the TXID \"generated\" from the link you clicked changed everytime you tried to access them? But just to be sure, the withdrawal history is there and [still] marked as \"pending\" or its equal meaning?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 08, 2023, 09:01:55 PM",
      "body": "Waiting is virtue, try to wait for several hours then follow up their customer support since those transaction id you provided and the one in screenshot is still cannot be seen on polygon explorer/network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heyui67",
      "created_time": "September 08, 2023, 09:54:48 PM",
      "body": "Iam and tired of this joke and support repliesDoesn't help at all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "September 08, 2023, 09:58:34 PM",
      "body": "Quote from: Oshosondy on September 08, 2023, 01:05:37 PMWhen did you make the withdrawal?According to what is one their website: https://www.esportsbets.com/guides/stake-com-how-to-withdrawWithdraw should not take more than 30 minutes. Let us hope the recent hack of over $40 million does not affect Stake.I think that even if the recent hack somehow did affect Stake, they would try not to divulge the information of how badly the damage extends. If there was a technical error, then it should be easily proven and as a centralized service provider, Stake will have no choice but to refund OP's money or correct the mistake otherwise.How long it will take the Stake support team to find out what happened and how to fix the situation, I cannot say. It could be hours, days, weeks or even months.I doubt there is a law on how fast they have to process these things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 09, 2023, 12:19:59 PM",
      "body": "Quote from: Heyui67 on September 08, 2023, 09:54:48 PMIam and tired of this joke and support repliesDoesn't help at allIt's because none is a member of the stake team so everybody is just giving you some thoughts and opinions on how and what probably has and could happened. IMHO, this is all about the polygon network. I've used it a few days ago and I thought that it's the fastest but it wasn't as per my experience. As said by one of the staff to you, they can't handle it anymore as it's already out of their scope and the withdrawal has been made already and provided you with the hash during the first time you've approached them.Well, there's the tip from the polygonscan if the transaction still doesn't show after an hour, go back where the transaction came from and ask them again. Maybe, this time it's on them and they can do something about it. Aside from that, there are also other tips from the scan.Quote from: polygonscan.com1) If you have just submitted a transaction please wait for at least 30 seconds before refreshing this page.2) It could still be in the TX Pool of a different node, waiting to be broadcasted.3) When the network is busy it can take a while for your transaction to propagate through the network and for us to index it.4) If it still does not show up after 1 hour, please check with your sender/exchange/wallet/transaction provider for additional information.Quote from: holydarkness on September 08, 2023, 03:48:18 PM0x89e88bbc01f5bbe347739b797b960b1b5df4922c86ccb09bcb212322eaf22ac3, For this one, it says that:Quote from: https://polygonscan.com/tx/0x89e88bbc01f5bbe347739b797b960b1b5df4922c86ccb09bcb212322eaf22ac3This transaction has been included into Block No #47328329 and will be reflected in a shortwhileWhile for this one;Quote from: Heyui67 on September 08, 2023, 01:09:08 PM0x3b9c24a3b489deba2dbe1cecbe5ef6301a4e276194ed9df6621c412f67758b06HashSince hour ago Nothing is being shown.Quote from: https://polygonscan.com/tx/0x3b9c24a3b489deba2dbe1cecbe5ef6301a4e276194ed9df6621c412f67758b06Sorry, We are unable to locate this TxnHash",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 09, 2023, 09:50:04 PM",
      "body": "I suppose the transaction ID the customer agent gave you is the right one! Quote from: holydarkness on September 08, 2023, 03:48:18 PM0x89e88bbc01f5bbe347739b797b960b1b5df4922c86ccb09bcb212322eaf22ac3, I just looked it up on polygonscan (thanks holydarkness, btw) and it says it has been confirmed like 12 hours ago. So, your problem is solved:https://polygonscan.com/tx/0x89e88bbc01f5bbe347739b797b960b1b5df4922c86ccb09bcb212322eaf22ac3I haven't played on Stake for a long time but I used to think withdrawals there are instant !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 10, 2023, 12:55:51 PM",
      "body": "Quote from: khaled0111 on September 09, 2023, 09:50:04 PMI haven't played on Stake for a long time but I used to think withdrawals there are instant ! I am going to venture a guess that after the recent hack, everything leaving their wallets is gone over a few extra times to be sure it's legit.Something happened to their system, and they are keeping the doors open so to speak. So in case something else was compromised they want to be sure all coins leaving are legit.I have seen one or two other complaints that things that were instant are now taking a little bit of time.And if they are putting more eyes on it, it means more people involved, so more chances for delay. Just my opinion. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}