{
  "id": "topic_5432934",
  "title": "SovereignSoil",
  "author": "SovereignSoil",
  "created_time": "January 04, 2023, 03:09:40 AM",
  "content": "Are there any Bitcoin marketplaces that have been developed with similar DNA and design to that of the fiat, online marketplace Etsy? If you are not familiar with Etsy, you can purchase niche and custom items that are generally sold by small businesses or individuals. It's a great avenue to purchase handmade or homemade products, while opting to not spend your money at a big box store. I imagine it doesn't take much to become a vendor/seller on the site, and the buying process is smooth as can be.Though, summing up all of the fees that Etsy charges, they are essentially taking up to 9.5% per transaction, plus $0.45 USD. That is quite a bit. I'm sure that a much more vendor-friendly version of this could be created with minimal transaction fees - at least in comparison.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432934",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "January 04, 2023, 03:28:41 AM",
      "body": "I personally don't have any experience to purchase custom stuffs with Bitcoin, but I think this both site can be used as your reference:1. https://spendbitcoins.com/search/s/custom/2. https://spending-bitcoin.com/?query=customYou could also post in this section Goods about an item you want to buy, maybe there's a forum member can create it for you. You must use escrow, but the fee isn't high, it's only around 1% Recommended bitcointalk escrow services",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SovereignSoil",
      "created_time": "January 04, 2023, 03:37:47 AM",
      "body": "Thank you for the links. I am more so interested in simply the existence of such a marketplace. I think that it could fair well in the Bitcoin-maximalist community...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SovereignSoil",
      "created_time": "January 04, 2023, 03:45:35 AM",
      "body": "I believe that it would be for the greater common good if we returned to peer-to-peer transactions for goods. No third parties. Handshakes, and supporting your neighbors. Circular economies. I imagine a site where you can simply pay a subscription as a vendor to be able to sell your goods directly to the consumer in a peer-to-peer transaction with no fees beyond the particular crypto network fee. As the marketplace's administration, you'd obviously have to not have the urge to monetarily gouge your clients.Would love feedback on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 04, 2023, 04:09:13 AM",
      "body": "Quote from: SovereignSoil on January 04, 2023, 03:09:40 AMAre there any Bitcoin marketplaces that have been developed with similar DNA and design to that of the fiat, online marketplace Etsy? If you are not familiar with Etsy, you can purchase niche and custom items that are generally sold by small businesses or individuals. It's a great avenue to purchase handmade or homemade products, while opting to not spend your money at a big box store. I imagine it doesn't take much to become a vendor/seller on the site, and the buying process is smooth as can be.Though, summing up all of the fees that Etsy charges, they are essentially taking up to 9.5% per transaction, plus $0.45 USD. That is quite a bit. I'm sure that a much more vendor-friendly version of this could be created with minimal transaction fees - at least in comparison.I don't know about any such marketplaces like Etsy where bitcoin is accepted! Etsy makes it easier for the sellers to sell their products and charge a convenience fee! They also handle the production so all good with Etsy! You can check this platform where you can buy gift cards. It's not a full fledged product platform though! https://www.bitrefill.com/Hope this helps!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 04, 2023, 04:24:51 AM",
      "body": "the issue with marketplaces for goods is not what you might be thinking at first.. its not the centrality. its not even the listing of goods.. its the whole scamming and scheming on both sidesEGsellers that dont deliver and just run away with the funds.. buyers that pretend goods not received and demand refundswhere they just set up new bitcoin addresses for payments and pretend to be a new business every day, or customers pretend to be different everyday and scam the same seller over and overthings like ebay have buyer protection which makes it harmful to sellers. other sites have seller protections which makes it harmful to buyers.but these fiat sites found they needed something to alleviate the fraud/scam riskbut in a system of anonymity and no desire of KYC it becomes a hotbed of people trying harder to scam and scheme a systemmarket places have a headache with this stuff which is why they charge fee's for offering a listing site. because they become the mediator of disputes about sold goods not being sent or customers saying they didnt arrive where both sides are trying to run off with goods or funds for freeebay/etsy work better because they are clear accounts with names and addresses and ratings systems where seller get to rate buyers and buyers get to rate sellers where its slightly more difficult to just create reputation if your just going to use a no ID systemit would be great to have a market place where people can advertise goods and novelty gifts to sell. but it requires a highly invested middleman to mediate/escrow deals, so that fair trade can happen with punishments for abusing said deals",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SovereignSoil",
      "created_time": "January 04, 2023, 04:45:49 AM",
      "body": "Avikz, thanks very much for the link. I have never seen that site. Great, great idea. A gift card allows you to have fiat purchasing power with certain anonymity as well!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SovereignSoil",
      "created_time": "January 04, 2023, 04:55:51 AM",
      "body": "Quote from: franky1 on January 04, 2023, 04:24:51 AMthe issue with marketplaces for goods is not what you might be thinking at first.. its not the centrality. its not even the listing of goods.. its the whole scamming and scheming on both sidesEGsellers that dont deliver and just run away with the funds.. buyers that pretend goods not received and demand refundswhere they just set up new bitcoin addresses for payments and pretend to be a new business every day, or customers pretend to be different everyday and scam the same seller over and overthings like ebay have buyer protection which makes it harmful to sellers. other sites have seller protections which makes it harmful to buyers.but these fiat sites found they needed something to alleviate the fraud/scam riskbut in a system of anonymity and no desire of KYC it becomes a hotbed of people trying harder to scam and scheme a systemmarket places have a headache with this stuff which is why they charge fee's for offering a listing site. because they become the mediator of disputes about sold goods not being sent or customers saying they didnt arrive where both sides are trying to run off with goods or funds for freeebay/etsy work better because they are clear accounts with names and addresses and ratings systems where seller get to rate buyers and buyers get to rate sellers where its slightly more difficult to just create reputation if your just going to use a no ID systemit would be great to have a market place where people can advertise goods and novelty gifts to sell. but it requires a highly invested middleman to mediate/escrow deals, so that fair trade can happen with punishments for abusing said dealsAll great points franky - thanks for your thoughts.I am tempted to advocate for a process that I believe the notorious Silk Road used. Silk Road had an escrow Bitcoin wallet that would pay vendors once the buyer said they received the good. Obviously this would allow the buyers to scam the sellers. You'd have to come up with a way to stop that fraud.I think a customer/vendor rating system would work just fine. The vendors would not be able to have anonymity, but the buyers could. I am not entirely sure how to stop the buyer from committing fraud, but the vendor would be making more profit per transaction on the Bitcoin network without credit card company fees. Would this outweigh MASS fraud - No.I'm trying to imagine an online market model where the marketplace isn't making money by gauging the vendors with huge transaction/processing fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 04, 2023, 05:03:35 AM",
      "body": "Quote from: SovereignSoil on January 04, 2023, 04:55:51 AMAll great points franky - thanks for your thoughts.I am tempted to advocate for a process that I believe the notorious Silk Road used. Silk Road had an escrow Bitcoin wallet that would pay vendors once the buyer said they received the good. Obviously this would allow the buyers to scam the sellers. You'd have to come up with a way to stop that fraud.I think a customer/vendor rating system would work just fine. The vendors would not be able to have anonymity, but the buyers could. I am not entirely sure how to stop the buyer from committing fraud, but the vendor would be making more profit per transaction on the Bitcoin network without credit card company fees. Would this outweigh MASS fraud - No.I'm trying to imagine an online market model where the marketplace isn't making money by gauging the vendors with huge transaction/processing fees. yes although i didnt like the produce silkroad was advertising... however, the method of keeping dubious criminals from scamming was novel by using the deposit system (deposited collateral used as reputation) was a feature.. aswell as the escrow. it wasnt perfect but it also was better than nothing. however more is needed to offer a good reputable product listing site that doesnt cost a high middleman escrow fee to counter any losses made by scammingbecause if the fiat scam rate is 1% even with all their middleman features and protections. then the scam rate in crypto would be 10x+",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SovereignSoil",
      "created_time": "January 04, 2023, 05:22:35 AM",
      "body": "Frank, was the collateral-reputation system on Silk Road for the vendors, buyers, or both?Also, what if the buyer had to put up collateral until the package safely arrived? Perhaps a certain percentage of the cost of the product would be tacked on to the purchase that the marketplace would hold in case of a package dispute. If a product dispute employee (someone who helps solves vendor/buyer disputes) determines that the buyer is trying to fraud the vendor. The collateral that the buyer put up is transferred to the vendor.If the package is received, collateral returns to the buyer. If the package was lost or somehow didn't arrive in satisfactory condition, that is a different matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 04, 2023, 05:35:29 AM",
      "body": "collateral was kept in account to sway users from just making 1000 accounts a day and scamming 1000 a dayit helped to keep both buyer and seller to keeping one account occupied and used else they would lose that value. or cost them multiples of value just to generate multiple accounts..it was on both buyers and sellers (dont hold me to that response, but it makes sense if both sides had something to lose)and if there was unresolvable dispute then the collateral was used to resolve dispute. thus it forced parties to agree on something to avoid losing collateral",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SovereignSoil",
      "created_time": "January 04, 2023, 05:43:24 AM",
      "body": "Very interesting.I wonder why anyone hasn't tried a Silk Road 2.0 (under a different name) without the drugs, murder, and lawlessness.Of course, there is the idea that the government was coming after the Bitcoin and the threat of Bitcoin to fiat, but I think they would have a much more difficult time taking down a legitimate business just because of Bitcoin use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 04, 2023, 06:46:37 AM",
      "body": "the reason was back in 2011. although silkroad was drugs related. it was mainly libertarians who didnt give a crap and thought drugs should be legal and authorities cant do crap about it so they didnt mind sharing delivery addressesbecause receiving drugs was not a big deal crime for personal use amounts in many area's, where only the seller needed to stay hidden and not reveal locationhowever these days we have the extremist tin foil anti-gov conservative types that are \"privacy\" \"dont use centralised services\" kings who even with legit products dont want to reveal home delivery locations out of fear that one day if laws change they could be locked up for just using bitcoin or not declaring taxes on their bitcoin income \"coz services log everything and government watch everything\"(facepalm)to me i laugh and feel the second(more recent group) sound more drug induced paranoid than the first groupbut basically these days no one really used services that tried(openbazaar, crypto emporium), so they fizzled out quickly.. (by this i mean they didnt get high user viral sensation/utility)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "January 04, 2023, 06:59:17 AM",
      "body": "You can do a Google search instead of asking here.The funny thing is that when you type \"Bitcoin marketplace for goods and services\" 90% of the search results are crypto exchange platforms.I've found websites like Bitmpremier.com and cryptothrift.com. The first one is claiming to be a Bitcoin marketplace for luxury items and the second one claims to be \"the eBay of Bitcoin\". I don't think that those websites have big amounts of traffic and a large userbase. I wouldn't use them, because they don't seem trustworthy, I don't want to spend my BTC on stuff I don't need.Many of the older Bitcoiners remember Openbazaar, which failed to become a functional BTC marketplace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 04, 2023, 12:39:14 PM",
      "body": "Quote from: SovereignSoil on January 04, 2023, 03:09:40 AMThough, summing up all of the fees that Etsy charges, they are essentially taking up to 9.5% per transaction, plus $0.45 USD. That is quite a bit. I'm sure that a much more vendor-friendly version of this could be created with minimal transaction fees - at least in comparison.Etsy is probably one of the worst marketplaces I ever saw.They are ripping of sellers, they don't allow them to sell their stuff anywhere outside Etsy and they have very strict policy for account suspension.I recently talked with one guy who is selling stuff there and he told me several people could complete purchases and they got their accounts suspended for no reason.I don't want to have anything similar that works with Bitcoin, it's much better for sellers to create their own website and add direct Bitcoin payment option.One forum member recenetly released clone of AliExpress called AliBitress that accepts Bitcoin payments, so in theory it's possible to do something like that with Etsy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 04, 2023, 12:48:51 PM",
      "body": "Quote from: dkbit98 on January 04, 2023, 12:39:14 PMOne forum member recenetly released clone of AliExpress called AliBitress that accepts Bitcoin payments, so in theory it's possible to do something like that with Etsy.This has to be some kind of joke?I get that people can set whatever price they want on their items, but the sales platform should be moderating the products going up to sale to make sure it is not money laundering in disguise of outrageous prices such as these - and there definitely shouldn't be a 7-figure US sales price on this order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 04, 2023, 12:54:43 PM",
      "body": "Quote from: NotATether on January 04, 2023, 12:48:51 PMI get that people can set whatever price they want on their items, but the sales platform should be moderating the products going up to sale to make sure it is not money laundering in disguise of outrageous prices such as these - and there definitely shouldn't be a 7-figure US sales price on this order.I never said this cloned website is legit, but last time I checked it was showing the exact same prices like in AliExpress website.They are just using NowPayments to convert fiat currencies to Bitcoin, but I would not risk exposing my information and delivery address. Even with original Aliexpress and sellers from China you can get tricked and receive some junk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "January 04, 2023, 01:15:26 PM",
      "body": "Quote from: franky1 on January 04, 2023, 04:24:51 AMebay/etsy work better because they are clear accounts with names and addresses and ratings systems where seller get to rate buyers and buyers get to rate sellers where its slightly more difficult to just create reputation if your just going to use a no ID systemRating systems can also be integrated into Peer to Peer markets.  This can solve the larger part of this issue.  But it can generate more trouble too.  The rating system can be abused.  But then you have websites like Trustpilot with a lot of false reviews as well.  To summarize it, I think there will never be fair use of a service.  There will always be troublemakers ruining it.-----Quote from: NotATether on January 04, 2023, 12:48:51 PMI get that people can set whatever price they want on their items, but the sales platform should be moderating the products going up to sale to make sure it is not money laundering in disguise of outrageous prices such as these - and there definitely shouldn't be a 7-figure US sales price on this order.But is this a solution?  It only makes money laundering a bit more difficult and time consuming.  But they can always put Alienware computers up for sale at exaggerated prices instead and still launder the money.  Or expensive cameras.  Or whatever else is expensive enough to make the price look legitimate for that matter.  Ali Express has some overpriced items too.  Overpriced by a few dozen to hundred thousand percent.As I just mentioned above.  They will always find a way no matter how rigid the rules are.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 04, 2023, 08:23:47 PM",
      "body": "the alibitress example seems easy to explainthe lower price ($83) is 0.005where the bigger price($8.3m) is 500btcin todays currencyi believe its a typo of someone putting the wrong amount and simply posting a new advert without removing the erroryou know, it seems they are used to using μbtc measure of 0.00001and simply got the conversion rates wrongi dont think its a nefarious laundering offer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alibitress",
      "created_time": "January 21, 2023, 12:38:09 AM",
      "body": "I developed Alibitress.Being a solo developer and limited on budget, It's little hard to solve all the problems, but I'm improving the website each day.It's about 15+ million products, and errors are possible.Quote from: NotATether on January 04, 2023, 12:48:51 PMQuote from: dkbit98 on January 04, 2023, 12:39:14 PMOne forum member recenetly released clone of AliExpress called AliBitress that accepts Bitcoin payments, so in theory it's possible to do something like that with Etsy.This has to be some kind of joke?https://i.imgur.com/8hHnETA.pngI get that people can set whatever price they want on their items, but the sales platform should be moderating the products going up to sale to make sure it is not money laundering in disguise of outrageous prices such as these - and there definitely shouldn't be a 7-figure US sales price on this order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}