{
  "id": "topic_5436209",
  "title": "adaseb",
  "author": "adaseb",
  "created_time": "January 21, 2023, 05:19:02 AM",
  "content": "So I heard about the chapter 11. They owe something like $700M to Gemini customers.  Now where is where I am confused.They paid something like 5% for Bitcoin and those bitcoins are pretty much gone. They were converted to GBTC which is locked forever.So how will they make the clients whole again? They will have to buy BTC on the open market to fulfill those obligations?Also it’s $700M at the current market value, if Bitcoin pumps to like $40K it’ll be like 1.5B to fulfill their obligations.So I am thinking price of BTC might surge if they are forced to buy those bitcoins back.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436209",
  "comments": [
    {
      "author": "bbc.reporter",
      "created_time": "January 23, 2023, 02:22:33 AM",
      "body": "@adaseb. Someone who owns an insolvent platform or company might also be manipulating a pump to plug a hole very much similar to what Sam Bankrupt-Fried was speculated to be doing for FTX on August, 2021 and June, 2022. We do not know who this person is, however, the biggest names who might be presently in trouble might be Barry, CZ and Justin Sun.Bankman-Fried Wanted Crypto Prices to Go Up to Plug FTX HolePressed on the matter again in September 2022, Bankman-Fried said that crypto prices going up would help correct the situation.Source https://cryptobriefing.com/bankman-fried-wanted-crypto-prices-to-go-up-to-plug-ftx-hole/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 23, 2023, 04:56:34 AM",
      "body": "So they want crypto to go up so they can sell their altcoins like ETC? I don’t think it’ll work because many of those alts aren’t very liquid. If they start to sell 8 figures worth it’ll cause the alt to crash pretty much.It they pump Bitcoin then they will benefit with the higher 2% fees for GBTC but if they need to buy back those BTC they will need to pay a higher price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "January 23, 2023, 05:04:23 PM",
      "body": "I like the theory and wouldn't rule it out, if there is genuine demand then it should affect supply. But open market unlikely, it'd more likely be over OTC imo, like other high volume transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 23, 2023, 05:10:53 PM",
      "body": "DCG is from just after 3rd feb planning(suggesting a plan) to spend $1.2b to buy back 20% of GBTC shares ant share price(not btc conversion rate). which then allows grayscale to unlock 20% of btc($2.4b of btc) from the trust which grayscale (dcg) can then use however they likeeither to keep half of the freed btc(so $1.2bill of btc) in the trust to then re-jig the remaining share conversion value to be less \"discount\". and still have enough spare btc to then offset the loanswe shall see what plays out after feb 3rds SEC court of appeals response to the grayscale ETF appealBTC \"surge\" from decembers $17k flatline to this weeks $23k flatline.. not really a surge.. but anywaysis not related to any of corporate social dramas.. of their end of year tax shuffling antics to show losses its whale traders on futures markets gamble betting prices remained below 17k december and 23k this week. so they are using separate small investment of wash arbirtraging trading spot market using a bot.. to cause a resistance wall to keep prices down. once their december bet won. the released that whale spot bot resistance allowing some free trade movement up. and then put in another whale spot bot to trade the market down below $23k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "January 23, 2023, 08:22:03 PM",
      "body": "It doesn't look like they were pumping it but rather that the market was leveraged and filled with short sellers. When that happens big money will always try to squeeze them. It's an opportunity to make easy money if you have enough money to make it happen.So the srorts got squeezed and the street that sold in November when FTX went bankrupt got the signal that this is the bottom so they bought. From 17 to 19 thousand it was the squeeze and then the rest is natural accumulation. When enough people go long from here the big money will try the squeeze again to get us back to 20 but the signs of the reversal are undeniable, even if we go back to 20.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "January 24, 2023, 02:25:50 AM",
      "body": "Quote from: adaseb on January 23, 2023, 04:56:34 AMSo they want crypto to go up so they can sell their altcoins like ETC? I don’t think it’ll work because many of those alts aren’t very liquid. If they start to sell 8 figures worth it’ll cause the alt to crash pretty much.It they pump Bitcoin then they will benefit with the higher 2% fees for GBTC but if they need to buy back those BTC they will need to pay a higher price. I am only speculating. However, it will certainly help to plug the hole. According to the article, Sam was orchestrating a pump while also borrowing from lenders. Also, the manipulation might be on the illiquid altcoins market, however, the manipulators trade much of their money in futures trading where there might be more liquidity and they can also use leverage. The manipulators can also begin shorting the market once they are finished with the pump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "January 24, 2023, 04:55:54 AM",
      "body": "If they were to buy 700M$ of Bitcoin to pay off their debt then there would definitely be a huge increase in demand leading to a huge rise in the price, altcoins do not have enough liquidity and selling such large quantities could cause the currencies to collapse, so I would expect that buying Bitcoin is their best option.But as I know, Chapter 11 allows an agreement to be reached between the insolvent company and the creditors with the approval of the judge, so the question is, should Genesis buy bitcoin, or is it possible for debtors to take the value of their debts on Genesis through altcoin or dollars?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "January 24, 2023, 08:10:02 PM",
      "body": "Quote from: adaseb on January 21, 2023, 05:19:02 AMSo I heard about the chapter 11. They owe something like $700M to Gemini customers.  Now where is where I am confused.They paid something like 5% for Bitcoin and those bitcoins are pretty much gone. They were converted to GBTC which is locked forever.So how will they make the clients whole again? They will have to buy BTC on the open market to fulfill those obligations?Also it’s $700M at the current market value, if Bitcoin pumps to like $40K it’ll be like 1.5B to fulfill their obligations.So I am thinking price of BTC might surge if they are forced to buy those bitcoins back.I don’t think they’ll buy the BTC back for their customers. They’re going to file bankruptcy protection and it’s pretty clear that it was setup and orchestrated that way intentionally to steal your BTC. I removed mine from exchanges at the first sign of trouble and since they couldn’t steal my BTC, they closed my account instead. We aren’t dealing with mature professionals in this space yet. The leaders of this industry are still mostly spoiled rich kids playing games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "January 24, 2023, 08:35:09 PM",
      "body": "Quote from: adaseb on January 21, 2023, 05:19:02 AMSo I am thinking price of BTC might surge if they are forced to buy those bitcoins back.Thats what if they would decide to make some buyback but it would be unlikely to happen but who knows if ever they would really be ending up on that kind of approach or action to take butits better for their users or clients on expecting or having the positivity.It is  really just that sad that there are lots who had been affected with this bankruptcy which we dont really knowif they are really that being bankrupt or just simply running away investors or users funds which it is really hard to tell and consider it is really that hard to trust upnowadays.So its hard to make out some conclusions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "January 30, 2023, 06:29:54 PM",
      "body": "Quote from: adaseb on January 21, 2023, 05:19:02 AM...So how will they make the clients whole again? They will have to buy BTC on the open market to fulfill those obligations?...Very unlikely. In case of bankruptcy, any debts due to creditors would be denominated in the legal tender (fiat money) not in crypto or other assets. And they will be settled (if not wholly, then partially) in fiat.That's kind of what happened with Mt Gox, when all the funds owed to customers got converted into fiat, and after the  2017 Bitcoin rally, the fraudulent exchange ended up with a surplus of money, which could be distributed to its shareholders, convicted Karpeles being one of them.https://www.theverge.com/2018/3/22/17151430/bankruptcy-mt-gox-liabilities-bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 30, 2023, 11:50:19 PM",
      "body": "So what price will it be converted into fiat? Because you know how it is. During a bull market everyone wants everything priced in crypto prices. During a bear market people want everything priced in fiat balances.If a user had $10000 in Bitcoin. What price would it be priced in at? The date of the bankruptcy? Because back in November Bitcoin was like $15000. And most likely they won’t settle it at $24000 which is right now. Seems like many will be screwed on this deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}