{
  "id": "topic_5459991",
  "title": "Bitcoiner2023",
  "author": "Bitcoiner2023",
  "created_time": "July 16, 2023, 10:46:12 AM",
  "content": "I don't understand why Bitcoin is more decentralized than Ethereum even though you operate a full node with both. To create the blocks: Bitcoin PoW = miners Ethereum PoS = Validator With Bitcoin/Ethereum Full Node you can verify the blocks from the miners/validators. So the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? Or is it the case with Ethereum that you cannot verify the blocks as a full node but only as a validator? So: Bitcoin miners create block / full nodes verify the block Ethereum validator create block / validator also verify the block",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459991",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "July 16, 2023, 10:53:09 AM",
      "body": "It is because the proof of work concept is highly diversified, impossible to launch 51% attack so Bitcoin seems highly decentralized where as Ethereum is now running based on Proof of stake which involves the block validation process only by the validators.Full node has nothing to do with the decentralization because it only verifies the data of blockchain so if one is trying to tamper the data it will eliminate from the network so higher the number of nodes will ensures the tamper proof netwotk. Quote from: Bitcoiner2023 on July 16, 2023, 10:46:12 AMSo the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? Again the answer depends on the validation process since bitcoin runs based on Proof of Work concept in that miners compete to solve complex mathematical puzzles using computational power. This competition requires substantial computational resources, such as specialized hardware and electricity. As a result, PoW networks tend to attract a larger number of participants who contribute their resources to secure the network. This distributed participation helps in achieving a higher degree of decentralization.Proof of Work vs. Proof of Stake: understanding the key differences",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 16, 2023, 10:54:55 AM",
      "body": "If talking about decentralization, do not compare bitcoin with ether. Ether even gone more centralized. Some ether were premined. PoS makes it more centralized. Ethereum developers want to reduce validators, making it more centralized (they want to make people that can be a validator to have at least 2048 ETH. It is still 32 ETH but they are working to increase it). Ether is influenced more by developers like Vitalik Buterin, no one knows Satoshi Nakamoto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 16, 2023, 11:41:46 AM",
      "body": "Quote from: Bitcoiner2023 on July 16, 2023, 10:46:12 AMSo the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? What makes you conclude that? Do you have any data on the cost of running a full node for each network? One of the critical issues is understanding what parts you include in the word \"decentralized\". If you draw a conclusion just from whether you can run a full node or not, then the issue would be ambiguous since almost any coin allows you to do that. How would you differentiate between Bitcoin and other blockchains owned by some governments if the latter also allows you to run your own node then? Are you going to call them decentralized too? I believe you can see what other factors you should consider from the answers shared above. The consensus mechanism, how it launched, who controls the repository, who can participate, and so on are one of those things. If you don't agree that those factors are important, then I guess no one can convince you that Bitcoin is more decentralized than others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "July 16, 2023, 12:10:07 PM",
      "body": "_act_ summed it up well. It's absurd to compare Bitcoin and Ethereum about decentralization. They sold premined ETH with ICO. Bitcoin never do that.Vitalik Buterin is a known figure and have the biggest influence over the market, even for other coins. Bitcoin don't have this type of figure.They even roll back and forked the coin. Ethereum isn't even in their original chain, Ethereum Classic is.Switching from PoW to PoS is a hit about decentralization. Ethereum has its benefits, but it's impossible to talk about decentralized ETH anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoiner2023",
      "created_time": "July 16, 2023, 12:29:55 PM",
      "body": "Quote from: Findingnemo on July 16, 2023, 10:53:09 AMIt is because the proof of work concept is highly diversified, impossible to launch 51% attack so Bitcoin seems highly decentralized where as Ethereum is now running based on Proof of stake which involves the block validation process only by the validators.Full node has nothing to do with the decentralization because it only verifies the data of blockchain so if one is trying to tamper the data it will eliminate from the network so higher the number of nodes will ensures the tamper proof netwotk. Quote from: Bitcoiner2023 on July 16, 2023, 10:46:12 AMSo the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? Again the answer depends on the validation process since bitcoin runs based on Proof of Work concept in that miners compete to solve complex mathematical puzzles using computational power. This competition requires substantial computational resources, such as specialized hardware and electricity. As a result, PoW networks tend to attract a larger number of participants who contribute their resources to secure the network. This distributed participation helps in achieving a higher degree of decentralization.Proof of Work vs. Proof of Stake: understanding the key differencesBut whether all miners get together and carry out a 51% attack or all validators get together for a 51% attack is basically the same, it is possible with bothQuote from: _act_ on July 16, 2023, 10:54:55 AMIf talking about decentralization, do not compare bitcoin with ether. Ether even gone more centralized. Some ether were premined. PoS makes it more centralized. Ethereum developers want to reduce validators, making it more centralized (they want to make people that can be a validator to have at least 2048 ETH. It is still 32 ETH but they are working to increase it). Ether is influenced more by developers like Vitalik Buterin, no one knows Satoshi Nakamoto.Does that mean that Ethereum would be just as decentralized as Bitcoin for a validator?However, Vitalik does not have the only power over Ethereum, here are too voting takes place as with Bitcoin.In addition, with Bitcoin there are only a few programmers who add the suggestions in the source code.Quote from: joniboini on July 16, 2023, 11:41:46 AMQuote from: Bitcoiner2023 on July 16, 2023, 10:46:12 AMSo the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? What makes you conclude that? Do you have any data on the cost of running a full node for each network? One of the critical issues is understanding what parts you include in the word \"decentralized\". If you draw a conclusion just from whether you can run a full node or not, then the issue would be ambiguous since almost any coin allows you to do that. How would you differentiate between Bitcoin and other blockchains owned by some governments if the latter also allows you to run your own node then? Are you going to call them decentralized too? I believe you can see what other factors you should consider from the answers shared above. The consensus mechanism, how it launched, who controls the repository, who can participate, and so on are one of those things. If you don't agree that those factors are important, then I guess no one can convince you that Bitcoin is more decentralized than others.Well, just that the Bitcoin Blockchain is 500GB in size and the Ethereum Blockchain 14TB makes it more expensiveFor me, decentralized means:That I have control over my bitcoins, that a government cannot take them away from me or someone blacklists my bitcoins so that I can no longer use them.To me it also means that bitcoin is not under the control of a single party who can decide what to do with it and what not.It has to be democratic.Quote from: EFS on July 16, 2023, 12:10:07 PM_act_ summed it up well. It's absurd to compare Bitcoin and Ethereum about decentralization. They sold premined ETH with ICO. Bitcoin never do that.Vitalik Buterin is a known figure and have the biggest influence over the market, even for other coins. Bitcoin don't have this type of figure.They even roll back and forked the coin. Ethereum isn't even in their original chain, Ethereum Classic is.Switching from PoW to PoS is a hit about decentralization. Ethereum has its benefits, but it's impossible to talk about decentralized ETH anymore. For me Bitcoin is decentralized, but I wonder if it is also Ethereum.If the only reason is that it's PoW vs. PoS then to me Ethereum is also decentralized.If it's because Satoshi went into hiding and Vitalik didn't, then for me Ethereum is also decentralized on that point.Maybe it's just a matter of faith like religion, some believe in Bitcoin, others in Ethereum and some in both or neither",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "July 16, 2023, 12:33:10 PM",
      "body": "Quote from: Bitcoiner2023 on July 16, 2023, 10:46:12 AMI don't understand why Bitcoin is more decentralized than Ethereum even though you operate a full node with both. To create the blocks: Bitcoin PoW = miners Ethereum PoS = Validator With Bitcoin/Ethereum Full Node you can verify the blocks from the miners/validators. So the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? Or is it the case with Ethereum that you cannot verify the blocks as a full node but only as a validator? So: As my understanding goes Bitcoin is more decentralized, the reason being:Bitcoin has a more extended historyLarge number of nodes & minersBitcoin ecosystem being resilient against centralizationWhile Ethereum Governance is questionable?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "July 16, 2023, 01:08:53 PM",
      "body": "Quote from: Bitcoiner2023 on July 16, 2023, 12:29:55 PMFor me, decentralized means:That I have control over my bitcoins, that a government cannot take them away from me or someone blacklists my bitcoins so that I can no longer use them.To me it also means that bitcoin is not under the control of a single party who can decide what to do with it and what not.It has to be democratic.I think the word decentralization in this context means more, decentralization is also a form in which there no central authority that decides the fate of the coin. And in the case of Ethereum the validators which are the highest stakers of the coin have this central power because once two or more of them actually pull out then it could mean the end of that coin or even affects its value. Quote from: Bitcoiner2023 on July 16, 2023, 12:29:55 PMFor me Bitcoin is decentralized, but I wonder if it is also Ethereum.If the only reason is that it's PoW vs. PoS then to me Ethereum is also decentralized.If it's because Satoshi went into hiding and Vitalik didn't, then for me Ethereum is also decentralized on that point.Why do still say that Ethereum is decentralized even after it been run on POS method. The layer of a blockchain actually satisfies if it is centralized and with POS giving space to just the highest stakers then it is centralized already, not like POW were any one with enough computational power can come in. After the merger 50% of Ethereum was even reported to be owned by just few wallets, aren’t these owners the manipulators already? Does a coin that has manipulators decentralized? If yes then was the difference with fiat currency? And yes Vitalik is also a threat to Ethereum, this doesn’t need much explanation but just look at how every threat towards CZ puts Binance in a bind always",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 16, 2023, 01:22:34 PM",
      "body": "Reading how the op unpacks the term decentralization, I think I understand why the question was posed. Bitcoin is more decentralized than Ethereum, but in aspects different from those pointed out as important by the op. Both Bitcoin and Ethereum have non-custodial wallets, so you can have control over your coins. And I guess the op is right that Buterin isn't the only one in the decision-making process regarding the future of EthereumBut PoS encourages a more centralized ownership of coins than PoW because those who already have a lot of Ethereum are given even more Ethereum, whereas with Bitcoin, miners and rich Bitcoin addresses can be two completely different things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 16, 2023, 01:50:40 PM",
      "body": "To be clear Ethereum was centralized even when it was using the PoW algorithm. In fact we could say it was centralized from its inception and we had a lot of simple and very obvious hints. From the 72 million premined ethers before it was even released to the biggest disgrace any cryptocurrency can have with the centralized authority controlling ethereum rolling back blocks just because they lost some money in a gamble called DAO.The move to PoS was the last nail in Ethereum's coffin that proved it has always been a centralized shitcoin. The recent decision to centralized the validators even more by significantly increasing the amount needed to be locked is just kicking an already dead horse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "July 16, 2023, 02:50:41 PM",
      "body": "Quote from: Bitcoiner2023 on July 16, 2023, 10:46:12 AMI don't understand why Bitcoin is more decentralized than Ethereum even though you operate a full node with both. To create the blocks: Bitcoin PoW = miners Ethereum PoS = Validator With Bitcoin/Ethereum Full Node you can verify the blocks from the miners/validators. So the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? Or is it the case with Ethereum that you cannot verify the blocks as a full node but only as a validator? So: Bitcoin miners create block / full nodes verify the block Ethereum validator create block / validator also verify the blockYou probably need to learn the basics. I also suggest reading the blog made by a person who calls himself \"StopAndDecrypt\". His writings are technical, but easy enough to read for newbies to learn and understand.Here's one of writings that's relevant for the topics that you're asking about, https://medium.com/@StopAndDecrypt/266c136fc55d#aee4You'll learn what nodes actually are, scaling, and other related topics that all Bitcoiners should know/have a minimum level of understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "July 16, 2023, 02:51:34 PM",
      "body": "Yes Bitcoin is more decentralized and it's not even close. Bitcoin could be considered the only highly decentralized cryptocurrency.A few reasons:1. Ethereum had a premine sale of like over half the Ethereum in existence. This means founders not only made a ton of money off their premine, but the founders and a handful of wealthy initial investors own a bunch of the Ethereum (just like VCs own most of the shares of a stock thanks to being able to invest before an IPO). Bitcoin, on the other hand, has always been issued by mining which it is much more equitable way to issue the coins.2. The fact that Ethereum had a big premine is made far worse by the fact that Ethereum is now proof of stake so that owning of supply and validation of transactions are no longer separate but are one in the same, giving founders and initial investors much more power over creating blocks.3. Also PoS just in general made Ethereum much more centralized because it is a less secure system than PoW. Now only is there the centralizing fact in #2 above with those who got the premine, but just in general with PoS, as said in #2, validation of transactions is no longer separated from ownership like in PoW, so large owners of ETH now can have more sway over creation of blocks. This is made much much worse by the fact that, unlike some other PoS cryptos, it is hard to stake ETH (32 ETH minimum, having to run a staking node, worrying about getting slashed if you're not online - hell, even Vitalik himself said he finds it difficult to run a staking node!!) so that most people reasonably are going to use staking services by a handful of companies. This has made it so most of the ETH staked is staked by a handful of companies, greatly compromising the security against a 51% attack. With Bitcoin their is no such centralization of mining.4. Also because you now earn newly mining ETH through ownership, those with the most ETH are gonna earn more and many of them were probably already rich so they are less likely to be selling ETH rewards for income every once in a while like most people will probably do. PoS is a system kinda like fiat where the rich keep getting richer - specifically meaning that those with a lot of ETH are the ones that get more new ETH. This is not how the Bitcoin system works, you don't get more Bitcoin simply from owning lots of Bitcoin.5. Even before Ethereum moved to PoS, it was already far less decentralized than Bitcoin. Bitcoin is much more popular, many more miners on the network, much. more hash power, many more full nodes running the network. On ETH running a full node (I think they are called Archival nodes or something like that) has always been hard and very resource intensive. There are wayyyyy fewer full nodes on Ethereum than on Bitcoin. In fact, a few years ago something like a third of the entire Ethereum network went down when Amazon's AWS had an outage, because running an Ethereum node all on your own is so hard that many of the people who even manage it use Amazon's cloud services to help out. A cloud infrastructure provider going down knocking out a third of Ethereum is the opposite of decentralized!6. Finally, Bitcoin is controlled by no one. Ethereum is controlled by the Ethereum foundation, and Vitalik himself has a lot of control over the network. The network essentially does whatever Vitalik and crew decide to do. Hard forks aplenty. This is the opposite of decentralization. Bitcoin on the other hand is an open source project with maintainers of the code and updates to the protocol are all down through backwards compatible soft forks and only if the vast majority of the network agrees to the changes. so the power control structure of Ethereum is verrrryyyy different are far more centralized than Bitcoin.Ethereum was already far less decentralized than Bitcoin both were PoW. PoS has made Ethereum much more centralized. That doesn't mean something bad is going to happen to Ethereum, but it does mean Bitcoin is a much more stable and secure platform than Ethereum.But also we must understand that these two cryptocurrencies are very different. Bitcoin is global money, so being a fully globally decentralized and secure network is of utmost importance for Bitcoin. Anything less than that would mean it is not good money. Ethereum, meanwhile, is not money, but an app network with ETH being the base token for the app network. And it's apps are all quite centralized anyways, and there isn't even anything popular on Ethereum yet. So Ethereum being fairly centralized isn't a huge problem as long as it can at least not have 51% attacks (which again, are far more likely than they are on Bitcoin). But if Ethereum ever grows to be a big economy of apps, with major applications and a lot of commerce done within its ecosystem, then Ethereum's centralization becomes a problem. Ethereum doesn't need to be highly decentralized like Bitcoin because ETH isn't money, but if a lot of economic activity starts happening in the future within Ethereum's application network Ethereum's lack of decentralization could become a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Who is John Galt?",
      "created_time": "July 16, 2023, 03:11:35 PM",
      "body": "Quote from: Bitcoiner2023 on July 16, 2023, 12:29:55 PMBut whether all miners get together and carry out a 51% attack or all validators get together for a 51% attack is basically the same, it is possible with bothYes, both are theoretically possible. Now let's imagine that someone decided to take control of Ethereum and began to secretly buy coins in order to start controlling enough of them. Once he got them under his control, nothing more can be done, because who controls more coins, the same and more influences the network. Including when voting for soft forks.If someone has collected enough hardware under their control to control bitcoin, at any moment someone else plugs in even more hardware, and control disappears. There is no way to establish a monopoly in almost any way.This is one of the reasons why Bitcoin is more decentralized than Ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wend",
      "created_time": "July 16, 2023, 04:07:07 PM",
      "body": "Quote from: EFS on July 16, 2023, 12:10:07 PMThey sold premined ETH with ICO. Bitcoin never do that.Beyond decentralization, this is what makes bitcoin apart from the rest of the market. Bitcoin was created with the intention of being a peer-to-peer currency, Satoshi did not intend to create bitcoin to be a profitable tool like altcoins, but we made bitcoin an investment asset. Meanwhile, ETH and all altcoins are created for the purpose of creating tokens and raising capital. Obviously, their original goal was to turn them into speculative assets, so it's not hard to see why they've become so centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "July 16, 2023, 04:09:25 PM",
      "body": "Quote from: Bitcoiner2023 on July 16, 2023, 12:29:55 PMBut whether all miners get together and carry out a 51% attack or all validators get together for a 51% attack is basically the same, it is possible with both...Maybe it's just a matter of faith like religion, some believe in Bitcoin, others in Ethereum and some in both or neitherLet's assume if someone wants to execute 51% attack over bitcoin network then they approximately need 181 EH/s of hashing power it is equivalent to hash power produced by 1 Million powerful ASICs so imagine it will need around 10B dollars for the product cost alone and then the operating cost which will be like another 5B and they have to keep running the ASICs to keep their control over bitcoin network, once they stopped all the blocks reversed will be confirmed again so its like they just wasted billions to hold the network for a while so its like they need unlimited amount of money to take control of bitcoin forever.If it is executed on the Ethereum network then the attacker needs 10M ETHs staked which is around 20B and if once the attacks start then a voting process needs to be taken to reverse those validated blocks (correct me if I am wrong guys).Bitcoiner2023  so both are decentralized however you can differentiate which one is impossible to attack than the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "July 16, 2023, 04:52:38 PM",
      "body": "Quote from: thecodebear on July 16, 2023, 02:51:34 PMYes Bitcoin is more decentralized and it's not even close. Bitcoin could be considered the only highly decentralized cryptocurrency.A few reasons:1. Ethereum had a premine sale of like over half the Ethereum in existence. This means founders not only made a ton of money off their premine, but the founders and a handful of wealthy initial investors own a bunch of the Ethereum (just like VCs own most of the shares of a stock thanks to being able to invest before an IPO). Bitcoin, on the other hand, has always been issued by mining which it is much more equitable way to issue the coins.2. The fact that Ethereum had a big premine is made far worse by the fact that Ethereum is now proof of stake so that owning of supply and validation of transactions are no longer separate but are one in the same, giving founders and initial investors much more power over creating blocks.3. Also PoS just in general made Ethereum much more centralized because it is a less secure system than PoW. Now only is there the centralizing fact in #2 above with those who got the premine, but just in general with PoS, as said in #2, validation of transactions is no longer separated from ownership like in PoW, so large owners of ETH now can have more sway over creation of blocks. This is made much much worse by the fact that, unlike some other PoS cryptos, it is hard to stake ETH (32 ETH minimum, having to run a staking node, worrying about getting slashed if you're not online - hell, even Vitalik himself said he finds it difficult to run a staking node!!) so that most people reasonably are going to use staking services by a handful of companies. This has made it so most of the ETH staked is staked by a handful of companies, greatly compromising the security against a 51% attack. With Bitcoin their is no such centralization of mining.4. Also because you now earn newly mining ETH through ownership, those with the most ETH are gonna earn more and many of them were probably already rich so they are less likely to be selling ETH rewards for income every once in a while like most people will probably do. PoS is a system kinda like fiat where the rich keep getting richer - specifically meaning that those with a lot of ETH are the ones that get more new ETH. This is not how the Bitcoin system works, you don't get more Bitcoin simply from owning lots of Bitcoin.5. Even before Ethereum moved to PoS, it was already far less decentralized than Bitcoin. Bitcoin is much more popular, many more miners on the network, much. more hash power, many more full nodes running the network. On ETH running a full node (I think they are called Archival nodes or something like that) has always been hard and very resource intensive. There are wayyyyy fewer full nodes on Ethereum than on Bitcoin. In fact, a few years ago something like a third of the entire Ethereum network went down when Amazon's AWS had an outage, because running an Ethereum node all on your own is so hard that many of the people who even manage it use Amazon's cloud services to help out. A cloud infrastructure provider going down knocking out a third of Ethereum is the opposite of decentralized!6. Finally, Bitcoin is controlled by no one. Ethereum is controlled by the Ethereum foundation, and Vitalik himself has a lot of control over the network. The network essentially does whatever Vitalik and crew decide to do. Hard forks aplenty. This is the opposite of decentralization. Bitcoin on the other hand is an open source project with maintainers of the code and updates to the protocol are all down through backwards compatible soft forks and only if the vast majority of the network agrees to the changes. so the power control structure of Ethereum is verrrryyyy different are far more centralized than Bitcoin.Ethereum was already far less decentralized than Bitcoin both were PoW. PoS has made Ethereum much more centralized. That doesn't mean something bad is going to happen to Ethereum, but it does mean Bitcoin is a much more stable and secure platform than Ethereum.But also we must understand that these two cryptocurrencies are very different. Bitcoin is global money, so being a fully globally decentralized and secure network is of utmost importance for Bitcoin. Anything less than that would mean it is not good money. Ethereum, meanwhile, is not money, but an app network with ETH being the base token for the app network. And it's apps are all quite centralized anyways, and there isn't even anything popular on Ethereum yet. So Ethereum being fairly centralized isn't a huge problem as long as it can at least not have 51% attacks (which again, are far more likely than they are on Bitcoin). But if Ethereum ever grows to be a big economy of apps, with major applications and a lot of commerce done within its ecosystem, then Ethereum's centralization becomes a problem. Ethereum doesn't need to be highly decentralized like Bitcoin because ETH isn't money, but if a lot of economic activity starts happening in the future within Ethereum's application network Ethereum's lack of decentralization could become a problem.You’re not going to get a better, more detailed response than the above. Superb piece of writing, thecodebear.It is near impossible to successfully attack bitcoin, it is the most decentralised form of money in the world. Satoshi was a genius who will go down in history as one of the greatest innovators of all time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "July 16, 2023, 05:17:58 PM",
      "body": "Quote from: EFS on July 16, 2023, 12:10:07 PM_act_ summed it up well. It's absurd to compare Bitcoin and Ethereum about decentralization. They sold premined ETH with ICO. Bitcoin never do that.Technically, it is. Bitcoin never had ICO and there were no premined sales. But there is a nuance. But what about the early miners and investors, now called whales, who mined, bought, or otherwise accumulated a lot of BTC? Unequal distribution among the owners of bitcoin still exists (ever since), which is not entirely correct from the point of view of decentralization.Although the comparison of ETH and BTC I think is completely redundant, because BTC undoubtedly wins by a huge score against ETH in terms of decentralization. In general, and not only in this.Quote from: EFS on July 16, 2023, 12:10:07 PMVitalik Buterin is a known figure and have the biggest influence over the market, even for other coins. Bitcoin don't have this type of figure.For any cryptocurrencies that have public representatives of the project, like Vitalik Buterin, they are a weak spot. They can change the direction in the market not only of their project, but of the entire cryptoindustry as a whole with their statements alone. Of course, this is a clear minus for decentralization.Quote from: EFS on July 16, 2023, 12:10:07 PMThey even roll back and forked the coin. Ethereum isn't even in their original chain, Ethereum Classic is.With Bitcoin, too, not everything is so simple. What about Bitcoin Cash? It's also a forked coin. At this point, there are similarities between ETH and BTC, right?Quote from: EFS on July 16, 2023, 12:10:07 PMSwitching from PoW to PoS is a hit about decentralization. Absolutely.Quote from: EFS on July 16, 2023, 12:10:07 PMEthereum has its benefits, but it's impossible to talk about decentralized ETH anymore. It was impossible to talk about decentralization ETH initially. Since the inception of the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "July 16, 2023, 09:25:50 PM",
      "body": "Ethereum is currently transitioning to Proof of Stake (PoS), where validators are selected based on the amount of cryptocurrency (ETH) they hold and \"lock up\" as collateral.  Chosen validators are responsible for validating transactions and creating new blocks.  Since participating as a validator requires a significant amount of ETH, some argue that PoS could lead to more centralization in the hands of those with large amounts of ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minhxx",
      "created_time": "July 17, 2023, 01:55:22 AM",
      "body": "Quote from: Bitcoiner2023 on July 16, 2023, 10:46:12 AMI don't understand why Bitcoin is more decentralized than Ethereum even though you operate a full node with both. To create the blocks: Bitcoin PoW = miners Ethereum PoS = Validator With Bitcoin/Ethereum Full Node you can verify the blocks from the miners/validators. So the only point why Bitcoin is more decentralized than Ethereum is: The Bitcoin Full Node is cheaper than the Ethereum Full Node ? Or is it the case with Ethereum that you cannot verify the blocks as a full node but only as a validator? So: Bitcoin miners create block / full nodes verify the block Ethereum validator create block / validator also verify the blockthis is an issue i'm interested in and am looking into it, maybe the price of bitcoin is 10 times more expensive than eth. It is also possible that bitcoin does not have a founder, a team as clear as ETH",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 17, 2023, 02:17:29 AM",
      "body": "Bitcoin hashrate is very high and decentralized from mining pools to geolocations.Blocks found by mining pools: https://www.blockchain.com/explorer/charts/poolsBitcoin mining map: https://ccaf.io/cbnsi/cbeci/mining_mapBitcoin reachable nodes: https://bitnodes.io/Distribution of reachable Bitcoin nodes across leading countries: https://bitnodes.io/dashboard/Evaluating validator decentralization: Geographic and Infrastructure Distribution in Proof-of-Stake Networks64%of staked ETH controlled by 5 entitiesYou will have more data from the Nansen tweetsIt is easier to attack Proof of Stake network than Proof of Work network and Bitcoin network is very big and safe against 51% attacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}