{
  "id": "topic_5469328",
  "title": "Question:",
  "author": "JollyGood",
  "created_time": "October 05, 2023, 05:20:16 PMLast edit: December 25, 2024, 01:10:09 PM by JollyGood",
  "content": "self-moderated to keep this thread clean from trolls, attention-seekers and signature spammersFURYvsUSYK17th FEBRUARY 2024A new date has been set for the Fury vs Usyk fight on 17th FEBRUARY 2024 for a fight to take place in Saudi Arabia.Everything is at an early stage. More information will be added as it becomes available and the press conference is taking place right now. ------------------------------------======================LOCAL RULEALL MEMBERS PLEASE NOTE:I want to try to keep this thread clean and legible.If you make posts that are quoting more than 2 members in a single direct reply, it will probably be deleted therefore if your main priority is to post to earn signature campaign fees it will affect your quota if your post gets deleted.Feel free to individually quote and individually reply to each quote to as many members as you want within your post, as that is acceptable.Some members are quoting 4+ members in their unnecessary walls of text and then making a two line post to reach their signature campaign targets to earn their fees and it is not acceptable in this thread.Please keep this local rule in mind when posting here. Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469328",
  "comments": [
    {
      "author": "JollyGood",
      "created_time": "October 26, 2023, 06:58:25 PM",
      "body": "According to many outlets including The Guardian have reported Fury and Usyk will fight for the heavyweight unification fight. If this really does go ahead this time, it will be the first time since 1999 when Lennox Lewis and Evander Holyfield battled it out and it was Lewis who became undisputed heavyweight champions. Fury himself has stated he does not see any problems fighting Ngannou on 28th October and then Usyk on 23rd December. In typical Fury banter he stated: \"Double payday. There’ll be a nice big turkey in the Fury household this Christmas!\"Fury will need to get past Ngannou with relative ease otherwise Usyk will go in to that fight with a lot more confidence than Fury would have wanted. With a prize to go own in history, there is a massive prize on the line but at least they have signed contracts for the fight to take place on 23rd December 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "October 30, 2023, 12:24:11 PM",
      "body": "================================================================After what happened in the fight between Tyson Fury and Francis Ngannou fight, I think Usyk will definitely feel he will become undisputed heavyweight champion if their fight goes ahead on 23rd December 2023. If there ever was a better time and chance to beat Fury, this has to be it. If he goes in to the ring on 23rd December knowing he has not rested after the Ngannou fight nor properly trained for Usyk, it is clear he will be in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 30, 2023, 02:08:57 PM",
      "body": "^ In that image with Arum, Usyk looks smaller than Ngannou he is a champ in WBA and WBO but he hasn't fought tough ones like Wilder. I bet when he is there on top already, he'd be an easy champ to beat by those aspiring ones.  It depends on how agile he still would be after pumping his weight.What weight would they fight at?This is a factor to watch because this certainly affects the way they will fight. If Fury has to eat and drink less for 2 months, it's gonna be a loss for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 30, 2023, 02:19:59 PM",
      "body": "Thats gona be a great fight. I think Fury still probably has an edge but the last fight showed that it is possible to take him down afterall. Also the fight is actually pretty near and there were some rumblings from Furys side that they might want to postpone it to a later date but Usyk sayd the contracts have been signed already (a while back Fury was making fun of Usyk that he cant back out as contracts done, oh my how the tables have turned lol)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 30, 2023, 05:18:14 PM",
      "body": "Quote from: JollyGood on October 30, 2023, 12:24:11 PMAfter what happened in the fight between Tyson Fury and Francis Ngannou fight, I think Usyk will definitely feel he will become undisputed heavyweight champion if their fight goes ahead on 23rd December 2023. If there ever was a better time and chance to beat Fury, this has to be it. If he goes in to the ring on 23rd December knowing he has not rested after the Ngannou fight nor properly trained for Usyk, it is clear he will be in trouble.I have seen the interview and USYK is very eager to fight Fury, he thinks that Fury is going downhill, and has crashed because of Ngannou's fight, there's no air of arrogance or confidence in Fury's eyes when they met, and Fury's promoters tries to save him by trying to move the date but since the contract is already been signed there's no way Fury can just back out but, if they can present a medical condition that can be backed that Fury needs a long rest then there's a possibility that the fight could be moved in January or February next year.Fury needs to recuperate it is not only his body and face that need to recuperate he also needs his wounded ego to recuperate, right now there's so much bashing and insult being thrown on Fury and he needs to get this over and be fully prepared before he face Usyk, I think Usyk should thank Ngannou for exposing his weaknesses, before this fight,  people are consistent in saying Usyk has little chance but now its a big turn around, its Fury that has a little chance to beat Usyk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 30, 2023, 05:31:50 PM",
      "body": "Tyson fury better pull out of the coming fight. He needs some time to recover after the beating he took from Francis Ngannou, he even had a black eye during his interview after the fight, USYK is a tough fighter and one fvat would give Tyson fury troubles even when Tyson fury is on his best day.Tyson must have underated Francis Ngannou so much as to think he would breeze in an breeze out of their fight untouched and go into the next fight, but medically I think if the fight between him and USYK goes on he would be at the disadvantage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "October 30, 2023, 08:55:20 PM",
      "body": "Quote from: JollyGood on October 30, 2023, 12:24:11 PMAfter what happened in the fight between Tyson Fury and Francis Ngannou fight, I think Usyk will definitely feel he will become undisputed heavyweight champion if their fight goes ahead on 23rd December 2023. If there ever was a better time and chance to beat Fury, this has to be it. If he goes in to the ring on 23rd December knowing he has not rested after the Ngannou fight nor properly trained for Usyk, it is clear he will be in trouble.It is possible that Tyson Fury underestimate Ngannou so it affects his performance. I feel like when I was watching Fury he isn't 100% trained for that fight, his physique is way more flabby so I guess Fury was missing some training session before the fight.We really can think that with the recent performance of Tyson Fury, Usyk will have the higher chance of winning the fight but I think Tyson Fury had learned some lesson in his fight against Ngannou and might probably get more serious preparation in his next fight.Regardless I still think Ngannou won that fight and it should have been him and not Tyson Fury that should be in the upcoming unification fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "November 02, 2023, 10:28:58 AM",
      "body": "Quote from: cabron on October 30, 2023, 02:08:57 PM^ In that image with Arum, Usyk looks smaller than Ngannou he is a champ in WBA and WBO but he hasn't fought tough ones like Wilder. I bet when he is there on top already, he'd be an easy champ to beat by those aspiring ones.  It depends on how agile he still would be after pumping his weight.That is Bob Arum and yes Usyk does seem much smaller than Ngannou. Look at him standing next to Fury, ordinarily you would think he has no chance but the way Fury is fighting and the way Usyk wants this fight to go ahead, it is clear he will be relentless in his pursuit and could defeat Fury. Quote from: edmundduke on October 30, 2023, 02:19:59 PMThats gona be a great fight. I think Fury still probably has an edge but the last fight showed that it is possible to take him down afterall. Also the fight is actually pretty near and there were some rumblings from Furys side that they might want to postpone it to a later date but Usyk sayd the contracts have been signed already (a while back Fury was making fun of Usyk that he cant back out as contracts done, oh my how the tables have turned lol)Would the time from now until the proposed fight date on 23rd December allow Fury enough time to get back to his best physical condition to be in serious contention to win the fight?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "November 16, 2023, 07:08:56 PM",
      "body": "THE PRESS CONFERENCE IS TAKING PLACE NOW: The fight has been booked for 17th February 2024Sylvester Stallone walked on to the stage to the sound of the Rocky film. When Fury and Usyk faced-off they were almost headbutting each other. What a way to promote the fight. I think the fight will go ahead this time, neither party will pull out and cancel the fight. This is the first heavyweight unification fight taking place this century (the last unified heavyweight champion was Lennox Lewis).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "November 16, 2023, 08:30:34 PM",
      "body": "Quote from: JollyGood on November 16, 2023, 07:08:56 PMTHE PRESS CONFERENCE IS TAKING PLACE NOW: The fight has been booked for 17th February 2024Sylvester Stallone walked on to the stage to the sound of the Rocky film. When Fury and Usyk faced-off they were almost headbutting each other. What a way to promote the fight. I think the fight will go ahead this time, neither party will pull out and cancel the fight. This is the first heavyweight unification fight taking place this century (the last unified heavyweight champion was Lennox Lewis).This seems to be the case. I'm a little disappointed because this deadline gives time for the greedy belly to get into shape, but on the other hand it will be a fair fight when both boxers are in optimal shape and no one is underestimating anyone.Fury will be the favorite, but clearly not the same as he would be without the fight with Ngannou. What do you think, starting from what odds will it be profitable to bet on: Fury, Usyk?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 16, 2023, 11:27:58 PM",
      "body": "Quote from: JollyGood on November 16, 2023, 07:08:56 PMTHE PRESS CONFERENCE IS TAKING PLACE NOW: The fight has been booked for 17th February 2024Sylvester Stallone walked on to the stage to the sound of the Rocky film. When Fury and Usyk faced-off they were almost headbutting each other. What a way to promote the fight. I think the fight will go ahead this time, neither party will pull out and cancel the fight. This is the first heavyweight unification fight taking place this century (the last unified heavyweight champion was Lennox Lewis).Yeah, here is the full video of it, https://www.youtube.com/watch?v=MYTVlz57uZk.I do like the head butting, I thought that it will go on a brawl, but Usyk just keep himself cool and just laughing it off.But Fury, the usual, his mouth goes on a tirade, so the hype continues.@KTChampions - I do agree, but Fury needs his body and mind to heal after the beating he got from Francis Ngannou, hehehe.As per the latest odds:Fury: 1.62Usyk - 2.21",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "November 16, 2023, 11:47:11 PM",
      "body": "Quote from: KTChampions on November 16, 2023, 08:30:34 PMThis seems to be the case. I'm a little disappointed because this deadline gives time for the greedy belly to get into shape, but on the other hand it will be a fair fight when both boxers are in optimal shape and no one is underestimating anyone.Fury will be the favorite, but clearly not the same as he would be without the fight with Ngannou. What do you think, starting from what odds will it be profitable to bet on: Fury, Usyk?If the fight went ahead in December, I think Fury would not have been fit or focused enough to give himself the best chance to win but by February next year both Fury and Usyk should be in optimal shape. If the fight does go ahead this time, I do think Fury will remain as the favourite but both are undefeated in their professional careers therefore this really will be the biggest fight since Lennox Lewis defeated Evander Holyfield Quote from: Baofeng on November 16, 2023, 11:27:58 PMYeah, here is the full video of it, https://www.youtube.com/watch?v=MYTVlz57uZk.I do like the head butting, I thought that it will go on a brawl, but Usyk just keep himself cool and just laughing it off.It was good to see Usyk not allowing Fury to dominate the press conference and yes the drama where their foreheads nearly started fighting, it was hilarious",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 17, 2023, 01:38:09 AM",
      "body": "Quote from: Baofeng on November 16, 2023, 11:27:58 PMAs per the latest odds:Fury: 1.62Usyk - 2.21The odds I saw in box.live have a significant difference from those you've given. Where did you get those odds? Are those taken from a betting platform? In box.live the odds were 1.53 for Fury and 2.5 for Usyk. In Sportsbet, it's the same for Fury at 1.53 although lower for Usyk at 2.28. I'm for Fury in this fight. If I can find better odds for Fury like those that you've posted, I'd be interested to bet an outright. I really am not expecting an upset on this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "November 17, 2023, 10:55:28 AM",
      "body": "The odds will change as and when the number of bets placed changes but it seems as though Fury is the favourite. What has to be mentioned is that he is definitely not overwhelmingly favourite and that is for two reasons. First, his display against Ngannou was nowhere near emphatic and second, Usyk has a real chance to win.Quote from: Darker45 on November 17, 2023, 01:38:09 AMThe odds I saw in box.live have a significant difference from those you've given. Where did you get those odds? Are those taken from a betting platform? In box.live the odds were 1.53 for Fury and 2.5 for Usyk. In Sportsbet, it's the same for Fury at 1.53 although lower for Usyk at 2.28. I'm for Fury in this fight. If I can find better odds for Fury like those that you've posted, I'd be interested to bet an outright. I really am not expecting an upset on this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "November 17, 2023, 12:42:15 PM",
      "body": "Quote from: cabron on October 30, 2023, 02:08:57 PM^ In that image with Arum, Usyk looks smaller than Ngannou he is a champ in WBA and WBO but he hasn't fought tough ones like Wilder. I bet when he is there on top already, he'd be an easy champ to beat by those aspiring ones.  It depends on how agile he still would be after pumping his weight.In today's generation of heavyweights, Usyk is just a blown-up cruiserweight. If not for his skills and high IQ he'll never have a chance of even getting a title shot. And by the way, he holds the Ring, WBA, IBF, and WBO belts so Fury's WBC belt is the only missing piece to determine the undisputed champion.For years during AJ and Wilder's undefeated championship reigns, it's always the former favored by the betting odds. AJ has a shorter reign as champion than Wilder but his resume is always better than the American. AJ unified the belts and held 3 while Wilder never tried unifying his belt. Usyk did beat a version of AJ that is not undefeated anymore though while Fury is the only one that gave Wilder losses.Quote from: cabron on October 30, 2023, 02:08:57 PMWhat weight would they fight at?This is a factor to watch because this certainly affects the way they will fight. If Fury has to eat and drink less for 2 months, it's gonna be a loss for him.Lol! It's the heavyweight. Fury can eat all he wants but I guess he enters the ring lighter knowing he is fighting someone that has speed and skills. Maybe 250+ or below 265 pounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "November 17, 2023, 02:04:45 PM",
      "body": "Quote from: Darker45 on November 17, 2023, 01:38:09 AMQuote from: Baofeng on November 16, 2023, 11:27:58 PMAs per the latest odds:Fury: 1.62Usyk - 2.21The odds I saw in box.live have a significant difference from those you've given. Where did you get those odds? Are those taken from a betting platform? In box.live the odds were 1.53 for Fury and 2.5 for Usyk. In Sportsbet, it's the same for Fury at 1.53 although lower for Usyk at 2.28. I'm for Fury in this fight. If I can find better odds for Fury like those that you've posted, I'd be interested to bet an outright. I really am not expecting an upset on this one.Hmmm... It seems to me that any bet on Usik with odds higher than 2.1 is profitable. At the moment, Fury is much more hyped than Usyk plus he is the favorite so it can be assumed that bookmakers base their quotes on cash flow from betters. Therefore, I will assume that these quotes poorly reflect the sports balance of power where it seems that the chances are 50 to 50.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "November 17, 2023, 05:43:19 PM",
      "body": "The odds could not be too heavily biased towards either when you look at what the bookmakers are offering because it will be a very close fight.As far as those of us who have an interest in boxing are concerned, how many would be shocked if Usyk won the fight? I am going for a Fury win but only just, overall I think he should win the fight but Usyk could win because the two are finely balanced. Neither looked supremely good in their most recent fight therefore it became harder to make a selection.Quote from: KTChampions on November 17, 2023, 02:04:45 PMHmmm... It seems to me that any bet on Usik with odds higher than 2.1 is profitable. At the moment, Fury is much more hyped than Usyk plus he is the favorite so it can be assumed that bookmakers base their quotes on cash flow from betters. Therefore, I will assume that these quotes poorly reflect the sports balance of power where it seems that the chances are 50 to 50.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "November 17, 2023, 08:55:49 PM",
      "body": "Quote from: JollyGood on November 17, 2023, 05:43:19 PMThe odds could not be too heavily biased towards either when you look at what the bookmakers are offering because it will be a very close fight.As far as those of us who have an interest in boxing are concerned, how many would be shocked if Usyk won the fight? I am going for a Fury win but only just, overall I think he should win the fight but Usyk could win because the two are finely balanced. Neither looked supremely good in their most recent fight therefore it became harder to make a selection.Quote from: KTChampions on November 17, 2023, 02:04:45 PMHmmm... It seems to me that any bet on Usik with odds higher than 2.1 is profitable. At the moment, Fury is much more hyped than Usyk plus he is the favorite so it can be assumed that bookmakers base their quotes on cash flow from betters. Therefore, I will assume that these quotes poorly reflect the sports balance of power where it seems that the chances are 50 to 50.If I remember correctly, in the first fight against AJ, Usik was assessed as an underdog with very weak chances, and even after the second fight with AJ, the majority thought that Fury would crush Usik. Now, after Fury first showed his uncertainty by avoiding the fight, and then showed his poor form in the fight with Ngannou, the circumstances for the quotes have changed. No one will be surprised by any outcome. It’s funny that in the end the fight could be dominated by Fury (due to his size and advantage in physical strength) or Usik (due to technique and speed), but before the fight the chances are really about 50 to 50. Therefore, for me personally, the skew of odds in favor of Fury lies in the area of cash flow and not in the area of how bookmakers assess their strength.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 18, 2023, 01:31:33 AM",
      "body": "Quote from: JollyGood on November 17, 2023, 10:55:28 AMThe odds will change as and when the number of bets placed changes but it seems as though Fury is the favourite. What has to be mentioned is that he is definitely not overwhelmingly favourite and that is for two reasons. First, his display against Ngannou was nowhere near emphatic and second, Usyk has a real chance to win.Quote from: Darker45 on November 17, 2023, 01:38:09 AMThe odds I saw in box.live have a significant difference from those you've given. Where did you get those odds? Are those taken from a betting platform? In box.live the odds were 1.53 for Fury and 2.5 for Usyk. In Sportsbet, it's the same for Fury at 1.53 although lower for Usyk at 2.28. I'm for Fury in this fight. If I can find better odds for Fury like those that you've posted, I'd be interested to bet an outright. I really am not expecting an upset on this one.That was a rather quick and significant change in the odds based on actual betting when the fight is scheduled 3 months from now. I was curious which betting platform it was offered. Having an account there might be worth it. Anyway, I doubt Fury took Ngannou very seriously. For somebody who had just crossed into boxing from MMA and has been inactive for almost two years, he probably wouldn't be taken as a big threat. Usyk has a chance but I don't think it's a big one.Quote from: KTChampions on November 17, 2023, 02:04:45 PMQuote from: Darker45 on November 17, 2023, 01:38:09 AMQuote from: Baofeng on November 16, 2023, 11:27:58 PMAs per the latest odds:Fury: 1.62Usyk - 2.21The odds I saw in box.live have a significant difference from those you've given. Where did you get those odds? Are those taken from a betting platform? In box.live the odds were 1.53 for Fury and 2.5 for Usyk. In Sportsbet, it's the same for Fury at 1.53 although lower for Usyk at 2.28. I'm for Fury in this fight. If I can find better odds for Fury like those that you've posted, I'd be interested to bet an outright. I really am not expecting an upset on this one.Hmmm... It seems to me that any bet on Usik with odds higher than 2.1 is profitable. At the moment, Fury is much more hyped than Usyk plus he is the favorite so it can be assumed that bookmakers base their quotes on cash flow from betters. Therefore, I will assume that these quotes poorly reflect the sports balance of power where it seems that the chances are 50 to 50.I don't see it as 50:50. I actually agree with the odds. That's why I was curious where this Fury's 1.62 odds are posted because that's for me higher than it could actually be in reality. Usyk has a talent, yes, but if he could only win an SD against a breaking Joshua in their rematch, I can't see any reason how he could defeat a much bigger, stronger, and more confident and undefeated Fury.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}