{
  "id": "topic_5418772",
  "title": "Ultegra134",
  "author": "Ultegra134",
  "created_time": "October 29, 2022, 08:51:59 PM",
  "content": "This is the second or third time Binance has asked me to verify my identity. Nothing has changed; it requires the same documents I uploaded the first time; same ID, same proof of address, everything. A friend of mine, who was also referred by me, has been subject to KYC verification twice this year. I understand that they want to keep making sure that all personal information is valid and up-to-date, but it sounds too exaggerated to me. On top of that, they are offering a worthless $10 cashback voucher if you verify successfully. If you don't, however, you will suffer account limitations till you submit your information. It's honestly a boring procedure.On the one hand, I'd prefer to withdraw all funds from any centralized exchange, such as Binance, but on the other hand, keeping my money in decentralized wallets such as Metamask doesn't sound too safe to me. There are a lot of scams and exploits going on, and you can never be too sure. For this reason, centralized exchanges appear way safer, and I believe that if anything ever happened to Binance, for instance, it would compensate its users.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418772",
  "comments": [
    {
      "author": "meser#",
      "created_time": "October 29, 2022, 09:14:47 PM",
      "body": "It happened last year, I wanted to buy bitcoin with my debit card. My bank didn't allow the transaction and when I checked later it was asking for KYC verification. I think many things trigger binance's security to ask verification. Or it just a problem every user has to deal with it at least once:)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 29, 2022, 09:56:30 PM",
      "body": "Once a year update KYC is enough, i experienced this on my local exchange although it's not even yearly like first time i joined was 2017, they ask me again to update on 2020, and this year.  So it's really understandable. But for twice a year? That's quite annoying and just asking the same documents, it's reasonable if the IDs submitted are in near expiry but if not, what's the reason?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 29, 2022, 10:07:06 PM",
      "body": "I can't recall if they asked me to verify again. But as we know once we are using a centralized exchange we should be ready to provide KYC documents anytime they ask. It's their terms and conditions and you have to follow them if you want to continue with them. For storing your funds never use Binance or any other centralized exchange. Also, Metamask isn't safe there are a lot of allegations against them about how easily hackers drain wallets. Better buy a hardware wallet to secure your funds. Because often we need to connect Metamask to various websites and there is the chance to drain your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "October 29, 2022, 10:10:18 PM",
      "body": "Quote from: PX-Z on October 29, 2022, 09:56:30 PMOnce a year update KYC is enough, i experienced this on my local exchange although it's not even yearly like first time i joined was 2017, they ask me again to update on 2020, and this year.  So it's really understandable. But for twice a year? That's quite annoying and just asking the same documents, it's reasonable if the IDs submitted are in near expiry but if not, what's the reason?there's possibility that the submitted ID is about to expire. but in any case, since they already asked kyc before, would not be hard for the user to submit again. some ID cards really do expire like the driver's license. if you want to know the reasons, maybe, you can contact their support the reason why? you can easily chat their site support on their page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 30, 2022, 03:44:52 AM",
      "body": "\"Trusted\" exchange is starting to distrust customers. Laughed reading this, and yeah as I predicted earlier in another thread it finally came true.\"... they revoke your KYC status as if they no longer trust the identity documents you submitted previously.\"Quote from: Ultegra134 on October 29, 2022, 08:51:59 PM-snip-but on the other hand, keeping my money in decentralized wallets such as Metamask doesn't sound too safe to me. There are a lot of scams and exploits going on, and you can never be too sure.Isn't that how a non-custodial wallet works, \"Because you are the driver, you bear the risk for you and the passengers\"? I prefer this way, risk is quantifiable as long as you know enough about the space you're in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 30, 2022, 08:48:36 AM",
      "body": "Since you have completed the identity verification, this means that you are ready to take this test every time if the platform suspects anything, for example, did you do anything that adds red points such as changing your device, IP address, withdrawing with unusual amounts, suspicious transactions or anything that could activate They have an alarm system?As for you leaving the platform, the centralized platforms are still far from competing with the centralized platforms in speed, liquidity, order execution, fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 30, 2022, 09:01:49 AM",
      "body": "Quote from: hugeblack on October 30, 2022, 08:48:36 AMSince you have completed the identity verification, this means that you are ready to take this test every time if the platform suspects anything, for example, did you do anything that adds red points such as changing your device, IP address, withdrawing with unusual amounts, suspicious transactions or anything that could activate They have an alarm system?As for you leaving the platform, the centralized platforms are still far from competing with the centralized platforms in speed, liquidity, order execution, fees.Withdrawing unusual amounts and then asking to verify again your data is nothing like what the banks are doing these days. Been also asked for my KYC back in 2020 when I bought a new phone. Ever since no KYC, I'm already afraid to change anything or withdraw but will only do it thru P2P on binance.Centralized is centralized and binance is just compliant with every government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 30, 2022, 09:06:57 AM",
      "body": "Hm that's weird, for them to ask KYC so often. At least from my point of view as I don't remember being asked to do that in the last couple of years but I guess it depends on what you are doing with you account and the amounts you are receiving/sending.Quote from: Ultegra134 on October 29, 2022, 08:51:59 PMOn the one hand, I'd prefer to withdraw all funds from any centralized exchange, such as Binance, but on the other hand, keeping my money in decentralized wallets such as Metamask doesn't sound too safe to me. There are a lot of scams and exploits going on, and you can never be too sure. For this reason, centralized exchanges appear way safer, and I believe that if anything ever happened to Binance, for instance, it would compensate its users.Why would Metamask (which I agree is not safe enough for anything else other than hot wallet) be the only alternative to centralized exchanges when for less than $100 you can buy a hardware wallet and have your money safe? Quote from: Ultegra134 on October 29, 2022, 08:51:59 PMFor this reason, centralized exchanges appear way safer, and I believe that if anything ever happened to Binance, for instance, it would compensate its users.They may appear to some, but they are not. Its foolish to think that Binance would compensate their users if anything seriously bad happened, especially after everything that has happened in the past with other exchanges and platforms. Btw, you may lose your funds without anything bad happening to Binance as they can block your funds for whatever bs reason they think of and there's not much that you would be able to do without hiring lawyers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 30, 2022, 09:10:40 AM",
      "body": "Quote from: bittraffic on October 30, 2022, 09:01:49 AMEver since no KYC, I'm already afraid to change anything or withdraw but will only do it thru P2P on binance.Binace P2P is worse than using binace, it is a service that combines all disadvantages of CEXs and DEXs and free all responsibility from Binace.In Binace P2P, you can lose your money, scammed, your balance is confiscated, the platform asks you to verify your identity more than once, the difficulty of executing orders, recording all conversations and thus obtaining more data such as your other bank accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "October 30, 2022, 01:02:51 PM",
      "body": "Quote from: Rikafip on October 30, 2022, 09:06:57 AMHm that's weird, for them to ask KYC so often. At least from my point of view as I don't remember being asked to do that in the last couple of years but I guess it depends on what you are doing with you account and the amounts you are receiving/sending.Quote from: Ultegra134 on October 29, 2022, 08:51:59 PMOn the one hand, I'd prefer to withdraw all funds from any centralized exchange, such as Binance, but on the other hand, keeping my money in decentralized wallets such as Metamask doesn't sound too safe to me. There are a lot of scams and exploits going on, and you can never be too sure. For this reason, centralized exchanges appear way safer, and I believe that if anything ever happened to Binance, for instance, it would compensate its users.Why would Metamask (which I agree is not safe enough for anything else other than hot wallet) be the only alternative to centralized exchanges when for less than $100 you can buy a hardware wallet and have your money safe? Quote from: Ultegra134 on October 29, 2022, 08:51:59 PMFor this reason, centralized exchanges appear way safer, and I believe that if anything ever happened to Binance, for instance, it would compensate its users.They may appear to some, but they are not. Its foolish to think that Binance would compensate their users if anything seriously bad happened, especially after everything that has happened in the past with other exchanges and platforms. Btw, you may lose your funds without anything bad happening to Binance as they can block your funds for whatever bs reason they think of and there's not much that you would be able to do without hiring lawyers. Now that you and another member mentioned it, one of my suspicions is that it has to do with Greek-issued government IDs. We still haven't transited to European ones, which are the size of a credit card and, like driver's licenses, do not have an official expiry date. I only hold stablecoins on Binance for staking. Normally, I wouldn't have them in an exchange, but after the Terra incident, it was the quickest and safest thing I could think of. I'm definitely not storing Bitcoin there, but in an offline wallet. Thus, I don't see a reason for a hardware wallet at the moment.I'm definitely not certain that Binance would reimburse its users in the case of a hack, but wouldn't that be the end of the exchange in case it happened? That's how I see things. However, there is zero guarantee that your funds are 100% protected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "October 30, 2022, 09:15:16 PM",
      "body": "Quote from: Rikafip on October 30, 2022, 09:06:57 AMHm that's weird, for them to ask KYC so often. At least from my point of view as I don't remember being asked to do that in the last couple of years but I guess it depends on what you are doing with you account and the amounts you are receiving/sending.They never asked me to re-verify my identity, personally. But I wouldn't be surprised if they do it.I understand that it's unpleasant for the customer but it's a normal and necessary security check to be sure the current user is indeed the account's owner.I suppose they randomly pick users and ask them to reverify their identity or in case they notice some suspicious activities. This may help to prevent accounts sales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 30, 2022, 09:18:08 PM",
      "body": "If you feel unsafe on any of them, just store your funds to hardware wallets if you have one. This is to be expected for Binance as they're hot in the eyes of the regulators. It happened to me, they've asked me for another verification, I think it was this 1st or 2nd quarter despite being full with requirements.And if they're being asked to update their users with their information and identity, they'll have to do it whether they like it or not. We've seen them very okay with no kyc and having good limits before but it all changed due to regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 30, 2022, 11:59:10 PM",
      "body": "Quote from: Ultegra134 on October 29, 2022, 08:51:59 PM...keeping my money in decentralized wallets such as Metamask doesn't sound too safe to me. There are a lot of scams and exploits going on, and you can never be too sure. For this reason, centralized exchanges appear way safer, and I believe that if anything ever happened to Binance, for instance, it would compensate its users.I'm strongly against this.There's no other safe to store your fund aside from a decentralized platform or an open-sourced wallet, which is Metamask was belong to an open-source wallet.  Used these centralized platforms should be used for instant trading or converting to fiat but not means for storing your fund for a long period of time, on other hand in a better way, use the decentralized platform if you don't want this heavy KYC procedure.  I experienced the same on Binance lately upon using a local centralized wallet, they asked for further KYC procedure, and they want me to submit a video clip while holding my ID and stating their company name and that date, I think it's the same because I never used Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 31, 2022, 10:27:30 AM",
      "body": "If possible, I would like to know precisely the reason for Binance asking for KYC again. did you contact their support and ask them?at some point, the document with which I validated my KYC expired, and they only asked me to upload a new valid document. nothing controversial, I could even use the complete service regardless.Quote from: Ultegra134 on October 29, 2022, 08:51:59 PMOn the one hand, I'd prefer to withdraw all funds from any centralized exchange, such as Binance, but on the other hand, keeping my money in decentralized wallets such as Metamask doesn't sound too safe to me. There are a lot of scams and exploits going on, and you can never be too sure. For this reason, centralized exchanges appear way safer, and I believe that if anything ever happened to Binance, for instance, it would compensate its users.I don't know the value of your asset, but it's probably time for you to think about a hardware wallet. (upcoming holidays always bring some discounts, maybe you can catch one of them). look at it as a long-term investment, because I'm assuming you don't plan to get out of cryptocurrencies anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 31, 2022, 11:15:14 AM",
      "body": "Quote from: Ultegra134 on October 30, 2022, 01:02:51 PMNow that you and another member mentioned it, one of my suspicions is that it has to do with Greek-issued government IDs. We still haven't transited to European ones, which are the size of a credit card and, like driver's licenses, do not have an official expiry date. I know a Greek guy who had issues with PayPal due ID (his ID was issued like 25 years ago and as you said it doesn't have expiry date and they couldn't comprehend that) so yeah it could be connected with that in your case as well.Quote from: Ultegra134 on October 30, 2022, 01:02:51 PMI only hold stablecoins on Binance for staking. Normally, I wouldn't have them in an exchange, but after the Terra incident, it was the quickest and safest thing I could think of. I'm definitely not storing Bitcoin there, but in an offline wallet. Thus, I don't see a reason for a hardware wallet at the moment.But is the APY they offer (few % I guess) really worth it to keep your stablecoins there when you can easily get hardware wallet and store it there? Quote from: Ultegra134 on October 30, 2022, 01:02:51 PMI'm definitely not certain that Binance would reimburse its users in the case of a hack, but wouldn't that be the end of the exchange in case it happened? That's how I see things. However, there is zero guarantee that your funds are 100% protected.Sure, if its some smaller hack I have no doubts that they can easily cover that, but there are so many things that can go wrong with exchange that hack is the least of my worries. No exchange is too big to fail, and Binance is no exception of that, no matter how invincible it may seem to some.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 31, 2022, 11:39:03 AM",
      "body": "Quote from: Ultegra134 on October 29, 2022, 08:51:59 PMThis is the second or third time Binance has asked me to verify my identity. Nothing has changed; it requires the same documents I uploaded the first time; same ID, same proof of address, everything.Don't worry, your documents are ''safu'' until the next hack and exploit, when they will be offered for sale like it happed before.I think Binance kyc system is semi-automatic and robots probably noticed some issue with documents you send the before, but I would seriously consider stop using any centralized exchange that is doing this.There are more than enough ways you can exchange your coins without providing any verification, like Bisq or P2P trading in your local area.Quote from: Ultegra134 on October 30, 2022, 01:02:51 PMI'm definitely not certain that Binance would reimburse its users in the case of a hack, but wouldn't that be the end of the exchange in case it happened? That's how I see things. However, there is zero guarantee that your funds are 100% protected.They can't reimburse shit if your documents get leaked and end up in same internet dark corners.Someone could buy them for cheap and use to register everywhere in your name, or even commit crime with your identity (it happened before).Think about that next time you send your documents to any exchange.Quote from: Rikafip on October 31, 2022, 11:15:14 AMI know a Greek guy who had issues with PayPal due ID (his ID was issued like 25 years ago and as you said it doesn't have expiry date and they couldn't comprehend that) so yeah it could be connected with that in your case as well.I never understood why government issued documents in some countries would have short or any expiration dates, except in cases of damage or big change in person physical appearance.Only reason they would do this is taking more money from people or if they are introducing new ''revolutionary'' system that can be hacked and abused easily",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 31, 2022, 01:04:46 PM",
      "body": "Quote from: dkbit98 on October 31, 2022, 11:39:03 AMI never understood why government issued documents in some countries would have short or any expiration dates, except in cases of damage or big change in person physical appearance.Only reason they would do this is taking more money from people or if they are introducing new ''revolutionary'' system that can be hacked and abused easily  Getting more money from people is certainly one of the reasons as you gotta get the money for all those government employees who will vote for your party, but another reason is that people's look change over the years, especially if you got ID at young age. Person I mentioned got his ID when he was 14 years old and looks very different now when he is 45 (in the meantime he got new ID, not because of PayPal but some other reasons). Good luck trying to cross the border (and we can travel all around the EU with just our ID) with the ID of a kid who looks nothing like you now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 31, 2022, 03:51:22 PM",
      "body": "Quote from: dkbit98 on October 31, 2022, 11:39:03 AMI never understood why government issued documents in some countries would have short or any expiration dates, except in cases of damage or big change in person physical appearance.Only reason they would do this is taking more money from people or if they are introducing new ''revolutionary'' system that can be hacked and abused easily  In Brazil issuing new docs, specially passports, is another form of taxes.Passports were valid only for 5 y (a few years ago it was changed to 10 y)  and they are very expensive here.Personally,  if it was cheap and fast I would say it is good to have a 10y expiration date. People may lose it, send copies to shade companies (like binance)  etc.I have seen many hotels (even in europe) which simple want to copy my passport in the check in, a clear abuse. An expiration date will certainly add some security against those bad practices",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 31, 2022, 04:26:51 PM",
      "body": "Quote from: Rikafip on October 31, 2022, 01:04:46 PMPerson I mentioned got his ID when he was 14 years old and looks very different now when he is 45 (in the meantime he got new ID, not because of PayPal but some other reasons). Good luck trying to cross the border (and we can travel all around the EU with just our ID) with the ID of a kid who looks nothing like you now. I already said that I understand changing your documents when you appearance changes a lot, but now with all biometric scanning crap they don't really need to have even that.I have a friend who lives in one country with drivers license that is valid for life, that means no expiration date until you become very old and they need to check your eyes and other health for confirmation.Paying money for prolonging drivers license is clear case of tax extortion.Quote from: bitmover on October 31, 2022, 03:51:22 PMIn Brazil issuing new docs, specially passports, is another form of taxes.Passports were valid only for 5 y (a few years ago it was changed to 10 y)  and they are very expensive here.This is good example of government abuse for money, nobody should change passports every 5 years unless they travel so much that there is no more space in documents for new stamps.But hey, you just got new president in Brazil and I am ''sure'' things will change now, not sure it will be better for regular people",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}