{
  "id": "topic_5445766",
  "title": "Diornov",
  "author": "Diornov",
  "created_time": "March 21, 2023, 09:19:23 AMLast edit: March 21, 2023, 10:02:45 AM by Diornov",
  "content": "Hello Bitcointalk. My name is Diornov, and I'm the founder of Zenland - a Smart Contract Platform. Here at Zenland, we are trying to bring the smart contract to the masses, and I have a few ideas I wanted to share with you. I see there are a lot of lending threads being open here. Most are with collateral assets such as bitcoin or other altcoins. Would it be useful to create a lending smart contract for users of BitcoinTalk?The idea I have in mind is 2 types of lending smart contracts - manual and automatic. I see a lending contract this way - the lender and the borrower create a draft contract specifying the collateral, interest and liquidation rate.Let's say the lender creates a contract and types how much he will lend for what interest rate under what collateral. If the borrower is satisfied with the terms, he approves the contract. Then the lender deploys the contract into the blockchain and transfers the agreed amount of stablecoins into the contract. For the borrower to get the money from the contract, he needs to transfer the agreed amount of collateral into the contract, and only then the contract allow to release of the lent money.Now it comes to these 2 types of contracts - manual and automatic, and I'm interested in what you think about it.Automatic: If the borrower is ready to repay the loan, he transfers the agreed amount of stablecoins with interest rate into the contract. He releases its collateral back into his wallet. The contract is finished and executed. Suppose the price drops below the liquidation rate specified by the lender at the beginning of contract creation. In that case, the lender clicks the \"Liquidation release\" button, and the collateral is released to the lender's wallet for him to sell and cover the expenses. The contract is finished and executed. Manual: The difference with the manual lending contract is that the lender would manually release the collateral. In liquidation, the release would happen manually with a Zenland agent if the borrower is unwilling to release the collateral to the lender for liquidation. What am I missing here? Did I cover all the possible issues? That's pretty much how other lending platforms work in DeFi, and I'm more interested in retail types of business when it happens p2p. And the main question is - would you be using these types of contracts? If not, then why?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445766",
  "comments": [
    {
      "author": "vv181",
      "created_time": "March 21, 2023, 01:10:45 PM",
      "body": "The smart contract you build specifically needs the collateral token/coin to be on the same chain or network. That won't work for some lenders or borrowers. If I want to lend a bitcoin, how do you(the smart contract) make sure it stayed as it is, without wrapping it to another token, say, WBTC? it applies to another altcoin, Monero or anything that isn't tied to what the smart contract platform is built on. Last but not least, as you stated by yourself that it is just the same as other lending platforms within defi, what makes your platform better than the others?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Diornov",
      "created_time": "March 23, 2023, 07:15:05 AM",
      "body": "Quote from: vv181 on March 21, 2023, 01:10:45 PMThe smart contract you build specifically needs the collateral token/coin to be on the same chain or network. That won't work for some lenders or borrowers. If I want to lend a bitcoin, how do you(the smart contract) make sure it stayed as it is, without wrapping it to another token, say, WBTC? it applies to another altcoin, Monero or anything that isn't tied to what the smart contract platform is built on. Last but not least, as you stated by yourself that it is just the same as other lending platforms within defi, what makes your platform better than the others? Yes, you are right. The only way would be to use wrapped tokens on the same blockchain network. I understand that from the perspective of bitcoin maximalists, PoS blockchains don't have enough trust with their censorship and anonymity issues. I'm not talking about decentralization since most of the tokens in \"smart contract\" blockchains are owned by a small group of people tightly connected to the project's founders. I'm just trying to build something useful with the resources that I have now. Because I believe that smart contracts are the future, even though we don't have a blockchain that we can all trust to. The second question, the difference between other lending platforms such as MakerDAO or Aave is that they have strict policies on what collateral on what interest rate you can lend and borrow (pretty much like banks) and usually everything is contained in 1 smart contract, but in my mind, I have an idea where 2 people can create and deploy a lending smart contract with the terms that only both of them agree. I mean, without big web3 companies, they can deploy the separate contract only with the terms they mutually benefit from. For example, the minimum collateral in Oasis App is 175%, but I have seen in the bitcointalk some people are willing to accept collateral as low as 130%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 23, 2023, 11:10:45 AM",
      "body": "Quote from: Diornov on March 23, 2023, 07:15:05 AMI understand that from the perspective of bitcoin maximalists, PoS blockchains don't have enough trust with their censorship and anonymity issues. Other than that, I think there are other issues. For example, compared to existing alternatives such as using a multi-sig to secure the loan (if it is a collateralized loan), your solution would add another insecure layer. If it is an uncollateralized loan, then the lender can easily solve this by limiting the criteria for borrowers. While your solution can help them reach other lenders, there is not enough incentive to take that risk compared to what we have right now. At least that's how I see it when I lend to somebody here.Quote from: Diornov on March 23, 2023, 07:15:05 AMThe second question, the difference between other lending platforms such as MakerDAO or Aave is that they have strict policies on what collateral on what interest rate you can lend and borrow (pretty much like banks) and usually everything is contained in 1 smart contract, but in my mind, I have an idea where 2 people can create and deploy a lending smart contract with the terms that only both of them agree. I mean, without big web3 companies, they can deploy the separate contract only with the terms they mutually benefit from. For example, the minimum collateral in Oasis App is 175%, but I have seen in the bitcointalk some people are willing to accept collateral as low as 130%. Your idea is similar to Kanpeki then. Last time I checked, not that many users are using the to borrow/lend, probably because most of the users are just looking to earn more profit by depositing funds to some lending pool instead of manually finding contracts and funding them. Try to check them out and see if you can improve on their model, who knows maybe you can find customers for alts lending.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Diornov",
      "created_time": "March 24, 2023, 08:56:19 AM",
      "body": "Quote from: joniboini on March 23, 2023, 11:10:45 AMOther than that, I think there are other issues. For example, compared to existing alternatives such as using a multi-sig to secure the loan (if it is a collateralized loan), your solution would add another insecure layer. If it is an uncollateralized loan, then the lender can easily solve this by limiting the criteria for borrowers. While your solution can help them reach other lenders, there is not enough incentive to take that risk compared to what we have right now. At least that's how I see it when I lend to somebody here.There are a few risks with current lending contracts on BitcoinTalk. First, even though both parties use a multisig wallet to secure the collateral if the liquidation price would reach, the borrower may decide not to share the signature just for the sake of argument. In addition, it's not giving the rights to lender to scam the borrower if he decides to sell the collateral immediately after receiving it to make a 30% profit. Quote from: joniboini on March 23, 2023, 11:10:45 AMYour idea is similar to Kanpeki then. Last time I checked, not that many users are using the to borrow/lend, probably because most of the users are just looking to earn more profit by depositing funds to some lending pool instead of manually finding contracts and funding them. Try to check them out and see if you can improve on their model, who knows maybe you can find customers for alts lending.Kanpeki Finance is still more B2C, but I'm talking about C2C (How currently Zenland Escrow Platform operates). With every new lending agreement, 2 users deploy a new contract into the blockchain. But I agree that there's not enough demand for services like this. As you said, it's easier for users to deposit their money to some DeFi business and get their interest rates rather than finding people directly on forums and creating contracts with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "March 24, 2023, 12:39:41 PM",
      "body": "Quote from: Diornov on March 24, 2023, 08:56:19 AMBut I agree that there's not enough demand for services like this. As you said, it's easier for users to deposit their money to some DeFi business and get their interest rates rather than finding people directly on forums and creating contracts with them.I don't know what percentage other than bitcoin that most lenders here accepting and what kind of problem they encounter, but have you tried to ask them in regard to your product? It would be the best idea to directly ask them to get a better concept of whether they all really need it or not. I think even if they all thought your platform might be has some utility, it is still a niche, the lenders/borrowers on here. So yea, the scale of usage won't be enormous, I don't know which else of the market specifically need this kind of solution. And it is also limited to a specific blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 04, 2023, 09:59:56 AM",
      "body": "Well Zenland After you do Escrow I would agree if you build a mechanism like this. The loan board usually transfers dozen money in and out Through Bitcoin network or USDT Trc 20 so make sure these two chain included in your program. Oh one more thing after you finish build-up don't forget to open paid Review",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelonmusk",
      "created_time": "April 22, 2023, 12:15:02 PM",
      "body": "Personally, Zenland smart contract seems like you've considered a lot of the potential scenarios and how the contracts would work in those cases.However, you might want to think about the trust factor in these contracts. For instance, how would you ensure that the borrowers and lenders trust each other, especially in the manual contract scenario where a Zenland agent gets involved! In my mind, you would need to establish a reliable reputation system or some form of identity verification. Additionally, I think it's essential to consider the regulatory environment and how it might affect the implementation of these smart contracts. Depending on the jurisdiction, there may be legal implications or requirements to comply with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}