{
  "id": "topic_5422908",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "November 23, 2022, 10:09:05 PM",
  "content": "QuoteThe European Union may be stepping up its regulatory actions in the privacy sector.Key TakeawaysThe European Union reportedly has plans to restrict or ban the use of privacy coins in its jurisdiction.The thinking behind the potential ban appears to be primarily concerned with money laundering.As on-chain surveillance becomes more sophisticated and legislators on both sides of the Atlantic become increasingly vigilant, the case for privacy-preserving cryptocurrencies is ever more apparent.The European Union is said to be mulling a ban on privacy coins, including Monero (XMR), Zcash (ZEC), and Dash (DASH).Leaked DocumentEU legislators are working on an anti-money laundering policy proposal prohibiting banks and crypto providers from interacting with privacy coins, according to an anonymous EU diplomat who reportedly revealed the plans to CoinDesk.If enacted, the policy would effectively blacklist a host of popular cryptocurrencies, including Monero (XMR), Zcash (ZEC), and Dash (DASH).In March, the European Parliament forwarded legislation to impede transactions between exchanges and unhosted wallets. The parliament now seems prepared to escalate restrictions against anonymity in crypto.In a draft of the legislative proposal dated November 9, initially reported by CoinDesk, the body said: “Credit institutions, financial institutions and crypto-asset service providers shall be prohibited from keeping…anonymity-enhancing coins.”The draft is believed to have been drafted by Czech officials and has since been shared among its 26 member states. As of yet, the privacy-busting proposal has yet to be made official.Privacy In Trouble?Earlier this month, Crypto Briefing spoke with Zcash CEO Josh Swihart to gain an insider perspective on the challenges and opportunities within the privacy coin sector. Swihart told us that public blockchains are a serious security risk for individual users and corporations.“If I’m a business accepting cryptocurrency natively, not through a third-party intermediary, I can’t afford to let my competitors see all of that [personal] information,” said Swihart. “Not only the information about my business—what’s coming in and out—but information about my customers who may be transacting with me online or using cryptocurrency. So I expect there to be a tipping point where there’ll be a flood of demand.”Swihart expects that the demand for privacy coins will become increasingly urgent as “now you have all kinds of crypto surveillance companies, Chainalysis and others, that are not only tracking transactions in order to look at flows, but they tag addresses.”It is possible that regulators and ever more sophisticated on-chain surveillance could catalyze increased demand for privacy coins. Ironically, regulators could argue for privacy coins rather than kill them off.  That’s a lesson that might apply equally to regulators in the US. The recent blacklisting of Tornado Cash by the US Treasury Department’s Office of Foreign Assets Control (OFAC) is one such example.“There’s healthy concern about the direction in which regulatory conversations have been going,” Swihart told us. “I think what OFAC did was a massive overreach.”https://cryptobriefing.com/eu-moving-to-ban-privacy-coins-report/....Interesting excerpt:QuoteEarlier this month, Crypto Briefing spoke with Zcash CEO Josh Swihart to gain an insider perspective on the challenges and opportunities within the privacy coin sector. Swihart told us that public blockchains are a serious security risk for individual users and corporations.If a poll asked crypto users to rank public blockchains as a security risk on a scale of 1 to 10. What would the result be? Is Swihart correct in believing that there will be a rising demand for privacy coins in the future? In the past, there has also been considerable debate on whether dash should be considered a privacy coin.Recently spain and portugal have introduced visa programs for digital nomads to reside in country. Could further regulation of crypto deter digital nomads from migrating into the EU. Making other options such as puerto rico and the caribbean more attractive?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422908",
  "comments": [
    {
      "author": "rokok lokal",
      "created_time": "November 24, 2022, 04:04:57 AM",
      "body": "So will the privacy coin disappear like a whisper on the wind? Reports that the EU will move to ban them come with a few hitches. The ban will not officially take effect until a proper regulatory framework around cryptocurrencies has been established by the EU. I'm sure that the privacy coin is here to stay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 24, 2022, 04:07:02 AM",
      "body": "Why does public blockchain has a serious security to individual users or corporations? if you're never expose your KYC to any exchanges or platform, you will be fine since no one know your name, your face and where you live. This is why privacy is important and to achieve it you need to use decentralized coin e.g. Bitcoin, use DEX e.g. Bisq and use reputable Bitcoin mixer. I already expect many country will ban privacy coins since Coinbase already delist privacy coins from few years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 26, 2022, 03:16:17 PM",
      "body": "This may be in some way imposing an obligation on all member states to prohibit trading with so-called privacy coins, but that does not mean that such business practices do not already exist in some states. I live in the EU and a few years ago all domestic crypto exchanges in my country removed privacy coins because the regulatory agency advised them to do so. Quote from: Hydrogen on November 23, 2022, 10:09:05 PMRecently spain and portugal have introduced visa programs for digital nomads to reside in country. Could further regulation of crypto deter digital nomads from migrating into the EU. Making other options such as puerto rico and the caribbean more attractive? The Caribbean is always attractive compared to any country in the EU, but these digital nomads are not exclusively connected to cryptocurrencies, so I don't see them giving up on Portugal or Spain because privacy coins would be banned. In addition, the world is a global village, you can currently be anywhere and receive payments in privacy coins and sell them for fiat on any DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 26, 2022, 03:48:29 PM",
      "body": "When the whole whole purpose of privacy coins is to escape regulations i totally understand why regulators are coming after them. And all this could be avoided. Funny thing about Zero Knowledge systems is that with that technology, wallets and transactions could be auditable, yet confidential, as that's the whole gimmick in ZK tech.Problem is that most of the devs aren't interested to comply with regulators, but to fight them so this is what happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 26, 2022, 04:45:06 PM",
      "body": "Quote from: o48o on November 26, 2022, 03:48:29 PMProblem is that most of the devs aren't interested to comply with regulators, but to fight them so this is what happens.That's the point of using privacy coins as crypto Ethos. Now that governments are trying to capture crypto all because of the FTX failure. With what is happening to Metamask such as collecting IP addresses, I think Swihart is right about the demand for privacy coins going to rise but this will also make the EU government aggressive in regulating crypto and banning privacy coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "November 26, 2022, 05:52:09 PM",
      "body": "Public blockchains are a security risk to corporations? No problem. We'll just give them CBDC so no need for privacy coins at all - EUI just made that statement up but that's probably what these regulators have in mind. They're not content with their previous policies to curb money laundering and push for more transparency and government control so they now move with the ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 26, 2022, 08:35:36 PM",
      "body": "Quote from: Plaguedeath on November 24, 2022, 04:07:02 AMWhy does public blockchain has a serious security to individual users or corporations?OP meant private blockchain and not public blockchain! It is not a security concern to the individuals or corporations! It is a security concern to the government. Individuals rather wants such kind of privacy protection which can be achieved by privacy coins and that's what EU is planning to attack. They are citing reasons such as money laundering and terrorism financing. But the main point is that privacy coin can't be tracked or controlled by the governments. Quoteif you're never expose your KYC to any exchanges or platform, you will be fine since no one know your name, your face and where you live. This is why privacy is important and to achieve it you need to use decentralized coin e.g. Bitcoin, use DEX e.g. Bisq and use reputable Bitcoin mixer. I already expect many country will ban privacy coins since Coinbase already delist privacy coins from few years ago.Privacy coins are absolutely a no-no from the government agencies. So it is just the beginning. Expect more attacks on the privacy coins or blockchain in future from many other governments alongside EU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "November 26, 2022, 08:37:30 PM",
      "body": "It won’t be easy even for EU to place a ban on privacy coin. Like the name implies it’s a coin that supports privacy and would most like also support anonymity, security and it’s should also be decentralized.The government has always felt threatened by coins that possess such properties. It’s hand to regulate or track privacy coins and it’s uses, but this many be the litmus test because if they go ahead only camouflage privacy coin would be exposed and go down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 26, 2022, 10:29:26 PM",
      "body": "Quote from: cabron on November 26, 2022, 04:45:06 PMThat's the point of using privacy coins as crypto Ethos.-cut- Yeah, i know and that's the problem, if devs won't be adjusting their ideology. If they are not going to be complying with regulators, privacy coins will be next to worthless soon. Quote from: cabron on November 26, 2022, 04:45:06 PMNow that governments are trying to capture crypto all because of the FTX failure.FTX wasn't the reason for getting rid of privacy coins. Reason is FATF travel rule and it's been in motion for a very long time now. That's why so many exchanges have already delisted them. Case FTX probably accelerated the timeline on regulations, but privacy coins weren't the issue with FTX and that's not why they are investigated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "November 26, 2022, 10:59:45 PM",
      "body": "Quote from: BIT-BENDER on November 26, 2022, 08:37:30 PMIt won’t be easy even for EU to place a ban on privacy coin. Like the name implies it’s a coin that supports privacy and would most like also support anonymity, security and it’s should also be decentralized.For personal usage yes it is kinda hard for the authority but the authority can implement a ban on privacy coins and force central exchanges to comply in banning these privacy coins.  I believe it isn't intention of EU to shutdown the network of Privacy coin but rather ban it to centralized exchanges and alike.Quote from: BIT-BENDER on November 26, 2022, 08:37:30 PMThe government has always felt threatened by coins that possess such properties. It’s hand to regulate or track privacy coins and it’s uses, but this many be the litmus test because if they go ahead only camouflage privacy coin would be exposed and go down. Well they are too concerned of money laundering and supporting terrorist and illegal activities so as much as possible they wanted everything under their supervision or traceable.  And privacy coins is one of those that they cannot trace or supervise so they have to ban it in order for the privacy coins to not promulgate in their jurisdiction.Quote from: rokok lokal on November 24, 2022, 04:04:57 AMSo will the privacy coin disappear like a whisper on the wind? Reports that the EU will move to ban them come with a few hitches. The ban will not officially take effect until a proper regulatory framework around cryptocurrencies has been established by the EU. I'm sure that the privacy coin is here to stay.No privacy coins will continue to exist.  Each country's government is too restricted to its own jurisdiction so its decision is only applicable to its country and the country that they have extraterritorial jurisdiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 27, 2022, 07:10:12 AM",
      "body": "Quote from: avikz on November 26, 2022, 08:35:36 PMQuote from: Plaguedeath on November 24, 2022, 04:07:02 AMWhy does public blockchain has a serious security to individual users or corporations?OP meant private blockchain and not public blockchain! It is not a security concern to the individuals or corporations! It is a security concern to the government. Individuals rather wants such kind of privacy protection which can be achieved by privacy coins and that's what EU is planning to attack. They are citing reasons such as money laundering and terrorism financing. But the main point is that privacy coin can't be tracked or controlled by the governments. You should read again Swihart's statement on OP since it is indeed a public blockchain in the context, specifically in a business manner where every business's transactions are available publicly.The problem for the user is almost similar. I don't want everyone could see of what I'm doing, of what I transact, of how I spend my money. And that is where privacy is essential in some respect. A public blockchain is where the transaction is available publicly, even if there is a way to minimize it, or simply a way to not be tied to an RL identity, using it without carefulness might leak a handful of information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "November 27, 2022, 08:22:35 AM",
      "body": "Quote from: Plaguedeath on November 24, 2022, 04:07:02 AMI already expect many country will ban privacy coins since Coinbase already delist privacy coins from few years ago.Why would you expect them to ban these private coins, if you really want to use decentralized coins to protect your privacy then you should also support the existence of private coins private? Once they have succeeded in banning privacy coins like XMR, Zcash then most likely they will also find a way to ban decentralized coins like bitcoin because they want a centralized and visible world. They are trying step by step to control this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 27, 2022, 01:12:05 PM",
      "body": "Quote from: Tony116 on November 27, 2022, 08:22:35 AMQuote from: Plaguedeath on November 24, 2022, 04:07:02 AMI already expect many country will ban privacy coins since Coinbase already delist privacy coins from few years ago.Why would you expect them to ban these private coins, if you really want to use decentralized coins to protect your privacy then you should also support the existence of private coins private? Once they have succeeded in banning privacy coins like XMR, Zcash then most likely they will also find a way to ban decentralized coins like bitcoin because they want a centralized and visible world. They are trying step by step to control this market.Just because people in here follow the news to confirm that yes, governments are getting privacy coins banned doesn't mean they are supporting it. He literally said that \"why privacy is important\". Most of people in here are for privacy.And yes they technically could ban Bitcoin/altcoins from CEX as well for numerous reasons. But as normal blockchains are transparent, they don't need to do that for AML reasons. They are going to make wallet kycs mandatory though. And if someone doesn't partake in this, they will just get rejected from CEX:es that are complying with regulators.If you want to actually support privacy coins you should contact your congressman / representative and explain them about crypto, or/and vote for people that are for privacy. Although only privacy with auditability will be the one that most likely survives this as RegDeFI will be the future on this no matter what we want, not anonymity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "November 28, 2022, 08:20:43 AM",
      "body": "Absolutely expected! Unfortunately, almost any product can be used both for the benefit of people and for harm. Cryptocurrencies are no exception. In addition to technological advantages and new opportunities, cryptocurrency has become a \"solution\" for criminals of all stripes - from drug dealers to totalitarian or terrorist regimes who want to use cryptocurrency as a mechanism to evade control, circumvent sanctions, etc. Therefore, unfortunately, there are such laws",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "November 28, 2022, 09:33:35 AM",
      "body": "Quote from: DrBeer on November 28, 2022, 08:20:43 AMAbsolutely expected! Unfortunately, almost any product can be used both for the benefit of people and for harm. Cryptocurrencies are no exception. In addition to technological advantages and new opportunities, cryptocurrency has become a \"solution\" for criminals of all stripes - from drug dealers to totalitarian or terrorist regimes who want to use cryptocurrency as a mechanism to evade control, circumvent sanctions, etc. Therefore, unfortunately, there are such lawsWhat you say is man-made behavior and not crypto or any technological product that causes such things, all products are created for good purposes, but people use them in the wrong way. Without crypto, criminals still use other forms of alternatives and they have never dropped even without crypto. I don't expect them to get rid of privacy coins because they are really good in a way but it's inevitable, sooner or later privacy coins will disappear from the market altogether.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 28, 2022, 10:25:28 AM",
      "body": "Quote from: ETFbitcoin on November 28, 2022, 09:39:57 AMBut if complying means removing most privacy feature or make it centralized, popularity of those privacy coin would be reduced either way.By complying i mean removing the element of using anonymity to escape regulations.I am sure that you know how zero knowledge works. But in case you don't you can literally prove and audit everything without revealing anything important. Keeping everything private while being decentralized, permissionless but auditableQuote from: ETFbitcoin on November 28, 2022, 09:39:57 AMAnd most criminal probably would ignore the ban while many citizen hesitate to continue holding one of those privacy coins.And how would that ignoring and holding coins help excatly if you can't turn those coins to fiat money or convert into anything wortwhile without raising flags?So far this has been possible via money laundering but these new laws that are coming are excatly for preventing that.You can google RegDeFi if you want to learn more about what i am referring to. I understand the bigger picture but technically speaking most of this upcoming tech goes over my head.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "November 28, 2022, 10:47:50 AM",
      "body": "I don't know, man.  It seems like a very short leap from banning/restricting privacy coins to banning/restricting any cryptocurrency up to and including bitcoin itself.  Makes sense, right?These fucking government bureaucrats aren't at all concerned about money laundering in the context of privacy coins.  Do they know there's a problem there to begin with, and how would they even get the data on that?Just like in the US with its brand-new 80,000 IRS agents, the EU wants control over the money you spend whilst keeping their octopus hands in every pocket their citizens keep money in.  My only question is how to fight this nonsense.  Is anyone even trying to?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 28, 2022, 03:00:52 PM",
      "body": "meanwhile in america. banning privacy enhanced coins/tokens and even tools has been a thing for a whileprivacy enhanced coins like XMR, ZEC, dash wont be found on american exchanges like coinbase. but will be found on taiwan exchanges like bitfinex (both coinbse and bitfinex are the DCG family)and yes lightning network is treated as a privacy enhancing toolso although created and envisioned by employees of the DCG. privacy enhanced tooled like LN wont be found on american exchanges like coinbase. but will be found on taiwan exchanges like bitfinex (both coinbse and bitfinex are the DCG family)american regulated exchanges also treat any normal coin where the taint can be seen as being used by a mixer before deposit. they treat that as suspicious activity toomeaning trying to be private on an exchange which by its own regulatory law of the bank secrecy act and anti money laundering. will make the exchanges watchout particular for users whom use privacy tools",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "November 29, 2022, 08:23:37 AMLast edit: November 29, 2022, 09:11:41 AM by DrBeer",
      "body": "Quote from: Minecache on November 28, 2022, 09:33:35 AMWhat you say is man-made behavior and not crypto or any technological product that causes such things, all products are created for good purposes, but people use them in the wrong way. Without crypto, criminals still use other forms of alternatives and they have never dropped even without crypto.I don't expect them to get rid of privacy coins because they are really good in a way but it's inevitable, sooner or later privacy coins will disappear from the market altogether.I partly agree. But creating something new, we always run the risk, in confirmation of your words, that this new one will be used for illegal or criminal purposes.It's just that in the modern world, where there is a global confrontation between an adequate world, and all kinds of criminal and anti-human regimes and global criminal structures, such decisions will be expected to be used for criminal purposes. Or to reduce the \"harm\", for example, to countries of international terrorists, from sanctions. But globalization and interaction of civilized systems allows minimizing such \"moves\". I am sure that altcoins like Monero will fall under strict control. The control of the movement of other funds will remain under supervision.The only question - for you personally, what are the advantages of anonymous currencies, provided that you pay all your life with a 100% deanonymized card?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}