{
  "id": "topic_5407159",
  "title": "Question:",
  "author": "dragonvslinux",
  "created_time": "July 21, 2022, 01:51:07 PMLast edit: September 10, 2023, 12:58:26 PM by dragonvslinux",
  "content": "As can be seen when zooming into the Realized Price chart, Bitcoin closed it's first day back above this level on July 18th after falling below on June 13th.After realized price reached a high of around $24.5K in April this year, it has since declined to around $22K as people started to sell for a loss.In the past, a recovery above realized price has signalled the bottom for Bitcoin in 2019 as well as 2020, however in 2012 and 2015 price fell back below this level.This means that after reaching a Net Unrealized Profit/Loss of -19%, this NUPL is back above 0%, suggesting the capitulation has ended and it's time to be hopeful again.Do you think the capitulation is now over and we have entered the hope/fear stage as this indicator suggests, or will price capitulate further? Related topics:Was $17.5K the low? | Weekly RSI leaving oversold conditions |  Is Bitcoin bottom there yet? Fear & Greed, Pi Cycle Top / Bottom",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407159",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "July 21, 2022, 01:59:14 PM",
      "body": "Experienced traders know how they can trade in a way both sideways will favour them. Holders believe in buying and holding for long and they will make profit if they invest after massive bear market. Because of that, i prefer to just hold, but not all, as the price continue to decrease, the more I will buy and invest. I think the price of bitcoin is still going down below $20000 again and I think this year will not favour bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "July 21, 2022, 05:50:08 PM",
      "body": "When i saw Bitcoin reached 24k i was happy and i never think that price will drop again , but just a sudden i saw Bitcoin going down and now it on the state of 22k. I just call what happened to bitcoin as the beginning of cryptocurrency correction in the market. Is not surprised to me that Bitcoin will grow again after this falling and i believe that as it leave the values of 17k it will not fall back to such value again, the little increase Bitcoin just experience investors are happy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "July 21, 2022, 08:39:55 PM",
      "body": "Quote from: dataispower on July 21, 2022, 05:50:08 PMWhen i saw Bitcoin reached 24k i was happy and i never think that price will drop again , but just a sudden i saw Bitcoin going down and now it on the state of 22k. I just call what happened to bitcoin as the beginning of cryptocurrency correction in the market. Is not surprised to me that Bitcoin will grow again after this falling and i believe that as it leave the values of 17k it will not fall back to such value again, the little increase Bitcoin just experience investors are happy It looks like the momentary hype of Bitcoin that causes it to surge a bit had died down.  I still wondering if there is more news other than the China bank scandal and the FED rate-hike meeting speculation that pushes the Bitcoin price to $24k.  I am also wondering if the current surge to $24k is the correction of Bitcoin after it drops when Tesla has completely liquidated the 75% of its BTC holdings?  Aside from these three big news, I can't find anything that will trigger another rally of Bitcoin in the coming days.  So I think, the current price won't be sustainable and we might see another downtrend in the next days unless there is another news that might brighten the Bitcoin market sentiment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 21, 2022, 09:54:30 PMLast edit: July 22, 2022, 09:54:10 AM by stompix",
      "body": "Quote from: dragonvslinux on July 21, 2022, 01:51:07 PMAs can be seen when zooming into the Realized Price chart,I was really curious what this \"realized\" price means so...QuoteFinally, to be technically correct and also explain an assumption in the above statements, Realized Price values each UTXO not on its current value, but on the value when it last moved from one wallet to another. We are assuming that movement from one wallet to another wallet is bitcoins being ‘bought’.Leaving some exchnages which might move thousands from one cold wallet to another without any \"purchase\" being done, I'm quite curious how chips going though Chipmixer affect this since there is one move in the past that was already counted weeks ago, one move of funds to the mixer and a third one the reclaiming, all from different wallets, none of them involving a purchase..Well, nice try, and merited for the effort but just like the rainbow chart, this is just something that can't predict or tell a thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "July 21, 2022, 10:37:32 PMLast edit: July 21, 2022, 10:59:34 PM by Sandra_hakeem",
      "body": "Quote from: stompix on July 21, 2022, 09:54:30 PMWell, nice try, and merited for the effort but just like the rainbow chart, this is just something that can't predict or tell a thing.Absolutely,I think it can't.Personally, predictions are almost impossible because the volatility of the market is so high that it doesn't even take days to fall as usual; an upward movement is imperative but it's not guaranteed for now. Alot of investors have pulled out thier cash at a loss and alot more are also investing, IMO, I think it's gonna take a little time before going up the chart.Whales are on thier feet and of course, they have a resounding influence on the market.Sandra",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "July 21, 2022, 11:18:03 PM",
      "body": "Well, I don't see any huge changes happening in the market because since January and when the bear hits the market, this is the price we usually see, it pumps for a few days and it drops again. I couldn't find it was if that was a sort of manipulation or not, but we are probably aware of the situation already. This is literally what gonna happen this bearish time, we can never expect it will going to rally fast but instead, we expect more on declining moments rather than uptrend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 21, 2022, 11:25:56 PM",
      "body": "Oh man, it's really hard to say when we have reach capitulation or not. It could be that above $22k is a magic number, but we all know how volatile and fragile the market is right now.Although one indication that we might bring some in the picture is the news that Tesla reportedly sold 75% of it's BTC holding and it didn't affect the market that much. I mean if you look at, it was really a bad news. Perhaps investors doesn't care and are done with Elon or we are really in a sort of mini bull run this July.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "July 22, 2022, 04:12:10 AM",
      "body": "Quote from: dragonvslinux on July 21, 2022, 01:51:07 PMDo you think the capitulation is now over and we have entered the hope/fear stage as this indicator suggests, or will price capitulate further? Well there is another situation now as Tesla had been in effect to selling their Bitcoin and this is another news nowadays.so i may not believe this to be staying in 22k  because there will be a big effect for this case .if this come to continue happening then maybe bitcoin will climb more than what many expected.but I know that we are facing good position now so yes there might be an increase but nobody knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davian144",
      "created_time": "July 22, 2022, 05:46:53 AM",
      "body": "Quote from: dragonvslinux on July 21, 2022, 01:51:07 PMAs can be seen when zooming into the Realized Price chart, Bitcoin closed it's first day back above this level on July 18th after falling below on June 13th.After realized price reached a high of around $24.5K in April this year, it has since declined to around $22K as people started to sell for a loss.I still hold Bitcoin today and won't sell at a loss because I still have very high faith in Bitcoin so it's still good to keep it now and wait for a better price than it looks right now.I did this because in the last year I have seen some people who regretted selling Bitcoin too quickly at a low price so that they could not reap any profit when Bitcoin reached its ATH last year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "July 22, 2022, 08:00:04 AM",
      "body": "Quote from: Oshosondy on July 21, 2022, 01:59:14 PMExperienced traders know how they can trade in a way both sideways will favour them. Holders believe in buying and holding for long and they will make profit if they invest after massive bear market. Because of that, i prefer to just hold, but not all, as the price continue to decrease, the more I will buy and invest. I think the price of bitcoin is still going down below $20000 again and I think this year will not favour bitcoin price. Yes I too do the same.I am a type of people who likes to hold their Bitcoins. I have seen in the couple of hours many have made thousands by just selling and buying the coins, but still for a long term trader like me, it will suitable to hold for long time.And yes finally Bitcoins have shown some green trend compare to few days. If it continues to grow like this for the next couple of days, then I am sure it will come out of the resistance and soon will recover.Nevertheless we need to just wait for few more weeks to see BTC back in action again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "July 22, 2022, 08:57:32 AM",
      "body": "Quote from: Oshosondy on July 21, 2022, 01:59:14 PMExperienced traders know how they can trade in a way both sideways will favour them. Holders believe in buying and holding for long and they will make profit if they invest after massive bear market.Yes, it always is.Quote from: Oshosondy on July 21, 2022, 01:59:14 PMBecause of that, i prefer to just hold, but not all, as the price continue to decrease, the more I will buy and invest. I think the price of bitcoin is still going down below $20000 again and I think this year will not favour bitcoin price.Buy on dips? That's good. I agree with that strategy because in fact you have taken advantage of the opportunity to buy bitcoin at a lower price. Accumulating bitcoins over the long term by buying on dips is a great way to maximize profits in the long term. You will agree on some good areas to buy, but always try not to be too greedy and dca is still important to consider. I still think the bear market has remained throughout the year even though currently bitcoin has risen to $22K. Next we don't know exactly, but not sure about $30K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "July 22, 2022, 10:10:46 AM",
      "body": "Quote from: Nrcewker on July 22, 2022, 08:00:04 AMQuote from: Oshosondy on July 21, 2022, 01:59:14 PMExperienced traders know how they can trade in a way both sideways will favour them. Holders believe in buying and holding for long and they will make profit if they invest after massive bear market. Because of that, i prefer to just hold, but not all, as the price continue to decrease, the more I will buy and invest. I think the price of bitcoin is still going down below $20000 again and I think this year will not favour bitcoin price. Yes I too do the same.I am a type of people who likes to hold their Bitcoins. I have seen in the couple of hours many have made thousands by just selling and buying the coins, but still for a long term trader like me, it will suitable to hold for long time.And yes finally Bitcoins have shown some green trend compare to few days. If it continues to grow like this for the next couple of days, then I am sure it will come out of the resistance and soon will recover.Nevertheless we need to just wait for few more weeks to see BTC back in action again.As other's have said, bitcoin investment is a journey like a marathon and not a sprint. So it's better to be a wise investors, going long term is the thing for us, doesn't complicate our lives and just buy during the dip and hold.Regarding the question, we all have been asking the same for months and we have seen many threads about it. Most of the time we wanted to believed that it is over based on the charts presented. But there will be time that it might divert and go on another path and we don't know what is going to happen next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 22, 2022, 02:11:00 PM",
      "body": "Quote from: stompix on July 21, 2022, 09:54:30 PMQuote from: dragonvslinux on July 21, 2022, 01:51:07 PMAs can be seen when zooming into the Realized Price chart,I was really curious what this \"realized\" price means so...QuoteFinally, to be technically correct and also explain an assumption in the above statements, Realized Price values each UTXO not on its current value, but on the value when it last moved from one wallet to another. We are assuming that movement from one wallet to another wallet is bitcoins being ‘bought’.Leaving some exchnages which might move thousands from one cold wallet to another without any \"purchase\" being done, I'm quite curious how chips going though Chipmixer affect this since there is one move in the past that was already counted weeks ago, one move of funds to the mixer and a third one the reclaiming, all from different wallets, none of them involving a purchase..For sure this indicator is far from perfect, it should really be \"realized price\" as opposed to the actual realized price. It definitely mis-counts all consolidation or breaking up of coins by the same owner, such as exchanges most notably. Fortunately exchanges move around coins so quickly (same day usually I noticed) that it wouldn't affect this \"realized price\" as much as you think it would. Ultimately it's not intended to be perfect, but rather suggest when are good buying opportunities (during capitulation) that it's reliably done for over a decade now. Quite simply, when more people appear to be selling at a loss rather than profit.Quote from: stompix on July 21, 2022, 09:54:30 PMWell, nice try, and merited for the effort but just like the rainbow chart, this is just something that can't predict or tell a thing.You say that, but 4 out of the 5 times the indicator has left the so-called capitulation level (>0%) then the bottom has been in; 2011, 2015, 2019 and 2020. Only in 2014 price re-capitulated after returning to \"hope/fear\". So in very simple statistics, without accounting for any other variables (as obviously this indicator doesn't do this), then it's only 80% accurate at best (4 out of 5 times correct). Maybe even 66% if it's wrong again this time around. So I agree, it can't 100% predict that the bottom is in, no indicator can do this as it can't account for future data, even those that have been 100% accurate up until now.A better example would be the Pi Cycle top/bottom currently seems like the most accurate with more data, but does this mean it can definitely predict a top or bottom? Of course not, that's not how statistics works. Just because it's correctly predicted all 4 major tops as well as both cycle bottoms, I'd still say it's only 85% accurate based on being wrong this time, as it's only based on 7 data points, 6 of which have been proven to be correct so far. Of course you could say this indicator is completely random and non sense, but statistically speaking, there's only about a 15% chance it's completely random, instead there's an 85% chance it's accurate. So I think this indicator in particular tells quite a lot, if it's accuracy is understood correctly, just like others that have been accurate in the past. Especially when there is confluence between them.Sometimes I do just feel people (not necessarily yourself) lack a basic understanding of statistics, thinking that one indicator or another can 100% predict a bottom, instead of realising the basics that it doesn't matter how accurate something has been up until now, it only makes it accurate to a certain percentage that will always by default be less than 100% (otherwise it wouldn't be statistical but a form of fortune telling).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 22, 2022, 03:14:12 PM",
      "body": "Quote from: dragonvslinux on July 22, 2022, 02:11:00 PMSometimes I do just feel people (not necessarily yourself) lack a basic understanding of statistics, thinking that one indicator or another can 100% predict a bottom, instead of realising the basics that it doesn't matter how accurate something has been up until now, it only makes it accurate to a certain percentage that will always by default be less than 100% (otherwise it wouldn't be statistical but a form of fortune telling).Ok, then let's test those statistics...Out of all your, how do we call them assumptions, predictions, analysis, coin tosses, drawing, how many have proven to be correct, statically speaking?Because I clearly remember how 30k was the bottom, 25k was the bottom and of course, I will never forget 100k by 2021!  The moment you nail 2/3 of the predictions it means just that the coin you're tossing is dented and you're lucky.Quote from: dragonvslinux on July 22, 2022, 02:11:00 PMYou say that, but 4 out of the 5 times the indicator has left the so-called capitulation level (>0%) then the bottom has been in; 2011, 2015, 2019 and 2020. Only in 2014 price re-capitulated after returning to \"hope/fear\". So in very simple statistics, without accounting for any other variables (as obviously this indicator doesn't do this), then it's only 80% accurate at best (4 out of 5 times correct). Oh yeah, it was 80% accurate, what an achievement, but there is one tricky thing about it, when was this \"indicator\" discovered? I have a feeling that it was in 2020  So it's not an indicator as much as a historic pattern, and if you can't figure the difference between those two you should go over the first sentence, I don't remember it well, you mentioned previously something about understanding statistics  Quote from: dragonvslinux on July 22, 2022, 02:11:00 PMFor sure this indicator is far from perfect, it should really be \"realized price\" as opposed to the actual realized price. It definitely mis-counts all consolidation or breaking up of coins by the same owner, such as exchanges most notably. Fortunately exchanges move around coins so quickly (same day usually I noticed) that it wouldn't affect this \"realized price\" as much as you think it would. Bruh, I just gave examples for exchanges, and if that is not enough then how about casinos? What about bitcoin tumblers? Do you know what volume can somebody trying to mix 1000 coins can generate? Today you have 300k coins getting transferred (not counting change), you honestly think even 10% of those 6 billion!!! are coins that have been \"purchased\" today?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 22, 2022, 04:18:16 PM",
      "body": "Quote from: rodskee on July 22, 2022, 04:12:10 AMWell there is another situation now as Tesla had been in effect to selling their Bitcoin and this is another news nowadays.so i may not believe this to be staying in 22k  because there will be a big effect for this case .if this come to continue happening then maybe bitcoin will climb more than what many expected.but I know that we are facing good position now so yes there might be an increase but nobody knows.Dood their selling has already been finished for a while now; assuming they won't be selling their remaining 25%. If there was any effect, it's already finished. What's going to be left is just the negativity due to the news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "July 22, 2022, 04:52:01 PM",
      "body": "Quote from: dataispower on July 21, 2022, 05:50:08 PMWhen i saw Bitcoin reached 24k i was happy and i never think that price will drop again , but just a sudden i saw Bitcoin going down and now it on the state of 22k.You shouldn't be surprised that Bitcoin price drops again and again because we are in the bearish season. Even Bitcoin price already increased above $23k lately, it has a chance to drop again below $20k. We are in Q3 of the first year of the bearish season, more drops are very possible to happen. I only think that the lowest price has been passed once Q2 of the next year is over. Quote from: Yamifoud on July 21, 2022, 11:18:03 PMWell, I don't see any huge changes happening in the market because since January and when the bear hits the market,Sure, there won't be a huge change in Bitcoin price. Once a huge change happens, it means the bearish season is over. It shouldn't be in this year, I am very sure that it is going to happen in the next year.IMO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 22, 2022, 05:02:49 PM",
      "body": "Quote from: mk4 on July 22, 2022, 04:18:16 PMQuote from: rodskee on July 22, 2022, 04:12:10 AMWell there is another situation now as Tesla had been in effect to selling their Bitcoin and this is another news nowadays.so i may not believe this to be staying in 22k  because there will be a big effect for this case .if this come to continue happening then maybe bitcoin will climb more than what many expected.but I know that we are facing good position now so yes there might be an increase but nobody knows.Dood their selling has already been finished for a while now; assuming they won't be selling their remaining 25%. If there was any effect, it's already finished. What's going to be left is just the negativity due to the news.Agreed. Tesla already keep there 25% of holdings as moon bag which they still have trust Bitcoin. They are just playing for any potential further events for things that only Elon knows. There’s a chance that this is connected to 3AC and Celsius meltdown recently. I believe this move Elon might trigger more fear for institutional investors side since they are all in loss at this moment. They just literally waiting for each other if someone will sell already. The only whales that I know will surely gonna hold is Microstrategy because he already all in on this crypto investment which is good for crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "July 22, 2022, 08:30:32 PM",
      "body": "Quote from: dataispower on July 21, 2022, 05:50:08 PMWhen i saw Bitcoin reached 24k i was happy and i never think that price will drop again , but just a sudden i saw Bitcoin going down and now it on the state of 22k. I just call what happened to bitcoin as the beginning of cryptocurrency correction in the market. Is not surprised to me that Bitcoin will grow again after this falling and i believe that as it leave the values of 17k it will not fall back to such value again, the little increase Bitcoin just experience investors are happy when I read the news about tesla selling their bitcoins and the price didn't drop drastically at that time I was relieved because bitcoin definitely won't fall again (below 20k)...but there are still predictions from some people that bother me, it is news about that this is just a fake bull. let's keep an eye on the market and always be prepared for market conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "July 22, 2022, 11:07:31 PMLast edit: June 11, 2023, 11:43:34 PM by STT",
      "body": "Useful perspective to have, I think we are more similar to 2015 or where the price action drags on in some negative fashion for an extended period of time.  Multiple challenges, ironically because FIAT is pressured.   Market is trying to challenge higher prices but its not making great progress immediately, I believe longer term it remains negative looking.    Short term however we do appear to retain a higher low price and can build on that to gain more in future.     We need to end this week and weekly bar above 24k to call a good positively  trending market.  If we lose 22k on a daily bar say, consider we have failed on a short term basis and most likely suffer a further reset.Funny thing is around 2012 I was impressed or somehow had my view changed by the endurance of BTC at that time.   I knew about it before then but had been too dismissive despite being involved in other ways but maybe the fight in the price and details now does similar so BTC gains further appreciation from parts of the global population who had previously been dismissive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}