{
  "id": "topic_5436623",
  "title": "MrBrightside1",
  "author": "MrBrightside1",
  "created_time": "January 24, 2023, 03:04:15 PM",
  "content": "HelloI wonder if some of you guys could investigate the negative feedback I received and closely read what I said and act accordingly (removing the negative feedback and also warn people that make false accusations).Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436623",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "January 24, 2023, 03:10:37 PM",
      "body": "1xbit is deemed as a gambling site that has no good reputation because of the bad history it has on this forum in which many users were scammed without getting their money back. Anyone that is linked to 1xbit on this forum, like promoters, joining 1xbit campaigns and account used to create 1xbit announcement threads are tagged with negative trust.Is JollyGood allegation true? I mean this:Quote\"MrBrightside1\" is a newbie claiming 1xbit sent him 10 BTC winnings but failed to provide evidence therefore is treated as a sock-puppet used to spread propaganda to promote the 1xbit scammers.You can click on your profile and click on 'trust' to see it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sujonali1819",
      "created_time": "January 24, 2023, 03:16:37 PM",
      "body": "Quote from: MrBrightside1 on January 24, 2023, 03:04:15 PMHelloI wonder if some of you guys could investigate the negative feedback I received and closely read what I said and act accordingly (removing the negative feedback and also warn people that make false accusations).Thank you.Only the man who gave you the feedback can help in this case. So I will suggest you to contact him personally and ask him to review your feedback. As I see the feedback was about 10 BTC withdrawal proof from 1xbit. I don't know why the OP did not provide the proof (it could be a privacy issue). But I can confirm that OP is really a super Highroller who is placing bets of more than 1 BTC in one bet in Blackjack.fun. So there is no confusion that OP is a Highroller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "January 24, 2023, 03:21:58 PM",
      "body": "Quote from: sujonali1819 on January 24, 2023, 03:16:37 PMBut I can confirm that OP is really a super Highroller who is placing bets of more than 1 BTC in one bet in Blackjack.fun. So there is no confusion that OP is a Highroller.Wow it's really interesting is he's not lying when he gamble on blackjack.fun, it might be possible if the @OP is legit here, although 1xbit is really known as scam casino and anyone who promote the casino will receive negative feedback from DT members.I think it's hard to prove if 1xbit is really pay your winnings.If you can sign a message of your deposit address which contain a lot of Bitcoin, it doesn't mean you're really a gambler and not from 1xbit's team.If you can provide screenshot of withdrawal and bet history on 1xbit, someone will say the image get photoshopped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 24, 2023, 03:59:53 PM",
      "body": "Quote from: sujonali1819 on January 24, 2023, 03:16:37 PMOnly the man who gave you the feedback can help in this case. Gotta love it when people have been here for as long as OP has and still don't know the basics of how things work.  True, he's not very active...but then again, since that's true I'm not sure what the big deal is with having a negative feedback.OP, it isn't likely that JollyGood is going to remove your feedback since he has very strong feelings against 1xbit as an entity and about their signature campaign, which I don't fault him for.  Making a claim that you won big but not providing evidence isn't a tag-worthy offense IMO, but again because 1xbit was mentioned JG shot the red paintball at you remorselessly.I'd wish you luck, but I don't and I'll instead suggest you lock this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "January 24, 2023, 04:10:15 PM",
      "body": "Quote from: Charles-Tim on January 24, 2023, 03:10:37 PMIs JollyGood allegation true? I mean this:Quote\"MrBrightside1\" is a newbie claiming 1xbit sent him 10 BTC winnings but failed to provide evidence therefore is treated as a sock-puppet used to spread propaganda to promote the 1xbit scammers.JollyGood doesn't link the reference well, so it's not immediately clear which OP's statement he's referring to. I found the closest one by searching.He claimed some big winnings, but he couldn't sign an address or a transaction to confirm ownership of the same, considering the previous negative history of 1xbit casino, everything really looks like shilling and giving fake feedback in their favour. Quote from: MrBrightside1 on August 08, 2021, 12:42:50 AMQuote from: Adzivu on August 07, 2021, 09:41:31 PMQuote from: MrBrightside1 on August 07, 2021, 05:43:49 PMARE YOU A FUCKING IDIOT? I DID POST THE TRANSACTION ID'S AND I TOLD THAT I DID NOT HAVE THE THIRD BECAUSE SOMEONE JUST HAS TO TELL ME HOW I CAN DO THAT. IF YOU CANT READ GET THE FUCK OUT OF HERE. CAN A MOD BAN THIS GUY FOR BEING STUPID? LOOK AT MY MESSAGE FROM August 04, 2021, 07:31:25 PMThe withdrawal of 10.16535000BTC ID is 8cb67fc8adc360b4e109018c5915986a61e286480720b674f2406bd77a0178f2The depo of 3 BTC ID was dc535244eded0701d8cf14af237bc0e49cf53195932d04694ebd26a1373332econ a side note, 1xbit offical could you maybe look again at my account, I did a 5 BTC depo, this is the ID e6c0dc1280797c21da4f495356055fdafa48fef8cb1762c875d7877274a52c84 but I havent received anything and I sent support an e-mail, but dont want to wait, if Ill ever have an answer because they are not the fastest/reliable unfortunately.Im having some problems with this quoting thing but I hope every1 knows what im sayinghttps://www.youtube.com/watch?v=LpAfuB7aZTgHere's the video how to sign a BTC message.OP, I guess, Jollygood will withdraw the negative tag if you sign a message on this address. btw. why did you wait this long to start this discussion?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 24, 2023, 04:11:29 PMLast edit: January 24, 2023, 04:29:17 PM by NeuroticFish",
      "body": "Quote from: Charles-Tim on January 24, 2023, 03:10:37 PMIs JollyGood allegation true? I mean this:Quote\"MrBrightside1\" is a newbie claiming 1xbit sent him 10 BTC winnings but failed to provide evidence therefore is treated as a sock-puppet used to spread propaganda to promote the 1xbit scammers.Well, I've looked up the story for you via ninjastic.space.OP has claimed here that there's a problem with an 1xbit withdrawal, and a big one, about 10 BTC.And after some discussions in all the directions, OP has claimed that his withdrawal (an even bigger one, since he has won some more) was processed. You can look up the discussion in between the two linked posts.Of course, these can be legit or not, the tx Id doesn't really prove anything. And since we know 1xbit reputation and some of us also know that 1xbit did orchestrate fake testimonials on the forum too, I am not surprised at all by that trust feedback.Sorry, OP, I don't say you're lying or not, I don't have any proof, but for my knowledge, the chances you lied there are bigger than the chances you were honest. Simple, cold math.Plus, as said, only JollyGood can remove his trust feedback; that's how trust feedback works.LE. Sorry @examplens if you feel I'm duplicating your finding, we were in paralel and I've added my thoughts too.Even later edit: @MrBrightside1: calling JollyGood an idiot certainly doesn't look good for your case",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "January 24, 2023, 04:17:09 PM",
      "body": "OP did post details of his deposit and withdrawal in this post https://bitcointalk.org/index.php?topic=5267172.msg57641033#msg57641033maybe we are just not used to seeing 1xbit actually sends out withdrawals since the accusation about them are too much. but if they are doing this, the users who are trying thier platform do not deserve to get red trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrBrightside1",
      "created_time": "January 24, 2023, 06:48:53 PMLast edit: January 24, 2023, 09:40:34 PM by Mr. Big",
      "body": "I mean, I get the whole distrust regarding 1xbit, Im also very wary with them. But I can't lie, if they actually paid me out, then it's the case, been always happy to provide anything they want.And if an idiot like jollygood is just going on a vendetta, well maybe there should be taken actions against a person who is an idiot (I have the proof to call him that, cfr the whole discussion). Imo he deserves to be banned from this forum.The reason I do this, because other people commented about it.And regarding credibility, I am the former (and only imo) rollbit boss, won the 2 first million dollar races on stake, also happy to prove that I am that person. Quote from: The Sceptical Chymist on January 24, 2023, 03:59:53 PMQuote from: sujonali1819 on January 24, 2023, 03:16:37 PMOnly the man who gave you the feedback can help in this case. Gotta love it when people have been here for as long as OP has and still don't know the basics of how things work.  True, he's not very active...but then again, since that's true I'm not sure what the big deal is with having a negative feedback.OP, it isn't likely that JollyGood is going to remove your feedback since he has very strong feelings against 1xbit as an entity and about their signature campaign, which I don't fault him for.  Making a claim that you won big but not providing evidence isn't a tag-worthy offense IMO, but again because 1xbit was mentioned JG shot the red paintball at you remorselessly.I'd wish you luck, but I don't and I'll instead suggest you lock this thread.and maybe not reading is also a big offense moronQuote from: examplens on January 24, 2023, 04:10:15 PMQuote from: Charles-Tim on January 24, 2023, 03:10:37 PMIs JollyGood allegation true? I mean this:Quote\"MrBrightside1\" is a newbie claiming 1xbit sent him 10 BTC winnings but failed to provide evidence therefore is treated as a sock-puppet used to spread propaganda to promote the 1xbit scammers.JollyGood doesn't link the reference well, so it's not immediately clear which OP's statement he's referring to. I found the closest one by searching.He claimed some big winnings, but he couldn't sign an address or a transaction to confirm ownership of the same, considering the previous negative history of 1xbit casino, everything really looks like shilling and giving fake feedback in their favour. Quote from: MrBrightside1 on August 08, 2021, 12:42:50 AMQuote from: Adzivu on August 07, 2021, 09:41:31 PMQuote from: MrBrightside1 on August 07, 2021, 05:43:49 PMARE YOU A FUCKING IDIOT? I DID POST THE TRANSACTION ID'S AND I TOLD THAT I DID NOT HAVE THE THIRD BECAUSE SOMEONE JUST HAS TO TELL ME HOW I CAN DO THAT. IF YOU CANT READ GET THE FUCK OUT OF HERE. CAN A MOD BAN THIS GUY FOR BEING STUPID? LOOK AT MY MESSAGE FROM August 04, 2021, 07:31:25 PMThe withdrawal of 10.16535000BTC ID is 8cb67fc8adc360b4e109018c5915986a61e286480720b674f2406bd77a0178f2The depo of 3 BTC ID was dc535244eded0701d8cf14af237bc0e49cf53195932d04694ebd26a1373332econ a side note, 1xbit offical could you maybe look again at my account, I did a 5 BTC depo, this is the ID e6c0dc1280797c21da4f495356055fdafa48fef8cb1762c875d7877274a52c84 but I havent received anything and I sent support an e-mail, but dont want to wait, if Ill ever have an answer because they are not the fastest/reliable unfortunately.Im having some problems with this quoting thing but I hope every1 knows what im sayinghttps://www.youtube.com/watch?v=LpAfuB7aZTgHere's the video how to sign a BTC message.OP, I guess, Jollygood will withdraw the negative tag if you sign a message on this address. btw. why did you wait this long to start this discussion?Well I provided already more than enough and even then, they will never accept it. I mean what is next, I get negative feedback because I dont buy him a plain ticket and let him sit to me when I open my ledger live?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "January 24, 2023, 07:13:18 PM",
      "body": "Sign a message. You can use Electrum to sign from your Ledger. Or send some dust from that address to a vanity (burn) address. It's easy to prove ownership, if you're the owner that is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrBrightside1",
      "created_time": "January 24, 2023, 07:15:54 PM",
      "body": "Quote from: LoyceMobile on January 24, 2023, 07:13:18 PMSign a message. You can use Electrum to sign from your Ledger. Or send some dust from that address to a vanity (burn) address. It's easy to prove ownership, if you're the owner that is.As mentioned, even then it wont be enough, because then I am just one of 1xbit their employees right?And I have no interest in burning anything for any1 of you morons.I actually wonder, what is bitcointalk these days, some whiny ass bitches who can't read?If this is what admins and mods allow, i also question them? Maybe some mods should also try and do their job?@Cyrus get your ass over here and start doing your job (no idea even how tagging works at this forsaken place).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 24, 2023, 07:24:30 PM",
      "body": "Quote from: examplens on January 24, 2023, 04:10:15 PMOP, I guess, Jollygood will withdraw the negative tag if you sign a message on this address. It can be a start, but I would not be surprised if JG will also ask 1xbit to prove the originating addresses are theirs.Or is there already a platform or anybody who can certify that those are their addresses?However, at least OP can indeed do his part, it's not that difficult.Quote from: examplens on January 24, 2023, 04:10:15 PMbtw. why did you wait this long to start this discussion?Good point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrBrightside1",
      "created_time": "January 24, 2023, 07:26:02 PM",
      "body": "Quote from: NeuroticFish on January 24, 2023, 07:24:30 PMQuote from: examplens on January 24, 2023, 04:10:15 PMOP, I guess, Jollygood will withdraw the negative tag if you sign a message on this address. It can be a start, but I would not be surprised if JG will also ask 1xbit to prove the originating addresses are theirs.Or is there already a platform or anybody who can certify that those are their addresses?However, at least OP can indeed do his part, it's not that difficult.Quote from: examplens on January 24, 2023, 04:10:15 PMbtw. why did you wait this long to start this discussion?Good point.I fucking provided the transaction details, I have more credibility than you ever will, so gtfo moron.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "January 24, 2023, 07:36:30 PM",
      "body": "Quote from: MrBrightside1 on January 24, 2023, 07:26:02 PMI fucking provided the transaction details, I have more credibility than you ever will, so gtfo moron.calling other members an idiot, a moron along with other insults, It's certainly not the right way to come to an understanding here. can you at least try to have a civilized discussion, regardless of whether someone said something you don't like?You got suggestions on how to present the proof, if you have already done it why is it difficult to repeat it here? after all, you started this topic, I guess it's in your interest that it be resolved positively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bnbstorm",
      "created_time": "January 24, 2023, 07:38:00 PM",
      "body": "Quote from: MrBrightside1 on January 24, 2023, 06:48:53 PMI mean, I get the whole distrust regarding 1xbit, Im also very wary with them. But I can't lie, if they actually paid me out, then it's the case, been always happy to provide anything they want.And if an idiot like jollygood is just going on a vendetta, well maybe there should be taken actions against a person who is an idiot (I have the proof to call him that, cfr the whole discussion). Imo he deserves to be banned from this forum.The reason I do this, because other people commented about it.And regarding credibility, I am the former (and only imo) rollbit boss, won the 2 first million dollar races on stake, also happy to prove that I am that person. If things OP is telling are true then maybe 1xbit paid withdrawals to few people in beginning before rug or something like that. And it seems unfair to tag all people a bad trust rating. No one knew it was a scam. So there should be a proper investigation on this matter before ruining someone's profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrBrightside1",
      "created_time": "January 24, 2023, 07:43:41 PMLast edit: January 24, 2023, 09:35:13 PM by Mr. Big",
      "body": "Quote from: examplens on January 24, 2023, 07:36:30 PMQuote from: MrBrightside1 on January 24, 2023, 07:26:02 PMI fucking provided the transaction details, I have more credibility than you ever will, so gtfo moron.calling other members an idiot, a moron along with other insults, It's certainly not the right way to come to an understanding here. can you at least try to have a civilized discussion, regardless of whether someone said something you don't like?You got suggestions on how to present the proof, if you have already done it why is it difficult to repeat it here? after all, you started this topic, I guess it's in your interest that it be resolved positively.In a space where clicking on any link can get your funds stolen I am very wary. Not to mention why bother? I provided more than any person would provide.And where is your PROOF? It's fine that people accuse me of shilling while I only posted a transaction? All of you claim that I work for 1xbit, based on what, have you seen me saying I did, have you seen a contract?I only say that people are idiots and morons if they actually are (they did not read what I said and start making conclusions in a negative way). You guys suffer too much from confirmation bias.Quote from: bnbstorm on January 24, 2023, 07:38:00 PMQuote from: MrBrightside1 on January 24, 2023, 06:48:53 PMI mean, I get the whole distrust regarding 1xbit, Im also very wary with them. But I can't lie, if they actually paid me out, then it's the case, been always happy to provide anything they want.And if an idiot like jollygood is just going on a vendetta, well maybe there should be taken actions against a person who is an idiot (I have the proof to call him that, cfr the whole discussion). Imo he deserves to be banned from this forum.The reason I do this, because other people commented about it.And regarding credibility, I am the former (and only imo) rollbit boss, won the 2 first million dollar races on stake, also happy to prove that I am that person. If things OP is telling are true then maybe 1xbit paid withdrawals to few people in beginning before rug or something like that. And it seems unfair to tag all people a bad trust rating. No one knew it was a scam. So there should be a proper investigation on this matter before ruining someone's profile.Thank you, someone with some sense, who is objective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "January 24, 2023, 07:57:09 PM",
      "body": "Quote from: examplens on January 24, 2023, 07:36:30 PMcalling other members an idiot, a moron along with other insults,I've seen that many times when someone is out of arguments for their lies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrBrightside1",
      "created_time": "January 24, 2023, 07:58:15 PM",
      "body": "Quote from: LoyceMobile on January 24, 2023, 07:57:09 PMQuote from: examplens on January 24, 2023, 07:36:30 PMcalling other members an idiot, a moron along with other insults,I've seen that many times when someone is out of arguments for their lies.And I have seen a lot of people like you, who better shut the fuck up instead of opening their mouth. If you cant give a constructive answer then get out idiot.I can't help it that you are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "January 24, 2023, 09:12:41 PM",
      "body": "Quote from: MrBrightside1 on January 24, 2023, 07:58:15 PMQuote from: LoyceMobile on January 24, 2023, 07:57:09 PMQuote from: examplens on January 24, 2023, 07:36:30 PMcalling other members an idiot, a moron along with other insults,I've seen that many times when someone is out of arguments for their lies.And I have seen a lot of people like you, who better shut the fuck up instead of opening their mouth. If you cant give a constructive answer then get out idiot.I can't help it that you are.These things should not escalate to this in the first place you open an unmoderated thread and you are asking for help so anyone can drop here and engage in the conversation, all you have to do is just sign the wallet that was used to receive the funds and that's all there is to do, and it will end there, you just have to prove that you own the wallet, no one here will support your cause if you do not do what should be done, the instruction was already given.If it's true that you are just a player and not part of the 1XBIT team then you don't deserve the tag and you have a reason to fight it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrBrightside1",
      "created_time": "January 24, 2023, 10:23:36 PM",
      "body": "Quote from: Saisher on January 24, 2023, 09:12:41 PMQuote from: MrBrightside1 on January 24, 2023, 07:58:15 PMQuote from: LoyceMobile on January 24, 2023, 07:57:09 PMQuote from: examplens on January 24, 2023, 07:36:30 PMcalling other members an idiot, a moron along with other insults,I've seen that many times when someone is out of arguments for their lies.And I have seen a lot of people like you, who better shut the fuck up instead of opening their mouth. If you cant give a constructive answer then get out idiot.I can't help it that you are.These things should not escalate to this in the first place you open an unmoderated thread and you are asking for help so anyone can drop here and engage in the conversation, all you have to do is just sign the wallet that was used to receive the funds and that's all there is to do, and it will end there, you just have to prove that you own the wallet, no one here will support your cause if you do not do what should be done, the instruction was already given.If it's true that you are just a player and not part of the 1XBIT team then you don't deserve the tag and you have a reason to fight it.Can I help it that people don't read?Again why should I prove it, I have proven enough. I am not gonna burn anything for anyone of you! Let alone have the risk of clicking on anything suspicious? And probably after that it won't be enough. You can't just accuse people of something until you have proof and you don't have proof regarding me (and also regarding a lot of the scamm accusations). So I am not here saying the scam accusations are incorrect (I have no proof), but it also works the other way around (you can't say I am shilling/falsifying evidence). Please have some human integrity or spare us from your presence here. And I sent cyrus a message, I reported comments, but what do they do? Nothing, does that mean I am not right? No, means they are fuck ups. So can you please make this a normal forum, where a bunch of monkeys are not able to spew whatever they want please? Or do I need to give more proof about all the false accusations? Because that proof is here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}