{
  "id": "topic_5403654",
  "title": "estheblessed",
  "author": "estheblessed",
  "created_time": "June 22, 2022, 03:43:15 PM",
  "content": "Watching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403654",
  "comments": [
    {
      "author": "Jackl87",
      "created_time": "June 22, 2022, 05:05:03 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?It is true that it is not easy to follow the crypto market at the moment and also your portfolio when it went down like more than 50% within the last few weeks and possibly more than 90% since the height of the last bull market back in may of 2021. Usually in a bear market the altcoins suffer way harder from falling prices then Bitcoin itself. This has been the case in all bear market if have witnessed so far and i am following the crypto space since 2017.I don't think that any of the coins that you have listed will die, they are just to big and established already in order to completely die. If all of them stay relevant and will also rise again to new ATH's when the next bear market comes, i don't know. Some of them will some of them will probably not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RussianEnglishTranslation",
      "created_time": "June 22, 2022, 05:23:57 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?Out of your list I would only buy XRP. I might buy ETH under 500 usd but I would prefer ICP over ETH any day. I'm really having doubts that ETH is going to make it long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davian144",
      "created_time": "June 22, 2022, 05:24:21 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?I've seen a lot of downturns in the crypto market and this is not the end for any particular coin because in the past there have also been huge drops in the price of crypto coins, but things can get better and it's not the end of everything.QuoteHow do people think the likes of ETH, ADA, XRP, TRON etc will go from here?Cryptocurrency products such as ETH, ADA, XRP, and TRON are products that are very valid in the market and for certain communities so there is always demand and supply going on. You don't have to worry if you currently still have ETH, ADA, XRP, and TRON, because they will all improve again in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "June 22, 2022, 05:46:08 PM",
      "body": "Quote from: Davian144 on June 22, 2022, 05:24:21 PMQuoteHow do people think the likes of ETH, ADA, XRP, TRON etc will go from here?Cryptocurrency products such as ETH, ADA, XRP, and TRON are products that are very valid in the market and for certain communities so there is always demand and supply going on. You don't have to worry if you currently still have ETH, ADA, XRP, and TRON, because they will all improve again in the market.I believe the coins mentioned have good potential they have been in the market for a long time and when the market recovers the price will definitely increase again believe me these coins will not die I never worry about it except for new tokens.Altcoins will definitely continue to grow as many new projects develop and they will definitely enter the market but we don't know after that sometimes new altcoins don't last long and eventually die.Not with the top-ranking altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "June 22, 2022, 06:13:39 PM",
      "body": "All the altcoins you mention have use cases, there are many platforms created on the blockchain of some of the coins you mention, so they might be hard to be dead, and I don't agree with your title that altcoins are dead. It will be different if what you are showing is new tokens and coins that have no volume. Crashes are normal, we've seen them time and time again. The current crash, is temporary, it may be necessary to distinguish between whether to die and not being able to touch ATH anymore. If it is related to ATH, there is a possibility that altcoins are difficult to get to ATH, and I have experienced this in several altcoins such as MUE, XVG, SC and others, but they still exist despite crashing from ATH 2017 and not hitting old ATH till today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samurai trieng",
      "created_time": "June 22, 2022, 06:17:48 PM",
      "body": "indeed at this time altcoins have experienced a lot of decline and until now there have been no signs of increasing again, but in my opinion this is not the end of altcoin growth, because the current decline is not comparable to the decline in crypto in 2018, where crypto has a very deep decline at that time, after its we can see altcoins grow rapidly in the following year, I recommend for beginners to start investing with altcoins now because they are very affordable,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarcoReus11",
      "created_time": "June 22, 2022, 06:43:34 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?Bro i am not sure about others coin but Ethereum is a blockchain-based platform best known for their cryptocurrency.It is truth that Now ETH price went to $1,084 due to Bears Trend. But when the bull take the market in his own hand so no dout that ethereum could easly take his ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mosharafhh",
      "created_time": "June 22, 2022, 06:54:54 PM",
      "body": "Its never gonna happen altcoin will ever dead if bitcoin alive forever then altcoin also will alive forever. Yes here is some of altcoin future never gonna bright but not all of sometimes good altcoin take market position with there usecases even its go to top on market.!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "June 22, 2022, 07:46:07 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?Bitcoin has lost 74% of its value from ATH to here. This situation means death for altcoins anyway. :)In our last bull market, Ripple and Tron failed to reach their old ATH levels. But Ethereum and Cardano reached new ATH levels. In this context, I think it would not be wrong to say that Ripple and Tron are dead. But I cannot say that Cardano and Ethereum are dead. I don't think it's fair to say that altcoins are all dead. Solid altcoins will somehow continue to live on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 22, 2022, 08:30:54 PM",
      "body": "Quote from: Mosharafhh on June 22, 2022, 06:54:54 PMIts never gonna happen altcoin will ever dead if bitcoin alive forever then altcoin also will alive forever. Yes here is some of altcoin future never gonna bright but not all of sometimes good altcoin take market position with there usecases even its go to top on market.!Actually, there are altcoins which we all should consider to be already dead, in my opinion. If a coin does not comply with a min of use or utility it will end up dead. Also, scam coins end up abadoned, it is just matter of time.I'd dare to say if any altcoin has a price graph like this one, could be suspected to be dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "June 22, 2022, 08:41:34 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PM~For most of the altcoins like the most of the coins you mentioned there, it would surely just lay down there in a while. Surely Bitcoin is just taking its time again to just dip in a while and let others come through for the cheap price we got right now although I would not call it cheap in my own currency lol.Just keep holding like always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "June 22, 2022, 08:56:19 PM",
      "body": "This is a temporary death phase of some altcoins i would say, not very much activities are going with most of the alts, during bear market like this, some project limit the way they update their community, mainly because they have nothing to update or just decide to work more behind the sense and update less. No doubt most of the hype base alts will most likely not recover, a handful will survive. Some devs use this period to focus on project development and prepare for the next bull circle. even though the market seem dead, this is also the best time to buy what you can afford.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 22, 2022, 09:11:27 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?Shitcoins are dying, they are meant for this but the top coins they are still struggling right now but of course the probability to rise again is very high for them. Those coins is fundamentally good and that’s why they will remain on the top position even on a bear market. We should buy them right now while the price is still cheap, this could be the best opportunity to catch it and have good coins on your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "June 22, 2022, 10:23:54 PM",
      "body": "Altcoins in general just having a really bad winter right now, so many of them got affected so hard after the terra luna crash although most of the altcoin didn't depends in luna whatsoever.But that doesn't mean altcoins in general just gonna vanish into thin air. That's because once the trend has finally changed some of the altcoins gonna be making a move and could revive themselves.though it's true that majority of the shitcoins just gonna be left by its holders. Since they are as good as nothing, basically just full of manipulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "June 22, 2022, 11:03:11 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?If you are new in crypto, I'll understand but this is what it meant to see during the bear season as the entire market went down and most of the altcoins we've been dead. But I need for you to understand the situation and just to be clear with you that those coins you have mentioned are not dying. Those are one of the potential coins in the market but have no excuse for the dumps, however, they will also recover when the market goes up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pelana vreo",
      "created_time": "June 22, 2022, 11:11:02 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?The current market situation is almost the same as it was in 2017, however some new investors are afraid of losing a lot of money due to the current price drop.Looking back a bit, when BTC was $63k USD, everyone panicked to buy, but when it was $20k USD only a few investors bought it and most importantly, altcoins always followed the BTC price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "June 22, 2022, 11:31:05 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?Maybe  This is a bearish era where all cryptocurrencies are struggling for survival. The best will survive, and the least will be dead because of this bearish market that will be still ongoing. This is not new. many new projects or coins with low cap or volume may be easy to die and cannot survive. But, for certain coins, this becomes the era to buy more and hold them for the long term until the bullish era is coming. Why? because some of those altcoins may be able to survive, struggle, and develop even during this bearish market. They will also follow the Bitcoin rate, which is actually very dropped, those altcoins will be also dropped. But, as long as they can survive, commonly worthy altcoins are able to rise up and reach their ATH again in the future. But, for what coins? I am not sure, because none can predict it exactly. We can see from the past bearish market where Ethereum also had very dramatic drops until this can go higher and higher again due to the bullish market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "June 22, 2022, 11:38:22 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?How do people think the likes of ETH, ADA, XRP, TRON etc will go from here?Why are you using the word Quotedemise of ALL crypto do you really think that its the end of the Cryptocurrency and everything we have achieved in the last twelve years are you giving up already after what the technology has achieved in the past and in the present, you better go back further and check a much worse scenario than what we are experiencing right now to be more realistic in your opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natalim",
      "created_time": "June 22, 2022, 11:41:27 PM",
      "body": "Quote from: estheblessed on June 22, 2022, 03:43:15 PMWatching the current market and the demise of ALL crypto ... is this the end for certain coins?Nothing special with the altcoins - we are certainly be seeing them more affected when there is a market crash. I'd presume that you are aware of this condition then I think you don't need to get surprised and even wonder about the big changes. But there is one thing I'm sure of, this is not a long-term correction as the market will soon recover, we just have to encourage ourselves to wait rather than be worried about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}