{
  "id": "topic_5413416",
  "title": "Jossque",
  "author": "Jossque",
  "created_time": "September 13, 2022, 12:50:56 PM",
  "content": "Starbucks NFT sektörüne polygon ile birlikte adımını atmaya başladı. Kullanıcıların görevleri yerine getirdikten sonra NFT kazanabileceği platformu için waitlist başlattı. Programın adını Starbucks Odyssey adını verdiler. Hesabıyla giriş yapan kullanıcıları sanırsam bazı oyunlar bekleyecek. Bu oyunlardaki maceraları/görevleri tamamlayanlar nft ile ödüllendirilecek.https://www.coindesk.com/business/2022/09/12/starbucks-to-offer-nft-based-loyalty-program-alongside-polygon/https://waitlist.starbucks.com/#/register",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413416",
  "comments": [
    {
      "author": "Pierre 2",
      "created_time": "September 23, 2022, 08:40:56 AM",
      "body": "İlginç bir şekilde forumumuzda yeterince ilgi görmemiş bu başlık. Waitlist e direkt girdim. Ben bu projenin başarılı olma ihtimali olduğunu düşünüyorum belki nft sahipleri için loyalty bonusları falan verebilirler. Önceden bahsettiğimiz gibi gerçek hayattaki ekonomiyi alıp dijitale adapte eden nft projeleri kesinlikle başarılı olurlar. Bu da Starbucks fandom u düşünüldüğünde gayet doğru bir adım gibi görünüyor. Alım yapabilirim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "September 28, 2022, 11:45:50 AM",
      "body": "Starbucks dünyanın en büyük kahve zinciri. Kahveleri de şahane bana göre. Eskiden daha çok tüketirdim ürünlerini. Ama hala fırsat bulunca soluğu Starbucks'ta alırım. Gerçi anlatmaya gerek yok. Kaliteli ürünleri olmasa 20 binden fazla şubesi olmazdı. Kalite bu konuda tesadüf değil. Gerçek kalite. NFT'ler ayrıcalıklı müşteri olmamı sağlarsa memnun olurum. NFT'sini para karşılığında satmak bana bi şey katmaz. Starbucks'ı kullanan biri olarak ayrıcalıklara sahip olmak isterdim NFT sayesinde. Bu nedenle beklemeden Waitlist'e girdim. Hoş ne olursa olsun bi NFT hatırası iyi olur. Firmayla aramda duygusal bağ var zaten çünkü. Ama NFT bi işe yarasın isterdim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "October 03, 2022, 03:08:50 PM",
      "body": "Nft olayı artık bitti gibi birşey ya. Firmalar bana göre şuanda isimlerini ve markalarını korumak için birşey yapmak için yapıyorlar gibi. Yani kendi isimlerini başkalarının kullanmasını değil adı olsun birkaç görsel ile taçlandırmak istiyor bu kadar. Fkat çok büyük bir zincir marka pahalı olmadığı sürece denenebilir en kötü ihtimal yatırılan parayı iade eder diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "October 03, 2022, 03:49:57 PM",
      "body": "Quote from: Ondekinecakabilirim on September 28, 2022, 11:45:50 AMStarbucks dünyanın en büyük kahve zinciri. Kahveleri de şahane bana göre. Eskiden daha çok tüketirdim ürünlerini. Ama hala fırsat bulunca soluğu Starbucks'ta alırım. Gerçi anlatmaya gerek yok. Kaliteli ürünleri olmasa 20 binden fazla şubesi olmazdı. Kalite bu konuda tesadüf değil. Gerçek kalite. NFT'ler ayrıcalıklı müşteri olmamı sağlarsa memnun olurum. NFT'sini para karşılığında satmak bana bi şey katmaz. Starbucks'ı kullanan biri olarak ayrıcalıklara sahip olmak isterdim NFT sayesinde. Bu nedenle beklemeden Waitlist'e girdim. Hoş ne olursa olsun bi NFT hatırası iyi olur. Firmayla aramda duygusal bağ var zaten çünkü. Ama NFT bi işe yarasın isterdim.Kesinlikle katılıyorum satılacak NFT'leri bir başkasına daha pahalıya satmak çok anlamsız olur. Starbucks kurucu NFT'si olsa mesela her sene ödüller verseler, özel günlerde indirim yapsalar nft sahiplerine o zaman çok daha değerli olur. Sadece bir çizim yada gif verirlerse bilemiyorum kimse tutmak istemez sanırım. Bu arada pandemiden sonra Starbucks acayip bozdu eski tadı hiç yok gibi geliyor bana nerede içtiysem aynı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "October 03, 2022, 05:26:29 PM",
      "body": "Quote from: SUPERSAIAN on October 03, 2022, 03:49:57 PMQuote from: Ondekinecakabilirim on September 28, 2022, 11:45:50 AMStarbucks dünyanın en büyük kahve zinciri. Kahveleri de şahane bana göre. Eskiden daha çok tüketirdim ürünlerini. Ama hala fırsat bulunca soluğu Starbucks'ta alırım. Gerçi anlatmaya gerek yok. Kaliteli ürünleri olmasa 20 binden fazla şubesi olmazdı. Kalite bu konuda tesadüf değil. Gerçek kalite. NFT'ler ayrıcalıklı müşteri olmamı sağlarsa memnun olurum. NFT'sini para karşılığında satmak bana bi şey katmaz. Starbucks'ı kullanan biri olarak ayrıcalıklara sahip olmak isterdim NFT sayesinde. Bu nedenle beklemeden Waitlist'e girdim. Hoş ne olursa olsun bi NFT hatırası iyi olur. Firmayla aramda duygusal bağ var zaten çünkü. Ama NFT bi işe yarasın isterdim.Kesinlikle katılıyorum satılacak NFT'leri bir başkasına daha pahalıya satmak çok anlamsız olur. Starbucks kurucu NFT'si olsa mesela her sene ödüller verseler, özel günlerde indirim yapsalar nft sahiplerine o zaman çok daha değerli olur. Sadece bir çizim yada gif verirlerse bilemiyorum kimse tutmak istemez sanırım. Bu arada pandemiden sonra Starbucks acayip bozdu eski tadı hiç yok gibi geliyor bana nerede içtiysem aynı Starbucksta fazla kahve anım yok yine de dünyaya mal olmuş bir marka en azından nft sahiplerine belirli aralıklarla indirim gibi şeyler yapabilirler bence de yoksa elinde basit bir animasyon tutmaktan başka bir şeye yaramaz bu nft alıyorsan bir işe yaramasını da isterseniz aslında",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "July 29, 2023, 02:00:32 PM",
      "body": "Starbucks Green Apron adında NFT koleksiyonu satışı yapacak. 5000 adet olacak bu koleksiyonda satış ücreti tane başı 100 dolar olacak.Her kullanıcı 2 tane NFT alabilecek ve satış Polygon ağında olacak.Türkiye saati ile 1 ağustos saat 12'de olacak.https://www.niftygateway.com/collections/starbucks-odyssey-green-apron-collection",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}