{
  "id": "topic_5479661",
  "title": "RioBlemz",
  "author": "RioBlemz",
  "created_time": "December 29, 2023, 01:01:52 PM",
  "content": "What if Bitcoin ETF is not ApprovedWhereas optimism is high as regards the approval of Bitcoin ETF which could be a milestone for investor to come in. Bitcoin topped $42,000 in December 2023 and the yearly gain compared from 2021 to date is 160%. One major factor at play was the hope to list Bitcoin ETF which is a very progressive discussion between the Asset managers and the Securities and exchange commissions. When we plan we plan for possible eventuality and please do not consider this negative bias. Wisdom Tree, BlackRock etc. has meet the criterial as said and are waiting for a positive signal. Should we bank on it. The question is still pondering in my mind if it doesn't go as suggested or the approval is denied what then happens? I can only see a sudden fall if Bitcoin ETF is not approved and you may as well add your input on this. However, from now till 2026 will be promising for BTC as there would be favorable outcome. It is a game of patience.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5479661",
  "comments": [
    {
      "author": "avikz",
      "created_time": "December 29, 2023, 01:20:42 PM",
      "body": "It is indeed a game of patience. If Bitcoin ETFs are not approved, we may see a drop in price but for a long term investor that would present another opportunity to score more Bitcoins at lower price. So speculators may get disappointed, but for long term value investors, it is just another opportunity. Bitcoin price is not going high just because of the positivity around ETF approval. There are multiple other things in play here. The next Bitcoin halving is around the corner. For me, it is more important than ETF approval and potential have more impact on Bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 29, 2023, 01:26:41 PM",
      "body": "Who cares with Bitcoin ETF, either it's accepted or not, there's no reason to buy Bitcoin ETF since it just an IOU.Quote from: RioBlemz on December 29, 2023, 01:01:52 PMHowever, from now till 2026 will be promising for BTC as there would be favorable outcome..Why it must be 2026? do you think Bitcoin went to $0 in 2027? Bitcoin price will keep rising in long term, sudden dump or bear season is inevitable, but that doesn't enough to stop Bitcoin to rise and break new ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 29, 2023, 01:32:40 PM",
      "body": "This news was 4 days ago: https://cointelegraph.com/news/sec-spot-bitcoin-etf-updates-deadlineIf you read the news and what has been happening before that time, you will know that United States SEC will approve bitcoin spot ETF in early 2024. There is not need to discuss about if it will not be approved or not because it will be approved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "December 29, 2023, 01:33:47 PM",
      "body": "Nothing will happen if ETFs doesn't get approved by SEC, the long term investors will continue to hold their Bitcoin and they will also try to accumulate more Bitcoin if the price of Bitcoin get some dips. Look at MicroStrategy, they always shock us with their investments into Bitcoin and they'll continue investing in Bitcoin like that.Now till 2026 but till so many years Bitcoin will show positive gains and the investors who are holding their Bitcoin will reap those positive gains. Just be optimistic about Bitcoin and you'll see yourself that how it gets higher in value over time. The ETF and the next halving will increase investors confidence but if ETF doesn't gets approved the investors confidence won't break over night.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "December 29, 2023, 01:40:02 PM",
      "body": "I don't think there would be sudden drop in price of Bitcoin and even if there is any drop it wouldn't be significant or sustainable drop as market is building up for post halving bullrun and everyone's accumulating Bitcoin gradually. One single factor never decides market movement unless it's something very critical and spot ETF doesn't quality for this. There would be some impact but not something we should be worried about and to be honest the fuds are something we should be worried about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "December 29, 2023, 01:41:45 PM",
      "body": "Price is consolidating below the weekly supply zone, and it couldn't even reach the equilibrium of the zone. This only means that there are more selling pressure than buying pressure in the supply zone. If ever the Spot ETF was not approved probably the price will going to retrace and possibly reach the strong support. Well, this will not immediately happen because traders and institutions doesn't want it happen. But we have to remember that Bitcoin is no longer easy to manipulate. But I believe this time if SEC reject the approval of Spot ETF surely there will be a big dump of the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "December 29, 2023, 01:48:47 PM",
      "body": "nothing will happen, no need to panic too much.but maybe the market will experience a slight shock, this is very natural considering that bitcoin etf has been awaited by many people and the rejection may surprise investors a little, but it will not make the price of bitcoin fall quite badly. i think the market will remain bullish towards the bitcoin halving. the point is just to be patient and don't need to speculate too much, if you are patient you will definitely be able to make a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "December 29, 2023, 02:01:50 PM",
      "body": "Do you consider that BTC reached 42K because ETF is going to be approved? Maybe ETF approval has some influence, but the market is supposed to grow which is why BTC is here. If ETF does not get approved, nothing will happen. Even if we see a sudden dump, it won't last long because of obvious reasons. If Bitcoin goes down again, a lot of people will find another buying opportunity and it will bounce back again. So, as I said, nothing will happen if ETF does not get approved. We are heading to a most speculated Bitcoin halving. People are awaiting for the halving event and most crypto researchers believe we will see a bull run in 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 29, 2023, 02:03:50 PM",
      "body": "Quote from: RioBlemz on December 29, 2023, 01:01:52 PMWhat if Bitcoin ETF is not ApprovedWhereas optimism is high as regards the approval of Bitcoin ETF which could be a milestone for investor to come in. Bitcoin topped $42,000 in December 2023 and the yearly gain compared from 2021 to date is 160%. One major factor at play was the hope to list Bitcoin ETF which is a very progressive discussion between the Asset managers and the Securities and exchange commissions. When we plan we plan for possible eventuality and please do not consider this negative bias. Wisdom Tree, BlackRock etc. has meet the criterial as said and are waiting for a positive signal. Should we bank on it. The question is still pondering in my mind if it doesn't go as suggested or the approval is denied what then happens? I can only see a sudden fall if Bitcoin ETF is not approved and you may as well add your input on this. However, from now till 2026 will be promising for BTC as there would be favorable outcome. It is a game of patience.You are very correct that everyone in the Bitcoin space is anticipating that the SEC will approve the Bitcoin ETF. Indeed these institutional investors have met almost all the criteria for the approval of applications. Recently BlackRock conceded to SEC's insistance that they should include cash redemptions in its proposal. But you don't have to put your hope on the ETF approval because the SEC also has the power to disapprove it. Gary Gensler and the other four commissioners cannot be trusted because they can give several reasons for denial. If you have anchored your predictions on ETF approval but you now scared that it will not be approved, you can cash out if you are on profit. But if you want to take the risk, we might see Bitcoin hitting $100k. However, if it is not approved the effect will be that the price might drop slightly and it will also recover after a few months. Bitcoin might be affected by some economic policies but it will also recover, it might just take more time. Bitcoin has a system that guarantees profit but it is unpredictable. This is also why we are advised to invest only what we can afford to live without. Don't forget that we will also have the Bitcoin halving next year, showing a profitable 2024-25.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "December 29, 2023, 02:21:50 PM",
      "body": "Quote from: RioBlemz on December 29, 2023, 01:01:52 PMI can only see a sudden fall if Bitcoin ETF is not approved and you may as well add your input on this. However, from now till 2026 will be promising for BTC as there would be favorable outcome. It is a game of patience.In 2018 the Winklevoss twins application for a bitcoin ETF was rejected Securities and Exchange Commission. It was their second attempt. Did you know what happened? Yes just what you have written. The price of Bitcoin dropped. You know at first, rumors of its approval made Bitcoin's price to increase.  Even this may not be the case with BlackRock's applications as there is a green flag, at least we know what would happen. You can read about it here.https://www.google.com/amp/s/www.cnbc.com/amp/2018/07/26/winklevoss-twins-bitcoin-etf-rejected-by-sec.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 29, 2023, 02:34:57 PM",
      "body": "Quote from: RioBlemz on December 29, 2023, 01:01:52 PMI can only see a sudden fall if Bitcoin ETF is not approved and you may as well add your input on this. However, from now till 2026 will be promising for BTC as there would be favorable outcome. It is a game of patience.I wouldn’t be surprise to see the fall because most people have actually invested in the past few weeks or days base on the FOMO because of the hype around bitcoin ETF approval bringing in large adoption to the space. Personally I am not in awe of this because something tells me that the SEC sees this spot as an opportunity to discourage anonymity in bitcoin investors more like the KYC platforms. A disapproval or even an official postponement would lead to a little retracement in the bitcoin price by those who are in for a short term profit. But for most people especially old investors they are definitely looking towards the halving period and it’s potential bull run",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "December 29, 2023, 02:41:46 PM",
      "body": "Quote from: RioBlemz on December 29, 2023, 01:01:52 PMWhat if Bitcoin ETF is not ApprovedWhereas optimism is high as regards the approval of Bitcoin ETF which could be a milestone for investor to come in. Bitcoin topped $42,000 in December 2023 and the yearly gain compared from 2021 to date is 160%. One major factor at play was the hope to list Bitcoin ETF which is a very progressive discussion between the Asset managers and the Securities and exchange commissions. When we plan we plan for possible eventuality and please do not consider this negative bias. Wisdom Tree, BlackRock etc. has meet the criterial as said and are waiting for a positive signal. Should we bank on it. The question is still pondering in my mind if it doesn't go as suggested or the approval is denied what then happens? I can only see a sudden fall if Bitcoin ETF is not approved and you may as well add your input on this. However, from now till 2026 will be promising for BTC as there would be favorable outcome. It is a game of patience.I remember when the last bull run was, was there a Bitcoin spot ETF? As far as I can see, even if that is approved, it does not mean that the price value of Bitcoin will not increase. Now, many communities will be disappointed in this matter because there are many who believe that this Blackrock is expected by the majority to be approved.I even watched someone on YouTube say that the influencer said that Blackrock was approved, so he is still silent and will only speak at the right time and opportunity, but he is not sure. Besides, I'm also expecting, but my expectations are not high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 29, 2023, 02:55:12 PM",
      "body": "Quote from: RioBlemz on December 29, 2023, 01:01:52 PMWhat if Bitcoin ETF is not ApprovedYou seem to have forgotten that bitcoin never needed ETF to rise and it is not about to start now. The price has gone up 4 billion percent ever since the inception (from $0.001 to current $42k) and all that without ETF or any centralized crap like that.Even if SEC were to reject ETF, it wouldn't have been the first time and nobody would care. The only thing that would have done was to scare some newbies to panic sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "December 29, 2023, 03:02:35 PM",
      "body": "Quote from: RioBlemz on December 29, 2023, 01:01:52 PMWhat if Bitcoin ETF is not ApprovedI can only see a sudden fall if Bitcoin ETF is not approved and you may as well add your input on this. However, from now till 2026 will be promising for BTC as there would be favorable outcome. It is a game of patience.Bitcoin Spot ETF applications were rejected by SEC. It happened many times and in many years.What happened the last time SEC rejected a Bitcoin Spot ETF?It is already 10 years since a time of first Bitcoin Spot ETF application submitted. It's 10 years and do we need to see how Bitcoin adoption and price have grown in the last 10 years?We have two sharply curves for price and adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 29, 2023, 03:21:20 PM",
      "body": "What if China isn't want to accept Bitcoin? look where we're, Bitcoin still create a new ATH after halving season, other country dare to accept Bitcoin as legal tender etc, such bad news won't affect Bitcoin in the long run, never.Sudden dump is normal because there are many traders or it just a normal volatility as we know Bitcoin is a high volatility asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryu_Ar1",
      "created_time": "December 29, 2023, 03:26:45 PM",
      "body": "I think bitcoin ETF is just one of the momentum to see bitcoin increase with a very fast time but even if there is no bitcoin ETF I think the situation will still be the same just whether this will be a rapid increase or indeed slowly the same as usual then this is the question even though there is or is not a bitcoin ETF everything I think will remain the same just because of our fixation on prices then this becomes very important.When the ETF is not approved then we will definitely see a decline that occurs again because inevitably it must be accepted considering that it is an impact that occurs because of an unfavorable decision for bitcoin even though in fact it can also be a momentum for us to buy in the end because indeed for the long term this will still be very profitable so in this case the bitcoin ETF is just a bridge whether bitcoin prices will soar quickly or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 29, 2023, 04:20:10 PM",
      "body": "I find an ETF rejection to be realistic, and that can upset some people. So yeah, maybe we'll see a small and temporary price decrease, but I hope it won't be anything big because nothing changes in practice. It's not the same as with Tesla a few years ago, when Musk actually announced a big investment in Bitcoin and adoption of Bitcoin as payment, and then pulled out. This time, an ETF was not approved and then rejected; the price went up in anticipation, not because of real change, so I'm hopeful that a rejection won't have a major impact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 29, 2023, 04:30:41 PM",
      "body": "Good question, personally I don't think there will be a big impact if the Bitcoin ETF is not approved, maybe others think this will have a very bad impact on the market but it's not for me.Certainly, there will be some negative impact and the price will decrease temporarily due to the big negative news, but most likely it will recover soon and things will return to normal, because Bitcoin is present and strong with or without an ETF, so I do not think it is a big issue for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTC_Dragon",
      "created_time": "December 29, 2023, 07:41:51 PM",
      "body": "Then I'd continue stacking BTC regardless. The ETF offers a potential to boost the price and make many an average man/woman fairly wealthy if they've been investing intelligently up to that point. If it doesn't, it doesn't really mean much other than a slightly less intense upward climb over the same time period IMHO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}