{
  "id": "topic_5443692",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "March 06, 2023, 09:02:09 AM",
  "content": "La última bajada repentina de bitcoin, que tampoco fue tremebunda, pero si abrupta desde los 23,4K $ hasta los 22,1K$ veo que es atribuida por algunos medios a la posible quiebra de Silvergate Capital, matriz de Silvergate Bank, la cual no presentó su informe de situación financiera ante la SEC en los plazos estipulados.La entidad presta servicios de pagos a empresas del ámbito cripto, como son Coinbase, Binance, Kraken, Galaxy Digital y Paxos, los cuales ya han anunciado que dejarán de trabajar con la entidad.Supongo que habrá una segunda parte de esta historia en breve …Ver: https://www.criptonoticias.com/mercados/precio-bitcoin-podria-caer-quiebra-silvergate-bank/https://www.criptonoticias.com/negocios/silvergate-cierra-red-pagos-criptomonedas-empresas-desligan/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443692",
  "comments": [
    {
      "author": "darxiaomi",
      "created_time": "March 06, 2023, 02:35:01 PM",
      "body": "Lo habia visto hace unos dias, el desplome de su accion y que eso estaba traccionando la bajada del BTC.Pero bueno sabemos que siempre hay algo para echarle la culpa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 07, 2023, 12:47:35 AM",
      "body": "Si les soy honesto, es la primera vez que creo escuchar sobre esta institución financiera y menos sabía de su rol con exchanges y entidades de la relevancia de Coinbase y Paxos.Asumo (no he hecho mi investigación previa) que el rol de Silvergate era de proveer liquidez FIAT para los pagos a través de cuentas bancarias y tarjetas que hiciesen los clientes de los exchanges o algo así. Sea como sea, ya he visto personas en Twitter especulando que esto no es más que la siguiente pieza de domino en caer gracias a la desgracia que todos vimos con FTX meses atrás. Y me lo creo, gracias a una noticia que parece ligar a Silvergate con Blockfi (ya sabemos que Blockfi dependía de FTX).Si antes Bitcoin y la industria de los activos descentralizados estaba estigmatizada por culpa de los comercios ilegales en la red oscura, a este paso el estigma pasará a la supuesta aceleración de declaraciones de quiebra y de bancos y casas de cambio. Todo por culpa de las decisiones de un puñado de personas.  Silvergate cierra su red de exchange y libera USD 9.9 millones para BlockFi Fuente: https://es.cointelegraph.com/news/silvergate-closes-exchange-network-releases-9-9m-to-blockfiQuoteUna segunda decisión el mismo día del juez estadounidense Michael B. Kaplan dijo que Silvergate tenía que devolver USD 9,850,000 depositados por BlockFi. Según documentos publicados en el sitio web del asesor de reestructuración de BlockFi, el tribunal ordenó al banco liberar inmediatamente los fondos tras un acuerdo entre las dos empresas en noviembre de 2022.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 07, 2023, 08:07:18 AMLast edit: March 09, 2023, 10:52:55 AM by DdmrDdmr",
      "body": "A mí tampoco me sonaba de nada hasta el momento, lo cual me hace pensar en la cantidad de negocios que pivotan entorno a las criptomonedas que son de entidad, y cuyo desenlace en negativo son chinas en el camino reputacional de la industria como indicas.Bajo el punto de vista de una persona que simplemente ojea la prensa nacional o las noticias, las asociaciones que suele oir en los últimos tiempos son:-   Quiebra de entidades, con tintes más o menos oscuros asociados.-   Bajada del precio de bitcoin (con la puntual mención a la subida desde principios de año).-   Utilización de bitcoin como reclamo de rescate en ataques ransomware.-   Algunas pseudo-sectas capta jóvenes con promesas de libertad financiera a través de las criptomonedas.Si intento rescatar recuerdos en positivo en los medios nacionales recientemente, salvo la citada subida desde principios de año (comentada de manera un tanto a regañadientes), no tengo nada fresco en la mente ahora mismo, por lo que me imagino que la imagen anterior es lo que va calando para el común de los mortales.Edit: Silvergate Bank echa el cierre:https://forbes.es/ultima-hora/245345/el-criptobanco-silvergate-echa-el-cierre-y-liquidara-sus-operaciones/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "March 10, 2023, 04:01:47 AM",
      "body": "Bueno pues ya tenemos otro caso más, y esto parece el cuento de nunca acabar. Ayer se produjo un bajón en el precio del bitcoin debido en parte al cierre de Silvergate y además entiendo que en parte arrastrado por bolsas ya que Silicon Valley Bank también tiene problemas. Es el banco que ha estado financiando principalmente a las empresas tecnológicas, que ya sabemos que en los años de subida subieron mucho y ahora han bajado proporcionalmente. Esto arrastró a la banca y el resto de sectores. Hay que tener visión de largo plazo amigos. Se que esto puede ser desesperante porque llevamos mucho tiempo abajo y nos gustaría ver el precio subir, pero el negocio se hace ahora. Yo creo que fácilmente quien compre ahora va a multiplicar su dinero por 5 en un par de años y quizás sea hasta por 10. Cuando más pánico hay es cuando más hay que mantener la calma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 10, 2023, 06:10:19 AM",
      "body": "En términos de precio, a mí me cuesta ser optimista a medio/largo plazo. Será porque hoy el precio del bitcoin está en el mismo rango que cuando entré hace ya algo más de 5 años, por lo que uno piensa que, si en un lustro hemos regresado al punto de partida, qué hay en el horizonte para que tome el vuelo.También da la sensación de que el precio está hipersensibilizado a los acontecimientos de mercado cuando se trata de movimientos a la baja, y no tanto en sentido contrario. Esto es igual una visión más cortoplacista relativa a acontecimientos recientes. Para el común de las personas, estos factores puede que no influyan en nuestro pensamiento, pero se ve que hay masas (o aprovechados) que sí.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "March 10, 2023, 02:55:46 PM",
      "body": "Y todo parece indicar que hasta que no se corte esta sangria de caidas por un largo tiempo no vamos a ver demasiada luz al finald el tunel, salvo algun evento o dicho que cambie la tendencia de golpe.Esperemos que estemos ya en los ultimos eslabones de la cadena, pero es tal el pedal financiero que hicieron y los calces y descalces que hicieron que no sabemos nunca que tan profunda es la situacion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 10, 2023, 08:24:26 PM",
      "body": "Creo que el cierre de Silvergate no ha sido suficiente para los bajistas de Bitcoin y las estrellas rojas se han alineado recientemente.  Supuestamente el presidente de los Estados Unidos estaría trabajando en una propuesta para imponer un impuesto sobre la energía eléctrica utilizada con los mineros de Bitcoin, en el rango del 30%.Yo entiendo la urgencia de la transición energética, pero eso de cobrar un impuesto tan alto a los mineros (que ya en sí, dependiendo del estado del mercado puede perder dinero y obligarse a cerrar) creo que responde a un desconocimiento por parte de la rama ejecutiva de USA sobre las dinámicas del mercado.Si pretenden que la tasa de hash se aleje de su territorio a otros lugares del mundo con menos acceso a energía alternativas, ciertamente por esta vía lo han de conseguir.Última hora: Bitcoin cae por debajo de los USD 20,000 entre el presupuesto de Biden y el colapso de SilvergateFuente: https://es.cointelegraph.com/news/bitcoin-slips-under-20k-amid-biden-budget-silvergate-collapseQuotePor su parte, un documento explicativo sobre el presupuesto suplementario del 9 de marzo reveló que los criptomineros de Estados Unidos podrían estar sujetos a un impuesto del 30% sobre los costes de electricidad en virtud de una propuesta presupuestaria de Biden que pretende \"reducir la actividad minera.\"El documento en cuestión pueden encontrarlo aquí: https://home.treasury.gov/system/files/131/General-Explanations-FY2024.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "March 11, 2023, 08:45:49 AM",
      "body": "Quote from: DdmrDdmr on March 10, 2023, 06:10:19 AMEn términos de precio, a mí me cuesta ser optimista a medio/largo plazo. Será porque hoy el precio del bitcoin está en el mismo rango que cuando entré hace ya algo más de 5 años, por lo que uno piensa que, si en un lustro hemos regresado al punto de partida, qué hay en el horizonte para que tome el vuelo.Pero piensa que los ciclos económicos en el bitcoin no son lineales. Tú entraste en el pico del anterior ciclo. Yo me registré 6 meses antes cuando fue noticia el bitcoin por haber traspasado los 3.000 dólares, me había empezado a interesar por el tema sobre mayo/junio, cuando pasó los 2.000. Si hago una lectura personal análoga a la tuya no hay ninguna inversión que me hubiera dado entre un x7 y un x10 en 6 años: el S&P 500 ha dado un x1,5 en el mismo tiempo, el churrIBEX 35 está prácticamente igual (tendríamos que contar dividendos pero aun así la rentabilidad no es mucha), el oro un x1,7 etc. Hablo de inversiones que yo tengo o haya podido considerar seriamente, no de haber acertado de chorra alguna empresa small cap que haya dado una rentabilidad superior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 11, 2023, 08:47:42 AM",
      "body": "Quote from: Hispo on March 10, 2023, 08:24:26 PM<...>Ya veo que figura en la página 78 del documento. Citan que un impuesto del 30% (10% el primer año, 20%el segundo, y 30% del tercero en adelante) sobre el coste energético para los mineros podría reducir su actividad minera, en aras de una mejora en el impacto ambiental y \"otros daños\" no especificados.Con la propuesta, según consta en la página 213, esperarían recabar 74M $ en el 2024, 199M $ en el 2025, 327M $ en el 2026, y así hasta los 444 M $ en el 2033.La cifra es apenas nada dentro del marco del presupuesto general, y en cambio, de proceder (que intuyo que no, pero a saber), probablemente se cargue la industria minera en EEUU. No parece una idea demasiado inteligente.Ya puestos, podrían mirar por el impacto ambiental de los centros comerciales, entidades bancarias, aeropuertos, hospitales, y demás, que con el aire acondicionado tendrán su impacto ambiental por derivación, y tasarles a ellos el coste energético. Así, todos contentos…Quote from: Don Pedro Dinero on March 11, 2023, 08:45:49 AM<...>Cierto, todo es relativo al momento que uno mire, lo cual no quita que mi referente habitual comparativo, aun viendo la existencia de múltiple escenarios históricos, sea el del ATH del 2017.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "March 11, 2023, 03:26:28 PM",
      "body": "Hay un tema igual con eso, primero no se bien como sera la cuestion  en estados unidos a nivel energia/federalismo/estados.Segundo, muchas empresas de mineria habian empezado a optar por generar su propia energia por ende quedarian al margen de este impuesto.Tercero la que no, si bien no seria algo grato tranquilamente podria migrar al modelo de negocio del punto 2, mas si el petroleo sigue barato instalan varios grupos electrogenos grandes y se independizan y chau tu impuesto en la factura de la luz Biden.Respecto a SIlvergate.... cuando parecia ser de las ultimas piezas de domino cayendo se ve que desato otro maremoto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 11, 2023, 10:20:15 PM",
      "body": "Quote from: DdmrDdmr on March 11, 2023, 08:47:42 AMQuote from: Hispo on March 10, 2023, 08:24:26 PM<...>Ya veo que figura en la página 78 del documento. Citan que un impuesto del 30% (10% el primer año, 20%el segundo, y 30% del tercero en adelante) sobre el coste energético para los mineros podría reducir su actividad minera, en aras de una mejora en el impacto ambiental y \"otros daños\" no especificados.Con la propuesta, según consta en la página 213, esperarían recabar 74M $ en el 2024, 199M $ en el 2025, 327M $ en el 2026, y así hasta los 444 M $ en el 2033.La cifra es apenas nada dentro del marco del presupuesto general, y en cambio, de proceder (que intuyo que no, pero a saber), probablemente se cargue la industria minera en EEUU. No parece una idea demasiado inteligente.Ya puestos, podrían mirar por el impacto ambiental de los centros comerciales, entidades bancarias, aeropuertos, hospitales, y demás, que con el aire acondicionado tendrán su impacto ambiental por derivación, y tasarles a ellos el coste energético. Así, todos contentos…Exagerada, sin ninguna duda. Todos por aquí sabemos que el Gobierno de los Estados Unidos tiene un déficit preocupante con sus deudores, pero es ridículo como ellos pretenden ahuyentar una industria que se hace cada vez más y más competitiva en un país que sobrevive precisamente por ser altamente competitivo en muchas de las áreas importantes del desarrollo humano.Si esto pasa por el aro, será la hora de especular a donde se mudarán todos esos equipamientos de minería.Por cierto, eso de comparar el impacto ambiental de las industrias tradicionales que mencionas no puede entrar en la cabeza de los dinosaurios de siempre que dirigen la política, porque en sus mentes esos servicios son inamovibles y completamente esenciales (pues ellos crecieron con ellos), en cambio ven a Bitcoin como algo de chiquillos que no tiene mucho sentido y que cometieron el error de dejar crecer demasiado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "March 12, 2023, 05:06:13 AM",
      "body": "Estoy viendo en varios sitios miedo a que el caso de Silicon Valley Bank, que sucedió poco después de Silvergate y que hacía de banco de algunas empresas de criptomonedas,  sea de alguna manera como el Lehman Brothers de esta crisis y haya marcado el inicio de algo mucho peor.Corralito y sin nóminas: temor a un contagio global tras el colapso de Silicon Valley BankQuoteEl próximo día 15, miles de empleados de 'startups' en EEUU deberían cobrar sus nóminas. El desplome de Silicon Valley Bank lo va a hacer imposible y ya se teme un contagio en el sector tecnológico a nivel mundial<...>...colas de emprendedores, móvil en mano, siguiendo incrédulos las noticias, esperando ansiosos a retirar su dinero a la entrada de una de las sucursales de Silicon Valley Bank (SVB). La mayoría no lo consiguió. La entidad se fue ayer a la bancarrota, arrastrando hoy sábado a su filial en Reino Unido. El pánico se ha extendido ahora ante un posible contagio global en el sector tecnológico que puede tener ramificaciones inesperadas en muchos otros sectores. \"Esto es un asunto de seguridad nacional. Tengo a empresas llamándome para preguntarme, \"¡¿cómo voy a pagar a mis empleados la semana que viene?! Todo el dinero que uso para gestionar mi negocio está en una cuenta corriente a la que ya no tengo acceso\". Así resumía ayer la situación Garry Tan, el jefe de YCombinator, la principal incubadora de empresas tecnológicas de Silicon Valley. \"Estamos ante un evento de extinción masiva de empresas. El 30% de nuestras participadas no van a poder pagar las nóminas durante los 30 próximos días\", añadía.Esto me recuerda también a las colas en las sucursales de Northern Rock en UK en 2007, que fueron los primeros destellos de la crisis.No podemos saber a priori si estamos al principio de una catástrofe, pero estos varios hechos apuntan a ello. En todo caso es algo que veremos durante las próximas semanas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 12, 2023, 09:10:27 AM",
      "body": "Lo sorprendente del caso del Silicon Valley Bank es que la situación en la que se encuentra viene dada por invertir en bonos del estado (ahora que están de moda por estos lares) … Eso es la deliberadamente visión simplista, y realmente técnicamente uno de los ejes sobre el cual pivotan sus problemas, pero no la causa fundamental.Por lo que leí ayer, El banco financiaba las empresas del valle a cambio de tener su dinero en depósito, y con este dinero, el banco invirtió en bonos del estado. El problema es que lo que en una primera instancia parecía una buena inversión a algo así como el 1,5% si no recuerdo mal, se torna en una mala opción cuando tiene que vender bonos para cubrir una fuerte demanda de liquidez de sus clientes. Con los bonos del estado entorno al 4,5%, la cartera al 1,5% sólo se puede vender anticipadamente a pérdidas, y de ahí sus problemas. La otra componente es la causa de esta demanda de liquidez, que no es otra que la dificultad de financiarse al precio del dinero actual, optando las empresas del valle por retirar sus fondos (los cuales el banco había reinvertido en bonos del estado).El estado cubre los depósitos hasta 250K $ por depositante, y éstos se supone que los podrán dispensar el lunes mismo, pero la inmensa mayoría de los depositantes en el banco superan con creces este umbral, y de ahí que exista una enorme incertidumbre del impacto hacia sus clientes, muchas de ellas del ámbito tecnológico, y por ende, algunas dentro del ámbito de las criptomonedas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 15, 2023, 07:18:21 PM",
      "body": "Quote from: DdmrDdmr on March 12, 2023, 09:10:27 AMLo sorprendente del caso del Silicon Valley Bank es que la situación en la que se encuentra viene dada por invertir en bonos del estado (ahora que están de moda por estos lares) … Eso es la deliberadamente visión simplista, y realmente técnicamente uno de los ejes sobre el cual pivotan sus problemas, pero no la causa fundamental.Por lo que leí ayer, El banco financiaba las empresas del valle a cambio de tener su dinero en depósito, y con este dinero, el banco invirtió en bonos del estado. El problema es que lo que en una primera instancia parecía una buena inversión a algo así como el 1,5% si no recuerdo mal, se torna en una mala opción cuando tiene que vender bonos para cubrir una fuerte demanda de liquidez de sus clientes. Con los bonos del estado entorno al 4,5%, la cartera al 1,5% sólo se puede vender anticipadamente a pérdidas, y de ahí sus problemas. La otra componente es la causa de esta demanda de liquidez, que no es otra que la dificultad de financiarse al precio del dinero actual, optando las empresas del valle por retirar sus fondos (los cuales el banco había reinvertido en bonos del estado).El estado cubre los depósitos hasta 250K $ por depositante, y éstos se supone que los podrán dispensar el lunes mismo, pero la inmensa mayoría de los depositantes en el banco superan con creces este umbral, y de ahí que exista una enorme incertidumbre del impacto hacia sus clientes, muchas de ellas del ámbito tecnológico, y por ende, algunas dentro del ámbito de las criptomonedas.Lo curioso es que eso de invertir en bonos del estado a largo plazo es una táctica tan de libro y económicamente conservadora, que seguramente muchos otros bancos de mayor tamaño en los Estados Unidos hacen lo mismo. La diferencia es que también podemos creer que cuentan con activos más líquidos y con menos fricción que esos bonos, como Oro en sus bóvedas, en caso de que necesiten dar abasto a los retiros.Creo que la conclusión es que este fue un banco relativamente pequeño que quiso hacer dinero como lo hacen los bancos grandes. Impresionante como incluso maniobras supuestamente seguras puede llevar a esto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 17, 2023, 03:55:17 PM",
      "body": "Los hay que saben aprovechar las circunstancias, y ante la situación del Silicon Valley Bank, sacan a flor la oportunidad de hacer publicidad de aquello que consideren, en este caso, de bitcoin.Ver el video (1 minuto de duración): https://twitter.com/cryptograffiti/status/1635796416542158848Lo malo bueno es que no se la pueden devolver a bitcoin … no tiene sede ni delegaciones oficiales …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "March 18, 2023, 02:44:06 PM",
      "body": "Quote from: Hispo on March 15, 2023, 07:18:21 PMLo curioso es que eso de invertir en bonos del estado a largo plazo es una táctica tan de libro y económicamente conservadora, que seguramente muchos otros bancos de mayor tamaño en los Estados Unidos hacen lo mismo. Estos bonos del estado son para gente jugando con un presupuesto elevado de 10 a  100 milliones de € o $. Poca gente acá tendrá algo como tales montos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 26, 2023, 01:32:12 AM",
      "body": "Quote from: WillyAp on March 18, 2023, 02:44:06 PMQuote from: Hispo on March 15, 2023, 07:18:21 PMLo curioso es que eso de invertir en bonos del estado a largo plazo es una táctica tan de libro y económicamente conservadora, que seguramente muchos otros bancos de mayor tamaño en los Estados Unidos hacen lo mismo. Estos bonos del estado son para gente jugando con un presupuesto elevado de 10 a  100 milliones de € o $. Poca gente acá tendrá algo como tales montos. Obviamente, para sacarle jugo a los bonos con esas tasas de interés tan conservadoras, solo los bancos y personas de mucho dinero pueden tomar la ventaja de una táctica tan \"segura\" como esta.Creo que la desventaja es que estamos en una época en la que las tasas aumentan con una constancia tan relativamente alta, es que los bonos emitidos con anterioridad pierden su valor en el mercado secundario de forma considerable, es lo que entiendo que paso con el Banco Silicon Valley.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "April 05, 2023, 01:54:56 PM",
      "body": "Quote from: Hispo on March 26, 2023, 01:32:12 AMCreo que la desventaja es que estamos en una época en la que las tasas aumentan con una constancia tan relativamente alta, es que los bonos emitidos con anterioridad pierden su valor en el mercado secundario de forma considerable, es lo que entiendo que paso con el Banco Silicon Valley.Cada época tiene ventajas y desventajas. Hoy dia es más sencilla liberarse de la esclavitud, muchos mas facil que hace 1000 años.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}