{
  "id": "topic_5435582",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "January 17, 2023, 03:18:13 PMLast edit: January 26, 2023, 05:52:25 AM by Outhue",
  "content": "In this crypto space nobody is a fool except you are new to the crypto world and you decide to take a step without doing proper research, how can a stranger send you their login information for crypto exchange and tell you that they are entrusting you with their money and you believe? How can someone work for their money and have access to millions of dollars and you are the God-sent stranger they can give the key to the millions and you are promised a percentage of the whole part? Do you work for the money or what? You need to wise up, in this world today, people don't give up something without wanting something back, nothing is actually for free, so if someone contacted you on Twitter, Telegram, or any social media platform saying they can make you rich by helping them or they played dump as if they can't operate their wallet or account they are 100% scammers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435582",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "January 17, 2023, 03:28:19 PM",
      "body": "I'm not sure if they're the same. However, I have seen people on social media posting their secret phrases or private keys online and then asking for help because they don't know how to transact with the crypto they own and if anyone is willing to assist them. This is mostly done on the Tron network, which does not allow you to send assets in a wallet even if you have the secret phrase.As I previously stated, I'm not sure if it's the same as the one in Op because I've never seen or heard of anyone sharing their login details for an exchange with others unless they're having mental issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "January 17, 2023, 03:50:26 PM",
      "body": "I've seen this happen and the log in of the exchange they share is not like Binance exchange, they are cheap looking exchange and if you log in you will be required to make deposits, see this whole thing is a game for those scammers.They intentionally drop the recovery seed, when greedy people see the recovery seed they will go and import the seed behind the scene, thinking they are smart and that's when things will start going side ways. It's not a new trick a and just because you haven't seen it doesn't mean it doesn't exist. It was all intentional.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "January 17, 2023, 04:23:48 PM",
      "body": "Quote from: Outhue on January 17, 2023, 03:18:13 PMIn this space nobody is a fool except you are totally new to crypto and you decide to take a step without doing research, how can a stranger send you their log in information for an exchange and tell you that they are entrusting you with their money and you believe? How can someone have access to millions of dollars and you are the God sent stranger they can give the key to the millions and you are promised a share part? Do you work for the money? You need to wise up, in this world today, people don't give up something without wanting something back, nothing is actually for free, so if someone contacted you on Twitter, Telegram or any social media platforms saying they can make you rich by helping them or they played dump as if they can't operate their own wallet or account they are 100% scammers. I hoped I heard this story in face to face with a friend. He told me that this is the latest scam that going on now. A cryptocurrency expert will contact you and give you his wallet details and tell you that he can't transfer the coin because he has lost private key but the person can transfer the coin and in that process once the person enter the wallet he will see the coins live and the scammer would tell you to deposit a particular amount to transfer the money and once you pay your money and the coins all together would be moved to another wallet. I just thank God for the information my friend gave me. So everyone should be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "January 17, 2023, 04:58:36 PM",
      "body": "Only greedy people fall for such tricks. Those aren't new tricks anyway. Why will anyone want to reap where they didn't sow? The first time I saw that in one of the numerous telegram groups I was subscribed to was in 2021. It didn't move me a bit even though it was my first experience with such. The reason being that I've a mindset that nothing is ever free, both online and off it. There's always a catch. I always want to find out what the catch is. I was proved right a few weeks after that when someone complained of how they were duped through that method. Don't expect a philanthropist in this industry. They don't exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "January 17, 2023, 05:46:51 PM",
      "body": "I will never respond to incoming messages like that. when an unknown person sends a message that he needs help to retrieve his assets or other things related to high money, of course it's a scammer. No need to believe in this bullshit, I also keep getting messages about all kinds of prizes up for grabs, but I don't feel like I'm taking on quizzes or contests of the sort.Twitter, telegram which is the place for the most scammer messages. I blocked such an account from contacting me again.Never believe in the big prize bullshit, nothing is instant and no one is going to give a lot of money to a stranger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "January 17, 2023, 05:52:52 PM",
      "body": "It is safer to ignore all of these strangers who send links and other things. Already we are already 2023 and these direct strategies for committing fraud are not giving up. More people are beginning to understand these online modus operations. In order to gain the trust of their intended victim, some con artists will first attempt to speak casually. However, it is also carefully observing and waiting for the right moment to strike.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "January 17, 2023, 05:54:57 PM",
      "body": "Scammers are always come up with new ideas to scam people especially in cryptocurrency industry, I am not surprised seeing this that of strategy.but I believe many people that fall under victims scammers are those who are so agreed. I have came cross many of scammers in different social medias try to scam me with different methods but I done escape due to that I don't like doing money deal in social medias with person I don't for a long time. So everybody hav e to be very careful online especially newbies.but the best way to be avoiding this this kind of messages is for a person not to be exposing Gmail and always try to ignore any messages from strangers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "January 17, 2023, 06:01:25 PM",
      "body": "Quote from: Mpamaegbu on January 17, 2023, 04:58:36 PMOnly greedy people fall for such tricks. Those aren't new tricks anyway. Why will anyone want to reap where they didn't sow? The first time I saw that in one of the numerous telegram groups I was subscribed to was in 2021. It didn't move me a bit even though it was my first experience with such. The reason being that I've a mindset that nothing is ever free, both online and off it. There's always a catch. I always want to find out what the catch is. I was proved right a few weeks after that when someone complained of how they were duped through that method. Don't expect a philanthropist in this industry. They don't exist. I don't believe that it's only being greedy while being unaware of the danger. I was also almost scammed through a Discord group when I was promised a higher yield on a smart contact. It wasn't greed, but being completely unaware of the dangers and being fooled by someone posing as a group administrator. As funny as it may sound, even experienced users may fall victim under certain circumstances. But yes, for the most part, people still think there's a way to earn money quickly, but unfortunately, there's no such thing. Telegram and Discord groups are filled with these scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 17, 2023, 06:10:30 PM",
      "body": "Quote from: Outhue on January 17, 2023, 03:18:13 PMYou need to wise up, in this world today, people don't give up something without wanting something back, nothing is actually for free, so if someone contacted you on Twitter, Telegram or any social media platforms saying they can make you rich by helping them or they played dump as if they can't operate their own wallet or account they are 100% scammers. It's not even just today — it's pretty much the same since forever when talking about the internet/web. And unfortunately, delusional people will always exist — hence such scams will always exist. All we can do is to potentially lessen the number of victims a bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 17, 2023, 07:30:25 PM",
      "body": "Quote from: Cantsay on January 17, 2023, 03:28:19 PMI'm not sure if they're the same. However, I have seen people on social media posting their secret phrases or private keys online and then asking for help because they don't know how to transact with the crypto they own and if anyone is willing to assist them. This is mostly done on the Tron network, which does not allow you to send assets in a wallet even if you have the secret phrase.AFAIK, this is a different type of scam where anyone who imports the keys would see a balance in the wallet, but would need to make a deposit before they can send it out to cover the feea. This seems more believable as no one is directly prompting them to do anything and it looks like free money.The scammers has already used a sort of script which sends out any asset deposited into the address, so once they make a transaction,bit is instantly sent out from the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "January 17, 2023, 08:46:53 PM",
      "body": "Quote from: Outhue on January 17, 2023, 03:18:13 PM~Might be a little...off-topic, but kinda reminds me of those random followers in Twitter that poses as a hot girls, but would just bait you out for a dating scam which is another typical scams out there and they're targeting 30s to older people. How the crap would someone reach to certain stranger just to trust them randomly?If trust is even earned, what more could be said for money as well?I recall a lot of threads of what you mentioned. There are also those giving their PKs to you and entrusting you like \"wut\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "January 17, 2023, 09:17:03 PM",
      "body": "Quote from: Outhue on January 17, 2023, 03:50:26 PMI've seen this happen and the log in of the exchange they share is not like Binance exchange, they are cheap looking exchange and if you log in you will be required to make deposits, see this whole thing is a game for those scammers.They intentionally drop the recovery seed, when greedy people see the recovery seed they will go and import the seed behind the scene, thinking they are smart and that's when things will start going side ways. It's not a new trick a and just because you haven't seen it doesn't mean it doesn't exist. It was all intentional. even a novice wouldn't be too hasty to make such a mistake. even if they reveal their large enough balance to tempt you to open their account.currently, I see quite a lot of situations like this. and I'm sure there won't be enough people who can be fooled by scammers with such a model.just remember to ourselves to stay focused on what we have. never be too greedy to see opportunities or other people's property.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 17, 2023, 09:51:40 PM",
      "body": "Quote from: Outhue on January 17, 2023, 03:18:13 PMIt's a shame people still falling for thisand you decide to take a step without doing research, @OP, Have you been scammed before? If yes, how did it happen? You can quote me a reply if you like. But what you must know is that every body is not the same. While some people are so hard to crack, some people are too fragile and can easily be wined. There are some people who have high enthusiasm for the crypto space, but they don't have anyone to educate them on the knowledge they sick. They have read some articles and watched some videos, but all of that may not have exposed them to all the logic of scammers. But, like the popular saying goes, \"experience is the best teacher.\"There was some time around 2019 when my Facebook account got hacked. They successfully hacked my Facebook account after hacking my brother's first, and then the hacker sent me a message through my brother's own Facebook account. message from the hacker: \"Hello, big brother, please, I mistakenly added the wrong number to my Facebook account, so I need to replace it with my number, but I am not receiving an OTP, so I decided to initiate the OTP on your number; could you please pass me the OTP?\"I was so dumped at that moment that I just felt like I was doing something for my brother.To cut the story short, I noticed my Facebook account got logged out of my phone after sending the OTP to him, so I decided to call my brother and ask him what was going on; it was then that he told me his own account had been hacked an hour ago. I have also made the mistake of sending $50 Tron to an address on telegram with the promise to release $500 to me earned from airdrop.I have sent $100 to an address on Telegram too, all in the name of investing to get 50% in 12 hours. So there are just lots of logics used by scammers that a newbie has not become too familiar with. A warning I like to give newbies is to avoid every offer that seems too good to be true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "January 17, 2023, 10:27:07 PM",
      "body": "Yeah, we'll still have alot of peeps falling for the same thing again and again' ...... Even as everyone has been assumed to read this overtime in here.When I got registered, I realized so many things as the result of my taking time to study; I wasn't waiting for anyone to tell me what I was supposed to do cus I had a reason, and it motivated the potentials in me. Since I had an interest to forsee against any form of fraudulence, I got my ass stucked up in the most important discussions and I gradually got the knowledge in folds. I fear for the future: cus I realized most peeps won't learn until they get scammed already.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoPanda",
      "created_time": "January 17, 2023, 10:29:42 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on January 17, 2023, 09:51:40 PMsnipWhew! Looks like you have been scammed multiple times, glad you learned your lesson. Finding your way as a newbie can be difficult, newbies come into this space with dreams of making six figures. This makes them easy to scam, I don’t think scammers are creative they pretty much use the same old tricks. It works on greedy people who want to make thousands of dollars with a few bucks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "January 17, 2023, 10:41:20 PM",
      "body": "Quote from: Outhue on January 17, 2023, 03:18:13 PMIn this space nobody is a fool except you are totally new to crypto and you decide to take a step without doing research, how can a stranger send you their log in information for an exchange and tell you that they are entrusting you with their money and you believe? How can someone have access to millions of dollars and you are the God sent stranger they can give the key to the millions and you are promised a share part? Do you work for the money? You need to wise up, in this world today, people don't give up something without wanting something back, nothing is actually for free, so if someone contacted you on Twitter, Telegram or any social media platforms saying they can make you rich by helping them or they played dump as if they can't operate their own wallet or account they are 100% scammers. Experience crypto users don't fall for this because they know how that scams works, but newbies seeking new things and find something that can generate them money thru online sometimes they fall on this schemes and got victim by they think legitimate. They always use Trading or whatever related to crypto because this is somehow new thing on some people and always use this as trap for people who's innocent about such things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 17, 2023, 11:25:35 PM",
      "body": "Scammers always find a way to fool people no matter how smart they are, they always come up with a unique proposal where peoples fall into their trap and get scammed. Quote from: Outhue on January 17, 2023, 03:18:13 PMHow can someone have access to millions of dollars and you are the God sent stranger they can give the key to the millions and you are promised a share part? Do you work for the money?  No one with millions of dollars will come to me and give them a share of that money. With that scam strategy, only people with huge greed fall for it, even a newbie won't fall for it, if he or she has common sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martyns",
      "created_time": "January 18, 2023, 12:02:13 AM",
      "body": "Quote from: CryptoPanda on January 17, 2023, 10:29:42 PMQuote from: Dr.Bitcoin_Strange on January 17, 2023, 09:51:40 PMsnipWhew! Looks like you have been scammed multiple times, glad you learned your lesson. Finding your way as a newbie can be difficult, newbies come into this space with dreams of making six figures. This makes them easy to scam, I don’t think scammers are creative they pretty much use the same old tricks. It works on greedy people who want to make thousands of dollars with a few bucks. Exactly,you will only get scammed when you want to make excess money.Scammers are every where looking for people they will scam,but what will make you not to be a victim to their scam trick is when you have the ability to detect who a scam is,when you can also detect their techniques,and the skills they use.They used to say experience is the best teacher,if you have been scammed ones,I don't expect you to be scam again,except you are just too greedy,and rush after every link you see to make money.Be watchful,scammers are everywhere.protect your coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 18, 2023, 03:55:49 AM",
      "body": "Quote from: Upgrade00 on January 17, 2023, 07:30:25 PMAFAIK, this is a different type of scam where anyone who imports the keys would see a balance in the wallet, but would need to make a deposit before they can send it out to cover the feea. This seems more believable as no one is directly prompting them to do anything and it looks like free money.The scammers has already used a sort of script which sends out any asset deposited into the address, so once they make a transaction,bit is instantly sent out from the wallet.Pretty much. I'd imagine that this scam isn't one of those scams where the scammer could steal hundreds of thousands to millions with a single victim, but instead it's something that has a very low reward(small deposits for fees) but far higher chances of success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}