{
  "id": "topic_5417128",
  "title": "hostm",
  "author": "hostm",
  "created_time": "October 14, 2022, 05:36:12 PM",
  "content": "Рост индекса доллара загоняет всё в шорт. И акции, и крипту, и даже консервативные портфели. Что касается консервативных портфелей, в которых преобладают облигации, то такая ситуация была только в Великую Депрессию в США. А если смотреть по графику индекса доллара https://ru.tradingview.com/symbols/TVC-DXY/, такого роста индекса доллара не было с 1985 года. То есть на нашем веку такого не было. В 1985 году противопоставить росту индекса доллара способа не было. Тогда, кстати, из-за этого рухнул Советский Союз. Сейчас такой способ есть. ВСЕМ постоянно покупать биткоин на все свободные фиатные средства. Именно биткоин покупать, чтобы росла его капитализация. Не покупать альты. Менять альты на биткоин.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417128",
  "comments": [
    {
      "author": "Smartprofit",
      "created_time": "December 30, 2022, 02:55:57 PM",
      "body": "Quote from: hostm on October 14, 2022, 05:36:12 PMРост индекса доллара загоняет всё в шорт. И акции, и крипту, и даже консервативные портфели. Что касается консервативных портфелей, в которых преобладают облигации, то такая ситуация была только в Великую Депрессию в США. А если смотреть по графику индекса доллара https://ru.tradingview.com/symbols/TVC-DXY/, такого роста индекса доллара не было с 1985 года. То есть на нашем веку такого не было. В 1985 году противопоставить росту индекса доллара способа не было. Тогда, кстати, из-за этого рухнул Советский Союз. Сейчас такой способ есть. ВСЕМ постоянно покупать биткоин на все свободные фиатные средства. Именно биткоин покупать, чтобы росла его капитализация. Не покупать альты. Менять альты на биткоин.Мне нравится идея покупать bitcoin. Я даже готов заняться его закупками, если мне кто-то даст на это денег (приму денежные средства в дар).Но мне кажется очень странная идея противостоять каким-то глобальным экономическим трендам. Непонятно, как им можно противостоять?Понятно, что совместные действия всех людей в мире могут изменить ситуацию.Однако мир устроен так, что организовать совместные действия всех людей и даже их большой части практически невозможно.Точнее наверное это возможно, мы видели во время пандемии коронавируса, что все люди во всех странах мира действовали практически одинаково. Но это явно была не инициатива снизу.Для таких совместных действий была консолидирована сила всех государств и всех общественных организаций, при этом и цель была более понятна - борьба с вирусом.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MIner1448",
      "created_time": "March 20, 2023, 09:53:51 AM",
      "body": "Рост индекса доллара может оказать влияние на цену биткоина и других криптовалют, так как существует инверсная корреляция между долларом и биткоином. Когда доллар укрепляется, цена биткоина обычно падает, а когда доллар ослабевает, цена биткоина обычно растет.Это связано с тем, что биткоин является глобальной цифровой валютой, и его цена часто связана с курсами других валют и состоянием мировой экономики. Если доллар укрепляется, то это может означать, что другие валюты ослабевают, и инвесторы могут предпочесть инвестировать в доллар, а не в биткоин.Однако, стоит отметить, что на цену биткоина и других криптовалют также влияют множество других факторов, таких как принятие криптовалют правительствами и регулирующими органами, развитие технологии блокчейн, спрос и предложение на рынке и другие факторы. Таким образом, рост индекса доллара может оказать некоторое влияние на цену биткоина, но это не является единственным фактором, влияющим на его цену.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "March 20, 2023, 02:11:26 PM",
      "body": "Quote from: MIner1448 on March 20, 2023, 09:53:51 AMРост индекса доллара может оказать влияние на цену биткоина и других криптовалют, так как существует инверсная корреляция между долларом и биткоином. Когда доллар укрепляется, цена биткоина обычно падает, а когда доллар ослабевает, цена биткоина обычно растет.Это связано с тем, что биткоин является глобальной цифровой валютой, и его цена часто связана с курсами других валют и состоянием мировой экономики. Если доллар укрепляется, то это может означать, что другие валюты ослабевают, и инвесторы могут предпочесть инвестировать в доллар, а не в биткоин.Однако, стоит отметить, что на цену биткоина и других криптовалют также влияют множество других факторов, таких как принятие криптовалют правительствами и регулирующими органами, развитие технологии блокчейн, спрос и предложение на рынке и другие факторы. Таким образом, рост индекса доллара может оказать некоторое влияние на цену биткоина, но это не является единственным фактором, влияющим на его цену.Это ещё связано с тем, что цена Биткоина считается в долларах США (как основной фиатной валюте) )))Поэтому и доллар США, и Биткоин не могут расти одновременно (ведь они растут относительно друг друга).А вот что действительно влияет на рост или падение цены Биткоина, так это учётные ставки (ставки рефинансирования) Центрального Банка, в в случае США - это учётная ставка ФРС.Учётная ставка - это ставка по которой центральный банк даёт в долг национальную валюту коммерческим банкам .За счёт повышения или понижения учётной ставки можно регулировать силу национальной валюты. Дорогим доллар США (другая национальная валюта) бывает, когда учётная ставка повышается, дешёвым, - когда она понижается.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayTrain",
      "created_time": "March 22, 2023, 09:12:56 PM",
      "body": "Quote from: hostm on October 14, 2022, 05:36:12 PMРост индекса доллара загоняет всё в шорт. И акции, и крипту, и даже консервативные портфели. Что касается консервативных портфелей, в которых преобладают облигации, то такая ситуация была только в Великую Депрессию в США. А если смотреть по графику индекса доллара https://ru.tradingview.com/symbols/TVC-DXY/, такого роста индекса доллара не было с 1985 года. То есть на нашем веку такого не было. В 1985 году противопоставить росту индекса доллара способа не было. Тогда, кстати, из-за этого рухнул Советский Союз. Сейчас такой способ есть. ВСЕМ постоянно покупать биткоин на все свободные фиатные средства. Именно биткоин покупать, чтобы росла его капитализация. Не покупать альты. Менять альты на биткоин.Понимаю вашу обеспокоенность ростом индекса доллара и его влиянием на рынок акций, криптовалют и облигаций. Однако, предлагать всем покупать только биткоин может быть рискованным решением. Криптовалюты в целом являются высокорискованными инвестициями, и важно помнить, что их цены могут колебаться сильно и быстро. Каждый инвестор должен тщательно оценить риски и принимать решения, основанные на своих инвестиционных целях и финансовых возможностях.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "March 31, 2023, 07:19:15 PM",
      "body": "Quote from: hostm on October 14, 2022, 05:36:12 PMРост индекса доллара загоняет всё в шорт. И акции, и крипту, и даже консервативные портфели. Что касается консервативных портфелей, в которых преобладают облигации, то такая ситуация была только в Великую Депрессию в США. А если смотреть по графику индекса доллара https://ru.tradingview.com/symbols/TVC-DXY/, такого роста индекса доллара не было с 1985 года. То есть на нашем веку такого не было. В 1985 году противопоставить росту индекса доллара способа не было. Тогда, кстати, из-за этого рухнул Советский Союз. Сейчас такой способ есть. ВСЕМ постоянно покупать биткоин на все свободные фиатные средства. Именно биткоин покупать, чтобы росла его капитализация. Не покупать альты. Менять альты на биткоин. Рост индекса доллара на долгосроке - это объективная реальность. Ну факт тот, что сейчас, после непродолжительного накопления , он должен возобновить рост. Мне на глаза попадалась любопытная разволновка по волнам Эллиота от российского волновика, живущего сейчас в Португалии - Игоря Терещенкова, известного ютубера. Он провёл интересную работу по исторической реконструкции индекса доллара - присобачил слева к графику кусок исторического графика английского фунта стерлингов. Это дало возможность предсказывать дальнейшее движение индекса.QuoteЭто ещё связано с тем, что цена Биткоина считается в долларах США (как основной фиатной валюте) )))Поэтому и доллар США, и Биткоин не могут расти одновременно (ведь они растут относительно друг друга).Чисто теоретически такое возможно, особенно на средн и краткосроке. Дело в том, что индекс доллара - это не доллар, а средневзвешенная позиция доллара в корзине других мировых валют. Евро, фунт и т.д.  Если бакс растёт медленно к корзине других валют, а биток  - быстро ко всей корзине, то может быть их одновременный рост.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "April 05, 2023, 11:27:41 AM",
      "body": "Quote from: Julien_Olynpic on March 31, 2023, 07:19:15 PM Рост индекса доллара на долгосроке - это объективная реальность. Ну факт тот, что сейчас, после непродолжительного накопления , он должен возобновить рост. Мне на глаза попадалась любопытная разволновка по волнам Эллиота от российского волновика, живущего сейчас в Португалии - Игоря Терещенкова, известного ютубера. Он провёл интересную работу по исторической реконструкции индекса доллара - присобачил слева к графику кусок исторического графика английского фунта стерлингов. Это дало возможность предсказывать дальнейшее движение индекса.         Присобачить можно яйца к половым органам бабушки, но от этого ситуацию предсказать невозможно. Что-то пытаются все изобретать, но результат все также вероятностный. Сколько можно уже использовать различные индикаторы и пр. херню? Это всего лишь повторение цены и не более. Но нет... Пошли дальше. Ищут смысл там, где его и быть не может. Лишь бы только что-то выдать своей аудитории.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "April 05, 2023, 03:24:00 PM",
      "body": "Quote from: fruktik on April 05, 2023, 11:27:41 AMQuote from: Julien_Olynpic on March 31, 2023, 07:19:15 PM Рост индекса доллара на долгосроке - это объективная реальность. Ну факт тот, что сейчас, после непродолжительного накопления , он должен возобновить рост. Мне на глаза попадалась любопытная разволновка по волнам Эллиота от российского волновика, живущего сейчас в Португалии - Игоря Терещенкова, известного ютубера. Он провёл интересную работу по исторической реконструкции индекса доллара - присобачил слева к графику кусок исторического графика английского фунта стерлингов. Это дало возможность предсказывать дальнейшее движение индекса.         Присобачить можно яйца к половым органам бабушки, но от этого ситуацию предсказать невозможно. Что-то пытаются все изобретать, но результат все также вероятностный. Сколько можно уже использовать различные индикаторы и пр. херню? Это всего лишь повторение цены и не более. Но нет... Пошли дальше. Ищут смысл там, где его и быть не может. Лишь бы только что-то выдать своей аудитории.Твоё мнение любопытно, но хотелось бы более развёрнутого ответа. Серьёзно, без иронии). В твоих пассажах содержаться зачатки интересных аргументов, но, по-моему, ты до конца их не раскрыл. Мне сложно до конца понять суть твоих возражений, ибо они в целом малопонятны, но попробую конкретизировать, а ты потом уточни, что имел в виду, ибо я не силён в разгадывании.1. Затруднения в предсказаниях... возможно, ты имел в виду, что будущее не определяется прошлым?2. Вероятностный результат... а каким он ещё может быть в трейдинге?3. В чём скепсис в плане использования индикаторов, почему они - херня? Возможно, ты знаешь альтернативу? Возможно, ты можешь аргументировать недостатки индикаторов? 4. Тезис о повторении цены - можно поподробнее?5. Смысл, где его нет... Возможно, ты имел в виду теорию случайного блуждания цены? Ты являешься последователем этой теории?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "April 06, 2023, 07:03:42 AM",
      "body": "Quote from: Julien_Olynpic on April 05, 2023, 03:24:00 PMТвоё мнение любопытно, но хотелось бы более развёрнутого ответа. Серьёзно, без иронии). В твоих пассажах содержаться зачатки интересных аргументов, но, по-моему, ты до конца их не раскрыл. Мне сложно до конца понять суть твоих возражений, ибо они в целом малопонятны, но попробую конкретизировать, а ты потом уточни, что имел в виду, ибо я не силён в разгадывании.1. Затруднения в предсказаниях... возможно, ты имел в виду, что будущее не определяется прошлым?2. Вероятностный результат... а каким он ещё может быть в трейдинге?3. В чём скепсис в плане использования индикаторов, почему они - херня? Возможно, ты знаешь альтернативу? Возможно, ты можешь аргументировать недостатки индикаторов? 4. Тезис о повторении цены - можно поподробнее?5. Смысл, где его нет... Возможно, ты имел в виду теорию случайного блуждания цены? Ты являешься последователем этой теории?         Нет никакого смысла притягивать за уши какие-то исторические параллели, т.е. сравнивать индекс доллара и цену на Биткоин. Это может быть банальным совпадением и не более. В любой момент курс поменяет направление, когда многие из нас предполагают обратное на основании той информации, которая здесь была приведена.         Большинство индикаторов банально повторяют графическую формацию, т.е. все уже содержится на графиках. Вот и весь расклад. Конечно, объемы это отдельная история, но и они не могут ничего показывать точного.         Нет, не являюсь последователем теории случайного блуждания цены. Все же есть некоторые повторяющиеся закономерности.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "April 06, 2023, 03:50:01 PMLast edit: April 06, 2023, 04:03:47 PM by Julien_Olynpic",
      "body": "QuoteНет никакого смысла притягивать за уши какие-то исторические параллели, т.е. сравнивать индекс доллара и цену на Биткоин. Индекс доллара и биткойн - это не \"параллели\", а два актива-графика, которые движутся с очень высокой, но при этом обратной корреляцией. Любой уважающий себя аналитик просто обязан сравнивать эти 2 графика. Потому что паттерны одного графика могут дать подсказки для предсказания движения другого графика.QuoteБольшинство индикаторов банально повторяют графическую формацию, т.е. все уже содержится на графиках. Вот и весь раскладЭто очень примитивное суждение. Бро, без обид, я такого мнения придерживался в начале трейдерского пути, когда торговал на форекс-кухнях. Во-первых, такое повторение происходит не всегда. Например, на осцилляторах мы можем наблюдать дивергенции и конвергенции, которые с высокой вероятностью предсказывают движения основного актива.Во-вторых, на некоторых индикаторах типа RSI можно видеть образование графических паттернов, которые тоже эти движения помогают определять.Да и в графиках основного актива содержится не всё.QuoteКонечно, объемы это отдельная история, но и они не могут ничего показывать точного.Ты сейчас вычеркнул все Вайкоффо-подобные теории и в частности VSA.) Впрочем, бро, я не уверен, что ты знаешь об их существовании. Пребывай в блаженном негативном неведении.QuoteВсе же есть некоторые повторяющиеся закономерности.Так есть закономерности в ТА или их нет?) Что-то ты путано изъясняешься. Это немного противоречит вначале тобой написанному.Quote Сколько можно уже использовать различные индикаторы и пр. херню? Это всего лишь повторение цены и не более. Но нет... Пошли дальше. Ищут смысл там, где его и быть не может.Quote Это может быть банальным совпадением и не более. В любой момент курс поменяет направление, когда многие из нас предполагают обратное на основании той информации, которая здесь была приведена.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "April 07, 2023, 08:38:59 AM",
      "body": "Quote from: Julien_Olynpic on April 06, 2023, 03:50:01 PMТак есть закономерности в ТА или их нет?) Что-то ты путано изъясняешься. Это немного противоречит вначале тобой написанному.          Да, есть некоторые закономерности. Я написал в первом посте о том, что не хочу проводить параллели между какими-то ещё инструментами. Для меня это неприемлемо. Я действую из того, что вижу только на \"чистом\" графике. Вот моя основа. Даже про объемы не всегда вспоминаю, т.к. они в любую секунду могут поменяться. Так себе индикатор.          Нет, я знаю о чем вы пишите про VSA, но не хочу видеть это у себя в своем торговом алгоритме. Так яснее излагаю?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "April 11, 2023, 04:42:19 AM",
      "body": "Quote from: Ratimov on April 07, 2023, 08:52:01 AMQuote from: fruktik on April 07, 2023, 08:38:59 AMДаже про объемы не всегда вспоминаю, т.к. они в любую секунду могут поменяться. Так себе индикатор.Исходя из этой логики, первое, что вам надо выкинуть из вашей торговли, это график. Потому что нет ничего более переменчивого чем график. Меняется всё, к этому надо быть готовым, используя свои навыки и менеджмент. Есть трейдеры, которые смотрят чисто на объёмы и прекрасно себя чувствуют, значит это может работать и использоваться для заработка. Хотя я сам любитель только графика и не использую никаких индикаторов, говорить, что эти все индикаторы и показатели можно увидеть на графике, совсем неправильно. Это как в инвестировании, полагаться на один только график, выкидывая из своей аналитики капитализацию, предложение, FDV, итд. Ну а чё, зачем они нужны, ведь они и на графике есть, да и к тому же эти показатели постоянно меняются, так себе индикаторы.  В общем, то, что не используешь и не понимаешь, не стоит записывать в категорию бесполезных и малоэффективных.         Я забыл уточнить тот момент, что практически все индикаторы бесполезны только для меня. Не пользовался ими никогда. Вся торговля происходит только на основании той информации, которая есть на на \"чистом\" графике. Лично мне этого достаточно. Да, конечно, фундаментальный анализ также играет важную роль в торговом алгоритме для принятия решений. Единственное, что смотрю в последнее время, так это на объемы торговли.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 11, 2023, 11:50:00 AM",
      "body": "Quote from: fruktik on April 11, 2023, 04:42:19 AMQuote from: Ratimov on April 07, 2023, 08:52:01 AMQuote from: fruktik on April 07, 2023, 08:38:59 AMДаже про объемы не всегда вспоминаю, т.к. они в любую секунду могут поменяться. Так себе индикатор.Исходя из этой логики, первое, что вам надо выкинуть из вашей торговли, это график. Потому что нет ничего более переменчивого чем график. Меняется всё, к этому надо быть готовым, используя свои навыки и менеджмент. Есть трейдеры, которые смотрят чисто на объёмы и прекрасно себя чувствуют, значит это может работать и использоваться для заработка. Хотя я сам любитель только графика и не использую никаких индикаторов, говорить, что эти все индикаторы и показатели можно увидеть на графике, совсем неправильно. Это как в инвестировании, полагаться на один только график, выкидывая из своей аналитики капитализацию, предложение, FDV, итд. Ну а чё, зачем они нужны, ведь они и на графике есть, да и к тому же эти показатели постоянно меняются, так себе индикаторы.  В общем, то, что не используешь и не понимаешь, не стоит записывать в категорию бесполезных и малоэффективных.         Я забыл уточнить тот момент, что практически все индикаторы бесполезны только для меня. Не пользовался ими никогда. Вся торговля происходит только на основании той информации, которая есть на на \"чистом\" графике. Лично мне этого достаточно. Да, конечно, фундаментальный анализ также играет важную роль в торговом алгоритме для принятия решений. Единственное, что смотрю в последнее время, так это на объемы торговли.А где вы берете объем торговли? Вы сотрудничайте с биржами или маркетмейкерами, которые предоставляют вам настоящие данные?Я торгую иногда шиткоинами, где больше 90% объемов торговли может принадлежать маркетмейкерам. Фундаментальный анализ в этой торговле не нужен, только вероятность пампа.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 11, 2023, 12:04:51 PM",
      "body": "Quote from: Ratimov on April 11, 2023, 11:54:20 AMQuote from: safar1980 on April 11, 2023, 11:50:00 AMА где вы берете объем торговли?Я нигде не беру, нет такой надобности. Но вообще можно смотреть по различным сервисам или на трейдингвью.Quote from: safar1980 on April 11, 2023, 11:50:00 AMВы сотрудничайте с биржами или маркетмейкерами, которые предоставляют вам настоящие данные?Настоящие данные? Как-то смотрел скальпинг торговлю одного трейдера чисто по объемам и устанавливаемым стенкам, в режиме реального времени. Вполне себе жизнеспособная стратегия. Те данные, которые нам показывают биржи и различные сервисы, с ними тоже можно работать, и для этого не обязательно сотрудничать с биржами или маркет мейкерами.А трейдингвью эти данные не с биржи получает? Вы наверное биткоинами торгуйте где всегда много участников, а на шиткоинах в основном работают маркетмейкеры, которые эти объемы рисуют. Вы вроде писали что разочаровались в скальпинге и ушли на более длинные дистанции?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 11, 2023, 12:17:36 PM",
      "body": "Quote from: Ratimov on April 11, 2023, 12:10:29 PMQuote from: safar1980 on April 11, 2023, 12:04:51 PMВы наверное биткоинами торгуйте где всегда много участниковТорговал.Quote from: safar1980 on April 11, 2023, 12:04:51 PMа на шиткоинах в основном работают маркетмейкеры, которые эти объемы рисуют. Вы вроде писали что разочаровались в скальпинге и ушли на более длинные дистанции?Шиткоины, на то они и шиткоины, особенно с маленькой капитализацией, я туда никогда не совался. Понятное дело, что объемы в паре биток\\usdt на каком-нибудь кукоине это не одно и то же, что  и объемы на какой-нибудь торговой паре токенов на панкейксвапе. Я вообще перешел в долгосрочный инвест и портфельные инвестиции, это намного эффективнее чем биржевая дрочка на коротких дистанциях.А сейчас только шиткоины показывают результат. Каспа или Некса дали хорошую. прибыль, а весь фундаментальный анализ строился на развитии майнинга и продажи новой серии видеокарт, в чем заинтересованы производители видеокарточек. Много долларов в эти монеты не вольешь, но с 1000 долларов профит лучше, чем держать биткоины.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 11, 2023, 12:35:00 PM",
      "body": "Quote from: Ratimov on April 11, 2023, 12:27:49 PMQuote from: safar1980 on April 11, 2023, 12:17:36 PMА сейчас только шиткоины показывают результат.Какой результат? И в чём он выражается? В том, чтобы дать кучу иксов за короткий промежуток времени? Это что ли? Только я бы всё равно туда не совался. Лучше торговать тем же рипплом, битком или эфиром, например, они более понятны и прогнозируемы, чем всякие подобные токены, от которых неизвестно чего ждать.Исходя из своего опыта могу сказать, что я лучше буду торговать битком, который месяцами пульсирует в узком ценовом диапазоне 30-50%, чем полезу в какой-то шиток. Эти все каспы, нексы, радианты, и прочие пампящиеся проекты, их лучше использовать в качестве портфельной инвестиции, купил себе один разок и жди, пока накачается.Чем не результат если вложил тысячу, а забрал три? Они больше предсказуемы, чем биткоин, который \"возможно в верх, но есть вероятность, вернутся к лоям а также может и пофлетить\". То что майнится, не продаю, но эти монеты похожи на то, что их скоро забудут.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "April 12, 2023, 05:22:20 AM",
      "body": "Quote from: safar1980 on April 11, 2023, 11:50:00 AMА где вы берете объем торговли? Вы сотрудничайте с биржами или маркетмейкерами, которые предоставляют вам настоящие данные?Я торгую иногда шиткоинами, где больше 90% объемов торговли может принадлежать маркетмейкерам. Фундаментальный анализ в этой торговле не нужен, только вероятность пампа.          До такого уровня я ещё не дорос, когда бы мне предоставляли настоящие объемы по активам. Информацию беру там, где и все мы. Конечно, их можно спокойно нарисовать, но это хоть что-то, чем совсем ничего. Да, такое дело вводит в заблуждение, т.к. не имеем реальной картины положения дел. Так уж устроен спекулятивное поприще.           Вот по этой причине я стараюсь даже объемы редко применять в торговом алгоритме. Зачем лишний раз та информация, которую нельзя проверить? Только на графическую цену ещё как-то можно полагаться из-за того, что её есть вариант сверить с другими различными источниками.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 12, 2023, 10:53:32 AM",
      "body": "Quote from: Ratimov on April 11, 2023, 12:44:00 PMQuote from: safar1980 on April 11, 2023, 12:35:00 PMЧем не результат если вложил тысячу, а забрал три?Когда у тебя депозит тысячу, то конечно можно зайти туда, попытаться поохотиться за иксами, но когда у тебя торговый депозит 10-15 битков, то иксы тебя уже будут мало заботить, в первую очередь тебя будет заботить сохранение своего капитала и более-менее безопасная среда, выраженная в том, чтобы в твоей стратегии было как можно меньше риска.Quote from: safar1980 on April 11, 2023, 12:35:00 PMОни больше предсказуемы, чем биткоин, который \"возможно в верх, но есть вероятность, вернутся к лоям а также может и пофлетить\".Серьёзно? Ну попробуй предскажи, в каком диапазоне в ближайший год окажется цена этого nexa, чтобы зафиксировать прибыль или же, наоборот, выставить стоп-лосс, если стал играть на понижение? Биток или тот же риппл в сто раз прогнозируемее чем этот токен. Актив, который прошел несколько полноценных рыночных циклов по определению не может быть менее предсказуемее чем актив, который на рынке всего лишь 2 месяца.Безопасная среда это кошелек от разработчиков. Как вы торгуйте 10 биткоинами на биржах? Я не предсказатель, но если nexa нужна майнерам и производителям ГПУ, то цена монеты по моему должна двигаться верх. Стоп лоссы на таких монетах не требуются, купил за 5 центов и поставил продаваться по 10,15,20 центов. А сколько рипл будет в конце года?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 12, 2023, 02:25:50 PM",
      "body": "Quote from: Ratimov on April 12, 2023, 11:19:03 AMQuote from: safar1980 on April 12, 2023, 10:53:32 AMБезопасная среда это кошелек от разработчиков.Сафар, у тебя какие-то извращенные понятия об объемах, рисках, итд. У тебя всё в крайности уходит, если объемы посмотреть, то иди с биржами договаривайся, если создать вокруг себя максимально безопасную среду, то это только кошелек разраба. А кошельки разрабов тоже, бывает, хакают. Достаточно вспомнить, как обокрали проект NULS несколько лет назад.Quote from: safar1980 on April 12, 2023, 10:53:32 AMКак вы торгуйте 10 биткоинами на биржах?Никак, я не торгую, я же выше написал, я холдер.Quote from: safar1980 on April 12, 2023, 10:53:32 AMСтоп лоссы на таких монетах не требуются, купил за 5 центов и поставил продаваться по 10,15,20 центов.Интересно, откуда у тебя такая уверенность, что всё, что ты купил, должно вдруг начать расти? Не забывай, это не биткоин, а альткоин сфера, здесь даже многомиллиардный проект может за сутки схлопнуться и исчезнуть. Не забывай, что график альтов может мгновенно продемонстрировать ультра дилду как вверх, так и вниз. Всегда об этом помни, когда покупаешь какой нибудь шиток.Quote from: safar1980 on April 12, 2023, 10:53:32 AMА сколько рипл будет в конце года?Не ниже 30 центов и не выше 1,5 бакса. Мой прогноз, основанный чисто на уровнях.Мой опыт из общения с маркетмейкерами, которые предоставляют эти услуги для шиткоинов. Я говорил на чем основана моя уверенность и какими суммами я готов рисковать с шиткоинами. Если биржа исполнит ордер, то на таких дилдах можно немного заработать, пока биткоин флетует.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "April 13, 2023, 02:41:04 AM",
      "body": "Quoteздесь даже многомиллиардный проект может за сутки схлопнуться и исчезнуть. Всё же это не такое частое событие, как обычно об этом говорят. Много ли многомиллиардных проектов за последний год, например, в крипте за сутки \"схлопнулось и исчезло\"?Что обычно в качестве примера приводят? Ну экосистему Терра-луна, вроде проект Цельсиус (не уверен, что он был многомиллиардный, лень искать). При том что даже и Терра полностью не исчезла, хотя, конечно, депозиты жирных холдеров и трейдеров подобнулила.   Обычно пишут также, что малокапитализованные шитки склонны к скаму. Не знаю. Смотрю свой портфель, состоящий почти сплошь из шитков (причём многие за первую тысячу рейтингов) и вижу, что за последние пару лет скаму подвергся только один проект. В нём я участвовал в баунти по приколу много лет назад (Семакс). Да и то он умирал медленно, мучительно, много месяцев. Было много знаков и возможностей из проект выйти.   Смотрю старые рипплоподобные альты немодные ныне, которым скам пророчат - типа Битшареса. Ничего, проект живее всех живых, нормаз торгуется.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}