{
  "id": "topic_5486216",
  "title": "bookbits",
  "author": "bookbits",
  "created_time": "February 23, 2024, 12:58:30 PM",
  "content": "What happens if the smallest unit of bitcoin - a satoshi- becomes worth so much money that it cannot reasonable be exchanged for anything? Say one satoshi is the equivalent of $10,000 USD, then what good is it for actual exchange of goods and services, besides buying real estate or somesuch nonsense? Just a random thought I had, and I am no student of economics or computers, but I was curious as to proposed solutions or if this is just an irrelevant concern.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5486216",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "February 23, 2024, 01:34:03 PM",
      "body": "Quote from: bookbits on February 23, 2024, 12:58:30 PMSay one satoshi is the equivalent of $10,000 USDFor that to happen, 1BTC would be worth over $1 trillion. This is not a plausible hypothetical situation, if it does happen then that $10,000 would be so devalued that it would only be able to make small purchases, i.e it would be a result of inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bookbits",
      "created_time": "February 23, 2024, 01:36:18 PM",
      "body": "Fair enough, it is so unlikely that it is irrelevant as a concern. But it is theoretically possible, right? Only asking to make sure that I am not an idiot for thinking that it could theoretically happen, as I am new to bitcoin and am no expert of economics, computers, or bitcoin specifically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "February 23, 2024, 01:39:54 PM",
      "body": "Quote from: bookbits on February 23, 2024, 01:36:18 PM<snip>I don't see a world were the value grows that much for a single unit of Bitcoin, but in such a hypothetical situation, the smallest unit can be further broken down, this would mean the lowest division of bitcoin would be less than a Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "February 23, 2024, 01:40:18 PM",
      "body": "Quote from: bookbits on February 23, 2024, 12:58:30 PMWhat happens if the smallest unit of bitcoin - a satoshi- becomes worth so much money that it cannot reasonable be exchanged for anything? Say one satoshi is the equivalent of $10,000 USD, then what good is it for actual exchange of goods and services, besides buying real estate or somesuch nonsense? Just a random thought I had, and I am no student of economics or computers, but I was curious as to proposed solutions or if this is just an irrelevant concern.If sats has turn to have high value then what are we to say about bitcoin, it will indeed be scarce, more higher in value and also be well recognized, for now, its equivalent is just as the same rate bitcoin is worth, only that you will have to make your divisions into it smaller units through conversion, so the worth increase in not directly with sat but bitcoin because sats are what comprises to high value in bitcoin, this is my opinion on that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 23, 2024, 01:44:28 PM",
      "body": "1 Bitcoin is equal to 100 million Satoshis, and if we assume that one Satoshi is equivalent to 10,000 US dollars, then 1 Bitcoin is equal to 100M * 10K = one trillion.Thus, the total value of Bitcoin becomes 21 quintillionThis number is exaggerated, as the best estimate for all assets currently is equal to 500 trillion, or 500 Bitcoins, according to your calculations.The best we will reach is $2.4 million per Bitcoin, or $0.024 SATS, the current price is 1 SATS = $0.000510.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kr-sama",
      "created_time": "February 23, 2024, 01:45:21 PM",
      "body": "If Satoshi becomes so expensive that it cannot be exchanged for anything, it may create some problems for using bitcoin in everyday transactions. However, in this case, there are several possible solutions:1. Dividing Bitcoin into smaller units: If Satoshi becomes too expensive, it is possible to divide bitcoin into smaller units to facilitate transactions with smaller amounts. For example, you can create a new unit equivalent to 1/100 Satoshi to be able to conduct transactions with smaller amounts.2. Using Alternative Cryptocurrencies: If Bitcoin becomes impractical for small transactions, people may turn to other cryptocurrencies that may have smaller units or lower transaction fees.3. Using Secondary markets: If Satoshi becomes too expensive, people can start using secondary markets to exchange Satoshi for other cryptocurrencies or fiat money. This may be inconvenient, but it may be a temporary solution until more efficient ways of sharing become available.In general, the possibility of Satoshi becoming so expensive that it cannot be exchanged for anything is a theoretical problem, and the market and users are likely to find solutions for such situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "February 23, 2024, 01:53:25 PM",
      "body": "i one satoshi ever goes to a fiat value of $10.000, an on-chain transaction with a 1 sat/vbyte fee would cost more than one million USD. At this point, only L2 sollutions would be viable. One of the most known L2 sollutions (the lightning network) already uses msat as smallest denomination (one msat = 1/1000th of a sat). A payment on the lightning network also doesn't need those huge fees. You'd only use L1 for opening and closing channels a couple times in a lifetime.These L2 sollutions are more flexible, so it would be fairly easy to use microsat as smallest denomination instead of millisat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bookbits",
      "created_time": "February 23, 2024, 01:54:41 PM",
      "body": "Quote from: Kr-sama on February 23, 2024, 01:45:21 PMIf Satoshi becomes so expensive that it cannot be exchanged for anything, it may create some problems for using bitcoin in everyday transactions. However, in this case, there are several possible solutions:1. Dividing Bitcoin into smaller units: If Satoshi becomes too expensive, it is possible to divide bitcoin into smaller units to facilitate transactions with smaller amounts. For example, you can create a new unit equivalent to 1/100 Satoshi to be able to conduct transactions with smaller amounts.My only confusion is as to how one could continue to subdivide bitcoin without effectively \"creating\" more bitcoins, thus bypassing the 21 million unit hardcap. Its not that I don't believe you, I suppose I have the wrong understanding of what it means to make a smaller and smaller unit. Would that not merely be increasing supply, which is not supposed to be allowed? Or is it something that merely exists on a spreadsheet and doesn't really impact the value or supply or bitcoin overall?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 23, 2024, 02:09:00 PM",
      "body": "Quote from: mocacinno on February 23, 2024, 01:53:25 PMi one satoshi ever goes to a fiat value of $10.000, an on-chain transaction with a 1 sat/vbyte fee would cost more than one million USD. At this point, only L2 sollutions would be viable. One of the most known L2 sollutions (the lightning network) already uses msat as smallest denomination (one msat = 1/1000th of a sat). A payment on the lightning network also doesn't need those huge fees. You'd only use L1 for opening and closing channels a couple times in a lifetime.Then one million USD will not be the same value as the current million dollars. The economy has added 21 quintillion, which means that there are dozens of other 21 quintillion. Considering that today there are only trillions, one million dollars will be the same as the current 1 dollar. On-chain transactions can still be used. If we reach that level, Bitcoin may have moved to POS, or block size may have become large enough to make sat/vbyte sufficient to confirm the transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "February 23, 2024, 02:19:08 PM",
      "body": "There are three possible situations I could think of.1) Bitcoin will never reach that point: this might be unlikely because we are seeing so much growth and development already in 15 years. What more can bitcoin achieve with another 10 or 15 years? But just in case that somehow bitcoin does not gain any more value then that is when we can use it for everyday transactions and most people can own bitcoin or satoshis. 2) Smaller units: On the other hand, if bitcoin does reach the point of excessive value then there may be smaller unit than satoshis. This is to ensure that people who can not afford 1 btc can still afford to acquire bitcoin but in smaller parts.3) Altcoins will rise: Bitcoin is here to stay, yes but will it always be at the top? There is a possibility that an altcoin rises to the top and people will start to use it more than bitcoin. We can not always expect that bitcoin will always be the #1 cryptocurrency however currently it is.We can not exactly predict the future but I am excited to see how bitcoin will progress",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "February 23, 2024, 02:33:20 PM",
      "body": "Quote from: bookbits on February 23, 2024, 12:58:30 PMWhat happens if the smallest unit of bitcoin - a satoshi- becomes worth so much money that it cannot reasonable be exchanged for anything? Say one satoshi is the equivalent of $10,000 USD, then what good is it for actual exchange of goods and services, besides buying real estate or somesuch nonsense? Just a random thought I had, and I am no student of economics or computers, but I was curious as to proposed solutions or if this is just an irrelevant concern.This is illogical but I'm not disputing that it's not possible. 1 sats is right now is worth 0.0002616, for this price to even reach $2.616, bitcoin market cap has to do 1x 10^4, that means the Bitcoin market cap has to do 4trillion dollars and Bitcoin price will be around 4X which means it will be around $210,000 per a single Bitcoin. Now you are talking about $10,000 to a Satoshi, that's impossible because not even the amount of money that will be printed that will make Bitcoin that big because even with 100x, you wouldn't get the price of $10k from where I started 4x, it's not logical.Don't you know that a time will come when it will be difficult for Bitcoin to even do 2x? Imagine that bitcoin reach even $200,000k, you need more and more of the market cap to move the coin for it to double and where will that money comes from? Even with government intervention, it's not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "February 23, 2024, 02:45:57 PM",
      "body": "Quote from: bookbits on February 23, 2024, 12:58:30 PMWhat happens if the smallest unit of bitcoin - a satoshi- becomes worth so much money that it cannot reasonable be exchanged for anything? Say one satoshi is the equivalent of $10,000 USD, then what good is it for actual exchange of goods and services, besides buying real estate or somesuch nonsense? Just a random thought I had, and I am no student of economics or computers, but I was curious as to proposed solutions or if this is just an irrelevant concern.[Did you know?] Bitcoin Table of Units.1 BTC is 100M satoshi.Do you see $10,000 for 1 satoshi is too much ?Because Bitcoin will have its price as $10,000 / satoshi x 100M satoshi. It is too much expensive.1 cent for 1 satoshi is a dream of many people and we are still very far from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "February 23, 2024, 02:58:37 PM",
      "body": "It all depends on the situation.- If the exchange rate is so high because the fiat we are using for comparison has gotten dumped, then there is no reason to worry about. For example if a gallon of gas is worth $1 million it doesn't matter if 1 bitcoin is worth $1 trillion since the smallest unit is still not worth that much! Keep in mind that currently bitcoin is worth a lot against a lot of fiats (eg. 1 BTC = 184 billion VES).- If the exchange rate is high but that fiat hasn't dumped like the above scenario then there is a question of what is bitcoin being used at that time.-- Is bitcoin still a currency people use for day to day transactions (small or big) in which case the further division is required to help them continue using bitcoin-- Is bitcoin only a luxury by then? In such a scenario people aren't interested in small units being cheap. For example 1 \"unit\" of Lamborghini is worth a lot because that's just a luxury car even though it may be unpractical people still pay a ton of money for it. So there is no need for further division.Quote from: bookbits on February 23, 2024, 01:54:41 PMMy only confusion is as to how one could continue to subdivide bitcoin without effectively \"creating\" more bitcoins,If you have a gold ingot and break it in half, you will have small divisions but not more supply!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "February 23, 2024, 03:02:21 PM",
      "body": "Quote from: bookbits on February 23, 2024, 01:54:41 PMQuote from: Kr-sama on February 23, 2024, 01:45:21 PMIf Satoshi becomes so expensive that it cannot be exchanged for anything, it may create some problems for using bitcoin in everyday transactions. However, in this case, there are several possible solutions:1. Dividing Bitcoin into smaller units: If Satoshi becomes too expensive, it is possible to divide bitcoin into smaller units to facilitate transactions with smaller amounts. For example, you can create a new unit equivalent to 1/100 Satoshi to be able to conduct transactions with smaller amounts.My only confusion is as to how one could continue to subdivide bitcoin without effectively \"creating\" more bitcoins, thus bypassing the 21 million unit hardcap. Its not that I don't believe you, I suppose I have the wrong understanding of what it means to make a smaller and smaller unit. Would that not merely be increasing supply, which is not supposed to be allowed? Or is it something that merely exists on a spreadsheet and doesn't really impact the value or supply or bitcoin overall? If there's a smaller units than satoshi then it wouldn't be a mere increasing supply as it is already exist and people haven't used it yet but if it's in lighting network then people may have used it already since there's already a unit smaller than satoshi which is called millisatoshi which is as you can see smaller amount than satoshi then it wouldn't be a problem if ever that will happen in the future. I am not sure if there's a unit that is smaller than satoshi in bitcoin main network. If it is possible to make changes in bitcoin where there will be a new smaller unit than satoshi then that won't be a problem when satoshi price is $10k. In my opinion, I don't think that will happen in the future because as far as I know satoshi is the smallest unit in bitcoin unless you use lightning network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 23, 2024, 03:49:53 PMLast edit: February 23, 2024, 04:06:08 PM by franky1",
      "body": "first of alllwe are no longer in the first market cycle of 100x  ($0.30-> $30)we are no longer in the second market cycle of 40x ($30-> $1.2k)we are no longer in the third market cycle of 16x ($1.2k-> $20k)we are no longer in the fourth market cycle of 3.5x ($20k-> $70k)so dont expect 1 sat to be worth $10kthere will become a time when the market only matures between each ATH at a 2x rate. but mining hashrate grows independently. where by for hashrate to grow at more then 2x per cycle would then need bitcoin fee'sthis then comes into question how much fee is forced on users, and how many users pay it to create its own market dynamics of transaction utility on the block based on fee's rather then CEX market dynamicsif 1 lean tx is 226byte and is happy to pay $2.26 a tx, with the most economic fee being 1byte per sat meaning 1 sat=$0.01then 1btc would be $1mif 1 lean tx is 226byte and is happy to pay $22.60 a tx, with the economic fee being 1byte per sat meaning 1 sat=$0.10then 1btc would be $10mthings would get crazy if 1 sat was $10k(1btc=$1trill) because no one would then use it if the fee to use it was a minimum of $2.26millforget extreme irrational thoughts of 1sat=$10kinstead for rational purposeslets take this years realms of possibilityfees of $2.26->$226 as the low and high before chaos of people hating bitcoin due to \"high fee's\"if we moved to a era where fee's are measured in ~4sat per kb where 226byte is 1satthen 1sat can range from $2.26-$226so think more so of $226 as the extreme of 1sat before bitcoin becomes too expensive to use(i know new tx formats have lower VByte. and byte. but i prefer old school math of legacy format)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}