{
  "id": "topic_5427816",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "December 11, 2022, 12:18:28 PM",
  "content": "Bitcoin and The Support Trendline1W Timeframe3D Timeframe1D Timeframe",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427816",
  "comments": [
    {
      "author": "dimonstration",
      "created_time": "December 11, 2022, 12:26:37 PM",
      "body": "Next week is crucial on Bitcoin price since FOMC and CPI will release next week that might give a solid downtrend on Bitcoin price which might break this support trend line. I’m positive that next week will be the start of good bull run again if the result of the interest rate will be lower. I’m not updated on what’s the possible outcome but the timing of this meeting to the bullish month of crypto coincides that makes me positive on crypto market.Thanks for sharing this support trend line chart. I’m not aware that it’s already on that crucial level because I’m only browsing low timeframes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "December 11, 2022, 12:52:18 PM",
      "body": "Quote from: dimonstration on December 11, 2022, 12:26:37 PMNext week is crucial on Bitcoin price since FOMC and CPI will release next week that might give a solid downtrend on Bitcoin price which might break this support trend line. I’m positive that next week will be the start of good bull run again if the result of the interest rate will be lower.Yeah, the \"worry\" is that both numbers are expected to confirm that inflation is slowing down and interest rate hikes also to dampen -- and markets have clearly priced that in. If the numbers throw up trends against that, we might release this weak hold on 17k as it is.The trend lines do suggest we're way above the major support, so still some room to go down, but bears do appear to be running out of time as inflation rate increase does seem to be relenting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "December 11, 2022, 01:16:12 PM",
      "body": "Quote from: ImThour on December 11, 2022, 12:18:28 PMBitcoin and The Support Trendline1W TimeframeIf you observe carefully, there's a regular Bullish Divergence on the chart in 1W timeframe, also these divergences in such tfs are rarely seen but can be very significant.Quote from: buwaytress on December 11, 2022, 12:52:18 PMThe trend lines do suggest we're way above the major support, so still some room to go down, but bears do appear to be running out of time as inflation rate increase does seem to be relenting.Look at the Bitcoin Historical Volatility Index. Its at the lowest since 2018, a large move is coming, hopefully to the upside (guessing by the negative funding rates - lots of confident bears need to get punished)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 11, 2022, 05:31:03 PM",
      "body": "Quote from: ImThour on December 11, 2022, 12:18:28 PMBitcoin and The Support Trendline1W Timeframesomeone showing a chart. where they just draw a line.. is not evidenceits interesting. but not really anything concrete hard proof of supportyou have to use real world metrics to have evidence. not a simple MSpaint doodle linereal support:the cheapest way to acquire coin in any 6 month*i period is always the cheapest mining cost on the planetwhere by no one wants to sell below the real hard real world cost of the cheapest coin acquisition cost on the planetso:calculate the 6mon-2year*i mining cost. where they have 6mon-2year*i contracts on electric so are mining constantly for that length. meaning averaging out the hashrate chart by that length too to get the average cost of low cost mining.. this also means calculate the hardware costs of current gen EFFICIENT asic needed to perform network hashrate. where you set them at a 2 year run-til-dead lifecyclethen plot out the costs per period and then you will see a 'step up' of a \"bottom\" that sits below the market. yep use data outside the market. using stats found in real world data and cost. .. not just a silly mspaint line drawn on a chartexample mathif an asic was $4k for 140exa 3kwhif network was 220exa year average(earlier in year)=1,571,428.571 asics     =$6,285,714,286 2 year hardware life cost         =$1,571,428,571 6 month* hardware costif electric is base $0.04/kw =$0.12/asic per hour=$188,571.4286 per hour electric    =$823,680,000 per 6 month*coins per block=6.25=164062.5 per 6 month*=$1,571,428,571+$823,680,000 cost/164062.5 coins = $14,598.76 cost per coin** ...emphasis and repeating:\"the cheapest way to acquire coin in any 6 month period is always the cheapest mining cost on the planet\"no one on planet wants to sell below the lowest REAL COST of real world bills on the planetthe public speculative market then has a price above this line. which is speculative due to peoples higher costs and sentiments of their desires(the premium above the value)* efficient miners do not play to whims of daily hashrate or price changes. they have contracts of 6 months+ so mine constantly. **miners look at their contract length cost. and the coins acquired in same time scale then calculate individual coin cost from thati you can also do it the micro level of just one asic and its daily burn cost and its daily reward slice of sat amount and multiply it to a btc. which again also comes to a near on $15k efficient mining cost",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "December 11, 2022, 07:48:21 PM",
      "body": "It seems to me that the mathematics of calculating the cost of mining bitcoin might break down when it turns out that the cost of electricity is different everywhere. And some people even have access to a free power outlet. Then it turns out that the real cost of bitcoin might be even cheaper than 14k. But the chart doesn't tell us anything specific either, it only shows the probability of events. In this case it is up or down. The chart depends on the psychology of behaviour. Not mathematics. I also think we will see a bounce soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 11, 2022, 07:56:26 PMLast edit: December 11, 2022, 08:20:19 PM by franky1",
      "body": "Quote from: fzkto on December 11, 2022, 07:48:21 PMIt seems to me that the mathematics of calculating the cost of mining bitcoin might break down when it turns out that the cost of electricity is different everywhere. And some people even have access to a free power outlet. Then it turns out that the real cost of bitcoin might be even cheaper than 14k. againi am not talking about random electric pricesim talking about the MOST EFFICIENT (bottom*) of those random pricesyes im excluding the small scammers of electric thieves.. but real industrial costs(cheaper then residential) rateyes i say $0.04 rate*and yes hawaii is $0.40but those higher prices are the speculative market ABOVE the BOTTOMif you concentrate on the BOTTOM*. you then find the support for the BOTTOM*lets see it from another waymilkif you can find different dairy farmers who can milk a cow and send it out for $0.18   $0.20 $0.22.... $0.50you concentrate on the $0.18 and the 0.17 rate alone.. because ITS THE BOTTOMbecause its the bottom no farmer on the planet can produce for less than 0.18 and by the time it gets to market a retailer is market milk for more then $0.18where by if can swing from anywhere between $0.20 -$0.50 a pint...lets go back to discussing bitcoin miningin 2022cheap industrial mining is at a low of ~$15kexpensive hobby mining is at a high of ~$90kso the market price wil wiggle in that window between 15-90..last year the expensive hobby mining was at a high of ~$75kthis is where everyone on the planet could mine for less than $75k which is why no one wanted to BUY bitcoin for over $70k as they could get it for less elsewhere.. hence the ATH topped out at $70kbitcoin would not have gone to $100k because the majority could find it cheaper elsewhere. so there is no support for a $100k ATh last yearopposite is true if you cant acquire it cheaper anywhere else you wont sell for less thus a low barrier of support of people refusing to sell for less* bottom cost is not:the scammers that stole free coins and selling at any cost-because thats not ongoing repeats. its a one time deal and gonethe electric theives-because they are small/temporary and dont affect the industry majoritythe aliens from the future using xenohash asics to prove maths wrong-because thats not sciencebottom cost isactual rational and sustainable low cost of actual industrial size mining enough to be a push factor of the bottom",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}