{
  "id": "topic_5430374",
  "title": "jaccore",
  "author": "jaccore",
  "created_time": "December 20, 2022, 04:59:07 AM",
  "content": "Thank you for your interest in the Jackdaw Project, a new digital scarcity experiment on the Evrmore blockchain. We humbly extend our gratitude to Evrmore's core development effort, and all those who preceeded it. Likewise, we extend our thanks to the btctalk community for it's contributions to both the Bitoin and Altcoin ecosystems.The messaging Jackdaw Project is outlined in its announcement video: https://youtu.be/5ZSy_2dhQoc Premiere 12202022120100EST [IPFS Mirror can be in Token Supply on-chain]Tokenomics:Parent Blockchain: Evrmore Github: https://github.com/evrmoreorgANN thread: https://bitcointalk.org/index.php?topic=5416790.0Total Token Supply: 100 Jackdaw TokensFounders Reward: 0, all Jackdaw will be distributed to the general publicDistribution method: PoN (social distribution)Genesis Method: Evrmore \"Main Asset\" Token, 100 MATokens were generated for JackdawGenesis TX Hash: d6ca123404a0992d401de05636060503fc8bf62af9f11a6c46f077d7d467c4d8Genesis Address: Eg52k7uKnRjFSsvAZoWYnuwtCkdjjKiFNMDistribution Address: EJAa55qxsHGnCifbRGa9sH6joNyVGCe5kWGeneral Announcement: 122022On-chain Announcement was made one day prior in IPFS hashes across the creation of the #JACKDAW Qualifier Asset Token on EvrmoreThis topic may or not be monitored for distribution purposes, but will not be updated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430374",
  "comments": [
    {
      "author": "kaigeta",
      "created_time": "June 18, 2023, 04:43:15 AM",
      "body": "The distribution phase for this project has ended and an OTC market is now available through the Birdhouse discord. https://discord.gg/ZtV5rvYPtBThanks to everyone who participated in the launch of Jackdaw.Onward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaigeta",
      "created_time": "October 18, 2023, 01:48:33 PM",
      "body": "The next phase of the Jackdaw project has begun. Come take part in a truly unique digital scarcity experiment built on the Ravencoin code base.Announcement video: https://www.youtube.com/watch?v=wEWqSYIXlVw",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaigeta",
      "created_time": "November 07, 2023, 10:20:42 PMLast edit: January 01, 2024, 03:52:57 AM by kaigeta",
      "body": "Quote from: kaigeta on October 18, 2023, 01:48:33 PMThe next phase of the Jackdaw project has begun. Come take part in a truly unique digital scarcity experiment built on the Ravencoin code base.Announcement video: https://www.youtube.com/watch?v=wEWqSYIXlVwThe Jackdaw projects' distribution phase is off to a great start! We've distributed roughly half of the total supply of Jackdaw (limited to 50 tokens) to over 8000 Ravencoin addresses, making Jackdaw one of the most widely distributed, yet limited, tokens on the Ravencoin blockchain.Today we announced a public faucet for those who missed out on Jackdaws initial giveaways and airdrops!That being said the faucet is open to everyone, if you've been able to get a fraction of a Jackdaw this will be a great way to increase your holdings, or if you've already got a full Jackdaw, this will certainly help you creep up the richlist Smiley. Both the faucet and Jackdaw are experimental, so let us know if you have any issues. Huge shoutout to the RavenRocket team for putting the tool together, it makes it super easy for anyone to run a RVN faucet!Quick links:Project Discord: https://discord.com/invite/MAAS7et4vUJackdaw Announcement video: https://www.youtube.com/watch?v=wEWqSYIXlVwFaucet: https://www.rocketraven.net/u/TheBirdhouse/faucet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}