{
  "id": "topic_5465738",
  "title": "Question:",
  "author": "dragonvslinux",
  "created_time": "September 05, 2023, 12:45:04 PM",
  "content": "As sourced from here, the mempool registered a total of 613K+ transactions today, with a slight increase of average transaction cost in recent days from around 6 to 15 sats/vB.Do people think this high usage is good or bad for Bitcoin? Are there still many inscriptions being made on the network or is this more financial transactions?Although I prefer the mempool priced around 4-6 sats/vB, I'm also happy being patient if not urgent, like most network users it seems.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465738",
  "comments": [
    {
      "author": "EL MOHA",
      "created_time": "September 05, 2023, 12:58:02 PM",
      "body": "Quote from: dragonvslinux on September 05, 2023, 12:45:04 PMDo people think this high usage is good or bad for Bitcoin? Are there still many inscriptions being made on the network or is this more financial transactions?With the discussion I read this morning concerning same thing according to DdmrDdmr, this is a case of ordinal inscriptions that was experienced before. They currently take up to 90% of block size and this has resulted in the hike of transaction fees. So as it stands it is a clear case of ordinal attacks again where they intentionally pay higher fees even higher than the output. My curiosity is why because certainly running it this way and with the fees they are paying then it would result into loss to me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 05, 2023, 01:09:57 PM",
      "body": "I don't find any of the 4 answers suitable for me. Maybe the closest to what I think is that it should be cleared quicker, but that's not going to happen as long as a lot of people keep spamming the mempool with ordinals. It's not so much a question of speed of clearance as of people willing to pay ever increasing fees for something that is not what the Bitcoin blockchain was originally intended for.In the last month or so there were still a lot of transactions in the mempool but the fees went down. I don't know if it's back from the August vacations that the spammers are back to work, so to speak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 05, 2023, 01:17:43 PM",
      "body": "It's not a big concern. Fees are very manageable at 10-12 sats/vbyte as compared to say, May when fees went through the roof at hundreds of sats per vbyte.A chunk of Ordinals transactions here and there are is enough to clog the network. Most likely, the majority of these 6-7+ sats/vbyte transactions will be cleared within several days if not sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "September 05, 2023, 02:05:38 PM",
      "body": "It is due to the Bitcoin Ordinals and most of these transactions are dust transactions, I would approach and If any Bitcoin Core Developer is here, please try to prioritize less for these Dust transactions as they are blocking the way for other people who really want to use Bitcoin Network for something important, like paying for something with Bitcoin etc. These Ordinals guys need to go somewhere else, BTC Network isn't made for these things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 05, 2023, 02:07:22 PM",
      "body": "Raised mempool activity is good and bad. Large transaction numbers indicate a well-used network. This shows Bitcoin is a functional financial ecosystem, not just a speculative asset, inspiring advocates.However, transaction expenses rose. The increase from 6 to 15 sats/vB indicates network congestion and may discourage microtransactions, making them less accessible to the typical user. High usage may induce \"network discrimination\" that prioritizes high-value transactions, making it ineffective.This activity is inscriptional or transactional? Hard to say. But the second one could increase chain traffic, which isnt always bad. More layer 2 options could improve the Bitcoin network. Although waiting patiently for confirmations is a virtue, shouldnt the goal be to remove it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 05, 2023, 02:29:55 PMLast edit: September 05, 2023, 02:44:24 PM by Hamza2424",
      "body": "Quote from: ImThour on September 05, 2023, 02:05:38 PMIt is due to the Bitcoin Ordinals and most of these transactions are dust transactions, I would approach and If any Bitcoin Core Developer is here, please try to prioritize less for these Dust transactions as they are blocking the way for other people who really want to use Bitcoin Network for something important, like paying for something with Bitcoin etc. These Ordinals guys need to go somewhere else, BTC Network isn't made for these things.Haha, dear seniors we had discussed it a lot of times and it seems like they don't listen up to us, these ordinary guys are deaf and blind whenever we say please go somewhere else, to control the situation don't eh control the network there is a possible solution for which everyone will listen up haha because as they aren't listening up to us from a long time need to be hard with the words actions so best solution is, Satoshi needs to announce that \"get out of my network\". Besides that Op I think for now things are going smoothly, a bit of delay still at least I'm okay with it, Why do people just spam the meme pool, There should be a priority-based meme pool, but the efficient implementation for that is also not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 05, 2023, 04:21:15 PM",
      "body": "All this has happened before, and it will happen again.Ordinals are just the newest Magical Internet Money Machine thing. Eventually the scammers making them and the suckers buying them will move on.Will they move to another coin or network to pump their crap? Who knows. For now, unless you are combining a lot of small inputs, there is an increased cost to your you TX in the next block or 2, but it's not an incredibly large amount of sats like has happened in the past.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smeet",
      "created_time": "September 05, 2023, 04:26:51 PM",
      "body": "High usage of the Bitcoin network can be seen as both positive and negative, depending on the context and perspective.Positive Aspects: High transaction volume can show growing adoption and use of Bitcoin as a means of transferring value and conducting financial transactions. This is showing increased interest and utility in the cryptocurrency.Negative Aspects: On the downside, a congested mempool with high transaction fees can hinder small-value and everyday transactions, making Bitcoin less practical for microtransactions. It can also lead to slower confirmation times for transactions, which might not be ideal for time-sensitive payments.I would say anything less than 15sat/vB is considered low fee and if we're able to reach record transactions at a low fee, it's a win in my eyes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 05, 2023, 04:34:25 PM",
      "body": "Quote from: ImThour on September 05, 2023, 02:05:38 PMIt is due to the Bitcoin Ordinals and most of these transactions are dust transactions, I would approach and If any Bitcoin Core Developer is here, please try to prioritize less for these Dust transactions as they are blocking the way for other people who really want to use Bitcoin Network for something important, like paying for something with Bitcoin etc. These Ordinals guys need to go somewhere else, BTC Network isn't made for these things.I don't think Bitcoin developers can do anything about this, miners will go for maximum profit. I miss the days those scam tokens were all on shitcoin chains such as centrally controlled and premined Ethereum. Weirdly though, I think Ethereum profited big time from the \"popularity\" it gained from hyping the scam tokens. That really gave it it's name. Bitcoin on the other hand already made a name for itself, so I don't expect anything good to come from this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "September 05, 2023, 05:03:48 PM",
      "body": "The actual reason why the network is congested was posted by DdmrDdmr,Quote from: DdmrDdmr on September 05, 2023, 08:16:34 AMAs per my Ordinals Dashboard (I’ve just updated it), block 806280 contains 7.292 Ordinals out of the 7.616 TX, occupying 91,6% of the block (see \"Weight of Ordinals per Block\" on the Dashboard). If you filter the said block on the \"OrdinalsOrdinalTx List\", you’ll see that they are all similar to this (*):https://ordinals.com/inscription/d9d0920f37c1ba8688a43a4d01943132fe98319bb271e72c4011b7798caf3354i0Ordinals are averaging between 9 and 12 sat/vB per day over the past week which have risen a fair share from the 6 to 7 sat/vB during august, and since they’ve been occupying and average of 40+% of the blocksize over the past few days (it had been in the 20%-30% range for some days previously), I figure this all sums up the current fees, still distant to those that were around some months ago, but still.(*) BRC-20 json files. See: https://trustmachines.co/learn/what-is-brc-20-token-standard/Quote from: dragonvslinux on September 05, 2023, 12:45:04 PMDo people think this high usage is good or bad for Bitcoin? Are there still many inscriptions being made on the network or is this more financial transactions?High usage means more people are using but it's not the case, it's just the spam attack by the BRC-20 tokens which means its temporary and definitely affects the people by forcing them to pay more on the fee.As I said it is a temporary attack, sooner or later we can expect the spam attack to vanish over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smeet",
      "created_time": "September 05, 2023, 06:21:06 PM",
      "body": "Quote from: Findingnemo on September 05, 2023, 05:03:48 PMThe actual reason why the network is congested was posted by DdmrDdmr,Quote from: DdmrDdmr on September 05, 2023, 08:16:34 AMAs per my Ordinals Dashboard (I’ve just updated it), block 806280 contains 7.292 Ordinals out of the 7.616 TX, occupying 91,6% of the block (see \"Weight of Ordinals per Block\" on the Dashboard). If you filter the said block on the \"OrdinalsOrdinalTx List\", you’ll see that they are all similar to this (*):https://ordinals.com/inscription/d9d0920f37c1ba8688a43a4d01943132fe98319bb271e72c4011b7798caf3354i0Ordinals are averaging between 9 and 12 sat/vB per day over the past week which have risen a fair share from the 6 to 7 sat/vB during august, and since they’ve been occupying and average of 40+% of the blocksize over the past few days (it had been in the 20%-30% range for some days previously), I figure this all sums up the current fees, still distant to those that were around some months ago, but still.(*) BRC-20 json files. See: https://trustmachines.co/learn/what-is-brc-20-token-standard/As I said it is a temporary attack, sooner or later we can expect the spam attack to vanish over time.Ah, reading more about this - it has been going on for a while: https://forkast.news/bitcoins-mempool-congestion-ordinals-inscription/ I wonder how much its costing them to occupy 20-30% of the blocksize consistently.Might be a while before we get to pre-February levels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 05, 2023, 07:40:01 PM",
      "body": "That does look good as it indicates that there are more transactions and demand is increasing.Quote from: dragonvslinux on September 05, 2023, 12:45:04 PMAlthough I prefer the mempool priced around 4-6 sats/vB, I'm also happy being patient if not urgent, like most network users it seems.I also prefer that but most likely happy to see if it will be back to 1 sat/byte. I was able to do a transaction back then and I was 1 sat/vb short with the fee that I've paid and it took a very long time before it was able to get confirmed by a miner. That sucks and I don't want that to happen again to me. Currently, the fees have gone up to 16 sat/vb - 23 sat/vb and this is quite high already and likely that it won't be back a bit anymore. If your transactions are urgent and needed to be done and needs confirmation as soon as possible, pay the priority fee if you don't want headache.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 05, 2023, 07:51:26 PM",
      "body": "Now it's not a problem. But it has the potential to either fuel even bigger investments in mining hardware, either to keep the price low/lower for longer, since it means bigger revenue for miners.And on long(er) term this may have interesting consequences (which we may see only in some 3 more years, like high difficulty vs new crypto winter).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "September 05, 2023, 08:55:21 PM",
      "body": "Quote from: Smeet on September 05, 2023, 04:26:51 PMPositive Aspects: High transaction volume can show growing adoption and use of Bitcoin as a means of transferring value and conducting financial transactions. This is showing increased interest and utility in the cryptocurrency.I highly doubt it counts as a positive when the mempool is being spammed with the transactions that is clogging it.Increased interest will be indicated by an increase in regular day to day transactions being made on the network and not short busts or spike in unconfirmed transactions.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 05, 2023, 09:34:07 PM",
      "body": "Quote from: ImThour on September 05, 2023, 02:05:38 PMI would approach and If any Bitcoin Core Developer is here, please try to prioritize less for these Dust transactions as they are blocking the way for other people who really want to use Bitcoin Network for something important, like paying for something with Bitcoin etc.BTC core developers don't confirm transactions, it is the miners that confirm tx's and they are going to prioritize the tx's that pays the higher fees, even if \"we\" don't like those transactions.Quote from: ImThour on September 05, 2023, 02:05:38 PMThese Ordinals guys need to go somewhere else, BTC Network isn't made for these things.I agree with you, but because of taproot upgrade they found a way to do this on the BTC blockchain. Take note as well that the BTC network is also censorship resistant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "September 05, 2023, 09:42:05 PM",
      "body": "Quote from: dragonvslinux on September 05, 2023, 12:45:04 PMAs sourced from here, the mempool registered a total of 613K+ transactions today, with a slight increase of average transaction cost in recent days from around 6 to 15 sats/vB.Do people think this high usage is good or bad for Bitcoin? Are there still many inscriptions being made on the network or is this more financial transactions?Although I prefer the mempool priced around 4-6 sats/vB, I'm also happy being patient if not urgent, like most network users it seems.No, this is not how Bitcoin was designed to work. Damn ordinals/inscriptions spammers are back! Legit transactions (coins transferred from one wallet to another for financial purposes) make up only a tiny % of total transactions, so there is a huge space to grow (but only if spam transactions are eliminated).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 05, 2023, 09:43:45 PM",
      "body": "I didn’t realize the mempool was on the creep again but from looking at the data it does appear to be mostly very low fee transactions, so it isn’t stopping much real volume from hitting the blockchain. I actually don’t see anything wrong with transactions waiting to be included on the chain and miners should be happy that they have a backlog of revenue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "September 05, 2023, 10:03:05 PM",
      "body": "Quote from: dragonvslinux on September 05, 2023, 12:45:04 PMDo people think this high usage is good or bad for Bitcoin? Are there still many inscriptions being made on the network or is this more financial transactions?As another user said, legitimate transactions make up a very small percentage of total transactions. Inscriptions/ordinals are definitely the cause...however, this isn't a bad thing for Bitcoin. New technology must always be challenged in order to improve and succeed...If Bitcoin can scale to be able to easily manage inscription/ordinal overflow, then real scalability for business use cases will be much higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "September 05, 2023, 10:06:46 PM",
      "body": "Quote from: dragonvslinux on September 05, 2023, 12:45:04 PMAlthough I prefer the mempool priced around 4-6 sats/vB, I'm also happy being patient if not urgent, like most network users it seems.My transactions typically have 1 input 2 outputs so 10-20 sat/byte is not a problem for me. However, I have a growing backlog for some consolidation, and with over hundred inputs every sat/vB matters. I really-really want to see 1-2 sat/vB fees at some point in the future, I hope that ship hasn't sailed.But this ordinals nonsense can go on for years, and then some other nonsense will be invented to keep misusing the block space. We're in a spot when this problem is not big enough to warrant a hard fork, but annoying enough for users to notice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}