{
  "id": "topic_5457702",
  "title": "GiMa-Maya",
  "author": "GiMa-Maya",
  "created_time": "June 26, 2023, 10:41:02 PM",
  "content": "Hey there. I’m working on an integration and I’m looking for a JSON-RPC spec for Wallets for Bitcoin. (Similar to this one from Ethereum https://ethereum.org/en/developers/docs/apis/json-rpc/ ). Does it already exist? Thank you in advance",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457702",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "June 26, 2023, 11:51:37 PM",
      "body": "With a little bit of research using Google you can find them.Anyway, check these links that I gather from Google these might be what you looking for.- https://en.bitcoin.it/wiki/API_reference_(JSON-RPC)- https://developer.bitcoin.org/reference/rpc/- https://github.com/bitcoin/bitcoin/blob/master/doc/JSON-RPC-interface.mdIf you don't mind can I ask if you are planning to develop your own wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 27, 2023, 11:56:31 AM",
      "body": "It's better to use Bitcoin JSON-RPC only for querying stuff like transactions (including when you create a temporary wallet to harvest the list of address transactions), fees, block height, UTXOs (can be done without a wallet), and so forth.It is not advisable to store the wallet itself inside Bitcoin Core because it has questionable wallet loading speed, especially for wallets with many keys and/or transactions, expect it to take hours. But instead, you should try to fetch transaction data once and store it locally in a file.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiMa-Maya",
      "created_time": "June 28, 2023, 08:59:28 PM",
      "body": "Hey. We’re going to add Bitcoin to Wallet Connect. For that, we need a RPC, and add a namespace for bitcoin here https://github.com/ChainAgnostic/namespaces#",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}