{
  "id": "topic_5433263",
  "title": "mandown",
  "author": "mandown",
  "created_time": "January 06, 2023, 03:11:41 PM",
  "content": "Arkadaşlar sol ağındaki token'ların hacimlerini, fiyatlarını, yarım saatlik, saatlik şekilde değişimlerini ve yeni çıkan tokenları görebileceğiniz bir platform. Burqanın güzel tarafı sol tarafındaki dexlerde anlık olarak ne alınıyor satılıyor görebiliyorsunuz. adres: https://birdeye.soNot: Yeni gem bulursanız paylaşın ekmek yiyelim.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433263",
  "comments": [
    {
      "author": "bobita",
      "created_time": "January 07, 2023, 12:01:30 PM",
      "body": "Güzeldir herhalde bilemiyorum, çünkü yine tercih hakkı vermeyen siyah temalı bir site ve yine gözlerim perişan olacağı için direkt sekmeyi kapatış. Konunun özüyle ilgili değil ama, bu şekilde tema rengi dayatan sitelere sinir oluyorum, \"kardeşim ben bakamıyorum, aydınlık tema koymadın ve seni kullanmayacağım, kendin için iyi mi ettin şimdi?\" Tam tersi de geçerli, ben aydınlık kullanıyorum ama bir çok insan koyu seviyor, çok mu zor ya tema tercihi sunmak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "January 08, 2023, 01:16:33 PM",
      "body": "valla yaz aylarında @2run ile birlikte bu siteyi gayet güzel kullandık. hatta kendisi birdeye'nin üstadıdır diyebilirim:)ftx/sbf bok yemesinden sonra sol ağına pek güven kaldığını düşünmüyorum. bu olaylardan sonra sol ağı ile olan bütün ilişkimi kestim diyebilirim. shit bulmada sizlere başarılar dilerim ama bu ağa fazla güvenmemek gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "January 09, 2023, 01:19:02 PMLast edit: January 09, 2023, 06:59:42 PM by kriptobaron",
      "body": "Teşekkürler hocam deneme amaçlı az önce CORG diye birşey buldum 10 dolar attım 20 dolar oldu hemen.Sanırım aynı isimde bir coin akşam Raydiumda listelenecek bunlarda hemen çakmasını açmış ondan biraz hareketli dur bakalım ne olacak.Beğendim siteyi biraz öğreneyim daha detaylı keşif yaparım.https://birdeye.so/token/5pDmiiTWr3qu6Kq4PD6pBY3cnxNiyqf7gP8gqv19f47f (Asıl CORG Raydium da listelenince bu da 10x yaptı ibneler Luna gibi coin basıp milletin eline verdiler Edit: Araştırdığım kadarıyla bu borsanın pek bir espirisi yok telegramda sürekli yeni coin paylaşıyorlar ama iş satın almaya gelince hiç birini birdeye.so da alamadım sanırım bunlarda Raydiumdan ve Openbook da olan coinleri veriyo sadece telegramlarını takip ederek raydium üzerinden alımlar yapmaya başladım acemilikten şu coini kaçırdım 2 sıfır sildi gözümün önünde alıyom alıyom vermiyo meğerse Raydiumdan alınıyormuş.Openbook neresi orayı bulamadım orayıda bulursak iyi olur.https://birdeye.so/token/GXYgvX3obVSPhfZdHTXzBKt3h9xviQBLbvFsk6TcSsGY",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "January 09, 2023, 10:02:59 PM",
      "body": "Quote from: kriptobaron on January 09, 2023, 01:19:02 PMTeşekkürler hocam deneme amaçlı az önce CORG diye birşey buldum 10 dolar attım 20 dolar oldu hemen.Sanırım aynı isimde bir coin akşam Raydiumda listelenecek bunlarda hemen çakmasını açmış ondan biraz hareketli dur bakalım ne olacak.Beğendim siteyi biraz öğreneyim daha detaylı keşif yaparım.https://birdeye.so/token/5pDmiiTWr3qu6Kq4PD6pBY3cnxNiyqf7gP8gqv19f47f (Asıl CORG Raydium da listelenince bu da 10x yaptı ibneler Luna gibi coin basıp milletin eline verdiler Edit: Araştırdığım kadarıyla bu borsanın pek bir espirisi yok telegramda sürekli yeni coin paylaşıyorlar ama iş satın almaya gelince hiç birini birdeye.so da alamadım sanırım bunlarda Raydiumdan ve Openbook da olan coinleri veriyo sadece telegramlarını takip ederek raydium üzerinden alımlar yapmaya başladım acemilikten şu coini kaçırdım 2 sıfır sildi gözümün önünde alıyom alıyom vermiyo meğerse Raydiumdan alınıyormuş.Openbook neresi orayı bulamadım orayıda bulursak iyi olur.https://birdeye.so/token/GXYgvX3obVSPhfZdHTXzBKt3h9xviQBLbvFsk6TcSsGYBismillah uğraşırken bişeyler oldu 10 doları 700 dolar yaptım :AD:AD:AD:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 10, 2023, 06:14:33 AM",
      "body": "Adınıza çok sevindim bende birşeyler denedim ama kısmet olmadı. Millet cidden çıldırmış durumda  para harcayarak yer arıyorlar. Bu millette ne para var arkadaş ne kadar ver çöp varsa para yatırıyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "January 10, 2023, 01:20:59 PM",
      "body": "Quote from: mandown on January 10, 2023, 06:14:33 AMAdınıza çok sevindim bende birşeyler denedim ama kısmet olmadı. Millet cidden çıldırmış durumda  para harcayarak yer arıyorlar. Bu millette ne para var arkadaş ne kadar ver çöp varsa para yatırıyorlar.Çok tokatçı var hocam adam 20 30k twitter hesabı yapmış her gün bir coin ismine çeviriyor hesabı coini çıkarıyor milletin eline coin basarak veriyo işi bitince hesabın ismini resmini değiştiriyor yarın yine aynı senaryo başka isimle.İçerdeki coinlerin çoğu da bunların artığı.Bende böyle bi çöp buldum 10 dolar attım 50 trilyon arz vardı 30 kat daha arz bastı benim 10 dolar sıfıra indi elde 0.1 SOL vardı onunla aynı coini dipten aldım biraz katladım al sat yaptım derken bir anda elimde mal varken fiyat zıpladı anlık sadece ben sattım oradan 700 dolar indirdim şansa oldu tamamen sürekli takip etmesem 1 sn geç tıklasam bile kaçırmıştım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 10, 2023, 02:08:33 PM",
      "body": "@kriptobaron hocam kazanç varsa bizden biri kazansın mantığı ile hareket eden biriyimdir yeterki bizden biri kazansın.Bende birçok deneme yaptım ama twitter vs takipde etmedim yalan yok. twitter'dan birkaç yere cüzdan verdim onlarda 1 solluk coin yollamış sağolsunlar.Bu piyasa cidden çok tuaf hype başladığı dönemleri yakalarsanız bir gecede milyoner olabilirsiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "January 10, 2023, 03:45:47 PM",
      "body": "Quote from: mandown on January 10, 2023, 02:08:33 PM@kriptobaron hocam kazanç varsa bizden biri kazansın mantığı ile hareket eden biriyimdir yeterki bizden biri kazansın.Bende birçok deneme yaptım ama twitter vs takipde etmedim yalan yok. twitter'dan birkaç yere cüzdan verdim onlarda 1 solluk coin yollamış sağolsunlar.Bu piyasa cidden çok tuaf hype başladığı dönemleri yakalarsanız bir gecede milyoner olabilirsiniz. Hocam ben dünden beri araştırmalar yaptım takipçiyi de öyle kasıyorlar zaten ilk 3333 RT ye coin atıyoz diyolar millet beğeni takip doluşuyor sonra coini listeleyip malı çakıyorlar.Düden beri şu coini sömürüyorum al sat al sat güzel kazanç verdi ama şuanda haraketlilik bitti gibi sonuna geldik galiba. Acemi adam hemen batar orası garanti gibi ben erken uyandım mevzuyu biraz yolumu buldum valla sağolasın iyi ki paylaşmışsınız teşekkürler tekrardan.https://birdeye.so/token/5pDmiiTWr3qu6Kq4PD6pBY3cnxNiyqf7gP8gqv19f47f",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "January 12, 2023, 08:15:09 AM",
      "body": "Bu tarz yerlerde takilip para katlamaya calisanlari ben tam olarak akbabalara benzetiyorum. Icimden direkt geciyor yani abi olucu musunuz diye. Ama o kadar hizli 700 dolar kazanmis ki arkadas insan imreniyor. Gerci su da bir gercek siz burada 10000 dolar da cevirseniz bunun 100.000 dolar olmasi da 10 dolar olmasi da anlik ihtimal dahilindedir. Ben bunu biraz bahis cevirmeye benzetiyorum bu yuzden. Belki arada girip 10 dolar atilabilir ama ben sahsen 10 dolardan bir cent fazla para yatirmazdim buraya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 12, 2023, 10:53:21 AM",
      "body": "Hocam sayısaldan para çıkma şansı varmı? yok burada 5 10 dolarla en azından birşeyler kazanma şansınız var tabiki gidip 100 dolar bulara hacanmaz. Millet resmen twitter'da gruplar kuruyor o gruplar kendi token'ını çıkartıp 15-20 dakikada 10- 100x arası pumplayıp tokenın işini bitiriyorlar burada kalkıp o coini elde tutmak mantıklı değil. Bir iki gün içinde likidite boşaltılıyor. Birde adam token üretmiş içeriye para girdikçe coin miktarını arttıyorlar garip garip dolandırma yöntemler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}