{
  "id": "topic_5400129",
  "title": "Ondekinecakabilirim",
  "author": "Ondekinecakabilirim",
  "created_time": "May 25, 2022, 09:56:22 AM",
  "content": "Yaptığı açıklamalarda IMF Başkanı Kristalina Georgieva, şu sözleri paylaştı:“KRİPTODAN HER ZAMAN PARA BİRİMİ OLARAK DEĞİL, VARLIK OLARAK BAHSEDİYORUM. HERHANGİ BİR PARA BİRİMİ İÇİN BİR DEVLETİN SORUMLULUĞU ALMASI GEREKİR, ANCAK SÖZDE KRİPTO PARA BİRİMLERİ İÇİN ORTADA HİÇBİR DEVLET YOK.Kriptodan her zaman varlık olarak bahsettiğini aktaran IMF Başkanı, açıklamalarını şu sözlerle tamamladı:“AYRICA, PARA BİRİMLERİNİN ÇOK FAZLA GÜVENE SAHİP OLMASI VE EVRENSEL OLARAK KABUL EDİLEBİLİR OLMASI GEREKİR. BİR TARAFTA SADECE PARA, DİĞER TARAFTA GÜVENE SAHİP OLAMAYIZ. BUNLARIN BİRLİKTE OLMALARI GEREKİYOR.”https://www.kriptopiyasasi.com/imf-baskani-bitcoin-bir-para-olamaz/Altının da arkasında devlet yok. Herkes para olarak kabul ediyor altını. Bitcoin'i neden kimse kabul etmezmiş. Neden illa arkasında devlet olmalı.  Hoş varlık olarak kabul etmişler. Bu da bir gelişme IMF için. Çünkü hep olumsuz açıklamalarda bulunuyorlar Bitcoin ve kriptoparalara karşı. Bir kere iyi bahsettiklerini görmedim daha. Finansal otoriteleri sarsılıyor sanırım. Sürekli karalama yaptıklarına göre. Başka açıklama olamaz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400129",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "May 25, 2022, 03:25:44 PM",
      "body": "Parayı tanımlamakta kullandıkları arkasında devlet olmalı saçmalığından ayrılması sonucunda merkezi yönetimlerin gücünün zayıflamasından korkuyorlar. Fiat paranın karşılığı ne dediğinizde \"garantisi benim abi\" saçmalığına çıkıyor işin ucu. Paranın karşılığı emek, iş yada somut bir şey olmak zorundadır. Gerçekte hiç bir karşılığı olmayan aslında fiat paralar. Diledikleri anda diledikleri kadar miktarı karşılıksız olarak arttırarak insanların emeklerini çalma operasyonuna devam edemeyecekleri günleri görmeyi çok istiyorum. Venezüella para birimi bolivar'ında arkasında devlet vardı, bu yalanı yerseniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piratte",
      "created_time": "May 25, 2022, 05:54:42 PM",
      "body": "bana bu dolar basma faiz arttirma sacmaliklarinin lunadan bir farki yok gibi geliyor. borsalar sanki 2000 2002 yillari gibi suan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "May 25, 2022, 09:27:30 PM",
      "body": "IMF yetkilileri Bitcoin hakkında sürekli olumsuz görüş beyan ediyorlar. 13 yıldır kullanılıyor. Bu kadar insan kullanmış, kullanmaya devam ediyor. Milyonlarca, belki milyarlarca işlem yapılmış, para transferi sağlanmış. Neredeyse hiç sorunla karşılaşılmamış. Ama IMF yetkililerinin Bitcoin hakkında bir tane bile olumlu görüşü yok. Şaşırmıyorum artık.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "May 27, 2022, 08:37:56 AM",
      "body": "imf'nin ne dediği normal şartlarda zaten umurumda değil ama ben bitcoin'i para olarak kullanmak istemiyorum, para olarak kabul görmesini de istemiyorum, günlük alışverişlerde bitcoin'i kullanarak dolaşımdaki miktarı artırmanın fiyat üzerinde baskı oluşturmaktan başka bir işe yaramayacağını düşünüyorum. bunun yerine, bitcoin değer saklama aracı olarak kabul görmeye devam ederse, her şeyin bitcoin için daha iyi olacağını düşünüyorum. bence pek sayın imf yetkilileri -istemeden de olsa- bitcoin için olumlu bir açıklama yapmış olabilirler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 28, 2022, 08:02:38 PM",
      "body": "IMF gibi kurumlar kriptopara piyasasını hala finansal piyasaların içinde olarak göremiyor yani trilyon dolarlık bir kayıp olarak görüyorlar. E böyle olunca kriptoparalar için de asla olumlu yorum yapamıyorlar yaptıklarını görmüyoruz. Bitcoin i Bitcoin yapan şey zaten IMF in ya da IMF Başkanının ne düşündüğü değil sıradan insanlar olarak bizlerin ne düşündüğüdür. Para olarak kullanıyor muyuz? Evet. Değer saklama aracı olarak kullanıyor muyuz? O da evet. Bitti gitti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}