{
  "id": "topic_5455181",
  "title": "nitrobetting",
  "author": "nitrobetting",
  "created_time": "June 05, 2023, 03:41:57 PM",
  "content": "1. Odds transparencyTraditional online casinos claim they run games via a random number generator. But how random is the number generator?It’s a legitimate question. What a traditional casino says it does and what it does could be two different things. Bitcoin casinos operate via transparency. You know true odds when you wager in a Bitcoin casino.If you’re a sports bettor, you understand that knowing the odds is the first part of making smart bets. You won’t always make winning bets, but you will make smart bets, which is the only thing we can do when betting.In the long run, the more smart bets we make, the more we profit.2. Safety and securityIt would take 51% of all nodes to steal a transaction. By 51%, we mean thousands of computers would have to decide to steal the same transaction.It’s almost an impossibility. We can’t write impossible because nothing is 100% impossible. But the amount of work it would take to steal your Bitcoin casino deposit is as close to impossible as it gets.The real reason? Proof of work rewards Bitcoin miners to create blocks, which means the rewards of validating and securing transactions is more than the reward from stealing almost all BTC transactions.3. Game varietyVariety of games is a sign of an honest casino. The more games there are, the more ways players can win. If a casino offers fewer games, there’s a chance those games could be more prone to shady tactics that lead to losses.Also, it’s easier to manage payouts when there are fewer games. Traditional casinos that offer fewer games may be fudging the amount they pay out on each win.Bitcoin casinos often provide more games. Not only that, but the payouts are also often higher due to Bitcoin’s transparency and decentralized aspects.Full article here: https://n2g.io/5794fc1",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455181",
  "comments": [
    {
      "author": "www.Gambler.Casino",
      "created_time": "June 05, 2023, 03:47:23 PM",
      "body": "Why do you think that the random number generator in a bitcoin casino is fair? Cryptocurrency casinos work with the same slot providers as a regular casino",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 05, 2023, 03:47:38 PM",
      "body": "Quote from: nitrobetting on June 05, 2023, 03:41:57 PM1. Odds transparencyTraditional online casinos claim they run games via a random number generator. But how random is the number generator?It’s a legitimate question. What a traditional casino says it does and what it does could be two different things. Bitcoin casinos operate via transparency. You know true odds when you wager in a Bitcoin casino.If you’re a sports bettor, you understand that knowing the odds is the first part of making smart bets. You won’t always make winning bets, but you will make smart bets, which is the only thing we can do when betting.In the long run, the more smart bets we make, the more we profit.There are pros and cons in both type of casinos. I am not sure what you mean by Bitcoin casinos operate via transparency? I see the same style of odds presentation in both type of casinos. It's not that blockchain is recording every single changes of the odds.Quote2. Safety and securityIt sounds like you are talking about safety and security of Bitcoin not a Bitcoin casino. I can give you many example of casinos who do not pay their clients when they win big. As long as the coin is on the casino site these are just numbers. When you will withdraw them on your own wallet then you are the owner of the coins. So your description is a bit misleading to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "June 05, 2023, 04:16:09 PM",
      "body": "Quote from: nitrobetting on June 05, 2023, 03:41:57 PM1. Odds transparencyTraditional online casinos claim they run games via a random number generator. But how random is the number generator?It’s a legitimate question. What a traditional casino says it does and what it does could be two different things. Bitcoin casinos operate via transparency. You know true odds when you wager in a Bitcoin casino.If you’re a sports bettor, you understand that knowing the odds is the first part of making smart bets. You won’t always make winning bets, but you will make smart bets, which is the only thing we can do when betting.In the long run, the more smart bets we make, the more we profit.You are confusing everyone here with your Bitcoin casino terms. Most of casino that accepts Bitcoin or your so called Bitcoin casino already used a 3rd party games provider that used RNG for the game result. Only house games use a hash seed for the result but house games is not that popular.Bitcoin casino is already adapted to the typical commercial casino that use RNG on their games since the games is very limited with the use of blockchain. I think you are describing a decentralized casino instead of Bitcoin casino since Centralized casino use Bitcoin too as currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "June 05, 2023, 05:24:20 PM",
      "body": "With the integration of blockchain technology, Bitcoin casino advantage is that, they can implement provably fair gambling.  Aside from that, players from any place of the world can easily play gambling games without the need for the third party company to process the transfer.  The integration of blockchain to the casino includes the unbanked players.  That is some of the advantages of Bitcoin casinos over Traditional casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 05, 2023, 05:53:50 PM",
      "body": "Quote from: BitcoinGirl.Club on June 05, 2023, 03:47:38 PMIt sounds like you are talking about safety and security of Bitcoin not a Bitcoin casino. I can give you many example of casinos who do not pay their clients when they win big. As long as the coin is on the casino site these are just numbers. When you will withdraw them on your own wallet then you are the owner of the coins. So your description is a bit misleading to me.Not just paying their clients, some of the casinos won't even deny the fact that you actually deposited your Bitcoin into their platform, but they will deny you the privilege of withdrawing your deposit with some unreasonable claims that might not sound pleasant to the ear. The OP forgets to understand that any centralized platform doesn't need to manipulate the deposit and remove it from the blockchain before they can steal their customers funds. What they just need is to come up with a solid excuse, and that's it. We have lots of scam casinos and other non-gambling sites that are currently doing that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "June 05, 2023, 06:12:50 PM",
      "body": "I see the benefit of bitcoin casinos that are superior to traditional casinos. We can hide behind the table playing gambling without requiring verification as people do if they play gambling in traditional casinos. We don't need to visit traditional casinos because we can play gambling from home using many devices.But if it's safety and security, I'm not sure because there are still casinos that get hacked, but maybe it's not that many. Casinos always try to improve security for their sites to avoid hacking and provide security for playing gambling for their members.I admit that many gambling games provided by bitcoin casinos keep gamblers coming back the next day. And that is a casino bitcoin benefit that is given to its members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "June 05, 2023, 06:14:50 PM",
      "body": "Bitcoin casinos has more edge than the normal traditional casinos we do use to make regular bet where it requires us to give our credit card to the casino to deduct money from our bank account even without our request. The traditional method of funding account is very risky and if we fall to the hand of scammers, we might lose our funds and never been able to get it back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 05, 2023, 06:20:49 PM",
      "body": "Quote from: BitcoinPanther on June 05, 2023, 05:24:20 PMWith the integration of blockchain technology, Bitcoin casino advantage is that, they can implement provably fair gambling.  Aside from that, players from any place of the world can easily play gambling games without the need for the third party company to process the transfer.  The integration of blockchain to the casino includes the unbanked players.  That is some of the advantages of Bitcoin casinos over Traditional casinos.that's one major advantage of using crypto casinos in general, not only with bitcoin casinos. and also, the OP only listed 3 out of 5 advantages he mentioned on his title thread. should put all 5 at a glance because there are users who are blocked on the site link provided. but anyhow, this topic has been discussed many times over in this forum and i guess, most gamblers here know the pros and cons of using crypto casinos over traditional casinos. nowadays, for most crypto gamblers, they will enter land-based casinos just for the experience and change of environment. but with numerous advantages brought by crypto casinos today, i guess, most of them will stick playing online. you can't blame them esp those small time rollers as they don't need to worry depositing small amount as they can still play their fave game without hassle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "June 05, 2023, 06:50:12 PM",
      "body": "Crypto gambling is for me I consider safer in that your budget can be allocated separately to money you would spend on bills.  I know not everyone does this but I keep the crypto value in crypto and generally dont mix this value up with money I keep in FIAT currency.  I cant lose the money I need for bills so I just never convert that to crypto, if I cant lose it because its been separated in this way it seems alot safer then mixing up play money with bill money.  The BTC price and other prices in crypto already vary by maybe upto 25% in a week, so its money I dont take super seriously its nice that it can go up alot but also ideally its not something I should worry about or lean on to support with this given built in normal volatility to its value.  Betting is natural in crypto imo, its already a gamble to be in this space which is fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "June 05, 2023, 08:16:36 PM",
      "body": "Quote from: www.Gambler.Casino on June 05, 2023, 03:47:23 PMWhy do you think that the random number generator in a bitcoin casino is fair? Cryptocurrency casinos work with the same slot providers as a regular casino You would be correct if not for the added protection that cryptocurrency casinos offer its users. For most of these casinos, they employ provably fair mechanics that not only say they are fair, but includes references and evidences to support their claim. Every roll generates a traceable seed that will inform the player of the transaction details which includes the game that is played, the results, and the codes that had lead to that result. As with regular casinos, you don't really see something like this, most of the time you'd just have to believe in good faith that the casino is not screwing you over, not that any of them do, so that air of distrust isn't really gone. Plus you can't really provide irreputable evidence on live gamblers that their machines are working properly and fairly, that would mean they'd have to take every machine apart for each player, and then teaching them what each part does and how it affects their odds of winnings, a pretty tedious task if you'll ask me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 05, 2023, 08:32:36 PM",
      "body": "Quote from: STT on June 05, 2023, 06:50:12 PMCrypto gambling is for me I consider safer in that your budget can be allocated separately to money you would spend on bills.  I know not everyone does this but I keep the crypto value in crypto and generally dont mix this value up with money I keep in FIAT currency.  I cant lose the money I need for bills so I just never convert that to crypto, if I cant lose it because its been separated in this way it seems alot safer then mixing up play money with bill money.  The BTC price and other prices in crypto already vary by maybe upto 25% in a week, so its money I dont take super seriously its nice that it can go up alot but also ideally its not something I should worry about or lean on to support with this given built in normal volatility to its value.  Betting is natural in crypto imo, its already a gamble to be in this space which is fine.Bitcoin casinos compared to traditional ones for me have only two advantages and I am not sure 100% that traditional casinos do not have the second advantage also.The first one is convenience,you play in a pseudo anonymous way from wherever you are as long as you have an internet connection which is 100% the case now as everyone of us has 3/4/5G to access the internet anywhere we are,we don't risk anything here,we have a wallet in our phone/tablet/laptop/desktop and we play from there (I assume we have a clean device,virus free),the bank does not know anything like in traditional casinos where you are forced to deposit funds through means that easily identifies you.The second advantage are ongoing bonuses while in the traditional ones I have not seen these,in Bitcoin world reputable crypto casinos gives you a VIP/tier level that increases with every bet you make.For me these are two distinct advantages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "og kush420",
      "created_time": "June 05, 2023, 08:53:37 PM",
      "body": "Quote from: swogerino on June 05, 2023, 08:32:36 PMQuote from: STT on June 05, 2023, 06:50:12 PMCrypto gambling is for me I consider safer in that your budget can be allocated separately to money you would spend on bills.  I know not everyone does this but I keep the crypto value in crypto and generally dont mix this value up with money I keep in FIAT currency.  I cant lose the money I need for bills so I just never convert that to crypto, if I cant lose it because its been separated in this way it seems alot safer then mixing up play money with bill money.  The BTC price and other prices in crypto already vary by maybe upto 25% in a week, so its money I dont take super seriously its nice that it can go up alot but also ideally its not something I should worry about or lean on to support with this given built in normal volatility to its value.  Betting is natural in crypto imo, its already a gamble to be in this space which is fine.Bitcoin casinos compared to traditional ones for me have only two advantages and I am not sure 100% that traditional casinos do not have the second advantage also.The first one is convenience,you play in a pseudo anonymous way from wherever you are as long as you have an internet connection which is 100% the case now as everyone of us has 3/4/5G to access the internet anywhere we are,we don't risk anything here,we have a wallet in our phone/tablet/laptop/desktop and we play from there (I assume we have a clean device,virus free),the bank does not know anything like in traditional casinos where you are forced to deposit funds through means that easily identifies you.The second advantage are ongoing bonuses while in the traditional ones I have not seen these,in Bitcoin world reputable crypto casinos gives you a VIP/tier level that increases with every bet you make.For me these are two distinct advantages.some valid points discussed. but there is an other advantage of online gambling that is all those who lives at the place where gambling is ban they can also gamble",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "June 05, 2023, 10:57:49 PM",
      "body": "Quote from: Desmong on June 05, 2023, 06:14:50 PMBitcoin casinos has more edge than the normal traditional casinos we do use to make regular bet where it requires us to give our credit card to the casino to deduct money from our bank account even without our request. The traditional method of funding account is very risky and if we fall to the hand of scammers, we might lose our funds and never been able to get it back.  I want you to understand that there is no aspect that will fall into scammers that you can get the money back so everything concerning gambling and the other things are risky so you have to take the risk if you really know that yes you want to gamble and you are into gambling",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magoo8",
      "created_time": "June 05, 2023, 11:31:45 PM",
      "body": "Quote from: nitrobetting on June 05, 2023, 03:41:57 PM1. Odds transparencyTraditional online casinos claim they run games via a random number generator. But how random is the number generator?It’s a legitimate question. What a traditional casino says it does and what it does could be two different things. Bitcoin casinos operate via transparency. You know true odds when you wager in a Bitcoin casino.If you’re a sports bettor, you understand that knowing the odds is the first part of making smart bets. You won’t always make winning bets, but you will make smart bets, which is the only thing we can do when betting.In the long run, the more smart bets we make, the more we profit.2. Safety and securityIt would take 51% of all nodes to steal a transaction. By 51%, we mean thousands of computers would have to decide to steal the same transaction.It’s almost an impossibility. We can’t write impossible because nothing is 100% impossible. But the amount of work it would take to steal your Bitcoin casino deposit is as close to impossible as it gets.The real reason? Proof of work rewards Bitcoin miners to create blocks, which means the rewards of validating and securing transactions is more than the reward from stealing almost all BTC transactions.3. Game varietyVariety of games is a sign of an honest casino. The more games there are, the more ways players can win. If a casino offers fewer games, there’s a chance those games could be more prone to shady tactics that lead to losses.Also, it’s easier to manage payouts when there are fewer games. Traditional casinos that offer fewer games may be fudging the amount they pay out on each win.Bitcoin casinos often provide more games. Not only that, but the payouts are also often higher due to Bitcoin’s transparency and decentralized aspects.Full article here: https://n2g.io/5794fc1Add anonymous betting to the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 05, 2023, 11:36:15 PM",
      "body": "I think that another advantage that I have mentioned before is the fact that if a gambler mostly uses Bitcoin, that translates to them not being able to easily adquire credit to continue gamble, because as we all know, Bitcoin is debit/liquidity, once one runs out of Bitcoin in the wallet and there are not credit cards to get money from, the session is over. I think it helps to prevent some people from falling into problem gambling. Specially those in situations where do not have access to credit or banking, as other do in developed countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "June 06, 2023, 12:21:23 AM",
      "body": "Sooo, this is how good Bitcoin is really and not about casinos themselves? Also don't casinos just employ the same providers? The only difference really is the method of payment, in this case crypto vs fiat. Odds? As I've said providers are still the same so only local games made by the casinos could possibly be transparent.Security? If crypto casinos use a centralized wallet to store your coins it's all the same. Especially if you consider how most casinos are actually centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "June 06, 2023, 12:36:14 AM",
      "body": "Quote from: nitrobetting on June 05, 2023, 03:41:57 PM1. Odds transparencyTraditional online casinos claim they run games via a random number generator. But how random is the number generator?It’s a legitimate question. What a traditional casino says it does and what it does could be two different things. Bitcoin casinos operate via transparency. You know true odds when you wager in a Bitcoin casino.If you’re a sports bettor, you understand that knowing the odds is the first part of making smart bets. You won’t always make winning bets, but you will make smart bets, which is the only thing we can do when betting.In the long run, the more smart bets we make, the more we profit.2. Safety and securityIt would take 51% of all nodes to steal a transaction. By 51%, we mean thousands of computers would have to decide to steal the same transaction.It’s almost an impossibility. We can’t write impossible because nothing is 100% impossible. But the amount of work it would take to steal your Bitcoin casino deposit is as close to impossible as it gets.The real reason? Proof of work rewards Bitcoin miners to create blocks, which means the rewards of validating and securing transactions is more than the reward from stealing almost all BTC transactions.3. Game varietyVariety of games is a sign of an honest casino. The more games there are, the more ways players can win. If a casino offers fewer games, there’s a chance those games could be more prone to shady tactics that lead to losses.Also, it’s easier to manage payouts when there are fewer games. Traditional casinos that offer fewer games may be fudging the amount they pay out on each win.Bitcoin casinos often provide more games. Not only that, but the payouts are also often higher due to Bitcoin’s transparency and decentralized aspects.Full article here: https://n2g.io/5794fc1I also do not believe that random number generators are truly random. At some point, the sequences, algorithms and formulas can be found out by skilled reverse engineers. But what if the casino is hacked or exit-scams? If your Bitcoin is on a casino wallet with third party access, you cannot be sure of safety, can you? So I am not sure about point 2 but I agree with your opinion of Bitcoin transactions being transparent is a good thing.I think we are headed towards a Bitcoin world that will sooner or later create a more fair gambling experience. However it seems to me that web2 casinos need to boost their casino technology before we get to that point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "June 06, 2023, 01:33:10 AM",
      "body": "The explanation behind the first advantage isn't true though. I haven't used a traditional casino, but from what i've seen on other gamblers, they don't hide these odds, and they shouldn't because it'll ruin their reputation. Some traditional sites might even be superior because they have a few features that aren't available on crypto sportsbooks.The \"original games\" that most Bitcoin casinos have might give them the edge in terms of game variety, but overall it's still not that big of an advantage that'll encourage gamblers to switch casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "June 06, 2023, 01:45:30 AM",
      "body": "You title stated \"Top 5 advantages\" and the content ended at number three, what happened to the remaining 2 Op? If you want us to click on the link to check out he rest then why don't you edit your post and make it less misleading. Besides, I expected to see some kind of contrasting ideas like comparing a Bitcoin casino to traditional casino but instead you only wrote about somethings about Bitcoin casino and left out the traditional casino entirely another misleading information in your post.This is not your first time of creating content like this and I'm sure another one will pop out again with incomplete information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}