{
  "id": "topic_5453002",
  "title": "sokani",
  "author": "sokani",
  "created_time": "May 16, 2023, 10:59:55 PM",
  "content": "Last year, The Federal Government of Nigeria through the National Information Technology Development Agency (NITDA) launched a blockchain developer scholarship program to train 30,000 Nigerians. The program was spearheaded by Domineum Blockchain Solution and today the graduands were presented certificate of completion by the honourable minister of communications and digital economy Prof. Issa Pantani in Abuja. Congratulations to the beneficiaries and let's hope more good things will come out of this.https://twitter.com/NITDANigeria/status/1658530372936691712?t=dyK_vwB9TKNIUpQuw1nNYQ&s=19",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453002",
  "comments": [
    {
      "author": "SmartGold01",
      "created_time": "May 16, 2023, 11:09:19 PM",
      "body": "Buh wait o this our country self really tire person because on other hand them no too allow any transaction with bitcoin and. Today they are issuing a certificate to people the participated on a blockchain program while they still ban us from associating our details with bitcoin or cryptocurrency. Does this looks normal if I am to ask because no reasonable government will restricts her citizens from bitcoin and yet issuing a certificate to is being used to power bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 17, 2023, 01:48:46 PM",
      "body": "Quote from: sokani on May 16, 2023, 10:59:55 PMLast year, The Federal Government of Nigeria through the National Information Technology Development Agency (NITDA) launched a blockchain developer scholarship program to train 30,000 Nigerians. The program was spearheaded by Domineum Blockchain Solution and today the graduands were presented certificate of completion by the honourable minister of communications and digital economy Prof. Issa Pantani in Abuja. Congratulations to the beneficiaries and let's hope more good things will come out of this.https://twitter.com/NITDANigeria/status/1658530372936691712?t=dyK_vwB9TKNIUpQuw1nNYQ&s=19There's what we called educated illiteracy and this is the same direction the governments were approaching the matters related to the blockchain technology, if they can accept blockchain technology but deny bitcoin which is the major dependent of the technology, doesn't it seems like they gave personal intentions that could be of interest to them than the people when they kick against bitcoin adoption, such could also give them the more edge in having control over the people's finances, which is the main idea Satoshi focused on and preached about when he introduced a digital currency bitcoin, I wish all the beneficiaries could see beyond blockchain alone but also give more room to bitcoin adoption with their impact in cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lagosnoir",
      "created_time": "July 17, 2023, 03:38:55 PM",
      "body": "i just saw this and smiled. Kudos to Domineum Blockchain Solution for the hustle    I doubt that we have 30000 actual blockchain developers now but never mind. The ministry will have paid for the scholarship and that is \"importanter\". I don't know if anybody has a connect in the new Aso Rock regime. I can write the proposal. This scheme must not end just like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "July 17, 2023, 07:10:29 PM",
      "body": "For me dis is not a good news because after the training and issueing them di certificate where are dey? Nigerian government is using youths empowerment programmes to deceive us and person like me e no go fall for dem. How someone go learn blockchain that is not working in the country. The workability of that domain is not clear yet. Lookat what they said about the blockchain, Domineum Blockchain. Why Nigerian government is dozin cryptocurrency blockchain and going for something dat is not relevant. Well we go see how dem go do am. And e fit be sae na from there dem wan take enter cryptocurrency blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}