{
  "id": "topic_5448651",
  "title": "shalisiting88",
  "author": "shalisiting88",
  "created_time": "April 13, 2023, 09:06:12 AM",
  "content": "全面擁抱 AIGC，藍色光標全面暫停外包？一份文件截圖顯示，中國知名 4A 廣告公司，藍色光標，發郵件要求全面停用文案外包！改用生成式 AI！藍色光標華東區總部運營採購部下發郵件，郵件顯示，為了遏制核心能力空心化的勢頭，也為了給全面擁抱 AIGC 打下基礎，即日起，管理層決定無期限全面停止創意設計、方案撰寫、文案撰寫、短期僱員四類相關外包支出。- 支出包括通過供應商外包的部分，也包括通過個人供應商和墊付供應商形式進行的個人外包；- 創意設計，包括但不限幹平面設計類（海報、長圖、KV）3D 建模、插畫、動畫、Kevnote/PPT 美化等，暫不包括視頻拍攝和製作類；- 文案撰寫，即所有文檔整理、撰寫類的外包工作，包括但不限於：稿件撰寫、創意文案撰寫、創意腳本、活動相關文案撰寫、報告整理、資料收集等：- 方案撰寫，包括競標方案、執行方案、活動策劃等，既包括聯合競標產生的額外成本，也包括方案裡的創意設計相關部分；- 短期僱員，不含實習生，主要是指計時付薪的個人外包。即日起，全面禁止產生任何新的外發外包。運營採購部不再審核任何新的採購訂單、支出單；已經審核完畢的也全面暫停支付。停付時間不設具體期限。考慮到的確會有內部團隊不具備或者暫不具備完成能力的事項，因此會針對此類供應商外發設定少量額度，必須事先經過總經理 *** 逐級郵件特批確認後外發。AIGC 即 AI Generated Content，是指利用人工智能技術來生成內容。此外，北京藍色光標也發了大致的內容。其中提到：考慮到的確會有內部團隊不具備或者暫不具備完成能力的事項。因此會針對此類供應商外發設定少量額度，必須事先經過總經理 + C00 + 集團管理層逐級郵件特批確認後外發以上特批事項僅包括供應商外包外發。藍色光標 4 月 11 日在投資者互動平台上表示，公司當日已獲得微軟雲官方 AI 調用和訓練許可，目前微軟雲上線的是 OpenAI ChatGPT (GPT-3.5）的相關服務。公司稱，微軟雲尚未提供 GPT-4 服務，當微軟部署完成 GPT-4 的相關服務後，公司即可同步使用。AI 正在取代這類行業據時代財經報導，某遊戲美術外包公司的技術總監透露，在近一個月，其所在公司已經裁掉了一半的原畫師：“原畫師利用 Al 完成方案，工作效率至少能提升 50% 以上，本來就在減少的甲方需求迅速被消化完。公司肯定不會養閒人，那些手中沒有需求的原畫師就只能被優化掉了。之前我們公司需要 38 個原畫師，現在已經裁掉了 20 個人。”此外，據半熟財經報導稱，遊戲、設計等行業的原畫師這個工種受到的衝擊最快、最大，已經出現了裁員現象。廣州一家中型外包遊戲公司的特效技術總監丹青稱，公司原畫團隊 2023 年初使用 AI 之後，已經裁員 2/3。而導演陸川曾表示，讓 AI 幫他畫一幅電影海報，“15 秒出來的效果比專業海報公司做一個月的還要好”。其實，除了當下最熱的 Open AI 公司，還有以 Midjourney 為代表的 AI 繪畫產品，也是相當炸裂。Midjourney 採用了類似於 GPT-4 的深度學習技術，通過大量的圖像數據進行訓練，使得它具備了強大的繪畫能力。它能夠理解用戶的輸入信息，比如文字描述、草圖、甚至是情感等，然後在大量的圖像數據中尋找相似的元素和特徵，最終生成一幅滿足用戶需求的作品。此前，“特朗普被捕”的“照片”在一些社交平台流傳開來。這些“特朗普被捕”的圖片顯示，特朗普或被警察圍捕、或穿著囚服、或在勞改、或在越獄。要不是別人提醒這是 AI 合成圖，普通網友僅憑肉眼難以辨別真假。而這些圖片的作者親自回复，這些圖片來自於——Midjourney V5。藝術家 Gokul Pillai 用 AI 繪圖工具 Midjourney 繪製了七張圖片，展示億萬富翁如果住在貧民窟會是什麼樣子，包括特朗普、比爾・蓋茨、巴菲特和馬斯克。據投資銀行高盛（Goldman Sachs）發布報告，隨著 AI 技術的突破，預計全球將有 3 億個工作崗位被生成式 AI 取代，其中律師和行政人員所受影響最大，預計對體力要求較高的職業或戶外職業受影響較小，例如建築和維修工作。",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448651",
  "comments": []
}