{
  "id": "topic_5455742",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "June 08, 2023, 10:55:11 AM",
  "content": "https://www.sec.gov/news/press-release/2023-102SEC Charges Coinbase for Operating as an Unregistered Securities Exchange, Broker, and Clearing AgencyCoinbase also charged for the unregistered offer and sale of securities in connection with its staking-as-a-service program.SEC document: originalhttps://storage.courtlistener.com/recap/gov.uscourts.nysd.599908/gov.uscourts.nysd.599908.1.0.pdf\"In a lawsuit against Coinbase, the SEC called tokens securities: Solana (SOL), Cardano (ADA), Polygon (MATIC), Filcoin (FIL), Sandbox (SAND), Axie Infinity (AXS), Chiliz (CHZ), Flow (FLOW) , Internet Computer (ICP), NEAR Protocol (NEAR), Voyager VGX (VGX), Dash (DASH) and NEXO (NEXO).\"Read more on RBC:https://www.rbc.ru/crypto/news/647f22e49a794729fc33eb8f___https://www.coindesk.com/policy/2023/06/06/coinbase-violated-state-securities-laws-with-staking-program-alabama-regulator-alleges/\"Coinbase has 28 days to explain to the Alabama Securities Commission (ASC) how it is not violating state securities laws with its staking program, the regulator said on Tuesday. The California Department of Financial Protection and Innovation (DFPI) has meanwhile filed for an order for Coinbase to \"desist and refrain from the further offer and sale of securities in California,\" while Maryland ordered Coinbase to cease and desist the offering.\"https://twitter.com/DeItaone/status/1666098055249268750\"TEN U.S. STATES, LED BY CALIFORNIA, ARE TAKING LEGAL ACTION AGAINST COINBASE FOR VIOLATING SECURITIES LAWS--ILLINOIS ATTORNEY GENERAL SAYS\"https://www.bloomberg.com/news/articles/2023-06-06/coinbase-coin-sec-crypto-charges-pose-threat-as-altcoins-deemed-securities#xj4y7vzkg\"Revenue at risk could be over 50%, Oppenheimer analyst says\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455742",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "June 08, 2023, 11:12:04 AM",
      "body": "DASH is not a security, it is basically ancient Bitcoin Core tech and bitcoin is not even considered a security It's hard to feel sorry for the rest of these coins though, as most of them are being used for relentless profiteering from pump&dumps. For example, \"Axie Infinity\" LOL - is there anyone who is not using it purely as a money-making scheme? A token for bankrupt Voyager?  And similar cases can be made against most of the other coins as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 08, 2023, 11:19:45 AM",
      "body": "Quote from: NotATether on June 08, 2023, 11:12:04 AMDASH is not a security, it is basically ancient Bitcoin Core tech and bitcoin is not even considered a security It's hard to feel sorry for the rest of these coins though, as most of them are being used for relentless profiteering from pump&dumps. For example, \"Axie Infinity\" LOL - is there anyone who is not using it purely as a money-making scheme? A token for bankrupt Voyager?  And similar cases can be made against most of the other coins as well.Nobody understands the logic of the SEC. They have different cryptocurrencies in their lawsuits against two major US exchanges.I used to think that Coinbase was getting rid of competitors, but now I think that the SEC has received a command to destroy the major crypto exchanges in the US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 09, 2023, 09:01:06 AM",
      "body": "Quote from: NotATether on June 08, 2023, 11:12:04 AMDASH is not a security, it is basically ancient Bitcoin Core tech and bitcoin is not even considered a security Quote from: zasad@ on June 08, 2023, 11:19:45 AMNobody understands the logic of the SEC. They have different cryptocurrencies in their lawsuits against two major US exchanges.It is simple and depends on how much return you get from holding the cryptocurrency, is there a return or not? In Bitcoin, if you keep Bitcoin in your wallet for 10 years, your Bitcoin number will not increase because there is no staking.According to what I read here if they hold an asset for 365 days you would receive about 5.67%, so Dash is listed https://www.coinbase.com/earn/staking/dash#:~:text=This%20means%20that%2C %20on%20average,being%20staked%2C%20is%2038.99%25.I think that all that happens is that these systems do not conflict with the policies of the Federal Reserve, which gives a return of less than 5.67%, so all currencies that give a higher return will be included in that list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 09, 2023, 11:13:40 AM",
      "body": "Quote from: Husires on June 09, 2023, 09:01:06 AMQuote from: NotATether on June 08, 2023, 11:12:04 AMDASH is not a security, it is basically ancient Bitcoin Core tech and bitcoin is not even considered a security Quote from: zasad@ on June 08, 2023, 11:19:45 AMNobody understands the logic of the SEC. They have different cryptocurrencies in their lawsuits against two major US exchanges.It is simple and depends on how much return you get from holding the cryptocurrency, is there a return or not? In Bitcoin, if you keep Bitcoin in your wallet for 10 years, your Bitcoin number will not increase because there is no staking.According to what I read here if they hold an asset for 365 days you would receive about 5.67%, so Dash is listed https://www.coinbase.com/earn/staking/dash#:~:text=This%20means%20that%2C %20on%20average,being%20staked%2C%20is%2038.99%25.I think that all that happens is that these systems do not conflict with the policies of the Federal Reserve, which gives a return of less than 5.67%, so all currencies that give a higher return will be included in that list.Then you can say goodbye to all POS cryptocurrencies in the USA, although no, there are always exceptions, for example, Ethereumhttps://twitter.com/Bitboy_Crypto/status/1666968425229369344\"I spoke to a Binance attorney and they are earmarking $1B to fight the SEC. They could basically hire every major law firm at once to fight for them.\"Since this is a civil lawsuit, such courts can take a long time until the exchanges agree with the CEC on the rules for the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 10, 2023, 02:02:34 AM",
      "body": "Quote from: zasad@ on June 09, 2023, 11:13:40 AMThen you can say goodbye to all POS cryptocurrencies in the USA, although no, there are always exceptions, for example, EthereumI expect that, POS currencies are centralized and removing them from the centralized exchanges means their end/Quote from: zasad@ on June 09, 2023, 11:13:40 AMhttps://twitter.com/Bitboy_Crypto/status/1666968425229369344Since this is a civil lawsuit, such courts can take a long time until the exchanges agree with the CEC on the rules for the crypto market.This depends on how Binance clean. I believe that they do some illegal behavior, such as manipulating the prices of altcoins through listing and delisting, some manipulation in the futures market, using customer deposits through that I do not expect that Binance will go far in judicial investigations because this means that more eyes will monitor its activity. They will abandon the US market, but they will try to make as much money as possible, and they may prefer to pay a settlement rather than go to court or try to give SEC what they want by sharing more data with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 10, 2023, 04:18:32 AM",
      "body": "Quote from: Husires on June 10, 2023, 02:02:34 AMThis depends on how Binance clean. I believe that they do some illegal behavior, such as manipulating the prices of altcoins through listing and delisting, some manipulation in the futures market, using customer deposits through that I do not expect that Binance will go far in judicial investigations because this means that more eyes will monitor its activity. Yes Binance does all this already, Coinbase too, almost all exchanges do it, but the question is why now? I mean, the SEC knew that from the beginning, but they turned a blind eye, but they have moved now, what is the reason?The problem is that users are faced with two difficult choices: they want the government to protect them from the manipulation or bankruptcy of exchanges, but at the same time they do not want to remain under government control, how can we solve this problem?Everyone sympathizes with Binance because it seems that the US government does not want to protect users, it just wants to destroy Crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 10, 2023, 10:03:05 AM",
      "body": "Quote from: Husires on June 10, 2023, 02:02:34 AMQuote from: zasad@ on June 09, 2023, 11:13:40 AMThen you can say goodbye to all POS cryptocurrencies in the USA, although no, there are always exceptions, for example, EthereumI expect that, POS currencies are centralized and removing them from the centralized exchanges means their end/Quote from: zasad@ on June 09, 2023, 11:13:40 AMhttps://twitter.com/Bitboy_Crypto/status/1666968425229369344Since this is a civil lawsuit, such courts can take a long time until the exchanges agree with the CEC on the rules for the crypto market.This depends on how Binance clean. I believe that they do some illegal behavior, such as manipulating the prices of altcoins through listing and delisting, some manipulation in the futures market, using customer deposits through that I do not expect that Binance will go far in judicial investigations because this means that more eyes will monitor its activity. They will abandon the US market, but they will try to make as much money as possible, and they may prefer to pay a settlement rather than go to court or try to give SEC what they want by sharing more data with them.Since this is a civil lawsuit, the defendant will have about 30 days to respond, and then agreements may be reached. Although Binance and other buyers are ready to pay fines, they do not understand how to proceed.In the US, either the law or the precedent will come first. The actions of the SEC put pressure on US lawmakers, so there is still no indication in the US which coins are commodities and which coins are stocks.The Ripple case should set a good precedent for the entire crypto industry, and in the US, case law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "June 12, 2023, 09:54:11 AM",
      "body": "It's funny when people still read bitboy's tweets and quote them. This guy is scum who kept telling people to buy all the shitcoins that later went to 0, not to mention his involvement in FTX. Back on topic. The SEC is blinded by its hate towards crypto after Gary Gensler got grilled in the Congress for not knowing about FTX being insolvent. Let's get some facts here.Gensler used to do courses on crypto. He wasn't anti-crypto.Gensler met with SBF in person more than once and did not see that SBF was full of shit.After the FTX collapse he became anti-crypto. He recently said that the US dollar is the only digital currency that we need and that we don't need more cryptocurrencies because fiat money is going digital. He obvously hates the industry and wants to show it to the world.Brian Armstrong said that he wanted to meet with Gensler a few times and he always declined. Why would Gensler meet with SBF but not Armstrong? Why would the chair of the CFTC meet with Armstrong but the chair of the SEC avoids him? Is it possible Gensler was being promised some benefits by SBF which is why he was so eager to repeatedly meet with him, but SBF obviously failed to deliver? Is it possible that Gensler feels cheated by the indoustry? He's going too far with this litigation, that I'm sure of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 14, 2023, 12:17:01 AM",
      "body": "Quote from: yhiaali3 on June 10, 2023, 04:18:32 AMYes Binance does all this already, Coinbase too, almost all exchanges do it, but the question is why now? I mean, the SEC knew that from the beginning, but they turned a blind eye, but they have moved now, what is the reason?Everyone sympathizes with Binance because it seems that the US government does not want to protect users, it just wants to destroy Crypto.Why now is a question that does not make sense, the regulatory authorities can move whenever they want, but clearly, the bankruptcy of FTX and the large losses that accompanied that with the apparent mismanagement of that platform is the reason behind this strictness in these legal activity.Quote from: yhiaali3 on June 10, 2023, 04:18:32 AMEveryone sympathizes with Binance because it seems that the US government does not want to protect users, it just wants to destroy Crypto.It is not a war, the office has allocated resources to look into the legal compliance of cryptocurrency exchanges and it is doing its job, I agree with some of the decisions especially related to Proof of Stake coins, it does not work in the same way as FUD want and interest on assets and therefore they have the right to regulate it.No one sympathizes with Binance that they claim to be legally compliant even though they do a lot of incomprehensible things.Quote from: pixie85 on June 12, 2023, 09:54:11 AMIs it possible that Gensler feels cheated by the indoustry? He's going too far with this litigation, that I'm sure of. Not him, but the deep view of this industry, as these exchanges are scam. They do not work according to legal licenses, and yet they are not decentralized. The war will be if decisions are taken against the true decentralized platforms or Bitcoin directly, which is not what happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 14, 2023, 03:33:48 AM",
      "body": "Quote from: Husires on June 14, 2023, 12:17:01 AMQuote from: pixie85 on June 12, 2023, 09:54:11 AMIs it possible that Gensler feels cheated by the indoustry? He's going too far with this litigation, that I'm sure of. Not him, but the deep view of this industry, as these exchanges are scam. They do not work according to legal licenses, and yet they are not decentralized. The war will be if decisions are taken against the true decentralized platforms or Bitcoin directly, which is not what happened.I disagree with you on this, these centralized exchanges are not all scams and they operate under legal licenses, they cannot operate in the US unless they obtain a legal license.It is true that this is not a war directed against Bitcoin directly, but I think it is an indirect war. They cannot target Bitcoin directly because of its strength and decentralization, so they try to besiege Bitcoin by attacking central third-party services and exchanges  because it can be easily targeted, and so they can contain Bitcoin or hit it indirectly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 14, 2023, 12:51:34 PM",
      "body": "Binance US Says Asset Freeze Sought by SEC Will Cripple Crypto Exchangehttps://news.yahoo.com/binance-us-says-asset-freeze-223843974.html\"Binance.US urged a federal judge to reject a Securities and Exchange Commission request to freeze billions of dollars of assets on the cryptocurrency exchange during a legal fight with the regulator, arguing the move would cripple its business and hurt customers.\"https://news.yahoo.com/binance-us-hires-former-sec-181258086.html\"Binance.US added four lawyers from Milbank LLP, including a former co-director of the Securities and Exchange Commission’s enforcement division, George Canellos, as the beleaguered crypto platform prepares its defense against US allegations of operating an illegal securities exchange.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "June 14, 2023, 09:41:55 PM",
      "body": "Quote from: zasad@ on June 08, 2023, 10:55:11 AMhttps://www.sec.gov/news/press-release/2023-102SEC Charges Coinbase for Operating as an Unregistered Securities Exchange, Broker, and Clearing AgencyCoinbase also charged for the unregistered offer and sale of securities in connection with its staking-as-a-service program.SEC document: originalhttps://storage.courtlistener.com/recap/gov.uscourts.nysd.599908/gov.uscourts.nysd.599908.1.0.pdfIs this a new trend? Everywhere in the internet it is either I am reading SEC vs coinbase or I am reading SEC vs Binance or I am reading SEC vs any other CEX. How did all this start? Did SEC just woke from slumber and discovered all the above listed coins are securities? Or was there a landing ground between SEC and the exchanges which the exchanges have defaulted? I want to know the remote cause.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 15, 2023, 03:39:22 AM",
      "body": "Quote from: zasad@ on June 14, 2023, 12:51:34 PMhttps://news.yahoo.com/binance-us-hires-former-sec-181258086.html\"Binance.US added four lawyers from Milbank LLP, including a former co-director of the Securities and Exchange Commission’s enforcement division, George Canellos, as the beleaguered crypto platform prepares its defense against US allegations of operating an illegal securities exchange.\"It is a matter of time before Binance leaves the US market. Litigation procedures take a long time, and customers will not be able to wait until the procedures are over, they will be allowed to withdraw their money in exchange for stopping work.I think this article is different from the title of the thread (SEC vs Coinbase.) If you are excited about the SEC news, you can quote my topic and I will lock it and you update it with all SEC updates. I just don't have the time to track and analyze that news.List: Crypto exchanges under SEC’s Radar!You can change the title from list to discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 15, 2023, 10:35:36 AM",
      "body": "Quote from: Husires on June 15, 2023, 03:39:22 AMQuote from: zasad@ on June 14, 2023, 12:51:34 PMhttps://news.yahoo.com/binance-us-hires-former-sec-181258086.html\"Binance.US added four lawyers from Milbank LLP, including a former co-director of the Securities and Exchange Commission’s enforcement division, George Canellos, as the beleaguered crypto platform prepares its defense against US allegations of operating an illegal securities exchange.\"It is a matter of time before Binance leaves the US market. Litigation procedures take a long time, and customers will not be able to wait until the procedures are over, they will be allowed to withdraw their money in exchange for stopping work.I think this article is different from the title of the thread (SEC vs Coinbase.) If you are excited about the SEC news, you can quote my topic and I will lock it and you update it with all SEC updates. I just don't have the time to track and analyze that news.List: Crypto exchanges under SEC’s Radar!You can change the title from list to discussion.I think that in such a historical moment, any news is important. Binance can agree to a fine and leave the US market without lengthy lawsuits. And Coinbase, on the contrary, is trying to put pressure on the SEC in various ways.What do you think is the reason for the SEC to close the biggest crypto exchanges in the US?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "June 15, 2023, 10:38:49 PM",
      "body": "Quote from: Husires on June 15, 2023, 03:39:22 AMIf you are excited about the SEC news, you can quote my topic and I will lock it and you update it with all SEC updates. I just don't have the time to track and analyze that news.List: Crypto exchanges under SEC’s Radar!You can change the title from list to discussion.Your thread is unique on it's own and it is fine in the board of service discussion. If you can make out time update it and add Coinbase and Binance and people will be suggesting more and that's it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "June 15, 2023, 10:48:49 PM",
      "body": "Quote from: yhiaali3 on June 14, 2023, 03:33:48 AMI disagree with you on this, these centralized exchanges are not all scams and they operate under legal licenses, they cannot operate in the US unless they obtain a legal license.It is true that this is not a war directed against Bitcoin directly, but I think it is an indirect war. They cannot target Bitcoin directly because of its strength and decentralization, so they try to besiege Bitcoin by attacking central third-party services and exchanges  because it can be easily targeted, and so they can contain Bitcoin or hit it indirectly.You're right about that. The exchanges do not operate outside the law. They operate outside of Gary Gensler's interpretation of the law.Coinbase got licensed by the FCA, has Arizona Money Transmitter license and was allowed by the SEC to go public on Nasdaq, so they were seeking guidance and approval from various agencies, but now the SEC is saying they were unlicensed. I don't like Coinbase for the way they're peddling shitcons and for their high fees, but they were trying to operate within the boundaries of the law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 16, 2023, 11:33:07 AM",
      "body": "Quote from: pixie85 on June 15, 2023, 10:48:49 PMQuote from: yhiaali3 on June 14, 2023, 03:33:48 AMI disagree with you on this, these centralized exchanges are not all scams and they operate under legal licenses, they cannot operate in the US unless they obtain a legal license.It is true that this is not a war directed against Bitcoin directly, but I think it is an indirect war. They cannot target Bitcoin directly because of its strength and decentralization, so they try to besiege Bitcoin by attacking central third-party services and exchanges  because it can be easily targeted, and so they can contain Bitcoin or hit it indirectly.You're right about that. The exchanges do not operate outside the law. They operate outside of Gary Gensler's interpretation of the law.Coinbase got licensed by the FCA, has Arizona Money Transmitter license and was allowed by the SEC to go public on Nasdaq, so they were seeking guidance and approval from various agencies, but now the SEC is saying they were unlicensed. I don't like Coinbase for the way they're peddling shitcons and for their high fees, but they were trying to operate within the boundaries of the law.  It is impossible to work under the old law in the US, because all the old cryptocurrency projects can be called stocks. Only bitcoin can be called a commodity. There are other coins like litecoin and dogecoin, but this is not so important now. Therefore, all major crypto projects in the US are at great risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "June 18, 2023, 01:42:11 PM",
      "body": "Quote from: zasad@ on June 15, 2023, 10:35:36 AMQuote from: Husires on June 15, 2023, 03:39:22 AMQuote from: zasad@ on June 14, 2023, 12:51:34 PMhttps://news.yahoo.com/binance-us-hires-former-sec-181258086.html\"Binance.US added four lawyers from Milbank LLP, including a former co-director of the Securities and Exchange Commission’s enforcement division, George Canellos, as the beleaguered crypto platform prepares its defense against US allegations of operating an illegal securities exchange.\"It is a matter of time before Binance leaves the US market. Litigation procedures take a long time, and customers will not be able to wait until the procedures are over, they will be allowed to withdraw their money in exchange for stopping work.I think this article is different from the title of the thread (SEC vs Coinbase.) If you are excited about the SEC news, you can quote my topic and I will lock it and you update it with all SEC updates. I just don't have the time to track and analyze that news.List: Crypto exchanges under SEC’s Radar!You can change the title from list to discussion.I think that in such a historical moment, any news is important. Binance can agree to a fine and leave the US market without lengthy lawsuits. And Coinbase, on the contrary, is trying to put pressure on the SEC in various ways.What do you think is the reason for the SEC to close the biggest crypto exchanges in the US?It's probably because of this, https://cointelegraph.com/news/us-democrats-backing-sec-s-crypto-authority-community-respondsQuoteThe United States Democratic Party has expressed its intent to back the Securities and Exchange Commission’s (SEC) total authority over crypto in a memo circulated among committee members before a hearing. The documents were shared on social media, causing backlash from crypto community members. On May 10, the documents were shared on Twitter, highlighting key messages for the Democrats to support the SEC’s authority on crypto regulation. This includes its argument that nearly all digital assets constitute securities.So it is political by now, US Democratic Party is hell bent on putting pressures on everything related to crypto, exchanges, deemed as securities and it might be even includes mining in general.They are sending the message and I doubt that Coinbase could put pressure on SEC, on the contrary, all crypto exchanges operating in the US are now in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "June 18, 2023, 08:14:18 PM",
      "body": "Quote from: zasad@ on June 16, 2023, 11:33:07 AMIt is impossible to work under the old law in the US, because all the old cryptocurrency projects can be called stocks. Only bitcoin can be called a commodity. There are other coins like litecoin and dogecoin, but this is not so important now. Therefore, all major crypto projects in the US are at great risk.What about bitcoin forks? What about Dash that was closely related to bitcoin. They're going too far with this, it's a witch hunt, they don't want to regulate anything. All they're doing is stirring the pot like Gensler is trying to show the world he wasn't in cahoots with SBF. It may look real for the average person who watches mainstream media but if you read the fine print there's so many red flags. Why did Gensler ignore Coinbase for so long and allow it to go public?Why did he change his stance right before the election year?Why was Gensler meeting in person with SBF but not Armstrong? Why did Blackrock appoint Coinbase as partner in their new bitcoin ETF right after Coinbase was sued by the SEC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}