{
  "id": "topic_5405827",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "July 10, 2022, 07:38:40 PM",
  "content": "Our elected governing officials set up the CIA to protect the US and its people. But CIA people are not elected by the people. In fact, nobody knows who the vast majority of them are. Yet, they often act without direct authority from government regarding what they do.Consider. George H. W. Bush was the 41st President (1989-1993). But if you Google \"Bush Nazi,\" you will find that Bush's dad supported Hitler and the Nazi's with shipping and banking in WW2. And now we have learned that the CIA is the operating organization that has installed at least 3 governments in the Ukraine, and that much of the Ukraine military is made up of Nazi's.Go figure. The CIA is making the Russia-Ukraine war happen, first by supporting their military with Nazi's, and then by using these Nazi's in guerilla warfare against Russia for the last 8 years, thereby pushing Russia to attack the Ukraine.The big question is, who orders the CIA to do what they do? Do they think their manipulations of governments around the world up by themselves? Or are there a whole bunch of non-government people who they take orders from for money? Or is it private orders from certain Dems and/or Reps?Take a look at how the CIA works against the public. Have you been taken in by them and their media control?How the media secretly carries out assignments for the CIAQuote from: https://www.naturalnews.com/2022-07-08-media-secretly-carries-out-assignments-for-cia.html#The June 21, 2022, Grayzone article,1 “British Security State Collaborator Paul Mason’s War on ‘Rogue Academics’ Exposed,” shines a great big light on what the “anti-disinformation” industry is really all about.(Article by Dr. Joseph Mercola republished from Articles.Mercola.com)Spoiler alert: It has nothing to do with protecting a gullible public from information that might cause them to make bad or unhealthy choices. No, it’s about creating and directing a narrative for the purpose of controlling the population and hiding truths that might overthrow the ruling cabal and its plans for a one world government.Operation MockingbirdPropaganda is as old as humanity itself, but the modern version of it can be traced back to 1948, when the CIA’s Office of Special Projects2 launched Operation Mockingbird,3,4 a clandestine CIA media infiltration campaign that involved bribing hundreds of journalists to publish fake stories at the CIA’s request.The CIA reportedly spent $1 billion a year (about one-third of its entire budget5) on this enterprise. CIA-recruited journalists worked in most major news organizations, including CBS News, Time, Life, Newsweek and The New York Times, just to name a few.6 Later on, the campaign expanded to include foreign media as well.7 As reported by the Free Press:8“In 1976, Senator Frank Church’s investigation into the CIA exposed their corruption of the media … The tactic was straightforward. False news reports or propaganda would be provided by CIA writers to knowing and unknowing reporters who would simply repeat the falsehoods over and over again.”During the Cold War, CIA propaganda disparaged communist ideologies. Today, it promotes radical ideas that bring us closer to The Great Reset — which is based on a technocratic economic system — instead.Media Is More Controlled Than EverWhile Operation Mockingbird is said to have been officially dismantled, there’s plenty of evidence to suggest it’s still in operation. If anything, the system has only gotten more efficient and effective, as the number of major media outlets has shrunk over these past decades, and a vast majority of journalists and news anchors simply parrot what’s reported by the three global news agencies....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405827",
  "comments": [
    {
      "author": "Kavelj22",
      "created_time": "July 10, 2022, 08:06:19 PM",
      "body": "Honestly, I do not know how members of the largest and most powerful intelligence agency in the world are appointed, but it is clear that it has an internal law regulating assignment operations that it is not in its interest to disclose, and there is no reason to disclose it outside official work circles.Of course, one of the main reasons for not disclosing the composition of the members and the methods for their appointment is that none of them is liable to accountability, nor is the body itself. Almost all of us know about the responsibility of this apparatus in many tragedies around the world, and I do not remember that it was explicitly accused of defaming it, whether by the US administration or international organizations.But the important thing is to know that the head of this administration is nominated by the President of the United States and approved by the US House of Representatives Congress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 10, 2022, 08:28:11 PM",
      "body": "Quote from: Kavelj22 on July 10, 2022, 08:06:19 PMHonestly, I do not know how members of the largest and most powerful intelligence agency in the world are appointed, but it is clear that it has an internal law regulating assignment operations that it is not in its interest to disclose, and there is no reason to disclose it outside official work circles.Of course, one of the main reasons for not disclosing the composition of the members and the methods for their appointment is that none of them is liable to accountability, nor is the body itself. Almost all of us know about the responsibility of this apparatus in many tragedies around the world, and I do not remember that it was explicitly accused of defaming it, whether by the US administration or international organizations.But the important thing is to know that the head of this administration is nominated by the President of the United States and approved by the US House of Representatives Congress.Bush, Sr., before he was President, was CIA director for some time. It was during his presidency that the USSR collapsed. Putin was KGB, the Russian counterpart of the US CIA. That's why the KGB took over operations right inside the Russian government, at the top level. It was their method for blocking the CIA. Now, since the CIA is blocked by the former KGB from manipulating Russia from within, they are doing what they can to manipulate Russia from without... this time from Ukraine.Since Bush's father was a Nazi supporter, Bush was right in on what Nazi's were all about, and their vicious tactics. Leftovers from those tactics are what the Bush-trained CIA is using right now.Of course we will never know the details of the whys and whats of the things the CIA is doing to take down Russia, or the various methods the CIA is being repelled by the KGB-Russian form of government. But knowing these things shows us why the war is there as it is.It's called Bush/Nazi/CIA/US-Government/Ukraine-Government against KGB-Russian Government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 10, 2022, 08:50:54 PM",
      "body": "CIA is a strongarm of whoever needs it an is in power be it government or big business (even tho the two are connected). So no, they don't work on their own nor do they think up this things by themselvs. It's not a specific group that gives orders or ideas, but rather numerous interests and fractions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "July 10, 2022, 09:01:19 PM",
      "body": "Quote from: BADecker on July 10, 2022, 08:28:11 PMQuote from: Kavelj22 on July 10, 2022, 08:06:19 PMHonestly, I do not know how members of the largest and most powerful intelligence agency in the world are appointed, but it is clear that it has an internal law regulating assignment operations that it is not in its interest to disclose, and there is no reason to disclose it outside official work circles.Of course, one of the main reasons for not disclosing the composition of the members and the methods for their appointment is that none of them is liable to accountability, nor is the body itself. Almost all of us know about the responsibility of this apparatus in many tragedies around the world, and I do not remember that it was explicitly accused of defaming it, whether by the US administration or international organizations.But the important thing is to know that the head of this administration is nominated by the President of the United States and approved by the US House of Representatives Congress.Bush, Sr., before he was President, was CIA director for some time. It was during his presidency that the USSR collapsed. Putin was KGB, the Russian counterpart of the US CIA. That's why the KGB took over operations right inside the Russian government, at the top level. It was their method for blocking the CIA. Now, since the CIA is blocked by the former KGB from manipulating Russia from within, they are doing what they can to manipulate Russia from without... this time from Ukraine.Since Bush's father was a Nazi supporter, Bush was right in on what Nazi's were all about, and their vicious tactics. Leftovers from those tactics are what the Bush-trained CIA is using right now.Of course we will never know the details of the whys and whats of the things the CIA is doing to take down Russia, or the various methods the CIA is being repelled by the KGB-Russian form of government. But knowing these things shows us why the war is there as it is.It's called Bush/Nazi/CIA/US-Government/Ukraine-Government against KGB-Russian Government.I can understand how you built your point of view, but with a slight difference that the activities of both organizations are driven by common interests and not that one actually controls the other. Interests are what drives both of them. In politics, there are no permanent friends and no permanent enemies, and those who were friends in the second war to eliminate Nazism suddenly became enemies in a cold war that continued for decades.The intelligence apparatus is intertwined with the presidency, whether in the United States or Russia, and it is necessarily the same in other regimes, so I am not surprised that members of this party occupy positions with the other party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}