{
  "id": "topic_5470266",
  "title": "jhonjhon",
  "author": "jhonjhon",
  "created_time": "October 14, 2023, 02:40:11 AM",
  "content": "As you can see in my profile, I was tagged by \"actmyname\" as a member of the spammers list. Consequently, I've been considering that perhaps the quality of my posts doesn't meet the forum's standards. Now, I know you might wonder, \"Where have you been? It's been a long time since I've seen you\" (referring to my account's activity). But don't worry about that. Let's focus on the main topic, which is not just about me but also for other users who want to enhance their writing.I've noticed some posts relating to AI-generated content, so I'd like to ask: Is it against the forum's rules to use AI-generated content? For example, I want to compose a sentence or comment on a topic where I'd like to share my knowledge. However, since English is not my native language, sometimes what I'm thinking might not translate well in writing. I find AI to be a helpful tool for improving my writing, and I believe it could also make the moderators' job easier.To what extent is it acceptable to use AI to enhance regular forum posts?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470266",
  "comments": [
    {
      "author": "Timelord2o67",
      "created_time": "October 14, 2023, 02:42:24 AM",
      "body": "Ordinarily I'd say \"no\" because then it's not your own views or opinions that you are expressing, rather a computer's \"guess\" of what you want to say.Your title shows that you are not a native English speaker.  Perhaps you should try learning English just a bit more - in doing so, the quality of your posts will improve and you won't need to fake your posts with AI content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 14, 2023, 02:47:50 AM",
      "body": "Quote from: jhonjhon on October 14, 2023, 02:40:11 AMI've noticed some posts relating to AI-generated content, so I'd like to ask: Is it against the forum's rules to use AI-generated content? For example, I want to compose a sentence or comment on a topic where I'd like to share my knowledge. However, since English is not my native language, sometimes what I'm thinking might not translate well in writing. I find AI to be a helpful tool for improving my writing, and I believe it could also make the moderators' job easier.What you are saying is nothing but plagiarizing, which is against forum rules and you will be banned if you use AI to create posts for you.If you can't able to write in English then use the local board section.Quote from: jhonjhon on October 14, 2023, 02:40:11 AMTo what extent is it acceptable to use AI to enhance regular forum posts?Using it to correct your grammar is acceptable since one of the forum members used it as far as I know but blatantly posting content created by AI will get you a temp/permanent ban or atleast a negative tag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jhonjhon",
      "created_time": "October 14, 2023, 02:59:50 AM",
      "body": "Quote from: Timelord2o67 on October 14, 2023, 02:42:24 AMOrdinarily I'd say \"no\" because then it's not your own views or opinions that you are expressing, rather a computer's \"guess\" of what you want to say.Your title shows that you are not a native English speaker.  Perhaps you should try learning English just a bit more - in doing so, the quality of your posts will improve and you won't need to fake your posts with AI content.I do understand English, even though I'm not a native speaker. My purpose in using AI is to refine my language skills to the maximum extent, similar to how one might use Grammarly. It's like having thoughts in your mind and having someone more proficient express them effectively on your behalf. I want to clarify that I fully comprehend what I post. Some individuals find poorly written English posts to be a visual annoyance, but even when someone tries to enhance them, they may not always appreciate the effort. Consequently, many people might eventually give up. Isn't the creation of such tools intended to assist us in improving our communication?Quote from: Findingnemo on October 14, 2023, 02:47:50 AMQuote from: jhonjhon on October 14, 2023, 02:40:11 AMI've noticed some posts relating to AI-generated content, so I'd like to ask: Is it against the forum's rules to use AI-generated content? For example, I want to compose a sentence or comment on a topic where I'd like to share my knowledge. However, since English is not my native language, sometimes what I'm thinking might not translate well in writing. I find AI to be a helpful tool for improving my writing, and I believe it could also make the moderators' job easier.What you are saying is nothing but plagiarizing, which is against forum rules and you will be banned if you use AI to create posts for you.That's right and agree with that, so that question is already answered.If you can't able to write in English then use the local board section.Quote from: Findingnemo on October 14, 2023, 02:47:50 AMQuote from: jhonjhon on October 14, 2023, 02:40:11 AMTo what extent is it acceptable to use AI to enhance regular forum posts?Using it to correct your grammar is acceptable since one of the forum members used it as far as I know but blatantly posting content created by AI will get you a temp/permanent ban or atleast a negative tag.This is where I'd position myself as well. However, I've come across posts that seemed to contain phrases commonly associated with AI-generated content, even though anyone could use those phrases. I believe that people can generally discern if an entire post has been generated solely by AI, don't you think?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2o67",
      "created_time": "October 14, 2023, 03:13:04 AM",
      "body": "As I started to read your reply \"Grammerly\" came to mind then you said it in your post.  If you do feel the need to use AI in your posts, then can I suggest you use the AI content as a \"draft\" - but not include it in the final post.  Read what the computer came up with and then put that text into your own words (but don't just alter one or two words here and there as it will be picked up by those in the Forum who scrutinise such things)Take your time and consider creating two different responses that draw in the AI content, but aren't reliant on it.(and parts of your reply read as though they were created via AI)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 14, 2023, 03:16:33 AM",
      "body": "On the top of my head: go use AI when trying to learn how to write properly/legibly, but don't use AI to create your replies. Because are you actually learning if the AI writes for you even if you provide the ideas?Your english doesn't even need to be perfect; if we can understand what you're trying to say despite it being in broken english, then it's fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jhonjhon",
      "created_time": "October 14, 2023, 03:30:54 AM",
      "body": "Quote from: mk4 on October 14, 2023, 03:16:33 AMOn the top of my head: go use AI when trying to learn how to write properly/legibly, but don't use AI to create your replies. Because are you actually learning if the AI writes for you even if you provide the ideas?Obviously, that's not what I intend to do. I don't use AI to compose my responses. Instead, I create a draft of my post and have AI review it for grammar corrections and punctuation. Is it too much to ask for this tool?Quote from: mk4 on October 14, 2023, 03:16:33 AMYour english doesn't even need to be perfect; if we can understand what you're trying to say despite it being in broken english, then it's fine.Is it because of my broken English that I was tagged, I guess, so I want to ensure it doesn't happen again. If there's a way to make improvements, such as correcting spelling and making minor adjustments, a tool would be helpful. My main point here is that the thoughts would still remain, just as I originally created them. I'm seeking some assistance in eliminating these errors or improving the text.Quote from: Timelord2o67 on October 14, 2023, 03:13:04 AM(and parts of your reply read as though they were created via AI)Can you point which part?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 14, 2023, 03:42:31 AM",
      "body": "Quote from: jhonjhon on October 14, 2023, 02:40:11 AMI've noticed some posts relating to AI-generated content, so I'd like to ask: Is it against the forum's rules to use AI-generated content? For example, I want to compose a sentence or comment on a topic where I'd like to share my knowledge. However, since English is not my native language, sometimes what I'm thinking might not translate well in writing. I find AI to be a helpful tool for improving my writing, and I believe it could also make the moderators' job easier.What’s against the forum is plagiarism and once you use an AI to help you compose a post then it is kinda off classified as a palagrized work because AI wrote it from starting to end. If you think your English is not too good and you need a better way to communicate, then what you might need is not an AI but rather a English Grammarly or something like Quillbot which corrects your spelling and and paraphrase some of your English that are not well arranged. This way it is your idea and some spelling checks. Other than that, the easiest thing is to first stick to your local and allow your English to get better first. I believe almost all the major languages have a designated local board here and it is not like you would miss much because most of this educational threads on English boards have been translated to various languages in the forum to help users understand some basics of cryptocurrency without having the major need to understand English properly. I believe if you stick around local Board and be gradually coming to the English board you will develop faster and safely rather than wanting to rush it through AI",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 14, 2023, 03:48:17 AM",
      "body": "IMO:Bad: \"Write a response to this question asked on a forum: <OP here>\"Okay: \"Fix the spelling mistakes on this post I just wrote: <original post here>",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 14, 2023, 03:54:11 AM",
      "body": "write your untouched postcall it untouched post a:do a double line have ai clean it up to show both versionscall part 2 ai version.this covers you and if you do that people may point out why the ai is better or not better.it would help you learn english and you would gain a better understanding of why a sentence written in english is working.BTW if you look above I wrote much like the Author James Joyce.ie stream of consciousness.If you can do that in hand written and show us that along with the ai cleanup of it.I would think you would be on the way to posting better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "October 14, 2023, 04:07:40 AM",
      "body": "Quote from: jhonjhon on October 14, 2023, 02:59:50 AMThis is where I'd position myself as well. However, I've come across posts that seemed to contain phrases commonly associated with AI-generated content, even though anyone could use those phrases. I believe that people can generally discern if an entire post has been generated solely by AI, don't you think?That statement above is of such higher quality in terms of English proficiency than your posts from back in 2017 that I have to wonder if you're either already using some kind of AI tool to polish your shortcomings OR you somehow got your hands on this account which used to belong to someone else.  A third possibility is that you've improved your English, but I don't think I've ever seen that happen with an account that's recently woken up from a long break.Anyone else get that sense?  Am I being paranoid here?  I seriously doubt I am, and if that's true it's baffling to me why OP would create a thread like this, which just invites scrutiny from shitposter/account buyer hunters.  Any good detectives want to delve into this one?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "October 14, 2023, 04:21:22 AM",
      "body": "AI generated post is not really your opinion and there are high chances you will not even learn anything from the conversation neither will you understand in details, what you posted. In other words, AI will make you practically lazy and that is not how to grow. Besides, AI generated posts are easy to notice and by that, it bring a bad reputation to you and whatever you represent especially in a forum like this where your opinion is needed and mot someone else's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "October 14, 2023, 05:05:19 AM",
      "body": "Quote from: jhonjhon on October 14, 2023, 03:30:54 AMIs it because of my broken English that I was tagged, I guess, so I want to ensure it doesn't happen again. If there's a way to make improvements, such as correcting spelling and making minor adjustments, a tool would be helpful. My main point here is that the thoughts would still remain, just as I originally created them. I'm seeking some assistance in eliminating these errors or improving the text.I doubt the reason why you were tagged as a spammer had anything to do with your grammar but rather the number of your posts that has been deleted by moderators.  If you want to improve your grammar then install grammarly in your system, it will provide you with some suggestions that will make your text more understandable. It’s far more better than just going to a “text spinner” and automatically paraphrased everything you wrote before, with grammarly you’ll get to learn what to do to your sentences the next you want to make a post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jhonjhon",
      "created_time": "October 14, 2023, 05:05:43 AMLast edit: October 14, 2023, 05:30:34 AM by jhonjhon",
      "body": "Quote from: The Sceptical Chymist on October 14, 2023, 04:07:40 AMQuote from: jhonjhon on October 14, 2023, 02:59:50 AMThis is where I'd position myself as well. However, I've come across posts that seemed to contain phrases commonly associated with AI-generated content, even though anyone could use those phrases. I believe that people can generally discern if an entire post has been generated solely by AI, don't you think?That statement above is of such higher quality in terms of English proficiency than your posts from back in 2017 that I have to wonder if you're either already using some kind of AI tool to polish your shortcomings OR you somehow got your hands on this account which used to belong to someone else.  So, you're comparing my 2017 post to the present? Wow, that was at least 5 years ago, and a lot has happened in my life since then. I've become a professional and gained more work experience, which has helped me grow as a person. I don't have much time for the forum anymore; I'm just visiting because I've heard the bull run is coming. While browsing some random posts, I came across topics related to AI, and that's why I brought up this subject.The tone of your replies seems very negative to me. I didn't intend to plagiarize or let an AI do the posting; it was just a simple question, and I'd appreciate some honest and sincere answers.Quote from: The Sceptical Chymist on October 14, 2023, 04:07:40 AMA third possibility is that you've improved your English, but I don't think I've ever seen that happen with an account that's recently woken up from a long break.Anyone else get that sense?  Am I being paranoid here?  I seriously doubt I am, and if that's true it's baffling to me why OP would create a thread like this, which just invites scrutiny from shitposter/account buyer hunters.  Any good detectives want to delve into this one?Please don't be paranoid, as this thing I brought up is happening already in this forum and this topic is not only for me but for the community as a whole.Honestly, I found the answer I needed. It doesn't necessarily have to be a lengthy reply, but it's exactly what I was looking for.And I'd like to thank this guy below for having the smartest reply. Quote from: TryNinja on October 14, 2023, 03:48:17 AMIMO:Bad: \"Write a response to this question asked on a forum: <OP here>\"Okay: \"Fix the spelling mistakes on this post I just wrote: <original post here>Will give you +1  if I have merit. (done, turns out I have 4)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "October 14, 2023, 05:22:17 AM",
      "body": "Quote from: jhonjhon on October 14, 2023, 02:40:11 AMAs you can see in my profile, I was tagged by \"actmyname\" as a member of the spammers list. Consequently, I've been considering that perhaps the quality of my posts doesn't meet the forum's standards. Now, I know you might wonder, \"Where have you been? It's been a long time since I've seen you\" (referring to my account's activity). But don't worry about that. Let's focus on the main topic, which is not just about me but also for other users who want to enhance their writing.I've noticed some posts relating to AI-generated content, so I'd like to ask: Is it against the forum's rules to use AI-generated content? For example, I want to compose a sentence or comment on a topic where I'd like to share my knowledge. However, since English is not my native language, sometimes what I'm thinking might not translate well in writing. I find AI to be a helpful tool for improving my writing, and I believe it could also make the moderators' job easier.To what extent is it acceptable to use AI to enhance regular forum posts?For me it's better to try my best rather than cheating or plagiarizing other contents,  using AI can make our post easier and faster but always remember that using AI we can not express our own ideas, also we must remember that cheaters always win but never learn. While you are using your mind to construct those words even though in the beginning it's not perfect but soon for sure you will learn and you will become a quality posters .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 14, 2023, 05:32:58 AM",
      "body": "Quote from: The Sceptical Chymist on October 14, 2023, 04:07:40 AMThat statement above is of such higher quality in terms of English proficiency than your posts from back in 2017 that I have to wonder if you're either already using some kind of AI tool to polish your shortcomings OR you somehow got your hands on this account which used to belong to someone else.  A third possibility is that you've improved your English, but I don't think I've ever seen that happen with an account that's recently woken up from a long break.The fourth possibility, and to my mind the most likely, is that he is using an automatic translator such as Deepl.com. The level of reliability is very high nowadays and they are used massively on and off the forum. He doesn't break any rules if he does that as far as I know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 14, 2023, 05:37:51 AM",
      "body": "To blatantly use AI-generated queries or text it and just paste it will not help. AI could help you understand what you are posting about but not directly copy and paste it. I believe it can be a tool that can help you learn about the things you have yet to understand. Most importantly, you need to understand it and fact-check if the AI has generated a factual thing because you can never really know unless you thoroughly do it. It can improve your posting quality but not in the way that you think. It's all about having your thoughts about it and diving in deep into the topics with your thoughts.Grammarly, like the other members suggest would help you in grammar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 14, 2023, 05:42:27 AM",
      "body": "Nope, using AI wouldn't help you, take a look with this report where there was a user wrote \"knowledge cutoff\", this phrase is really uncommon to use. My English isn't perfect and sometime I mixing up my words, so I think the moderators weren't delete your posts because the way you wrote, but it's because the quality of the post. So rather than use AI, you need to learn about Bitcoin more.Quote from: jhonjhon on October 14, 2023, 05:05:43 AMWill give you +1  if I have merit.Isn't you still have it? AFAIK even your 100 merits were airdropped, but it's not mean you have 0 sMerit.Code:Merit Information Sent Earned Value 13 25",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jhonjhon",
      "created_time": "October 14, 2023, 05:46:10 AMLast edit: October 14, 2023, 05:56:35 AM by jhonjhon",
      "body": "Quote from: Don Pedro Dinero on October 14, 2023, 05:32:58 AMQuote from: The Sceptical Chymist on October 14, 2023, 04:07:40 AMThat statement above is of such higher quality in terms of English proficiency than your posts from back in 2017 that I have to wonder if you're either already using some kind of AI tool to polish your shortcomings OR you somehow got your hands on this account which used to belong to someone else.  A third possibility is that you've improved your English, but I don't think I've ever seen that happen with an account that's recently woken up from a long break.The fourth possibility, and to my mind the most likely, is that he is using an automatic translator such as Deepl.com. The level of reliability is very high nowadays and they are used massively on and off the forum. He doesn't break any rules if he does that as far as I know. That's crazy. Why would I use a translator if I can write in English? Your suspicion is entirely baseless.Quote from: crwth on October 14, 2023, 05:37:51 AMGrammarly, like the other members suggest would help you in grammar. So AI tool can't be use to function like Grammarly?Quote from: Plaguedeath on October 14, 2023, 05:42:27 AM So rather than use AI, you need to learn about Bitcoin more.Now, this is the kind of post that is off-topic. We are in the meta section, not discussing Bitcoin. Of course, I am aware of Bitcoin. Please focus on the concern I raised; it's not related to investment or any such matters. I'm sure some members here use AI to check their grammar, right? Using it to cheat by plagiarizing is the wrong approach.The idea of using AI should be welcomed, but it must be within certain limits. This is why I asked in my initial post:Quote from: jhonjhon on October 14, 2023, 02:40:11 AMTo what extent is it acceptable to use AI to enhance regular forum posts?Please, everyone, read my post carefully and understand it before making a comment. It seems like you're eager to comment, assuming I intend to use AI to do the posting job. You're mistaken if you think that way. Let's be more objective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 14, 2023, 05:58:41 AM",
      "body": "Quote from: The Sceptical Chymist on October 14, 2023, 04:07:40 AMAnyone else get that sense?  Am I being paranoid here?  I seriously doubt I am, and if that's true it's baffling to me why OP would create a thread like this, which just invites scrutiny from shitposter/account buyer hunters.That was my thought exactly after reading few of OP's posts.Quote from: The Sceptical Chymist on October 14, 2023, 04:07:40 AMAny good detectives want to delve into this one?I don't think that is against forum rules to use AI tools to correct grammar mistakes so therefore I don't think there's anything to \"detect\". At least not for know.Quote from: jhonjhon on October 14, 2023, 05:05:43 AMThe tone of your replies seems very negative to me. I didn't intend to plagiarize or let an AI do the posting; it was just a simple question, and I'd appreciate some honest and sincere answers.Well, you asked for an opinion and he gave you one. I suggest you to grow a thicker skin if you plan to remain being active here because people may say much worse things to you and you will have to deal with it. Quote from: jhonjhon on October 14, 2023, 05:46:10 AMThat's crazy. Why would I use a translator if I can write in English? Your suspicion is entirely baseless.There are some known forum members that admitted using Google translate (despite knowing English) in order to express themselves better so that woulnd't been something we haven't seen before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}