{
  "id": "topic_5467765",
  "title": "Guessti",
  "author": "Guessti",
  "created_time": "September 22, 2023, 10:42:56 PMLast edit: September 22, 2023, 10:55:11 PM by Guessti",
  "content": "I will keep all my bitcoin on 1 single address thank you and change it when I want.Not spread it across many different directions/addresses everytime I send some btc causing much higher fees pretending my privacy is enhanced.What a joke. What a con.Many ways outside of the blockchain to increase privacy without clogging up bitcoin with such non sense.I don't care if you think otherwise, I'm pretty mad/pissed/upset about it.But whatever. Stay ignorant and keep paying higher fees.  I mean really, do you like when you go to move all your funds at once and realize you really have much less -- cause all the fees that need to happen because now all your bitcoins were spread across many different wallet addresses..That is appealing to you? OK. Whatever.EDIT:For those of you who don't know, pretty much every bitcoin wallet app is forcing you to use these change addresses, and thats why the more you use it the higher your fees have been at random times.Unless you were sending a small amount and it was pulling that from 1 address, then the fees were normal.But when you went to spend a higher amount, you were paying higher fees if it had to hit 2, 3, 4, etc wallets that your funds cause \"change addressed\" to over time. It wasn't because you were sending more bitcoin, that isn't how bitcoin was meant to work. The fee is always the same no matter the amount as long as all the bitcoins are in 1 bitcoin address.In the early days when you went to lookup your wallet address on the blockchain you would see all your funds in the wallet.But now if you do that and had spent bitcoins since then, you'll see they were moved to other wallets. Some funds would stay behind again if you hadn't spent funds since receiving.This is sick. You don't need this and it doesn't help your privacy not at least in a way thats worth the sick fees you pay over time.But if you been using an exchange you might never notice, cause they doing it the old way where the fees stay 50 cents to a dollar.Take coinbase, venmo, cashapp, paypal for example thats what they charge to send btc. Cashapp lets you send btc free on lightning network but you have to send $25+ otherwise it as an option to pay $1 or $2 If you tried doing this yourself the fees would get out of control over time, because now most wallets for some reason changed to this stupid false privacy enhancement that really does nothing but give you the illusion you have much more privacy. It does cause some people a headache -- but not worth the fees you pay at all over the long run, not even close. And its only getting worse.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467765",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 22, 2023, 11:05:10 PM",
      "body": "You are still not getting it right just like on your other thread.It was made clear on your other thread that it is not about change address, it is about how many times people sent you bitcoin.If Mr. A, B and C sent you 0.01 BTC each on a single bitcoin address making 0.03. And you need 500 sat as fee if you want to send all the 0.3 BTC to Mr. D at once.If Mr. A sent you 0.01 BTC to your address A, Mr. B sent you 0.01 BTC to your address B, Mr. C sent your 0.1 BTC to address C. Also 500 sat needed as fee for the above transaction would be required for a transaction to Mr. D if you want to smd all at once to Mr. D because both transaction have the same number of inputs which is 3 and sending to the same number of output.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Guessti",
      "created_time": "September 22, 2023, 11:09:50 PM",
      "body": "Quote from: Charles-Tim on September 22, 2023, 11:05:10 PMIt was made clear on your other thread that it is not about change address, it is about how many times people send you bitcoin.If Mr. A, B and C send you 0.01 BTC each on a single bitcoin address making 0.03 BTC and you need 500 sat as fee if you want to send all the 0.3 BTC to Mr. D. If Mr. A send you 0.01 BTC to your address A, Mr. B send you 0.01 BTC to your address B, Mr. C send your 0.1 BTC to address C. Also 500 sat needed as fee for the above transaction would be required for a transaction to Mr. D bechsse they have the same input count which is 3. That is, the bitcoin sent.I stated I always have people send at the same exact address.As you spend bitcoin they get spread accross different addresses then when you spend more than whats in 1 wallet you end up paying higher fees.Nothing simpler than that.Stop speaking on stuff you are clueless about.  It literally has nothing to do with how many times people send you bitcoin. You don't pay fees to receive. **Let me say this again, I have people send at the same exact bitcoin wallet address -- not a bunch of different ones the app generates each time you click receive.I'll repeat:Change addresses cause the bitcoins to then be moved across multiple addresses so then when you go to spend your bitcoins again if its more than what 1 address has, now your paying higher fees.Simple. OK? Stupid YES.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 22, 2023, 11:17:57 PM",
      "body": "Quote from: Guessti on September 22, 2023, 11:09:50 PMStop speaking on stuff you are clueless about.  Go and learn more about coin control and how bitcoin transaction is before posting rubbish on this forum. You may not know that your post is full of rubbish. After you have known how you can practically use coin control, knowing how to consolidate your inputs when the mempool is less congested, you will know by that time that you have been posting rubbish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "September 22, 2023, 11:38:32 PM",
      "body": "You don't pay addition fee when you use change address because the output will be only the receiver's address and your sending address (if you don't use change address) or your change address, same outputs I mean.What is the \"Change\" address on bitcoin wallet ? read to know !Learn about UTXOs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Guessti",
      "created_time": "September 22, 2023, 11:43:35 PM",
      "body": "Quote from: tbct_mt2 on September 22, 2023, 11:38:32 PMYou don't pay addition fee when you use change address because the output will be only the receiver's address and your sending address (if you don't use change address) or your change address, same outputs I mean.What is the \"Change\" address on bitcoin wallet ? read to know !Learn about UTXOsQuote from: Charles-Tim on September 22, 2023, 11:17:57 PMQuote from: Guessti on September 22, 2023, 11:09:50 PMStop speaking on stuff you are clueless about.  Go and learn more about coin control and how bitcoin transaction is before posting rubbish on this forum. You may not know that your post is full of rubbish. After you have known how you can practically use coin control, knowing how to consolidate your inputs when the mempool is less congested, you will know by that time that you have been posting rubbish.You pay more fees when your bitcoins get spread across many different wallets caused by using change addresses.If your wallet has 1 btc and its gotten spread across multiple wallets \"for privacy\" this happens when you spend btc. Change addresses.So you have 1 btc but now its in multiple addresses, so if you spend it you end up paying higher feess than if it sat in 1 single address.Not sure why people keep trying to argue about something so simple.  What is a change address? In a UTXO-based cryptocurrency like Bitcoin, a change address is an address to which the remainder of a transaction's inputs are sent after the desired amount has been sent to the recipient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 22, 2023, 11:45:48 PM",
      "body": "There are levels to privacy right? So while you are correct that using change addresses isn’t going to fool the FBI into thinking you aren’t holding funds, it might fool the casual observer. There are downsides to using change addresses too when it comes to backing up funds. For most users I think the simplicity of using a single address would probably be advised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 22, 2023, 11:49:02 PM",
      "body": "Quote from: Guessti on September 22, 2023, 10:42:56 PMI will keep all my bitcoin on 1 single address thank you and change it when I want.Not spread it across many different directions/addresses everytime I send some btc causing much higher fees pretending my privacy is enhanced.What a joke. What a con.Many ways outside of the blockchain to increase privacy without clogging up bitcoin with such non sense.I don't care if you think otherwise, I'm pretty mad/pissed/upset about it.But whatever. Stay ignorant and keep paying higher fees.  I mean really, do you like when you go to move all your funds at once and realize you really have much less -- cause all the fees that need to happen because now all your bitcoins were spread across many different wallet addresses..That is appealing to you? OK. Whatever.EDIT:For those of you who don't know, pretty much every bitcoin wallet app is forcing you to use these change addresses, and thats why the more you use it the higher your fees have been at random times.Unless you were sending a small amount and it was pulling that from 1 address, then the fees were normal.But when you went to spend a higher amount, you were paying higher fees if it had to hit 2, 3, 4, etc wallets that your funds cause \"change addressed\" to over time. It wasn't because you were sending more bitcoin, that isn't how bitcoin was meant to work. The fee is always the same no matter the amount as long as all the bitcoins are in 1 bitcoin address.In the early days when you went to lookup your wallet address on the blockchain you would see all your funds in the wallet.But now if you do that and had spent bitcoins since then, you'll see they were moved to other wallets. Some funds would stay behind again if you hadn't spent funds since receiving.This is sick. You don't need this and it doesn't help your privacy not at least in a way thats worth the sick fees you pay over time.But if you been using an exchange you might never notice, cause they doing it the old way where the fees stay 50 cents to a dollar.Take coinbase, venmo, cashapp, paypal for example thats what they charge to send btc. Cashapp lets you send btc free on lightning network but you have to send $25+ otherwise it as an option to pay $1 or $2 If you tried doing this yourself the fees would get out of control over time, because now most wallets for some reason changed to this stupid false privacy enhancement that really does nothing but give you the illusion you have much more privacy. It does cause some people a headache -- but not worth the fees you pay at all over the long run, not even close. And its only getting worse.and once again using doge and ltc for small transactions stops this problem in its tracks.this simple fact is not changing any time soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Guessti",
      "created_time": "September 22, 2023, 11:50:26 PM",
      "body": "Quote from: OgNasty on September 22, 2023, 11:45:48 PMThere are levels to privacy right? So while you are correct that using change addresses isn’t going to fool the FBI into thinking you aren’t holding funds, it might fool the casual observer. There are downsides to using change addresses too when it comes to backing up funds. For most users I think the simplicity of using a single address would probably be advised. I agree, but I just don't agree that its worth how much more you end up paying in fees over time.In my case, anyone with block explorer could see where my funds were ending up, it didn't take the FED.The fact that it has become a norm and forced on the average user is insane. But of course the average user is just going to be sticking to exchanges anyway.But this is going to scare them away from using own wallet.. 99% of the bitcoin wallet apps don't even have the option to turn this \"feature\" off.If you have hundreds or thousands of dollars in bitcoin for example, but have been sending $10 - $50 here and there for example... then come back and send all your bitcoins somewhere you'll find out your bitcoins have been spread across many different wallets now just from spending bitcoin (not receiving because you can have funds sent to same address, this doesn't stop change addresses from spreading your funds over time)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 22, 2023, 11:51:17 PM",
      "body": "It seems you didn't understand how the transaction works like the above said even if you receive a changed BTC to change address from your wallet it does not only happen to change address. Even if you receive it in a single address you will still get high fees if you have multiple unspent transactions having multiple UTXOs in a single address or any address of your wallet can affect the transaction fees(it's all about the weight).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Guessti",
      "created_time": "September 22, 2023, 11:51:45 PM",
      "body": "Quote from: BitMaxz on September 22, 2023, 11:51:17 PMIt seems you didn't understand how the transaction works like the above said even if you receive a changed BTC to change address from your wallet it does not only happen to change address. Even if you receive it in a single address you will still get high fees if you have multiple unspent transactions having multiple UTXOs in a single address or any address of your wallet can affect the transaction fees(it's all about the weight).Learn to read.   I already explained how it works.Quote from: philipma1957 on September 22, 2023, 11:49:02 PMQuote from: Guessti on September 22, 2023, 10:42:56 PMI will keep all my bitcoin on 1 single address thank you and change it when I want.Not spread it across many different directions/addresses everytime I send some btc causing much higher fees pretending my privacy is enhanced.What a joke. What a con.Many ways outside of the blockchain to increase privacy without clogging up bitcoin with such non sense.I don't care if you think otherwise, I'm pretty mad/pissed/upset about it.But whatever. Stay ignorant and keep paying higher fees.  I mean really, do you like when you go to move all your funds at once and realize you really have much less -- cause all the fees that need to happen because now all your bitcoins were spread across many different wallet addresses..That is appealing to you? OK. Whatever.EDIT:For those of you who don't know, pretty much every bitcoin wallet app is forcing you to use these change addresses, and thats why the more you use it the higher your fees have been at random times.Unless you were sending a small amount and it was pulling that from 1 address, then the fees were normal.But when you went to spend a higher amount, you were paying higher fees if it had to hit 2, 3, 4, etc wallets that your funds cause \"change addressed\" to over time. It wasn't because you were sending more bitcoin, that isn't how bitcoin was meant to work. The fee is always the same no matter the amount as long as all the bitcoins are in 1 bitcoin address.In the early days when you went to lookup your wallet address on the blockchain you would see all your funds in the wallet.But now if you do that and had spent bitcoins since then, you'll see they were moved to other wallets. Some funds would stay behind again if you hadn't spent funds since receiving.This is sick. You don't need this and it doesn't help your privacy not at least in a way thats worth the sick fees you pay over time.But if you been using an exchange you might never notice, cause they doing it the old way where the fees stay 50 cents to a dollar.Take coinbase, venmo, cashapp, paypal for example thats what they charge to send btc. Cashapp lets you send btc free on lightning network but you have to send $25+ otherwise it as an option to pay $1 or $2 If you tried doing this yourself the fees would get out of control over time, because now most wallets for some reason changed to this stupid false privacy enhancement that really does nothing but give you the illusion you have much more privacy. It does cause some people a headache -- but not worth the fees you pay at all over the long run, not even close. And its only getting worse.and once again using doge and ltc for small transactions stops this problem in its tracks.this simple fact is not changing any time soon.You can use bitcoin in a way that doesn't spread your funds across multiple addresses everytime you go to send bitcoin. You just gotta find a wallet that supports it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 11:54:20 PM",
      "body": "Acutally using a change address, is the way that you need to use to get your change back, so if one of your UTXO is 1 Bitcoin  and you only need to send 0.5 Bitcoin, What are you goint to use to get your change Back to you? Of couse a Change address, it can be the same of the source of a new one Address if you ask me i prefer to use a different address each time. But that depend only of your preferenceIn any CASE you NEED use one Change Address i mean the extra 50 bytes for the extra output will be payed even if the change address is the same than the source address or notThe only way to not use a change addres is when you made a transaction without change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Guessti",
      "created_time": "September 22, 2023, 11:55:23 PM",
      "body": "Quote from: albert0bsd on September 22, 2023, 11:54:20 PMAcutally using a change address, is the way that you need to use to get your change back, so if one of your UTXO is 1 Bitcoin  and you only need to send 0.5 Bitcoin, What are you goint to use to get your change Back to you? Of couse a Change address, it can be the same of the source of a new one Address if you ask me i prefer to use a different address each time. But that depend only of your preferenceIn any CASE you NEED use one Change Address i mean the extra 50 bytes for the extra output will be payed even if the change address is the same than the source address.The only way to not use a change addres is when you made a transaction without change.Learn to read for once.   I explained if you keep your funds in 1 address you won't have the issue of paying higher fees later. You aren't changing the address at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 23, 2023, 12:04:10 AM",
      "body": "Quote from: Guessti on September 22, 2023, 11:55:23 PMLearn to read for once.   I explained if you keep your funds in 1 address you won't have the issue of paying higher fees later. You aren't changing the address at all.As I said even if you only have 1 address to receive funds you will still pay a higher fee if you have multiple unspent transactions from that 1 address.You can only reduce the fees if you consolidate all unspent transactions into one unspent transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 23, 2023, 12:07:29 AM",
      "body": "That recomendation is also for you.You need to pay extra bytes for each output regarless if it is the same source address or a new one.But really nobody cares what you decide to do with your address, that is OKA lot of software allow to do what you actually want to do. It is up to you.Example sparrow, you only need to set up the change address manuallyTestnet: ae1ba8626b2b90a8b75545f455bd1ace6ffff828257410c4ed88464d830960ce",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 23, 2023, 02:45:51 AM",
      "body": "Quote from: BitMaxz on September 23, 2023, 12:04:10 AMQuote from: Guessti on September 22, 2023, 11:55:23 PMLearn to read for once.   I explained if you keep your funds in 1 address you won't have the issue of paying higher fees later. You aren't changing the address at all.As I said even if you only have 1 address to receive funds you will still pay a higher fee if you have multiple unspent transactions from that 1 address.You can only reduce the fees if you consolidate all unspent transactions into one unspent transaction. You have to see how much the OP likes to make a fool of himself and to be obstinate about it. He has no idea how transactions work depending on inputs above all and he goes around giving lessons thinking he has discovered America.It is easier to understand by making an analogy with banknotes. You have a bitcoin address, which is analogously like a wallet containing banknotes.If you have a $100 note in your wallet and you pay $50, it doesn't matter whether you put the $50 change in the same wallet or in another wallet. You still have the same amount and only one input. If, on the other hand, you have $100 in your wallet but in two $50 notes and you have to pay $30, in this case you will take only one $50 note to pay and the change for $20 is also the same whether you put it in the same wallet or in another one, because when you want to spend the $70 you have left you will have two inputs.But I don't think he's even going to understand that and he's going to continue to make a fool of himself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "September 23, 2023, 03:00:08 AM",
      "body": "I see you got bored with your trolling over in the technical support sub-forum, and have decided to expand to the bitcoin discussion sub-forum for some new targets.This has been explained to you a multitude of times.  You're either intentionally ignoring what's been explained, or you're too stubborn to believe that you might be misunderstanding something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "September 23, 2023, 04:18:10 AM",
      "body": "I have never carried out a bitcoin transaction, but the explanations that have been answered by friends have made it easy for me to understand with the examples given.Maybe because I often get used to reading several guides about things I want to learn, such as transactions, nodes and other technical matters.Have you ever read the transactions section?https://learnmeabitcoin.com/beginners/transactions Suitable for you and me rather than insisting on ignorance by denying all the answers to answer the problems you are experiencing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 23, 2023, 04:54:10 AMLast edit: September 23, 2023, 08:14:42 AM by LoyceMobile",
      "body": "Newbies, OP is wrong. This has been discussed on the tech board, but he doesn't want to see how Bitcoin works. Or he's just trolling. Either way, there's no point discussing with him. Do your own research: address reuse doesn't lead to lower fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "September 23, 2023, 05:52:03 AM",
      "body": "Hey OP bitcoin is actually an open source innovation or better still all this HD wallets are, so how about ditching them since they don’t suit your taste and go on and develop a proper wallet that actually suit your need, wallets that don’t save up your change into another address. People that share same belief with you will move there  Hey newbies do not get carried away by OPs long post, using different addresses for different transactions is the best not only because of privacy but also security. Bitcoin is the latest innovation and as such scammers get to exploit it, example is the dust attacks. Using just one address will definitely lead it to been targeted for dusts attack and we all know how scammers can use this to their advantage. But when you have your bitcoin spread across other address even if the dust attack hits one address you can use coin control to send them out of your wallet without having to taint or contaminate the other bitcoins in other addresses. This and more are the advantages of multiple addresses for different transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}