{
  "id": "topic_5475380",
  "title": "jvanname",
  "author": "jvanname",
  "created_time": "November 24, 2023, 08:03:25 PM",
  "content": "There are ways to tell whether a new innovation is likely to arise in the near future or whether such an innovation is a scam. We can apply these tests to innovations such as nuclear fusion, reversible computation, superconducting computation, supersonic commercial travel, space travel, and artificial intelligence. In this post, I will mainly talk about the feasibility of reversible computation, but I will also talk about other innovations. I would consider reversible computation to be useful in real life as soon as one can make reversible computation that is as efficient as an irreversible competitor for a specific task that may seem arbitrary and contrived. Here are some questions that one should ask to determine whether an innovation is likely to arise in the near future or not.0. Are the goals modest and feasible?The goal of reversible computation is to make the computation more energy efficient. It is very reasonable to have energy efficiency as a goal because people want energy efficient cars, air conditioners, airplanes, computers, and even Bitcoin mining machines. For reversible computation, I am personally interested in the initial stages of commercially available hardware. And the goals for this initial stage are quite modest. All that we need to make reversible computation massively profitable is to construct a reversible adiabatic circuit with a somewhat crappy resonator for solving a specific problem (that could seem arbitrary and contrived) as efficiently as an irreversible competitor. After this point, it may take some time for reversible computation to completely take over all computation. There is not much room to improve the efficiency of irreversible computation by making smaller transistors.Getting energy from nuclear fusion is not so feasible because it requires conditions that are more severe than the center of the sun to get power from nuclear fusion (this is because the nuclei of atoms repel each other being positively charged).1. Have people tried and failed to make the innovation work? If so, then what is different this time? Did they make partial progress?People have made partial progress with reversible computation but they did not get it completely working yet; on the other hand, people have not spent too much money on reversible computation. Since the 1990's people have known how to create reversible adiabatic chips which can be up to thousands of times as energy efficient as irreversible chips except for one problem. The energy efficiency gains do not account for the the losses associated with the power supply and clock distribution, and this problem has not been solved yet. The difference between the 1990's and now is that in the 1990's there was absolutely no need for reversible computation since there were easier ways of improving performance and efficiency. Today the features on chips are not much bigger than atoms, so we cannot just make the features smaller any longer. Today there is a need for reversible computation. One should expect for there to be more innovation for reversible computation from now on because there is currently a need for reversible computation while this was not the case in the past.On the other hand, people have been working on nuclear fusion power for decades, and we are still many decades from getting any useful energy from nuclear fusion. And even after we get our first watt of useful power from nuclear fusion, we will still be very far away from using nuclear fusion to replace all other forms of energy.2. Does the innovation occur in nature?Nuclear fusion occurs naturally in the cores of stars. While nuclear fusion does occur naturally, it does not occur naturally on Earth. It only occurs naturally in environments such as cores of stars, and such environments are very difficult to replicate here on Earth. The reason for this is that the nuclei of atoms all contain protons, and protons repel each other with a great amount of force and it requires conditions like that of the center of the sun in order for fusion to work (and even in the sun fusion happens at a very low rate because it takes the sun about 10 billion years to burn through all of its fuel, so one actually needs conditions that are more severe than the center of the sun). Black holes also occur in nature, but we certainly cannot create black holes on Earth, so one needs to take into consideration where in nature the innovation occurs. Unlike nuclear fusion, there was once a naturally occurring nuclear fission reactor here on Earth that never had a meltdown. We do not see reversible computers per se in nature, but we see things that are similar. The laws of physics are time reversible, so one should expect for computational hardware to be compatible with the laws of physics. Irreversible computers do not try to operate in a manner that is most compatible with the laws of physics. The transcription of DNA into RNA is a reversible process that can occur with an efficiency beyond Landauer's limit. In fact, people have tried to make reversible computers using DNA. The natural occurrence of reversibility suggests that reversible computation is a feasible engineering challenge.3. What is the progress curve that will lead up to this innovation? The number of transistors on a chip has been more or less growing exponentially since the 1960's, so we can expect to see further growth in the number of transistors on a chip, and we can expect to see further progress in computation. If our current methods of manufacturing chips with photolithography apply to energy efficient reversible circuits, then we should expect for reversible computing to take over.The idea of getting power from nuclear fusion has been around since the mid 20th century (or earlier), and so far people have made very little progress. We should therefore expect for nuclear fusion energy research to progress too slowly for us to even bother with at the moment. At the moment, we have more pressing issues.4. Can the innovation be completed incrementally? Can the innovation be profitable soon?The innovation in reversible computation can be attained incrementally. A lot of the research in reversible computation has been done (prototype reversible chips have been made in the 1990's). And yes, reversible computation can be made profitable in the near future instead of in the distant future. In the near future, one can make reversible computation that can perform a particular task better than irreversible computation. And one can make such an arbitrary reversible task profitable even without subsidies (but only if we are smart enough). And after this point reversible computation will take over the computing sector incrementally.5. Read the scientific literature. Do I need to say more? I know that some of the papers and talks are technical, but you will get the best information from primary sources and the people actually making the technology work or evaluating its merits.6. Beware of hype. Quantum computation, nuclear fusion energy, and artificial intelligence have already been hyped enough, so they all get a point against them (AI already has enough points in its favor that it can afford to lose a point though). Reversible computation has been underappreciated, so reversible computation gets a point in its favor. The reason why hyped possible technologies get a point against them is that they already have had a lot of money thrown their way, so we should already expect progress in that direction. On the other hand, few people have heard and care about reversible computation. With little money thrown towards reversible computation, we should expect for much more progress to be made if a lot more money were thrown at reversible computation. One should therefore look at the technologies which have not been hyped so much. Undervalued technologies have more potential for near future innovation because overhyped technologies have already been explored.You might ask whether reversible computation has been unappreciated for a reason. But there is no reason for this. Reversible computation is the future of computation, so one should expect for all computation to be reversible in the future. Sure. Reversible computation incurs a computational complexity overhead. But this overhead is quite manageable and by using partial reversibility and by trading between time,space,parallelism, and reversibility, one can use reversibility to get the most out of computation. The lack of press behind reversible computation also has nothing to do with its feasibility as a technology. If it did, the we would still see hype behind reversible computation along with a little bit of press about the difficulty of reversible computation. Also, remember that the media typically hypes up things that are impossible or infeasible, so impossibility is not the reason for the lack of hype behind reversible computation.7. Cost of innovation: Developing energy efficient reversible computing technologies will probably be quite expensive, but not all aspects of this development need to be very expensive. For example, there are organizations which should have been working on reversible encryption functions and reversibility friendly cryptographic hash functions back in the 1990's, but they did not do this. When the AES was standardized around 2002, NIST or some organization should have standardized a reversible encryption function (the RES which stands for reversible encryption standard). This would have cost a little bit, but we would have all benefited as soon as the RES was standardized because the RES would be just as secure as the AES, but the entire cryptography community would have gained knowledge about how to create cryptographic algorithms under conditions such as reversibility. The NIST (or some other organization) still needs to standardize reversibility friendly cryptographic functions, and it baffles me why they would not take this step.Academic researchers could create new reversible computing algorithms. AI bots can learn to play generalized versions of Bennett's pebble game (on graphs with partial reversibility). The process of training these AI bots will not only help reversible computation, but it will also improve our understanding of AI and game-playing AI. Of course, this progress does not solve the main problem which is a hardware problem, but any progress is helpful. If we compare the amount of money spent on reversible computing research to the amount spent on nuclear fusion research, we see that reversible computing research is an incredible bargain. You will get a lot more for your money with reversible computing research. ITER (International Thermonuclear Energy Reactor) on the other hand will cost about 50 billion dollars. Oh. And the cost of reversible computing research will be self funded without the government needing to pour a vast amount of resources into reversible computing research (the only catch is that a critical mass of people need to be smart enough to fund this research).Bonus: Versatility: If there are many ways of realizing an innovation, then it is more likely that such an innovation will become a reality. Reversible computation can be realized using DNA, superconductors, adiabatic circuits, or even molecular mechanical devices and other constructions. Reversible computation is a way of computing rather than a specific technology. Since there are many possible ways of producing energy efficient reversible computers, one should consider reversible computation to be more feasible than other possible innovations that do not have such a broad scope.Penalty: Dangerous inventions. Just because one can accomplish something is not a reason that one should accomplish the task. Reversible computation and artificial intelligence may be exceedingly dangerous technologies, and we need to take the correct steps to prevent disaster. This is why for every dollar invested into reversible computation and non-safety related AI research, people should spend another dollar on AI safety. I already doing my part by developing alternatives to neural networks that exhibit notable interpretability and safety characteristics. For example, my fitness functions tend to have a single local maximum while still being powerful enough to perform some machine learning tasks. I am trying to extend the amount of tasks that these machine learning algorithms can perform. With that being said, AI is transparent in the sense that we already have all of the parameters of the AI systems available to study; we just need to design AI systems so that those parameters become interpretable.Nuclear fusion research is also dangerous. Nuclear fusion research is used to optimize nuclear weapons which are dangerous; weapons are the primarily application of nuclear fusion at the moment, so we can safely assume that such nuclear fusion research will be used to improve nuclear weapons. Instead of researching thermonuclear weapons, we should instead try more diplomacy to decrease the number of nuclear weapons so that the world is a safer place.-Joseph Van Name Ph.D. (Mathematics)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475380",
  "comments": [
    {
      "author": "franky1",
      "created_time": "November 26, 2023, 10:54:11 PM",
      "body": "you are like a commissioned saleman who has not done any sales training but just wants to promote an idea no one wants to buyyou keep repeating \"reversible computing\" without you even knowing what your talking about. you start to sound scammy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "December 16, 2023, 08:11:37 PM",
      "body": "franky1-You are an absolutely horrendous person. You are not here for an honest discussion. You are just here to be anti-innovative and anti-intellectual.-Joseph Van Name Ph.D.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uhwuchukwu53",
      "created_time": "January 30, 2024, 05:20:19 AM",
      "body": "Quote from: jvanname on November 24, 2023, 08:03:25 PMThere are ways to tell whether a new innovation is likely to arise in the near future or whether such an innovation is a scam. We can apply these tests to innovations such as nuclear fusion, reversible computation, superconducting computation, supersonic commercial travel, space travel, and artificial intelligence. In this post, I will mainly talk about the feasibility of reversible computation, but I will also talk about other innovations. I would consider reversible computation to be useful in real life as soon as one can make reversible computation that is as efficient as an irreversible competitor for a specific task that may seem arbitrary and contrived. Here are some questions that one should ask to determine whether an innovation is likely to arise in the near future or not.0. Are the goals modest and feasible?The goal of reversible computation is to make the computation more energy efficient. It is very reasonable to have energy efficiency as a goal because people want energy efficient cars, air conditioners, airplanes, computers, and even Bitcoin mining machines. For reversible computation, I am personally interested in the initial stages of commercially available hardware. And the goals for this initial stage are quite modest. All that we need to make reversible computation massively profitable is to construct a reversible adiabatic circuit with a somewhat crappy resonator for solving a specific problem (that could seem arbitrary and contrived) as efficiently as an irreversible competitor. After this point, it may take some time for reversible computation to completely take over all computation. There is not much room to improve the efficiency of irreversible computation by making smaller transistors.Getting energy from nuclear fusion is not so feasible because it requires conditions that are more severe than the center of the sun to get power from nuclear fusion (this is because the nuclei of atoms repel each other being positively charged).1. Have people tried and failed to make the innovation work? If so, then what is different this time? Did they make partial progress?People have made partial progress with reversible computation but they did not get it completely working yet; on the other hand, people have not spent too much money on reversible computation. Since the 1990's people have known how to create reversible adiabatic chips which can be up to thousands of times as energy efficient as irreversible chips except for one problem. The energy efficiency gains do not account for the the losses associated with the power supply and clock distribution, and this problem has not been solved yet. The difference between the 1990's and now is that in the 1990's there was absolutely no need for reversible computation since there were easier ways of improving performance and efficiency. Today the features on chips are not much bigger than atoms, so we cannot just make the features smaller any longer. Today there is a need for reversible computation. One should expect for there to be more innovation for reversible computation from now on because there is currently a need for reversible computation while this was not the case in the past.On the other hand, people have been working on nuclear fusion power for decades, and we are still many decades from getting any useful energy from nuclear fusion. And even after we get our first watt of useful power from nuclear fusion, we will still be very far away from using nuclear fusion to replace all other forms of energy.2. Does the innovation occur in nature?Nuclear fusion occurs naturally in the cores of stars. While nuclear fusion does occur naturally, it does not occur naturally on Earth. It only occurs naturally in environments such as cores of stars, and such environments are very difficult to replicate here on Earth. The reason for this is that the nuclei of atoms all contain protons, and protons repel each other with a great amount of force and it requires conditions like that of the center of the sun in order for fusion to work (and even in the sun fusion happens at a very low rate because it takes the sun about 10 billion years to burn through all of its fuel, so one actually needs conditions that are more severe than the center of the sun). Black holes also occur in nature, but we certainly cannot create black holes on Earth, so one needs to take into consideration where in nature the innovation occurs. Unlike nuclear fusion, there was once a naturally occurring nuclear fission reactor here on Earth that never had a meltdown. We do not see reversible computers per se in nature, but we see things that are similar. The laws of physics are time reversible, so one should expect for computational hardware to be compatible with the laws of physics. Irreversible computers do not try to operate in a manner that is most compatible with the laws of physics. The transcription of DNA into RNA is a reversible process that can occur with an efficiency beyond Landauer's limit. In fact, people have tried to make reversible computers using DNA. The natural occurrence of reversibility suggests that reversible computation is a feasible engineering challenge.3. What is the progress curve that will lead up to this innovation? The number of transistors on a chip has been more or less growing exponentially since the 1960's, so we can expect to see further growth in the number of transistors on a chip, and we can expect to see further progress in computation. If our current methods of manufacturing chips with photolithography apply to energy efficient reversible circuits, then we should expect for reversible computing to take over.The idea of getting power from nuclear fusion has been around since the mid 20th century (or earlier), and so far people have made very little progress. We should therefore expect for nuclear fusion energy research to progress too slowly for us to even bother with at the moment. At the moment, we have more pressing issues.4. Can the innovation be completed incrementally? Can the innovation be profitable soon?The innovation in reversible computation can be attained incrementally. A lot of the research in reversible computation has been done (prototype reversible chips have been made in the 1990's). And yes, reversible computation can be made profitable in the near future instead of in the distant future. In the near future, one can make reversible computation that can perform a particular task better than irreversible computation. And one can make such an arbitrary reversible task profitable even without subsidies (but only if we are smart enough). And after this point reversible computation will take over the computing sector incrementally.5. Read the scientific literature. Do I need to say more? I know that some of the papers and talks are technical, but you will get the best information from primary sources and the people actually making the technology work or evaluating its merits.6. Beware of hype. Quantum computation, nuclear fusion energy, and artificial intelligence have already been hyped enough, so they all get a point against them (AI already has enough points in its favor that it can afford to lose a point though). Reversible computation has been underappreciated, so reversible computation gets a point in its favor. The reason why hyped possible technologies get a point against them is that they already have had a lot of money thrown their way, so we should already expect progress in that direction. On the other hand, few people have heard and care about reversible computation. With little money thrown towards reversible computation, we should expect for much more progress to be made if a lot more money were thrown at reversible computation. One should therefore look at the technologies which have not been hyped so much. Undervalued technologies have more potential for near future innovation because overhyped technologies have already been explored.You might ask whether reversible computation has been unappreciated for a reason. But there is no reason for this. Reversible computation is the future of computation, so one should expect for all computation to be reversible in the future. Sure. Reversible computation incurs a computational complexity overhead. But this overhead is quite manageable and by using partial reversibility and by trading between time,space,parallelism, and reversibility, one can use reversibility to get the most out of computation. The lack of press behind reversible computation also has nothing to do with its feasibility as a technology. If it did, the we would still see hype behind reversible computation along with a little bit of press about the difficulty of reversible computation. Also, remember that the media typically hypes up things that are impossible or infeasible, so impossibility is not the reason for the lack of hype behind reversible computation.7. Cost of innovation: Developing energy efficient reversible computing technologies will probably be quite expensive, but not all aspects of this development need to be very expensive. For example, there are organizations which should have been working on reversible encryption functions and reversibility friendly cryptographic hash functions back in the 1990's, but they did not do this. When the AES was standardized around 2002, NIST or some organization should have standardized a reversible encryption function (the RES which stands for reversible encryption standard). This would have cost a little bit, but we would have all benefited as soon as the RES was standardized because the RES would be just as secure as the AES, but the entire cryptography community would have gained knowledge about how to create cryptographic algorithms under conditions such as reversibility. The NIST (or some other organization) still needs to standardize reversibility friendly cryptographic functions, and it baffles me why they would not take this step.Academic researchers could create new reversible computing algorithms. AI bots can learn to play generalized versions of Bennett's pebble game (on graphs with partial reversibility). The process of training these AI bots will not only help reversible computation, but it will also improve our understanding of AI and game-playing AI. Of course, this progress does not solve the main problem which is a hardware problem, but any progress is helpful. If we compare the amount of money spent on reversible computing research to the amount spent on nuclear fusion research, we see that reversible computing research is an incredible bargain. You will get a lot more for your money with reversible computing research. ITER (International Thermonuclear Energy Reactor) on the other hand will cost about 50 billion dollars. Oh. And the cost of reversible computing research will be self funded without the government needing to pour a vast amount of resources into reversible computing research (the only catch is that a critical mass of people need to be smart enough to fund this research).Bonus: Versatility: If there are many ways of realizing an innovation, then it is more likely that such an innovation will become a reality. Reversible computation can be realized using DNA, superconductors, adiabatic circuits, or even molecular mechanical devices and other constructions. Reversible computation is a way of computing rather than a specific technology. Since there are many possible ways of producing energy efficient reversible computers, one should consider reversible computation to be more feasible than other possible innovations that do not have such a broad scope.Penalty: Dangerous inventions. Just because one can accomplish something is not a reason that one should accomplish the task. Reversible computation and artificial intelligence may be exceedingly dangerous technologies, and we need to take the correct steps to prevent disaster. This is why for every dollar invested into reversible computation and non-safety related AI research, people should spend another dollar on AI safety. I already doing my part by developing alternatives to neural networks that exhibit notable interpretability and safety characteristics. For example, my fitness functions tend to have a single local maximum while still being powerful enough to perform some machine learning tasks. I am trying to extend the amount of tasks that these machine learning algorithms can perform. With that being said, AI is transparent in the sense that we already have all of the parameters of the AI systems available to study; we just need to design AI systems so that those parameters become interpretable.Nuclear fusion research is also dangerous. Nuclear fusion research is used to optimize nuclear weapons which are dangerous; weapons are the primarily application of nuclear fusion at the moment, so we can safely assume that such nuclear fusion research will be used to improve nuclear weapons. Instead of researching thermonuclear weapons, we should instead try more diplomacy to decrease the number of nuclear weapons so that the world is a safer place.-Joseph Van Name Ph.D. (Mathematics)Though your entitled to your research but every nation interest is to have innovation as regards to nuclear fusion and use it to improve their economy both in security and other area of their choice, come to think of it, many will not ear your because is like trying to take them back Stone age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}