{
  "id": "topic_5402956",
  "title": "davis196",
  "author": "davis196",
  "created_time": "June 17, 2022, 10:20:09 AM",
  "content": "I'm sorry if there's another forum post about this topic. I couldn't find anything about this news, so I'm posting it here.Elon Musk is about to get sued for alleged Dogecoin pyramid scheme. We all knew that his Dogecoin shilling will come back and bite him in the a$$. Is dogecoin a pyramid scheme? Is this a rhetorical question?  Any doge supporters here?https://www.reuters.com/legal/transactional/elon-musk-sued-258-billion-over-alleged-dogecoin-pyramid-scheme-2022-06-16/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402956",
  "comments": [
    {
      "author": "avikz",
      "created_time": "June 17, 2022, 01:15:10 PM",
      "body": "I am not an avid supporter of Elon but I am not hapoy about this news. Dogecoin is not a pyramid scheme, it's just a normal POS coin. Elon indeed created hype about dogecoin in the market using his influence over the social media and probably made couple of millions from this activity. But one thing we need to understand that Elon is one of the most prominent supporters of cryptocurrencies in general. While the confidence about cryptos are low, we need someone like him to raise his voice to support cryptos. Instead he is getting sued. That's unfortunate!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "June 17, 2022, 01:39:04 PM",
      "body": "Quote from: davis196 on June 17, 2022, 10:20:09 AMI'm sorry if there's another forum post about this topic. I couldn't find anything about this news, so I'm posting it here.Elon Musk is about to get sued for alleged Dogecoin pyramid scheme. We all knew that his Dogecoin shilling will come back and bite him in the a$$. Is dogecoin a pyramid scheme? Is this a rhetorical question?  Any doge supporters here?https://www.reuters.com/legal/transactional/elon-musk-sued-258-billion-over-alleged-dogecoin-pyramid-scheme-2022-06-16/The accuser just wants to make money QuoteJohnson is seeking $86 billion in damages, representing the decline in Dogecoin's market value since May 2021, and wants it tripled. if every investor who loses their investment investing in Cryptocurrency will demand and charge the developers we will have thousands of lawsuits every month, the accuser is in a dream world he doesn't know the reality of investing in Cryptocurrency, it is the investor's action that will make him lose and profit in the market, there's a lot of pump dump and manipulation in the market, you don't want to lose? get out in the market and put your money in a bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erick94",
      "created_time": "June 17, 2022, 01:51:53 PM",
      "body": "Quote from: avikz on June 17, 2022, 01:15:10 PMI am not an avid supporter of Elon but I am not hapoy about this news. Dogecoin is not a pyramid scheme, it's just a normal POS coin. Elon indeed created hype about dogecoin in the market using his influence over the social media and probably made couple of millions from this activity. But one thing we need to understand that Elon is one of the most prominent supporters of cryptocurrencies in general. While the confidence about cryptos are low, we need someone like him to raise his voice to support cryptos. Instead he is getting sued. That's unfortunate!In this case I think elon musk is not guilty at all because he only tweets on dogecoin which he thinks is worth investing in, I have never found his tweet that invites other people to invest in dogecoin, so far investors are too looking at the hype without caring about the risk after The hype ended, I think it's quite ridiculous that the person who sued Elon Musk because actually he knew the risks of investing in altcoins, especially Doge, but still he invested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypto-project",
      "created_time": "June 17, 2022, 02:38:49 PM",
      "body": "I'm still confused why would anyone want to sue Elon on the grounds that Dogecoin is a pyramid scheme? if you follow what Elon says and buy dogecoin hoping that in the future that token will go up and then you lose and blame Elon, then that's your stupidity, why do you believe what he said? To be honest, from the past until now I didn't buy crypto because of someone's opinion, I bought it because I really believe in the token, not because of what Elon said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "June 17, 2022, 02:58:21 PM",
      "body": "Quote from: crypto-project on June 17, 2022, 02:38:49 PMI'm still confused why would anyone want to sue Elon on the grounds that Dogecoin is a pyramid scheme? if you follow what Elon says and buy dogecoin hoping that in the future that token will go up and then you lose and blame Elon, then that's your stupidity, why do you believe what he said? To be honest, from the past until now I didn't buy crypto because of someone's opinion, I bought it because I really believe in the token, not because of what Elon said.Most likely Johnson is the doge holder and he has suffered a heavy loss. He didn't want to blame himself so he came up with a silly way to blame Elon. It is true that Elon has a good word for doge but he clearly does not force or guarantee doge holders will never lose. He's like all the shillers out there, putting his own interests first. If you entered investing through someone's word without doing any research, it's your fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 17, 2022, 03:00:22 PM",
      "body": "to me, if you don't know the risks of investing in altcoins, especially Doge, then it's definitely not a good idea to invest.I think it's ridiculous that this man is suing Elon Musk because he knew the risk but still invested!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 17, 2022, 03:02:30 PM",
      "body": "Thats bullshit and clearly a fud. Maybe its his first time to invest on memecoin. Cause is if his not, then clearly the guy just wanted to milk some money from Elon. First of all, crypto is a risk investment and no one forces him to put his money is. Elon is a shiller of dogecoin amd for him its just a part of volatile sequence of crypto. If this the case, then all rug and fall down projects must be sued.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 17, 2022, 03:23:56 PM",
      "body": "If someone is stupid enough to get influenced by the simple Twitter post from Elon Musk then they don't have any reason to accuse them. Is Elon actually involved in anything? He just used to create hype and make some money with no investment and he is successful with his strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 17, 2022, 04:07:45 PM",
      "body": "Suing Elon for something Dogecoin is not makes the entire lawsuit look silly if you ask me.  Maybe if they sued him for intentionally manipulating markets it would have made much more sense, but even then you still wonder if that could even be properly proven in court.And then you take a look at the damages they are trying to claim and that makes the lawsuit look even silly, maybe trollish.  But after all, all of this might only be an attempt to bring FUD to the masses.  File a lawsuit, advertise it and see a few here and there selling in total panic.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 17, 2022, 04:18:25 PM",
      "body": "Doge maybe a shitcoin but had legitimately established its position as a topcoin.I dont see Johnson winning against Elon. Although such amount of money is nothing to Elon, he wouldn't waste it. Elon is battling with people who are crazier than victims of ponzi scheme. The twitter board members are far powerful than Johnson.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yurez",
      "created_time": "June 17, 2022, 04:47:30 PM",
      "body": "Quote from: davis196 on June 17, 2022, 10:20:09 AMElon Musk is about to get sued for alleged Dogecoin pyramid scheme. We all knew that his Dogecoin shilling will come back and bite him in the a$$. I think it's all one big game and will end up dumping and pumping Dogecoin. There will be a lot of negativity in the press during litigation and weak hands will sell their coins at any price. In my opinion, after some time, Elon Musk will win this case and Dodgecoin will be pumped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Morningstarr",
      "created_time": "June 17, 2022, 05:29:19 PM",
      "body": "Quote from: yurez on June 17, 2022, 04:47:30 PMQuote from: davis196 on June 17, 2022, 10:20:09 AMElon Musk is about to get sued for an alleged Dogecoin pyramid scheme. We all knew that his Dogecoin shilling will come back and bite him in the a$$. I think it's all one big game and will end up dumping and pumping Dogecoin. There will be a lot of negativity in the press during litigation and weak hands will sell their coins at any price. In my opinion, after some time, Elon Musk will win this case and Dogecoin will be pumped.Wow great again pump and dump scheme rich become richer and people who believe Elonmusk and Doge lose their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virtualdn",
      "created_time": "June 17, 2022, 05:32:05 PM",
      "body": "Very good. Musk destroyed Dogecoin and turned it into his toy, made it a garbage coin. I'm happy that someone is actually doing something about it. Musk is only a manipulator and I wouldn't trust that snake about anything. Look what he is doing with Twitter. If he buys Twitter he will turn it into his playing ground promoting his toys and promising people \"free speech\"; give me a break. People already have free speech they don't need a platform for that. He will only get richer and more narcissistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "June 17, 2022, 05:44:21 PM",
      "body": "I know ELON.Back while he making a meme on his social media before knowing crypto, and now since he already crypto & doing a shout out name of cryptocurrency. First things weird from my perspective is why Doge.I realize because the picture, and he is memeing  ~XD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "June 17, 2022, 06:06:37 PM",
      "body": "If an influencer is promoting some project it does not mean he is forcing you to join it ultimately we have to make a decision but Elon following is quite high some people follow him blindly. He was also a big holder of Dogecoin but don't know whether he is still holding it or not so people also bought doge blindly and now the price is very low as compared to its ATH but we can not blame ELON for all this. He is a businessman and what is wrong in making money but he never forces anyone to buy Doge and hold it so we should not blame ELON. Doge is a very old and trusted coin in the crypto market and in the present market, most of the coins dropped like this Doge so we should wait for the bull run and hope Doge will also recover. I will not say Doge is a pyramid scheme it's not an MLM coin its a meme coin. One thing I must say in the year 2020 doge hype started and thus the lots of investors invest in the dogecoin but the sad part is many of the investors hold it instead of selling and booking the profit so most of the investors are stuck now who hold it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "June 17, 2022, 09:58:42 PM",
      "body": "This is the reason anyone should make their own financial decision, it just simply ridiculous blaming anyone else for our own mistake in choosing the right investment instrument, no one forced us to invest in all these meme coins, and investing in meme coins is really bad idea in general.Also, meme coin investing is like gambling, most of the ones that invested just gonna lost their money, the smaller fish getting eaten by the bigger fish, that's how memecoins mechanism in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 17, 2022, 11:09:12 PM",
      "body": "Quote from: aioc on June 17, 2022, 01:39:04 PMThe accuser just wants to make money Well, blame that on the flaws of the judiciary system. But regardless of the demand of the complainant, market manipulation is a crime and has serious penalty.QuoteWhen a criminal case is brought, proving the case may be more difficult. There are different federal laws that a defendant could be prosecuted under for alleged market manipulation. For example, 7 U.S. Code Section 13 makes it a felony punishable by a fine up to $1,000,000 and up to 10 years imprisonment to “manipulate or attempt to manipulate the price of any commodity in interstate commerce.” source: https://nyccriminallawyer.com/fraud-charge/securities-fraud/market-manipulation/Quote from: shinratensei_ on June 17, 2022, 09:58:42 PMThis is the reason anyone should make their own financial decision, it just simply ridiculous blaming anyone else for our own mistake in choosing the right investment instrument, no one forced us to invest in all these meme coins, and investing in meme coins is really bad idea in general.But the case is, that not all investors' failure is due to a lack of deep research but most of it is due to price manipulation.  Just like the case of Doge when Elon is actively hyping dogecoin and cashing out at the end.Quote from: aioc on June 17, 2022, 01:39:04 PMAlso, meme coin investing is like gambling, most of the ones that invested just gonna lost their money, the smaller fish getting eaten by the bigger fish, that's how memecoins mechanism in general.It is ok to have losses in a trade as long as there are no people behind that manipulate the price movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iyeman",
      "created_time": "June 17, 2022, 11:15:40 PM",
      "body": "This is really ridiculous, elon himself didn't force even a single soul to follow his investment. So basically suing him is actually isn't a thing.Moreover shitcoins has always been being called as gambling, I think anyone that invested in shitcoins know that, but alas only then after they are losing they realize that kind of warning before hand exists for reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MadeMen",
      "created_time": "June 18, 2022, 01:50:43 AM",
      "body": "I don't see them winning the case over Elon musk because there's no way we can prove that dogecoin is a pyramid scheme and the cryptocurrency industry is decentralized, giving everyone the liberty to make their decisions. Most of the people who invested heavily did that out of their own greed and Elon musk is not the owner of dogecoin, he played his game like every other influencer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}