{
  "id": "topic_5447771",
  "title": "Zilon",
  "author": "Zilon",
  "created_time": "April 06, 2023, 08:01:24 AMLast edit: April 06, 2023, 08:49:38 AM by Zilon",
  "content": "I made this topic sometime in December about how Paxful CEO warned users to be responsible for their coin. here they are today having internal Crisis that might lead to a shot down of their peer to peer market. Be responsible for your coin.Recently Paxful co-fonder  Artur Schaback sued Youssef the CEO of paxful and the company for been kicked out of the company more than a year ago which has resulted in closure of the exchange. This time there might be no panic for their customers as  customers have access to retrieve their funds now they have the opportunity. But what happens to those who don't get the information in time maybe when the exchange is completely closed and all activities seized sourceNo matter how the CEX tries to stand out from the rest the fact they have a access to people to peoples funds and they have a central deciding body they cannot be too far from the worst the crypto market have experienced. No exchange is too big to fold and close down. The evidence that self custody is the most reliable keeps proving itself.So far as of June 2022 not fewer than 525 exchanges has closed down their activities across different nations for various excuses according  and the most common been the pressure from the bear market according to CoinMarketCap and July alone in 2022 recorded 25 closed exchanges. It is really hitting heavily on exchanges, An effect of poor reserve.Outside the Crypto firm NFT platform Open resulted in cutting down 20% of their workforce due to the harsh market condition. It is hitting from all nook and corner of the digital asset.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447771",
  "comments": [
    {
      "author": "UchihaSarada",
      "created_time": "April 06, 2023, 08:11:07 AM",
      "body": "Lock your topic pleasePaxful is shutting downPaxful - Deposits are not being creditedPaxful have stopped their trading like LCB = GAMEOVER",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Grim_Fandango",
      "created_time": "April 06, 2023, 08:13:30 AM",
      "body": "Quote from: Zilon on April 06, 2023, 08:01:24 AMBut what happens to those who don't get the information in time maybe when the exchange is completely closed and all activities seized Paxful CEO said that he wont withdraw his bitcoin from Paxful until everyone withdraws theirs so hopefully that means he will give plenty of time to everyone to get their bitcoin out of therehttps://twitter.com/raypaxful/status/1643470467678756867?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5EtweetIf anyons bitcoin ends up being stuck there because they didnt check it for months, then its their own fault. People are not supposed to store bitcoin anywhere else other then their own wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "April 06, 2023, 12:40:59 PM",
      "body": "Quote from: UchihaSarada on April 06, 2023, 08:11:07 AMLock your topic pleasePaxful is shutting downPaxful - Deposits are not being creditedPaxful have stopped their trading like LCB = GAMEOVERBefore raising complain to lock a thread you should first compare the information each thread is passing across. Many topic about a particular subject matter might come up but what makes each one different is the content each of them carry. This is not the first time so many topics about a particular thing is raised and it won't obviously be the last.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}