{
  "id": "topic_5410970",
  "title": "Master of Shitcoins",
  "author": "Master of Shitcoins",
  "created_time": "August 23, 2022, 07:01:34 PM",
  "content": "In a new publication, Avalanche has announced a new technology where Blockchain can help to fund films. People can send Avalanche Coins to known regisseurs and when enough money is collected, a film will be created. Everyone, who sent Avalanche Coins for funding will get later a revenue from cinemas, television broadcasts or film sales. So, people can get back tons of money for successful films. It's like ICO but for films.  It could have a huge impact and bring speculation to film industries, where people can make money from funding films.  Here is Avalanche's announcement: https://medium.com/avalancheavax/wpf-launches-tokenized-film-finance-offerings-ffo-hosted-by-republic-tokens-to-be-built-and-b6042c278d1dFrom an speculation perspective, it's very promising because people will try to make money from funding films. And have Blockchain as underlying tech once more.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410970",
  "comments": [
    {
      "author": "tobi4255",
      "created_time": "August 26, 2022, 03:14:31 AM",
      "body": "That's really great. btw have you heard about ROSE Bloom Grants Program? It will help kickstart the development of projects in a range of key focus areas and support NFTs, P2E Gaming, DeFi, Metaverse, Data DAO, data tokenization and privacy dApps. Each proposal is eligible to receive up to $50,000 USD in USDT tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 26, 2022, 06:37:51 AM",
      "body": "We hereby have another offering name , Film Finance Offerings (FFO). FYI, this project is actually run by Republic (a private investing platform for investors), it's just that this project will run on top of the Avalanche network. I think this is very good news for the ecosystem in crypto as a whole, indicating that we will have more use cases likely to come.Talking about FFO, the first film they will release is \"I Am Not Satoshi\" a documentary exploring the disappearance of Bitcoin’s pseudonymous founder. This project led by director Chris Cannucciari, who five years ago created “Banking on Bitcoin,” the landmark film to date about the emergence of Bitcoin and cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}