{
  "id": "topic_5444001",
  "title": "Solosanz",
  "author": "Solosanz",
  "created_time": "March 08, 2023, 01:19:47 PM",
  "content": "Username: bitzizzixThis user was speak Russian when he was joined in this forum, but after few months he didn't speak Russian anymore and he only write using English language. Based on his posts, he was admit if he's live in Indonesia. Based BPIP there's no security log about email change or password change.I aware someone can speak for few languages, but it's suspicious how he's not speak Russian anymore and didn't mention if he's live in Russia. I think in order to know if the account was changed hands or not, he need to speak Russian with a trusted Russian's native in order to verify it.Quote from: bitzizzix on October 26, 2017, 02:31:55 AMgood idea .. if yes, i will also buy some electronics stuff that i want and musical instrument .. because i like to play music, are you ready to send it san i am very happy if it is true. you can send the goods to my country, I am in Indonesia Quote from: bitzizzix on April 01, 2017, 11:36:32 AMПpивeт. A epay пpoдoлжaют yдивлять, тo вывoд нa 5й дeнь cбpocят, oтпишyт чтo нaгpyзки нa биткoин ceть, тo тpaнзy oтпpaвят c кoмиccиeй 2000-3000 sat/бaйт, кoтopaя зacтpянeт нa вeчнo (ecть пapoчкa тaкиx), eщe мнe нpaвитcя чтo чepeз paз oни вce тaки пpeдлaгaют пoжepтвoвaть им нa кoмиccию, тoгдa вывoд лeтит co cкopocтью cвeтa, a плaтa зa этo oкoлo 3000 caтoш, нo фyнкция пoявляeтcя нe вccгдa. Ha cчeт пoддepжки, жди, я eщe дo paзвaлa фayceтбoкca, пeйтoши и тд, пытaлcя тaм кpaн зaпycтить, y мeня чтo-тo нe пoлyчaлocь, xoтя бaлaнc зaлит был, вce oк, oшибкa c иx cтopoны, тaк кaк нa пeйтoши кpaн cпoкoйнo paбoтaл, a y ниx былa oшибкa чeгo-тo тaм (нeпoмню, чecтнo), oтвeтили oни мнe чepeз 2 нeдeли, a нaпиcaли чтo нe мoгyт ничeм пoмoчь и вce) B oбщeм я тe чyть paccкaзaл, a дaльшe caм дyмaй, cтoит ли пoльзoвaтьcя этим epay-eм.Quote from: bitzizzix on April 01, 2017, 11:27:43 AMникoгдa нe вклaдывaл в xaйпы, нo oдним глaзкoм пpoбeгaюcь paз в мecяц пo фopyмaм, ищy чтo интepecнoгo ecть, тaк вoт и xaйпы ecть дocтoйныe, ecли в ниx вo вpeмя вoйти. Ho я c вaми coглaceн, ecли иcпoльзoвaть кpaн c цeлью \"зapaбoтaть нa пaчкy cигapeт\", тo пpoщe нa 999 зaйти и c бecплaтoк зa дeнь бoльшe нaбить, чeм c этиx кpaнoв. Я вoт, нaпpимep, дo cиx пop пoльзyюcь фpибиткoинoм, клeймбтc и двyмя eгo copoдичaми, xoть вecь зapaбoтoк кaпaeт oт peфoв, вce paвнo кoгдa cкyчнo cижy тикaю.Quote from: bitzizzix on April 01, 2017, 11:57:59 AMиз тoгo чтo я пpoбoвaл, \"нaxaлявить\" пpoщe вceгo в тaкoм пopядкe:1)Дaйcы, кaзинoxи c бoнycaми2)Peфы, нo нyжнo чтo-тo зaкинyть и тyт нa пoмoщь пpиxoдят кpaны.Ho этo вce мeлoчи, peбят. Peкoмeндyю иcкaть и пpoбoвaть тoлькo дaйcы и кaзинoxи (ecли peчь идeт o тoм чтoбы зapaбoтaть c нoля или нa cтapтoвый кaпитaл для чeгo-тo тaм), в oбщeм oни пpинocят в paзы бoльшe чeм любыe кpaны, нa пpoжитoчный минимyм мoжнo лeгкo зapaбoтaть (ecли бpaть в yчeт пpoж. мин. yкaзaнный гocyдapcтвoм)  (Archived)(Archived)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444001",
  "comments": [
    {
      "author": "YOSHIE",
      "created_time": "March 08, 2023, 02:49:36 PM",
      "body": "Quote from: Solosanz on March 08, 2023, 01:19:47 PMUsername: bitzizzixNot sure that the user changed hands to someone else, even if he is bilingual or four language detected, google translate, can perfect the languages ​​of all countries, although it looks weird and doesn't make sense.My assumption 'Not sure' changed hands and the comparison.1. The address used by @bitzizzix, which is in the profile and in the past or currently still in use and receiving Btc/token payments in the campaign.2. The account changed hands/sold the address exchanged/replaced with a new user's address.November 18, 2017, 05:47:06 PMQuote from: bitzizzix on November 18, 2017, 05:47:06 PMBTtalk username: bitzizzixRank: Full MemberBTC Address: 1AUr5FyZJvEL8eV97moDV16WnLQDTUX5XjFebruary 04, 2018, 02:43:26 AMQuote from: bitzizzix on February 04, 2018, 02:43:26 AM1. BTT Username: bitzizzix2. ETH Address: 0x6b389F92fBA982025f5960ca14130073361E3494From the data above, if I consider it does not change hands, even though there are strange things, but who knows, maybe there is other evidence that points to accusations, at first glance I see that it does not lead to elements of changing hands.or sold by a Russian user to Indonesia, when the account is still in the jr position, or a member, not valid proof, just an unfounded assumption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "March 08, 2023, 03:32:35 PMLast edit: March 08, 2023, 03:44:32 PM by Rikafip",
      "body": "Have you managed to figure out when exactly this alleged change of hands actually happened?From what I can see, he stopped writing in Russian basically 2 weeks after creation of account as I can't see posts written in Russian after April 1st, and then there is a slight change in August when he reached Full Member rank and started applying for signature campaigns and started being active in more boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "March 08, 2023, 03:57:51 PM",
      "body": "Somehow I'm not sure @bitzizzix is ​​a native Russian speaker.I assume @bitzizzix uses Google Transtale or something like that to post in Russian. I think some Russian user can verify his post as I believe if @bitzizzix was on GT then he wouldn't be able to write it properly.@bitzizzix should probably also be invited on this thread to clarify.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 08, 2023, 04:41:35 PM",
      "body": "Quote from: skarais on March 08, 2023, 03:57:51 PM@bitzizzix should probably also be invited on this thread to clarify.Oh my! So you people have right to ask anyone to response you when someone thinks x, y, z?OP, did he break any rules like, joining signature campaign with alt accounts or joined in a bounty campaign where manager said no alts are allowed or even joined in a forum event where it was said no alts are allowed. If not then lock the thread and stop insulting people out of nothing just because you think there is something.You yourself is an alt account frankly speaking and you never dared to tell which was your main account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "March 08, 2023, 05:19:31 PM",
      "body": "Quote from: BitcoinGirl.Club on March 08, 2023, 04:41:35 PMOh my! So you people have right to ask anyone to response you when someone thinks x, y, z?Sure.  That used to happen quite a lot a couple of years ago when account sales were rampant.  If you're not familiar with how damaging it can be when an account (especially if it's high-ranked and/or highly trusted) changes hands, then you haven't seen people fall for scams based on their assumption that they're dealing with the original owner of an account.  It's happened before and I have no doubt it'll happen again if it isn't right now somewhere on the forum.And in addition to that risk, there's also shitposters who buy accounts to make more money in campaigns or bounties, and they usually end up decreasing the quality of discussion rather than improving it.  Having said that, this guy doesn't have to come here and defend himself, but I don't fault OP for sniffing out something that might be off.  When members suddenly start posting in a language they've never written in before (especially after a break when no posts are made), that's a huge red flag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 08, 2023, 07:09:58 PM",
      "body": "Quote from: The Sceptical Chymist on March 08, 2023, 05:19:31 PMQuote from: BitcoinGirl.Club on March 08, 2023, 04:41:35 PMOh my! So you people have right to ask anyone to response you when someone thinks x, y, z?Sure.  That used to happen quite a lot a couple of years ago when account sales were rampant.  If you're not familiar with how damaging it can be when an account (especially if it's high-ranked and/or highly trusted) changes hands, then you haven't seen people fall for scams based on their assumption that they're dealing with the original owner of an account.  It's happened before and I have no doubt it'll happen again if it isn't right now somewhere on the forum.And in addition to that risk, there's also shitposters who buy accounts to make more money in campaigns or bounties, and they usually end up decreasing the quality of discussion rather than improving it.  Having said that, this guy doesn't have to come here and defend himself, but I don't fault OP for sniffing out something that might be off.  When members suddenly start posting in a language they've never written in before (especially after a break when no posts are made), that's a huge red flag.Earning from signature campaign and such things are not bad considering the forum ecosystem. I do not see anything bad there, sorry if you are I are not on the same page regarding the earnings. But I agree, there are red flags when an account is changed hand however it does not allow us to poke people on their buttocks and accuse them without any sorts of breaking forum rules eventually an insult. What if they are indeed not changed hand. When someone is disrespecting others without having a solid proof then it looks odd. This is a community where brotherhood comes before anything else [I am afraid these days it faded a lot].If a change hand forum account has risk to scam others then an alternative account which has no mention for their main account also have the same risk. If they scam then no trace left. The OP could be such an example. If the topic was posted by a user who is on the forum from ages, no need for merit, no need for asking to include them in DT, no intention to gain anything from it then I would not judge him but OP with such activity raise flags for me. May be he is building another account to gain from forum ecosystem but who knows if he will not pull a scam in the future. Until now there are nothing to lose for him. He can build up another account just like this if anything happen to the current account. Who knows he is someone who already defaulted a loan or scammed huge amount from someone else and left that account. Haven't we seen those theyoungmillionaire kind of users?You see it is easy to bust scams, policing others because it earns quick merit and reputation. A lot of the members these days made it a full time job, why would we only blame them? They saw it works, there are many examples in front of their eyes that worked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "March 08, 2023, 08:32:59 PM",
      "body": "If the account you suspect did change hand, then I don't think he would still have that old bitcoin wallet to use today.New Wallets: bc1qfr7klaf70avypgvh2q9v8lv4aa2802n9hcvcjuQuote from: bitzizzix on February 26, 2023, 01:25:29 PMBTC addy : bc1qfr7klaf70avypgvh2q9v8lv4aa2802n9hcvcjuOld Wallet: 1AUr5FyZJvEL8eV97moDV16WnLQDTUX5XjQuote from: bitzizzix on August 29, 2017, 01:49:10 PMBTC address : 1AUr5FyZJvEL8eV97moDV16WnLQDTUX5XjLast transaction: https://blockchair.com/bitcoin/transaction/9d7d4fdc0d28d24a8abeae5b0bd4c3d7758a3c3af0dd8a4ac248f699fe163728bitzizzix started its newbie activity on the local Russian board, but it only numbered 14 posts as noted here, while he doesn't have any single posts in the Indonesia board after I searched for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 08, 2023, 08:56:09 PM",
      "body": "Quote from: _BlackStar on March 08, 2023, 08:32:59 PMIf the account you suspect did change hand, then I don't think he would still have that old bitcoin wallet to use today.New Wallets: bc1qfr7klaf70avypgvh2q9v8lv4aa2802n9hcvcjuQuote from: bitzizzix on February 26, 2023, 01:25:29 PMBTC addy : bc1qfr7klaf70avypgvh2q9v8lv4aa2802n9hcvcjuOld Wallet: 1AUr5FyZJvEL8eV97moDV16WnLQDTUX5XjQuote from: bitzizzix on August 29, 2017, 01:49:10 PMBTC address : 1AUr5FyZJvEL8eV97moDV16WnLQDTUX5XjLast transaction: https://blockchair.com/bitcoin/transaction/9d7d4fdc0d28d24a8abeae5b0bd4c3d7758a3c3af0dd8a4ac248f699fe163728That's how I like my McDonald's too LOLNow what is OP going to do? Delete the topic and apologize to bitzizzix? While he can not remove the history but he can obviously write a Pm to bitzizzix and ask for forgiveness for disrespecting him openly on the community.People these days! Not a year or two in the forum and starts harassing others who are here grinding from ages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "March 08, 2023, 08:56:50 PM",
      "body": "Quote from: _BlackStar on March 08, 2023, 08:32:59 PMIf the account you suspect did change hand, then I don't think he would still have that old bitcoin wallet to use today.New Wallets: bc1qfr7klaf70avypgvh2q9v8lv4aa2802n9hcvcjuQuote from: bitzizzix on February 26, 2023, 01:25:29 PMBTC addy : bc1qfr7klaf70avypgvh2q9v8lv4aa2802n9hcvcjuOld Wallet: 1AUr5FyZJvEL8eV97moDV16WnLQDTUX5XjQuote from: bitzizzix on August 29, 2017, 01:49:10 PMBTC address : 1AUr5FyZJvEL8eV97moDV16WnLQDTUX5Xj29th August 2017 was way after the change in account activity which happened around 1st April 2017, so I wouldn't be suprised if the Bitcoin address posted after 1st April 2017 is still in control of the current owner.Quote from: _BlackStar on March 08, 2023, 08:32:59 PMbitzizzix started its newbie activity on the local Russian board, but it only numbered 14 posts as noted here, while he doesn't have any single posts in the Indonesia board after I searched for it.By 26th November 2017, the account has already attained Senior Member rankThere is a very high chance so many posts especially Russian board related posts were deleted before the archive third party sites were createdBut since there is no concrete evidence pinning bitzizzix, I think we should let this pass",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 08, 2023, 09:03:55 PM",
      "body": "Quote from: JeromeTash on March 08, 2023, 08:56:50 PM29th August 2017 was way after the change in account activity which happened around 1st April 2017, so I wouldn't be suprised if the Bitcoin address posted after 1st April 2017 is still in control of the current owner.Somebody give me more catch-up 🤣You have a point but as you said there are still no concert evidence even if there were, still we need to find other things like if they cheated to any campaign and things like that. In the year 2023, 6 years fast forward form anything that might happened, are we still tagging accounts just for changing hand?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "March 08, 2023, 09:13:53 PM",
      "body": "Quote from: BitcoinGirl.Club on March 08, 2023, 09:03:55 PMSomebody give me more catch-up 🤣You have a point but as you said there are still no concert evidence even if there were, still we need to find other things like if they cheated to any campaign and things like that. In the year 2023, 6 years fast forward form anything that might happened, are we still tagging accounts just for changing hand?So what exactly is the problem here?I was trying to show @_BlackStar that the address he may have quoted was posted after change of activity. Did I suggest anywhere that @bitzizzix should be tagged?Take a breather.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "March 09, 2023, 05:59:37 AM",
      "body": "Quote from: The Sceptical Chymist on March 08, 2023, 05:19:31 PMQuote from: BitcoinGirl.Club on March 08, 2023, 04:41:35 PMOh my! So you people have right to ask anyone to response you when someone thinks x, y, z?Sure.  That used to happen quite a lot a couple of years ago when account sales were rampant.  If you're not familiar with how damaging it can be when an account (especially if it's high-ranked and/or highly trusted) changes hands, then you haven't seen people fall for scams based on their assumption that they're dealing with the original owner of an account.  It's happened before and I have no doubt it'll happen again if it isn't right now somewhere on the forum.And in addition to that risk, there's also shitposters who buy accounts to make more money in campaigns or bounties, and they usually end up decreasing the quality of discussion rather than improving it.  Having said that, this guy doesn't have to come here and defend himself, but I don't fault OP for sniffing out something that might be off.  When members suddenly start posting in a language they've never written in before (especially after a break when no posts are made), that's a huge red flag.While everything you say is true, I still feel like people should bring more concrete evidence to the table before tossing shit on the wall and seeing if it sticks. What if the person or account hasn't changed hands? You can say no big deal but you have already cast doubt on that user and damaged their name in some eyes. If you have questions about someone, do some research on them. If your questions are answered and you have proof of someone ban evading or scamming, post it. Otherwise you IMO shouldn't stir the pot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 09, 2023, 06:31:18 AMLast edit: March 09, 2023, 06:58:10 AM by lovesmayfamilis",
      "body": "Quote from: skarais on March 08, 2023, 03:57:51 PMSomehow I'm not sure @bitzizzix is ​​a native Russian speaker.I assume @bitzizzix uses Google Transtale or something like that to post in Russian. I think some Russian user can verify his post as I believe if @bitzizzix was on GT then he wouldn't be able to write it properly.@bitzizzix should probably also be invited on this thread to clarify.As a Russian-speaking user, I can confirm that the first bitzizzix posts are from a person who can speak Russian, and all posts are written in a simple conversational style that Google Translate is unlikely to be able to translate.Therefore, I think that one language change is not enough in this case. I can say about myself that for some time, I also tried not to visit the Russian-language locale, but this does not mean that the account's owner has changed.Edit:Quote from: JeromeTash on March 08, 2023, 09:13:53 PMI was trying to show @_BlackStar that the address he may have quoted was posted after change of activity. Did I suggest anywhere that @bitzizzix should be tagged?Take a breather.I sent a PM to this account in Russian.I assume he can answer in his own language.But you may be right that the change could happen a little later, and statistics will be kept from there.If you check the addresses to which Bitzizzix sends transactions, all three owners of this account speak Indonesian.So probably the OP is right.https://ninjastic.space/addresses?address=1JUToCyRL5UwgeucjnFAagKs4v1YqhjT1d",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "March 09, 2023, 07:35:56 AM",
      "body": "Quote from: lovesmayfamilis on March 09, 2023, 06:31:18 AM-snip-If you check the addresses to which Bitzizzix sends transactions, all three owners of this account speak Indonesian.So probably the OP is right.That is the Indodax coldwallet address (Indonesian local exchange), he is still actively depositing into the exchange wallet from sigcamp earnings.However I do not conclusively support the OP's conjecture, as bitzizzix could I have a plausible reason. I suspect more that he is having financial responsibility to someone in Indonesia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 09, 2023, 02:41:46 PM",
      "body": "Quote from: JeromeTash on March 08, 2023, 09:13:53 PMSo what exactly is the problem here?I was trying to show @_BlackStar that the address he may have quoted was posted after change of activity. Did I suggest anywhere that @bitzizzix should be tagged?Take a breather.No problem here. I was not telling you are suggesting  a tag but it was OP without any doubt in mind. Did he specifically said it? No, but his motive is close to that.Quote from: lovesmayfamilis on March 09, 2023, 06:31:18 AMI sent a PM to this account in Russian.I assume he can answer in his own language.He should be, it's a pretty smart thing you did.But my questions remains, what is the point?Did the account evaded ban? Has he joined in a campaign with his main account, did it plagiarize? Have he broken any rule of the forum at all?Further more, if indeed the account is changed hand, it happened more than 5 years ago which means everything on the account is from the current owner. What changed?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 09, 2023, 02:52:38 PM",
      "body": "Quote from: BitcoinGirl.Club on March 09, 2023, 02:41:46 PMQuote from: lovesmayfamilis on March 09, 2023, 06:31:18 AMI sent a PM to this account in Russian.I assume he can answer in his own language.He should be, it's a pretty smart thing you did.But my questions remains, what is the point?Did the account evaded ban? Has he joined in a campaign with his main account, did it plagiarize? Have he broken any rule of the forum at all?Further more, if indeed the account is changed hand, it happened more than 5 years ago which means everything on the account is from the current owner. What changed? I didn't get a response, even though I saw the account online when I sent the PM. But this does not mean anything; I never said that this account violated something.There was a question: \"Bitzizzix: Changed hands or not? Answer: Yes, I changed it.Otherwise, if Bitzizzix wants to prove otherwise, he can answer me.Further, since the change was made a long time ago, there are no claims against the owner.The topic can be closed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "March 09, 2023, 03:09:37 PM",
      "body": "Quote from: lovesmayfamilis on March 09, 2023, 02:52:38 PMI didn't get a response, even though I saw the account online when I sent the PM. But this does not mean anything; I never said that this account violated something.There was a question: \"Bitzizzix: Changed hands or not? Answer: Yes, I changed it.Otherwise, if Bitzizzix wants to prove otherwise, he can answer me.Further, since the change was made a long time ago, there are no claims against the owner.The topic can be closed.Why a changed hands account didn't receive negative feedback? changed hands is changed hands, I've check many accounts were get negative feedback due to changed hands. Assuming it's true the account changed hands, then why the person didn't create his own account? there's should be a reason behind this. If changed hands isn't a matter and doesn't deserve to get negative feedback, I think the unofficial rule about account sales should be changed. So it will be helpful for many users including me for not discuss about changed hands anymore.Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 09, 2023, 03:19:49 PM",
      "body": "Quote from: Solosanz on March 09, 2023, 03:09:37 PMQuote from: lovesmayfamilis on March 09, 2023, 02:52:38 PMI didn't get a response, even though I saw the account online when I sent the PM. But this does not mean anything; I never said that this account violated something.There was a question: \"Bitzizzix: Changed hands or not? Answer: Yes, I changed it.Otherwise, if Bitzizzix wants to prove otherwise, he can answer me.Further, since the change was made a long time ago, there are no claims against the owner.The topic can be closed.Why a changed hands account didn't receive negative feedback? changed hands is changed hands, I've check many accounts were get negative feedback due to changed hands. Assuming it's true the account changed hands, then why the person didn't create his own account? there's should be a reason behind this. If changed hands isn't a matter and doesn't deserve to get negative feedback, I think the unofficial rule about account sales should be changed. So it will be helpful for many users including me for not discuss about changed hands anymore.Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.Do some better things instead of doing negative things. Since you like scanning members history, find the users who are changed hand and received negative tag long ago but even after long time they are still loyal to the system. Their positive contribution is helping the community. They deserves a chance. Since they did not scam anyone even with the hardship, they are likely not to do negative deed. Help them, create a positive campaign.The trends always changes. Just because an account changed hand (may be) 5 long years ago but for long 5 years contributing in the forum positively, they are better asset than you with an alt account. If they are at risk to someone to scam then what makes it different for you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "March 09, 2023, 06:00:59 PM",
      "body": "Quote from: Solosanz on March 09, 2023, 03:09:37 PMIf changed hands isn't a matter and doesn't deserve to get negative feedback, I think the unofficial rule about account sales should be changed. So it will be helpful for many users including me for not discuss about changed hands anymore.Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.And not all accounts that changed hands were actually sold; we have seen three or four cases in the past where loved ones took over their late father/relative's account to participate in forum discussions, and the majority of them end up being positive contributors to the forum. Shouldn't the forum be more concerned with only those accounts that violate the rules? ( Posting illegal links, cheating.....) The rules are unofficial- meaning it can be ignored, changed in some cases. Bitzizzix hasn't done anything wrong; he's just going about his business on the gambling section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}