{
  "id": "topic_5472143",
  "title": "nibbs33",
  "author": "nibbs33",
  "created_time": "October 30, 2023, 03:35:33 AM",
  "content": "Hi, I'm new to the crypto world so bare with me.I am trying to make a transfer from paybtc to cryptospend. Paybtc says the transaction has been sent. The transaction link they gave me sends me to mempool. I have been watching mempool now for about 24 hours and it is currently showing around 165 confirmations however it just doesn't seem to stop confirming. Will the confirmations eventually reach some magical number and allow the transfer to go through or do i have a problem?look forward to some help. I'm starting to freak out!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472143",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "October 30, 2023, 03:40:07 AMLast edit: October 30, 2023, 04:01:04 AM by albert0bsd",
      "body": "You can transfer the balance to another wallet since the first confirmation...The confirmations are never going to stop, every new block its a new conformation for your transaction.I recomend you to read the this book chapter: https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch02.asciidoc#mining-transactions-in-blocks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "October 30, 2023, 03:59:54 AM",
      "body": "I'm not familiar with neither exchanges you mentioned but assuming they're legit and you have delt with them before...Exchanges usually require a certain number of confirmation before crediting the funds to account, or allowing you to withdraw. It's never more than 6 confirmations. If you still can't see the funds in your account, you should check with exchanges support team, they are the only ones who can help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 30, 2023, 05:10:01 AM",
      "body": "Quote from: albert0bsd on October 30, 2023, 03:40:07 AMYou can transfer the balance to another wallet since the first confirmation...It is not entirely correct, most exchanges will actually reveal your transaction after first confirmation, but you can only transfer it out again with at least three confirmations. Although it is uncommon to have a chain reorg but just to be so sure experts regards 6 confirmations to be considered the safest number of confirmations to avoid such case and every transaction is spendable at this amount of confirmation, except a coinbase transaction that requires at least 100 confirmations In case of the OP, it is either the bitcoin is sent to a very different address or the exchange has a problem because at 165 confirmations the transaction is spendable. So I will advice OP to cross check the receiving address on the TXID with the address that is going to actually recieve it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "October 30, 2023, 07:23:48 AM",
      "body": "Quote from: nibbs33 on October 30, 2023, 03:35:33 AM-snip- The transaction link they gave me sends me to mempool.Can you cross-check the \"transaction id\" txid on other blockexplorers to see if the transaction is not exclusively in the link that they've gave you.The TXID is the 64 hex characters that's referencing your transaction.Some blockexplorers: https://blockstream.info/https://www.blockchain.com/explorer/apihttps://live.blockcypher.com/If it's in the three blockexplorers above, chances that it's an issue with cryptospend is very high unless the deposit address is incorrect.I did a quick Google search and saw that cryptospend has a quite low trust rating in Trustpilot while the other has good standing.Perhaps you're experiencing one of those issues in the negative reviews; in that case, only their support can help you since it's already sent to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 30, 2023, 09:22:56 AM",
      "body": "Quote from: nibbs33 on October 30, 2023, 03:35:33 AMI ve been watching mempool now for about 24 hours and it is currently showing around 165 confirmations however it just doesn't seem to stop confirming. Will the confirmations eventually reach some magical number and allow the transfer to go through or do i have a problem?look forward to some help. I'm starting to freak out!!Once you had your first confirmation, the transaction is done, as albert0bsd said.A confirmation means the transaction is included in a block, i. e., it is in the blockchain.  Every subsequent  block adds one more confirmation (making the transaction more secure).  One more confirmation will be added every 10 minutes or so.You can get in touch with cryptospend telling the transaction is already confirmed with hundreds of confirmations if the software is taking too long to update the status.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "October 30, 2023, 06:22:18 PM",
      "body": "Hey welcome to the Bitcointalk forum  Coming back to the topic, besides what mempool says which is a confirmed transaction by now( confirmations above 3 are a standard for most third party services that avoid double spending or a Reversal in simpler terms)...From cryptospends side, has this transaction being acknowledged as a receipt of the said Bitcoins on their side? If yes, then your coins are ready for use ànd no need to wait for more confirmations , good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 30, 2023, 06:26:57 PM",
      "body": "It seems they (Cryptospend) did not credit your account but according to the blockchain data, the transaction has already been confirmed. The problem is with Cryptospend and you need to talk to their support to resolve the issue.But be careful with Cryptospend though, they have a habit of locking up people's accounts with funds in them without issuing the reason. I have just seen this from the multiple reviews on Google Play store and Trustpilot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "October 30, 2023, 06:30:28 PM",
      "body": "Hi!After 4 confirmation your Bitcoin should be in your cryptospend card. If not then you should contact them. Most Bitcoin based platforms allows users to access their Bitcoin in one confirmation. Some take 3 or the max 4, confirmation means guarantee that the Bitcoin transaction cannot be cancelled. It is just another terminology in the Bitcoin ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 31, 2023, 01:35:21 AM",
      "body": "The op has not replied after the one post he made. I suggest we leave this alone and wait for him to let us know what has happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptospend-support-team",
      "created_time": "October 31, 2023, 04:50:11 AM",
      "body": "Hi there, Thank you for raising your concern. Please reply to our live chat or email support@cryptospend.com.au and we'll be able to assist you. Look forward to hearing your reply and resolving your issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 31, 2023, 06:43:43 AM",
      "body": "Quote from: cryptospend-support-team on October 31, 2023, 04:50:11 AMPlease reply to our live chat or email support@cryptospend.com.au and we'll be able to assist you. Look forward to hearing your reply and resolving your issue.Can you confirm you are who you say you are by posting your Bitcointalk username in cryptospend.com.au/bitcointalk.txt ? If you do, I'll leave neutral feedback confirming this. This will add to your credibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nibbs33",
      "created_time": "November 01, 2023, 03:23:36 AM",
      "body": "Thanks for the replies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptospend-support-team",
      "created_time": "November 01, 2023, 03:48:51 AM",
      "body": "Quote from: LoyceV on October 31, 2023, 06:43:43 AMQuote from: cryptospend-support-team on October 31, 2023, 04:50:11 AMPlease reply to our live chat or email support@cryptospend.com.au and we'll be able to assist you. Look forward to hearing your reply and resolving your issue.Can you confirm you are who you say you are by posting your Bitcointalk username in cryptospend.com.au/bitcointalk.txt ? If you do, I'll leave neutral feedback confirming this. This will add to your credibility.Hi there, As requested please find our verification here: https://verify.cryptospend.com.au/bitcointalk.txt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinlary",
      "created_time": "November 02, 2023, 02:25:11 PM",
      "body": "with my little knowledge, I'm new too but i believe what you are saying is  your transaction haven't been confirmed , so you were provided the link to view your transaction progress well i guess those transaction you are seeing are those with higher transaction fee maybe higher than yours and also,the node mine in accordance adding various pending transaction  so as to get them mined and added to the block chain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 02, 2023, 02:48:13 PM",
      "body": "Quote from: coinlary on November 02, 2023, 02:25:11 PMwith my little knowledge, I'm new too but i believe what you are saying is  your transaction haven't been confirmed ,Read OP again, he said Explorer is showing 165 confirmations which means the TX confirmed a long time ago and the number will increase forever so if that is what OP meant as not confirmed then he needs to understand the concept of confirmation.If the balance doesn't show up even after the confirmed TX then the exchange might have an issue and can be resolved if the support analyses what is wrong there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "November 02, 2023, 08:20:54 PM",
      "body": "Quote from: nibbs33 on October 30, 2023, 03:35:33 AMHi, I'm new to the crypto world so bare with me.I am trying to make a transfer from paybtc to cryptospend. Paybtc says the transaction has been sent. The transaction link they gave me sends me to mempool. I have been watching mempool now for about 24 hours and it is currently showing around 165 confirmations however it just doesn't seem to stop confirming. Will the confirmations eventually reach some magical number and allow the transfer to go through or do i have a problem?look forward to some help. I'm starting to freak out!!I don't really get OP  if it's showing 165 confirmation of what exactly , your transaction or other transaction  because I know mempool is used for tracking of pending transactions so can you clarify this OP",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 02, 2023, 09:12:35 PM",
      "body": "Quote from: promise444c5 on November 02, 2023, 08:20:54 PMI don't really get OP  if it's showing 165 confirmation of what exactly , your transaction or other transaction  because I know mempool is used for tracking of pending transactions so can you clarify this OP You are right. If a transaction is in mempool, it means that it hasn't been confirmed at all. Mempool is like a waiting room which nodes keep unconfirmed transactions there. But by mempool, OP probably meant mempool.space which is a block explorer and displays all confirmed and unconfirmed transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "November 03, 2023, 06:58:44 AM",
      "body": "Quote from: hosseinimr93 on November 02, 2023, 09:12:35 PMYou are right. If a transaction is in mempool, it means that it hasn't been confirmed at all. Mempool is like a waiting room which nodes keep unconfirmed transactions there. But by mempool, OP probably meant mempool.space which is a block explorer and displays all confirmed and unconfirmed transactions. Okay cleared now but why the 165 confirmation if it just get mined once  or does all nodes broadcast it after it has been successfully  mined??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 03, 2023, 07:18:48 AM",
      "body": "Quote from: promise444c5 on November 03, 2023, 06:58:44 AMOkay cleared now but why the 165 confirmation if it just get mined once  or does all nodes broadcast it after it has been successfully  mined??Once a transaction is included in the blockchain, it receives the first confirmation. Once the next block is mined, the transaction receives the second confirmation and so on. As time goes, any transaction that has been included in the blockchain receives more and more confirmations and it never stops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}