{
  "id": "topic_5407199",
  "title": "importedsteak",
  "author": "importedsteak",
  "created_time": "July 21, 2022, 11:37:49 PM",
  "content": "It seems as though we've reached the lower tail of one of the most bizarre yet profitable markets in human history - and of course it had to stem from crypto. NFTs took off almost a year ago today, and it's fascinating to recount the journey in hindsight.From around August 2021 to January 2022, we were seeing daily trading volumes regularly break $100m (in ETH), and now we haven't broken $20m for the past two or so months. It makes sense since the level of froth that plagued the NFT space after September was insane. Pictures of rocks selling for millions of dollars, it seemed like everyone had lost their mind. Celebrities scamming everyone, and every other project was nothing more than a cash grab. Somebody bought an NFT of Jack Dorsey's first tweet for for $2.9million and now can't get a bid higher than $280.Now, all the value has accrued with the so called 'blue-chip' NFT projects (Cryptopunks, Bored Apes, Proof/Moonbirds, Art Blocks, etc), but I can't help but wonder what this will all become in say 5 years? Because from where it stands now, 98% of the global population can't afford these top NFTs - and we're only a year in.... So much capital invested into jpegs and the reasoning has become unclear along the way. Why do we feel the need to create such elite circle groups that no one can access? The business model is just a monetary flywheel at this point",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407199",
  "comments": [
    {
      "author": "Apatu Ek Am",
      "created_time": "July 22, 2022, 03:45:06 AM",
      "body": "I don't want to sound too pessimistic about the future of non-fungible tokens (NFT). And, in full disclosure, I didn't think this market would take off as quickly as it did. The high profile NFT projects are just a small minority of the projects out there. I suspect this will change as the market matures: not only will more and more developers see the potential in crypto-gaming, but they'll also learn from the pitfalls others have made when designing them. The NFT space has a lot of 'crypto 2.0' thinking behind it and many of these projects are very much centralized and controlled by a single entity, it may still be some time before we'll see truly decentralized, fully autonomous games launch on top of blockchains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "July 22, 2022, 07:29:16 AM",
      "body": "A bull market is when we always see trends exaggerated to lead people into them. Somehow we can imagine that it has also been opportunistic from tricks. NFT has really brought me a happier atmosphere in the market lately. A lot of things have been created that I can't understand, but basically, once fomo follows it, it only cares about the profit earned. And only stop when the dangers appear to be greater.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "July 23, 2022, 11:38:45 AM",
      "body": "Since its inception NFT has been correlated with the greater fool theory. People craze up with these things without comprehending what it actually is or understanding any further utility of it. It has been maximized by some people who don't want to miss a profit opportunity, by wilding up the masses who just following what is trending. Those people include scammers, influencers, celebrities, and so on.Within the utility aspect, I do believe that this might get optimized for the kind of people who love collecting things. We know not everyone are love collecting trading cards, stamps, and even mugs. But I think to call NFT an elitist thing is far from its potential use case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "July 23, 2022, 06:37:02 PM",
      "body": "Quote from: importedsteak on July 21, 2022, 11:37:49 PMIt seems as though we've reached the lower tail of one of the most bizarre yet profitable markets in human history - and of course it had to stem from crypto. NFTs took off almost a year ago today, and it's fascinating to recount the journey in hindsight.Well crazy to hear that it is already a year now that the NFT hype started. To be honest i never really had direct contact with NFT's at first. If i remember correctly i got my first NFT through an airdrop because i held token of a project that gave out NFT's to its holders and after that i got many more of those \"free\" NFT's because back then everyone was doing NFT's all of sudden. For me this was the first indicator that the NFT hype has reached it's peak and that it will probably only go downwards from that point on. I still think that NFT's have a use case for certain projects and functions but every crypto projects out there throwing around NFT's is just to much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 23, 2022, 09:17:35 PM",
      "body": "I always think that NFT sales worth millions are just a fake trade, selling items and buying them for themselves.  I have seen this kind of strategy before.  People that are good at manipulating the psychology of people make them believe that worthless shit is worth more than an ordinary person's life savings.Fake trades and the overpriced markets will never sustain.  Just like what happened in the NFT trend for example.Quote from: Jackl87 on July 23, 2022, 06:37:02 PMQuote from: importedsteak on July 21, 2022, 11:37:49 PMIt seems as though we've reached the lower tail of one of the most bizarre yet profitable markets in human history - and of course it had to stem from crypto. NFTs took off almost a year ago today, and it's fascinating to recount the journey in hindsight.Well crazy to hear that it is already a year now that the NFT hype started. To be honest i never really had direct contact with NFT's at first. If i remember correctly i got my first NFT through an airdrop because i held token of a project that gave out NFT's to its holders and after that i got many more of those \"free\" NFT's because back then everyone was doing NFT's all of sudden. For me this was the first indicator that the NFT hype has reached it's peak and that it will probably only go downwards from that point on. I still think that NFT's have a use case for certain projects and functions but every crypto projects out there throwing around NFT's is just to much.NFT hype is indeed a year now but  NFT has been around since the ETH ERC721 cryptokitties project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 23, 2022, 10:25:01 PM",
      "body": "1. I'm not sure we've reached the market bottom. Less than a year has passed since the peak of the cryptocurrency market, recoveries usually take 1.5-2 years, so the lower limits may still be ahead.2. Just because these NFTs are worth so much doesn't mean there's a lot of money invested in them. NFTs often form a price that has simply occurred to its owner. Someone decided that their token is now very rare and popular, so they can ask 1,000 ETH for it. As you know, you can ask as much as you want, but that doesn't mean that someone will pay you that price. Pricing in this area is very subjective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 24, 2022, 04:39:27 AM",
      "body": "Quote from: serjent05 on July 23, 2022, 09:17:35 PMI always think that NFT sales worth millions are just a fake trade, selling items and buying them for themselves.  I have seen this kind of strategy before.  People that are good at manipulating the psychology of people make them believe that worthless shit is worth more than an ordinary person's life savings.Fake trades and the overpriced markets will never sustain.  Just like what happened in the NFT trend for example.This is actually whats happening. There are good nfts with considerable value but some are really hyped and overpriced. Mostly people can see this as manipulations but some are hooked as if the value is like real, in nft there is no such thing as guaranteed liquidity. Cause you cant sell it directly on the market, you need to wait for someone to purchase your nft before it got liquid and some only using their own money to buy and sell their own nft to boost the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 24, 2022, 03:48:55 PM",
      "body": "Quote from: importedsteak on July 21, 2022, 11:37:49 PMNow, all the value has accrued with the so called 'blue-chip' NFT projects (Cryptopunks, Bored Apes, Proof/Moonbirds, Art Blocks, etc), but I can't help but wonder what this will all become in say 5 years? Because from where it stands now, 98% of the global population can't afford these top NFTs - and we're only a year in.... So much capital invested into jpegs and the reasoning has become unclear along the way. Why do we feel the need to create such elite circle groups that no one can access? The business model is just a monetary flywheel at this pointOnly a year? Cryptopunks came in 2017. What it comes to trading volume, ton of people were suspecting that people were money laundering and obviously some were doing that.https://finbold.com/latvian-nft-artist-faces-12-years-in-jail-over-money-laundering-e8-7-million-art-earnings-frozen/I wouldn't put all of the volume to money laundering though, because that doesn't really explain why free mints like cryptopunks slowly rised to top. I understand if a nobody sells their 1:1 picture with millions, then it's quite obvious what's happening but putting most of the famous ones under money laundering umbrella is just paranoid thinking without understanding enough about the whole scene.If anyone is interested about how NFTs came to be, here's some backgroundhttps://www.one37pm.com/nft/the-definitive-timeline-of-early-nfts-on-ethereumhttps://medium.com/@Andrew.Steinwold/the-history-of-non-fungible-tokens-nfts-f362ca57ae10",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "July 24, 2022, 06:32:05 PM",
      "body": "Quote from: serjent05 on July 23, 2022, 09:17:35 PMI always think that NFT sales worth millions are just a fake trade, selling items and buying them for themselves.  I have seen this kind of strategy before.  People that are good at manipulating the psychology of people make them believe that worthless shit is worth more than an ordinary person's life savings.Fake trades and the overpriced markets will never sustain.  Just like what happened in the NFT trend for example.Another strong possibility is that the people behind those millionaire sales were laundering money, if you were a hacker NFTs are the perfect way to launder your ill gotten gains, you only needed to create a NFT, sell it to yourself for a lot of money and then cash out at your favorite exchange, if they asked you how you got that much money you can call yourself an artist and be done with it, if you could do this enough times you could even get other people to buy your art, as it is seemingly on demand and earn money that way too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 24, 2022, 11:39:44 PM",
      "body": "Quote from: o48o on July 24, 2022, 03:48:55 PMOnly a year? Cryptopunks came in 2017. What it comes to trading volume, ton of people were suspecting that people were money laundering and obviously some were doing that.https://finbold.com/latvian-nft-artist-faces-12-years-in-jail-over-money-laundering-e8-7-million-art-earnings-frozen/I wouldn't put all of the volume to money laundering though, because that doesn't really explain why free mints like cryptopunks slowly rised to top. I understand if a nobody sells their 1:1 picture with millions, then it's quite obvious what's happening but putting most of the famous ones under money laundering umbrella is just paranoid thinking without understanding enough about the whole scene.If anyone is interested about how NFTs came to be, here's some backgroundhttps://www.one37pm.com/nft/the-definitive-timeline-of-early-nfts-on-ethereumhttps://medium.com/@Andrew.Steinwold/the-history-of-non-fungible-tokens-nfts-f362ca57ae10That was a great article of NFT history. Sadly most of people does not know that NFT existed as early as 2013 (I just known it just now too).  I am probably one of those paranoid so I think that NFTs selling in millions of dollar are very suspicious, if not self trade to boost the hype of NFT's, money laundering might be in the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 26, 2022, 09:19:52 AM",
      "body": "Quote from: serjent05 on July 24, 2022, 11:39:44 PMThat was a great article of NFT history. Sadly most of people does not know that NFT existed as early as 2013 (I just known it just now too).  I am probably one of those paranoid so I think that NFTs selling in millions of dollar are very suspicious, if not self trade to boost the hype of NFT's, money laundering might be in the process.Colored coins existed mainly in theory at the time and weren't widely known by the public. At the time everyone (non-coder) was focused on other drama that happens every day in this scene. Erc-721 protocol made nft known and popular. I guess cryptopunks weren't cute enough for media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "July 26, 2022, 03:10:02 PM",
      "body": "discussing the matter of NFT, i remember that in 2017 there were only 5 NFT from airdrops.at first i didn't know if i had NFT in my wallet. in september 2021 someone told me if there was an NFT in my wallet and after i checked it turned out that there were really 5 NFT. after that i sold all the NFT on opensea and got $60,000.at that time i was really thinking this was just a picture but why did it have such an expensive price tag. i thought that because i'm not very involved in NFT companies so i kept asking myself.after a few months later i tried to see the price of the NFT and i was surprised because the price fell to 80%. is this the NFT hype means?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "July 26, 2022, 07:42:08 PM",
      "body": "In 5 years? It's either this craze is still alive or dead, simple as that. The key word here is that it is a craze or hype.And we all know that in crypto, those die and replace by a new one, since the ICO-IEO years, so that will be my conclusion. So as far as those blue chip collection? it will have no value, so maybe those who buy it will regret paying them at huge amount to the tune of millions of dollars because it's worthless collections.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 26, 2022, 09:40:46 PM",
      "body": "Well, those premium NFTs have been made like an exclusive club and it's not really for everyone but only for those that can afford it. We don't know if they're still a thing after 5 years because everything that becomes a craze in the crypto market is just passing by. Yes, there's ownership of those jpegs, digital arts, and whatsoever but that's a thing that we don't know if it will be passed eventually. Just take a look at those ICOs, IEOs, and others? Well, NFTs might be part of that history in the next years, we don't know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "July 26, 2022, 09:45:28 PM",
      "body": "Quote from: o48o on July 26, 2022, 09:19:52 AMColored coins existed mainly in theory at the time and weren't widely known by the public. At the time everyone (non-coder) was focused on other drama that happens every day in this scene. Erc-721 protocol made nft known and popular. I guess cryptopunks weren't cute enough for media.It's never about not being publicly known enough or not, it is about if it is worth to take it to the market to a high value. For example, cryptokitties was a crypto collectible which is basically the same idea as an NFT and at that time they were very popular when they first get out.This means that NFT world could have ballooned up during that time as well but it didn't, we didn't had tens of millions of dollars exchanging everyday based on a few images. Why wasn't it then, but then it happened last year? The main reason is that we perfected it, the blockchain behind the NFT we saw with cryptopunks or apes or whatever became much better than what kitties had and that is why it became more popular, nothing more to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "July 27, 2022, 04:23:12 AM",
      "body": "Quote from: blockman on July 26, 2022, 09:40:46 PMWell, those premium NFTs have been made like an exclusive club and it's not really for everyone but only for those that can afford it. We don't know if they're still a thing after 5 years because everything that becomes a craze in the crypto market is just passing by. Yes, there's ownership of those jpegs, digital arts, and whatsoever but that's a thing that we don't know if it will be passed eventually. Just take a look at those ICOs, IEOs, and others? Well, NFTs might be part of that history in the next years, we don't know.Yeah, perhaps the premium NFTs are for exclusive clubs only, those investors that have a lot of money in their pocket and willing to shell out millions for that kind of art work.On the other hard, for us, ordinary investors, then it's not for us, and maybe we look for ways to make money out of the NFT craze. But as far as the what happen to ICO's, IEO, launchpad, P2E and other hypes, they eventually passed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "July 27, 2022, 10:00:01 AM",
      "body": "Quote from: Yaunfitda on July 26, 2022, 07:42:08 PMIn 5 years? It's either this craze is still alive or dead, simple as that. The key word here is that it is a craze or hype.And we all know that in crypto, those die and replace by a new one, since the ICO-IEO years, so that will be my conclusion. So as far as those blue chip collection? it will have no value, so maybe those who buy it will regret paying them at huge amount to the tune of millions of dollars because it's worthless collections.A few years down the line people are going to be asking themselves what were they thinking when they invested in those useless nfts and they let themselves to become completely immersed in such a mindless hype.In a way this is no different than what we saw during the previous bull market when people invested fortunes by believing on the promises of developers which at the end did not wrote a single line of code and still got millions of dollars in return for their efforts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 27, 2022, 08:38:56 PM",
      "body": "Quote from: Kemarit on July 27, 2022, 04:23:12 AMQuote from: blockman on July 26, 2022, 09:40:46 PMWell, those premium NFTs have been made like an exclusive club and it's not really for everyone but only for those that can afford it. We don't know if they're still a thing after 5 years because everything that becomes a craze in the crypto market is just passing by. Yes, there's ownership of those jpegs, digital arts, and whatsoever but that's a thing that we don't know if it will be passed eventually. Just take a look at those ICOs, IEOs, and others? Well, NFTs might be part of that history in the next years, we don't know.Yeah, perhaps the premium NFTs are for exclusive clubs only, those investors that have a lot of money in their pocket and willing to shell out millions for that kind of art work.On the other hard, for us, ordinary investors, then it's not for us, and maybe we look for ways to make money out of the NFT craze. But as far as the what happen to ICO's, IEO, launchpad, P2E and other hypes, they eventually passed.It's really for that purpose and that's why they get exclusive updates, benefits, and other things that are just made for them. The hype is there and there's that feeling that you need to belong. But speaking wisely for it, if you don't have that much for it, there's no need for you to buy those expensive NFTs, I'd rather have bitcoin and Ethereum on my stash than those NFTs that I can't avail. But, I also have nothing against those that can afford it, since they can afford it, they'll just have to enjoy owning it and they're also investors hoping to get a decent return on it upon sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 28, 2022, 07:52:52 AM",
      "body": "Quote from: justdimin on July 26, 2022, 09:45:28 PMIt's never about not being publicly known enough or not, it is about if it is worth to take it to the market to a high value. For example, cryptokitties was a crypto collectible which is basically the same idea as an NFT and at that time they were very popular when they first get out.This means that NFT world could have ballooned up during that time as well but it didn't, we didn't had tens of millions of dollars exchanging everyday based on a few images. Why wasn't it then, but then it happened last year? The main reason is that we perfected it, the blockchain behind the NFT we saw with cryptopunks or apes or whatever became much better than what kitties had and that is why it became more popular, nothing more to it.I don't understand what you mean by \"basically same\". Cryptokitties were the very definition of current NFTs as they were Erc-721. Bored apes Yacht Club are ERC-721 as well so they are literally same tech. It just took some time to get NFTs sunk in, and right people to hoard cryptopunks and right conditions to launch Apes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}