{
  "id": "topic_5441464",
  "title": "TA_Experten",
  "author": "TA_Experten",
  "created_time": "February 27, 2023, 08:38:13 PM",
  "content": "Hey wir sind 2 Studenten der Uni München und Uni Leipzig und haben einen Telegramm-Kanal erstellt mit den wichtigsten und relevantesten Informationen um Krypto und Aktien. Wir möchten uns gerne von den ganzen Spam und Bots abgrenzen, deswegen ist uns eure Meinung wichtig. Vielleicht könnt ihr ja mal einen Blick in den Kanal werfen und sagen ob ihr den Content gut oder schlecht findet  Bisher hatten wir sehr viel positives Feedback, vielleicht findet der ein oder andere auch Interesse an unserem Content. https://t.me/TA_Experten Danke für eure Hilfe im Voraus und Beste Grüße!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441464",
  "comments": [
    {
      "author": "1miau",
      "created_time": "February 27, 2023, 11:36:26 PM",
      "body": "Hey! Bin einmal beigetreten und habe mir ein paar Sachen durchgelesen, wie die gepinnte Nachricht. Eure Zielgruppe scheinen ja eher erfahrene Leute zu sein, egal ob es jetzt um Aktien oder Krypto geht und jetzt eher keine Einsteiger, denen es z.B. wichtig wäre, die Grundlagen zu kennen (Was sind Kryptowährungen generell, Wallet einrichten oder Scams erkennen / Anfängerfehler vermeiden). Vielleicht könnt ihr das bereits in der gepinnten Nachricht erwähnen, dass eure Gruppe sich mehr an Fortgeschrittene Nutzer richtet. Dann wäre auch noch spannend, wie sehr ihr euch auf die Coins spezialisiert (Fundamentalanalyse der Coins) oder ob es eher allgemeine Marktschwankungen sind, die ihr analysiert. Ansonsten wäre eine Frage, die ich hätte, wenn ich in die Gruppe komme: Wie viel spezialisiert ihr euch auf Aktien, wie viel auf Krypto (anteilsmäßig)?Das wäre alles in der gepinnten Nachricht sinnvoll. Wenn ihr euch mit technischer Analyse (TA) / Chartanalyse beschäftigt, wäre es in der gepinnten Nachricht auch sinnvoll, auf die Risiken und Gefahren von technischer Analyse (TA) / Chartanalyse hinzuweisen, denn bekanntlich gibt es nirgendwo risikolose Gewinne und niemand kann den Markt vorhersagen. https://xkcd.com/2101/Vielleicht könnt ihr hier auch gerade in Bezug auf Bitcoin erwähnen, dass HODLn der nervenschonendere und sicherere Ansatz ist, während technischer Analyse (TA) / Chartanalyse riskanter ist, dabei aber mehr auf- und Abwärtspotential in beide Richtungen bietet. Sonst bekommen die Leute eine böse Überraschung.  Passed dazu habe ich sogar vor ein paar Wochen einen guten Artikel geschrieben: Trade vs. HODL - Fallen vermeiden (ist aber auf angelsächsisch). Was ich dann auch noch sehr wichtig fände, zu erwähnen, dass Bitcoin gerade durch seine Begrenztheit von 21 Millionen Einheiten ein guter, und auch in Zukunft vielversprechender Wertspeicher ist (daher kommt das HODLn). Darüber hinaus gibt es noch mehr Eigenschaften, die für einen steigenden Bitcoinpreis sprechen aber das würde hier das Thema sprengen. Dann wäre auch der Unterschied Bitcoin zu Altcoins interessant zu erläutern.  Viele Altcoins haben nämlich keine Limitierung der Anzahl aller jemals in Umlauf kommenden Münzen und diese anderen Kryptowährungen sind daher inflationär, was sie nicht zu einem Wertspeicher macht und damit gleichzeitig sehr unattraktiv zu kaufen, wie z.B. Polkaschrott. Aber das kommt natürlich darauf an, wie tief ihr in die jeweilige Blockchaintechnik gehen wollt. Ihr könnt auch Kurse von Altcoins gegenüber Bitcoin vergleichen, wie z.B. hier in unserem Bitcoin vs. Alts. Das ist sogar schon das 4. Bitcoin vs. Alts.  Ansonsten sieht das schon sehr informativ aus bei euch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "March 02, 2023, 03:43:00 PM",
      "body": "Herzlich willkommen TA_Experten,hättet ihr den Thead lieber in \"Trading und Spekulation\" oder in \"Projektentwicklung\"?Hier ist er nicht unbedingt gut aufgehoben und daher die Frage was euch lieber ist",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}