{
  "id": "topic_5403818",
  "title": "matt007",
  "author": "matt007",
  "created_time": "June 23, 2022, 09:37:48 PM",
  "content": "Hi! I'M doing some tests with Salmen's Simple faucet and i got  technical problems with Google's re-captcha..Even when the test is passed at 100%,  i get this message : 'Captcha is wrong. Try again'...I have alredy made my homeworks and have tried almost every possible troubleshooting solutions already.... Maybe to update the re-captcha librairies in the script would be a solution....Anyway, i was wondering if someone did had the same re-captcha problem with Salmen's simple script (Jaguarbitcoin) ? ....And if yes, what was your solution to make it work ?Thanks alot guys! I appreciate your input Matt",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403818",
  "comments": [
    {
      "author": "edgycorner",
      "created_time": "June 23, 2022, 10:21:27 PM",
      "body": "I am not familiar with the script but I will try.1.)Make sure that your secret key and sit key are correct.2.)Check \"console\" for any related error.3.)Debug response data(g-recaptcha-response), it usually does return an error-code when there's any",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 24, 2022, 01:10:53 AM",
      "body": "I do encounter this when I am using a VPN and set it to France, it can happen like that with some other countries. If a captcha is giving you a problem, use a VPN and choose a different location, it will work successfully, you change the location to USA or any other country and see if it will work.But I am curious that some people are still wasting their time on faucets, are you making money from the faucet? Faucets are just absolutely waste of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 24, 2022, 11:04:42 AM",
      "body": "Quote from: _act_ on June 24, 2022, 01:10:53 AMBut I am curious that some people are still wasting their time on faucets, are you making money from the faucet? Faucets are just absolutely waste of time.Sometimes it's not just about making BTC by having people view ads. It's about getting eyeballs / clicks on a certain thing and using a few satoshis to do it.With that being said keep in mind from the scriptQuotePHP >= 5.4 (tested on 5.6), please do not use PHP 7.0 or higherAnything older then 7.4 is way out of date and vulnerable. I don't even know of any webhosts that still support it.Take a look at: https://www.php.net/supported-versions.phpI don't know if anyone has updated / ported the script so it runs on a newer version of PHP but if not I don't know if it will work.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 25, 2022, 10:16:17 AM",
      "body": "Quote from: ETFbitcoin on June 24, 2022, 12:01:12 PMGoogle reCAPTCHA do far more than checking location and IP. If you want to pass it easily, use google chrome and login to your google account.I don't use Chrome and I don't log in to any Google account, but I can solve a few dozen reCaptcha a day, they don't cause me any problems yet - although I've been completely blocked several times in the past because Google put me on a blacklist assuming that I am a bot. What I have noticed is that the reCaptcha difficulty levels on different pages are different, so on some pages (faucets) it is solved very easily, while on others it takes a few tries and has those irritating images that are repeated several times.matt007, if you have the opportunity try hCaptcha, it is on most faucets today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "matt007",
      "created_time": "June 28, 2022, 09:25:47 AM",
      "body": "Quote from: DaveF on June 24, 2022, 11:04:42 AMQuote from: _act_ on June 24, 2022, 01:10:53 AMBut I am curious that some people are still wasting their time on faucets, are you making money from the faucet? Faucets are just absolutely waste of time.Sometimes it's not just about making BTC by having people view ads. It's about getting eyeballs / clicks on a certain thing and using a few satoshis to do it.With that being said keep in mind from the scriptQuotePHP >= 5.4 (tested on 5.6), please do not use PHP 7.0 or higherAnything older then 7.4 is way out of date and vulnerable. I don't even know of any webhosts that still support it.Take a look at: https://www.php.net/supported-versions.phpI don't know if anyone has updated / ported the script so it runs on a newer version of PHP but if not I don't know if it will work.-DaveActually it has been updated here https://github.com/Salmen2/Simple-Faucet-ScriptThanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}