{
  "id": "topic_5461718",
  "title": "Jimmy Wales",
  "author": "Jimmy Wales",
  "created_time": "August 01, 2023, 06:50:12 PM",
  "content": "Tracking the movement of SEC token on PulseChain using GeckoTerminal by CoinGecko. Token is not listed on CoinGecko yet. Can anyone please tell me how to determine the total supply of this token?https://www.geckoterminal.com/pulsechain/pools/0x6da4f7c69fb5c30188a5215a8db1e1f0fbdf84c7",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461718",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "August 01, 2023, 07:01:33 PM",
      "body": "Using the link you provided, scroll down to the bottom of the page, and you will see where they listed out different pools: WPLS and SEC. On the SEC, you will see an address that is provided there, which is the token contract address. You can copy the address and scan it in whatever chain the token is under. For the SEC, it is under pulsechain. Link below. https://scan.pulsechain.com/token/0xab4242c0420d175e39bD0CC049263B920E4bCE17/token-transfersThe total supply is 420,000,000 SEC.Note: The token has very little liquidity and was just created about 18 hours ago; I don't really see it as a good choice of investment. Do your own research before you make any form of purchase on that token in order not to get your money stockpiled somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jimmy Wales",
      "created_time": "August 01, 2023, 07:22:27 PM",
      "body": "Quote from: Nwada001 on August 01, 2023, 07:01:33 PMUsing the link you provided, scroll down to the bottom of the page, and you will see where they listed out different pools: WPLS and SEC. On the SEC, you will see an address that is provided there, which is the token contract address. You can copy the address and scan it in whatever chain the token is under. For the SEC, it is under pulsechain. Link below. https://scan.pulsechain.com/token/0xab4242c0420d175e39bD0CC049263B920E4bCE17/token-transfersThe total supply is 420,000,000 SEC.Thank you. So 100% of it was available to pool at start!Quote from: Nwada001 on August 01, 2023, 07:01:33 PMNote: The token has very little liquidity and was just created about 18 hours ago; I don't really see it as a good choice of investment. Do your own research before you make any form of purchase on that token in order not to get your money stockpiled somewhere.Thanks for the warning. Just thought, as SEC is suing PulseChain & all, SEC token on PulseChain can turn out to be a good meme buy for PLS HODLers. As per GeckoTerminal, current price is $0.0000004766. Will track further in coming days...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "August 01, 2023, 09:08:49 PM",
      "body": "Quote from: Jimmy Wales on August 01, 2023, 06:50:12 PMTracking the movement of SEC token on PulseChain using GeckoTerminal by CoinGecko. Token is not listed on CoinGecko yet. Can anyone please tell me how to determine the total supply of this token?This is another shitty coin created by scammers for their own enrichment, to the creation of which the SEC has nothing to do. After the price of the coin increased several times, the developers withdrew liquidity and those who bought it earlier can no longer sell.P.S. How do you find this shit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jimmy Wales",
      "created_time": "August 01, 2023, 09:22:14 PM",
      "body": "Quote from: tvplus006 on August 01, 2023, 09:08:49 PMP.S. How do you find this shit?Very same way I found PEPE, BOBO & JIM early, i.e. by sorting GeckoTerminal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AOL",
      "created_time": "August 06, 2023, 06:59:40 PM",
      "body": "Quote from: Jimmy Wales on August 01, 2023, 07:22:27 PMAs per GeckoTerminal, current price is $0.0000004766. Will track further in coming days...As per GeckoTerminal, current price is $0.0000007685. Liquidity is stuck yet. I am running a campaign to spread the word on Twitter - https://bitcointalk.org/index.php?topic=5462115.0.Do your own bit, if you are an early adopter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 07, 2023, 06:35:22 AM",
      "body": "Quote from: Jimmy Wales on August 01, 2023, 09:22:14 PMVery same way I found PEPE, BOBO & JIM early, i.e. by sorting GeckoTerminal. Still not a vise investment strategy. According to coinmarketcap there are 1.8 mln crypto projects. F*king 1.8 mln ! So the chances to find PEPE, BOB, JIM are 1: 600 000. So even if you made x1000 with them its still 600x worse than just go yolo in roullete with all your money. And thinking that you will catch a good meme early is inherently wrong, because their success depends on the ability of the market operator, marketing and capital behind the project, and you can't guess that based on the name.This whole thread looks suspicious. Everyone should avoid shitcoins like those.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dlightag",
      "created_time": "August 07, 2023, 12:39:40 PM",
      "body": "The best way to determine the total supply of an unlisted token is to find out the chain the Coin is operating on, then from the smart chain to locate the particular network, which have already go through the official website and get the information needed, such as the smart contract address and network operating on, then scan the wallet contract smart wallet address, details of the coin's will appears.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 07, 2023, 01:28:28 PM",
      "body": "Quote from: Tytanowy Janusz on August 07, 2023, 06:35:22 AMAnd thinking that you will catch a good meme early is inherently wrong, because their success depends on the ability of the market operator, marketing and capital behind the project, and you can't guess that based on the name.This is a rare chance unless you are a good spotter for developers with a lot of connection in marketing and very trendy socials like twitter. I think some do this by following their season influencer or particular wallets. Its kinda hard to sort out a very goof project on meme in dozens of choices and checking each is really time consuming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 08, 2023, 05:41:43 AM",
      "body": "Quote from: cryptoaddictchie on August 07, 2023, 01:28:28 PMThis is a rare chance unless you are a good spotter for developers with a lot of connection in marketing and very trendy socials like twitter. I think some do this by following their season influencer or particular wallets. Its kinda hard to sort out a very goof project on meme in dozens of choices and checking each is really time consuming. maybe in a perfect world it would work like that. In the real world, any number you look at in the context of \"very trendy socials\" can be bought for dollars, making the success of the project dependent only on the capital that the scammer has and the experience in creating a scam (AKA how many scams he did before, and experience they make quickly, because some of them can create several scam projects a day).edit: in a perfect world it doesn't work like that either, because in a perfect world there are no scamcoins (AKA meme coins). People invest in technology, sponsoring the development of the industry and sharing future profits instead of buying another yacht to scammers hoping to sell a hot potato before the rug pull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 08, 2023, 08:14:28 AM",
      "body": "Quote from: Tytanowy Janusz on August 08, 2023, 05:41:43 AMmaybe in a perfect world it would work like that. In the real world, any number you look at in the context of \"very trendy socials\" can be bought for dollars, making the success of the project dependent only on the capital that the scammer has and the experience in creating a scam (AKA how many scams he did before, and experience they make quickly, because some of them can create several scam projects a day).I get your point mate. Thats how its work actually and these people are keep doing it for the last few years. Well what can we do they are the one pulling off some nasty ideas and people get to like it since its trending. The only chance you could do is spot them early and get out on a perfect timing to have some profit. Ofcourse these people will not pull the trigger right away at least not on the time you expect it so always take profits. Anyway, not all succeed and some have caught before it explode.Perfect example of this is a memecoin on base network called bald.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 09, 2023, 06:11:13 AM",
      "body": "Quote from: cryptoaddictchie on August 08, 2023, 08:14:28 AMWell what can we do they are the one pulling off some nasty ideas and people get to like it since its trending. The only chance you could do is spot them early and get out on a perfect timing to have some profit.Wrong. The best memecoin trading strategy is to not trade memecoins at all and stay away from anyone who is shilling memecoins. there are many wonderful things you can do with money. Filling the pockets of scammers in the hope of selling a hot potato quickly enough is not one of them. people should invest in innovative technologies or safe returns (dividend aristocrats) and not gamble with unknown probability of success/failure on meme coins.I will repeat ad nauseam under every thread about meme coins until people stop talking about them, because in my opinion, trading this garbage hurts the entire industry by sucking capital from innovative technologies and ridiculing people investing here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 09, 2023, 11:00:06 AM",
      "body": "Quote from: Tytanowy Janusz on August 09, 2023, 06:11:13 AMWrong. The best memecoin trading strategy is to not trade memecoins at all and stay away from anyone who is shilling memecoins. there are many wonderful things you can do with money. Then thats not a strategy you give but a total hindrance for those who want to trade memecoin. You cant really force someone not to trade especially when they are gaining some profits on memecoin. Just because some others got scammed and other rugpulls. Yes theres a lot of bad blood in the memecoins but, do you think we like to be scam? Thats what you called risky gamble on a crypto.Im also investing on good major altcoins and even bitcoin so I knew my fair share of experiences among these shitcoins and innovative coins.Quote from: Tytanowy Janusz on August 09, 2023, 06:11:13 AMI will repeat ad nauseam under every thread about meme coins until people stop talking about them, because in my opinion, trading this garbage hurts the entire industry by sucking capital from innovative technologies and ridiculing people investing here.Its your right anyway and opinion. But surely there will some who will disagree with you too and has their own opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 09, 2023, 11:36:20 AM",
      "body": "Remember if the token is centralized e.g. using Proof Of Stake, the node are controlled by few miners, the developer can burn the token etc, there's no point to know the total supply of the token since the developer can just increase the total supply as they're not decentralized in the first place.This already happen in many tokens, that's why you should need to think about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 09, 2023, 11:36:53 AMLast edit: August 09, 2023, 11:47:16 AM by Tytanowy Janusz",
      "body": "Quote from: cryptoaddictchie on August 09, 2023, 11:00:06 AMIts your right anyway and opinion. But surely there will some who will disagree with you too and has their own opinion.There are facts and there are opinions. The sentence that meme coins are a scam, are created to extort money and harm the entire industry is a fact. meme coins don't produce anything, they don't solve anyone's problems don't develop the industry. Give one example that proves otherwise. The fact that someone once got lucky and made money on it is not proof that meme coins are good, because it is a zero-sum game (meaning someone else lost). In fact, it's not even a zero-sum game because the creator of the meme coin is cutting his cut. in most cases almost everything.Quote from: cryptoaddictchie on August 09, 2023, 11:00:06 AMYes theres a lot of bad blood in the memecoins but, do you think we like to be scam? Thats what you called risky gamble on a crypto.No one likes to be scammed, but you need to know what a scam is in order not to be scammed. Meme coins are scams. Gamble^2 because in normal gamble you can calculate odds of winning. here you don't know when scammers will rugpull all your money. You don't know how much you can win, you don't know what the odds of winning are, how big house edge is. Unfortunately, the vision of quick profits attracts people and calling it \"investing\" or \"trading\" makes them let go of the brakes and so they would enter the casino with a maximum of $ 100 (because \"its gambling and i'm not a gambler\"), but they will go to look for meme coins with $10,000 (because \"I'm investing now\"), then do DCA with another $40 000 loosing family savings. Have you ever wondered what tragedies in many families meme coins creates? Have you ever wondered how many people have already committed suicide because of these scammers? \"trying to find a new pepe fast\" only gives them capital to make another scam with much better marketing, paid listing on bigger exchanges, more fake fallowers, more paid articles, more washtrading to show big volume etc.therefore, in accordance with my conscience, I advise against meme coins whenever I can. You can write that \"some people make money on it\", but in my opinion its wrong. At the casino, some people also make money, moments before they lose everything. Only the casino is honest about its house edge. Memecoin scammers don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 09, 2023, 12:05:18 PM",
      "body": "Quote from: Tytanowy Janusz on August 09, 2023, 11:36:53 AMmeme coins don't produce anything, they don't solve anyone's problems don't develop the industry. Give one example that proves otherwise. How about dogecoin? This is a memecoin and if youll say that this is worthless at all then why its on the top marketcap and why the smart Elon Musk taking this project as good and even used it for payment on a brand called Tesla? Thats a fact too. If its a scam then not everybody will agree with you.Quote from: Tytanowy Janusz on August 09, 2023, 11:36:53 AMtherefore, in accordance with my conscience, I advise against meme coins whenever I can. You can write that \"some people make money on it\", but in my opinion its wrong. At the casino, some people also make money, moments before they lose everything. Only the casino is honest about its house edge. Memecoin scammers don't.Gambling on casino and memecoins involved both money and risk. The only difference is the \"DEGEN\" or people who knew of this risk are aware of it they just gambling on a literally high risk environment. Would you called them stupid for doing so if they knew what they are doing? Maybe they will replied to you get loss, its not your money cause we know what we are dealign with. The problem here are those newbies who joined that is not aware of the consequence. I respect that you dont want to let those who loss suffer more. Me too but Im telling you, if this can be stop this has been stopped years ago. But what can we do we live in a decentralized space where scammers are included in adopting blockchain and crypto.How can we filter those scammers on decentralized space? Just total avoidance right but it cant be stopped. So doing centralized like cex who asked for might limit it but again there are some who dont like it cause its not right on decentralization. Whatever sides there still be none winner in terms of cause and effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taunranh81",
      "created_time": "August 09, 2023, 12:28:55 PM",
      "body": "You don't need to worry about it too much. It's a memecoin, and you can either invest in it or not, it's your choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 10, 2023, 06:14:09 AM",
      "body": "Quote from: cryptoaddictchie on August 09, 2023, 12:05:18 PMHow about dogecoin? This is a memecoin and if youll say that this is worthless at all then why its on the top marketcap and why the smart Elon Musk taking this project as good and even used it for payment on a brand called Tesla? Thats a fact too. If its a scam then not everybody will agree with you.seriously? are you trying to undermine the fact that meme coins are evil incarnate that harms the entire industry by bringing here dogecoin and elon, who wrote a few tweets about it for a joke/price manipulation? Did you know that elon also wrote about cumrocket? did you know that elon has had many lawsuits from the SEC related to market manipulation. but okay if you want to talk about dogecoin, say what problems dogecoin solves and how much worse the world would be without it. Dogecoin is a joke, but beware, unlike other memecoins, it was a joke told for the first time and thus it was a funny joke. And the fact that there were only a handful of altcoins on the market at the time (rather than 1.8 million today) made him unique in his approach. What can not be said about other meme coins.Quote from: cryptoaddictchie on August 09, 2023, 12:05:18 PMWould you called them stupid for doing so if they knew what they are doing? Maybe they will replied to you get loss, its not your money cause we know what we are dealign with. I know this type of guy. This is a person who, playing roulette, also thinks that he knows what he is doing because he won 3 times in a row. Unfortunately, he loses everything in the next 2 throws. and why do I care about demonizing meme coins even though it's not my money that is being lost? because it's money that ends up in the hands of scammers and is used to make bigger scams. And everyone suffers from this, except for manufacturers of yachts and luxury watches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 10, 2023, 08:53:33 AM",
      "body": "Quote from: Tytanowy Janusz on August 10, 2023, 06:14:09 AMseriously? are you trying to undermine the fact that meme coins are evil incarnate that harms the entire industry by bringing here dogecoin and elon, who wrote a few tweets about it for a joke/price manipulation? Did you know that elon also wrote about cumrocket? did you know that elon has had many lawsuits from the SEC related to market manipulation. Well as if you pointing out that you are 100% correct with all what you say though? Dogecoin is the founder of memecoin. Obviously when we say it meme its practically a joke isnt it. Whether its dogecoin or any anime based meme, we all knew its total utilization is like for fun but since its being trade on the market like other altcoins and even bitcoin. Then if you really that dissaprove of memecoin, maybe put up a word with sites like coingecko, coinmarketcap to avoid sharing and spreading details about these memecoins and others since these are harmful does it mean they supported evil incarnate projects?Quote from: Tytanowy Janusz on August 10, 2023, 06:14:09 AMI know this type of guy. This is a person who, playing roulette, also thinks that he knows what he is doing because he won 3 times in a row. Unfortunately, he loses everything in the next 2 throws. and why do I care about demonizing meme coins even though it's not my money that is being lost? because it's money that ends up in the hands of scammers and is used to make bigger scams. And everyone suffers from this, except for manufacturers of yachts and luxury watches.Yes maybe something like that of guy. But how about retailers who just bet their money on meme, or those who simply got lucky and gain profits? I guess you shouldnt include them or yet generalize all do meme are developers who jump ship to ship for profits and do rugpulls. Theres a difference, since some degens are just doing gambling with these memecoins or shitcoins to earn money too not too scam anyone and some arent even developers so how can you justify only yacht manufacturers only getting fruits from it. I dont know find some stories on social media like a simple guy who trade memes and won huge profits.If trading memecoins is a sin for us then let all cex and dex delisted those projects cause they are harmful to the market industry right. Only trade bitcoin cause its the only legit one. What odds that this will happen in the future?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 10, 2023, 11:28:56 AM",
      "body": "Quote from: cryptoaddictchie on August 10, 2023, 08:53:33 AMI dont know find some stories on social media like a simple guy who trade memes and won huge profits.These are all paid articles with money raised from previous scams. You can publish any article you wont on sites like WSJ, cointelegrph, yahoo finance, marketwatch, bloomberg etc for less than 2000$. 1 article of this type costs $ 2,000 and the legend about it circulates for years.besides, even if it's true that some retailer turned $100 into $10 million (which i doubt), it's a zero sum game. This is not a stock company share and return on investment comes from the product supplied and sold by the company to people willing to use it. If he get this, orthers had to lose it. meme coins are pure evil.Quote from: cryptoaddictchie on August 10, 2023, 08:53:33 AMIf trading memecoins is a sin for us then let all cex and dex delisted those projects cause they are harmful to the market industry right. Only trade bitcoin cause its the only legit one. What odds that this will happen in the future?it's a free world and cexies are listing these coins because people want to trade them. It's not my job to write to the cex to give up profits at the expense of competitors (who will take those profits). My task is to inform people that playing with meme coins brings profits inadequate to the risks and harms the entire industry. So that they wouldn't want to touch that cesspool. Cexy will quickly delist projects that do not bring the expected volumes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}