{
  "id": "topic_5497792",
  "title": "virtual_enthusiasm",
  "author": "virtual_enthusiasm",
  "created_time": "May 25, 2024, 11:19:01 PMLast edit: May 28, 2024, 11:49:34 AM by virtual_enthusiasm",
  "content": "1-  People buy Bitcoin because it makes them profit from it2-  Bitcoin makes profit because it makes people buy itIt's a circular argument, and creates a perfect closed system, no other \"product\" can make it, in the center there is greed moving this perfect circle---------------And why it's impossible to copy bitcoin's proof of work, meaning that only bitcoin's proof of work is valid:If many people wanted to buy another PoW coin instead of Bitcoin, the price of Bitcoin would rise, meaning it would generate more profit, which would make people buy only Bitcoin. Therefore, it is not possible for people to buy another proof of work coin instead of Bitcoin because this would make Bitcoin's price increase generating more profit, which would prevent competition.In a normal company, competition forces companies to lower prices. In Bitcoin, the logic is inverse, it raises the price and prevents competition from emerging, which makes proof of work impossible to copy.a- If people starts to buy other Bitcoin competitors, it would make the Bitcoin network less secureb- Everybody wants the Bitcoin network to be the most secure, the buyers and the sellersc- Then if the Bitcoin network becomes less secure, then all parties, buyers and sellers, are forced to accept a higher Bitcoin price to make the network more secure, and this price increase discourages/block people from investing in competitorsif this logic is invalid, please correct me if i'm wrong thx",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5497792",
  "comments": [
    {
      "author": "Reatim",
      "created_time": "May 25, 2024, 11:40:11 PM",
      "body": "Quote from: virtual_enthusiasm on May 25, 2024, 11:19:01 PMAnd why it's impossible to copy bitcoin's proof of work, meaning that only bitcoin's proof of work is valid:To say that bitcoin’s mechanism is the only valid one is wrong. There are other coins that are built on pow mechanism but just with different algorithms. It doesn’t mean theirs are automatically invalid.QuoteIf many people wanted to buy another PoW coin instead of Bitcoin, the price of Bitcoin would rise, meaning it would generate more profit, which would make people buy only Bitcoin. Therefore, it is not possible for people to buy another proof of work coin instead of Bitcoin because this would make Bitcoin's price increase generating more profit, which would prevent competition.In a normal company, competition forces companies to lower prices. In Bitcoin, the logic is inverse, it raises the price and prevents competition from emerging, which makes proof of work impossible to copy.I’m confused. Bitcoin is not a company and does not have a group of people to decide whether they should lower or higher the price based on competition. Its price depends on the demand. If people’s attention shifts from bitcoin to other coins, then those coins’ price will hike up. Unless people who have invested in bitcoin start selling their coins, it’s not gonna do anything to the price. I don’t know how you think it’s going to work if people started buying other coins. People can allocate their money into different and multiple coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virtual_enthusiasm",
      "created_time": "May 25, 2024, 11:53:53 PM",
      "body": "To ReatimAll other Pow coins are invalid, because if people’s attention shifts from bitcoin to other coins, the price of bitcoin increases, preventing people from investing in other coins, because they make more profit with bitcoin\"Bitcoin is not a company and does not have a group of people to decide whether they should lower or higher the price based on competition\" - This mechanism works automatically. The higher the price, the more people will want to buy because it means higher profit. I know it's not very intuitive, but it's a fact, no other pow coin succeeded and will except bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "May 26, 2024, 03:17:39 AM",
      "body": "In theory at the present time, the price increase scenario is still continuing but it is not entirely based on the number of people buying/selling it, there is one thing that I think talking about the operating structure only partly makes people then pay attention to bitcoin and buy it. So some big questions who would buy it? And will prices increase forever? But we do not see fluctuations from the first stages, perhaps partly at present people are in a state of increasing market prices and forgetting about its volatility, only to find a way to reduce prices. Currently, the story surrounding the seller is being told. Anyway, in this context, accepting bitcoin is inevitable without any vague explanation, because the price is still based more on trust, but at different times the scale is different. The state of the market will also reflect the level of acceptance of bitcoin. Although I like bitcoin very much, I am not the type of person to believe in anything for sure based on a speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virtual_enthusiasm",
      "created_time": "May 26, 2024, 03:40:04 AM",
      "body": "To Blueblit 25Yes the price will increase forever, because the buyer and the seller both want the bitcoin network to be secure, and the price must always increase for the network to be always secure. The increase in price also blocks all PoW competitors, because competition means the network be insecure, if the network becomes insecure because of competitors, the bitcoin price increase and block competitors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "May 26, 2024, 06:56:11 AM",
      "body": "It's not impossible to copy bitcoin, in a technical sense though. There have been a lot of bitcoin forks over the years but in terms of popularity, value, and utility, they're not going to get close anytime soon. Bitcoin is unique and it would be a big disservice for everyone here to say that someone can just copy it and recreate the success. Your loop seems to be on the right but I got to tell you though, I don't think that it matters, once there's people that have bought bitcoin with their own money, it's already done, bitcoin has a value. Also regarding the rise in prices, it will always be like that because there's always a demand for bitcoin and there's not a lot of people that know about bitcoin and eventually those people will know and some of them will try to invest and they will contribute to the increase of demand which increase the price of bitcoin even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "May 26, 2024, 07:49:11 AM",
      "body": "Quote from: virtual_enthusiasm on May 25, 2024, 11:19:01 PM1-  People buy Bitcoin because it makes them profit from it2-  Bitcoin makes profit because it makes people buy itIt's a circular argument, and creates a perfect closed system, no other \"product\" can make it, in the center there is greed moving this perfect circleIt's not a good thng. That circular argument is the basis of a speculative bubble. It is a positive feedback loop, which means it is unstable and it is guaranteed to eventually fail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "May 26, 2024, 10:25:03 AM",
      "body": "Quote from: virtual_enthusiasm on May 25, 2024, 11:19:01 PMAnd why it's impossible to copy bitcoin's proof of work, meaning that only bitcoin's proof of work is valid:It’s not impossible to recreate bitcoin’s proof of work mechanism in fact many have already done so.To name a few: there are litecoin, dogecoin, monero and many others. The difference is that they are just utilized differently than bitcoin as they were created with different purposes in mind. What you can not recreate is bitcoin’s success. Being the first among many, bitcoin has the advantage of comfidence and reliability.Resilience is also a feature that not a lot of coins have that only bitcoin has managed to exhibit over the years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virtual_enthusiasm",
      "created_time": "May 26, 2024, 10:53:19 AM",
      "body": "to btc78 to CODE200 litecoin, dogecoin, monero can't grow, they are just moving horizontally. It's not possible to copy bitcoin and the chart proves it. The reason is that forks and copies makes bitcoin network insecure, and this forces the price to move up, when the bitcoin price goes up, the network becomes more secure, and people make profit, and this makes impossible to compete with bitcoin to odolvloboYes i agree with you, but bitcoin is different because it does not have intrinsic value, so the price can rise indefinitely, Bitcoin has a price but no value. Financial bubbles only form when the price deviates significantly from intrinsic value, and then they burst.But, if Bitcoin has no intrinsic value, only price, then the price can never deviate from value since it does not exist then it's not possible to form a bubble",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "May 26, 2024, 06:59:04 PMLast edit: June 05, 2024, 09:19:37 PM by odolvlobo",
      "body": "Quote from: virtual_enthusiasm on May 26, 2024, 10:53:19 AMYes i agree with you, but bitcoin is different because it does not have intrinsic value, so the price can rise indefinitely, Bitcoin has a price but no value. Financial bubbles only form when the price deviates significantly from intrinsic value, and then they burst.But, if Bitcoin has no intrinsic value, only price, then the price can never deviate from value since it does not exist then it's not possible to form a bubble It can rise indefinitely, but if it has no intrinsic value, it can also fall to 0. Bitcoin has already been through several speculative bubbles, so I don't see how you can claim that it is not possible.Anyway, I disagree with the statement that Bitcoin has no intrinsic value. If intrinsic value is based on utility, then Bitcoin has intrinsic value because it has utility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 26, 2024, 07:35:13 PM",
      "body": "Quote from: CODE200 on May 26, 2024, 06:56:11 AMIt's not impossible to copy bitcoin, in a technical sense though. There have been a lot of bitcoin forks over the years but in terms of popularity, value, and utility, they're not going to get close anytime soon. It is true that it is not impossible to copy bitcoin that's why there are coins and altcoins out there although the difference is that it doesn't have the success that bitcoin has and that's why many coins and altcoins depends on bitcoin price movements most of the time although there are situations where a coin or altcoin for example where it's price still increase even though bitcoin price didn't increase but not up to the same price as bitcoin but based on the coin or altcoin's current price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 26, 2024, 08:33:37 PM",
      "body": "Quote from: virtual_enthusiasm on May 25, 2024, 11:53:53 PMAll other Pow coins are invalid, because if people’s attention shifts from bitcoin to other coins, the price of bitcoin increases, preventing people from investing in other coins, because they make more profit with bitcoinThis argument doesn't even make sense. If people dump bitcoin for altcoins, then the price of bitcoin decreases, it does not increase. Quote from: virtual_enthusiasm on May 26, 2024, 10:53:19 AMFinancial bubbles only form when the price deviates significantly from intrinsic value, and then they burst.What's your definition of \"intrinsic value\"? How's Bitcoin not having that? And who defines what's the \"intrinsic value\" to something? To name value to a product, you need another product to use as exchange rate, preferably a currency. Therefore, the value of Bitcoin is determined by what others are willing to exchange for it, whether in the form of products, assets, or currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HideYourKeys",
      "created_time": "May 27, 2024, 02:39:31 PM",
      "body": "Bitcoin's volatility attracts people, that's a fact, but once you get it... you stay.\"Come for the money, stay for the revolution\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "May 27, 2024, 05:00:18 PM",
      "body": "Haha, Op destroyed the entire concept of Bitcoin and demand to supply on the Bitcoin network by resembling it completely based on greed haha, I cant expect a more shity explanation compared to this, and my whole comment is on the first 2 lines from OP's post.Buddy you need to study more about the supply and demand concept on Bitcoin, no doubt greed is one of the influencing factors but that's not the whole reality, I believe mostly the demand and supply is influenced by the Halving event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 28, 2024, 06:54:18 AM",
      "body": "It sounds to me like OP is calling Bitcoin a Ponzi scheme while sugar coating it.Price goes up as adoption grows and adoption grows because people see the utility that bitcoin provides and decide they want to have that. Be it reaching financial sovereignty or just treating bitcoin as money (ie. store of value).Quote from: virtual_enthusiasm on May 25, 2024, 11:19:01 PMIf many people wanted to buy another PoW coin instead of Bitcoin, the price of Bitcoin would rise, meaning it would generate more profit, which would make people buy only Bitcoin. Therefore, it is not possible for people to buy another proof of work coin instead of Bitcoin because this would make Bitcoin's price increase generating more profit, which would prevent competition.In a normal company, competition forces companies to lower prices. In Bitcoin, the logic is inverse, it raises the price and prevents competition from emerging, which makes proof of work impossible to copy.That makes no sense.For starters bitcoin is not a company and nobody is sitting on top setting its price to get people to buy it or not.Secondly if you buy something else, the price of that other thing would go up! In fact this is how the altcoin market works. People buy altcoins, they get pumped. That all happens regardless of Bitcoin even though the altcoin market is affected by bitcoin price movements.As for \"competition\", there has been no competition for Bitcoin simply because nobody was capable of coming up with an innovation that is interesting enough to change the world like Bitcoin did and get adopted as much as Bitcoin.So far we've only seen developers who were more interested in making quick and large amounts of money. So obviously the cryptocurrencies that are being created are serving that purpose and are used for pump and dumps not to be adopted! Therefore there is no competition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z_MBFM",
      "created_time": "May 28, 2024, 07:15:56 AM",
      "body": "Quote from: Reatim on May 25, 2024, 11:40:11 PMQuote from: virtual_enthusiasm on May 25, 2024, 11:19:01 PMAnd why it's impossible to copy bitcoin's proof of work, meaning that only bitcoin's proof of work is valid:To say that bitcoin’s mechanism is the only valid one is wrong. There are other coins that are built on pow mechanism but just with different algorithms. It doesn’t mean theirs are automatically invalid.Every coin that is coming to the market now has a regulatory body. so they can change their price and mint according to the token or coin supply. And it does it under one of the chains or depending on its own mainnet. However, it is not possible to copy Bitcoin using Bitcoin's algorithm or any other mechanism.Quote from: Reatim on May 25, 2024, 11:40:11 PMQuoteIf many people wanted to buy another PoW coin instead of Bitcoin, the price of Bitcoin would rise, meaning it would generate more profit, which would make people buy only Bitcoin. Therefore, it is not possible for people to buy another proof of work coin instead of Bitcoin because this would make Bitcoin's price increase generating more profit, which would prevent competition.In a normal company, competition forces companies to lower prices. In Bitcoin, the logic is inverse, it raises the price and prevents competition from emerging, which makes proof of work impossible to copy.I’m confused. Bitcoin is not a company and does not have a group of people to decide whether they should lower or higher the price based on competition. Its price depends on the demand. If people’s attention shifts from bitcoin to other coins, then those coins’ price will hike up. Unless people who have invested in bitcoin start selling their coins, it’s not gonna do anything to the price. I don’t know how you think it’s going to work if people started buying other coins. People can allocate their money into different and multiple coins. In every case when people like and hold a thing more and if its supply is fixed then the demand of that thing increases a lot and if the demand increases then a big hype is created on it in the market. the same goes for Bitcoin.  Its supply is fixed and very less and it has gained a lot of people's trust due to which its demand in the market is very high and due to this the price of Bitcoin is increasing day by day. Since its supply cannot be increased and new users are attracted to Bitcoin day by day, the price of Bitcoin will increase more in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "May 28, 2024, 08:44:30 AM",
      "body": "Quote from: virtual_enthusiasm on May 25, 2024, 11:19:01 PMIf many people wanted to buy another PoW coin instead of Bitcoin, the price of Bitcoin would rise, meaning it would generate more profit, which would make people buy only Bitcoin. Therefore, it is not possible for people to buy another proof of work coin instead of Bitcoin because this would make Bitcoin's price increase generating more profit, which would prevent competition.How so? I don't understand what you mean, if people buy other cryptocurrencies instead of Bitcoin, that wouldn't make the price of Bitcoin rise up or grow because the whole concept revolves around the demand and supply mechanism where the price of an asset only increases if the demand is high and supply is low, but if there is no much demand, the price wouldn't get affected even if the supply is low. So I don't see any reason why the price of Bitcoin would go up if people buy other PoW coins.Please explain this a bit more.Quote from: virtual_enthusiasm on May 25, 2024, 11:19:01 PMIn a normal company, competition forces companies to lower prices. In Bitcoin, the logic is inverse, it raises the price and prevents competition from emerging, which makes proof of work impossible to copy.Cryptocurrencies are not like companies because their prices are not controlled by a central authority but their price depends on how much demand they have. Bitcoin has such a high value only because it is the most demanded cryptocurrency and it has a limited supply, another cryptocurrency can compete with it if it gets the same level of demand and has a low supply like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "May 28, 2024, 10:03:55 AM",
      "body": "Quote from: CODE200 on May 26, 2024, 06:56:11 AMIt's not impossible to copy bitcoin, in a technical sense though. There have been a lot of bitcoin forks over the years but in terms of popularity, value, and utility, they're not going to get close anytime soon. Bitcoin is unique and it would be a big disservice for everyone here to say that someone can just copy it and recreate the success. Your loop seems to be on the right but I got to tell you though, I don't think that it matters, once there's people that have bought bitcoin with their own money, it's already done, bitcoin has a value. Also regarding the rise in prices, it will always be like that because there's always a demand for bitcoin and there's not a lot of people that know about bitcoin and eventually those people will know and some of them will try to invest and they will contribute to the increase of demand which increase the price of bitcoin even more.The key word is that Bitcoin, is unique, and no other cryptocurrency comes near it because of it's value, popularity and utility, like you rightly said, therefore it's in a higher class of it's own. And inasmuch as there's always a demand for it, the price will continue to increase in the future, this is necessitated because over the years Bitcoin, has proven to be a store of value, an asset that if held on a long term, will always increase returns on investment for it's holders. Except for a few top altcoins, most of the projects in the category are scams, this is why making comparison in cryptocurrency, it'll be like choosing between Bitcoin and altcoins, obviously Bitcoin, will always carry the day, because of the trust and profitability that it has built over the years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virtual_enthusiasm",
      "created_time": "May 28, 2024, 10:12:49 AMLast edit: May 28, 2024, 11:51:39 AM by virtual_enthusiasm",
      "body": "To pooya87\"That makes no sense.For starters bitcoin is not a company and nobody is sitting on top setting its price to get people to buy it or not.Secondly if you buy something else, the price of that other thing would go up!\"To Gladitorcomeback\"How so? I don't understand what you mean, if people buy other cryptocurrencies instead of Bitcoin, that wouldn't make the price of Bitcoin rise up or grow because the whole concept revolves around the demand and supply mechanism\"------------i updated the post above because it was really incompleteProof of work discovery solved those issues, because there is not only supply and demand, there also is the network securitya- If people starts to buy other Bitcoin competitors, it would make the Bitcoin network less secureb- Everybody wants the Bitcoin network to be the most secure, the buyers and the sellersc- Then if the Bitcoin network becomes less secure, then all parties, buyers and sellers, are forced to accept a higher Bitcoin price to make the network more secure, and this price increase discourages/block people from investing in competitors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "May 28, 2024, 10:43:46 AM",
      "body": "The only thing that seems impossible in this space now is someone or developers walking in the same path as Satoshi Nakamoto.It's not about how much they can copy Bitcoin, it's not about how many utilities that they can offer or that can surpass Bitcoin, it's about real decentralisation like Bitcoin.Build and walk away, how many developers can do this? It's why many projects are a complete joke today, we keep having developers but they are here to make money, that's all. At the end of the day what really matters in this world of crypto is decentralisation, and having PoW in your project doesn't make it decentralized, it doesn't make it better than Bitcoin in anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}