{
  "id": "topic_5429009",
  "title": "Ivartheragnarson",
  "author": "Ivartheragnarson",
  "created_time": "December 15, 2022, 05:53:20 PM",
  "content": "hello all,  i am currently using trust wallet as my main wallet. my previous wallet has been hacked by someone and that too was a trust wallet. today a friend of mine had to face to the same problem i faced. his wallet also was a trust wallet. why these trust wallets are being hacked?? isn't trust wallet safe?? if no why?? is there a better wallet for holding my crypto temporarily?? i am asking about mobile wallets guyz, not about cold wallets.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429009",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "December 15, 2022, 06:11:59 PM",
      "body": "You can try MyCelium (for iOS I believe - I've used that before), Or you can use Blockstream Green or Muun Wallet. Additionally, if you are using Android, you also have Electrum and Bitcoin Wallet for Android as options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 15, 2022, 06:47:31 PM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMwhy these trust wallets are being hacked?? isn't trust wallet safe?? if no why?? is there a better wallet for holding my crypto temporarily?? i am asking about mobile wallets guyz, not about cold wallets.Trustwallet is close source, so no point in trusting the wallet. But you and your friend need to protect your wallet from both online and offline attack which is what I think that happened, that your wallet or seed phrase is not well backup or protected.I will recommend Electrum, for bitcoin. Or Bluewallet.Quote from: NotATether on December 15, 2022, 06:11:59 PMYou can try MyCelium (for iOS I believe - I've used that before), Or you can use Blockstream Green or Muun Wallet. Additionally, if you are using Android, you also have Electrum and Bitcoin Wallet for Android as options.I do not still recommend Muun wallet because no seed phrase backup, correct me if I am wrong.Wallets supporting Taproot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "December 15, 2022, 07:42:04 PM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMhello all,  i am currently using trust wallet as my main wallet. my previous wallet has been hacked by someone and that too was a trust wallet. today a friend of mine had to face to the same problem i faced. his wallet also was a trust wallet. why these trust wallets are being hacked?? isn't trust wallet safe?? if no why?? is there a better wallet for holding my crypto temporarily?? i am asking about mobile wallets guyz, not about cold wallets.Coinbase wallet is no bad idea as it's best recommended for beginners. But based on personal experience with the kind of wallet I am using I'll say you go for electrum wallet, I can't remember having security issues with it for so long I have been using it, only that it is for advance bitcoin users, the way I view it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "December 15, 2022, 08:25:07 PM",
      "body": "Android wallets serve thesame purpose, holding coins, but have different features. If you often have to deal with transactions from or to a different chain or network go for metamask, but don't store huge funds on the wallets like other hot wallets its a web based wallet and can be accessed by hackers. Then, if you want a compatible wallet for stable coins, sending coins to the ethereum network you can go for myetherwallet. For multiple coins in one wallet I'd advise you to stick with trust wallet. So, just look for the wallet that serves or offers those features you are looking forward to utilizing while transacting your assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 15, 2022, 10:46:38 PM",
      "body": "What exactly are coins or tokens you are planning to hold in your wallet?For me, if all your assets are tokens check metamask, or if its coin then use their specific wallet like in bitcoin use bitcoin core to make sure you are safe, or if you have multiple tokens and coins then buy a hardware wallet you can connect it to your phone via OTG.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 15, 2022, 11:55:04 PM",
      "body": "Quote from: Lida93 on December 15, 2022, 07:42:04 PMCoinbase wallet is no bad idea as it's best recommended for beginners. But based on personal experience with the kind of wallet I am using I'll say you go for electrum wallet, I can't remember having security issues with it for so long I have been using it, only that it is for advance bitcoin users, the way I view it. Coinbase wallet is a close source wallet.I was not an advanced user when I have been using Electrum, I was a newbie and it is straight forward to understand if you have known and understood what seed phrase his and to protect it. Do not believe everything that you see online.Quote from: albert0bsd on December 15, 2022, 10:26:34 PMI can recomend Guarda it really works well. It have mobile version and also web version.I have not used Guarda wallet before, but know that if a wallet is a web wallet and you can connect to it using a web browser, that means it is only just having a mobile app, it is not a mobile wallet, but a web wallet.On mobile wallet, you would be able to generate keys and addresses offline without connecting to the internet, unlike on web wallet.Quote from: BitMaxz on December 15, 2022, 10:46:38 PMFor me, if all your assets are tokens check metamask, or if its coin then use their specific wallet like in bitcoin use bitcoin core to make sure you are safe, or if you have multiple tokens and coins then buy a hardware wallet you can connect it to your phone via OTG.For privacy, bitcoin core is recommended, but still an online wallet.If having high amount of bitcoin, best to run your own node with your keys generated offline if you want to run your own node. Or to just go for cold storage option if you want to use SPV wallet. Or to just go for a reputed hardware wallet which people are also using as a SPV wallet.Not everyone can run their own node as it requires high storage space of almost 400 gigabyte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 16, 2022, 12:14:26 AM",
      "body": "Quote from: BitMaxz on December 15, 2022, 10:46:38 PMWhat exactly are coins or tokens you are planning to hold in your wallet?Unless I missed it, I'm surprised I had to scroll so far for this question to be asked. @OP, for both security and amount of coins that are available in one wallet, hardware is probably ultimately the best option (Trezor or Ledger should both work fine with android). If you don't want to go down the route of using hardware, most of the suggestions above are good - each have their flaws though (especially in the scope of currencies they offer) which might be a drawback for you. Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMwhy these trust wallets are being hacked?? They're used A LOT, especially by newbies so they're lucrative for an attacker to hack. They're also closed source which means the wallet is developed by one central team and only they have access to the code. Wallets like electrum and bitcoin core do well because anyone can see their code, and, if they find a bug can report it and most can even trace where the error might be in the code allowing a developer of the project just to change it as it's reported. Most malicious problems found in any software are generally patched within a week or so (for closed source projects) or a few minutes-hours (for open source projects) so a lot of attackers try to sell vulnerabilities and execute them close together to try to increase the number of devices they can target before it's patched.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "December 16, 2022, 10:07:40 AM",
      "body": "Quote from: Charles-Tim on December 15, 2022, 06:47:31 PMI will recommend Electrum, for bitcoin. Or Bluewallet.Yes, these are 2 the best options in my opinion too. Electrum unfortunately is for android only and it's UI is far from nowadays standards, but it comes from trusted developers.Bluewallet is fine for everyday use, for normal wallets or lightning. In general if wallets allows you to specify to which server you want to connect and especially if it allows you to connect to your own Electrum server, that's a big argument for using it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "December 16, 2022, 10:14:10 AM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMwhy these trust wallets are being hacked??Without additional information, we can't simply know why these trust wallet hacked. Although few common reason are,1. User install malicious app/malware which given lots of permission.2. The recovery seed phrase is stored on unsecure location (e.g. plain text on external storage or note taking application).Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMisn't trust wallet safe?? if no why??Since trust wallet is closed source, we don't know how secure is it. And i never see any result of security audit on Trust Wallet either.Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMis there a better wallet for holding my crypto temporarily?? i am asking about mobile wallets guyz, not about cold wallets.Following theymos past suggestion, you might want to use Electrum, BlueWallet or Unstoppable wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "December 16, 2022, 12:48:19 PM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMhello all,  i am currently using trust wallet as my main wallet. my previous wallet has been hacked by someone and that too was a trust wallet. today a friend of mine had to face to the same problem i faced. his wallet also was a trust wallet. why these trust wallets are being hacked?? isn't trust wallet safe?? if no why?? is there a better wallet for holding my crypto temporarily?? i am asking about mobile wallets guyz, not about cold wallets.In my opinion, if someone has hacked his trust wallet, maybe the apps he downloaded are not the legitimate apps of TRUSTwallet, because hackers are good at imitating apps, they just change it a little bit that you hardly didn't notice if you are a beginner especially don't look closely at its logo. Because if you make a mistake in downloading once you type your seed phrase or password you will be unsafe from hackers for sure.So the only thing I can say is a safe wallet anyway is that if Bitcoin is what you want to collect and keep then Electrum is okay and if other assets are better than the Klever apps, I recommend it because so far I haven't faced any problem with it until now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 16, 2022, 01:31:15 PM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMis there a better wallet for holding my crypto temporarily?? i am asking about mobile wallets guyz, not about cold wallets.Since I consider mobile phones even less safe as desktop computers (especially as I use mostly Windows), I use mobile wallets only together with a hardware wallet.This being said, although Green Wallet is open source and Mycelium is not, I do prefer the way Mycelium works and that's what I use on mobile. Again, this together with a hardware wallet.If you want to risk and go without a hardware wallet, Electrum and Blue Wallet are very solid options.PS. I have Android. I don't know which of these work on iPhone; if that's the case, look up those wallets' websites and see if they work for iOS. The wallets' websites should have links to the play store, don't just search on the store since there you may find malicious clones too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "December 16, 2022, 03:23:08 PM",
      "body": "The only downloadable mobile wallets for bitcoin that I know of are Coinbase, Mycelium, Exodus, Electrum, and Guarda, all of which as far as I know are tried and tested in the cryptocurrency industry.But try to check or investigate first so that you can be sure that you are doing the right thing by downloading mobile wallets for crypto assets that you want to hold long-term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 16, 2022, 04:07:38 PM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMhello all,  i am currently using trust wallet as my main wallet. my previous wallet has been hacked by someone and that too was a trust wallet. today a friend of mine had to face to the same problem i faced.Your question is fundamentally wrong, because you should not ask \"what is the best mobile crypto wallet\", but \"how can I best protect my mobile crypto wallet\". Any mobile wallet recommended to you in previous posts will not make any significant difference if you have bad online habits, or store your seed in the wrong way.It's not all about what you use (with the open/closed source difference of course), but the way you use it. I can recommend Electrum for Android, I've been using it for years and never had a problem, but I treat my smartphone the same way as my desktop computer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "December 16, 2022, 04:26:57 PM",
      "body": "Quote from: bettercrypto on December 16, 2022, 03:23:08 PMThe only downloadable mobile wallets for bitcoin that I know of are Coinbase, Mycelium, Exodus, Electrum, and Guarda, all of which as far as I know are tried and tested in the cryptocurrency industry.There are also other, more exotic wallets, like for example BitPie, mentioned by Loyce as one of wallets (or only wallet) which support many fork coins (https://bitcointalk.org/index.php?topic=2836875.0)So, like it was said before - the problem is not in fact that there are no wallets - sometimes there are too many  The problem is if you know what to do with them (and to know limitations).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "December 16, 2022, 06:46:32 PM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMhello all,  i am currently using trust wallet as my main wallet. my previous wallet has been hacked by someone and that too was a trust wallet. today a friend of mine had to face to the same problem i faced. his wallet also was a trust wallet. why these trust wallets are being hacked?? isn't trust wallet safe?? if no why?? is there a better wallet for holding my crypto temporarily?? i am asking about mobile wallets guyz, not about cold wallets.No, something isn't automatically safe just because you stick ''trust'' or ''safe'' label on it.I wouldn't use Trust wallet for anything because they are closed source and supported by Binance, but I can't tell you why you or someone else got hacked, probably because you didn't use internet correctly and you downloaded some malware.There aren't many alternative option for mobile wallets that support shitcoins, but one of them could be unstoppable.money, that is open source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 17, 2022, 10:03:11 AM",
      "body": "Quote from: Ivartheragnarson on December 15, 2022, 05:53:20 PMmy previous wallet has been hacked by someone and that too was a trust wallet. today a friend of mine had to face to the same problem i faced. his wallet also was a trust wallet. why these trust wallets are being hacked?? isn't trust wallet safe?? Do you think it's trustworthy only because they call themselves Trust Wallet? Maybe the problem isn't in the wallet, it's in the people using them. Just because you were hacked, doesn't mean it's because of the client you used. It's possible to get your Trust Wallet hacked, but it's also possible to get Electrum, Bitcoin Core, or even a paper wallet \"hacked\" if they weren't set up properly, if you used a fake website, or a vulnerable system.     The safety of your coins greatly depends on you. It depends on what other software you use, what you do on the Internet, how good/bad your common sense is, etc. You never mentioned what coins you have and do you even need a multi-coin wallet in the first place? If you only have bitcoin, there is no need for a multi currency wallet when you have standalone clients that are good and safe.Quote from: Charles-Tim on December 15, 2022, 11:55:04 PMI have not used Guarda wallet before, but know that if a wallet is a web wallet and you can connect to it using a web browser, that means it is only just having a mobile app, it is not a mobile wallet, but a web wallet. I have never used Guarda myself, but I know that it supports both desktop and mobile devices. Guarda has connections with Atomic Wallet, and ChangeNOW, which have been known to selectively scam in the past. It's not a good option for your coins and tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 17, 2022, 10:52:12 AM",
      "body": "Quote from: Pmalek on December 17, 2022, 10:03:11 AMDo you think it's trustworthy only because they call themselves Trust Wallet?You see, maybe there is something in the name, and whoever designed that crypto wallet chose a perfect name that has a great influence when deciding which wallet to use. Of course, the constant promotion since that wallet was bought by a well-known CEX also helped.What the average Joe (like the OP) is sure to ask every time is \"how come the Trust wallet is not trusted after all?\" I hope that something similar to what happened with Electrum will never happen with that wallet, because it seems to me that a lot of people keep their coins in that wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 17, 2022, 11:09:51 AM",
      "body": "Quote from: NotATether on December 15, 2022, 06:11:59 PMYou can try MyCelium (for iOS I believe - I've used that before), Or you can use Blockstream Green or Muun Wallet. Additionally, if you are using Android, you also have Electrum and Bitcoin Wallet for Android as options.I recommend staying away from Green Wallet, it offers a multi-signature wallet hence higher fees and technical knowledge (by creating a 3 out of 2 wallet) so you have full access to your coins.So for bitcoin the best solution is bluewallet and MyCelium for Android & IOS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 17, 2022, 05:13:47 PM",
      "body": "Quote from: Lucius on December 17, 2022, 10:52:12 AMYou see, maybe there is something in the name, and whoever designed that crypto wallet chose a perfect name that has a great influence when deciding which wallet to use. Of course, the constant promotion since that wallet was bought by a well-known CEX also helped. A strong brand name is a powerful weapon, especially if you couple that with plenty of money to splash out on promotion and raising brand awareness. Trust Wallet sounds good. They knew what they were doing selecting that name. If they had selected Fart Wallet, the affect would have been completely different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}