{
  "id": "topic_5454513",
  "title": "cygan",
  "author": "cygan",
  "created_time": "May 30, 2023, 12:25:18 PM",
  "content": "Autor: CyrusWątek oryginalny: [Bitcointalk Party - Discord sv] Bitcoin Pizza bake-off contest! Enter by June 1Znów nadszedł ten czas! Tegoroczny konkurs Bitcoin Pizza został ogłoszony! Konkurs rozpoczyna się teraz i kończy się 1 czerwca, kiedy to rozpoczyna się głosowanie. Głosowanie zakończy się 10 czerwca. 11:59 GMT we wszystkie dniAby zapoznać się z zasadami i wziąć udział, dołącz do kanału #pizza-day-event-2023 (zaproszenie w OP).Struktura konkursu jest taka sama jak poprzednich, które można zobaczyć odpowiednio na kanałach #pizza-day-event-2022, #pizza-day-event-2021 i #pizza-day-event-2020.Tegoroczne nagrody obejmują:Odznaka Bitcoin Pizza Bitcointalk na 1 rok (możemy przyznać kilka dodatkowych odznak przez ograniczony czas)Betnomi Custom Ledger Nano X7 12mBTCPonieważ pula nagród w BTC wzrosła, zostanie przyznane pierwsze miejsce, drugie miejsce i być może kilka dodatkowych nagród w zależności od przebiegu konkursu.Skontaktuj się ze z Cyrus'em, jeśli chcesz dołożyć się do puli nagród.Kto odważy się ukraść Odznakę Pizzy @fillippone? Czy uda mu się obronić tytuł? Możesz głosować!Podziękowania dla theymos za wsparcie wydarzenia dodatkowym 5mBTC, Betnomi za nagrodę fizyczną, a zwłaszcza Laszlo za zaspokojenie naszego apetytu na pizzę!Nie wiem jak Wy, ale ja nagle nabrałem ochoty na pizzę.Tłumaczenie wykonane w ramach inicjatywy AOBT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454513",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 01, 2023, 06:02:54 AM",
      "body": "Mamma mia! co ja widzę. Ostatnie 2 tyg się specjalizowałem w robieniu pizzy i doszedłem, moim zdaniem, do perfekcji jaką można osiągnąc przy pomocy domowego piekarnika. Uczyłem się u najlepszych. U prawdziwego włocha Vito Iacopelli by moje napoletana była jak najlepsza. Już cała rodzina nie może patrzeć na tego placka od ilości pizz jakie zjedli ostatnio... a dziś dowiaduję się o konkursie? No weź panie Cygan XD Tłumaczenie można było zrobić tydzień temu  Zaczyn musi leżeć co najmniej do jutra w lodówce ... a i tak nie będzie komu tego jeść.A konkurencja ... jak widzę w OP robi pizzę z bananem i dżemem!Dzięki za tłumaczenie  Na przyszły rok będę gotowy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "June 30, 2023, 10:33:26 PM",
      "body": "Quote from: Tytanowy Janusz on June 01, 2023, 06:02:54 AM...Ostatnie 2 tyg się specjalizowałem w robieniu pizzy i doszedłem, moim zdaniem, do perfekcji jaką można osiągnąc przy pomocy domowego piekarnika. Uczyłem się u najlepszych...teraz to juz nie moze byc inaczej, pochwal sie przepisem!!!jak zrobic taką napoletane a la maestro?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 03, 2023, 02:30:16 PM",
      "body": "Kluczem jest dobra hydratacja (stosunek wody do mąki 1:1.5 wydaje się idealny), nastawienie drożdzy co najmniej dobę wcześniej i dużo serca przy ugniataniu i formowaniu ciasta. Trzeba wiedzieć jak chwycić by tak wilgotne ciasto się nie lepiło do rąk, jak formować kulki ciasta by stworzyć coś w rodzaju balona itp. To jest sztuka a nie rzemiosło  Świetnie opisane w poniższym filmie.https://www.youtube.com/watch?v=G-jPoROGHGE&ab_channel=VitoIacopelli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "July 04, 2023, 06:21:53 AM",
      "body": "Quote from: Tytanowy Janusz on July 03, 2023, 02:30:16 PMKluczem jest dobra hydratacja (stosunek wody do mąki 1:1.5 wydaje się idealny), nastawienie drożdzy co najmniej dobę wcześniej i dużo serca przy ugniataniu i formowaniu ciasta. Trzeba wiedzieć jak chwycić by tak wilgotne ciasto się nie lepiło do rąk, jak formować kulki ciasta by stworzyć coś w rodzaju balona itp. To jest sztuka a nie rzemiosło  Świetnie opisane w poniższym filmie.https://www.youtube.com/watch?v=G-jPoROGHGE&ab_channel=VitoIacopellibardzo dzieki, zobacze moze dzisiaj wyprubuje a jak nie dzisiaj to na pewno niedługowracajac do konkursu on trwa jeszcze? nie widze nowych zdjec od partycypantów tylko kilka stron dyskusji o pizzy z AI, wiecej juz nie miałem czasu czytac",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 04, 2023, 06:45:54 AM",
      "body": "Quote from: wwzsocki on July 04, 2023, 06:21:53 AMwracajac do konkursu on trwa jeszcze? To był event związany ze świętem pizzy jakie obchodzą bitcoinowcy w celu upamiętnienia dnia, w którym Laszlo Hanyecz kupił 2 pizze za 10 000 BTC (obecnie 320 mln $). Trwał nieco ponad tydzień i skończył się 1szego czerwca.Quote from: wwzsocki on July 04, 2023, 06:21:53 AMbardzo dzieki, zobacze moze dzisiaj wyprubuje a jak nie dzisiaj to na pewno niedługoJak najdzie cię ochota to nastaw drożdze (2 min roboty). A kolejnego dnia będziesz miał pyszną pizzę.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}