{
  "id": "topic_5450116",
  "title": "Flexystar",
  "author": "Flexystar",
  "created_time": "April 25, 2023, 01:13:56 PM",
  "content": "I don't think anyone would deny the fact that the title mentions it here. Read an article that depicts the thoughts of Bitcoin bull Chamath Palihapitiya from the U.S. The guy has outplayed in the bitcoin investments during his career and has time to time believed that bitcoin is worth $100K or followed by a $200K benchmark in the future. However, with ever-increasing regulatory constructions over crypto and that too in the most promising country like America, things are going south now. Crypto is dead in America.  That's what Mr. Chamath said in a podcast interview. All the blame is be put on both sides which are Security Exchange Commission as well as Crypto Exchanges/banks which are being operated with malpractices all the time. However, various exchangers stated clearly that if the crypto regulations are not plotted properly then how could they understand what is to be expected from their accounts? This is also true on one note while SEC and FED are just shooting in the air without any professional outline of the crypto laws. They are being very spurious about the crypto laws and that is one of the reasons Silicone Valley Bank failed. That is the reason why exchangers like Bittrex and Coinbase are already on the verge of shifting their offices to other viable countries. Has the American government taken any sort of oath to put down Bitcoin?My thought is, US legislation is brutally scared about bitcoin. They definitely thinking it could misplaced the American Dollar position from the market and give rise to another era of economics. They might be thinking they are losing the dollar value and it's world domination slowly. THese could be real aggreavitng factors. I am not sure what is the truth but such aggression was not expected from the top developed country like America. QuoteKEY POINTSTech investor Chamath Palihapitiya, who previously claimed bitcoin has replaced gold and would eventually get to $200,000, now says “crypto is dead in America.”“The United States authorities have firmly pointed their guns at crypto,” Palihapitiya said on the latest episode of the All-In podcast.The SEC has ramped up its enforcement of the crypto industry, bearing down on companies and projects that were allegedly selling unregistered securities. Tech investor Chamath Palihapitiya, who said two years ago that bitcoin has replaced gold and predicted the digital currency would climb to $200,000, has a much more cautious view on cryptocurrencies these days.“Crypto is dead in America,” Palihapitiya said in the latest episode of the All-In podcast.Palihapitiya blamed crypto’s demise largely on regulators, who have gotten much more aggressive in their pursuit of bad actors in the industry. Securities and Exchange Commission Chairman Gary Gensler has said crypto trading platforms should abide by strict U.S. securities laws.In answering questions in front of lawmakers recently, Gensler connected the collapse of Silicon Valley Bank with the crypto industry.“You had Gensler even blaming the banking crisis on crypto,” Palihapitiya said. “The United States authorities have firmly pointed their guns at crypto.”The SEC has ramped up its enforcement of the crypto industry, bearing down on companies and projects that the regulator alleges were selling unregistered securities. In February, the agency proposed rules that would change which crypto firms can custody customer assets. In March, the SEC issued crypto exchange Coinbase a Wells notice — typically one of the final steps before it files charges — warning the company that it identified potential violations of U.S. securities law. Last week, the SEC charged the crypto asset trading platform Bittrex and its ex-CEO with operating an unregistered exchange.Coinbase CEO Brian Armstrong told CNBC that his company is preparing for a yearslong court battle with the commission, and is also considering relocating outside the U.S. if it doesn’t get improved regulatory clarity. Meanwhile, Bittrex has already announced it would wind down U.S. operations specifically due to “continued regulatory uncertainty.”They “were probably the ones that were the most threatening to the establishment,” said Palihapitiya, referring to crypto companies. “And they were the ones that, in fairness to the regulators, did push the boundaries more than any other sector of the startup economy.”“Now they’re paying the price for that,” he said. “The bill has come due for them.”Gensler faced similar criticism from House Republicans over the agency’s crackdown on cryptocurrency platforms during four hours of congressional testimony last week.“Regulation by enforcement is not sufficient nor sustainable,” said House Financial Services Committee Chairman Rep. Patrick McHenry, R-N.C. “You’re punishing digital asset firms for allegedly not adhering to the law when they don’t know it will apply to them.”McHenry said the SEC’s approach was “driving innovation overseas and endangering American competitiveness.”Gensler defended the agency’s actions.“We have a clear regulatory framework built up over 90 years,” he said, adding that the exchanges “are “noncompliant generally, and they need to come into compliance.”Bitcoin, the largest cryptocurrency, reached a record of about $69,000 in November 2021, when the Federal Reserve’s benchmark interest rate was near zero and investors were flooding into risk. The market changed in a hurry last year, as the Fed began steadily raising rates to fight inflation.In early 2021, Palihapitiya predicted on CNBC that bitcoin would rise from $39,000 at the time to $100,000 and then up to $200,000.“In what period, I don’t know,” he said. “Five years, 10 years, but it’s going there. And the reason is because every time you see all of this stuff happening, it just reminds you that, wow, our leaders are not as trustworthy and reliable as they used to be.”Later in 2021, just before the peak, he said bitcoin had “effectively replaced gold.”Bitcoin is currently trading at just over $27,300, down 60% from its all-time high.‘Crypto is dead in America,’ says longtime bitcoin bull Chamath Palihapitiya",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450116",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "April 25, 2023, 01:32:57 PM",
      "body": "Maybe they are actually scared that bitcoin would destroy the financial system that they have built in the last century. I'm also thinking that they have a mandate to collect money from different companies since the economy isn't looking good. They understand that crypto has done well over the past years despite the pandemic so they're probably thinking they're a cash cow. What better way to do that than filing lawsuits and wait until these companies agree to a settlement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "woez",
      "created_time": "April 25, 2023, 01:52:32 PM",
      "body": "Quote from: Flexystar on April 25, 2023, 01:13:56 PMHas the American government taken any sort of oath to put down Bitcoin?My thought is, US legislation is brutally scared about bitcoin. They definitely thinking it could misplaced the American Dollar position from the market and give rise to another era of economics. They might be thinking they are losing the dollar value and it's world domination slowly. THese could be real aggreavitng factors. I am not sure what is the truth but such aggression was not expected from the top developed country like America. To my knowledge the US government has not yet taken an oath to put down Bitcoin and it is quite possible that some policy makers and regulators are concerned about the potential impact of Bitcoin on the traditional financial system so they may view Bitcoin as a threat to the stability of the US dollar and the global economy and quite rightly that is the role of government is to protect the public and maintain the stability of the financial system, so that their attitude towards Bitcoin can be understood meaning they also have the effort to consider the potential benefits of cryptocurrencies and the role they can play in the financial future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "April 25, 2023, 01:55:46 PM",
      "body": "It's surprising to see US changing their stance on cryptocurrency front. America was known as a capitalist country. Doing business was pretty easy there. But it seems they are slowly becoming conservative in many areas. Crypto is definitely one of them.But that's fine for the crypto market itself. Because if businesses see such issues in US, they are going to move their operations to some crypto friendly country countries like Singapore. Because, I am sure no one would want any regulatory hassles down the line. It's a great opportunity loss for US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "April 25, 2023, 02:02:10 PM",
      "body": "If this tech investor can't distinguish between genuine crypto and the third party middlemen exploiting crypto, then they're in the wrong business.  It doesn't matter if the SEC targets custodian \"services\".  Crypto was never designed to be used in that fashion.  You aren't meant to trust third parties and treat them like banks to hold your funds for you.  Centralised Exchanges are a vestige of traditional finance.  Something we shouldn't be looking to replicate in crypto.  They introduce too many points of failure and are too easily shut down by regulators.  It's far better when things can be done at protocol level.  More resistant to regulatory shutdown, fewer points of failure, better privacy and security for users and many other benefits.  Over time, crypto will naturally gravitate towards protocols, simply because they are more robust. As for Chamath Palihapitiya, all I'm hearing is a whiny speculator who looks a bit silly for making outlandish predictions.  And now they're lashing out and blaming others for the fact that they didn't understand any of this as well as they thought they did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "April 25, 2023, 02:09:11 PM",
      "body": "At least entities are starting to stand up to the government. Coinbase is now suing the SEC for legal clarity along with GBTC suing to become a spot ETF. It sure seems like the government is getting called out on their anti-crypto stance. I think with enough noise we may even see some turnover in some high government regulatory positions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "April 25, 2023, 02:12:54 PM",
      "body": "I've just watched John Oliver's recent piece on cryptos which IMO is also indicative on the US crypto climate, considering that it's a show watched by millions within just a couple of days. It's sad to watch it all unravel, but it does seem that even a talk show that's generally critical of the US government on many points focuses only on 3 cases of scams, of people losing a lot of money, and makes an argument NOT to regulate the crypto industry further, but only with a goal of not giving the market even more legitimacy. Whether they decide to go for more regulations or not, the atmosphere of crypto being associated with scams and other financial crimes seems pretty strong in the USA, unfortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "April 25, 2023, 02:20:37 PM",
      "body": "Chair Gensler continues his contradictory statements regarding the classification of specific digital assets.You can watch more short videos about that in the Congressional hearing days ago at https://twitter.com/FinancialCmteIf you have time to watch the full video, watch there: SEC Chair Gary Gensler Testifies In Front Of House Financial Services CommitteeGensler failed to protect the USA. investors and failed to build new regulatory documents after a few years as a Chair of SEC. What Mr. McHenry told is true and what lot of questions during the hearing, we see that SEC and Gensler are not fully powerful to do whatever they want in the USA. I believe in the USA. cryptocurrency and cryptocurrency companies are welcome to develop and have operations there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "April 25, 2023, 02:38:20 PM",
      "body": "Quote from: tranthidung on April 25, 2023, 02:20:37 PMChair Gensler continues his contradictory statements regarding the classification of specific digital assets.You can watch more short videos about that in the Congressional hearing days ago at https://twitter.com/FinancialCmteIf you have time to watch the full video, watch there: SEC Chair Gary Gensler Testifies In Front Of House Financial Services CommitteeGensler failed to protect the USA. investors and failed to build new regulatory documents after a few years as a Chair of SEC. What Mr. McHenry told is true and what lot of questions during the hearing, we see that SEC and Gensler are not fully powerful to do whatever they want in the USA. I believe in the USA. cryptocurrency and cryptocurrency companies are welcome to develop and have operations there. I second that. You know, most of these 'law enforcers' seldom understand what they are enforcing. I really don't get Gensler tho, I mean he owns no crypto assets but can regulate and make rules concerning it? With such actions displayed by the SEC, it just proves how desperate these agencies are to snuff out Bitcoin's existence. It looks like a failing effort to me tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 28, 2023, 01:41:26 AM",
      "body": "@Flexystar  is a new level of @Hydrogen I don't like people who quote long articles. What is happening now is positive in the long run. Whenever individuals decide that using Bitcoin and cryptocurrencies is not like banks, and that you must believe in central platforms that ask you to verify your identity, you are completely away from the essence of these currencies.And if Bitcoin is able to coexist with all the restrictions imposed, then this should increase confidence in it as a tool for conducting peer-to-peer trading without the need to trust a third party.It is an opportunity for these companies to escape from the United States and find new investment opportunities. Perhaps it is one of the few times that we do not see the United States attractive in terms of capital management.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "April 28, 2023, 02:16:46 AM",
      "body": "Quote from: Majestic-milf on April 25, 2023, 02:38:20 PM I second that. You know, most of these 'law enforcers' seldom understand what they are enforcing. I really don't get Gensler tho, I mean he owns no crypto assets but can regulate and make rules concerning it? With such actions displayed by the SEC, it just proves how desperate these agencies are to snuff out Bitcoin's existence. It looks like a failing effort to me tho.I believe in the USA. 2024 President election, cryptocurrency will have a bigger part in candidate election propaganda.Honestly, we can not know why Gensler did that, only he knew what he is doing and why as well as whether there are people ordered those stuffs for Gensler to execute it. Fortunately, with the latest hearing we can see that Chair Gensler is not has power to freely do what he want.I don't trust what Gensler told in his video, press conferences or in the hearing. Time will tell us what happened with SEC and Gensler recent years.Quote from: Husires on April 28, 2023, 01:41:26 AMWhat is happening now is positive in the long run. Whenever individuals decide that using Bitcoin and cryptocurrencies is not like banks, and that you must believe in central platforms that ask you to verify your identity, you are completely away from the essence of these currencies.From questions in the hearing, we can see that many people in the USA. Congress did not want SEC and Gensler continue to do what they are doing very arbitrarily and somewhat escalating from their given power. It is positive signal we got from the hearing and it can be start of something better for cryptocurrency regulatory environment in the nation.QuoteIt is an opportunity for these companies to escape from the United States and find new investment opportunities. Perhaps it is one of the few times that we do not see the United States attractive in terms of capital management.It's their chance to reshuffle their resources, find new target customer population and of course we should not exclude that in future they will move back to the USA that is a very big market for any company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "April 28, 2023, 02:25:49 AM",
      "body": "Crypto, of course, is very much alive in America notwithstanding the regulatory confusion and the seemingly hostile environment. I think the US is still in the learning process. In fairness, there is deliberation happening. Even in congress, there are legislators criticizing and defending crypto. That's actually a lot better than in other countries where a ban could be issued all of a sudden without careful deliberation. I guess the problem in the US is that while they are still in the middle of familiarizing crypto and studying which regulatory policy is apt, they are already filing lawsuits, imposing fines, doing investigations, and the like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "April 28, 2023, 03:25:11 AM",
      "body": "Quote from: DooMAD on April 25, 2023, 02:02:10 PMIf this tech investor can't distinguish between genuine crypto and the third party middlemen exploiting crypto, then they're in the wrong business.  It doesn't matter if the SEC targets custodian \"services\".  Crypto was never designed to be used in that fashion.  You aren't meant to trust third parties and treat them like banks to hold your funds for you.  Centralised Exchanges are a vestige of traditional finance.  Something we shouldn't be looking to replicate in crypto.  They introduce too many points of failure and are too easily shut down by regulators.  It's far better when things can be done at protocol level.  More resistant to regulatory shutdown, fewer points of failure, better privacy and security for users and many other benefits.  Over time, crypto will naturally gravitate towards protocols, simply because they are more robust. Do you think that legislation will allow cryptocurrencies (basically bitcoin) to function as Satoshi intended? I don't know where you live, but the trend in Europe is to have to report all transactions, and Spain has recently passed a law that obliges all companies that provide cryptocurrency services to report each and every one of their clients' transactions to the tax authorities, even if they are just a few satoshis. This is in addition to the obligation that already existed for users, but since many users didn't report, companies are now obliged to do so. In Europe, the MICA regulation establishes a difference for transactions of more than €1,000, that require full KYC, and those of less than €1,000 where 'only' asks for sender and receiver names. We'll have to see how this plays out, but if it requires names to be verified, and if it doesn't at first it will require it eventually, forget about using bitcoin as it was intended. To what Chamath Palihapitiya says, 'Crypto is dead in America' I would add: 'and in the EU too'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "April 28, 2023, 05:12:55 PM",
      "body": "The US government is just scared of losing the value of dollar to bitcoin because they have seen it coming. This is why they are investigating and looking for a means not to let it happen but they have little or no knowledge to prevent this. Bitcoin decentralized nature has made it impossible for governments to stop its adoption due to the fact that it uses p2p payment system and all transactions done remains anonymous in terms of the identity of the persons involved. From my own side,the US is still a bitcoin friendly country for them to have more miners and more citizens investing into bitcoin that ever. If they put regulatory on bitcoin can will destroy its potential in the US, businesses will be  moving down to a bitcoin friendly country to continue their business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "April 28, 2023, 06:04:15 PM",
      "body": "Quote from: Don Pedro Dinero on April 28, 2023, 03:25:11 AMSpain has recently passed a law that obliges all companies that provide cryptocurrency services to report each and every one of their clients' transactions to the tax authoritiesExactly.  \"Services\" and \"Clients\".  That's the weak link.  That's what we're doing wrong.  It ideally works better as Protocols and Users.  Then there's no one who can be coerced to report anything.  That's how we're meant to be doing it.  Stop putting middlemen into the equation and it instantly becomes more robust to regulatory and legal interference.Nation states are only doing what they were always going to do.  And we're making it too easy for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "southerngentuk",
      "created_time": "April 28, 2023, 06:32:06 PM",
      "body": "Some politicians and business leaders have embraced the potential of cryptocurrencies, particularly in terms of their ability to facilitate fast and secure cross-border transactions and promote financial inclusion. Additionally, some American companies have invested heavily in cryptocurrencies, including Tesla's purchase of $1.5 billion in Bitcoin and Square's acquisition of $50 million worth of Bitcoin. Overall, the relationship between America and the cryptocurrency industry has been complex, with a mix of support and skepticism from various government officials and regulatory bodies. So, it remains to be seen how the government will ultimately regulate and approach the use of cryptocurrencies in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "April 28, 2023, 07:02:09 PM",
      "body": "The US government has been suppressing the adoption thru Gensler but even so BTC adoption still is winning gradually. Chamath isn't the only who have been speaking in public about crypto companies leaving US because the lack of regulatory clarity. They are all aware they are losing because of the bank crisis.The constant threat of lawsuit to tech companies like Coinbase would really make then plan of leaving the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotHatinJustTrollin",
      "created_time": "April 28, 2023, 07:05:14 PM",
      "body": "Quote from: Flexystar on April 25, 2023, 01:13:56 PMI don't think anyone would deny the fact that the title mentions it here. Read an article that depicts the thoughts of Bitcoin bull Chamath Palihapitiya from the U.S. The guy has outplayed in the bitcoin investments during his career and has time to time believed that bitcoin is worth $100K or followed by a $200K benchmark in the future. However, with ever-increasing regulatory constructions over crypto and that too in the most promising country like America, things are going south now. Crypto is dead in America.  That's what Mr. Chamath said in a podcast interview. All the blame is be put on both sides which are Security Exchange Commission as well as Crypto Exchanges/banks which are being operated with malpractices all the time. However, various exchangers stated clearly that if the crypto regulations are not plotted properly then how could they understand what is to be expected from their accounts? This is also true on one note while SEC and FED are just shooting in the air without any professional outline of the crypto laws. They are being very spurious about the crypto laws and that is one of the reasons Silicone Valley Bank failed. That is the reason why exchangers like Bittrex and Coinbase are already on the verge of shifting their offices to other viable countries. Has the American government taken any sort of oath to put down Bitcoin?My thought is, US legislation is brutally scared about bitcoin. They definitely thinking it could misplaced the American Dollar position from the market and give rise to another era of economics. They might be thinking they are losing the dollar value and it's world domination slowly. THese could be real aggreavitng factors. I am not sure what is the truth but such aggression was not expected from the top developed country like America. QuoteKEY POINTSTech investor Chamath Palihapitiya, who previously claimed bitcoin has replaced gold and would eventually get to $200,000, now says “crypto is dead in America.”“The United States authorities have firmly pointed their guns at crypto,” Palihapitiya said on the latest episode of the All-In podcast.The SEC has ramped up its enforcement of the crypto industry, bearing down on companies and projects that were allegedly selling unregistered securities. Tech investor Chamath Palihapitiya, who said two years ago that bitcoin has replaced gold and predicted the digital currency would climb to $200,000, has a much more cautious view on cryptocurrencies these days.“Crypto is dead in America,” Palihapitiya said in the latest episode of the All-In podcast.Palihapitiya blamed crypto’s demise largely on regulators, who have gotten much more aggressive in their pursuit of bad actors in the industry. Securities and Exchange Commission Chairman Gary Gensler has said crypto trading platforms should abide by strict U.S. securities laws.In answering questions in front of lawmakers recently, Gensler connected the collapse of Silicon Valley Bank with the crypto industry.“You had Gensler even blaming the banking crisis on crypto,” Palihapitiya said. “The United States authorities have firmly pointed their guns at crypto.”The SEC has ramped up its enforcement of the crypto industry, bearing down on companies and projects that the regulator alleges were selling unregistered securities. In February, the agency proposed rules that would change which crypto firms can custody customer assets. In March, the SEC issued crypto exchange Coinbase a Wells notice — typically one of the final steps before it files charges — warning the company that it identified potential violations of U.S. securities law. Last week, the SEC charged the crypto asset trading platform Bittrex and its ex-CEO with operating an unregistered exchange.Coinbase CEO Brian Armstrong told CNBC that his company is preparing for a yearslong court battle with the commission, and is also considering relocating outside the U.S. if it doesn’t get improved regulatory clarity. Meanwhile, Bittrex has already announced it would wind down U.S. operations specifically due to “continued regulatory uncertainty.”They “were probably the ones that were the most threatening to the establishment,” said Palihapitiya, referring to crypto companies. “And they were the ones that, in fairness to the regulators, did push the boundaries more than any other sector of the startup economy.”“Now they’re paying the price for that,” he said. “The bill has come due for them.”Gensler faced similar criticism from House Republicans over the agency’s crackdown on cryptocurrency platforms during four hours of congressional testimony last week.“Regulation by enforcement is not sufficient nor sustainable,” said House Financial Services Committee Chairman Rep. Patrick McHenry, R-N.C. “You’re punishing digital asset firms for allegedly not adhering to the law when they don’t know it will apply to them.”McHenry said the SEC’s approach was “driving innovation overseas and endangering American competitiveness.”Gensler defended the agency’s actions.“We have a clear regulatory framework built up over 90 years,” he said, adding that the exchanges “are “noncompliant generally, and they need to come into compliance.”Bitcoin, the largest cryptocurrency, reached a record of about $69,000 in November 2021, when the Federal Reserve’s benchmark interest rate was near zero and investors were flooding into risk. The market changed in a hurry last year, as the Fed began steadily raising rates to fight inflation.In early 2021, Palihapitiya predicted on CNBC that bitcoin would rise from $39,000 at the time to $100,000 and then up to $200,000.“In what period, I don’t know,” he said. “Five years, 10 years, but it’s going there. And the reason is because every time you see all of this stuff happening, it just reminds you that, wow, our leaders are not as trustworthy and reliable as they used to be.”Later in 2021, just before the peak, he said bitcoin had “effectively replaced gold.”Bitcoin is currently trading at just over $27,300, down 60% from its all-time high.‘Crypto is dead in America,’ says longtime bitcoin bull Chamath PalihapitiyaThe speculation that the American government is scared about Bitcoin and is taking aggressive actions against it is concerning. It is essential for the government to work with the industry and create a clear and consistent framework for cryptocurrencies. Without proper regulations, businesses are at risk, and the industry may not achieve its full potential. It remains to be seen how the situation will develop, but there is an urgent need for clearer guidelines and regulations to ensure the positive growth and sustainability of cryptocurrency in America.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "April 28, 2023, 07:10:27 PM",
      "body": "Quote from: southerngentuk on April 28, 2023, 06:32:06 PMSome politicians and business leaders have embraced the potential of cryptocurrencies, particularly in terms of their ability to facilitate fast and secure cross-border transactions and promote financial inclusion. Additionally, some American companies have invested heavily in cryptocurrencies, including Tesla's purchase of $1.5 billion in Bitcoin and Square's acquisition of $50 million worth of Bitcoin. Overall, the relationship between America and the cryptocurrency industry has been complex, with a mix of support and skepticism from various government officials and regulatory bodies. So, it remains to be seen how the government will ultimately regulate and approach the use of cryptocurrencies in the future.This does not really give much importance to the American relationship with the crypto on positive nodes. I mean, these are just a couple of examples that are associated with crypto and American-based companies. However, let us not forget the companies are owned by World's richest person who can literally bend the government the way he wants so no doubt they are not putting any allegations against him or his companies and shareholders thereafter. On the other hand, crypto's downfall is way more imitated than the above examples. An entire bank failed because of the SEC and FED's stringent actions and they know very well they have done big mistakes. After math is already set, many companies will flee because of this and they will reddish the economy soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "April 28, 2023, 07:16:00 PM",
      "body": "The article is all about personal thought so I wouldn't hold any weight on it.  Not because the person who is talking is a previous crypto enthusiast means it is credible and true.  If we look closely on how he delivered the statement, it is all about his personal belief with some selected example and issue that support his claim disregarding other factors that oppose his idea.About regulation, I think it is a matter of who is sitting on the higher hierarchy which can be changed every time there is an election.  So to say, crypto isn't dead  in America, just because the one sitting on the top is against cryptocurrency, it is already dead?  Look how active some parts of America in contributing to the crypto Industry and how some places in America is being rated as top mining place. Quote from: southerngentuk on April 28, 2023, 06:32:06 PMSome politicians and business leaders have embraced the potential of cryptocurrencies, particularly in terms of their ability to facilitate fast and secure cross-border transactions and promote financial inclusion. Additionally, some American companies have invested heavily in cryptocurrencies, including Tesla's purchase of $1.5 billion in Bitcoin and Square's acquisition of $50 million worth of Bitcoin. Overall, the relationship between America and the cryptocurrency industry has been complex, with a mix of support and skepticism from various government officials and regulatory bodies. So, it remains to be seen how the government will ultimately regulate and approach the use of cryptocurrencies in the future.Exactly, that is why crypto despite many oppositions still thrives in America because there is a mixed stance toward the acceptance and adoption of cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}