{
  "id": "topic_5416316",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "October 07, 2022, 02:58:56 PM",
  "content": "We are now in a era where scam devs don't care about anonymity anymore,  now they aren't willing to hide their faces, they will come out in the open, throw you some videos on YouTube and still run away with your money, if you are a newbie you need to have the following in mind when researching projects. 1. Visible team members don't mean they are scam free.2. A audited smart contract project can still scam you.3. Scammers can spend a lot on their website to make it look attractive just to make you invest your money. 4. High volume on the listed exchange doesn't make a project clean from going scam.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416316",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "October 07, 2022, 03:31:22 PM",
      "body": "If they have shown you interest that they want your digital coins by all means then prove to them you're wise enough by protecting your asset at all cost, don't trust a third party person or exchanges in handling your financial assets, avoid links referrals and cryptocurrency influencers advertisement or promotion of a project, don't be greedy or hasty for making profit, learn cryptocurrency by yourself and acquire the knowledge so that no one will come up with framed up gist to enties you have investment with them, DYOR, and finally protect your asset by using a decentralized exchange, cold storage wallets or bitcoincore for safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 07, 2022, 03:40:49 PM",
      "body": "Beginners mostly have a limited ability to research, even on legitimate projects that sometimes don't yield good results. So the simplified advice for them is:Want stable P/L (manageable) = take advantage of volatility (old established coins > trading)Want significant P/L (unmanageable)= take advantage of hype (New coins> fundraising)The choice is yours, it's that simple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 07, 2022, 04:18:10 PM",
      "body": "Quote from: Crypt0Gore on October 07, 2022, 02:58:56 PM1. Visible team members don't mean they are scam free.2. A audited smart contract project can still scam you.3. Scammers can spend a lot on their website to make it look attractive just to make you invest your money. 4. High volume on the listed exchange doesn't make a project clean from going scam. I once started a topic where I urged and encouraged forum users not to be fooled by titles. and what they see. Scammers are going the extra mile these days to ensure people believe that they are real since the old ways are becoming outdated and people are more aware and more wiser. You have to be on extra look out and on guard always as you can easily be deceived. As newbies and others not too skilled at detecting scammers and their projects, always learn to ask questions and DYOR, they can save you from making mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 07, 2022, 06:59:21 PM",
      "body": "As a Newbie give yourself time to progress. I would not want to direct you on how to swing your investment but if you don't like losing money stick to Bitcoin. This won't fail you, I know in your mind you might have weighed your pocket and Capital and thought you can't achieve anything judging by how little your capital is.But did you know with if you start now to accumulate Bitcoin as little as your can you would be doing yourself good favour for the future. Not only would it help you not to regret in fake projects or coins that failed but also you would be better off than when you started accumulating it. It's probably the surest fact in crypto-currency right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 07, 2022, 07:04:55 PM",
      "body": "Preventing scams becomes harder nowadays. Even public teams scam investors. Investing in a brand-new project becomes like gambling with your funds. Do even you know the team who will take action against them? Just investors will gossip for a few days and forget. Then invest again in a new project. Either we have to leave new projects or have to gamble. There is no other choose. But serious projects have some symptoms that would help prevent bigger losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 07, 2022, 09:04:29 PM",
      "body": "It is a pretty sad state of affairs for the cryptocurrency community at large when the vast majority of ICOs are nothing more than scams. Many crypto-enthusiasts have been living under the false belief that because the team  has proven to be legit and because the token is listed on exchanges, then they will never get scammed. But sadly, this is not the case. It is now more important than ever that investors take precautions and do their due diligence before investing in any coin offerings. Doing so will help ensure that you do not become a victim of fraud, but ironically, many investors still do not do this.Before investing in any ICO, you should research the listed team members to make sure their past record is clean and that they look reliable. You must also ensure a scam-free smart contract by auditing it with a proper company, and yes, do your own due diligence on the project and its whitepaper inside out before investing even one satoshi towards it. While researching for ICOs, it is always a good practice to do your homework.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "October 07, 2022, 09:44:50 PMLast edit: October 08, 2022, 06:23:54 PM by KingsDen",
      "body": "Quote from: The Cryptovator on October 07, 2022, 07:04:55 PMPreventing scams becomes harder nowadays. Even public teams scam investors. Investing in a brand-new project becomes like gambling with your funds. Do even you know the team who will take action against them? Just investors will gossip for a few days and forget. Then invest again in a new project. Either we have to leave new projects or have to gamble. There is no other choose. But serious projects have some symptoms that would help prevent bigger losses. You are the one that completely understand the situation we have found ourselves in this industry. Even public teams scam aswell. The best way to be safe is to assume that all new projects are scam and threat them as scammers until it is proven otherwise. Those projects you see springing up are organised by a very small niche of scammers, who after scamming successful in one project, they will reinvest a little percentage of their scam gains into another new project to continue the scam under a new umbrella, a new brand and with a modified strategy to make you believe they are new team.I have learnt my lessons the hard way and I don't wish to repeat such horrible mistakes. I no longer want to be super rich in crypto, but I just wan to be comfortable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 07, 2022, 10:10:57 PM",
      "body": "I think that most people who invest on these new projects are those people who actually knew these projects are going to run. But think differently and risks only to hype the project , go with the flow and run together with the team, or even earlier soon as they make profit and never comes back.Why i think this way? Because it's too obvious, there are lots of info you can read on how to prevent scams on google even on TVs. But you will still wonder why people are hype, still posting about the projects on twitter or everywhere and even self promoting it. Plus, new projects are really prone to getting pump and dump scheme where these smart investors make profit out of scam/suspicious projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "October 07, 2022, 11:45:27 PM",
      "body": "So many scams everywhere and we just needed to be very careful of nit falling to scam easily because many of the crypto projects we have in the market are scam why some do not have a long time existence which could bring loses if we are not that prepared to take the worse part of investing. Now that the market is down, we need to pay careful attention to the market and how we invest in cryptocurrency projects especially altcoins that are launching these days without strong peruse of the team and how far the project could go. Very hard these time around to know real projects but we need to do extra research to keep ourselves safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "October 07, 2022, 11:58:20 PM",
      "body": "Quote from: Crypt0Gore on October 07, 2022, 02:58:56 PM<snip>In my country, a fellow countrymen named Xian Gaza, is a proven scammer before. He became too known as he has out-smarted those people that were chasing him. Now he's a multi-millionaire from various projects that he launched including his own coin and his own game. Even though he was known to be a con-artist, a lot of people are still investing into his projects. Just like what you have described, this person is now became a big public influencer, and regardless of his past records, people still trusting to invest their money into him which to me is really risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 08, 2022, 01:27:46 AM",
      "body": "If I may add, if you're a newbie in the space, it probably isn't your business to venture into the risky altcoin market and other crypto investment opportunities. I think the first thing a newbie does is to learn about Bitcoin. It eventually leads to you finally buying your first amount. Leave the rest of the altcoin market to those who have already been sufficiently exposed to it. But with what's happening in there, I guess it's a lot better to just stick with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 08, 2022, 03:41:18 AM",
      "body": "The sphere of cкнзeщcurrencies is still not controlled by any government bodies (we will not go into details whether this is necessary or not) and therefore provides great opportunities for fraudulent schemes. They feel their impunity and therefore are not afraid of anything. Therefore, investing in new projects is associated with high risks and has more in common with playing in a casino than with traditional investing. The same goes for crypto exchanges. Why use those services that have no reputation? It is direct expensive to the fact that your deposit will simply not be returned. The solution to the scam problem is to only invest in safe crypto currencies like bitcoin and use the top crypto exchanges like binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 08, 2022, 09:50:20 AM",
      "body": "Quote from: Crypt0Gore on October 07, 2022, 02:58:56 PMWe are now in a era where scam devs don't care about anonymity anymore,  now they aren't willing to hide their faces, they will come out in the open, throw you some videos on YouTube and still run away with your money, if you are a newbie you need to have the following in mind when researching projects. 1. Visible team members don't mean they are scam free.2. A audited smart contract project can still scam you.3. Scammers can spend a lot on their website to make it look attractive just to make you invest your money. 4. High volume on the listed exchange doesn't make a project clean from going scam. Don't forget about their advertisers, they hire known people to give their scam projects exposure. They'll pay a lot to those advertisers and later on, the SEC will chase them for advertising a scam project. Don't be too trustworthy with celebrities or anyone famous that advertises an unknown project, always be too curious and careful when you're hyped with marketing of projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 08, 2022, 09:56:49 AM",
      "body": "Another thing is top 10 crypto listed on CMC is also scam too, take a look to LUNA. It was on the top 10 since there's huge hype, now the price suddenly crash and the coin worth -99% from the previous price.Picking an altcoin to invest among 20K coins listed on CMC is just gambling, there's no way to differentiate the legit and scam project. What do you need to do is verify the developer is a scammer or not, but as we know there's no way to verify human. They could be trusted, they could be a scammer, they could be trusted from the beginning and become a scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 08, 2022, 04:24:44 PM",
      "body": "Quote from: Crypt0Gore on October 07, 2022, 02:58:56 PM1. Visible team members don't mean they are scam free.2. A audited smart contract project can still scam you.3. Scammers can spend a lot on their website to make it look attractive just to make you invest your money. 4. High volume on the listed exchange doesn't make a project clean from going scam. That is why bitcoin is the only coin we can trust and for the fact any project which creates tokens on their own and distribute to the investors can make you to lose all your money if they want that is why we should know the supply and demand so even the creator cannot mess up if the project is really decentralized and works based on the Proof of Work so the only way to create the coin is by mining them not with the simple click.If a project is on the hype then you can consider it for short term investment and just cash it all out when you made decent profits, don't trap into the FOMO nd FUDs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 08, 2022, 07:55:05 PM",
      "body": "Quote from: KingsDen on October 07, 2022, 09:44:50 PMI have learnt my lessons the hard way and I don't wish to repeat such horrible mistakes. I no longer want to be super rich in crypto, but I just wan to be comfortable. Lol,  this really did make me laugh, mind you that i am in no way laughing at your loss, i definitely wouldn't do that because many of us actually had to learn the hard way too, it's good you no longer want to get-super rich-through-crypto, there are quite a lot of people that not only want to be super rich through crypto investment, but they want that riches to come super quick, these are the investors that are called get-rich-quick investors, more often than not they never get their wish. Having said that, i really wish many people would learn their lessons and come to the realization that there is no shortcut to success in crypto but patience, Bitcoin is a long term project, one that is sustainable and has an actual utility, people would be saving themselves the hassle if they can only buy it and hodl patiently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "October 08, 2022, 09:08:16 PM",
      "body": "I agree with the thread title that scammers use different ways to scam there victims. I think you know about twitch announcing the ban of gambling stream because of scammers using the platform to scam money. It's not just in gambling but also in investing coins or tokens. Just as what the post previous about what you have to do like investing in new coins/hype coins and old coins is very true. Not all hype are legit because some are hiding behind the hype to scam people with their so called project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "October 08, 2022, 09:10:19 PM",
      "body": "Quote from: Crypt0Gore on October 07, 2022, 02:58:56 PM3. Scammers can spend a lot on their website to make it look attractive just to make you invest your money. Scammers are going extral miles just to defraud people, scammers don't care about the amount they will pay just to get the necessary facilities to scam people, because they know the amount they will make, the way cryptocurrency is spreading the Same way scammers are increasing and they are ready to do everything possible just to scam people, that's why we have to be very careful, don't trust anybody you meet online, infact don't trust anything you see on the internet, somethings might look very real but at the end they are fake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "October 09, 2022, 12:37:28 PM",
      "body": "In short, here nothing is absolutely safe for us, everything is always risky. Protect yourself by always learning, update daily news, do your own research when investing, don't listen to anyone's advice, stay away from projects that promise high returns and especially never put all your eggs in one basket, investing with money can lose. As the market grows, it's getting harder and harder to make money and the scams are getting more and more sophisticated, so always be suspicious in all cases, never put your trust in anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}