{
  "id": "topic_5450280",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "April 26, 2023, 05:19:56 PMLast edit: April 26, 2023, 05:40:18 PM by bonfire66",
  "content": "А вот давайте представим на минуту, «что если…» Что если мы уже давным давно живем в дне сурка, и мир стоит на пороге глобальной катастрофы? Что завтра мир захватят инопланетяне, которые телепортировались с Альфа Центавры с целью отложить личинок в мозги людей, прежде всего скрепных людей, ибо их мозги представляют наиболее важный гурманский интерес со стороны пришельцев.    Но среди нас есть настоящие герои. Путин и Медведев. И примкнувший к ним Лавров. Которые уже успели побывать в будущем, и знают, как бороться с пришествием инопланетного врага. Для этого всего лишь необходимо взять Бахмут. В котором живет главный Мегамозг пришельцев, и который контролирует через 5G мозги остального населения планеты Земля.   Но настоящие патриоты не дремлют! Они уже проживали этот день, снова и снова тысячи раз. И только  Путин и его друзья понимают, что для того, чтобы сделать Человечество счастливым и истребить пришельцев, надо захватить Украину и победить там нацистов. И только после этого петля времени разомкнется, Мегамозг сдохнет в руинах Бахмута, и человечество воспрянет от гнета проклятых империалистов, которые, по-сути, наймиты инопланетян, уже несколько веков работают под прикрытием, взамен получая инопланетные технологии – ракеты, микроволновки и липосакцию.    Да, все именно так. Все достижения науки, которые мы имеем на данный момент – всего лишь грязные мерзкие отработанные инопланетные технологии, ибо для настоящего православного христианина негоже было бы придумать стиральную машину и  туалетную бумагу. А кто у нас больше всего преуспел в технологиях?  Конечно же американцы! Которым вот уже десятилетия коварные пришельцы капают на мозги путем внедрения под черепную коробку своих личинок.   Но только настоящие скрепцы, имеющие титановые скрепы внутри головы, способны противостоять инопланетной оккупации. Только истинные патриоты России, в лице партии Единой России, рискнули испытать на себе новейшую технологию защиты от инопланетного чипирования. Кто-то был в числе первых (Путин и Медведев) получили версию 1.0. А остальные, особо приближенные, получили версию 2.0. Защиты от внедрения в мозг инопланетных червей. И только те, кто подпишется на мой канал в ютюбе, получат защиту уровня 3.0 и будут получать все лайфхаки и прочие плюшки пожизненно. Приступайте!   ЗЫ, дополнение серьезности. Вы когда-нибудь слышали про астероид Бенну? Который, возможно, примерно через 120 лет врежется в Землю и наступит глобальный звездец? Я совершенно уверен, что массовые технологические прорывы XX века обусловлены тем, что нужно придумать защиту от этого астероида. Но война – это главный движитель прогресса. Когда идут воины – ученые придумывают новые технологии и в это вкладываются безумные бабки. Да, мы все умрем. Еще до падения  астероида. Но наши правнуки… они тоже хотят жить. Именно поэтому они заинтересованы в мировых войнах, в Путине и его команде, которая дала стартовый импульс очередной гонке вооружений. Которая, в итоге, приведет к новым супертехнологиям, которые, когда-нибудь, спасут остатки человечества. Но даже ни те, кто прочтет этот пост, уже никода не узнают об этом… Никогда.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450280",
  "comments": []
}