{
  "id": "topic_5424056",
  "title": "forestx",
  "author": "forestx",
  "created_time": "November 29, 2022, 10:35:05 AM",
  "content": "Is anyone else getting a message when they login in asking for more personal info regarding KYC and AMLWhat I find most shocking is they want a facial scan as well as a letter with home addressI am previously up to date with it all ie passport and photo of me with it These new requirements seem an over reachDo I need to do it, currently I am not buying btc or other coins on the platform but am day trading Can I hold it off or what is the story",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424056",
  "comments": [
    {
      "author": "palle11",
      "created_time": "November 29, 2022, 11:04:55 AM",
      "body": "That could be for verification for KYC but if you have done the verification and have been trading freely, it might just be appearing. So you can pass off if it will allow you login and do what you want to do on the exchange. Usually people that have not been successful with KYC get such notification when logging in from time to time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "November 29, 2022, 11:15:30 AM",
      "body": "Quote from: forestx on November 29, 2022, 10:35:05 AMIs anyone else getting a message when they login in asking for more personal info regarding KYC and AMLWhat I find most shocking is they want a facial scan as well as a letter with home addressI am previously up to date with it all ie passport and photo of me with it These new requirements seem an over reachDo I need to do it, currently I am not buying btc or other coins on the platform but am day trading Can I hold it off or what is the storyThis is the standard KYC procedure of Binance since they are using AI technology to verify all your documents that’s why they need full scan of your face to match it on the documents the provided. All users that undergo KYC experience that same procedure so that’s not unusual. You can try other exchange that doesn’t require KYC for a certain withdrawal and deposit limit like Bybit.I believe all exchange has this kind of verification and some has stricter requirements that you need to hold a piece of paper with date and name just to verify your picture is updated. Just use dex if you are not comfortable on KYC like Bisq.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "November 29, 2022, 01:56:22 PM",
      "body": "People from the EEA needs to undergo the new verification and refusing to do so will restrict the account, see: Why Do I Need to Re-verify My Binance Account (EEA Countries)As for holding it off, binance will give you notices before your account becomes restricted, you may refer to that. You may also check this thread for ppl's personal experiences: Binance asking for KYC, again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "forestx",
      "created_time": "November 29, 2022, 02:43:46 PM",
      "body": "seems ridiculous and a massive invasion of privacyWhats the story with forex do you need to go through all this with forex brokers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "November 29, 2022, 10:29:08 PM",
      "body": "Quote from: forestx on November 29, 2022, 02:43:46 PMseems ridiculous and a massive invasion of privacyThat's what you choose when you sign up for a centralized exchange. If you would like to continue day trading, then look for an alternative exchange that isn't strict yet. Or you could use no KYC p2p exchanges (https://kycnot.me)Quote from: forestx on November 29, 2022, 02:43:46 PMWhats the story with forex do you need to go through all this with forex brokers  Regulated forex brokers do the same",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 29, 2022, 11:57:46 PM",
      "body": "What do you mean by \"as well as a letter with home address\" is it that utility bill with your home address?I recently reset my 2FA but they only require a facial scan they never ask about the utility bill or any proof of where I live.Since you are living in EU countries with heavy AML regulation it's pretty normal.Only P2P exchange is your best option if you don't want to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "November 30, 2022, 06:06:50 AM",
      "body": "Quote from: forestx on November 29, 2022, 02:43:46 PMseems ridiculous and a massive invasion of privacyFor alternative centralized exchange with no mandatory KYC, also see: https://bitcointalk.org/index.php?topic=5414539.0Note that they can at any time request for you to verify your account. They're are also likely to get stricter over time.Quote from: BitMaxz on November 29, 2022, 11:57:46 PMI recently reset my 2FA but they only require a facial scan they never ask about the utility bill or any proof of where I live.I'd say it depends on the overall situationQuote from: https://www.binance.com/en/support/faq/how-to-verify-binance-account-eea-countries-5843ae03965047598db1023b3b1fce04Depending on your country, you might need to upload proof of address. It can be your bank statement or utility bill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 30, 2022, 12:50:10 PM",
      "body": "Quote from: Potato Chips on November 30, 2022, 06:06:50 AMFor alternative centralized exchange with no mandatory KYC, also see: https://bitcointalk.org/index.php?topic=5414539.0Note that they can at any time request for you to verify your account. They're are also likely to get stricter over time.I have Binance, OKX, Huobi Global and Kucoin account. KYC is mandatory on Binance as we all know. I was unable to access Huobi derivative trading until I submitted KYC. OKX forced me to provide a mobile number when I wanted to withdraw, but that is still cool because that can still be done in a way it will not link to my real identity. I do not know much yet about Kucoin because I opened it two weeks ago, maybe the exchange will still make something pertaining to KYC mandatory or not, only email and password was required for sign up just like login in, it is the most recognized among those no KYC centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "November 30, 2022, 08:53:01 PM",
      "body": "Quote from: Oshosondy on November 30, 2022, 12:50:10 PMI have Binance, OKX, Huobi Global and Kucoin account. KYC is mandatory on Binance as we all know. I was unable to access Huobi derivative trading until I submitted KYC. OKX forced me to provide a mobile number when I wanted to withdraw, but that is still cool because that can still be done in a way it will not link to my real identity. I do not know much yet about Kucoin because I opened it two weeks ago, maybe the exchange will still make something pertaining to KYC mandatory or not, only email and password was required for sign up just like login in, it is the most recognized among those no KYC centralized exchanges.I have to say KYC is not a trouble if you are dealing with exchanges because maybe you and I may not have millions in there, but the overall funds are in billions there, which means they are asking for KYC not for just legal reasons but because they would like to protect you as well.If something goes wrong then they may ask for your KYC and request it again, this way you will be able to provide it again because you are still you, whereas someone else can't provide it because they are not you. This is why it's good, I had this back in the day in around 2017 I think, or maybe 2018 where someone tried to hack into my account and they were asked for a photo ID with current date, and they couldn't of course so they failed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "November 30, 2022, 08:56:18 PM",
      "body": "I've gone through the same process months ago and I have no choice because the only option left for me is to withdraw if I don't comply. You can resist that if you want to and just go to some other exchange and continue trading there. But if you find it a hassle, guess what? You have no choice but to do the same thing as many of us have done and that is to comply with that requirement. Because if you don't do so, your account will have limited features and likely you'll be halted to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 02, 2022, 09:15:03 AM",
      "body": "Find another Exchange respecting your privacy.  The world does not stop at Binance.  There are other great Exchanges out there that still do not oblige you to complete Know Your Customer procedures.  If you think that is an overreach, it is and others should not convince you otherwise.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 02, 2022, 02:40:04 PM",
      "body": "Quote from: Bitcoin_Arena on November 29, 2022, 10:29:08 PMQuote from: forestx on November 29, 2022, 02:43:46 PMseems ridiculous and a massive invasion of privacyThat's what you choose when you sign up for a centralized exchange. If you would like to continue day trading, then look for an alternative exchange that isn't strict yet. Or you could use no KYC p2p exchanges (https://kycnot.me)Almost all of those are instant exchanges, day trading with 0.5-1% fees on each trade would mean losing money for any trader or switching from day to weekly to allow at least a 3-5% swing to make a profit. People that day trade on major CEX with huge volumes can't sometimes wait for even one block confirmation before they buy or sell again.Take one of those p2p rated 9/10, bets offer for me right now is 16620.37 EUR per BTC, and the spot price is 16,133.54, already losing 3%.If you want to DCA or just cash in some profits after a good week yeah, but day trading, no way!Quote from: forestx on November 29, 2022, 10:35:05 AMDo I need to do it, currently I am not buying btc or other coins on the platform but am day trading Withdraw only should mean no trading also, otherwise what's actually blocked, only deposits?I have my account also disabled but funny enough my card with ~2$ on it still worked as I bought for fun a bottle of Pepsi in the gas station.Unfortunately, I can't test trade anymore since I don't hold even 1$ minimum to see if it still works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 02, 2022, 04:42:22 PM",
      "body": "Quote from: forestx on November 29, 2022, 10:35:05 AMIs anyone else getting a message when they login in asking for more personal info regarding KYC and AMLWhat I find most shocking is they want a facial scan as well as a letter with home addressSame here, I've got the same email in which they are asking both ID/passport and facial scan. Quote from: forestx on November 29, 2022, 10:35:05 AMDo I need to do it, currently I am not buying btc or other coins on the platform but am day trading Can I hold it off or what is the storyIf you plan to continue trade there then yes, you will have to do it as depositing will be disabled in 10 days and withdrawal in 30. Regarding holding it off , I've got until 29.12 to do it so I guess you got the same deadline as well. Quote from: PrivacyG on December 02, 2022, 09:15:03 AMFind another Exchange respecting your privacy.  The world does not stop at Binance.  There are other great Exchanges out there that still do not oblige you to complete Know Your Customer procedures.  If you think that is an overreach, it is and others should not convince you otherwise.He already did KYC at Binance so there's not much left to give, except the proof of address thing. Questions is, are there any CEX exchanges left where active traders can trade without fear of being asked for their documents? Especially if trader is dealing with bigger amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "December 02, 2022, 06:49:28 PM",
      "body": "In that case you might need to check whether you have surpassed the given transaction limits for your account. The KYC is usually asked for various limits and that have been already mentioned on the binance website clearly. In fact when you are exchanging the coins there is also metered bar which tells you, your daily limit of transaction. If you are crossing that one then they might be asking you for the KYC. However, the only issue in your case is, you saying you have already submitted the passport which is weird because that should be enough for your full kyc. Better ask the staff/official person from Binance if there is anything suspicious going on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "December 02, 2022, 08:55:52 PM",
      "body": "This is a worst KYC when they started to ask for a selfie and a supporting documents, usually user started to avoid these kind of exchanges and your only option is to comply or if you can still access your account then better to get it now. Usually they asked for another KYC if they see huge transactions with your account, so since you’re a day trader you might hit the trigger. Binance is a good exchange but if this is not ok with you then better to ask their support for other possible option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 02, 2022, 09:35:25 PM",
      "body": "Quote from: forestx on November 29, 2022, 10:35:05 AMIs anyone else getting a message when they login in asking for more personal info regarding KYC and AMLWhat I find most shocking is they want a facial scan as well as a letter with home addressI am previously up to date with it all ie passport and photo of me with it These new requirements seem an over reachDo I need to do it, currently I am not buying btc or other coins on the platform but am day trading Can I hold it off or what is the storyYou are from the European Union countries, it is different for us, they ask for this information to pass KYC to prevent criminals and terrorists from using their funds on the exchange platform, what they do is a security precaution so that they are not legally held accountable, I see that you are a day trader so you do many trades a day with amounts varying, which showed their system that there were unusual trades by someone, so they had to request these documents and information from you again, you should not worry if your funds are legitimate and submit the required documents, or you can trade on exchange platforms that do not require the passing of KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "December 02, 2022, 09:39:14 PM",
      "body": "If Binance started to asked for another KYC details probably they are updating your info and maybe you are trading with a lot of money which requires for another KYC, and with this you can submit it or choose not to. Even if Binance is a top crypto exchanges i will also hesitant to provide any documents pertaining to myself, asked for a reason and ask if there another way either to lower your limit or withdrawals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seleme",
      "created_time": "December 02, 2022, 09:57:51 PMLast edit: December 05, 2022, 10:21:40 PM by seleme",
      "body": "Quote from: goaldigger on December 02, 2022, 09:39:14 PMIf Binance started to asked for another KYC details probably they are updating your info and maybe you are trading with a lot of money which requires for another KYC, and with this you can submit it or choose not to. Even if Binance is a top crypto exchanges i will also hesitant to provide any documents pertaining to myself, asked for a reason and ask if there another way either to lower your limit or withdrawals. They have updated their KYC partner and now many users from EU has faced similar KYC pop-up logging in Binance exchange. IDNOW team is responsible for proving user identity and my friend has passed this step after 7 failed attempts, after talking to company representative they have confirmed mentioned info then manually approved KYC. Better to ask from Binance support and they will clarify all raised questions during KYC verification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "December 03, 2022, 12:07:29 AM",
      "body": "Have you asked them which law in the EU requires a facial scan and etc? I tried to read some news, the latest one seems to be the Markets in Crypto-assets regulation (MiCA) but it is unclear how it affects exchange and its KYC process. On the surface it sounds more like it is intended to increase the awareness of retail traders about crypto trading risk, forcing exchanges to make education or other similar stuff (at least that's how I interpreted it), not making exchange require more personal info to register.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}