{
  "id": "topic_5458336",
  "title": "FiveG",
  "author": "FiveG",
  "created_time": "July 02, 2023, 03:40:00 PM",
  "content": "I saw something on a friend of mine iPhone I was amazed, this guy has 3 pieces of bitcoin but he didn't look it when you look at him with mere eyes, I ask him how he has come this far, he told long ego he was seriously investing on all kinds of coins with little amount of bitcoin but then most of those coins help him to realized enough amount to buy more bitcoin because that was his primary target. He normally buys those zero value coins when they appreciates it will be enough money, and that's how he convert and swag all to bitcoin and today, he has 3 piece. Is good to be diversified in your investment, somedays something good will come out of one you don't expect.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458336",
  "comments": [
    {
      "author": "palle11",
      "created_time": "July 02, 2023, 03:52:53 PM",
      "body": "Your friend is lucky. If he invested in altcoins, maybe that could be the altcoins era that is the time before 2017 when the rally for altcoins was very high. Coins like etheruem at that time were very cheap and ico scam was not that rampant.Maybe he was part of those who bought bitcoin early like 8 -10 years ago when the price was still below $1k. He is worthy of commending if he actually saw the future from the risk he took because some people saw the opportunity but felt cryptocurrency investment was all fraud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "July 02, 2023, 03:53:51 PM",
      "body": "Quote from: FiveG on July 02, 2023, 03:40:00 PMhe was seriously investing on all kinds of coins with little amount of bitcoin but then most of those coins help him to realized enough amount to buy more bitcoin because that was his primary target.  Investing in many altcoins just so you can have enough later to invest in Bitcoins is one of those bad choices that seem like a good one to someone who has little experienced in Cryptocurrency. Your friend is fortunate that his gamble on cryptocurrency paid off enough for it to go the way he planned, but it is not a good plan to take. Quote from: FiveG on July 02, 2023, 03:40:00 PM  Is good to be diversified in your investment, somedays something good will come out of one you don't expect.Do not over diversify, identify some good projects and invest in them, it does not have to be too many investments across different alts. In any cryptocurrency investment you make, alway ensure you have Bitcoins in holding. Not investing in other altcoins without any Bitcoins and then planning to invest in Bitcoins from the profit of the altcoins, that is a terrible plan that can fail easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 02, 2023, 03:56:55 PM",
      "body": "This is not related to trading discussion, but more about investing/gambling in/with altcoins which belongs to altcoin board. I can say you should invest 70% in bitcoin, 20% in ether, 30% in other altcoins. But knowing how risky altcoins are. There are some that can be so shitty in a way that the price will continue to fall. It is good to diversify though.I like your friend as the he make profit from altcoins, he knows that bitcoin is still the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "July 02, 2023, 04:14:04 PM",
      "body": "Quote from: FiveG on July 02, 2023, 03:40:00 PMI saw something on a friend of mine iPhone I was amazed, this guy has 3 pieces of bitcoin but he didn't look it when you look at him with mere eyes, I ask him how he has come this far, he told long ego he was seriously investing on all kinds of coins with little amount of bitcoin but then most of those coins help him to realized enough amount to buy more bitcoin because that was his primary target. He normally buys those zero value coins when they appreciates it will be enough money, and that's how he convert and swag all to bitcoin and today, he has 3 piece. Is good to be diversified in your investment, somedays something good will come out of one you don't expect.Profiting from different coins is a matter of luck as it is not always available. your friend is very lucky because he is able to profit from different coins and he is able to improve financially. But he should avoid altcoins now and only keep an eye on potential coins like Bitcoin, ETH as he can earn better from them. Altcoins can give him a temporary profit. but if their prices go against his predictions, then he may suffer huge losses from them which he may not have imagined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "July 02, 2023, 04:47:22 PM",
      "body": "Quote from: coinerer on July 02, 2023, 04:14:04 PMAltcoins can give him a temporary profit. but if their prices go against his predictions, then he may suffer huge losses from them which he may not have imagined.Lately I have not really heard success stories from altcoins investment at least during this particular halving. Altcoins era is really taking a dive so to invest in it at the moment is a whole lot of risk to go through. Hodling altcoins are just luck for one to come off it with same investment value but maybe something new can happen with altcoins during this halving, not an investment advise though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "July 02, 2023, 04:55:01 PM",
      "body": "Quote from: FiveG on July 02, 2023, 03:40:00 PMI saw something on a friend of mine iPhone I was amazed, this guy has 3 pieces of bitcoin but he didn't look it when you look at him with mere eyes, I ask him how he has come this far, he told long ego he was seriously investing on all kinds of coins with little amount of bitcoin but then most of those coins help him to realized enough amount to buy more bitcoin because that was his primary target. He normally buys those zero value coins when they appreciates it will be enough money, and that's how he convert and swag all to bitcoin and today, he has 3 piece. Is good to be diversified in your investment, somedays something good will come out of one you don't expect.Probably what you are talking about is Low Cap projects with good potential but it's really very hard to find such projects. I do agree with your strategy of investing in such a project and diversifying the capital in market projects. It is also very risky at least for those who are trying to start building their portfolio and exploring the market. I would recommend learning about the market gaining some facts about it and taking some experience and then jumping into whatever you want to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jasonjm",
      "created_time": "July 02, 2023, 05:35:43 PMLast edit: July 12, 2023, 05:18:06 AM by jasonjm",
      "body": "Investing in alts with nearly zero value is not always a wise option, and your friend got lucky that he did not lose all his investments. When you look at the ROI it is almost the same whether you increase your portfolio or just buy/trade BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 02, 2023, 06:27:15 PM",
      "body": "That's some motivating and encouraging story which does not mean it comes true for all of us because as you mentioned your friend invested in zero-value tokens which mostly are new tokens or meme tokens. They give huge profits if any of them got hype. And the selection of these tokens is not so easy for newbies or anyone.IDK if your friend has great knowledge of early investment in coins or he was just got lucky but the thing is he made some profit from alts and invested them to buy BTC which is good because booking profit is one thing and storing it in the valuable asset is another thing which proves he has a great mindset about investment and holding while keeping the risk low.So, I agreed with your title that we should not limit our investment and we should diversify it which reduces the risk factor and it has been proved so many times. But again great knowledge and analysis are also necessary before diversifying because it doesn't bring the same results for everyone and every time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "July 02, 2023, 06:42:07 PM",
      "body": "Quote from: FiveG on July 02, 2023, 03:40:00 PM Is good to be diversified in your investment, somedays something good will come out of one you don't expect.There is no harm in diversifying your investment in multiple cryptocurrencies because it can be advantageous at times and disadvantageous at others.The risk of investing in cryptocurrencies is particularly significant because no one knows what will happen if the team has problems, as we have seen numerous times, which invariably result in currency collapses.If you truly want to invest in other altcoins, do comprehensive study on the project, the team behind it, and the project roadmap before putting your money in; otherwise, just invest in Bitcoin and wait for your reward after a few years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 02, 2023, 06:45:55 PM",
      "body": "This is good, and I am very glad such a strategy worked out for your friend..Buying shitcoins is very risky, this seem thing is what many other investors and traders have done and lost, 99 percent of the altcoins in the market will either turn scam, be rugged pulled or will fail abruptly, so any one who manages to invest in them and end up making good profit from them should count themselves lucky, and I personally like what your the guy in question is doing, which is converting the altcoins to bitcoins as soon as he is in profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 02, 2023, 06:52:28 PM",
      "body": "It's either your friend is actually good(which is quite rare), or your friend is just lucky. If it's the latter, at some point he's going to lose out because of overconfidence and the likes. It's like gambling — roll the dice one, twice, or a few times, you can exit with a win. Play the game in a long-enough timeframe, you'll highly likely end up losing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "July 02, 2023, 06:53:52 PM",
      "body": "Well, it is, but as long as you know what you are doing. Not every investment will provide you with 100% profit. Crypto investment is risky. But with the right approach, you can make good profits out of it. Personally, I have given up on Altcoins a long time ago. Nowadays all I see is people creating all these coins out of thin air in hopes to challenge or be better than Bitcoin. But they fail in every aspect. Can't live up to their promises. And most of them are here to scam people. The era of the ALT coin is gone. I suggest investing in BTC by diversifying your amount of investment. Something like DCA. I am not saying that you can't make profits from ALTcoins nowadays, but the risks are very high. Finding a legit one that has the potential to give you profit is very slim. You need a careful approach and a well-planned investment strategy in order to gain success from those. Cryptocurrency is not the only investment you can do. There are other things that will also give you the potential for profit. Find them as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "July 02, 2023, 06:54:36 PM",
      "body": "Investing in altcoins is one of the ways to accumulate enough money to buy other good coins in the market. I know some friends too that are rich now in cryptocurrency because they participate in some airdrops and bounty programs that gwve them some crazy amount of money. I think the trend is already going because many projects team nowadays do not like to do airdrop or bounty programs, many of them prefer to do presales so that they can earn some funds from investors to do marketing and other stuff. There are still some good airdrop we can participate in that can give us some earnings but they are rare in the market because of them are now fake or scam projects to earn money from investors and run away with the funds. It is good for us to ask questions and also learn from those people that had been in the market as either investors or traders so that we can learn from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 02, 2023, 09:24:02 PM",
      "body": "Since Altcoins are just like gambling, I would say that such an approach is a lot of gambling, although sometimes if you get lucky with those Altcoins, it can help raise enough funds for you. But even before you got lucky with one, you might have been unlucky with nine. That's the reason why it's seen as gambling. If you invest in Bitcoin directly, you wouldn't have to face the risk of losing some of your funds due to failed altcoin projects. Well, it all depends on choices and decisions. Some people don't really feel threatened, even if they lose money with Altcoins you will still see them buying more, while some people, after having bad experiences with Altcoins, will just give up entirely on anything that concerns cryptocurrency.Cheers 🥂, Dr.Bitcoin_Strange 👺👺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "July 02, 2023, 09:28:03 PM",
      "body": "Quote from: jasonjm on July 02, 2023, 05:35:43 PMInvesting in alts with nearly zero value is not always a wise option, and your friend got lucky that he did not lose all his investments. When you look at the ROI it is almost the same whether you increase your portfolio or just buy/trade BTC.  Probably OP’s friend invested when the time altcoins easily surge high because they are hyped and maybe those were established altcoins that time, unlike today that if you chose to invest in altcoins, expect that you’ll be more susceptible to losses especially if you got easily lured by those promising projects that are too good to be true. However, it’s clear that he’s not totally dependent on altcoins but in order to maximize his bitcoin investment, he need some altcoins to make it happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 02, 2023, 09:47:32 PM",
      "body": "Quote from: FiveG on July 02, 2023, 03:40:00 PMI saw something on a friend of mine iPhone I was amazed, this guy has 3 pieces of bitcoin but he didn't look it when you look at him with mere eyes, I ask him how he has come this far, he told long ego he was seriously investing on all kinds of coins with little amount of bitcoin but then most of those coins help him to realized enough amount to buy more bitcoin because that was his primary target. He normally buys those zero value coins when they appreciates it will be enough money, and that's how he convert and swag all to bitcoin and today, he has 3 piece. Is good to be diversified in your investment, somedays something good will come out of one you don't expect.Annndd that my friends are something you'd call a gamble. Well if you have enough money it's bound to work really, but considering the profit/loss ratio, if you were rather unlucky you'd probably end up negative for a really long while, maybe even only break even at your peak. Well if he purposely bought zero-value coins that actually have a good purpose, whitepaper, team and stuff like that, then maybe he's just a good researcher.And well the purpose of diversification is so that you don't get fucked in situations where your coin crashes. Going all in on Bitcoin at it's peak and then it suddenly crashes down, your entire portfolio also comes crashing down right? Unlike in cases where you buy Bitcoin, and other good and reputable coins, then you'd only crash one part (majority of it, but still one part). Well this depends on case-by-case, especially if you consider it from the future instead, e.g. right now where the ATH was in the past, investing all of Bitcoin when it was ATH seems kind of a dumb move, but investing it all before it reached ATH would seem like a great move no?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "July 02, 2023, 09:51:22 PM",
      "body": "There are tens of thousands of alts that worth near zero and will keep on being worth near zero in the future as well. Not all those that end up being low could go up. Sure I had friends in many different groups who all got richer, and I wish I did what they did and became richer as well, there is no doubt about that, there are plenty of people who either knew what they were doing or some of them just got lucky and invested into small coins and got richer. But you have to be aware of the fact that you are not going to end up with a win every time, there is a reason why only a few coins have value and tens of thousands have no value, you couıld pick one of those with no value very easily if you are not careful what you are buying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "July 02, 2023, 09:57:08 PM",
      "body": "Quote from: FiveG on July 02, 2023, 03:40:00 PMI saw something on a friend of mine iPhone I was amazed, this guy has 3 pieces of bitcoin but he didn't look it when you look at him with mere eyes, I ask him how he has come this far, he told long ego he was seriously investing on all kinds of coins with little amount of bitcoin but then most of those coins help him to realized enough amount to buy more bitcoin because that was his primary target. He normally buys those zero value coins when they appreciates it will be enough money, and that's how he convert and swag all to bitcoin and today, he has 3 piece. Is good to be diversified in your investment, somedays something good will come out of one you don't expect. Diversification is really a must if you are a potential investor. Do not just focus on a single investment but learn to acquire other investments as well. That is to prevent yourself from maximum loss especially if the one you’re investing is now at loss. And like OP’s friend, investing in altcoins with zero value is not always bad, because you never know they’ll be totally the opposite when the market is in a very good shape.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "July 02, 2023, 10:57:46 PM",
      "body": "Quote from: FiveG on July 02, 2023, 03:40:00 PMI saw something on a friend of mine iPhone I was amazed, this guy has 3 pieces of bitcoin but he didn't look it when you look at him with mere eyes, I ask him how he has come this far, he told long ego he was seriously investing on all kinds of coins with little amount of bitcoin but then most of those coins help him to realized enough amount to buy more bitcoin because that was his primary target. He normally buys those zero value coins when they appreciates it will be enough money, and that's how he convert and swag all to bitcoin and today, he has 3 piece. Is good to be diversified in your investment, somedays something good will come out of one you don't expect.Investing in shitcoins and hoping for the best is not precisely a strategy that can be used to obtain good results over the long term, your friend was lucky and that is it, now if you were to ask your friend about this I doubt they will admit it, as people like to think that whatever positive outcomes they get are because of their qualities and virtues, but this is a clear case in which this is not true, as there are many people like your friend which lost everything when they invested in shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}