{
  "id": "topic_5402865",
  "title": "Kalchef",
  "author": "Kalchef",
  "created_time": "June 16, 2022, 04:36:34 PM",
  "content": "I came across a news today that Elon Musk was sued for pumping doge coin and rumour of the pyramid scheme in doge coin isnt very clear to me yet, if you want to read the news here you go https://www.bloomberg.com/news/articles/2022-06-16/musk-tesla-spacex-are-sued-for-alleged-dogecoin-pyramid-scheme",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402865",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "June 16, 2022, 10:53:14 PM",
      "body": "From the article,QuoteDefendants falsely and deceptively claim that Dogecoin is a legitimate investment when it has no value at allI don't know if the guy even have a legitimate case against Elon and Tesla. I'm not a legal expert but all I can see is someone or some group who bought Doge out of FOMO and blamed all the losses to another person. I have seen some dog memes on his tweets but I haven't seen him say \"buy\". Should that be considered as saying \"Doge is a legitimate investment\"? That doesn't sound right to me but that is for the court to decide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "June 16, 2022, 11:28:24 PM",
      "body": "First, how would they say that Doge is a good investment on the first place? And yes, I don't think they will have a case against Elon, probably Musk will just laugh it off. It's not that Elon is the owner of have total control of Doge. Sure maybe he did some influencing on the side, but we all know that Elon is sometimes a troll and I would put everything with a grain of salt to everything he says against or for crypto like Doge. Sorry for those who lost their many believing what Elon is saying in his twitter or any other social media accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "June 16, 2022, 11:51:27 PM",
      "body": "Are they very stupid to consider doge coin as an investment? yeah those who sued elon has no brain. They were seeing meme token as an investment while there are bunch of awareness if meme tokens were only for funny or gambling purpose. So, they were sued elon when that was their mistakes which was a non sense thing to happen. They were not even using their own due diligence. When they were making mistake and they were suing or blaming others. What bunch of stupid people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 16, 2022, 11:58:38 PM",
      "body": "This was expected, some stupid \"investors\" buying a crypto asset during its all-time high due to FOMO and then when the bear market begins, they cry foul, as though someone forced them to buy the coin or token at gunpoint. I saw these kinds of cases in the last bear market.It's like rushing to gamble in a casino and then when you make losses, you start suing the casino for being fraudulent.I think Doge will do fine long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "June 17, 2022, 01:10:02 AM",
      "body": "True, inexperience investors who think that everything Elon touches turns into Gold? And now that we are in the bear market, and people losing money, just a matter of time before they point some fingers to those person responsible. Musk won't deter by this news, and as for Doge holders, I'm sure they know that this is just a meme coin, nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 17, 2022, 02:41:15 AM",
      "body": "Before Elon Musk pumps it, Dogecoin was below $0.01 and today it is traded above $0.05. I don't see any trouble with Dogecoin but I know people who bought it months ago, did not exit, are in troubles.The bear market only started so it will have more months to complete. It means the trouble for Dogecoin holders will be long too. Dogecoin is one of very few altcoins will exist in the market. First it is a Proof of Work coin. Second it has many utilities. Third it has very big communities.It will be here so you don't end with bankruptcy if you hold Dogecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mumang siat",
      "created_time": "June 17, 2022, 03:01:21 AM",
      "body": "Quote from: Kalchef on June 16, 2022, 04:36:34 PMI came across a news today that Elon Musk was sued for pumping doge coin and rumour of the pyramid scheme in doge coin isnt very clear to me yet, if you want to read the news here you go https://www.bloomberg.com/news/articles/2022-06-16/musk-tesla-spacex-are-sued-for-alleged-dogecoin-pyramid-schemeAt that time, maybe Dogecoin was a good investment, but now there is no guarantee for people to invest. Take a look so far, Dogecoin has been running quite slowly in the market, there is not even any movement for now. Talking about Elon Musk, it can't be separated from Dogecoin. but speaking of opportunities this is unlikely to happen again, I think dogecoin will only fill the market at a level of stability, but not at a maximum selling price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "June 17, 2022, 03:21:04 AM",
      "body": "Quote from: Kalchef on June 16, 2022, 04:36:34 PMI came across a news today that Elon Musk was sued for pumping doge coin and rumour of the pyramid scheme in doge coin isnt very clear to me yet, if you want to read the news here you go https://www.bloomberg.com/news/articles/2022-06-16/musk-tesla-spacex-are-sued-for-alleged-dogecoin-pyramid-schemeas I know every crypto exchange in the world writes noted: Invest in your own risk. So, Johnson is making a mistake if judges Elon as a criminal, a Ponzi scheme. Doge come a long time ago before Elon know cryptocurrency. So if Elon is the creator of Doge, he can do that in court. Or it's just a strategy, bad news is good news to make Doge to be great again by associating the great name Elon in crypto world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lornadane",
      "created_time": "June 17, 2022, 03:24:34 AM",
      "body": "Quote from: mumang siat on June 17, 2022, 03:01:21 AMQuote from: Kalchef on June 16, 2022, 04:36:34 PMI came across a news today that Elon Musk was sued for pumping doge coin and rumour of the pyramid scheme in doge coin isnt very clear to me yet, if you want to read the news here you go https://www.bloomberg.com/news/articles/2022-06-16/musk-tesla-spacex-are-sued-for-alleged-dogecoin-pyramid-schemeAt that time, maybe Dogecoin was a good investment, but now there is no guarantee for people to invest. Take a look so far, Dogecoin has been running quite slowly in the market, there is not even any movement for now. Talking about Elon Musk, it can't be separated from Dogecoin. but speaking of opportunities this is unlikely to happen again, I think dogecoin will only fill the market at a level of stability, but not at a maximum selling priceFor now, the price of Doge Coin is only in the middle because even if it goes up it won't be as expensive as last year.We see now that even Elon Musk can do nothing to support Dogecoin to grow back like last year because many of them expect Dogecoin to continue to increase in price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godwinpaul",
      "created_time": "June 17, 2022, 03:40:17 AM",
      "body": "It's actually laughable to hear that Elon musk was sued because of the fact that he chose to support dogecoin. It's a known fact that cryptocurrency is volatile and not a sustainable investment. Every persons in the industry is operating at his own risk and shouldn't blame anyone for his losses. I'm certain that the case is a ploy targeted at something else because I don't see them having a case against Elon musk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retainly_Collie",
      "created_time": "June 17, 2022, 03:47:44 AM",
      "body": "It's like some people are turning themselves into toolbars for influencers to create a game for themselves. When damage happens, they will blame those who trapped them. Personally, I don't think Elon Musk is so great or bad, but blame yourself when it's only for basic reasons that you believed such people. When the profits hit, a lot of people praised him for providing an opportunity, and when it fell, we said he was an asshole. Honestly, Dogecoin was never something I found worth complaining about. When it's like everything else going on in this space, it's also a prime case for pump and dump people to take advantage of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "June 17, 2022, 04:06:55 AM",
      "body": "This case won't have any base as people have lost billions in the market so whom would they blame for this? In the first place you should have used your brain before investing in dogecoin that is this right choice to invest your money into? A simple meme coin that serves no utility to holders would not survive the market for long run and it has been proved.You invest under someone's influence is solely your mistake in hope of earning high profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inanilujimi",
      "created_time": "June 17, 2022, 06:37:28 AM",
      "body": "Don't people understand that the crypto market doesn't always promise profits???If you feel wronged by your own choices and blame others for what you have done is it worth suing?So what about the people who make big profits at that time? doge will remain and will never be destroyed like luna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "someone703",
      "created_time": "June 17, 2022, 09:07:55 AM",
      "body": "Except for Dogecoin, most of the cryptocurrencies in the market are experiencing declines. I don't think it's just Elon Musk personally who is affected by the information he said, and now many people are talking about the responsibility of those who directly affect the price of it. It's also amusing when losers feel sorry for their stupid actions, blaming themselves rather than the situation, which is almost always the case in the investment market. Not for everyone who is happy, which is unfortunate because it will continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "andyou1234",
      "created_time": "June 17, 2022, 11:06:09 AM",
      "body": "actually I don't have more knowledge about doge coin, as far as i know dogecoin was promoted by an elon must so that the price has increased rapidly last year, even though now the price of doge has fallen very deeply but i see this year the price of doge can stay at $0.05 this means that doge has increased slightly from last year where doge has fallen at $ 0.01, and until now I don't know what the problems are with doge, what is clear is that until now doge coin is still in the top 10 CMC position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "June 17, 2022, 11:49:40 AM",
      "body": "I'm not going to say it was a false claim, however, losing investors will do something to claim their profit rather than accept their losses. Although Elon Musk is getting involved with Doge, he was not entitled to have this issue as it was you as investors who had the responsibility as well and I guess there are no promises been made between EM and the investors. In fact, we know the background of this project but still, some people become blind to not see it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "June 17, 2022, 11:50:26 AM",
      "body": "I don't think DOGE could be in trouble because of Elon Musk. Most likely any altcoin is in trouble right now because of market decline, so DOGE will not fall more than other coins. Well Musk has had a lot of complaints for a long time now, and DOGE is the easiest of them all. In fact, it wouldn't be a bad thing to hold him accountable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nimogsm",
      "created_time": "June 17, 2022, 12:42:58 PM",
      "body": "When I read the article, I realized that the person who sued Elon is just crazy, there are just astronomical amounts.Most likely, the person wanted more PR to his personality, but definitely not justice.Apparently, this is why this news did not spread to all the media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sakil200",
      "created_time": "June 17, 2022, 12:56:02 PM",
      "body": "Since Dogecoin Core 1.14.5 was introduced last year, Dogecoin's fee reduction plan has been a focal point for developers. At the time of publication, Tesla Inc. CEO Elon Musk called the fee reduction proposed by a lawyer for meme-based cryptocurrency significant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}