{
  "id": "topic_5416171",
  "title": "Husires",
  "author": "Husires",
  "created_time": "October 06, 2022, 12:10:41 PM",
  "content": "The European Union (EU) has agreed upon the full legal text of its landmark legislation known as the Markets in Crypto Assets Regulation (MiCA), alongside a further law to reveal the identity of those making crypto payments.QuoteAt a Wednesday meeting, diplomats representing the bloc's member governments in the EU's Council signed off on the text of laws which were the subject of political deals struck in June, apparently without further discussion, a source briefed on the talks told CoinDesk.MiCA introduces the first-ever licensing regime for crypto wallets and exchanges to operate across the bloc and imposes reserve requirements on stablecoins that are intended to avoid Terra-style collapses. A separate law on funds transfers requires wallet providers to check their customer's identity, in a bid to cut money laundering.Soruce: https://www.coindesk.com/policy/2022/10/05/eu-seals-text-of-landmark-crypto-law-mica-fund-transfer-rules/The text must also be formally agreed to by lawmakers at the European Parliament and is expected to be published in the EU's official journal in the early part of next year before taking effect in 2024.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416171",
  "comments": [
    {
      "author": "jackg",
      "created_time": "October 06, 2022, 02:10:08 PM",
      "body": "Well that article seems short...2024 is a while away, I wonder what the delay is for. It sounds like something that could be done on paper to check the identity of wallet users but not something that could actually be implemented by anywhere that isn't a custodial exchange (or their software offerings).Even trying to include something into open source code that can't be hacked seems like it'll be impossible - and there doesn't seem to be information on what happens if the user or developer refuses to comply with that law too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 07, 2022, 03:32:55 AM",
      "body": "Quote from: jackg on October 06, 2022, 02:10:08 PMWell that article seems short...I opened a couple of threads back in the day when the draft was presented. Basically they want to identify everyone who trades cryptocurrencies in the EU, or with anyone in the EU and all transactions, of any amount.Quote from: jackg on October 06, 2022, 02:10:08 PM2024 is a while away, I wonder what the delay is for. Normally there is always a time lag between the passage of a law and its implementation. When there is a considerable lapse of time between one and the other, it is because it is difficult to implement.Quote from: jackg on October 06, 2022, 02:10:08 PMIt sounds like something that could be done on paper to check the identity of wallet users but not something that could actually be implemented by anywhere that isn't a custodial exchange (or their software offerings).Even trying to include something into open source code that can't be hacked seems like it'll be impossible - and there doesn't seem to be information on what happens if the user or developer refuses to comply with that law too. Do not underestimate the EU politburo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "October 07, 2022, 10:57:50 AM",
      "body": "Quote from: Poker Player on October 07, 2022, 03:32:55 AMDo not underestimate the EU politburo.Are you implying that there's a universal solution [or solutions] that can be applied to all kinds of crypto-asset service providers and wallets out there?- If the answer to the above question is \"NO\", then instead of eliminating what they think is a problem, they're just going to make it harder for those who live in the EU to transact without exposing their identities (there'll be workarounds for sure).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 07, 2022, 11:26:32 AM",
      "body": "Quote from: jackg on October 06, 2022, 02:10:08 PMEven trying to include something into open source code that can't be hacked seems like it'll be impossible - and there doesn't seem to be information on what happens if the user or developer refuses to comply with that law too. I think we'll get a quick test of how useful these laws are, it came out yesterday EU’s Russian Crypto Ban Confirmed as Bloc Tightens SanctionsAll crypto payments from Russians to European wallet providers will be forbiddenQuoteThe bloc introduced an eighth set of economic and political measures against Russia after the invasion of Ukraine in February, tightening a previous rule that limited crypto payments to European wallets to 10,000 euros ($9,900).“The existing prohibitions on crypto assets have been tightened by banning all crypto-asset wallets, accounts, or custody services, irrespective of the amount of the wallet,” the European Commission said in a statement on Thursday, after proposals it made last week were signed off by EU governments.Source: https://www.coindesk.com/policy/2022/10/06/eus-russian-crypto-ban-confirmed-as-bloc-tightens-sanctions/you can read statement here https://ec.europa.eu/commission/presscorner/detail/en/ip_22_5989If we see the growth of Russian dependence on cryptocurrencies, such laws will become more stringent so that open source services can be banned or attempt to legalize significantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 07, 2022, 03:53:49 PM",
      "body": "Quote from: Poker Player on October 07, 2022, 03:32:55 AMI opened a couple of threads back in the day when the draft was presented. Basically they want to identify everyone who trades cryptocurrencies in the EU, or with anyone in the EU and all transactions, of any amount.So it's similar to the one The Netherlands hoped to implement (I remember trezor making it mandatory, receiving backlash, then making it optional. Quote from: Poker Player on October 07, 2022, 03:32:55 AMNormally there is always a time lag between the passage of a law and its implementation. When there is a considerable lapse of time between one and the other, it is because it is difficult to implement.2 years is long though, the UK expected to implement their crypto based laws within half a year (on registering frequent exchanges and exchangers). Quote from: Poker Player on October 07, 2022, 03:32:55 AMDo not underestimate the EU politburo.I guess we'll have to wait to see how this will actually work. They probably have the code universities were working on to find evil addresses and may be able to denonymise quite a lot form there and from information provided to exchanges. How this could be implemented will also have a big effect on how well it works (especially because of their own GDPR rules which should mkae them hesitent on what they retain - such as using aliases or not denonymising people until they want their identity as long as they do enough proof of concepts to ensure they can). Quote from: Husires on October 07, 2022, 11:26:32 AMI think we'll get a quick test of how useful these laws areWe'll see a good glimpse into the start of how they plan to implement these laws but they may have implemented some to scare away people from doing certain transactions until more tracking is available to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 08, 2022, 06:54:23 AM",
      "body": "Quote from: SFR10 on October 07, 2022, 10:57:50 AMAre you implying that there's a universal solution [or solutions] that can be applied to all kinds of crypto-asset service providers and wallets out there?No, and I don't know why you say that. What I imply is the following: the countries forming the European Union have had a generally social-democratic political orientation, which had very positive results after WWII and until the end of the last century with high welfare quotas and reduced inequality among its inhabitants. Compared to other parts of the world, the reduced crime rates can clearly be attributed to these welfare quotas and the reduced gap between rich and poor. But for at least a couple of decades now, the regulatory tangle and elephantine bureaucracy is leading to a system more akin to that of the USSR (to exaggerate a bit) than to that of states that allow the private sector to create wealth and then redistribute it.Quote from: Husires on October 07, 2022, 11:26:32 AMEU’s Russian Crypto Ban Confirmed as Bloc Tightens Sanctions[/url]All crypto payments from Russians to European wallet providers will be forbiddenDo we know in a practical way which wallet providers and services we are talking about? Is there a list?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 14, 2022, 01:22:39 PM",
      "body": "FEB 16, 2022https://cointelegraph.com/news/portugal-slowly-becoming-a-haven-for-european-bitcoinersPortugal slowly becoming a ‘haven’ for European Bitcoiners\"The small, sunny country recently welcomed the Bitcoin Family to its shores; a closer inspection reveals a growing Bitcoiner community basking in a zero tax glow.\"October 10, 2022https://www.bloomberg.com/news/articles/2022-10-10/portugal-to-start-taxing-crypto-gains-in-next-year-s-budget-plan?leadSource=uverify%20wallPortugal is planning to start taxing digital-currency gains on purchases held for less than a year in a major policy shift for one of Europe’s most crypto-friendly nations.\"Portugal currently does not tax crypto gains unless they come from professional or business activities. But that’s about to change. A provision in the country’s proposed 2023 budget would tax gains on crypto holdings held for less than one year at a rate of 28%, according to the plan submitted to parliament on Monday. Crypto assets held for longer than 365 days will continue to be exempt from taxes, it said.\"Cryptocurrency paradise in Europe ends",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 14, 2022, 02:40:46 PM",
      "body": "Quote from: zasad@ on October 14, 2022, 01:22:39 PMCryptocurrency paradise in Europe endsI don't understand why you state such a conclusion at the end if you refer exclusively to Portugal, which you cite as a crypto paradise? Anyone who legally buys and owns any cryptocurrency for more than 1 year is still exempt from paying taxes, and at least two other countries within the EU have had the same law for years.If we take into account MiCA, then some things are definitely changing, but from the perspective of paying taxes, Portugal and some other countries will continue to be a crypto paradise if we take into account the taxes that are paid on crypto profits in other countries of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 15, 2022, 01:01:09 PM",
      "body": "Quote from: Lucius on October 14, 2022, 02:40:46 PMQuote from: zasad@ on October 14, 2022, 01:22:39 PMCryptocurrency paradise in Europe endsI don't understand why you state such a conclusion at the end if you refer exclusively to Portugal, which you cite as a crypto paradise? Anyone who legally buys and owns any cryptocurrency for more than 1 year is still exempt from paying taxes, and at least two other countries within the EU have had the same law for years.If we take into account MiCA, then some things are definitely changing, but from the perspective of paying taxes, Portugal and some other countries will continue to be a crypto paradise if we take into account the taxes that are paid on crypto profits in other countries of the world.This is one of my observations, and the new MiCA requirements will deprive many cryptocurrency users of most of the opportunities of decentralized ecosystems.I always thought that if the laws change several times a year, then this is a bad law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 16, 2022, 10:37:24 AM",
      "body": "There will always be a way to circumvent any law or regulation in a smart way, even without living in fear of breaking the law. One way is to use decentralized crypto exchanges like Bisq, or regional alternatives where people will organize themselves through social platforms and trade with Bitcoin. The only problem I see is that transactions in physical stores could be a little strange, especially if you pay with crypto in a cafe or restaurant, and before that you have to do a kind of KYC, which is a bit strange and impractical, and everyone will choose to pay in cash or by card.What is logical for politicians is often not logical for ordinary people, but by 2024 a lot can change for the better, but also for the worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 16, 2022, 12:34:56 PM",
      "body": "I see no reason to pay for purchases with cryptocurrencies, because it attracts too much attention. I send cryptocurrency to my partner, and he deposits my bank account through an ATM. For the bank, such an operation looks like depositing funds into its own account, so the bank has no questions. And any P2P exchanges sooner or later lead to bank account blocking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 16, 2022, 03:39:22 PM",
      "body": "Quote from: zasad@ on October 16, 2022, 12:34:56 PMI see no reason to pay for purchases with cryptocurrencies, because it attracts too much attention. I send cryptocurrency to my partner, and he deposits my bank account through an ATM. For the bank, such an operation looks like depositing funds into its own account, so the bank has no questions. And any P2P exchanges sooner or later lead to bank account blocking.Banks these days a preventing their depositors to withdraw even when crypto regulations are yet not carried out. I'm sure it will happen since the crypto regulators have all the power from collecting the data to freezing stablecoin. Regulation is often concentrated on stablecoin.The FSB (Financial Stability Board) has thier own suggestion on how to regulate crypto and it stated it all here https://www.fsb.org/wp-content/uploads/P111022-4.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 06, 2022, 11:50:55 AM",
      "body": "https://www.coindesk.com/policy/2022/11/04/eu-delays-vote-on-mica-crypto-legislation-until-february/EU Delays Vote on MiCA Crypto Legislation Until February\"Technical issues in the lengthy text could delay the start of the licensing regime set out in the Markets in Crypto Assets regulation.European Union lawmakers won’t vote on the Markets in Crypto Assets regulation (MiCA) until February, likely meaning further delays in the landmark licensing regime for crypto companies within the bloc, a spokesperson for the European Parliament has told CoinDesk.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 01, 2022, 11:54:28 AM",
      "body": "https://beincrypto.com/italy-impose-crypto-gains-tax-26-starting-2023/\"Italy will begin taxing crypto at a rate of 26% from 2023, as well as expanding disclosure requirements.The capital gains tax only applies to profits greater than 2,000 euros.Many crypto exchanges have received licenses to operate in the country, which is working on broader regulation.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alex113115",
      "created_time": "December 11, 2022, 04:55:27 PM",
      "body": "Quote from: zasad@ on November 06, 2022, 11:50:55 AMhttps://www.coindesk.com/policy/2022/11/04/eu-delays-vote-on-mica-crypto-legislation-until-february/EU Delays Vote on MiCA Crypto Legislation Until February\"Technical issues in the lengthy text could delay the start of the licensing regime set out in the Markets in Crypto Assets regulation.European Union lawmakers won’t vote on the Markets in Crypto Assets regulation (MiCA) until February, likely meaning further delays in the landmark licensing regime for crypto companies within the bloc, a spokesperson for the European Parliament has told CoinDesk.\"Unfortunately, with the arrest of EU crypto queen, there can be further delays: https://www.observers.com/eu-crypto-qatar-cash/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 14, 2022, 01:30:21 PM",
      "body": "https://bitnation.co/fsb-eyes-rapid-rollout-of-crypto-regulations-in-2023/FSB Eyes Rapid Rollout of Crypto Regulations in 2023Parth Dubey(C)December 13, 2022 Outgoing secretary-general of Financial Stability Board (FSB) stated that the body plans to roll out crypto regulations swiftly in 2023.Dietrich Domanski said that the FSB will set a timeline for regulators to discuss and implement its first recommendations on global crypto regulation.The body will also outline several areas of the crypto space where policymakers could benefit from “more clarity” before making rules.The crypto regulation strategy “shows clearly what the way forward (for crypto) regulation looks like,” said Domanski.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "January 18, 2023, 02:06:19 PMLast edit: January 20, 2023, 11:42:13 AM by zasad@",
      "body": "https://www.theblock.co/post/202723/eus-final-vote-mica-regulation-postponed-aprilThe European Parliament’s final vote on the comprehensive Markets in Crypto-Assets (MiCA) regulation has been postponed to April, stalling the implementation process.The Transfer of Funds Regulation will also be postponed to the same voting session.The vote was meant to happen in February.https://www.coindesk.com/policy/2023/01/17/french-crypto-companies-must-seek-authorization-by-2024-under-new-lawmaker-plans/French Crypto Companies Must Seek Authorization by 2024 Under New Lawmaker PlansThe plans offer more time than a Senate proposal, as the country prepares for a new EU crypto law",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "February 23, 2023, 08:31:28 AM",
      "body": "https://www.dlnews.com/articles/regulation/congress-sends-team-to-study-mica-eu-cryptocurrency-law/US sends team to Brussels to study EU’s landmark crypto law amid SEC crackdownOver a dozen US Congressional staffers – largely crypto and fintech specialists – will be heading to Brussels and Paris, tasked with learning about the EU’s new legal framework for crypto. They will meet with EU officials and regulators as well as crypto industry lobbyists for firms and trade groups based in the bloc, say six people with knowledge of the trip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "April 21, 2023, 07:33:07 PM",
      "body": "MiCA got approved by the EU parliament. https://www.coindesk.com/policy/2023/04/21/with-mica-past-the-finish-line-uks-crypto-industry-calls-for-rules-of-its-own/I don't get why some people are praising it for being the first crypto rule book, like it's a good thing that they're putting a leash on its users. At this point it's going to be harder to legally use cryptocurrencies than fiat money. I'm not sure how this is going to end up regarding their plans to make both parties go through KYC when transaction is over 1k EUR. The plan was for a registered institution, like an exchange, to have to know the owner of the address it's sending coins to, which was completely ridiculous. Nobody is going to use exchanges in the EU if that becomes a rule. Fortunately we have until 2025 for them to make up their minds. Maybe we'll have one last bull market before they kill trading in Europe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}