{
  "id": "topic_5501450",
  "title": "SickDayIn",
  "author": "SickDayIn",
  "created_time": "June 29, 2024, 12:59:12 PM",
  "content": "Michael Saylor at BTC Prague presented \"his\" 21 rules of bitcoin.https://www.youtube.com/watch?v=1PkMFIa7rmQThe rules by themselves, might not mean something to you. They have layers of deep meaning. I highly recommend you watch the video. What do you think of these rules, what do they mean to you?1. Those who understand, buy Bitcoin. Those who don't, criticize Bitcoin.2. Everyone is against Bitcoin before they are for it.3. You will never be done learning about Bitcoin.4. Bitcoin is powered by chaos.5. Bitcoin is the only game in the casino that we can all win.6. Bitcoin won't protect you if you don't wear the armor. 7. Bitcoin is the one thing in the universe that you can truly own.8. Everyone gets Bitcoin at the price they deserve.9. Only buy Bitcoin with the money you can't afford to lose.10. Tickets to escape the matrix are priced in Bitcoin.11. Bitcoin insight is restricted to those with a need to know.12. All your models will be destroyed.13. The cure to economic ill is the orange pill.14. Be for Bitcoin, not against Fiat. 15. Bitcoin is for everyone.16. Learn to think in Bitcoin.17. You don't change Bitcoin, it changes you.18. Laser eyes protect you from endless lies.19. Respect Bitcoin, or it will make a clown out of you.20. You do not sell your Bitcoin.21. Spread Bitcoin with love.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5501450",
  "comments": [
    {
      "author": "notocactus",
      "created_time": "June 29, 2024, 01:25:20 PM",
      "body": "Quote from: SickDayIn on June 29, 2024, 12:59:12 PM1. Those who understand, buy Bitcoin. Those who don't, criticize Bitcoin.2. Everyone is against Bitcoin before they are for it.Some can be changed with education and with time but some won't be changed so let them be the ones they are.Quote3. You will never be done learning about Bitcoin.It's related to point #1. Understand it is a broad term, and point #3 says a right thing, learning and mastering Bitcoin is hard. The bottom line is, you don't need to master everything of Bitcoin to invest your money in it. You only need basics such asHow is the 21 Million Bitcoin Cap Defined and Enforced?The bullish case for Bitcoin.Next step is choose your wallet, non custodial, open source, make sure you back up your wallet, test the backup. At this point, you are ready to purchase bitcoin and move it to your non custodial wallet.Quote7. Bitcoin is the one thing in the universe that you can truly own.It's too much. If you own gold, it's yours.With Bitcoin, it's not your private key, it's not your bitcoin so make sure you own the private key.Andreas M. Antonopoulos' Bitcoin Q&A: Not your Keys, Not your Coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SickDayIn",
      "created_time": "June 29, 2024, 01:32:00 PM",
      "body": "Quote from: tranthidung on June 29, 2024, 01:25:20 PMQuote7. Bitcoin is the one thing in the universe that you can truly own.It's too much. If you own gold, it's yours.I don't agree with that. As Michael Saylor says in the video, it can be taken from you. Your land will be taken by the mayor, your company will be taken by the taxes. Even your gold, will be removed from you by force. You will need to move the gold physically with you wherever you go. It's not the same as Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 29, 2024, 02:50:04 PM",
      "body": "Quote from: SickDayIn on June 29, 2024, 01:32:00 PMI don't agree with that. As Michael Saylor says in the video, it can be taken from you. Your land will be taken by the mayor, your company will be taken by the taxes. Even your gold, will be removed from you by force. You will need to move the gold physically with you wherever you go. It's not the same as Bitcoin. Your BTC can also be stolen from you if your device is compromised, an assailant can find where your seed phrase is stored locally and steal it from you, if you store your funds in an exchange, it can be taken away from you, if there is a fire incident in your house, your seed phrase and device could be damaged forever, if, if.BTC is great, a lot of us are pro bitcoiners, but some of the things in this '21 rules' are kind of weird and does not make sense to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 29, 2024, 03:01:46 PM",
      "body": "Quote from: SickDayIn on June 29, 2024, 01:32:00 PMI don't agree with that. As Michael Saylor says in the video, it can be taken from you. Your land will be taken by the mayor, your company will be taken by the taxes. Even your gold, will be removed from you by force. You will need to move the gold physically with you wherever you go. It's not the same as Bitcoin. If you are arrested and government use whatever means to force you giving your Bitcoin private key, will you own your bitcoin. So don't be extremely serious like if you have physical gold bars at home but you don't actually own it. Governments can do the same with your bitcoin or your physical gold bars if they arrest you and it is more serious in nations where citizens don't have enough human rights and protection from laws.Saylor is a Bitcoin maximalist and he only invests in Bitcoin so he has to use any word as barrier to prevent more people invest money in other non-Bitcoin assets. Total capital is here, if more people spend money to other things, less money will go into Bitcoin market and it will affect trading volume, demand and price growth of Bitcoin. Saylor is smart enough to know that but it doesn't mean what he said is true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 29, 2024, 03:13:23 PM",
      "body": "More like a way to make someone become Bitcoin maximalist.Mostly I agree, few points are quite controversial, the only one point I disagree is #5.If we talk about economy, there's no way everyone can win since it works by demand and supply, anything is zero sum game. If you win, someone else loses, if you lose, someone else wins. Mostly investors are win, mostly traders are lose, what he said is he refer to the investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "June 29, 2024, 04:14:31 PM",
      "body": "Michael Saylor is a very intelligent person. The fiat system is a terrible scam, and people live for decades within this deception, unaware of the matrix they live in. Bitcoin has opened the eyes of many people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "June 29, 2024, 04:22:57 PM",
      "body": "Quote from: SickDayIn on June 29, 2024, 01:32:00 PMQuote from: tranthidung on June 29, 2024, 01:25:20 PMQuote7. Bitcoin is the one thing in the universe that you can truly own.It's too much. If you own gold, it's yours.I don't agree with that. As Michael Saylor says in the video, it can be taken from you. Your land will be taken by the mayor, your company will be taken by the taxes. Even your gold, will be removed from you by force. You will need to move the gold physically with you wherever you go. It's not the same as Bitcoin. After God is government, the government can take whatever asset you own be it gold estates and money, so there is not wrong if we refer to Bitcoin as self own, so let not contradict ourselves because the bottom line is that Bitcoin custody is the first thing and that is the security of your assets in Bitcoin it means your Private keys, but at the same time how you handle it.Bitcoin is the only asset the offers total freedom of ownership and high privacy, compared to other form of assets like gold, physical asset's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "June 29, 2024, 05:03:03 PM",
      "body": "Quote from: Ojima-ojo on June 29, 2024, 04:22:57 PMAfter God is government, the government can take whatever asset you own be it gold estates and money, so there is not wrong if we refer to Bitcoin as self ownBitcoin is the only asset the offers total freedom of ownership and high privacy, compared to other form of assets like gold, physical asset's. After gold is government, sorry I have to disagree.Gold bars, if store at your home, are yours but you can lose it. Similarly with Bitcoin, you can store your bitcoin at home, in non custodial wallet and you are the custodian, but will government be able to take it from you?Yes, they can, if they arrest you and force you to say your private keys like they knock your door and ask you to give them your gold bars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GbitG",
      "created_time": "June 29, 2024, 07:02:18 PM",
      "body": "Quote from: SickDayIn on June 29, 2024, 12:59:12 PM3. You will never be done learning about Bitcoin.I don't agree with this. There isn't unlimited information about Bitcoin for one to not be able to learn everything about it. One could say this thing about its price but not itself.Quote5. Bitcoin is the only game in the casino that we can all win.Yeah, but only if we have enough self-control and patience because it tests our patience on a lot of occasions.Quote7. Bitcoin is the one thing in the universe that you can truly own.Anything that you have in your possession is owned by you, its value can fluctuate whatever it is, but you own it, whether it's cash, gold, or anything else.Quote20. You do not sell your Bitcoin.Only up until a specific time, you can't hold forever and it doesn't make sense to be holding your bitcoins when you know the value you are getting is enough for you to do a lot of good things for yourself in your life and then you can start investing in Bitcoin again after you have set everything up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SickDayIn",
      "created_time": "June 30, 2024, 04:18:44 AM",
      "body": "Quote from: tranthidung on June 29, 2024, 03:01:46 PMQuote from: SickDayIn on June 29, 2024, 01:32:00 PMI don't agree with that. As Michael Saylor says in the video, it can be taken from you. Your land will be taken by the mayor, your company will be taken by the taxes. Even your gold, will be removed from you by force. You will need to move the gold physically with you wherever you go. It's not the same as Bitcoin. If you are arrested and government use whatever means to force you giving your Bitcoin private key, will you own your bitcoin. So don't be extremely serious like if you have physical gold bars at home but you don't actually own it. Governments can do the same with your bitcoin or your physical gold bars if they arrest you and it is more serious in nations where citizens don't have enough human rights and protection from laws.Yes but how will the Government know you have any Bitcoin? You don't. As long as you are not putting your seed phrase on some paper under your pillow, and you're storing it in cold storage, they will not know you have any at all. Gold however, they can raid your home under any grounds they see fit, and take it from you.Quote from: Z-tight on June 29, 2024, 02:50:04 PMBTC is great, a lot of us are pro bitcoiners, but some of the things in this '21 rules' are kind of weird and does not make sense to me.I recommend you watch the video. If you just read the rules, some of them might not make a lot of sense. They have been simplified and shortened, but they have layers of deep meaning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BoB_Bass",
      "created_time": "July 01, 2024, 08:20:13 PM",
      "body": "Number 3 seems controversial but I think I understand it.  My Bitcointalk account may be young but when it comes to orbits around the sun I would say that I am older than the average forum user.  I am not a big internet person, I listen to records and read books, I try to avoid the internet in day to day life but I started spending more time online to learn about Bitcoin. In that time I would say that I have learnt more about the FIAT system, things that I never knew I needed to know, and I feel that learning about fiat and the economy is what we need to do to realise how much we need bitcoin.  And there is no limit, as far as I can see, to how much we can learn about our current economic predicament, there is no limit to understanding bitcoin.No knowledge is wasted, I think, is what I'm trying to say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "July 01, 2024, 08:40:08 PM",
      "body": "Quote from: dzungmobile on June 29, 2024, 05:03:03 PMAfter gold is government, sorry I have to disagree.You may have to re-read my comment to understand what I mean, because God is what I mean and not gold, and it just and adage just to show how powerful the government is and after God is government which means government have power over your own life not to talk less of whatever property you own.Bitcoin may be decentralized, in terms of privacy but if the government have information of it, it can be collected from you at anytime, same goes to both gold and other properties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "July 01, 2024, 10:06:03 PM",
      "body": "Quote from: SickDayIn on June 29, 2024, 12:59:12 PM20. You do not sell your Bitcoin.Hmmm, he is the CEO Microstrategy that keeps on buying Bitcoin and props to him and his company for doing that. But I doubt it that they won't come to a point of time that they're not going to sell for profits. They're a company, an incorporation that needs to do something to retain the business. I know that buying Bitcoin isn't the only one that they're taking profit from but I really doubt that he won't give instructions to load and sell those that they've accumulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "July 02, 2024, 12:17:43 AM",
      "body": "Here's why I'll never take that guy seriously:He made a business move, now he's going to spend every waking moment trying to support it. That's all that is going on here. He's not a savior, just another narcissist CEO. No one should engage in idolatry; especially when it comes to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 02, 2024, 12:42:14 AM",
      "body": "Anyone else get creeping skin listening to influencer vibes from Saylor of all people?Don't mind the guy in general (or I simply haven't heard enough to dislike him), but the very first \"rule\" just gnaws at me. \"Those who don't understand Bitcoin criticise it\" what sort of rule is that, and why does it have to be a rule? When did we stop liking (constructive) criticism?\"Those who understand buy\". That. Is simply untrue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "July 02, 2024, 01:49:43 AM",
      "body": "Quote from: nutildah on July 02, 2024, 12:17:43 AMHere's why I'll never take that guy seriously:He made a business move, now he's going to spend every waking moment trying to support it. That's all that is going on here. He's not a savior, just another narcissist CEO. No one should engage in idolatry; especially when it comes to bitcoin.I disagree if a person or a company changed from anti-Bitcoin to pro-Bitcoin is a reason of not trustworthy.People can change so can company and in 2013, many people did not believe in Bitcoin. Michael used to be a person like this, anti-Bitcoin, but he learned and saw great things in Bitcoin, in blockchain technology especially this decentralized blockchain. He saw great opportunity to get rich with Bitcoin, if he invests money in Bitcoin and he bravely changed himself, convinced his company's board members to invest in Bitcoin.He contributed to bring Bitcoin news to more people and help Bitcoin adoption, it's positive contribution.His skewed opinion to Bitcoin, only Bitcoin, is for his and his company benefits, I agree that we should not trust him entirely if he said anything beyond Bitcoin is bad.His leverages used to invest in Bitcoin are risky and I don't know how MicroStrategy will end. The end game like Terra or FTX if the company won't control leverages they use well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "July 02, 2024, 06:27:28 PMLast edit: July 02, 2024, 06:52:26 PM by MeGold666",
      "body": "I did not read it all and just randomly selected one:Quote18. Laser eyes protect you from endless lies.The so called \"Laser eyes\" people are known to be fanatical about Bitcoin so every criticism about Bitcoin is seen by them as a stinky lie.So having them for \"protection\" aka source of information is not good idea.I wouldn't listen to Michael or anyone invested in certain project for any information about it as they are heavily biased and even if they thought it became bad investment they would never say it and keep lying about it for as long as they have their bags in it.It's like going to Gold forum and asking what you should invest in, or any crypto project on reddit - the worst echo chambers of them all.Michael has 1 rule - PUMP his bags and sell it to FIAT before other whales start selling.He never believed in cryptocurrencies and I don't believe one word he is saying.If he truly believed in it, he wouldn't reduce it to \"digital property\" in his crusade of never ending lies.And why he is not here discussing it with us ? because he has better things to do than talk with crypto-lunatics (I believe he has no respect for the community).So stop cheering him so much because he is simply an A-hole.Quote from: BitGoba on June 29, 2024, 04:14:31 PMMichael Saylor is a very intelligent person. The fiat system is a terrible scam, and people live for decades within this deception, unaware of the matrix they live in. Bitcoin has opened the eyes of many people.I'm yet to see any intelligence signs from him and you're just repeating his words like a parrot.FIAT money is not a scam, it has it drawbacks like possible hyperinflation or inflation higher than planned but it's been good for daily trading for so many years and the (targeted) inflation was there to incentivize people to spend it (invest too) so the economy grows.If for example USD was growing in value like Bitcoin then no one would want to spend it and the economy would slow down to snail-pace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 02, 2024, 06:56:35 PM",
      "body": "Quote from: SickDayIn on June 30, 2024, 04:18:44 AMI recommend you watch the video. If you just read the rules, some of them might not make a lot of sense. They have been simplified and shortened, but they have layers of deep meaning.If it made deep meaning to you, that's fine, each to their own. I admit i haven't listened to the video and i only read your op, but i don't think i need to spend my time listening to the video, because what he says remains his own opinions and i must not agree with him. Except you didn't summarize it well, the video shouldn't make extra meaning to me and i still do not agree with a few things he said, neither do i want bitcoiners to see him as an important 'voice' in the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 02, 2024, 07:24:29 PM",
      "body": "Quote from: tranthidung on June 29, 2024, 01:25:20 PMQuote7. Bitcoin is the one thing in the universe that you can truly own.It's too much. If you own gold, it's yours.From my point of viene, Time is the only thing that you can truly own... If you own bitcoin or gold you can lose them or a thief can take ir from you. And about the point 4, I would say it's ruled by cryptography and not by chaos.But in general I like those 20 points.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}