{
  "id": "topic_5471428",
  "title": "EquilibriumOdds",
  "author": "EquilibriumOdds",
  "created_time": "October 24, 2023, 06:08:42 AM",
  "content": "I read some Twitter users with big followers that cryptocurrency market is going to be bullish.Bitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471428",
  "comments": [
    {
      "author": "edmundduke",
      "created_time": "October 24, 2023, 06:48:17 AM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.Bitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?TBH if you need to ask that then the best chance you have is to just stick with daddy BTC. The returns might be lower but at least you know what way the market is moving",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 24, 2023, 07:42:17 AM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.They always say the same thing every after the bear market.Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMBitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.Halving is right and every after the halving, the bull run is anticipated but it's not giving assurance that it will also start immediately by 2024 too.Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMWhat altcoins can help me rich in 2024 and 2025?Any idea?I'll say only one thing, be careful of shills and meme coins that will be suggested to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hitsnorth",
      "created_time": "October 24, 2023, 07:56:54 AM",
      "body": "No one truly knows. Don't ask for financial advice from strangers on the internet. Most likely at least some of them will just shill you some shitcoin they believe in or are even involved in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 24, 2023, 08:05:25 AM",
      "body": "I won't suggest you hold altcoin till 2025 because we always experience a great significant lost after having and this might ends you having bunch of shitcoin in your custody after halving might have ended. So there's every need to buy now and prepare for the bull run if you are that profits conscious or concerned much about making profit but for long time hold it's better buy and hold to experience at least two times halving if only you can endure holding for long periods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeilLostBitCoin",
      "created_time": "October 24, 2023, 08:18:21 AM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMWhat altcoins can help me rich in 2024 and 2025?Any idea?If you're considering investing, I highly recommend Bitcoin. It's the most trustworthy option out there. Bitcoin's price is more consistent than other cryptocurrencies, making it a safer investment. Plus, if you invest in Bitcoin for the long term, you have the potential to earn some excellent profits. It's important to be cautious of Twitter influencers, as some may have sold their online space to promote unreliable cryptocurrencies. Always research on your own before making any decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "October 24, 2023, 08:46:55 AM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.Bitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?I think people who are serious about investing will not advise you to invest in something you don't understand. What you need to invest here is knowledge and experience, I'm sure you are in a state of FOMO because of the price increase in recent days, yes I have also come across a lot of positive news being spread.Some things that I think will benefit you- Redefine knowledge from basic to advanced about the market- Determine the capital that can be spent on the investment- Develop a plan (time to take profit or cut loss)...There are many other things that appear but I think these will be the basics for beginners, and remember that the risk and profit are created by you. Don't just fantasize, but be more realistic about your actions so you can hope for a good result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "October 24, 2023, 10:31:38 AM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.                                                 Any Names of those Twitter users you are pointing ? so we can check if they are                         Legit or just telling BS for their followers to invest in their shitcoins or scam projects.Quote                                                   Bitcoin halving will come in 2024.                                                Indeed that 2024 is the day for Bitcoin halving , but never expect so much because                     there are some times it becomes longer that we expect in which it may take place in 2025 and not                      just in 2024.QuoteBitcoin will have a big bull run in 2024.                                               like what I said , don't trust market to bring you such in that year because you might be                     wrong on the year , but yes December 2024 might be a good time to see such bull.QuoteWhat altcoins can help me rich in 2024 and 2025?Any idea?                                              Can help you become rich? how much richer are you aiming ? and how much capital are we                    talking about here? because you cannot just turns rich tomorrow without doing anything .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "October 24, 2023, 11:27:14 AM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.Bitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?I'm sorry, but if you are already thinking of becoming rich, then you will fail. And I tell you why, because those who chase becoming rich that is why they are here, these people are usually impatient and they end up losing their money. I'd rather suggest thinking about which project could give you a profit and for sure you can find a lot of them. If you are really into the plan of making an investment in crypto, then make a choice of known coins, stop finding gems and hyped projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 24, 2023, 11:47:27 AM",
      "body": "You know that Bitcoin will go bullish and yet you are looking for altcoin that will do the same? Without any assurance? Ain't that a mistake? Stick with Bitcoin and you will get money. Don't look for something else where there's too much risk involved while something is already in front of your face telling you to \"buy me\". It's always better to have a higher percentage of your portfolio in Bitcoin and then next to it is the top altcoin out there and maybe a slice of that pie for different altcoins that you think will matter in the cryptocurrency industry for the future. The signs are already showing, that Bitcoin is on its way upward, better not be left by the boat or it will be the same thing again as in the past. Regrets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 24, 2023, 12:05:55 PM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMBitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?If you are gonna go for altcoins then go for some projects that didnt do any ATH last bull run. For sure these projects are gonna favoured by some of the newest investors who likes a disruptive market condition. Im not sure which one it is but you can use coinmarketcap to analyze the information per project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 24, 2023, 12:31:10 PM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish...What altcoins can help me rich in 2024 and 2025?In a bull market, it doesn't matter which coin you hold, because in such a period they all increase in price. But buying altcoins today, hoping to make a profit in 2024-25, will be risky and the best solution in this case will be to trade short-term, because most altcoins are not designed to hodl.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 24, 2023, 01:39:57 PM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.Bitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?I don’t think at this point there would be altcoins that would realistically help achieve your 2024 and 2025 goals than Ethereum. Other than Bitcoin which is given already the best of them all, Ethereum is likely the best altcoin that is worth in the long run in terms of market capitalization, trading volume, etc., due to it’s impressive use cases especially in building Dapps despite transitioning from Proof-of-Work (PoW) consensus to Proof-of-Stake (PoS).No disrespect though but most of the altcoins today are either only good for short and mid-term results. But for Ethereum? It’s definitely a long term altcoin along with the almighty Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "October 24, 2023, 01:49:55 PM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.Bitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?Just buy Bitcoin and Ethereum and you'll be rich and safe. Never think and search for an altcoin that will propers you more like become an instant rich, you might just fall into scam coins. Don't make the mistake of investing in new projects as they just looked promising but in the end, this will be the reason for your losses. Better consider those projects that already have a huge community and established reputation already. They might not make you rich but at least, you're also safe and certainly won't disappoint you during that time - just hold and wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "October 24, 2023, 02:17:38 PM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMWhat altcoins can help me rich in 2024 and 2025? Any idea?I think we can only make some supposedly educated guess but there is no question that if there can be a big bull run for BTC in 2024 - and this can be starting now due to possible ETF approval by SEC - some alts will also be experiencing big upswing in prices. Number one on my list is Ethereum, next is XRP most especially if they win their case eventually and of course to top my list is BNB a big reflection on its role as a facilitating platform for the bull run. Now, please explore many other options out there as there can be so many to discuss here. Good luck on your own crypto journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "October 24, 2023, 02:51:04 PM",
      "body": "Quote from: EquilibriumOdds on October 24, 2023, 06:08:42 AMI read some Twitter users with big followers that cryptocurrency market is going to be bullish.Bitcoin halving will come in 2024.Bitcoin will have a big bull run in 2024.What altcoins can help me rich in 2024 and 2025?Any idea?You cannot get rich if you don't know which altcoin is good to buy. You may good misleading answer which can cause you a lot of money if you easily believe them so rather than asking this kind of question maybe much better if you ask on where you can learn to do technical analysis and what are those things that needed to consider so that I can learn to trade. For sure with that knowledge you will never ask that question but rather in focus on searching the best alts to have and always listen to the news spread since this is more ideal matter that need to do by investor.Asking question is good but we shouldn't trust those words 100% since we need to search for those information to verify if our gathered information have basis  since we can learn a lot of things for being resourceful on researching some quality informations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 24, 2023, 05:10:18 PMLast edit: October 24, 2023, 08:20:14 PM by DeathAngel",
      "body": "Quote from: hitsnorth on October 24, 2023, 07:56:54 AMNo one truly knows. Don't ask for financial advice from strangers on the internet. Most likely at least some of them will just shill you some shitcoin they believe in or are even involved in. You are not going to get many genuine responses OP. Most will be clouded with bias, people pushing their snake oil on you. I think just buy bitcoin & ethereum, like others have said less ROI but more guaranteed. I think it’s better to go that way than gamble with real shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 24, 2023, 06:38:40 PM",
      "body": "There is no need to make predictions and analytics based on twitter analysts. There are many false statements among them aimed at creating certain thoughts and expectations in the crowd. This is how the big players manipulate all the small investors. The media is part of marketmaking, so always do your own analytics rather than blindly trusting what is written on social media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "October 24, 2023, 06:49:42 PM",
      "body": "Quote from: Adbitco on October 24, 2023, 08:05:25 AMSo there's every need to buy now and prepare for the bull run if you are that profits conscious or concerned much about making profit but for long time hold it's better buy and hold to experience at least two times halving if only you can endure holding for long periods.Happy to read this from you mate!I have had my doubts but I think you can clarify me here about my opinions and/or assumptions compared with yours. In your post, you advised that if anyone can hold very tight and experience 2 consecutive bull run, that they will be on good profits. My question is that considering the current price of BTC being high as compared to like 5yrs ago, will that your ideology still work?Take for instance someone bought before 2021 bull run at about 20k and the bull run took us to about 69k, assuming the person took profit at 60 range and wait to re-enter the market this year at 15k, don't you think the person will be on profit more than the person that bought 20k, allowed it to fall back to 15k because they wanted 2 times bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 24, 2023, 07:01:16 PM",
      "body": "Quote from: KingsDen on October 24, 2023, 06:49:42 PMQuote from: Adbitco on October 24, 2023, 08:05:25 AMSo there's every need to buy now and prepare for the bull run if you are that profits conscious or concerned much about making profit but for long time hold it's better buy and hold to experience at least two times halving if only you can endure holding for long periods.Happy to read this from you mate!I have had my doubts but I think you can clarify me here about my opinions and/or assumptions compared with yours. In your post, you advised that if anyone can hold very tight and experience 2 consecutive bull run, that they will be on good profits. My question is that considering the current price of BTC being high as compared to like 5yrs ago, will that your ideology still work?Take for instance someone bought before 2021 bull run at about 20k and the bull run took us to about 69k, assuming the person took profit at 60 range and wait to re-enter the market this year at 15k, don't you think the person will be on profit more than the person that bought 20k, allowed it to fall back to 15k because they wanted 2 times bull run.What you must know is that we always experienced new ATH after halving, so if Bitcoin hit an ATH of 67k per say doesn't mean we won't see another ATH as I believe that any year we experienced halving we also witnessed a new price range. That was why I said if you are that profits conscious you may sell whenever you think your profit range is much comfortable with you than holding for more two halving, I am not against anyone who decides to sell or hold the thing is that how can you be able to manage your decision because I have encountered someone who said of holding for few years immediately he successfully gaining about 15x of his investment he sold thinking he did that at right time. Before he knew we gained another ATH of 69k plus which he was left in between regret. So the decision is yours and most especially we don't know what the future may holds and all talks about bitcoin can be totally subjected to speculation, we don't give accurate information rather a guessing words which means it may likely happened or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}