{
  "id": "topic_5449982",
  "title": "Succeeder5748",
  "author": "Succeeder5748",
  "created_time": "April 24, 2023, 11:03:19 AM",
  "content": "Hi, I'm looking for YouTube channels to follow for best most popular info and advice on bitcoin/other cryptos regarding market conditions and environment information. I'm also looking for technical analysis and overview and upcoming performance reports and market reports helpful to less skilled people.So far on YouTube I am following Millionnaire Investment Secrets, Crypto Banter, InvestAnswers, and CryptoCasey. Do you recommend any or all of those channels, let me know of any more essential ones for vital market info affecting crypto.Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449982",
  "comments": [
    {
      "author": "franky1",
      "created_time": "April 24, 2023, 12:44:56 PM",
      "body": "none of themif their thumbnail is a candlestick chart where they drew lines on it.. STAY AWAYthose are not TA meaning technical analysis. those are (lowercase) ta meaning trend analstechnical analysis is not about drawing lines on charts following patters of the last 120 daystechnical analysis is about knowing the underlying value and trade window based on the economics fundamentals of mining cost ranges of the planet and also looking at when in flows and outflow are happening of market deposits/withdrawals along with the realisation value of utxo all forming sentiment bases of a ratio of buyer:seller also if they are talking about FED new of inflation but are doing so in every days video they have no clue and are just trying their best to find correlations but failingmarket news is more about which banks are hoarding the stable coin reserves. which institutions are financing mining farms which developer groups have fixes for bugs or which developers are selling out their own project in favour of some business plan rather than community need",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "April 24, 2023, 03:16:33 PMLast edit: April 24, 2023, 03:32:09 PM by cafter",
      "body": "Quote from: franky1 on April 24, 2023, 12:44:56 PM--snip--do technical analysis and onchain analysis same? I think.. yes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 24, 2023, 08:08:10 PM",
      "body": "OP, in taking financial decisions, is either you are making those decisions yourself or you have hired a financial expert who can guide you. But if you must know, there is a lot of misleading content on the internet, even on YouTube and other sites. Some of the things you consider crypto investment advice are not even what the adviser is doing. You can get a technical analysis on YouTube, but beware that some YouTubers will only film and show you what you expect to see, which may not be the truth.I can say that you should follow up on some boards (like Marketplace, Trading Discussion, Legal, Press and economic). You will gradually learn things as a less skilled person, as you mentioned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "April 24, 2023, 08:30:33 PM",
      "body": "Personally I follow a few, mainly to listen to analysis that I'm sceptical of or disagree with. Otherwise there is no point reaffirming the views I already have... there is no point being preached to if you are already converted.The bullish analysis right now would be Tone Vays, who was quite accurate in 2017 and 2018, very wrong in 2019, right in 2020 and 2021, quite off the mark in 2022. He's somewhat unreliable, but when he's getting it right he usually get's it right for a while. Call it dumb luck, but he was one of the few speculators who anticipated a re-test of the lows around $4K/5K in 2020. Not afraid to go all in back then either.I also still follow DataDash, as he's super bearish right now, from $15K all the way to $30K. Even now considering shorting the market! The reason being is that I'm waiting to see if any of his bearish analysis actually makes much sense, but so far there isn't a lot to agree with, as it's all just macro-encomic-analysis this and high inflationary that, followed by the recession that still hasn't arrived. He previously thought that $25K wouldn't be broken due to high inflation, and that if it was then a re-entry around $25K would be possible, and now since reaching $30K he's telling his \"community\" that it's soon a time to short the market. Talk about moving the goal posts for bearish analysis, he's right up there with Il Capo from crypto twitter, ie bearish regardless of price movement. He's worth a counter-trade, that much is worth knowing, not much else.Other than that, I don't follow many others. They are either day-traders or highly speculative swing traders that make most of their money from ByBit referrals (and the like) rather than trading, so completely unreliable. But generally I'd recommend that if you are (for example) very bullish right now, listen to those who are bearish, to see if it can change your mind, rather than re-affirming what you already believe and are aware of...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 24, 2023, 08:34:41 PM",
      "body": "Quote from: Succeeder5748 on April 24, 2023, 11:03:19 AMHi, I'm looking for YouTube channels to follow for best most popular info and advice on bitcoin/other cryptos regarding market conditions and environment information. I'm also looking for technical analysis and overview and upcoming performance reports and market reports helpful to less skilled people.It is advisable not to take trading signals from social media most importantly the YouTube where anyone could just draw charts and refer to them as signals. If you looking into the technical analysis of crypto then you might need to read more on them and gain your own knowledge and not relying on charts from the internet. The only help I see is they shape your reason about certain project which sometimes is misleading. Personal knowledge and experience draws better conclusions. QuoteSo far on YouTube I am following Millionnaire Investment Secrets, Crypto Banter, InvestAnswers, and CryptoCasey. Do you recommend any or all of those channels, let me know of any more essential ones for vital market info affecting crypto. Most of all these popular channels are where some of these pumps and dumps coins are advertised. Due to maybe the large number of followers or subscribers, many naive people follow this and we have seen how some lost their funds. So be wary of trusting these channels. DYOR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "April 24, 2023, 08:43:30 PM",
      "body": "Datadash is also one of the channels I kept following since the time I was watching TAs of users online. Nicholas Merten is quite a man who can explain it clearly to anyone aspiring to learn.If you want humor, Crypto Banter always has funny moments including the TAs they provide. Somehow I'm just turning on youtube while I'm doing a lot of stuff at home so I hear everything that is happening in the crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "April 24, 2023, 10:32:17 PM",
      "body": "Quote from: cabron on April 24, 2023, 08:43:30 PMDatadash is also one of the channels I kept following since the time I was watching TAs of users online. Nicholas Merten is quite a man who can explain it clearly to anyone aspiring to learn.The only irony is that he's been consistently wrong in bear markets since he started YouTube, even if he can very eloquently explain the wrong opinion consistently for years upon years.It's true he's been quite accurate with analysis in bull markets, mainly based on BTC/ETH prices, but otherwise in the 2018 bear market he was convinced $6K would hold as support and lead to a new bull market, whereas instead price dropped to $3.2K. The irony being now is that he was convinced in 2022 that price will drop lower than $15K, and so far has also been proven completely wrong.My main point is that he's been consistently wrong in bull markets, both in 2018 (too bullish) as well as 2022 (too bearish). There are also other calls he made in 2019/2020 regarding various altcoins and half of them went down and the other half went up, so he then highlighted his successful calls for the coins that went up, conveniently never referencing again the coins that went down, such as Ravencoin most notably.FYI Never forget he shilled substratum in 2017, this has remained a sorepoint for longer-term crypto investors. He also did paid advertising for Celsius that went bankrupt. Also ever heard of his own produtct called Digifox? It got shut down and investors lost a lot of money. The summary is DataDash used to have some useful analysis back in 2017, but now has become another useless YouTuber.Best to avoid for useful analysis is the point here. He's only provide you inaccurate or unreliable analysis, or shill you coins that aren't worth selling your Bitcoin for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "April 24, 2023, 11:11:59 PM",
      "body": "No specific I guess. But it is Twitter which somewhat gives the latest update in this industry. Instances? Check how Elon's tweets affect the market prices. News on the other hand I guess, would be better if you will follow as much as you can to keep yourself updated. And when it comes on Technical Analysis, indeed news would be a factor on what would you anticipate; bearish or bullish. But TAs are more dependent with the pattern that particular token is forming on its chart. On my end I do only follow some of the news provider online 'coz my TAs are solely dependent with charts and somehow it is still working. My reason is to avoid FOMO 'coz social media platforms are a wild ocean of information so atleast filter what you would digest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Framelover",
      "created_time": "April 24, 2023, 11:40:58 PM",
      "body": "You’ve mentioned some good channels which are well known and respected.Also, some other popular channels you could visit and find helpful are Crypto Jenn, DataDash, Ivan on Tech. These channels offer insights into the crypto industry.But then, keep in mind that crypto market is highly vaporous  and its essential  for you to make your own thorough findings before making investments of any kindI hope you find this helpful.Cheers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "April 25, 2023, 12:12:49 AM",
      "body": "I have watched many of these crypto content people and I don't follow a certain one but there's one that has got taken my attention on how he's good not just with crypto analysis but also with what's happening in global markets, specifically on the US markets.If you guys happen to see the channel ClearValue Tax, he's not just a crypto guy but also gives some analysis on what's actually happening in the market. His content is for entirety of economic analysis that's why I like watching some of his videos.I'm not endorsing for him as he's got million of subs already but if you've got the same interest as mine, you can check him out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "April 25, 2023, 12:47:10 AM",
      "body": "Media influencers which is YouTubers gets you more confused about market and put in a tension of not knowing what to do, have you think how they source their information before they updated on youtube? They might not be absolutely 100 percent correct due to how they gets their fact and update, while on a technical analysis it's better to study that market yourself and developed the best methods you think will be more beneficial to you than follow someone else TA which might not work correctly for you and may leads you to a great lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "April 25, 2023, 12:59:17 AM",
      "body": "Quote from: Succeeder5748 on April 24, 2023, 11:03:19 AMHi, I'm looking for YouTube channels to follow for best most popular info and advice on bitcoin/other cryptos regarding market conditions and environment information. I'm also looking for technical analysis and overview and upcoming performance reports and market reports helpful to less skilled people.So far on YouTube I am following Millionnaire Investment Secrets, Crypto Banter, InvestAnswers, and CryptoCasey. Do you recommend any or all of those channels, let me know of any more essential ones for vital market info affecting crypto.Thanks.I'm sure majority here, or those who have experienced already, doesn't care about this so called Youtubers. Heck, some of them doesn't have that experience to provide you good technical analysis and could be just making wild and educated guess like you and me. So if I where you, this is the wrong path when you starts your bitcoin journey.So can just go around this community, here is a good board: Speculation. Or this specific board that might open your eyes: Wall Observer BTC/USD - Bitcoin price movement tracking & discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "April 25, 2023, 01:23:04 AM",
      "body": "Quote from: Succeeder5748 on April 24, 2023, 11:03:19 AMSo far on YouTube I am following Millionnaire Investment Secrets, Crypto Banter, InvestAnswers, and CryptoCasey. Do you recommend any or all of those channels, let me know of any more essential ones for vital market info affecting crypto.luckily, I didn't follow anything about the crypto market, because I know it was waste of time and make a headache. before going too far, you must stop it and begin to learn how to keep your Bitcoin safe by following the Bitcoin security youtube channel like @aantonop. I am really sure you will be a millionaire because if you understand Bitcoin so much, you just buy and do not sell it after the price is a million. here, you will be the richest person in the world without headaches following the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "April 25, 2023, 01:27:19 AM",
      "body": "For me, since you mentioned Technical Analysis (TA).I can suggest is to find a real trader,  a YouTuber that doesn't promote any shitty projects just for their own benefit.For example, Crypto Cred and TechnicalRoundup, where are expert traders who also create videos about their analysis, they are doing live videos and live technical analysis on the current market. On the Crypto Cred channel, you can see a bunch of tutorials on how to do technical analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "April 25, 2023, 02:13:42 AM",
      "body": "Quote from: Succeeder5748 on April 24, 2023, 11:03:19 AMHi, I'm looking for YouTube channels to follow for best most popular info and advice on bitcoin/other cryptos regarding market conditions and environment information. I'm also looking for technical analysis and overview and upcoming performance reports and market reports helpful to less skilled people.Thanks.If you want to just learn basics learn from these youtube videos then it's not bad thing but if you want it to watch regularly and just follow these youtubers analysis then you will learn less. I will recommend you to give some time to learn basic analysis tool and then apply by self. it will give you lot of experience and you will see practically change in price. Market not always remain same and for bull and bear market you have to apply different strategy which can understand more better way when you apply TA by self. i am not against these youtubers and for newbie these videos gives lot of learning tool but to become professional start your own work and see result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "April 25, 2023, 02:34:26 AM",
      "body": "Quote from: Succeeder5748 on April 24, 2023, 11:03:19 AMHi, I'm looking for YouTube channels to follow for best most popular info and advice on bitcoin/other cryptos regarding market conditions and environment information. I'm also looking for technical analysis and overview and upcoming performance reports and market reports helpful to less skilled people.So far on YouTube I am following Millionnaire Investment Secrets, Crypto Banter, InvestAnswers, and CryptoCasey. Do you recommend any or all of those channels, let me know of any more essential ones for vital market info affecting crypto.Thanks.You can't get very good ideas from YouTube. But if you need to get ideas then you can ask questions in some section boards of this forum. All YouTube channel ideas may not be beneficial for your future. That's why I suggest you to this forum marketplace, trading discussion, help and bigginner, spelication all these sites you can tell your problems. I hope you get fairly good advice from everyone. That's why I don't think you need to get information from YouTube channel. Hope you stay with the forum and learn best if you have full faith and trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 25, 2023, 03:13:28 AM",
      "body": "I dont really have precise channel but I learning some trading indicator from thesee https://www.youtube.com/c/DataTradersalthough the market news is from the internet like Cointelegraph and Twitter might be the fastest news take example is CryptoGuru here the twitter https://twitter.com/WatcherGuru",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypticj",
      "created_time": "April 25, 2023, 03:15:39 AM",
      "body": "Honestly, I don't recommend following youtube for TA. The best way to follow TA is to follow it yourself. Better learn how it works and train your skills and intuition. Because there are a lot of fake analysts on youtube.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "April 25, 2023, 03:26:25 AM",
      "body": "Quote from: Succeeder5748 on April 24, 2023, 11:03:19 AMHi, I'm looking for YouTube channels to follow for best most popular info and advice on bitcoin/other cryptos regarding market conditions and environment information. I'm also looking for technical analysis and overview and upcoming performance reports and market reports helpful to less skilled people.I have been following a Youtuber for quite some time already with regards to Bitcoin, and some of the popular cryptocurrencies out there. He's also a good analyst (for me), and he gives advices on both sides always. What I mean is that he is giving advice on what us investors can do when it goes up, and at the same time it goes down. This is the link to his Youtube Channel: LINKAs for a Youtuber who is expert in TA, I don't follow some aside from the one I shared. I don't follow any traders as well at all because I just want to make my own strategy that will work for me. Though I've watched some of the indicators that works most of the time, made some experiments thru the videos that I watched, and tweaked it to the point that it works for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}