{
  "id": "topic_5402068",
  "title": "paxmao",
  "author": "paxmao",
  "created_time": "June 10, 2022, 10:19:36 AM",
  "content": "A friend of mine once told me \"if you do not do politics, they will do politics to you\". Politics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side. There is probably nothing clean anywhere in the political arena.However, as disgusting as they are, the option of not getting involved does not really work. You need to defend your interests and make sure that the politicians of your country know that you are watching and that you will hold the to account.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402068",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "June 10, 2022, 12:53:20 PM",
      "body": "Plato once said, \"Those who are too smart to engage in politics, are punished by being governed by those who are dumber\", this quote has always been a wake up call for political participation, because notwithstanding the reasons you have for favoring political apathy, when you remember that abstainment does not solve the issue, but instead worsens it, you will get involved.You musn't be a politician to get involved, meaning you do not have to present yourself to be voted for, but if you are eligible in age, you should be a part of the electorate and make sure to vote during elections, and in favor of the best candidate.It is sad that some countries are ruled through dictatorship, eliminating periodic elections, and even when elections are held, they are anything but free and fair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 10, 2022, 02:09:24 PM",
      "body": "When people evolves then those politicians are also evolving and keep learning how to make the people to stay away from them, and if someone notice their harmful activities and raise their voice against them then the government will supress their voice with the thing called law. Nowadays we see more protest so the evolution is reaching next stage so the politicians are unable to control all the people raising voice against them?...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "June 11, 2022, 04:53:37 PM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMA friend of mine once told me \"if you do not do politics, they will do politics to you\". Politics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side. There is probably nothing clean anywhere in the political arena.I used to think that it is only in Africa that politics is seen as nasty and dirty until I started watching politicians in the US and UK. It is an inborn attribute of man to know how to do good and bad, but most people will choose to do bad. The so much propaganda and lies that go on in politics is what make decent people want to stay away from it. This is why I do not like getting involved in it. Politicians lie without thinking twice about their actions. I do not blame anyone who does not like getting involved too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "June 11, 2022, 06:51:22 PM",
      "body": "Politics is everywhere both in the kitchen living room sitting room churches schools and family so if you don't partake in politics it will surely come to you in your family or your school, politics is something that I know that is necessary everywhere we are so nobody can run away from politics. I know not the one we value very well is the kind of politics we play for government or with the government in order to represent our people in government but that is not actually a a politics I believe politics is a game of interest and dirty so if you don't have the mindset of lies you won't politic for life",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "June 11, 2022, 08:00:36 PM",
      "body": "Most voters get involved in politics without actually knowing anything about the issues, then cast their vote like it's a sporting event and they want their side to win. The only accountability that ever happens is for the other \"team,\" the political adversaries. When things don't work out, it's never the person or party you voted for, it's someone else because it's difficult to admit to buyer's remorse.I'd rather have someone sit out from politics if they haven't done the absolute minimum of educating themselves about the issues opposed to getting involved and voting for whoever runs the most campaign commercials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "June 11, 2022, 09:23:49 PM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMA friend of mine once told me \"if you do not do politics, they will do politics to you\". Politics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side. There is probably nothing clean anywhere in the political arena.However, as disgusting as they are, the option of not getting involved does not really work. You need to defend your interests and make sure that the politicians of your country know that you are watching and that you will hold the to account.Your friend is right, however, being apolitical or flat out refusing to get into it could also be a sort of political activity where a person is voicing his/her dissapointment with the choices that are presented. So I do think you can chose not to get involved and still have the right to complain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 13, 2022, 12:17:49 AM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMA friend of mine once told me \"if you do not do politics, they will do politics to you\".But on a real sense should things be done that way? are they telling us that truly politics is a dirty game? I want to believe all these are not what am thinking (politics as a game of scam), only for some heartless individuals to take advantage of being a leader to execute thier selfish interests.Quote from: paxmao on June 10, 2022, 10:19:36 AMThere is probably nothing clean anywhere in the political arena.Honestly this is a bitter truth, we have access to them before they got emerged into the office just to later discover they can be approached, probe or access not to talk of the utilization of their position and power for the betterment of the people who voted them in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "June 13, 2022, 03:56:14 AM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMA friend of mine once told me \"if you do not do politics, they will do politics to you\". Politics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side. There is probably nothing clean anywhere in the political arena.However, as disgusting as they are, the option of not getting involved does not really work. You need to defend your interests and make sure that the politicians of your country know that you are watching and that you will hold the to account.Politics in the real sense of it is not distasteful as many may think, but rather it's the players that are actually distasteful in their actions and inactions while politiking.If you refused to get involved in the politics of your country with an I don't care attitude then you are part of the problem for good governance and don't have a right to complain when those in government are not standing up to their responsibility. There's a say; that evil triumph men in politics  because good men sit down and do nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cnut237",
      "created_time": "June 13, 2022, 10:54:56 AM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMA friend of mine once told me \"if you do not do politics, they will do politics to you\". Politics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side. There is probably nothing clean anywhere in the political arena.However, as disgusting as they are, the option of not getting involved does not really work. You need to defend your interests and make sure that the politicians of your country know that you are watching and that you will hold the to account.Yes, this is true. I'd also add that a lot of people see democracy purely as a right, when really it's also a responsibility.If you are voting simply because you can, and have no real knowledge of what you are voting for, because you haven't really looked into it beyond reading a few breathless headlines and hearing a few catchphrases, then really you shouldn't vote.It's your responsibility as a voter to make sure you are fully informed and that you have reached your own decisions based on the evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 13, 2022, 12:33:24 PM",
      "body": "Quote from: TheNineClub on June 11, 2022, 09:23:49 PMYour friend is right, however, being apolitical or flat out refusing to get into it could also be a sort of political activity where a person is voicing his/her dissapointment with the choices that are presented. So I do think you can chose not to get involved and still have the right to complain.You're making it sound as if it's someone's (government's? LOL) responsibility to present lemmings with choices. No. People create the choices, people vote, people make them accountable.And yes, they have the right to complain regardless of the above, but if they complain without doing anything then it's just lemmings complaining with no purpose or consequence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cnut237",
      "created_time": "June 13, 2022, 01:31:45 PM",
      "body": "Quote from: suchmoon on June 13, 2022, 12:33:24 PMQuote from: TheNineClub on June 11, 2022, 09:23:49 PMYour friend is right, however, being apolitical or flat out refusing to get into it could also be a sort of political activity where a person is voicing his/her dissapointment with the choices that are presented. So I do think you can chose not to get involved and still have the right to complain.You're making it sound as if it's someone's (government's? LOL) responsibility to present lemmings with choices. No. People create the choices, people vote, people make them accountable.And yes, they have the right to complain regardless of the above, but if they complain without doing anything then it's just lemmings complaining with no purpose or consequence.Yes. If you don't vote and you're never going to vote, then a politician will see you as irrelevant. You can complain all you like, but if it has zero effect on elections, you don't matter.Not voting is also an easy way out of making an unpalatable choice. If you don't like any of the candidates, then you must certainly dislike some more than others. There's a case to be made for holding your nose and voting for the least bad option. At least that way you can have an influence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "June 13, 2022, 03:24:37 PM",
      "body": "French revolution, fall of monarchy and rise of politicians. Not elected but selected amongst the choices. Its like fishes electing the best crocodile in the pond. The fruits of democracy is already sour and 90% of worlds wealth is in hands of less  than 1%.Where are we heading, maybe towards next level of governance wherein digital control over identities and resources will create a more equitable society and a society where state can control our privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 13, 2022, 05:02:19 PM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMPolitics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side.However, as disgusting as they are, the option of not getting involved does not really work. You need to defend your interests and make sure that the politicians of your country know that you are watching and that you will hold the to account.Thou that politics is argumentative and full of lies, we can't fold our hands to see them squander what was meant for all of us. Everybody can not play politics at the same time. We need doctors, engineers, electricians, plumbers, scientist and pharmacist e.t.c Politicians will always be politicians (lies), but not holding them accountable when they leave the office will be the biggest mistake we can ever make as citizens of any nation. Because i was meant to understand by my government teacher back then in secondary that irrespective of your political, social or religious position, nobody is above the rule of law in any given Democratic state",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 13, 2022, 05:15:04 PM",
      "body": "\"I did not 51% attack the network, but complain when it happens.\"Seems legitimate to me.  If you think the system is broken and the majority of people have turned into wanting to know what their country can do for them, instead of what they can do for their country, then wouldn't excusing yourself from participating and instead trying to find ways to fix the system be more appropriate?The fact is that our politicians have led us down an unsustainable path that leads only to bankruptcy.  However, they'd prefer to destroy our quality of life over taking the steps to fix the economy, because they wouldn't get ahead that way.  They'd rather just play options games in the market while leaving the ordinary citizen out to dry.  Don't believe me?  Compare Nancy Pelosi's investment returns to your favorite fund manager.  I just wonder how she finds the time to be the greatest investor in the world while also doing so much politically.  It's almost like the two go hand in hand...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 13, 2022, 05:21:00 PM",
      "body": "Quote from: OgNasty on June 13, 2022, 05:15:04 PM\"I did not 51% attack the network, but complain when it happens.\"You did not use, buy, or mine it, and you incessantly trolled people who did, is what's being discussed here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "June 13, 2022, 09:41:11 PM",
      "body": "I might never get involved in politics in my home country. This because the political space is not governed or controlled by competency or meritocracy. Rather it is guided by tribalism and nepotism. I hate political thuggery, threats and sometimes killings because of the quest to gain political power by all means. I would not be a part of vote buying and other electoral malpractice that is the other of the day in my continent. Hence, I am far from politics of my home state. But we would keep protesting using every legal means to showcase our dissatisfaction. The social media, industrial actions and peaceful protest are our avenues to complain. We would keep exposing their evil ways until the change and serve the masses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libertasbella",
      "created_time": "June 13, 2022, 09:47:29 PM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMHowever, as disgusting as they are, the option of not getting involved does not really work. You need to defend your interests and make sure that the politicians of your country know that you are watching and that you will hold the to account.We're quickly nearing the point where your disapproval of politicians' actions will have no bearing on what they actually do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minime0105",
      "created_time": "June 14, 2022, 04:51:01 PM",
      "body": "Quote from: Maestro75 on June 11, 2022, 04:53:37 PMQuote from: paxmao on June 10, 2022, 10:19:36 AMA friend of mine once told me \"if you do not do politics, they will do politics to you\". Politics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side. There is probably nothing clean anywhere in the political arena.I used to think that it is only in Africa that politics is seen as nasty and dirty until I started watching politicians in the US and UK. It is an inborn attribute of man to know how to do good and bad, but most people will choose to do bad. The so much propaganda and lies that go on in politics are what makes decent people want to stay away from it. This is why I do not like getting involved in it. Politicians lie without thinking twice about their actions. I do not blame anyone who does not like getting involved too.No man politics as the name implies has gone beyond what we can imagine most times I feel all the people in politics have a group that brings them together. The things you see in African politicians are also in the other ones, especially the word corruption,  they never stop lying and doing wrongs to the people they claim they are representing, any one who wanna be a politician is ready to join them in their evil ways or they will kick you down. We can not blame most people who don't like joining politics because they know what they are avoiding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "June 14, 2022, 08:33:01 PM",
      "body": "Quote from: paxmao on June 10, 2022, 10:19:36 AMA friend of mine once told me \"if you do not do politics, they will do politics to you\". Politics are mostly distasteful - arguments, propaganda, politicians creating problems for their own gain and trying to radicalise people to their side. There is probably nothing clean anywhere in the political arena.However, as disgusting as they are, the option of not getting involved does not really work. You need to defend your interests and make sure that the politicians of your country know that you are watching and that you will hold the to account. The thing is, not every one wants to be apathetic when it comes to politics, but I've discovered that most of these individuals who complain about a bad government are ones who where actually die hard supporters but then, with rigging and some malpractices in the electoral body, you find their interest wane. Where I come from, politics is seen as a sport; only the fit and \"smart\" can play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}