{
  "id": "topic_5439619",
  "title": "iskmn5",
  "author": "iskmn5",
  "created_time": "February 12, 2023, 05:13:52 PM",
  "content": "Hi everyone,I have lots of proof about a scammer but he insists on that he is not a scammer and I don't know maybe I am wrong. I'll share you all the details you can decide who is right.The background I'm software technician for smartphones, that's how I make my living. I connected a client computer with anydesk one day and tried to help him and while doing it I have to send a money to address. I copied the address and paste it click to send, verified without carefully checking. This part is completely my mistake I admit it. Afterwards I saw that the pay account is not same and the client which I have connected nothing knows about the bitcoin or crypto currencies. I selected the believe him, then I searched the google the receiver account. I saw a post in bitcointalk forum. TPEiGHk6nvHZGGuCpPE3r1GeizUFTSbohu this account in google search shows a bitcointalk user. I searched this ibuddy122055 is the nickname of him/her. Then I wrote him/her and kindly asked to send it back, s/he said not possible because @ibuddy122055 has no access to wallet. I asked several times again ibuddy122055 said for definite no recover. But however TPEiGHk6nvHZGGuCpPE3r1GeizUFTSbohu continued the transfer and sent money the a wallet which has Hide USDT! So I'm waiting all forum members help at least block of TPEiGHk6nvHZGGuCpPE3r1GeizUFTSbohu account because this is even worse than cheating. All the proofs https://imgur.com/a/FJNOrRl",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439619",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "February 12, 2023, 05:58:53 PM",
      "body": "The tron network is filled with transaction spam. Revealing the transaction ID of the particular transaction could be helpful, as tracing the actual transaction is hard because of the spam.If you are being honest, I think the person behind the address may be using a clipboard malware to steal the coins. This is not conclusive because we haven't heard the other side of the story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iskmn5",
      "created_time": "February 12, 2023, 06:17:57 PM",
      "body": "Here is the transaction details, https://tronscan.org/#/transaction/7a9567f325a121fa8b27e52cd7dd7439f87ad079e2cc773dd1d837d54c1b55c0I also think that he uses malware to copy paste. But ibuddy122055 is only person who mentioned something about address and now he deleted his post only   I think I'm lucky the get screenshot and google not deletes data fast",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "February 12, 2023, 07:15:24 PM",
      "body": "To avoid any confusion:The user you are referring to is ibuddy122505, not ibuddy122055.Quote from: iskmn5 on February 12, 2023, 06:17:57 PMI also think that he uses malware to copy paste. But ibuddy122055 is only person who mentioned something about address and now he deleted his post only All the posts that are made in the forum are archived by ninjastic.space and loyce.club. Click here to see the deleted post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iskmn5",
      "created_time": "February 12, 2023, 09:10:48 PM",
      "body": "Thank you showing right user, I'm waiting still maybe he donates that money or refund me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "February 12, 2023, 11:04:40 PM",
      "body": "Quote from: iskmn5 on February 12, 2023, 06:17:57 PMHere is the transaction details, https://tronscan.org/#/transaction/7a9567f325a121fa8b27e52cd7dd7439f87ad079e2cc773dd1d837d54c1b55c0I also think that he uses malware to copy paste. But ibuddy122055 is only person who mentioned something about address and now he deleted his post only   I think I'm lucky the get screenshot and google not deletes data fast  You also have a mistake here you did not double-check the address, and you send a huge amount right away without testing you should have sent $1 instead but anyway we have to hear  ibuddy122055 side he can't deny it because all posts herein Bitcointalk are achieved if he mentioned the address where you send the amount but if he insists that he has no access anymore and he stopped using that wallet then its loss.But if he used that address in one of his posts after you mistakenly sent the amount then he has access to that wallet, so check his post history and see if he posted the address after you sent the amount or even recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 12, 2023, 11:29:45 PM",
      "body": "Quote from: iskmn5 on February 12, 2023, 09:10:48 PMThank you showing right user, I'm waiting still maybe he donates that money or refund me.you don't need to ask for a donation here, it's just a question of goodwill, whether he wants to return that money or not. definitely remember that everything is your fault.Quote from: Saisher on February 12, 2023, 11:04:40 PMBut if he used that address in one of his posts after you mistakenly sent the amount then he has access to that wallet, so check his post history and see if he posted the address after you sent the amount or even recently.@ibuddy122505 claims that he created that address only because of the campaign signature, but since he was not accepted into the campaign, he deleted the wallet. however, even after that, there are outgoing transactions from that address, which means that he still did not delete it. the probability that someone hacked his wallet is very small because there are still funds there. Hacked wallets are always completely cleaned immediately.also, the claim that the address was created because of the campaign signature on Nov. 30. '22. It cannot be correct, because the address has the first transaction on \"2022-06-16 17:40:45 (Local) 241 days 7 hrs ago\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ibuddy122505",
      "created_time": "February 13, 2023, 05:38:56 AM",
      "body": "The story begins on 2nd January 2023, though I'm not sure whether his statement is true or false.@iskmn5 contacted me via telegram (before that, he made a random call) and asked for 500 USDT back. For a moment, I was shocked, but soon realized it could be spam I got on Telegram in general. As the user messaging me repeatedly, I decided to repeat it back. His response was that he sends my tron address 500 USDT. I responded that I never share my tron address with anyone. Therefore, I don't understand the title \"Scamming on USDT TRC20 Network with Proofs\" where he alleges I scammed him but how is that possible? Neither did I send him any message nor did I have any bad intentions. There might be an intention on his part.  Tron wallet: what you need to know On my phone, I have the TronLink pro app. The wallet never requested the recovery phrase upon access, so I haven't backed it up. At the moment, I do not use tron addresses at TronLink pro since there is no reason to do so. As far as I remember, TPEiGHk6nvHZGGuCpPE3r1GeizUFTSbohu was only used at Hunnyplay sing campaigns. Having been rejected by Hunnyplay, I do not have any reason to activate that wallet. Next, I researched TronLinak's HD/COLD wallet differences. Several addresses have been created/deleted as a result of this action. As a result, I no longer have access to my previous wallet. My only connection to that tron wallet is the one I use at Hunnyplay. Without Hunnyplay's mention, I would never know the wallet belongs to me. I am being honest, that's all I can say.Unlike Ethereum or Binance wallets, I haven't used to Tron wallet. As you can see from my history, I usually use an Ethereum/Binance wallet to participate in promotions. I politely responded to him via telegram, but he made disrespectful and harmful comments, such as reporting me for terrorism and committing scams. So, It is my fault for spending hours collaborating with @iskmn5 on telegram for no reason other than goodwill? It would be better if you thanked me rather than constantly blaming me. Thanks for pointing this thread out @examplens, otherwise I would not have known that such conspiracies are being perpetrated against me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "February 13, 2023, 06:23:07 AM",
      "body": "Quote from: ibuddy122505 on February 13, 2023, 05:38:56 AM-snip-Having been rejected by Hunnyplay, I do not have any reason to activate that wallet. Next, I researched TronLinak's HD/COLD wallet differences. Several addresses have been created/deleted as a result of this action. As a result, I no longer have access to my previous wallet. My only connection to that tron wallet is the one I use at Hunnyplay.Your address had usdt token outgoing transactions in the past 66 days (as of today), which means it was even active before receiving $500 belongs to OP.I have not accused you so far, however your reasons contradict the facts.Quote from: ibuddy122505 on February 13, 2023, 05:38:56 AM-snip-The wallet never requested the recovery phrase upon access Wondering how did you generate that address without first facing a recovery passphrase backup wizard or whatever like most crypto wallets do?  Are you sure you installed the wallet correctly? By the way where did you download it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "February 13, 2023, 12:04:41 PM",
      "body": "Quote from: examplens on February 12, 2023, 11:29:45 PMalso, the claim that the address was created because of the campaign signature on Nov. 30. '22. It cannot be correct, because the address has the first transaction on \"2022-06-16 17:40:45 (Local) 241 days 7 hrs ago\".I'm not accusing anybody here but it's a case of \" if you tell the truth you don't have to remember anything\" there are some discrepancies in his defense.So you create a wallet without backing the passphrase or private key? QuoteThe wallet never requested the recovery phrase upon accesssomething that is unacceptable for someone with a senior rank.If you tell us that you don't have access anymore make it look good without loopholes.There's nothing OP can do anymore it's his fault in the first place this is a lesson of double-checking or triple checking, there's really no need to rush you can check the address in under a minute.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 13, 2023, 01:12:36 PM",
      "body": "Quote from: ibuddy122505 on February 13, 2023, 05:38:56 AMTherefore, I don't understand the title \"Scamming on USDT TRC20 Network with Proofs\" where he alleges I scammed him but how is that possible?you are right here because there are no evident elements of fraud. everything is the result exclusively of OP's mistake.it's another matter if you really have access to that address, and whether you want to return that money, but even if you don't return the funds, it's not a scam.if we were to assume that both of you are telling the truth, I would conclude that you are both victims of the same fraud. you ibuddy122505 should check your devices because it is evident that you installed a hacked or fake wallet application that gave you the wrong (hacker's) deposit address. if you really want to find out, try to repeat all the steps and see which deposit address you will get this time.OP also, if it's true what ibuddy says, there is a high probability that you or your client are a victim of some malware or clipboard virus. here you can find one of the discussions on that topic You can also check if you try to go through a repeat process, of course, this time without final sending.it is certainly good advice for both of you to scan and check your computers and devices and take it as urgent. my advice is to start with a completely new operating system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ibuddy122505",
      "created_time": "February 13, 2023, 03:41:48 PM",
      "body": "Quote from: noorman0 on February 13, 2023, 06:23:07 AMQuote from: ibuddy122505 on February 13, 2023, 05:38:56 AM-snip-The wallet never requested the recovery phrase upon access Wondering how did you generate that address without first facing a recovery passphrase backup wizard or whatever like most crypto wallets do?  Are you sure you installed the wallet correctly? By the way where did you download it?I understand that this might sound awkward or unacceptable, but I am telling my own story. After searching for it on Google, I download it. I faced a recovery passphrase backup before generating the address. What did I do to overcome this challenge? Could be possible either take a picture or write it down on paper. It's hard for me to explain exactly what I did. I have a limited understanding of the Tron wallet since I am not used to tron wallet.I received a message from @iskmn5 asking to check my Tron wallet. I immediately open my TronLink apps, but there are no active wallets anymore (I have already described this). For my part, I tried my best to memorize it and did everything I could to recover it and send it back. It would be my pleasure to help him out, but I have no way to do so. @iskmn5 never understood the hardship I was going through. It still puzzles me as there are many transaction stories associated with the wallet address that I don't know about since I have no connection to any of these transactions. I did copy-paste the tron wallet address when creating POA at Hunnyplay. The only thing I can guess is that my device was infected with some malware or a clipboard virus as @examplens suggested. As a result, I decided to delete my tronlink wallet and scan my device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "February 13, 2023, 10:57:24 PM",
      "body": "Quote from: ibuddy122505 on February 13, 2023, 03:41:48 PMI received a message from @iskmn5 asking to check my Tron wallet. I immediately open my TronLink apps, but there are no active wallets anymore (I have already described this). For my part, I tried my best to memorize it and did everything I could to recover it and send it back. It would be my pleasure to help him out, but I have no way to do so. @iskmn5 never understood the hardship I was going through. We cannot tell if there's dishonesty on your part although there's a little contradiction its very clear that there was carelessness on the part of OP, we all dread the situation where we sent a huge amount to the wrong address, we have been aware of the clipboard malware we have been aware of the possibility of copy-pasting the wrong address, and this is another example of being mindful and alert when sending, OP has to accept that the funds are already loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "February 16, 2023, 04:50:53 AM",
      "body": "Quote from: examplens on February 12, 2023, 11:29:45 PM@ibuddy122505 claims that he created that address only because of the campaign signature, but since he was not accepted into the campaign, he deleted the wallet. however, even after that, there are outgoing transactions from that address, which means that he still did not delete it. the probability that someone hacked his wallet is very small because there are still funds there. Hacked wallets are always completely cleaned immediately.also, the claim that the address was created because of the campaign signature on Nov. 30. '22. It cannot be correct, because the address has the first transaction on \"2022-06-16 17:40:45 (Local) 241 days 7 hrs ago\".Yeah, to be honest, I thought the same even if I would create a couple of address but after deleting the address and not saving the private key the wallet should be gone even tho there is people who transferred to me in the other day. the ibudy might know what happen but remain silent because the dormant address should be dead and there is no way the wallet transferred some money without any involvement of creator unless ibudy get hacked too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "February 17, 2023, 07:58:55 PM",
      "body": "Quote from: iskmn5 on February 12, 2023, 06:17:57 PMI also think that he uses malware to copy paste. But ibuddy122055 is only person who mentioned something about address and now he deleted his post only   I think I'm lucky the get screenshot and google not deletes data fast  If the copy and paste are infected from the device that contains malware, how can you not check before you send? What is this blind haste, man? $500 is not a small amount to send to someone's wallet so quickly, even though you put proof of the transaction and screenshots and I believe what you said but it's your fault.If we read what @ibuddy122505 explained, then he denies that he uses this Tron wallet, although there is proof of a lie that was explained by @examplens, and if he is honest and that he does not use this Tron wallet yet, why did he delete his post in the forum that contains the address of his Tron wallet that he participated in one of the campaigns after the OP messaged him on Telegram?!This is conclusive proof that @ibuddy122505 does not know that his post, although he deleted it, is archived, so he did this to remove any proof about it, to evade paying the OP who made a huge mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 17, 2023, 10:33:36 PM",
      "body": "Quote from: albon on February 17, 2023, 07:58:55 PMIf the copy and paste are infected from the device that contains malware, how can you not check before you send? What is this blind haste, man? the victim usually does not even know that his device is infected. if you do several operations at once, you often don't pay attention to the address you \"paste\", even if we add inexperience, it is a very realistic scenario. It can happen almost to anyone.clipboard malware was designed for such cases.Quote from: albon on February 17, 2023, 07:58:55 PMIf we read what @ibuddy122505 explained, then he denies that he uses this Tron wallet, although there is proof of a lie that was explained by @examplens, and if he is honest and that he does not use this Tron wallet yet, why did he delete his post in the forum that contains the address of his Tron wallet that he participated in one of the campaigns after the OP messaged him on Telegram?!This is conclusive proof that @ibuddy122505 does not know that his post, although he deleted it, is archived, so he did this to remove any proof about it, to evade paying the OP who made a huge mistake.many users delete their POA posts because later they are worthless and have a bad influence on campaign managers during selections. I saw that many times.maybe it sounds like I'm defending @ibuddy122505, I just don't see enough elements to firmly accuse him in this case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}