{
  "id": "topic_5453438",
  "title": "Ultegra134",
  "author": "Ultegra134",
  "created_time": "May 20, 2023, 04:08:29 PM",
  "content": "Time passes, and we have nothing to look forward to. We watch our lives pass, and the only thing we're looking forward to is the weekend or 20 days per year of paid time off. We're working a whole year, from 9 to 5 and sometimes even more, at someone else's business just to have an approximate of 20 days of vacation and two days off per week, with many of us having one or even none per week. Is it just me, or does this life sound completely depressing to me? Our ambitions are completely crushed by such a daily routine; our days off are mostly to get things done around the house and to rest. By the time that happens, the day has passed, and we have to go to work again.At least where I'm at, having two days off per week is considered extremely lucky and privileged, especially if it's two days in a row. Personally, I only had one day off per week, and it honestly wasn't enough. On the one hand, I wanted to get things done around the house and rest, but on the other hand, I didn't want to stay inside doing practically nothing to enjoy myself. Thus, the single day off wasn't even close to being enough. Certainly, I'd be better off with two consecutive days off, but still, is that how you want your life to be for the next 10–20 years, or even more?On the one hand, I don't want to complain; through the last few years of working, I've been on vacation four times, from 2020 to 2022, which isn't bad at all. On the other hand, I'd like to constantly travel and explore new destinations, the majority of which we'll never experience through this way of life.Do you believe that there's a true way to escape this vicious cycle, or are we doomed to live like this forever? Telling me that my minor savings in Bitcoin are going to settle me for the rest of my life isn't going to cut it, because the majority of us won't ever have enough Bitcoin to retire.Are you satisfied with this way of life, or would you prefer to live a different way? What would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453438",
  "comments": [
    {
      "author": "teosanru",
      "created_time": "May 20, 2023, 04:17:21 PM",
      "body": "Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMTime passes, and we have nothing to look forward to. We watch our lives pass, and the only thing we're looking forward to is the weekend or 20 days per year of paid time off. We're working a whole year, from 9 to 5 and sometimes even more, at someone else's business just to have an approximate of 20 days of vacation and two days off per week, with many of us having one or even none per week. Is it just me, or does this life sound completely depressing to me? Our ambitions are completely crushed by such a daily routine; our days off are mostly to get things done around the house and to rest. By the time that happens, the day has passed, and we have to go to work again.At least where I'm at, having two days off per week is considered extremely lucky and privileged, especially if it's two days in a row. Personally, I only had one day off per week, and it honestly wasn't enough. On the one hand, I wanted to get things done around the house and rest, but on the other hand, I didn't want to stay inside doing practically nothing to enjoy myself. Thus, the single day off wasn't even close to being enough. Certainly, I'd be better off with two consecutive days off, but still, is that how you want your life to be for the next 10–20 years, or even more?On the one hand, I don't want to complain; through the last few years of working, I've been on vacation four times, from 2020 to 2022, which isn't bad at all. On the other hand, I'd like to constantly travel and explore new destinations, the majority of which we'll never experience through this way of life.Do you believe that there's a true way to escape this vicious cycle, or are we doomed to live like this forever? Telling me that my minor savings in Bitcoin are going to settle me for the rest of my life isn't going to cut it, because the majority of us won't ever have enough Bitcoin to retire.Are you satisfied with this way of life, or would you prefer to live a different way? What would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this.I was just talking about this today with a friend. Our life has just become like this now. We work for 5 days just to enjoy these 2 days and this has just become a normal thing for us which shouldn't actually be normal. But yes I am also unaware about the fact how to get out of this trap. I doubt I'll ever be able to get out of this because 5 days working will never end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "May 20, 2023, 04:30:13 PM",
      "body": "That's life, sometimes things don't go the way we expect but there is no choice to be able to accept it because on average everyone does the same thing working 5 days a week and 2 days off and some even only have 1 day off. And I think that's normal because most are like that and will get used to situations like that and it all depends on how they manage their homework and vacation during the 2-day vacation and also plan holidays when there is a red date.and i enjoy the state i think the same as you and most importantly after 8 hours of work i still have 16 hours of rest and also with my family and for the next 10 or 20 years i just want to have a business and be boss with some workers and one- my only hope is to make a profit from bitcoin which i do in the long term. And with that I can enjoy life with other things with my family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "May 20, 2023, 05:15:23 PM",
      "body": "What is keeping many people from living a full free life without being tied to a particular job that only gives you 2 days off per week is the means, if you can not afford such life style then you must one way or the other work to sustain your livelihood.Right now there is nothing more i need than leave my job completely but my income is not going to sustain me much if i don't have a steady income stream, so what to do  Many people want it but only few can afford to leave that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "May 20, 2023, 05:17:29 PM",
      "body": "Nothing comes for free in this life and we will only reap what we sow, these two words have a very big meaning, there must be a price to be paid for everything, and remember, too much of everything is bad.If you sleep all day, eat and sleep, you will get obsessed and it's unhealthy, heart disease can follow.If you eat too much sugar you will get diabetes.Ups and downs will always be the way of live, I would rather work 6 days a week to have a balanced life than sit my ass down doing nothing and having all the money I needed, working, moving from one place to another is far more healthy and using all your days to relax.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 20, 2023, 07:37:26 PM",
      "body": "Some people like this, some does it to survive, or others do it because they have no other options. Depending on your need, this could feel like hell or heaven. Also, there's a term that says, you need money in order to make more money. Many choose these 9–5 jobs so that they can save enough money in order to start a business on their own. So if you have a plan and enough asset to start something like that, you can decide to quit your job. But for me, the competition is so high. So grab any opportunity you can get. Have something as your backup and then move onto something new if that involves risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "May 20, 2023, 09:27:02 PM",
      "body": "Quote from: bitzizzix on May 20, 2023, 04:30:13 PMThat's life, sometimes things don't go the way we expect but there is no choice to be able to accept it because on average everyone does the same thing working 5 days a week and 2 days off and some even only have 1 day off. And I think that's normal because most are like that and will get used to situations like that and it all depends on how they manage their homework and vacation during the 2-day vacation and also plan holidays when there is a red date.and i enjoy the state i think the same as you and most importantly after 8 hours of work i still have 16 hours of rest and also with my family and for the next 10 or 20 years i just want to have a business and be boss with some workers and one- my only hope is to make a profit from bitcoin which i do in the long term. And with that I can enjoy life with other things with my family.I understand your point; the majority of us will go through this lifestyle for the rest of our lives. Personally, I've always had one day off per week, and it wasn't enough. I can't imagine spending the rest of my life with so little time off. Moreover, you don't have 16 hours of free time like you mentioned; add another 8 hours of sleep, eating, and commuting to work and back, and you'll end up with less than 6 hours of free time available on a daily basis. Personally, this isn't enough for me, and I'm going to attempt to find a way to avoid living the rest of my life so limited.Quote from: KiaKia on May 20, 2023, 05:17:29 PMNothing comes for free in this life and we will only reap what we sow, these two words have a very big meaning, there must be a price to be paid for everything, and remember, too much of everything is bad.If you sleep all day, eat and sleep, you will get obsessed and it's unhealthy, heart disease can follow.If you eat too much sugar you will get diabetes.Ups and downs will always be the way of live, I would rather work 6 days a week to have a balanced life than sit my ass down doing nothing and having all the money I needed, working, moving from one place to another is far more healthy and using all your days to relax. My point is that there should be a better work to life balance, not to be lazy and have everything ready for yourself. Life should be more than just surviving on the bare minimums.Quote from: tjtonmoy on May 20, 2023, 07:37:26 PMSome people like this, some does it to survive, or others do it because they have no other options. Depending on your need, this could feel like hell or heaven. Also, there's a term that says, you need money in order to make more money. Many choose these 9–5 jobs so that they can save enough money in order to start a business on their own. So if you have a plan and enough asset to start something like that, you can decide to quit your job. But for me, the competition is so high. So grab any opportunity you can get. Have something as your backup and then move onto something new if that involves risks. Definitely, as someone who only had one day off, I'd be quite satisfied having every weekend off. However, I don't think I'd be happy doing it for the rest of my life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "May 20, 2023, 09:49:39 PM",
      "body": "Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMAre you satisfied with this way of life, or would you prefer to live a different way? What would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this.This will be a big goal for me and I know, one day I can achieve it.Working is still the best option to many because this is their way to make money even if they don’t want to spend most of their days working. I see this to become possible if you already have passive income that can pay for your expenses for the rest of your lives, having good investments is the key and living within your means can help as well. Contentment should be the top goal, as living a happy life matters a lot than to having a work and stressing yourself everyday, know how to balance your life and stay healthy, simple life is all what I want right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "May 20, 2023, 10:23:38 PM",
      "body": "You can take some consolation on the fact that most likely people won't need to work as much in the future. Automation took huge amount of jobs that some of those were replaced by other jobs, but that created employment problems. Next one is the fact that AI is going to take HUGE amount of 9-5 jobs. Combine that with robotics and soon there will be nothing left but onlyfans for us. This might sound cynical but it most likely get people on barricades wanting universal basic income. As rules of work have totally changed, i can see it happening. Even in US where that's basically considered as communism. But when you don't have jobs, what else is there?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 20, 2023, 10:45:23 PM",
      "body": "This is the rat race and that's why we're just like living day to day just to survive and have bare minimum. As long as there's no change, we'd be on this cage forever. Taking a step to change is a good start if you've discovered something that will push you out of 9-5 jobs. You can have some skills that will make you work freely anytime you wish for. We're in the digital and gig economy where it has been possible plus the understanding to Bitcoin and the crypto market.Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMDo you believe that there's a true way to escape this vicious cycle, or are we doomed to live like this forever? Telling me that my minor savings in Bitcoin are going to settle me for the rest of my life isn't going to cut it, because the majority of us won't ever have enough Bitcoin to retire.It's possible but it varies depending on our skills and passion. Don't think that we're doomed for that forever unless you've already accepted your path and that's like to live like that way forever. Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMAre you satisfied with this way of life, or would you prefer to live a different way? I am satisfied with my life for now but that doesn't stop me for wishing and aiming for now. Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMWhat would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this.Ask yourself what's your passion and purpose in life and maybe from there, you'll see some opportunities that would be your ticket to a life changing opportunity. But majority of us already have seen that with Bitcoin but at least for you, there could be something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "May 20, 2023, 10:48:56 PM",
      "body": "Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMAre you satisfied with this way of life, or would you prefer to live a different way? What would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this.No im not really that satisfied specially ive been working on having that 8-5 job for a decade now but is there something i could do? This is the only way on which i could raise up my family on which you wont reallybe having no choice but to deal up with it and accept on whatever things that do happen along the way. If you dont have job then for sure your family would really be suffering and this is something that we dontreally like to happen. We do have those day off which we do wish that it would be that longer but we know that it cant really be just that possible if you are just an employee.You dont have the rights on making some demands on what are the things that you do like and prefer but we could really get out of this shackle if you are really just that havingother income sources and this could be acquired through investment and businesses on which it could really make you do able to sustain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "May 20, 2023, 10:53:45 PM",
      "body": "Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMDo you believe that there's a true way to escape this vicious cycle, or are we doomed to live like this forever? Telling me that my minor savings in Bitcoin are going to settle me for the rest of my life isn't going to cut it, because the majority of us won't ever have enough Bitcoin to retire.Even after retiring, you’ll be facing this vicious cycle if you don’t plan well for your retirement and solely believe on your pension to fend you for the rest of your life. The truth is that we can’t escape this lifestyle unless you’re born with a silver spoon and you’re entitled to all the wealth you’ll ever need throughout your lifetime. I’ve also thought about it several times and I think that’s the only way out of this life.QuoteAre you satisfied with this way of life, or would you prefer to live a different way? What would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this.Everyone will love to have a different life than this where they can do what they want and at anytime they want without anything stopping them. I personally feel you can make that achievable if only you can invest in yourself and become financially undependable, allowing others work and build on your ideas and get paid for that without haven to do anything again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "May 20, 2023, 11:02:44 PM",
      "body": "Of course, I am not happy to spend my life in this kind of working system, but I know that I have to do it and there is no better system than this. However, I have one hope. Its name is Bitcoin and cryptocurrencies. I have a good opportunity to achieve my economic freedom. That's why I will continue to invest in Bitcoin and one day I will break my chains. I'm making an effort to get tickets for the next train and I hope I can make it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "May 20, 2023, 11:18:26 PM",
      "body": "Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMTime passes, and we have nothing to look forward to. We watch our lives pass, and the only thing we're looking forward to is the weekend or 20 days per year of paid time off. We're working a whole year, from 9 to 5 and sometimes even more, at someone else's business just to have an approximate of 20 days of vacation and two days off per week, with many of us having one or even none per week. Is it just me, or does this life sound completely depressing to me? Our ambitions are completely crushed by such a daily routine; our days off are mostly to get things done around the house and to rest. By the time that happens, the day has passed, and we have to go to work again.At least where I'm at, having two days off per week is considered extremely lucky and privileged, especially if it's two days in a row. Personally, I only had one day off per week, and it honestly wasn't enough. On the one hand, I wanted to get things done around the house and rest, but on the other hand, I didn't want to stay inside doing practically nothing to enjoy myself. Thus, the single day off wasn't even close to being enough. Certainly, I'd be better off with two consecutive days off, but still, is that how you want your life to be for the next 10–20 years, or even more?On the one hand, I don't want to complain; through the last few years of working, I've been on vacation four times, from 2020 to 2022, which isn't bad at all. On the other hand, I'd like to constantly travel and explore new destinations, the majority of which we'll never experience through this way of life.Do you believe that there's a true way to escape this vicious cycle, or are we doomed to live like this forever? Telling me that my minor savings in Bitcoin are going to settle me for the rest of my life isn't going to cut it, because the majority of us won't ever have enough Bitcoin to retire.Are you satisfied with this way of life, or would you prefer to live a different way? What would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this. Of course that's something that the people of today are yearning for. We wanna live out the times just like what our grandpas and grandmas experienced back then. But the ugly truth about it is that this is nigh-impossible in the current state of things. It's really hard considering the fact that most things right now are more expensive. And the wages back then are not just livable, but outright something that you could stand to save a portion with. As of now, you'd be lucky to see people that are not taking two jobs just to make ends meet. Does it mean that these people are lazy or slacking off away from their success? Fuck no. It's more about the current state of things that discourages us from having any fun and forces us to live paycheck to paycheck, weekend to weekend. This is exceptionally visible and apparent in third world countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 21, 2023, 01:31:55 AM",
      "body": "What country do you live in? Here, the leave is 50 days, with the possibility of extending it for two weeks if you are sick. The average leave is two days a week, and the majority get two and a half days during the week with 8 hours per day.The problem does not lie in the time of work, but rather the enjoyment of what you do. You will not find a person who loves the work he does who fails to go to work every day, or at least he does not enjoy it. When this is true, time does not make a difference, even if you work three hours a day, it will be annoying Extremely.The solution to get rid of this problem is to create your own business, invest in yourself and your education, and finally save a little money and start investing early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nesty",
      "created_time": "May 21, 2023, 02:40:22 AM",
      "body": "Quote from: Ultegra134 on May 20, 2023, 04:08:29 PMTime passes, and we have nothing to look forward to. We watch our lives pass, and the only thing we're looking forward to is the weekend or 20 days per year of paid time off. We're working a whole year, from 9 to 5 and sometimes even more, at someone else's business just to have an approximate of 20 days of vacation and two days off per week, with many of us having one or even none per week. Is it just me, or does this life sound completely depressing to me? Our ambitions are completely crushed by such a daily routine; our days off are mostly to get things done around the house and to rest. By the time that happens, the day has passed, and we have to go to work again.At least where I'm at, having two days off per week is considered extremely lucky and privileged, especially if it's two days in a row. Personally, I only had one day off per week, and it honestly wasn't enough. On the one hand, I wanted to get things done around the house and rest, but on the other hand, I didn't want to stay inside doing practically nothing to enjoy myself. Thus, the single day off wasn't even close to being enough. Certainly, I'd be better off with two consecutive days off, but still, is that how you want your life to be for the next 10–20 years, or even more?On the one hand, I don't want to complain; through the last few years of working, I've been on vacation four times, from 2020 to 2022, which isn't bad at all. On the other hand, I'd like to constantly travel and explore new destinations, the majority of which we'll never experience through this way of life.Do you believe that there's a true way to escape this vicious cycle, or are we doomed to live like this forever? Telling me that my minor savings in Bitcoin are going to settle me for the rest of my life isn't going to cut it, because the majority of us won't ever have enough Bitcoin to retire.Are you satisfied with this way of life, or would you prefer to live a different way? What would you like to change and how? Personally, I'm clueless and not satisfied with the idea of spending the rest of my life like this.It is the sad reality of life we do work 5 days a week just to be able to earn for a living to survive our daily lives. We are lucky enough to have a job that can sustain our daily needs and need not to worry for the coming days on where we are going to get money to buy our food. Everyone really needs a vacation or a break but sadly that benefit we have is not enough to have a good vacation and relax for ourselves. The vacation leaves varies from different countries and even much worst in others because i heard the company provides only 5 days paid vacation leave and 5 days paid sick leave. Lucky are the ones who worked for a company who thinks the needs of their employees. Right now i am not satisfied with my life, I am trying my best to work really hard to be able to save for my retirement and to help out my family. Maybe one day I could have all the vacation that i need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "May 21, 2023, 02:46:27 AM",
      "body": "Even my self still the same . 2 days off a week is not enough but we dont have a choice as we are poor and if we dont work we dont have nothing to eat. Even my self right now is  going to burning out as it is very stressful to me and im always tired as I always working late. Though this is really pur sacrifices for our family and we should be thankful that we have a job. Jus imagine others have no have and struggling in life but here we are complaining of being tired. We really have the same feeling but we just think the positive side and continue to work",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 21, 2023, 04:53:23 AM",
      "body": "This is why the new norm is work from home. People are sick of the 9-5 jobs in cubicles where they basically do something online which they can easily do at home.Hence they work from home and enjoy spending more time with families. Many businesses ended the work from home options and people just quit and found a job elsewhere because they liked that life style.Who wants to be stuck in traffic for 1 hour then work 9 to 5 and be stuck in traffic for another hour and come home at 6pm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 21, 2023, 05:20:33 AM",
      "body": "Quote from: Husires on May 21, 2023, 01:31:55 AMThe solution to get rid of this problem is to create your own business, invest in yourself and your education, and finally save a little money and start investing early.It sounds very utopian. Everyone understands that finances are needed, and not small ones, in order to have a free life that does not depend on anyone. Not everyone is born with a golden spoon in their mouth, but many try to open their own business, which does not always lead to success.It's easy to say: \"Open your own business, invest, and everything about you will be chocolate\", but in reality, everything looks different.So, OP, those moods and depressive thoughts can happen to anyone, but try to see the sun in the little things. You have a vacation, and you have a job to take a break from. The main thing is that you have health; this is the greatest value that needs to be protected.In my country, when we are visited by decadent thoughts, say: \"The main thing is health; we will buy everything else.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 21, 2023, 06:03:19 AM",
      "body": "Me: I don't like 9 to 5 job, I will resign and become a freelancer where I have a flexible working hours.Also me: Damn, I working more than five days and longer than 8 hours. I can't stay in this job, I will choose become a businessman where I don't need to work.Also me (again): Shit, now I work for 24/7.I think if someone who work under other people business and complaint about the working time, the employee is lazy. What make people don't like working for 9 to 5 job is, the payment he get isn't worth or fair with all the dedication or effort he put for the company.Working for 9 to 5, two days off per weak, have 20 days per year paid time off and the company can fulfill the salary I ask, is a dream for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}