{
  "id": "topic_5468321",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "September 27, 2023, 03:47:25 PM",
  "content": "For those who don't know, Namecoin was the first cryptocurrency project that brought the concept of \"decentralized domain names\". Ethereum came after and ENS was developed. For an Internet that's utterly-centralized, this is a good start. We would have many websites built on P2P tech, all without the single point of failure. These days we have IPFS and several other alternative networks aimed to make the Internet more decentralized. This, combined with a decentralized domain, should make the web truly unstoppable. But to my surprise, the number of websites using decentralized tech are pretty scarce these days.Do you think decentralized domain names are still a thing? Or will they become nothing but a failed experiment? Do you think blockchain networks will be able to replace the ICANN in the future? Your input will be greatly appreciated. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468321",
  "comments": [
    {
      "author": "rhomelmabini",
      "created_time": "September 27, 2023, 03:55:57 PM",
      "body": "Quote from: Abiky on September 27, 2023, 03:47:25 PMDo you think decentralized domain names are still a thing? Or will they become nothing but a failed experiment? Do you think blockchain networks will be able to replace the ICANN in the future? Your input will be greatly appreciated. Thanks. I think domain names doesn't made that incredible gains yet even in the recent bull run. In my opinion, domain name market is set to have its run and I think in the coming years it will be a thing. People will surely want decentralized domain names and I don't think it's a failed experiment, that's the thing they say in the past. Everything is going decentralized and I won't doubt if it will replace ICANN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "September 27, 2023, 04:10:20 PM",
      "body": "Quote from: Abiky on September 27, 2023, 03:47:25 PMDo you think decentralized domain names are still a thing? Or will they become nothing but a failed experiment? Do you think blockchain networks will be able to replace the ICANN in the future? Your input will be greatly appreciated. Thanks. Space Id works alot in decentralized domain and still working on providing best result. This is new technology and will be used when all sites convert to web3. Security in these decentralized domain is much higher and many people love to hide privacy will definitely prefer these domain. As far as replacing ICANN i think it is not easy for Blockchain based domain to complete replace over technology which already used in world wide. Decentralized domain will help empowering the current sites system just like btc is still not replace over banks system but help people in many other ways and same I expected from Blockchain based domain also",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 27, 2023, 04:10:30 PM",
      "body": "Quote from: Abiky on September 27, 2023, 03:47:25 PMFor those who don't know, Namecoin was the first cryptocurrency project that brought the concept of \"decentralized domain names\". Ethereum came after and ENS was developed. For an Internet that's utterly-centralized, this is a good start. We would have many websites built on P2P tech, all without the single point of failure. These days we have IPFS and several other alternative networks aimed to make the Internet more decentralized. This, combined with a decentralized domain, should make the web truly unstoppable. But to my surprise, the number of websites using decentralized tech are pretty scarce these days.Do you think decentralized domain names are still a thing? Or will they become nothing but a failed experiment? Do you think blockchain networks will be able to replace the ICANN in the future? Your input will be greatly appreciated. Thanks. They are a thing as much as other nfts. Hype has gone and people are laughing anything nft related even more. So no one really wants to touch it. And i never really understood the whole decentralized immutablle web pages in the first place. We already have darknet. I imagine that decentralized web would go beyond that and contain way more illegal stuff. Stuff no one really asked for or needs to see, because it could scar them for life. There needs to be a way to admin the content. At least for the node runners option not to participate something illegal and disturbing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 27, 2023, 04:11:30 PM",
      "body": "Quote from: Abiky on September 27, 2023, 03:47:25 PM...Do you think decentralized domain names are still a thing? Or will they become nothing but a failed experiment? Do you think blockchain networks will be able to replace the ICANN in the future? Your input will be greatly appreciated. Thanks. I have read before about decentralized domain and how they are supposed to help to fight against censorship and abuse from domain registers. Though, I must say people never seemed to be very enthusiastic on the decentralized system for the registering of websites. People still continue to use centralized services like GoDaddy, etc.  Probably, because in the eyes on the average no coiner is more convenient to go for the traditional ways, instead learning and educating themselves about projects like Namecoin.It is kind of disappointing how people did not care enough of Namecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 27, 2023, 10:59:11 PM",
      "body": "The problem with decentralized domain name services we have right now is that, we need to have decentralized id/names for each chain across an array of Blockchains which doesn't seem to make much sense. The reason why ENS is so popular is because it is easy to integrate it to wallets and smart contracts to support it. But it becomes a problem when we need different decentralized IDs/Names for each chain and they're not interoperable or used across other chains.Adoption isn't rapid as well because it cost between $10 - $100 on average to get a decentralized name on a particular chain (this is dependent on a number of factors like # of years to register amongst other things).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 27, 2023, 11:31:56 PM",
      "body": "IMHO, their prime is done.I have seen that a lot of people have been enthusiastic and optimistic about that but that's just there being over there. I don't think that it will be peaked again.However, there's this thing that I am considering. Remember AI? They've been there for so long but it's just like got the stop light last year or two. Maybe a come back can happen for these decentralized domains in the near future but nobody knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 28, 2023, 09:10:59 AM",
      "body": "What gives value to the Internet is not decentralization, but rather access speed, data quality, and high download and upload capacities. We rarely use more than 1% of the websites. Every day we use Google, Facebook, Twitter, Instagram, YouTube and other famous services, and we rarely use any service that enhances privacy. If you compare the times of downloading a random application for editing images and the times of downloading the Tor browser or p2p networks, you will find The difference is clear, so privacy and centralization are not what people are looking for and are not willing to sacrifice connection speed for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 28, 2023, 09:38:57 AM",
      "body": "One of the reasons of namecoin failed was that most people don't care on whether the domain they visit is centralized or not. Having a working solution is not enough to convince people to use it.Also, I'm not sure is it really worth it. Not everything what is on blockchain is safe or having enhanced level of security and privacy. But in fact it would have almost the same cons as centralized domains do and authorities would now allow it to work out of their control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "September 28, 2023, 10:10:06 AM",
      "body": "Having a truly decentralized website is not as easy as it sounds, clearly an ENS is not enough. The implementation is quite complex and may only have appeal to users with advanced development capabilities. Conventional sites are superior in many ways and have exceeded the needs of many users, especially beginners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "September 28, 2023, 11:53:43 AM",
      "body": "Quote from: livingfree on September 27, 2023, 11:31:56 PMIMHO, their prime is done.I have seen that a lot of people have been enthusiastic and optimistic about that but that's just there being over there. I don't think that it will be peaked again.However, there's this thing that I am considering. Remember AI? They've been there for so long but it's just like got the stop light last year or two. Maybe a come back can happen for these decentralized domains in the near future but nobody knows.Yeah, way back is the the thing, the latest craze and there are many speculations and predictions that it will be the future. However, if you look at it today, 2023, no one is talking about this kind of projects and I will also say that decentralized domain names is now dead to it's knees.And it's obvious that this kind of craze is comparable to fad, that after it has mature and somewhat people get tired of it, it will be simply forgotten. And if there is another one in the horizon, then people will go to the next hype, that's why crypto works, unfortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "September 28, 2023, 01:10:58 PM",
      "body": "I think the real world demand is there but the decentralized DNS is still at the early stages. Namecoin may have fallen but you still have platforms like Unstoppable and Handshake that are still active. The technology will probably continue to evolve so we'll see how things develop in another 5 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "September 28, 2023, 04:21:30 PM",
      "body": "The lack of urgency made people barely touch the decentralized domain. Besides, it is not standardized yet so many popular browsers tend not fully support to implementing it. AFAIK, Brave, the browser that incorporates web3 as their vision, is the only popular browser that supports decentralized domains.Digging deeper, the domain is not the main risk of a single point of failure, there are other solution that is more mature like using the Tor Onion service. So the combination of lack of urgency, use case, and needs make this experimental project lack adoption. It also needs tobe standardized first so it became mature which will encourage people to see something potential within, because currently it is not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "September 28, 2023, 04:38:37 PM",
      "body": "Maybe decentralized domain trend will come again. It was so much trending before that I bought it to myself personally. I haven't touched it since then and the value of it depleted so much. I don't think I can get back the money I spent in buying that domain but yeah it's one of my \"investment\" last bull market that failed and I lost money on. I hope that there will be a time where it can have it's demand again so I can sold the domain that is rotting in my wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "September 28, 2023, 05:10:22 PM",
      "body": "Quote from: Abiky on September 27, 2023, 03:47:25 PMDo you think decentralized domain names are still a thing? Decentralized domain name is not a thing anymore. There have been many developers who were replicating decentralized domain as copy cat business. Everything is fine without domain. There's no urgency in using domain. It's pretty much the same like NFT. The era for NFT already done. NFT may be dead soon. Quote from: Abiky on September 27, 2023, 03:47:25 PMOr will they become nothing but a failed experiment? Domain was not failed, but people will not need it anymore. The domain is still a thing caused by people are thinking if owning domain can become a way for people to receive airdrop reward. The prospect for the long term is very bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "September 29, 2023, 11:06:06 AM",
      "body": "Quote from: o48o on September 27, 2023, 04:10:30 PMThey are a thing as much as other nfts. Hype has gone and people are laughing anything nft related even more. So no one really wants to touch it. And i never really understood the whole decentralized immutablle web pages in the first place. We already have darknet. I imagine that decentralized web would go beyond that and contain way more illegal stuff. Stuff no one really asked for or needs to see, because it could scar them for life. There needs to be a way to admin the content. At least for the node runners option not to participate something illegal and disturbing.Decentralized domains names are \"immutable\". What's not \"immutable\" is the server where the website is hosted. That can be easily fixed by using alternative networks such as IPFS or ZeroNet. Unfortunately, developers don't care about this as they're only \"following the money\". It's this reason why it's so easy for governments to shut down websites, particularly those that are crypto-oriented. The perfect combination would be to host the website on IPFS and use a decentralized domain provider such as ENS or Unstoppable Domains. Websites would become truly-decentralized, and most of all, censorship-resistant. Darknet doesn't come even close to Blockchain-powered websites, especially when I've read that the Tor network is compromised. I understand the issue of \"hosting illegal stuff\", but isn't the whole point of the Internet about \"neutrality\"? People are responsible of what they put on the web. Ultimately, validators on a decentralized network will decide whenever or not they will allow illegal content \"to go through\".  As long as everything is done right, there should be nothing to worry about. Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrChaos.eth",
      "created_time": "September 29, 2023, 05:20:30 PM",
      "body": "IMO the main problem is the lack of standardization. I agree with who said it's the best use case for NFTs (for wallet ID, not for sites).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "September 30, 2023, 01:14:49 PM",
      "body": "Quote from: asriloni on September 28, 2023, 05:10:22 PMQuote from: Abiky on September 27, 2023, 03:47:25 PMDo you think decentralized domain names are still a thing? Decentralized domain name is not a thing anymore. There have been many developers who were replicating decentralized domain as copy cat business. Everything is fine without domain. There's no urgency in using domain. It's pretty much the same like NFT. The era for NFT already done. NFT may be dead soon. I believe that it is \"still a thing\" in the sense that it exists but also not really a thing that people are really caring about. So if we are talking about existing then yeah it is a thing but not really seeing too many people actually using it. Not that many people care enough to spend money on getting one, the ones who did already bought some and it has been done ever since.I have seen too many people being hyped about it when it first came out, but then slowly overtime it became a lot less interesting and that caused it to be a bit more bland. That's of course with every hype, it becomes very much liked at the start but then slowly it got a lot carried away with time and should be considered a bit different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "October 02, 2023, 04:00:40 PM",
      "body": "Quote from: tygeade on September 30, 2023, 01:14:49 PMI believe that it is \"still a thing\" in the sense that it exists but also not really a thing that people are really caring about. So if we are talking about existing then yeah it is a thing but not really seeing too many people actually using it. Not that many people care enough to spend money on getting one, the ones who did already bought some and it has been done ever since.I have seen too many people being hyped about it when it first came out, but then slowly overtime it became a lot less interesting and that caused it to be a bit more bland. That's of course with every hype, it becomes very much liked at the start but then slowly it got a lot carried away with time and should be considered a bit different.That's the problem. Hype is what kills promising projects in the long run. Decentralized domain names hold promise to make websites resistant against government censorship. If only developers put them to good use, things would've been different now. So far, decentralized names have been used for NFTs. ENS and Unstoppable Domains seem to be the most popular services right now. There was Namecoin-based domains (ending in .bit), but I believe the project is nothing but dead. A pity because this, combined with decentralized CDNs (eg: IPFS) would've made the internet a better place. Maybe someday, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}