{
  "id": "topic_5400393",
  "title": "supersnips",
  "author": "supersnips",
  "created_time": "May 27, 2022, 10:20:35 AM",
  "content": "Hi all! hope you’re doing good ! I have something which could be interesting for Blockchain devs in general and also Solidity devs. If you like Hackathons, make sure to check this one out! ->  xdc.devpost.com, good prizes to win and also looking good in the vita in case of participation! Check it out. Here is some information about the Event: From May 25 - Jul 25, 2022equivalent of 50.000$ in prizes. + chances for future grants and funding+ exposure to XDC Community+ featured in a postQuoteThe (XinFin) XDC Network is an enterprise-ready, open-source, hybrid blockchain for global trade and finance. XDC Network supports all EVM-compatible smart contracts, protocols, and atomic cross-chain token transfers, which means what runs on Ethereum will run on XDC Network. The enterprise-grade XDC Network is compatible with ISO 20022 financial messaging standards and can power a wide range of novel blockchain use cases.In this hackathon, you’ll learn the capabilities of the XDC network and the innovative products and technologies that have been developed that make up the XDC Network. Use this hackathon as an opportunity to expand your knowledge of blockchain and create applications that are highly efficient and trusted globally.[/pre]WHAT TO BUILDBuild a working dApp on the XDC Network within one of the categories listed: DeFi: This includes IDO platform, stable coin (e.g. DAI) price oracle, lending, borrowing, synthetic assets, other DeFi applications Gaming dApps: Play-to-earn (P2E) optimally including NFT integration with the possibility for trading digital property / in-game marketplace trading and other Gaming dApps making use of XDC Network Web3: Create other Web3 tools and infrastructure, DAO, tools, decentralized social platforms Ported dApps: dApps that are ported for any of the above categories or disruptive, new dApps ported from other chains benefitting XDC network utilityNote: All dApps must be deployed on the XDC Network Mainnet.[/pre]More information about the Hackathon visit: xdc.devpost.com For more information about the XDC Network, visit:  xinfin.org and xdc.orgAbout the XDC Network :The XDC Network, the world’s first hybrid blockchain, equipped with both a public state and private sub-networks, enables the protection of personal data while remaining transparent and auditable. The network was designed to meet the needs of enterprises seeking to enhance their business infrastructure, reduce costs and improve visibility through blockchain technology. With interoperable smart contracts, near zero fee transactions and high security, the XDC Network is designed to support a wide range of novel blockchain use cases.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400393",
  "comments": [
    {
      "author": "supersnips",
      "created_time": "May 28, 2022, 08:29:29 PM",
      "body": "https://finance.yahoo.com/news/xinfin-xdc-sponsor-online-global-121800772.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "supersnips",
      "created_time": "July 17, 2022, 10:54:52 AM",
      "body": "New prices for participation and documentation on xdc.dev added.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "supersnips",
      "created_time": "July 19, 2022, 09:45:29 AM",
      "body": "prices update - new total Prizes 51750$",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}