{
  "id": "topic_5422917",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "November 23, 2022, 11:31:56 PM",
  "content": "Central banks have taken a hawkish stance against inflation by raising interest rates at a constant rate. Their goal is to reduce the negative effects of both the COVID-19 pandemic and the Russo-Ukraine war on the global economy. While history has shown us that rising interest rates reduces inflation over time, this time is different. There are huge disruptions in the global supply chain and geopolitical tensions are rising at a fast pace. We can't expect inflation to lower down based on rate hikes alone. If the war prolongs to a very long time, I can't imagine how successful central banks will be in trying to tackle inflation for good.Do you think such financial entities will fail in their goal of lowering down inflation? If not, why? Is there still hope for a global economic recovery when the war and the pandemic are at play? Your input will be greatly appreciated. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422917",
  "comments": [
    {
      "author": "Hydrogen",
      "created_time": "November 23, 2022, 11:53:23 PM",
      "body": "I would not expect negative trends to reverse. The massive number of layoffs in the united states tech industry alone should be enough to guarantee a downturn. When inflation, high fossil prices, supply chain disruptions and other issues are sprinkled on top. Its like throwing gasoline on a fire. The fire will not be extinguished under those circumstances.A good question could be whether people will cease and desist in supporting things that elevate inflation higher. Its common for me to see those who claim they want a reduction on inflation. Who continue to support everything guaranteeing inflation trends higher. Will people stop supporting economic policy that leads to high inflation? Will they stop voting for candidates who make pro inflationary political promises? Its difficult for inflation to decline, when people continue to support everything that leads in the opposite direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$anounimus$",
      "created_time": "November 24, 2022, 02:32:16 AMLast edit: January 28, 2023, 09:25:08 AM by $anounimus$",
      "body": "I think such an increase in interest rates will help control inflation. Surely such financial institutions have to be careful if they raise interest rates too high because even those with money can't just sit idly by as they watch their investments, especially in the stock market, slowly being drained away.We do need a global economic recovery. Most countries are in debt, and their economies have been brought to their knees. Major developed countries must implement policies that stimulate domestic demand to attract these economies back. I don't think war should be anyone's first choice; it's expensive, dangerous, and ultimately ineffective at solving problems.War and pandemics are indeed factors of great concern that must be considered. It will be difficult to predict inflation if things get worse in the future. Well, they probably have some serious thoughts to do, though. My view is that the central bank wants to see price stability. They will use any tool at their disposal to achieve that goal. But what happens when their actions help create a massive asset bubble instead?The world of finance is very fragile, its main enemy is rush money caused by panic. We can all just wait and see what happens next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 24, 2022, 02:36:47 AM",
      "body": "From where I am, raising interest rates is certainly not enough. The rising prices of goods and services here are multi-faceted. Although the invasion in Europe, the rising USD, the disruptions in the global supply chain, as well as the effects of the pandemic have contributed a lot to it, there is also the domestic failure to implement appropriate policies, develop timely programs, provide sufficient financial support, and other measures that could have significantly reduced the impacts of global concerns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 24, 2022, 02:52:17 AM",
      "body": "I am 100% percent sure that inflation will drop way down under 3%.Just not sure when. Also not sure how long USD can keep crushing the Pound and the Eurothe pound has rallied back a lot against the dollar. 1.07 to 1.21the euro rallied a bit .96 to 1.04these ratios are key to how long the US Fed can rise rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rokok lokal",
      "created_time": "November 24, 2022, 03:51:30 AM",
      "body": "The market crowd are the most prolific forecasters and the Government has printed a lot of money to keep interest rates from rising. They benefit from low rates for a while, but when they stop working, it can get complicated. Plus, consumer goods are getting more expensive, fuel costs are going up and taxes are going up. I don't think central banks can free people forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "November 24, 2022, 04:55:18 AM",
      "body": "Quote from: $anounimus$ on November 24, 2022, 02:32:16 AMI think such an increase in interest rates will help control inflation. Surely such financial institutions have to be careful if they raise interest rates too high because even those with money can't just sit idly by as they watch their investments, especially in the stock market, slowly being drained away.We do need a global economic recovery. Most countries are in debt, and their economies have been brought to their knees. Major developed countries must implement policies that stimulate domestic demand to attract these economies back. I don't think war should be anyone's first choice; it's expensive, dangerous, and ultimately ineffective at solving problems.War and pandemics are indeed factors of great concern that must be considered. It will be difficult to predict inflation if things get worse in the future.Well, they probably have some serious thoughts to do, though. My view is that the central bank wants to see price stability. They will use any tool at their disposal to achieve that goal. But what happens when their actions help create a massive asset bubble instead?The world of finance is very fragile, its main enemy is rush money caused by panic. We can all just wait and see what happens next.You said it right, the CPI is already coming down which reflects that interest rate increase is working. Beside interest rates increase governments should also increase sale/purchase of government securities through open market operations to further reduce money supply but if cost push factors are the cause rise in inflation then money tightening policy will not produce targeted results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "November 24, 2022, 09:06:42 AM",
      "body": "Inflation will normalize if the currency hasn't completely collapsed as long as there isn't an increase in spending or money supply. You'll just have to pay higher prices for goods than you did in the past. Central banks will be successful but that isn't really the point. The point is that there's a systematic process by the banks and government to keep inflation at 1-2% yearly in order to promote currency usage and there isn't even a guarantee that the banks can hit this target. If the government decides to print more money, it's their prerogative without advisory from the citizens.Citizens get their purchasing power reduced, and there isn't anything they can do about it even after inflation is stabilized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "November 24, 2022, 09:53:39 AM",
      "body": "We seem to have no choice but to raise rates, but I believe inflation will eventually fall to a manageable level. As announced yesterday, the Fed has said that the rate hike has brought down inflation and it is intending to start reducing future rate hikes for the economy to recover. This is not the first time the economy has gone through a crisis and in the past, we have always recovered and boomed afterward. Maybe this time as you say we are in worse situation but by no means there is no solution, I believe everything will start to stabilize in 2024",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "November 24, 2022, 10:05:09 AM",
      "body": "Quote from: Gyfts on November 24, 2022, 09:06:42 AMInflation will normalize if the currency hasn't completely collapsed as long as there isn't an increase in spending or money supply. You'll just have to pay higher prices for goods than you did in the past. Central banks will be successful but that isn't really the point. The point is that there's a systematic process by the banks and government to keep inflation at 1-2% yearly in order to promote currency usage and there isn't even a guarantee that the banks can hit this target. If the government decides to print more money, it's their prerogative without advisory from the citizens.Citizens get their purchasing power reduced, and there isn't anything they can do about it even after inflation is stabilized.Yes: Currency devaluation is worse than inflation like it happened many developing countries after Ukraine war broke out and price of food & crude oil skyrocketed due to disruption in supply chain. The worst hit country was Srilanka where foreign exchanged reserves were totally diminished and no dollars were left in their central bank to pay their import bills. The Ukraine war is the mother of all economics crisis, it should come to an end now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 24, 2022, 11:59:37 AM",
      "body": "Central banks will do their job as always, and inflation and recession will do their job, the price is paid by all of us who support politics and its actions in one way or another. What is important to know is that the consequences of the pandemic are still coming to fruition, and that the consequences of the war will only come to fruition in the years to come.Although some perceive it as a war between Russia and Ukraine, it is much more than that, considering who is behind Ukraine and who is behind Russia - so it is actually a limited version of a world war in which everyone participates but in a limited area. How long it will last depends on whether at some point Russia will admit defeat and retreat to the positions before the aggression, or whether Ukraine will achieve a military victory with Western military and financial aid.The world economy will recover, but it is only a question of when it will fall into some new problems again - because decades of poor management of resources and destruction of the environment will not bring us a peaceful and prosperous future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 24, 2022, 12:39:45 PM",
      "body": "Quote from: philipma1957 on November 24, 2022, 02:52:17 AMI am 100% percent sure that inflation will drop way down under 3%.Just not sure when. Also not sure how long USD can keep crushing the Pound and the Eurothe pound has rallied back a lot against the dollar. 1.07 to 1.21the euro rallied a bit .96 to 1.04these ratios are key to how long the US Fed can rise rates.1.Do you have a crystal ball or something? Even the biggest economists in the world don't predict inflation under 3%.2.The USD \"keeps crushing the pound and the euro only because the Federal Reserve increased the interest rates higher than the British central bank or the European central bank. The war in Ukraine and the natural gas shortage in Europe also plays a role.The only thing that can stop the inflation is the recession. The central banks have to be really careful with their policies.They have to keep the balance between lowering the inflation and supporting the economy in times of a recession. Those two goals kinda contradict themselves. I'm not an optimist for 2023 and 2024. Maybe after 2025 things will get better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "November 24, 2022, 06:40:21 PM",
      "body": "Quote from: Lucius on November 24, 2022, 11:59:37 AMCentral banks will do their job as always, and inflation and recession will do their job, the price is paid by all of us who support politics and its actions in one way or another. What is important to know is that the consequences of the pandemic are still coming to fruition, and that the consequences of the war will only come to fruition in the years to come.Although some perceive it as a war between Russia and Ukraine, it is much more than that, considering who is behind Ukraine and who is behind Russia - so it is actually a limited version of a world war in which everyone participates but in a limited area. How long it will last depends on whether at some point Russia will admit defeat and retreat to the positions before the aggression, or whether Ukraine will achieve a military victory with Western military and financial aid.The world economy will recover, but it is only a question of when it will fall into some new problems again - because decades of poor management of resources and destruction of the environment will not bring us a peaceful and prosperous future.I think the main reason behind inflation rise was printing of money in huge amounts during the covid-19 period. Every government did it to keep their economy running which was the right step in given situation at that time, but it caused huge increase in money in circulation. FED has taken the right step by increasing interest rate (many times during the year) to reduce money supply which is producing desired results. Ukraine war (which is a madness and should be stopped before it spreads to whole Europe) also contributed to the rise in price of food & energy because supply was disrupted. I am optimistic that inflation will gradually come down becuase food and energy prices are stabilizing now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "November 24, 2022, 10:13:14 PM",
      "body": "Quote from: philipma1957 on November 24, 2022, 02:52:17 AMI am 100% percent sure that inflation will drop way down under 3%.Just not sure when. I think it generally takes something like 18 months for the effects of raising interest ratesto take full effect in the goal of reducing inflation.It's the boom to bust tactics which works for increasing and reducing inflation. Centralbanks are raising interest rates in various increments, when the they cripple a lot ofpeople and recession takes hold and inflation drops they will start reducing interest ratesto stimulate growth and the cycle starts again.So no central banks will not fail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "November 24, 2022, 10:39:28 PM",
      "body": "Quote from: Abiky on November 23, 2022, 11:31:56 PMCentral banks have taken a hawkish stance against inflation by raising interest rates at a constant rate. Their goal is to reduce the negative effects of both the COVID-19 pandemic and the Russo-Ukraine war on the global economy. While history has shown us that rising interest rates reduces inflation over time, this time is different. There are huge disruptions in the global supply chain and geopolitical tensions are rising at a fast pace. We can't expect inflation to lower down based on rate hikes alone. If the war prolongs to a very long time, I can't imagine how successful central banks will be in trying to tackle inflation for good.Do you think such financial entities will fail in their goal of lowering down inflation? If not, why? Is there still hope for a global economic recovery when the war and the pandemic are at play? Your input will be greatly appreciated. Thanks. Central bank's are often portrayed as some sort of super intelligent and insightful organizations that can somehow prepare for future problems. However as we saw with the financial crisis in 2008 and how inflation has overwhelmed them, they are often merely reacting to events or sometimes even cause them through poor regulatory controls. Be careful where you put your faith as it can be an illusion to keep the masses pacified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 25, 2022, 01:34:40 PM",
      "body": "Lowering the inflation rate and its impact will not fully rely on the central banks decisions. There has to be some tie with the economic factors like asking the OPEC to produce more supply of oil.That's one of the biggest factor that they have to consider to lower the impact of the inflation. Because when oil increases, everything goes up and it's a major ingredient for an economy to fall and have more expensive goods and services due to high price of oil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 25, 2022, 02:42:51 PM",
      "body": "They have already failed.Increasing interest rates can only succeed if they can actually reduce inflation by reducing the energy cost. If you look at most of the previous times they manipulated the market by working with interest rate, they followed that up by decreasing fossil fuel prices like oil. However, this time not only they failed to have any major effects on oil price (it is still above $90 and eyeing $100+) but also the gas price is still very high.The interest rate is already 4-5% in US and EU and it is at the highest amount it can be. Any further rise won't have any effects as the previous time FED increased the rates it didn't have the effects they hoped for. So now it is causing recession instead while energy prices are still high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 25, 2022, 03:16:25 PM",
      "body": "Quote from: pooya87 on November 25, 2022, 02:42:51 PMIncreasing interest rates can only succeed if they can actually reduce inflation by reducing the energy cost. If you look at most of the previous times they manipulated the market by working with interest rate, they followed that up by decreasing fossil fuel prices like oil. However, this time not only they failed to have any major effects on oil price (it is still above $90 and eyeing $100+) but also the gas price is still very high.Yeah, in your world maybe, in reality, WTI is at $78 and Brent at $85, as usual!Quote from: pooya87 on November 25, 2022, 02:42:51 PMThe interest rate is already 4-5% in US and EU and it is at the highest amount it can be.It's 1.5% in the EU, but don't let details like numbers stand in your way.Quote from: davis196 on November 24, 2022, 12:39:45 PM1.Do you have a crystal ball or something? Even the biggest economists in the world don't predict inflation under 3%.\"Biggest economist\" ?QuoteIn a note published over the weekend, Goldman’s economic research team led by Jan Hatzius, said that the core price consumption expenditures index, the gauge of price pressures that strips out volatile items like food and energy which is closely watched by the U.S. central bank, will drop from the current level of 5.1% to 3.5% by the middle of 2023 and may hit 2.9% by December The team expects the Consumer Price Index to ease to a year-over-year pace of 3.2% by September 2023, down significantly from the 8.2% seen this September.This is the first sign of a long-expected improvement in monthly inflation reports that should bring the rate down to a little above 3% by the end of next year.Different agencies' predictions differ, putting US CPI inflation within the range of 7.0% to 8.1% percent in 2022 and around 2.8-3.5% in 2023. All agencies predicted that CPI inflation in 2023 will be 0.8-1.5% higher compared to the Federal Reserve target of 2%. By 2025, CPI inflation in the US is expected to return to 2%.Quote from: philipma1957 on November 24, 2022, 02:52:17 AMI am 100% percent sure that inflation will drop way down under 3%.Don't you dare be optimistic about something, read the mood of the room, we're all doomed!Actually, that rhymes!  But it's indeed funny.In the previous topic, I read everyone was looking at the new generation as people who can't overcome a challenge, who are dependent on their smartphones, the generation that will crumble under an ounce of stress, and look what we have here, almost everyone saying the world is done for, that nothing better will come, that we live in a matrix where we're just at the mercy of the ones controlling it and so on, I can't make head and tails of what's happening here.On one side we promote independence how the new system will change things, and how problems will be fixed, on the other side, nothing you can do, just crawl under your bed and swipe for the bad news. If the economy recovers and we see inflation back to 1-2%, lower unemployment, and the war will be over I think we need to start having some counseling topics to prevent a few users to commit suicide as they will have a total breakdown seeing another apocalypse failing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lixer",
      "created_time": "November 25, 2022, 04:35:52 PM",
      "body": "Quote from: Gyfts on November 24, 2022, 09:06:42 AMInflation will normalize if the currency hasn't completely collapsed as long as there isn't an increase in spending or money supply. You'll just have to pay higher prices for goods than you did in the past. Central banks will be successful but that isn't really the point. The point is that there's a systematic process by the banks and government to keep inflation at 1-2% yearly in order to promote currency usage and there isn't even a guarantee that the banks can hit this target. If the government decides to print more money, it's their prerogative without advisory from the citizens.Citizens get their purchasing power reduced, and there isn't anything they can do about it even after inflation is stabilized.That’s the thing, people do not realize that what gone up, and caused the inflation, doesn't need to go up and stay high and still cause the inflation to drop. Like for example a carton of milk can go from 1 dollar to 4 dollars, that’s 4x inflation and terrible right? But, next year if it goes from 4 dollars to 5 dollars that’s only 25%, and the year after that if it goes from 5 to 5.05 that’s only 1%.Now, in 3 years it went from 1 to 5.05, but the inflation is 1% for the last one. That’s the key here, it will still be all things very high in price for sure, there is no doubt about that but the inflation will not keep on growing bigger and bigger, it will look like it’s going down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 25, 2022, 04:38:06 PM",
      "body": "once FED pivots, this will go run wild again while they send stimulus money. it becomes a cycle, after stimulus, they will again raise interest rate.how long can they hold down the inflation because this is already a runaway inflation when you see news the banks are already not allowing people to withdraw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}