{
  "id": "topic_5430050",
  "title": "fennic",
  "author": "fennic",
  "created_time": "December 18, 2022, 08:27:07 PM",
  "content": "France's Kylian Mbappe won the Golden Boot award at Qatar 2022 courtesy his hat-trick in the final. Lionel Messi finished second with seven goals.Kylian Mbappé also got Golden Boot reward thanks to his hatrick in 2022 World cup and it was joy for him.And I think that Cristiano Ronaldo made 6 golas with 3rd place. Both Lionel Messi and Mbappé was at 5 scores before reaching world cup final. And Mbappé made 3 scores and Lionel Messi made 2 scores. But still Messi Won world Cup.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430050",
  "comments": [
    {
      "author": "crzy",
      "created_time": "December 18, 2022, 08:38:21 PM",
      "body": "Those are the top three key players for their respective teams and with their finals appearance, Mbappe becomes more aggressive and winning the Golden boot while Messi have his own golden ball. This world cup was superb, maybe we missed this kind of scenario since the pandemic happened, its good to see Football coming alive and seeing the fans, its pretty solid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 18, 2022, 08:42:47 PM",
      "body": "Quote from: fennic on December 18, 2022, 08:27:07 PMFrance's Kylian Mbappe won the Golden Boot award at Qatar 2022 courtesy his hat-trick in the final. Lionel Messi finished second with seven goals.Kylian Mbappé also got Golden Boot reward thanks to his hatrick in 2022 World cup and it was joy for him.And I think that Cristiano Ronaldo made 6 golas with 3rd place. Both Lionel Messi and Mbappé was at 5 scores before reaching world cup final. And Mbappé made 3 scores and Lionel Messi made 2 scores. But still Messi Won world Cup. Mbappe scored three goals but two goals were scored with penalties during regular time while Messi only scored one goal with penalty during regular time.I must say that the goal that Mbappe scored not with a penalty it was a masterpiece from him.It is not important to win such prizes although they have their own importance,what is important is that who won the World Cup and that was Messi which is like a great way to end his personal career.For Mbappe there will be enough time in other World Cups as he will be playing many of them because of his young age,and to show his skills and also hopefully to bring back to France the World Cup title again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zackgeno96",
      "created_time": "December 18, 2022, 08:45:20 PM",
      "body": "A great achievement. Will the goals in the extra time of the final also be counted? Then he would have scored no less than 3 goals in a match. That is unprecedented at this level. He will not enjoy it much, he would rather have become world champion and that Messi would have had the title of top scorer. Messi is the big winner. Mbappe will participate in the World Cup more often, but was invisible for almost the entire game today. His moment came with a 2-1 lead by Argentina in which he managed to shoot in the 2-2 in a great way. In any case, there is room for another golden boot for his trophy cabinet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 18, 2022, 08:49:25 PM",
      "body": "Mbappe winning the golden boot is a well deserved victory for him, I mean that guy is damn good, I've never get to watch him play before but after seeing how he assisted in their second goal against Morocco in the semi finals, I doughed my cap for him, he is an epitome of talent, an example playing creatively.He absolutely deserved the win, since he could take the cup for the second time in a roll, I think it's only fair that he was able to win the golden boot as the highest goal scorer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "December 18, 2022, 09:10:15 PM",
      "body": "Quote from: swogerino on December 18, 2022, 08:42:47 PMQuote from: fennic on December 18, 2022, 08:27:07 PMFrance's Kylian Mbappe won the Golden Boot award at Qatar 2022 courtesy his hat-trick in the final. Lionel Messi finished second with seven goals.Kylian Mbappé also got Golden Boot reward thanks to his hatrick in 2022 World cup and it was joy for him.And I think that Cristiano Ronaldo made 6 golas with 3rd place. Both Lionel Messi and Mbappé was at 5 scores before reaching world cup final. And Mbappé made 3 scores and Lionel Messi made 2 scores. But still Messi Won world Cup. Mbappe scored three goals but two goals were scored with penalties during regular time while Messi only scored one goal with penalty during regular time.I must say that the goal that Mbappe scored not with a penalty it was a masterpiece from him.It is not important to win such prizes although they have their own importance,what is important is that who won the World Cup and that was Messi which is like a great way to end his personal career.For Mbappe there will be enough time in other World Cups as he will be playing many of them because of his young age,and to show his skills and also hopefully to bring back to France the World Cup title again.In extra time Messi also scored one of his best goals, both of them played very well, but the one who should be highly appreciated in that final was Mbappe, when Mbappe stepped up to collect the golden boot, a huge round of applause enveloped the Lusail Stadium. He wasn't too happy either, it was obvious that due he wasn't winning a trophy. You're right there is still time for Mbappe in the next four years he could still play in the world cup if not injured, while Messi possibility will quit his career.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ILuckyGuyI",
      "created_time": "December 18, 2022, 09:26:59 PM",
      "body": "Mbappe was nearly finishing the World Cup without a penalty goal. But things changed in this game of course. He needed to take that responsibility in both penalties in regular and extra times. He still scored only two penalty goals so far as far as I know so this is still very impressive. I don't want to underestimate penalty goals of course. Because it isn't an easy job either as you need to be ready to take it psychologically. If you hesitate even a little then you can easily lose your concentration and fail.The penalty Kane missed cost England the World Cup as you know. Mbappe has had a great tournament despite France's failure at the end. He is just adding extra value into himself by performing impressively in every tournament he joins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "December 18, 2022, 10:45:25 PM",
      "body": "Quote from: Zackgeno96 on December 18, 2022, 08:45:20 PMA great achievement. Will the goals in the extra time of the final also be counted? Then he would have scored no less than 3 goals in a match. That is unprecedented at this level. He will not enjoy it much, he would rather have become world champion and that Messi would have had the title of top scorer. Messi is the big winner. Mbappe will participate in the World Cup more often, but was invisible for almost the entire game today. His moment came with a 2-1 lead by Argentina in which he managed to shoot in the 2-2 in a great way. In any case, there is room for another golden boot for his trophy cabinet.As far as I know, there haven't been anyone before able to score a hat trick in a world cup final, so that's a first for him.He also won the young player of the tournament in the previous world cupHe is probably going to be the next best thing in the world arena of football.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Velvet78",
      "created_time": "December 18, 2022, 11:12:19 PM",
      "body": "Honestly I was expecting to see Messi finishing as the top scorer and getting Golden Boot. But Mbappe's extra performance was really great and it was enough to leave Messi behind. Mbappe fought with all he had in this final game as well. Maybe he wasn't seen very active until scoring the first goal. But after the awakening, he started to perform very effectively.Mbappe was one of the best players in the World Cup in terms of effort. Maybe they aren't the winner of the cup but Mbappe deserves all the appreciation for doing his best and making a huge contribution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "December 18, 2022, 11:13:09 PM",
      "body": "Quote from: nullama on December 18, 2022, 10:45:25 PMQuote from: Zackgeno96 on December 18, 2022, 08:45:20 PMA great achievement. Will the goals in the extra time of the final also be counted? Then he would have scored no less than 3 goals in a match. That is unprecedented at this level. He will not enjoy it much, he would rather have become world champion and that Messi would have had the title of top scorer. Messi is the big winner. Mbappe will participate in the World Cup more often, but was invisible for almost the entire game today. His moment came with a 2-1 lead by Argentina in which he managed to shoot in the 2-2 in a great way. In any case, there is room for another golden boot for his trophy cabinet.As far as I know, there haven't been anyone before able to score a hat trick in a world cup final, so that's a first for him.He also won the young player of the tournament in the previous world cupHe is probably going to be the next best thing in the world arena of football.No doubt, just 23 years and his performance is at the peak. As said he's going to be one among the best thing in world of football. He won the golden boot award, but he wasn't happy as the efforts he made didn't bring the expected result. This year Enzo Fernandez have won the young player award. Lets see how each one making their future progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "December 18, 2022, 11:16:16 PM",
      "body": "No doubt if mbappe has been scoring lots of goals. it's caused by he was taking all of penalty that already given to the france and that's why he has become the striker with most scores for the current season of world cup. although he was not able to win the trophy but he has won the trophy last world cup. He can also try to get another chance again for the upcoming world cup. I guess if france is also rely on mbappe in this case. I meant we must take a look at how mbappe was also trying to get the second trophy but his team mates have been making his dream ended without trophy for the current world cup but mbappe has proven if he was a good striker. Im giving all of my respect to him. Mbappe is a goat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "December 19, 2022, 02:28:52 AM",
      "body": "Quote from: nullama on December 18, 2022, 10:45:25 PMQuote from: Zackgeno96 on December 18, 2022, 08:45:20 PMA great achievement. Will the goals in the extra time of the final also be counted? Then he would have scored no less than 3 goals in a match. That is unprecedented at this level. He will not enjoy it much, he would rather have become world champion and that Messi would have had the title of top scorer. Messi is the big winner. Mbappe will participate in the World Cup more often, but was invisible for almost the entire game today. His moment came with a 2-1 lead by Argentina in which he managed to shoot in the 2-2 in a great way. In any case, there is room for another golden boot for his trophy cabinet.As far as I know, there haven't been anyone before able to score a hat trick in a world cup final, so that's a first for him.He also won the young player of the tournament in the previous world cupHe is probably going to be the next best thing in the world arena of football.For sure, he will be the biggest name in football for the next coming years with this kind of performance in world cup, and that hat trick though, hard to do in this kind of tournament. And it just shows how special this kind of players and what will be his future in the sports and for France as well.For Messi, finally and could be considered the GOAT in this generation of footballers and his name are being mentioned along the greats like Pele and obviously the great Diego Maradona.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 19, 2022, 02:59:39 AM",
      "body": "Quote from: fennic on December 18, 2022, 08:27:07 PMFrance's Kylian Mbappe won the Golden Boot award at Qatar 2022 courtesy his hat-trick in the final. Lionel Messi finished second with seven goals.Kylian Mbappé also got Golden Boot reward thanks to his hatrick in 2022 World cup and it was joy for him.And I think that Cristiano Ronaldo made 6 golas with 3rd place. Both Lionel Messi and Mbappé was at 5 scores before reaching world cup final. And Mbappé made 3 scores and Lionel Messi made 2 scores. But still Messi Won world Cup. The good thing about Mbappe is that he is only 23 years old, he has a whole football career ahead of him, while Cristiano and Messi will never play in a World Cup again. In Cristiano's case, I don't know how the World Cup will have affected him, with the ego he has. At the end of the day, we can say that Messi is a better player than Cristiano, and some say he is the best player of all time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 19, 2022, 03:28:23 AM",
      "body": "Quote from: Don Pedro Dinero on December 19, 2022, 02:59:39 AMThe good thing about Mbappe is that he is only 23 years old, he has a whole football career ahead of him, while Cristiano and Messi will never play in a World Cup again. In Cristiano's case, I don't know how the World Cup will have affected him, with the ego he has. At the end of the day, we can say that Messi is a better player than Cristiano, and some say he is the best player of all time. Yesterday Lionel Messi successfully fulfilled his long time ambition and became one of the greatest footballers in the world. But this world cup also launched a youngster Kylian Mbappe to a path of greatness. The second goal in that finals was classic, this wonderkid didn't let the ball to drop before he gave it an outstanding finish. With Cristiano Ronaldo and Messi leaving the the global football stage in few years, the next side attraction to global football would be Mbappe. He is confidence, fearless and bold at just 23 years. But his only undoing might be his immature character challenges that sometimes make him unhealthily competitive and temperamental.Messi is not better than Ronaldo because he led Argentina to a world cup victory while Ronaldo was unfortunate not to have achieved that feat. Both of them are great players in the same class. There are some indicators that might prove that Ronaldo is also better than Ronaldo. However, it is better not to discuss this issue because it can lead to a long and sometimes protractive argument.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "December 19, 2022, 04:18:03 AM",
      "body": "Mbappe, Messi and CR7 are great players who appeared in the 2022 world cup, the goals they scored have entertained anyone who watched the match. Mbappe appeared extraordinary in the final, the golden boot that Mbappe got thanks to the hat trick he got at the top of the party. On the one hand he is happy because he has managed to get the golden boot, but on the other hand Mbappe is very sad because his hat trick failed to lead France to win a trophy.Mbappe still has time for the next world cup, while Messi and Ronaldo are not certain to appear in the upcoming world cup due to their old age. After Messi and Ronaldo retired from football, it was Mbappe turn to set individual records.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Enevilly",
      "created_time": "December 22, 2022, 08:44:52 PM",
      "body": "This guy has a great future, he will be a great soccer player.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chinedu kalu",
      "created_time": "December 25, 2022, 04:47:57 AM",
      "body": "Messi and Ronaldo are the true legends of modern football. Mpabbe has emerged to take their place once they stop playing football.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "December 25, 2022, 06:08:58 AM",
      "body": "Messi is the undisputed GOAT now, nothing can be argued against that. It’s now considered a fact, I think. Mbappe is only like 24 years old, he has many years ahead of him. He could be one of the greatest strikers of all time, to be honest his performance throughout the tournament & specifically the final, you could say he deserved to be on the winning team but this is football. You don’t always get exactly what you deserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZeSjoV",
      "created_time": "December 29, 2022, 07:29:41 PM",
      "body": "Mbappe was a little short of two championships, even though he is young and already a great player",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LosNoches",
      "created_time": "December 30, 2022, 02:21:29 PM",
      "body": "Why does no one write about the fact that the legend is gone? Pele, we'll miss you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}