{
  "id": "topic_5463057",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "August 12, 2023, 07:40:43 PM",
  "content": "Bioden has withheld protection so far...RFK Jr. Renews Demand For Secret Service Protection After Assassination Of Ecuadorian Candidatehttps://www.zerohedge.com/political/rfk-jr-renews-demand-secret-service-protection-after-assassination-ecuadorian-candidateMr. Kennedy's campaign manager Dennis Kucinich publicly called on President Biden to order Secret Service protection for Mr. Kennedy following the assassination of an Ecuadorian anti-corruption presidential candidate.Ecuador presidential candidate Fernando Villavicencio who recently promised to get rid of corruption and lock up the country's drug runners, was shot and killed at a political rally in Quito, the capital.Mr. Villavicencio, 59, was killed on Aug. 9, less than two weeks before a special presidential election. He was known for speaking out against drug gangs, and while he wasn't a front-runner, his death has caused increased concern about organized crime.\"The killing of Mr. Villavicencio proves how volatile the political climate has become,\" Mr. Kucinich said in a press release sent to The Epoch Times.\"Yesterday the FBI confronted a man who had threatened President Biden, an incident that led to the man being shot dead by government agents.\"Mr. Kucinich, a 16-year member of Congress, continued:\"Mr. Kennedy has met all criteria for protection. The only conceivable reason he is being denied is because of a conscious decision by the White House to deny him security and [expletive] the consequences.\"...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463057",
  "comments": [
    {
      "author": "o48o",
      "created_time": "August 13, 2023, 11:59:58 AM",
      "body": "Quote from: BADecker on August 12, 2023, 07:40:43 PMBioden has withheld protection so far...-cut-FYI it's Alejandro Mayorkas who determines who gets secret service protection, as he decides who qualifies as a major candidate (under the authority of Title 18, United States Code, Section 3056). Not BidenAnd funny how RFK jr sees, that assassination happening because of political climate, not because that candinate was going after organized crime organisation, bringing tighter regulations to corrupted government, while RFK jr is a nutjob comparing US to equador of all places, why not compare US to russia while he is on it.And i wonder how Badecker of all people don't think that US secret service is somehow an ukraina-related operation as they have same colors in their flag. That kind of ridiculous mental acrobatics would be right on his alley.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 13, 2023, 05:16:46 PM",
      "body": "^^^ Political climate is one of the big reasons that assassinations are carried out. Big Business has its fingers in Government, and pulls many of the strings of political candidates.. Personally, I think that RFK, Jr., isn't big enough fish to warrant assassination by the Biden team, the CIA, or Big Business. But he might be getting there.He and Trump really should get together for 2024. A Trump/RFK President/Vice-President team would be supremely unbeatable, except by super-fraudulent operations.And, lol, you are the one who noticed the similar flag colors. So you think it up, and try to pin it on me. Good work, my... say, are you a man or woman or trans?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 13, 2023, 06:53:47 PM",
      "body": "Perhaps it is just me, but using the sad case of the political assassination in Ecuador to compare it to what it could happen to a political candidate for the Presidency of the United States is rather out of place. Both countries are very different from one another in terms of organized crime and the consequences which an assassination of such magnitude would imply in America.While I agree that if a candidate is relevant enough and has reasons to fear for his/her personal security, then the government should provide protection to him/her. it is matter of common sense, in my opinion.Though, I am not sure if RFK is relevant enough as politician in this presidential race, still one should give him the benefit of the doubt an take his word seriously; nobody wishes to be assassinated, after all...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 13, 2023, 10:59:32 PM",
      "body": "Quote from: Hispo on August 13, 2023, 06:53:47 PMPerhaps it is just me, but using the sad case of the political assassination in Ecuador to compare it to what it could happen to a political candidate for the Presidency of the United States is rather out of place. Both countries are very different from one another in terms of organized crime and the consequences which an assassination of such magnitude would imply in America.While I agree that if a candidate is relevant enough and has reasons to fear for his/her personal security, then the government should provide protection to him/her. it is matter of common sense, in my opinion.Though, I am not sure if RFK is relevant enough as politician in this presidential race, still one should give him the benefit of the doubt an take his word seriously; nobody wishes to be assassinated, after all...The point is that RFK should be getting protection like other major candidates do. The polls show that He has at least 20% of the Dem vote.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 14, 2023, 10:08:32 AM",
      "body": "Quote from: BADecker on August 13, 2023, 10:59:32 PMQuote from: Hispo on August 13, 2023, 06:53:47 PMPerhaps it is just me, but using the sad case of the political assassination in Ecuador to compare it to what it could happen to a political candidate for the Presidency of the United States is rather out of place. Both countries are very different from one another in terms of organized crime and the consequences which an assassination of such magnitude would imply in America.While I agree that if a candidate is relevant enough and has reasons to fear for his/her personal security, then the government should provide protection to him/her. it is matter of common sense, in my opinion.Though, I am not sure if RFK is relevant enough as politician in this presidential race, still one should give him the benefit of the doubt an take his word seriously; nobody wishes to be assassinated, after all...The point is that RFK should be getting protection like other major candidates do. The polls show that He has at least 20% of the Dem vote.While I agree with you, I don't think he has such a percentage among democrat voters. The things he has said during interviews, concerning vaccines, the corona virus and other topics would rather turn away most of Democrat in age of voting. Also, even if he gets the protection he is asking for, political assassination is very rare in the United States. It is a country of law and order, after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rybako",
      "created_time": "August 14, 2023, 11:10:56 AM",
      "body": "Well, if voicing opinions gets you protection, my X / Twitter account deserves a personal SWAT team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 14, 2023, 09:41:33 PM",
      "body": "If RFK would team up with Trump as his VP, he'd get the protection. Anybody know how either of them feel about this idea?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 18, 2023, 04:39:11 PM",
      "body": "Quote from: BADecker on August 14, 2023, 09:41:33 PMIf RFK would team up with Trump as his VP, he'd get the protection. Anybody know how either of them feel about this idea?I won't happen. Trump has much to offer to and RFK does not make anything which could appeal to Trump's political ambitions. It would make more sense if Trump teamed up with MTG or other Republican who still supports him, both politically and in the cases with in being accused of defrauding the United States of America. Iromically, If Pence was offered to be the VP of Trump again, I think he would accept in order to enhance his political career once more, even if he was asked to retract all the things he has said on and off the record and in his book, though Trump feels betrayed by him in many levels, so that won't happen either, he seems to have a very strong sense of pride.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 18, 2023, 04:54:41 PM",
      "body": "^^^ I guess I agree. RFK isn't that big of a thing, yet. The one thing that a Trump/RFK team might do for Trump is, it might bring a bunch of Dems over to Trump (because RFK is Dem, at least in name), who would have felt hopeless and lost otherwise.But, I don't hold out any expectations for a Trump/RFK team.4th Indictment Sends Trump Surging in National Polls; https://banned.video/watch?id=64dd5e1c4e506ac6f5ad288aIf the purpose of indicting Trump was to make him less popular or electable, then the plan has backfired. [Donald] Trump now has more support than ever, and is beating Biden constantly in the National Polls. Owen Shroyer breaks down this phenomenon with the latest polls as well as what's happening inside the Republican party. Breanna Morello was on the ground in Georgia dealing with the evidence of voter fraud, she joined the show to discuss what she presented to Brian Kemp. Alex Stein joins the show to discuss his latest, and perhaps most ridiculous, stunt yet. Dr. Ben Marble talks about the lies that lead us into the death trap of the covid vaccine....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 19, 2023, 10:06:55 AM",
      "body": "Quote from: BADecker on August 18, 2023, 04:54:41 PM^^^ I guess I agree. RFK isn't that big of a thing, yet. The one thing that a Trump/RFK team might do for Trump is, it might bring a bunch of Dems over to Trump (because RFK is Dem, at least in name), who would have felt hopeless and lost otherwise.But, I don't hold out any expectations for a Trump/RFK team.-cut-No matter how batshit insane RFK jr is, Trump would seem like even more of a loser next to him. I mean he is ripped compared to trump. Trump wants attention and praise like any old vain man. That's why he is not getting back into Twitter or getting Elon as running mate either. In his mind Elon would outshine him, and make him look even poorer than he is.My guess is that Trump wants more hypocrite, so he gets some sort of denounced weird religious biggot christian tv pastor running with him. Something he outshines in his mind and can look down on, but has religious fanbase. He would love the idea of people praying of him and to him as a holy man. That tv pastor would also validate his narcissist personality with misogynic and racist values as a wannabe dictator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 19, 2023, 10:33:42 AM",
      "body": "Quote from: o48o on August 19, 2023, 10:06:55 AMQuote from: BADecker on August 18, 2023, 04:54:41 PM^^^ I guess I agree. RFK isn't that big of a thing, yet. The one thing that a Trump/RFK team might do for Trump is, it might bring a bunch of Dems over to Trump (because RFK is Dem, at least in name), who would have felt hopeless and lost otherwise.But, I don't hold out any expectations for a Trump/RFK team.-cut-No matter how batshit insane RFK jr is, Trump would seem like even more of a loser next to him. I mean he is ripped compared to trump. Trump wants attention and praise like any old vain man. That's why he is not getting back into Twitter or getting Elon as running mate either. In his mind Elon would outshine him, and make him look even poorer than he is.My guess is that Trump wants more hypocrite, so he gets some sort of denounced weird religious biggot christian tv pastor running with him. Something he outshines in his mind and can look down on, but has religious fanbase. He would love the idea of people praying of him and to him as a holy man. That tv pastor would also validate his narcissist personality with misogynic and racist values as a wannabe dictator.I completely agree with your point of view. Even if a TV pastor does not have any political experience, Trump would choose him as a running mate for the reasons you have already presented. However, I could see Trump going along with Elon as running mater in the case Trump ran desperate enough to get an even wider voting base and not only needed to appeal to religious conversative people but also young people who are fans or Elon and are within the right political spectrum. Though, One of Trump's problems is the fact he cannot be aware enough of his own legal situation to feel desperation and take choices which would likely improve his chances not to end up in prison and become the president. An example of it is he admitting to crimes in his public speeches. Trump declaring under oath is a nightmarish scenario for his lawyers. (Also the fact he does not seem to pay them as promised)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 20, 2023, 04:31:14 PM",
      "body": "Quote from: Hispo on August 19, 2023, 10:33:42 AMQuote from: o48o on August 19, 2023, 10:06:55 AMI completely agree with your point of view. Even if a TV pastor does not have any political experience, Trump would choose him as a running mate for the reasons you have already presented. However, I could see Trump going along with Elon as running mater in the case Trump ran desperate enough to get an even wider voting base and not only needed to appeal to religious conversative people but also young people who are fans or Elon and are within the right political spectrum. Though, One of Trump's problems is the fact he cannot be aware enough of his own legal situation to feel desperation and take choices which would likely improve his chances not to end up in prison and become the president. An example of it is he admitting to crimes in his public speeches. Trump declaring under oath is a nightmarish scenario for his lawyers. (Also the fact he does not seem to pay them as promised)Even though that would bring him more votes, i think he would avoid sharing a spotlight. As he probably sees Elon as a threat. That's why he won't be joining back to twitter either, as appearing to be rich and strong successful business man is his whole modus operandi. Crawling back because someone bought the whole twitter and gave his account back makes the situation seem like someone feels pity for him and giving his account back is a handout.There's a reason thy pence was his VP. He seems like a wussies in contrast, and makes Tramp look better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}