{
  "id": "topic_5455988",
  "title": "Ultegra134",
  "author": "Ultegra134",
  "created_time": "June 10, 2023, 07:33:29 PM",
  "content": "The latest SEC lawsuit against Binance has caused a massive market crash, with BNB suffering the most, going as low as $233, the lowest it has ever been in 2023. Bitcoin has also suffered great losses, but it's not as bad as BNB, which hasn't stopped falling since the incident started and got progressively worse for altcoins when the SEC labeled 46 of them as securities to be avoided at all costs. Some of which include BNB, XRP, BUSD, MANA, and plenty of others. Personally, I believe that the condition is starting to become worrying, especially if Binance loses and there's no settlement, which would also have disastrous consequences for the market in general.The most worrying of all is BNB, which is in freefall and its future might be doomed if no solution is found. What's your take on this? Do you think that a solution will be found to avoid any further losses, or are governments on their way of winning the war against cryptocurrencies?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455988",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "June 10, 2023, 07:47:24 PM",
      "body": "At this point all we need to do is to hodle because that is the ultimate goal,  if you are holding Bitcoin before the market drop to 25k you are already in a loss, but what the price becomes in the next minutes no one knows, so to be at your best stage you need to handle 100%.Bitcoin is the best form of asset and at that one need to have a fundamental knowledge of how the technology works, and also how to apply all the various market reaction to the current need and time, with all the market crisis that has resulted in maa massive dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "June 10, 2023, 07:58:34 PM",
      "body": "Matic/polygon is another one in the trap.  SEC is definitely swinging theor weight right now but we've seen these things before.  Don't know if it's worth buying the dip but if these coins tread water amd make it out there are some serious opportunities to be had.  I'm hedging my bet and cost averaging down on some of my positions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "June 10, 2023, 08:54:28 PM",
      "body": "Quote from: Ultegra134 on June 10, 2023, 07:33:29 PMThe latest SEC lawsuit against Binance has caused a massive market crash, with BNB suffering the most, going as low as $233, the lowest it has ever been in 2023. Bitcoin has also suffered great losses, but it's not as bad as BNB, which hasn't stopped falling since the incident started and got progressively worse for altcoins when the SEC labeled 46 of them as securities to be avoided at all costs. Some of which include BNB, XRP, BUSD, MANA, and plenty of others. Personally, I believe that the condition is starting to become worrying, especially if Binance loses and there's no settlement, which would also have disastrous consequences for the market in general.The most worrying of all is BNB, which is in freefall and its future might be doomed if no solution is found. What's your take on this? Do you think that a solution will be found to avoid any further losses, or are governments on their way of winning the war against cryptocurrencies?It really seems like the crypto market just does not really get a longer time span to just rest and to be a left alone so it can slowly but surely start to grow again. Now the SEC came around with another news about an investigation and a lawsuit and the prices of all projects are crashing since a few days. I was pretty happy when i bought Cosmos (Atom) for a little bit below 10$ a few months ago and today it even scratched at the 7 dollar mark for a few minutes, now it is at around 8$, so still a 20% loss in comparison to my investment and with NEAR it is the same or even a little bit worse. Sadly i don't have any funds available at the moment so i can not stock up and good projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 10, 2023, 08:58:16 PM",
      "body": "I’m wondering if Binance will leave the US market, are they can still work well? US SEC are the only problem to cryptomarket while the other countries are not doing any pressure against the top exchanges. Binance will survive on this, though its better to wait for the real bottom of the price since there’s a chance for Binance to go lower $200 again, its sad but this might be the next price for BNB.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "molsewid",
      "created_time": "June 10, 2023, 09:43:25 PM",
      "body": "Quote from: goaldigger on June 10, 2023, 08:58:16 PMI’m wondering if Binance will leave the US market, are they can still work well? US SEC are the only problem to cryptomarket while the other countries are not doing any pressure against the top exchanges. Binance will survive on this, though its better to wait for the real bottom of the price since there’s a chance for Binance to go lower $200 again, its sad but this might be the next price for BNB. I am not sure but they can still operate their market in other countries. People can still do trading but the thing is if people in the US want to trade in Binance I think they need to use VPN since it will be banned for sure. When this thing happen I know that Cz and his team has already a plan on this. Yes it will affect the market but not too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "June 10, 2023, 09:44:09 PM",
      "body": "Quote from: Wiwo on June 10, 2023, 07:47:24 PMAt this point all we need to do is to hodle because that is the ultimate goal,  if you are holding Bitcoin before the market drop to 25k you are already in a loss, but what the price becomes in the next minutes no one knows, so to be at your best stage you need to handle 100%.Bitcoin is the best form of asset and at that one need to have a fundamental knowledge of how the technology works, and also how to apply all the various market reaction to the current need and time, with all the market crisis that has resulted in maa massive dump. My DCA on Bitcoin is approximately $28,000, so I'm definitely at a loss but I honestly don't mind Bitcoin, I'm certain that it'll recover. I'm more worried about BNB, which I had bought somewhere around $280 and it's currently at a huge loss.Quote from: wheelz1200 on June 10, 2023, 07:58:34 PMMatic/polygon is another one in the trap.  SEC is definitely swinging theor weight right now but we've seen these things before.  Don't know if it's worth buying the dip but if these coins tread water amd make it out there are some serious opportunities to be had.  I'm hedging my bet and cost averaging down on some of my positions.I'm not sure if it's worth buying any coin at the moment, the situation is pretty tense and unpredictable. I honestly didn't expect BNB to crash like that in such a short time period. Bitcoin seems like a safer option than any other altcoin, but this is evident that anything negative (or positive) can occur at any time.Quote from: molsewid on June 10, 2023, 09:43:25 PMQuote from: goaldigger on June 10, 2023, 08:58:16 PMI’m wondering if Binance will leave the US market, are they can still work well? US SEC are the only problem to cryptomarket while the other countries are not doing any pressure against the top exchanges. Binance will survive on this, though its better to wait for the real bottom of the price since there’s a chance for Binance to go lower $200 again, its sad but this might be the next price for BNB. I am not sure but they can still operate their market in other countries. People can still do trading but the thing is if people in the US want to trade in Binance I think they need to use VPN since it will be banned for sure. When this thing happen I know that Cz and his team has already a plan on this. Yes it will affect the market but not too much. From my understanding, only Binance.us users will be affected if they stop operations, but it'll have lasting consequences to everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 10, 2023, 09:57:22 PM",
      "body": "This is expected, if there’s a government pressure the market will react on that and its too bad since we failed to break the resistance before. Let’s hope that the cryptomarket will survive on this or else we will failed again and the hope for a decentralization might not happen. Let’s support BNB here and as long as they didn’t violate any, then we should stay focus and not to panic selling. Buy if there’s an opportunity, BTC is still the best choice as of the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 10, 2023, 09:59:59 PM",
      "body": "Quote from: Ultegra134 on June 10, 2023, 09:44:09 PMAt the moment BNB is around $238 and if you bought at 280 and in large quantity then you are already in great lose and this is something to worry about but then I am sure that the price of BNB will recover along with Bitcoin in the coming week since the price has been greatly affected by the funds that have been speculated around the CZ/binance law suet and in the long term all this will fade away given chances to more market breaking. BNB have a good ecosystem that will help its price to recover quickly I think we should be more worried about meme coins which have no real liquidity provision to back their price recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davide72",
      "created_time": "June 10, 2023, 10:34:20 PM",
      "body": "Quote from: Ultegra134 on June 10, 2023, 07:33:29 PMThe latest SEC lawsuit against Binance has caused a massive market crash, with BNB suffering the most, going as low as $233, the lowest it has ever been in 2023. Bitcoin has also suffered great losses, but it's not as bad as BNB, which hasn't stopped falling since the incident started and got progressively worse for altcoins when the SEC labeled 46 of them as securities to be avoided at all costs. Some of which include BNB, XRP, BUSD, MANA, and plenty of others. Personally, I believe that the condition is starting to become worrying, especially if Binance loses and there's no settlement, which would also have disastrous consequences for the market in general.The most worrying of all is BNB, which is in freefall and its future might be doomed if no solution is found. What's your take on this? Do you think that a solution will be found to avoid any further losses, or are governments on their way of winning the war against cryptocurrencies?I think it's more a speculative move ,especially many altcoins dump is huge, the BTC has held up very well and in any case the last few months had grown so much so I think it is normal that it makes retracements",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "June 10, 2023, 10:49:07 PM",
      "body": "everyone should already know the obvious that this lawsuit follows up will most certainly make some massive waves of correction in the future.i honestly think that at the first news of the lawsuit that should be the right chance to liquidate the funds otherwise, we will suffer great lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 10, 2023, 11:07:31 PMLast edit: June 10, 2023, 11:36:43 PM by AmoreJaz",
      "body": "Quote from: Johnyz on June 10, 2023, 09:57:22 PMThis is expected, if there’s a government pressure the market will react on that and its too bad since we failed to break the resistance before. Let’s hope that the cryptomarket will survive on this or else we will failed again and the hope for a decentralization might not happen. Let’s support BNB here and as long as they didn’t violate any, then we should stay focus and not to panic selling. Buy if there’s an opportunity, BTC is still the best choice as of the moment. this will just be another bottleneck in this market. but we all know that we can always surpass such challenge. i don't think this will have long-term effect on the market. remember, how many times have we seen such event in this market, and yet, the market survive and keep on going. it may have short impact once the verdict becomes public, but we always bounce. we are not going to disappear if they think they can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "June 10, 2023, 11:28:51 PM",
      "body": "Quote from: Ultegra134 on June 10, 2023, 07:33:29 PMThe latest SEC lawsuit against Binance has caused a massive market crash, with BNB suffering the most, going as low as $233, the lowest it has ever been in 2023. Bitcoin has also suffered great losses, but it's not as bad as BNB, which hasn't stopped falling since the incident started and got progressively worse for altcoins when the SEC labeled 46 of them as securities to be avoided at all costs. Some of which include BNB, XRP, BUSD, MANA, and plenty of others. Personally, I believe that the condition is starting to become worrying, especially if Binance loses and there's no settlement, which would also have disastrous consequences for the market in general.The most worrying of all is BNB, which is in freefall and its future might be doomed if no solution is found. What's your take on this? Do you think that a solution will be found to avoid any further losses, or are governments on their way of winning the war against cryptocurrencies?Why is BNB most worrying? Imho it always was problematic. This is just those problems manifesting themselves.Everyone knew that it's going to be centralized. Even if it has smart contracts it's still an exchange coin and totally dependable about Binance. Reason why it rises was because everyone thought Binance was untouchable. And for a long time it seemed to be so. They have done so much for some many people, giving charities and most likely lobbying a lot in everywhere in the world.Still everyone knew deep down that BNB is going to be be paired with well being of Binance. This is what \"fudders\" were afraid of, and now when it's unrevealing in front of everyone, people will soon realize that if binance loses, the bottom of bnb is going to be zero. And that would make this crypto winter last for ages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 10, 2023, 11:41:24 PM",
      "body": "Quote from: Ultegra134 on June 10, 2023, 07:33:29 PMThe most worrying of all is BNB, which is in freefall and its future might be doomed if no solution is found. What's your take on this? Do you think that a solution will be found to avoid any further losses, or are governments on their way of winning the war against cryptocurrencies?From here we can see the status of Binance in the market, because of the negative news it's getting it affected the market, I don't know what the community will look like without Binance, they are the leaders, the innovators, and prime movers of the industry its leader CZ have proven that during the pandemic.Binance should address issues being hurdled to them and I hope they succeed, whatever happens to Binance will have a big impact on the market, especially now that halving is coming, the whole community is now watching.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "June 10, 2023, 11:49:14 PM",
      "body": "Frankly, these lawsuits filed by the SEC did not add too badly to the market. At least there were no serious declines. Except for cryptocurrencies. But if the sanctions continue to increase in the future, then serious decreases will occur. It is useful to follow the market during this period, and these sharp declines can be an exit point for you and it may be inevitable that new millionaires will emerge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "June 10, 2023, 11:53:10 PM",
      "body": "Quote from: zonefloor on June 10, 2023, 11:49:14 PMFrankly, these lawsuits filed by the SEC did not add too badly to the market. At least there were no serious declines. Except for cryptocurrencies. But if the sanctions continue to increase in the future, then serious decreases will occur. It is useful to follow the market during this period, and these sharp declines can be an exit point for you and it may be inevitable that new millionaires will emerge.the impact was seen though and it's quite significant, although the drops generally was about 15% still it's still the early stage of the lawsuit, things could turn on different directionby the time goes, but it's also could be progressing for the worst, after all there's just many things that usually could be out of our prediction.the thing with these news that could affect price in general is that, they really do have some big influence over the market that with some news the market already turning upside down.i'd be more carefuly making some entry right now even if it seems the chance of investing arise, after all, it could be pretty much turning disastrous in the long run if things get worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "June 11, 2023, 12:12:53 AM",
      "body": "Quote from: Ultegra134 on June 10, 2023, 07:33:29 PMThe latest SEC lawsuit against Binance has caused a massive market crash, with BNB suffering the most, going as low as $233, the lowest it has ever been in 2023. Bitcoin has also suffered great losses, but it's not as bad as BNB, which hasn't stopped falling since the incident started and got progressively worse for altcoins when the SEC labeled 46 of them as securities to be avoided at all costs. Some of which include BNB, XRP, BUSD, MANA, and plenty of others. Personally, I believe that the condition is starting to become worrying, especially if Binance loses and there's no settlement, which would also have disastrous consequences for the market in general.The most worrying of all is BNB, which is in freefall and its future might be doomed if no solution is found. What's your take on this? Do you think that a solution will be found to avoid any further losses, or are governments on their way of winning the war against cryptocurrencies?Yes, I think it's BNB that are going to hit big because it is the native token that is being used by Binance so I'm not surprised by it. And then there will be others who have been mentioned in the lawsuit as well.However, for me this is just a temporary setback for the altcoin market. We all know that next year we will have a bull run so I don't think just because there is a SEC lawsuit against big exchange means that this will go on till next year. On the other hand, this is a great opportunity to continue to stack those coins that is going on the downside right now. And then just wait for next year, as it might give everyone a good profits and then thank SEC later for their lawsuit because the price is cheap right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iadegbola34",
      "created_time": "June 11, 2023, 12:58:12 AM",
      "body": "The recent SEC lawsuit really shook things up. It's definitely a concerning situation, especially for BNB. I can understand why you're worried about its future. As for a solution, it's hard to predict, but I believe the crypto community will continue to find ways to adapt and overcome challenges. Governments may pose hurdles, but I think cryptocurrencies will keep evolving. Stay positive! 🚀",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "June 11, 2023, 01:08:43 AM",
      "body": "Quote from: Ultegra134 on June 10, 2023, 07:33:29 PM(...)As you have noticed, the SEC's move against Binance and related changes to crypto laws is a complex matter and can have a significant impact on the crypto market. Even though the current situation is very worrying, don't get too worried and should stay calm and assess situations objectively to make the smartest investment decisions. Regarding the fact that BNB is falling in price and its future may be affected, we need to be concerned with what measures Binance and the SEC can take to solve the problem. Binance may seek to explain and provide more detailed information about its activities to the SEC to help improve the relationship between the two parties and resolve governmental disputes. The SEC may also consider various measures to ensure safety and transparency for investors.Regarding whether governments are winning the war against cryptocurrencies, this is still ongoing and it is impossible to accurately predict the outcome of this war. The cryptocurrency industry is still growing strongly with the support of many countries and large corporations, so investors need to properly assess the situation and make smart and careful investment decisions. important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 11, 2023, 01:21:04 AM",
      "body": "I checked the Bitcoin price and did not find a decrease. What is happening is a natural price movement, perhaps due to panic or panic, but the price is in its normal place.The value of BNB decreased by more than 22%, which is a large percentage, but its price is in the hands of binance, they can burn a lot of it and the price will return again. the reaction of binance and the subsequent steps that it will take are what will determine the future of this currency.I advise you to stay away from it for the time being and see how the company will act.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}