{
  "id": "topic_5471209",
  "title": "Rap111",
  "author": "Rap111",
  "created_time": "October 22, 2023, 12:07:51 PM",
  "content": "In the early days of September, well-known cryptocurrency expert Lark Davis commented that the approval of the spot Bitcoin ETF could increase the price by 350%. Matrixport, the cryptocurrency platform of Chinese billionaire Jihan Wu, compared Bitcoin to gold and predicted that the ETF approval would trigger a serious increase in value. Is ETF Approval Already Priced in?Analyst Joe Edwards from Enigma Securities stated that if ETF approval comes, this will only bring a short-term increase in value and then the Bitcoin price will fall. Edwards stated that the recent fake spot Bitcoin ETF approval news gives important clues about how the market will react in the event of a real approval. Analysts at K33 Research are of the opinion that in the event of a real confirmation, there could be an increase much higher than the reaction seen after fake news. However, they added that they expect a serious decline if spot Bitcoin ETF applications are rejected.Do you think it will really be 100 thousand dollars? What happens if it is?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471209",
  "comments": [
    {
      "author": "Texac",
      "created_time": "October 22, 2023, 12:19:09 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMDo you think it will really be 100 thousand dollars? What happens if it is?If you expect bitcoin to reach $100k, I think you need not expect SEC approval of ETFs because as long as the bull season comes, that goal is not too difficult for bitcoin.  I am even optimistic that bitcoin in the next bull season could even touch $200k, $100k is actually a very modest prediction from some investors and the actual ATH could be much higher, IMO.  but it can't be denied that people are Fomo about ETF news, I also think bitcoin could go up if etfs are approved but then there will be a dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 22, 2023, 12:23:30 PM",
      "body": "Another topic on BTC spot etf taking the price of BTC to the moon.Look, everybody can give their opinions, and it is just their opinion, we do not know what will happen. With the BTC halving for example, we can predict what will happen based on past events, but there's never been a BTC spot etf in the U.S. market, so it is yet to be known how the market will react and i don't know why too many people are so anxious to wait.So many people feel that a spot etf approval is now a matter of when and not if, if it is true then surely it will introduce institutional investors who don't want to hold their keys into the market. The halving is also upon us and a spot etf approval could coincide with it, as such it may be a catalyst to 100k+, but you or me cannot say that this is exactly what's going to happen, so wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rap111",
      "created_time": "October 22, 2023, 01:44:02 PM",
      "body": "Quote from: Z-tight on October 22, 2023, 12:23:30 PM BTC spot etf'te BTC'nin fiyatını aya götüren başka bir konu.  Bakın, herkes fikir verebilir ve bu sadece onların fikridir, ne olacağını bilmiyoruz. Örneğin BTC'nin yarılanmasıyla, geçmiş olaylara dayanarak ne olacağını tahmin edebiliriz, ancak ABD pazarında hiçbir zaman bir BTC spot etf olmadı, bu yüzden piyasanın nasıl tepki vereceği henüz bilinmiyor ve neden çok fazla insanın beklemek için bu kadar endişeli olduğunu bilmiyorum.  Pek çok insan, spot etf onayının artık ne zaman ve ne zaman değil, eğer doğruysa, o zaman kesinlikle anahtarlarını piyasaya tutmak istemeyen kurumsal yatırımcıları tanıtacağını düşünüyor. Yarılanma da üzerimizde ve bir spot etf onayı buna denk gelebilir, çünkü bu nedenle 100k+ için bir katalizör olabilir, ancak siz ya da ben tam olarak ne olacağını söyleyemeyiz, bu yüzden bekleyin. [/alıntı]Yes, I hope such a situation will happen and bitcoin investors will be happy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "October 22, 2023, 01:50:28 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMIn the early days of September, well-known cryptocurrency expert Lark Davis commented that the approval of the spot Bitcoin ETF could increase the price by 350%.How did Lark Davis know about that?Does he have a time traveling machine and did not go to the future to see Bitcoin at 350% higher than today price when a first Bitcoin Spot ETF approved?I am sure he does not have any time traveling machine and he did not go to future to see anything. What he tweeted is his speculation that we can do too. Think of speculation, do you think speculation has good accuracy?Speculations are for fun and to hype newbies but if you believe in speculations, bet all, you can lose your money. Will Lark Davis lose anything while you lose your money? He will not lose anything but you have to be responsible for your belief in his speculation and will have to live with your loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "October 22, 2023, 02:00:35 PM",
      "body": "First off, let's set the record straight and say that bitcoin wouldn't rise in valuation from the ETF alone. The fact of the matter is that bitcoin is a little picky when it comes to ATH factors and something as fickle as a centralized entity willing to put bitcoin for sale on their stall for wall street retards to buy is already a poor precedent. I say bitcoin's got a good possibility of reaching a new ATH come next bull run, but I'm not gonna be so sure about whether it would reach $100,000 as people are looking forward to, or if the ETF would cause it to rise in value. I think for now the best thing to talk about is preparing, we still have a couple of months to go before we really see changes in bitcoin's price, historically the halving wouldn't jumpstart the bitcoin economy, it would take at least a year before we really see changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 22, 2023, 02:06:20 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMIn the early days of September, well-known cryptocurrency expert Lark Davis commented that the approval of the spot Bitcoin ETF could increase the price by 350%. I seriously doubt that bitcoin ETH approval could have such a big infleunec on the price. Eeven that fake Cointelegraph news didn't pump price too much so I don't expect inmcrease anything clsoe to that 350% when ETH gets approved,  whihc is just a matter of time. My advice to you is to stop listening all those \"epxerts\" as no one really knows how high could bitcoin go and those who say they do are bullshiting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "October 22, 2023, 02:11:48 PM",
      "body": "Quote from: Rikafip on October 22, 2023, 02:06:20 PMI seriously doubt that bitcoin ETH approval could have such a big infleunec on the price. Eeven that fake Cointelegraph news didn't pump price too much so I don't expect inmcrease anything clsoe to that 350% when ETH gets approved,  whihc is just a matter of time. My advice to you is to stop listening all those \"epxerts\" as no one really knows how high could bitcoin go and those who say they do are bullshiting. I have similar thinking like yours. Because Bitcoin began to have smaller 4-year bull runs with time and I think it is very reasonable. With bigger market cap after each cycle and with smaller effect from halving (I know block reward is always halved after each halving but it seems people will become less FOMO when it halves from 50 BTC to 25, 12.5, 6.25, 3.125 and then smaller).If this shrinking halving effect continues, x2 from each halving cycle is good enough. 350% is too much but if we don't see it in 2024 halving cycle, we can wait for it in 2028 or 2032. I believe we will see 350% growth in future and very  likely in 2028 or 2032 compares to 2023 price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 22, 2023, 03:20:57 PM",
      "body": "Quote from: Rikafip on October 22, 2023, 02:06:20 PMI seriously doubt that bitcoin ETH approval could have such a big infleunec on the price. Eeven that fake Cointelegraph news didn't pump price too much so I don't expect inmcrease anything clsoe to that 350% when ETH gets approved,  whihc is just a matter of time. You may be right that its influence on the price might not be much, and we do not know what is going to happen, but i don't think we can make any prediction because of the fake news by Cointelegraph. Take note that the news was deleted after some minutes and a lot of people discovered it was fake very quickly and maybe that is why the price fell back again after the small pump, i think when or if the real news comes, it may be very different, but of course neither of us knows exactly what will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "October 22, 2023, 03:36:49 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PM cryptocurrency expert Lark Davis He's not an expert. More like one of those youtuber shitcoin pumpers, like bitboy. Quotecommented that the approval of the spot Bitcoin ETF could increase the price by 350%. Possibly.QuoteAnalyst Joe Edwards from Enigma Securities stated that if ETF approval comes, this will only bring a short-term increase in value and then the Bitcoin price will fall. Edwards stated that the recent fake spot Bitcoin ETF approval news gives important clues about how the market will react in the event of a real approval.The recent situation made bitcoin's price go up and then... continue to go up. So the guy can't even use a correct argument to prove his point. The price went higher when the fake news was disproved, which shows that the pump wasn't only the fake news. There's a large demand (mainly speculative) behind bitcoin and that demand isn't fake, or something that will disappear just like that. When funds buy bitcoin that bitcoin disappears from the market. It creates a shortage of supply and increases the price as long as demand remains the same, or goes up, and I don't think it's going to go down after the halving. QuoteDo you think it will really be 100 thousand dollars? What happens if it is?Yes and nothing. The price will be at 100k, just like it was at 60k and in 2018 it was at 20k. Did something happen when the price of bitcoin went from 1k to 10k? It's just a price. One day bitcoin will be worth more than 100k and people like you will ask \"what will happen when it goes to 200k?\" The answer is nothing!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 22, 2023, 04:05:28 PM",
      "body": "Quotein the early days of September, well-known cryptocurrency expert Lark Davis commented that the approval of the spot Bitcoin ETF could increase the price by 350%.Lay emphasis on the word COULD. In the title of your post you used the word WILL, but Lark Davis talked about Could, this are to different would the first could with means there are chances for it to happen or it not to happen while the word will is like a certainty and as far as I am concerned there is no certainty in Crypto-currency.Lack Davis doesn't have the world answers even if he is an expert he is also an influencer and is looking to grow his popularity so do your research and make your own decisions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 22, 2023, 05:10:58 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMDo you think it will really be 100 thousand dollars? What happens if it is?Well, the last date of the ETF approval is I think in the 3rd or 4th month of 2024, and halving is in April of 2024, what I think is, that they are planning to approve the ETFs near the halving event, or maybe after it. Because we all know that in halving, the supply decreases by half as the reward of miners becomes half, and the demand will be tripled if the ETFs get approved. Even the fake news created so much hype in the market, that, halving is yet to occur. This does not only show the impact of ETFs' approval on BTC but also shows that these trends/hypes can also be used to trick BTC investors. I think they are getting out, the small investors from the market, greedy ones. Overall, I don't rely on what K33 or Edwards have to say, I do my own research, make my own plan, and try to not get caught in the loss. But yeah, if the ETF got approved we might see BTC to cross $100,000, but my prediction is, this will be done after the 8th month of 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 22, 2023, 05:15:13 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMDo you think it will really be 100 thousand dollars? What happens if it is?First, change your title from EFT to ETF. That's what the speculations say and everyone can be said of an expert on this market but not everyone gives an accurate prediction. $100k was the prediction of many for the last bull run that we've been in and sadly that it didn't happened.We're all on the time when we have our own price predictions again and this is the reason why it can be another exciting moment of the market when \"experts\" are coming out that we don't know who they are and how long they have been in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Best-mary",
      "created_time": "October 22, 2023, 05:24:25 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMIn the early days of September, well-known cryptocurrency expert Lark Davis commented that the approval of the spot Bitcoin ETF could increase the price by 350%. Matrixport, the cryptocurrency platform of Chinese billionaire Jihan Wu, compared Bitcoin to gold and predicted that the ETF approval would trigger a serious increase in value. Is ETF Approval Already Priced in?Analyst Joe Edwards from Enigma Securities stated that if ETF approval comes, this will only bring a short-term increase in value and then the Bitcoin price will fall. Edwards stated that the recent fake spot Bitcoin ETF approval news gives important clues about how the market will react in the event of a real approval. Analysts at K33 Research are of the opinion that in the event of a real confirmation, there could be an increase much higher than the reaction seen after fake news. However, they added that they expect a serious decline if spot Bitcoin ETF applications are rejected.Do you think it will really be 100 thousand dollars? What happens if it is?To answer your question, I believe Bitcoin would reach $100k due to the hype of this ETF surrounding it. You know, to make people believe it was always worth it. Is just like when the fake news about Bitcoin ETF surfaced twitter, we all saw how the market went all up. Don't also forget, There would be a lot of manipulation too. Hence, the reason I use Dual Investment from time to time not to get caught up in all that happens in the market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 22, 2023, 05:27:52 PM",
      "body": "As much as I'm all in for BTC, it's not gonna be as fast when it goes up, I hope, because if it's too fast, then it might go down even faster.I do hope that everything will go in the right direction when it continues to be applied to everything and a lot of people buy it.Any updates with the ETF?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 22, 2023, 05:30:03 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMIs ETF Approval Already Priced in?From what I know, the last spike that resulted after the last ETF-related fake news should tell loud and clear that US ETF approval is not priced in.Quote from: Rap111 on October 22, 2023, 12:07:51 PMHowever, they added that they expect a serious decline if spot Bitcoin ETF applications are rejected.Short term movements are expected on most ETF news. But serious decline? I kind of doubt it (however, not an investment advice). Keep in mind that hash rate is going up like crazy and halving is getting closer.PS. Shouldn't this topic be part of Speculation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "October 22, 2023, 06:23:20 PMLast edit: October 22, 2023, 06:41:17 PM by Die_empty",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMDo you think it will really be 100 thousand dollars? What happens if it is?Everyone is free to give their own prediction based on personal investigation. I do not believe in any prediction because none of them have given any genuine reason for the forecast. I know the spot Bitcoin ETF will have a positive impact on the price of bitcoin but I have to wait  till this happens. It is better to rely on certain events like the bitcoin halving than to depend on uncertainties like the approval of ETF. Nobody is sure if it will ever happen or when it will come to pass because the SEC still has enough reasons not to make this happen. But if the price gets to $100k that's a good business for me and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "October 22, 2023, 07:09:11 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMIn the early days of September, well-known cryptocurrency expert Lark Davis commented that the approval of the spot Bitcoin ETF could increase the price by 350%. Matrixport, the cryptocurrency platform of Chinese billionaire Jihan Wu, compared Bitcoin to gold and predicted that the ETF approval would trigger a serious increase in value. Is ETF Approval Already Priced in?Analyst Joe Edwards from Enigma Securities stated that if ETF approval comes, this will only bring a short-term increase in value and then the Bitcoin price will fall. Edwards stated that the recent fake spot Bitcoin ETF approval news gives important clues about how the market will react in the event of a real approval.Analysts at K33 Research are of the opinion that in the event of a real confirmation, there could be an increase much higher than the reaction seen after fake news. However, they added that they expect a serious decline if spot Bitcoin ETF applications are rejected.Do you think it will really be 100 thousand dollars? What happens if it is?In 2025 I'm pretty confident we will actually see bitcoin over $100k, I just don't understand why it should fall: bitcoin doesn't need an ETF, we reached $70k in the middle of a global pandemic, if the ETF happens then we potentially have tens of billions of dollars ready to enter the market, how could the price fall while the market cap increase? It doesn't make any sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Huppercase",
      "created_time": "October 22, 2023, 07:31:31 PM",
      "body": "Quote from: Rap111 on October 22, 2023, 12:07:51 PMIn the early days of September, well-known cryptocurrency expert Lark Davis commented that the approval of the spot Bitcoin ETF could increase the price by 350%. Matrixport, the cryptocurrency platform of Chinese billionaire Jihan Wu, compared Bitcoin to gold and predicted that the ETF approval would trigger a serious increase in value. Is ETF Approval Already Priced in?Analyst Joe Edwards from Enigma Securities stated that if ETF approval comes, this will only bring a short-term increase in value and then the Bitcoin price will fall. Edwards stated that the recent fake spot Bitcoin ETF approval news gives important clues about how the market will react in the event of a real approval. Analysts at K33 Research are of the opinion that in the event of a real confirmation, there could be an increase much higher than the reaction seen after fake news. However, they added that they expect a serious decline if spot Bitcoin ETF applications are rejected.Do you think it will really be 100 thousand dollars? What happens if it is?Blackrock controls more than all the top stock and shares in the world today including Vanguard and if Bitcoin spot  ETF eventually get approved, it will become more speculative than before and more elite clubs will want to take over bitcoin as well. There is nothing bad in that but I see this as more centralization coming to bitcoin if bitcoin supply is trapped under Blackrock.Again, because they are prominent and big organization with large share holding doesn't mean we should expect more from them. We should not forget that the same Elon that bitcoin price to 58k sold some at some point to raise some emergency fund. Don't be surprised if blackrock pull stunt in the future, so your price is possible but what is the degree of pushing price that much only for it to fall later, hmmm.As a holder of bitcoin, it's your expectations to see it grow to anything in value but having a specific price in mind can be disappointing. Don't listen to anyone predicting this imaginary price of bitcoin because if it doesn't later happen, you may hate yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "October 22, 2023, 07:43:45 PM",
      "body": "Bitcoin should have reached $100K during the last cycle and was well on its way to 100K in 2021.But as we all know the price topped out at around $65k, due to the crazy tweet by Elon Musk that caused the price to plummet back down to under $40K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}