{
  "id": "topic_5473453",
  "title": "BetonRed",
  "author": "BetonRed",
  "created_time": "November 09, 2023, 08:39:44 AM",
  "content": "Discover a world of opportunities with different gaming providers in sports, live casinos, and slots.Check out these awesome promotions:• 100% Bonus up to 450€ on first 3 deposits + 250 Free Spins• 50 free spins NO DEPOSIT on Sweet Bonanza with promocode: BALKAN50• Up to 25% daily cashback• Points shop - we reward loyal players - exchange your points for cash, free spins, free bets etc...Crypto deposits with: BTC, USDT, ETH, BNB, DOGERound the clock support via email and Live Chat 24/7Customer Support is available in English and many other languagesJoin us now and let's win together!https://betonred.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473453",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "November 09, 2023, 08:43:03 AM",
      "body": "It says \"404 not found\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 09, 2023, 08:46:55 AM",
      "body": "Quote from: BetonRed on November 09, 2023, 08:39:44 AMJoin us now and let's win together!https://betonred.com/The site is not working, error 404 just as Little Mouse said already. Let us win together? Have you forgotten that it is not possible for a gambling site and gamblers to win together. It is either the gamblers are losing while the house is winning, or the house is losing while gamblers are winning. Because of house edge, the house is winning.Telling people to gamble responsibly and have fun is better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BetonRed",
      "created_time": "November 09, 2023, 08:49:48 AM",
      "body": "Missing https. Now link should work fine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "November 09, 2023, 10:54:49 AM",
      "body": "Quote from: BetonRed on November 09, 2023, 08:49:48 AMMissing https. Now link should work fineWelcome on board.Yes, it does work fine from my end.I just saw your casino yesterday as one of the new crypto casinos and I was planning to write your support email today before I saw that you guys are already on this forum.However, you'll need to buy a Copper membership so we can create a marketing ANN thread.If you need assistance with it or doing promotion for your casino on here just like some new casinos did to be industry-leading let's talk and I will be glad to help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "November 09, 2023, 11:20:44 AM",
      "body": "Welcome into this forum but sadly im restricted or blocked.!We’re sorry, but BetOnRed cannot be accessed.Is your country not restricted?If you’re accessing BetOnRed with a proxy service or VPN, try turning it off and refreshing the pageNeed personalized support?support@betonred.comLiveChatIs it fine to access it via VPN?Welcome again, its better to buy or purchase copper membership on having that fancy ANN thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "November 09, 2023, 11:29:01 AM",
      "body": "Welcome mate. I was able to access your casino website from my end and it works perfectly well. I must say that this is the first time I am seeing a Nigerian owned casino here creating an announcement thread introducing their casino on this platform. I must commend your efforts for doing this. I also noticed you already got a licence from your state government agency to support and back up your operations.  I must commend your efforts to bringing this here. If many of the Nigerian Crypto and blockchain project can come here to do their promotions, it would be very nice projecting the image of the nation. I think you will have to know about the Nigerian Local board to further enteract with Nigerians and keeping them updated with your casino updates and development. As it would also help promote your image here. You can upgrade your account to a copper membership so you could be able to upload pictures of your casino for members here to view as first impression matters alot here. You can see a signature campaign manager to further discuss for your promotional campaign if you already make a budget for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "November 09, 2023, 11:48:50 AM",
      "body": "Quote from: Oilacris on November 09, 2023, 11:20:44 AMIs it fine to access it via VPN?Welcome again, its better to buy or purchase copper membership on having that fancy ANN thread.We have same restrictions due to country. Don’t use VPN because you are breaking their ToS. Probably their license coverage doesn’t include your country. Let’s wait for them to expand their license coverage before we access the casino.I believe I encounter same issue too on new casino in the forum. I notice that new casino is using a license which has a limited coverage unlike the typical Curaçao license that cover almost country worldwide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "November 09, 2023, 02:29:53 PM",
      "body": "Quote from: Little Mouse on November 09, 2023, 08:43:03 AMIt says \"404 not found\" LM the website is working now and the features are nice. I advise the op to buy copper member to enable him to post image. Op You can meet a professional manager here which Little Mouse is one of them to direct you what to do. Op you are welcome to the forum. Feel free to navigate around within the rules and regulations of the forum. Op your KYC is not started clearly in the op so how do you do on your KYC? Is it KYC free or in KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "November 09, 2023, 09:48:59 PM",
      "body": "Quote from: Agbe on November 09, 2023, 02:29:53 PMQuote from: Little Mouse on November 09, 2023, 08:43:03 AMIt says \"404 not found\" LM the website is working now and the features are nice. I advise the op to buy copper member to enable him to post image. Op You can meet a professional manager here which Little Mouse is one of them to direct you what to do. Op you are welcome to the forum. Feel free to navigate around within the rules and regulations of the forum. Op your KYC is not stated clearly in the op so how do you do on your KYC? Is it KYC free or in KYC? Yeah fhs website is finally up and running but against what you said of the site being a nice site,  I don't see much of that yet because I tried to access some of the vital features of the site,  but I was bounced back and the reason is that those features are only open to registered members which I am not so I have to give up on the attempt of trying out the site as claimed in the ops. Although if they become a KYC-free casino,  then only then we can now say that they have a good feature that will attract a lot of gamblers in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "November 10, 2023, 01:15:49 AM",
      "body": "Quote from: Oilacris on November 09, 2023, 11:20:44 AMWelcome into this forum but sadly im restricted or blocked.!We’re sorry, but BetOnRed cannot be accessed.Is your country not restricted?If you’re accessing BetOnRed with a proxy service or VPN, try turning it off and refreshing the pageNeed personalized support?support@betonred.comLiveChatSame here mate, it looks like Philippines is one country in their list of ban nation.Quote from: Oilacris on November 09, 2023, 11:20:44 AMIs it fine to access it via VPN?Welcome again, its better to buy or purchase copper membership on having that fancy ANN thread.I wouldn't go there though, I mean we have been ban already and based on what we have seen in Scam Accusations board, there are a lot of individuals who can't withdraw their money once a casino has found out that they have been using VPN to bypass the ban restriction, just saying.But in any case, welcome to the Forum and I do agree that a copper membership will do good to the OP as they can post a attractive ANN thread here in our community. Visually appealing, it's one reason why gamblers will become curious and might want to test their new casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "November 10, 2023, 02:41:23 AM",
      "body": "Welcome to the forum mate. It seems like you made the ANN thread in some hurry. You had the option to make the ANN thread attractive and filled with accurate informations, but this ANN thread lacks design, and it’s very dull to see. Basically it seems very unprofessional. But upon checking the site, I found that the site is really designed well. The site supports multiple languages and the color combination also looks impressive. Just need to update the ANN design here and the site has the capability to become really big. Hope you will consider my suggestions OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sunderland",
      "created_time": "November 10, 2023, 05:23:13 AM",
      "body": "Hey welcome to bitcointalk, I just checked the platform and plays with the bonus code.So we have to wager 30x with deposit to unlocked the bonus money from free spins?Anyway, the site looks nice and easy to navigate. Bring new games from top providers (slots), I believe some people here will start playing on the platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "November 10, 2023, 08:43:28 AM",
      "body": "Quote from: Nrcewker on November 10, 2023, 02:41:23 AMWelcome to the forum mate. It seems like you made the ANN thread in some hurry. You had the option to make the ANN thread attractive and filled with accurate informations, but this ANN thread lacks design, and it’s very dull to see. Basically it seems very unprofessional. But upon checking the site, I found that the site is really designed well. The site supports multiple languages and the color combination also looks impressive. Just need to update the ANN design here and the site has the capability to become really big. Hope you will consider my suggestions OP.Right, it just shows that the OP or at least the people behind this casino is not very familiar on how to properly promote a site here. We understand it though, but as least with the comments from more experience gamblers, they could go back and edit this thread with more information and of course made a significant improvement in the design. They can either hire some professional members to make it for them.But first, welcome to the community, and second just listen to those comments above me.This is just constructive criticism and you shouldn't take it negatively. So consider those suggestions and for sure you might gain some gamblers to your platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "November 10, 2023, 08:56:36 AM",
      "body": "Quote from: Sunderland on November 10, 2023, 05:23:13 AMHey welcome to bitcointalk, I just checked the platform and plays with the bonus code.So we have to wager 30x with deposit to unlocked the bonus money from free spins?when you say \"wager 30x\" do you mean 30x the deposit amount or just bet 30x? because if it is wager 30x the deposit amount, that is a bit much just to unlock the bonus money from free spins. also, now I wonder if the wagering requirement will reset if the deposit money runs out before the gambler can finish the requirement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "November 10, 2023, 09:11:23 AM",
      "body": "-   If you want to promote a gambling site platform in this forum, I think you will need to apply for a Copper membership so that even if you are a newbie, you can post an image of the gambling platform that you are sharing here.Through this, you will be able to promote the website you have more smoothly, and it will be easy to get potential gamblers in the community on this platform as well, so that others will also think that what you are sharing here with us is credible. Copper Membership",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "November 10, 2023, 09:16:33 AM",
      "body": "Quote from: acroman08 on November 10, 2023, 08:56:36 AMQuote from: Sunderland on November 10, 2023, 05:23:13 AMHey welcome to bitcointalk, I just checked the platform and plays with the bonus code.So we have to wager 30x with deposit to unlocked the bonus money from free spins?when you say \"wager 30x\" do you mean 30x the deposit amount or just bet 30x? because if it is wager 30x the deposit amount, that is a bit much just to unlock the bonus money from free spins. also, now I wonder if the wagering requirement will reset if the deposit money runs out before the gambler can finish the requirement. It is 30x wager. Lets say you win $10 from the free spins so you need to wager $300 to unlock the bonus. In order to wager this $300, you need to bet with your own deposited money. You can deposit any amount as long as you can wager $300 to unlock the $10 bonus. Wagering requirement normally wont be reset of you lost your deposit, you can make a new deposit to continue as long as you think that it is worth. I believe the bonus system is the same as most other bonuses in other casinos, nothing new here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "November 10, 2023, 09:25:45 AM",
      "body": "Quote from: Wapfika on November 09, 2023, 11:48:50 AMQuote from: Oilacris on November 09, 2023, 11:20:44 AMIs it fine to access it via VPN?Welcome again, its better to buy or purchase copper membership on having that fancy ANN thread.We have same restrictions due to country. Don’t use VPN because you are breaking their ToS. Probably their license coverage doesn’t include your country. Let’s wait for them to expand their license coverage before we access the casino.I believe I encounter same issue too on new casino in the forum. I notice that new casino is using a license which has a limited coverage unlike the typical Curaçao license that cover almost country worldwide.Looks like we are all having that restriction guys, sadly this was the first time that I encountered Banning from gambling site.and also since VPN isn't allow then there is no chance that we can use this site .___________________________________________________________for that I will echo others advise to OP making this thread more attracted and worth visiting if you will purchase Copper membership and also tries to Hire a Manager to make your advertising more healthy .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "November 10, 2023, 10:28:01 AM",
      "body": "Welcome mate. I was able to check your website and it looks perfectly good.  I would advise you be very much active here so that members would see how serious you ye your business here and constantly engaging in enteraction and replying to questions and inquiries about your casino would put you in a good position of winning the interest of members as well because first impression matters here as it is been taken note of. Not only that, it also shows how serious you take your customer care service because that is another feature of a casino gamblers look at so therefore it would be good you put this into considerations and act accordingly so as to remain relevant here.I see you have already been advised of promoting your casino and other important activities that could make your presence here well known. All I can say is that you take your time to follow up with activities and do a good promotional campaign for your casino if you must compete with already existing casinos here to remain relevant here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 10, 2023, 10:52:33 AM",
      "body": "The site is very easy to access on my mobile browser but to try the games I have to register, there should be a demo game that doesn't require you to register would be better, but I know that every casino is always different, so still respect that, lots of crypto deposit options from several blockchain networks and that is an additional point that this site also looks interesting.I will add this site to the list and maybe this weekend if I have time try the games on this site by using a little money to test it while waiting for feedback from friends who have tested it, there are many games that I usually play so I am interested in testing it Later, BTW, welcome to the forum and make sure to listen to input from friends here, namely making your account a copper member to add image designs to this thread to make it look attractive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}