{
  "id": "topic_5465956",
  "title": "Julien_Olynpic",
  "author": "Julien_Olynpic",
  "created_time": "September 07, 2023, 07:58:07 AM",
  "content": "Давйте поразмышляем о том, может ли стать биткойн очередной мировой валютой и приемником доллара. Недавно наткнулся на одну интересную инфографику. Сложно сказать, насколько она справедлива, но что-то интересное в ней есть. Согласно этой инфографике, доминирование мировой валюты в среднем протекает в пределах отрезка в 80-110 лет.  Так,  португальский реал, к примеру, доминировало в период 1450-1530 гг (80 лет). Испанский реал — с 1530 по 1640-ой (110 лет). Нидерландский гульден — с 1640 по 1720 (80 лет).Французский франк — с1720- по 1815  (95 лет).Британский фунт стерлингов — с 1815 по 1920 (105 лет).Американский доллар (США) — с 1920 по настоящее время.То есть, сейчас, в 2023-м году, доминированию доллара исполнилось 103 года.   Многие биткойн-максималисты считают, что эстафету доллара перехватит биткойн. Согласны?***",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465956",
  "comments": [
    {
      "author": "Inwestour",
      "created_time": "September 07, 2023, 09:11:17 AM",
      "body": "Quote from: Julien_Olynpic on September 07, 2023, 07:58:07 AMДавйте поразмышляем о том, может ли стать биткойн очередной мировой валютой и приемником доллара. Недавно наткнулся на одну интересную инфографику. Сложно сказать, насколько она справедлива, но что-то интересное в ней есть. Согласно этой инфографике, доминирование мировой валюты в среднем протекает в пределах отрезка в 80-110 лет.То есть, сейчас, в 2023-м году, доминированию доллара исполнилось 103 года.   Многие биткойн-максималисты считают, что эстафету доллара перехватит биткойн. Согласны?Мне конечно биткоин очень нравится, но сейчас мне очень сложно поверить что биткоин может стать доминирующей мировой валютой. Фактически доминирующей валютой становилась валюта, государства которое в этот период переживало период процветания. Отсюда выходит, что биткоину нужно будет такое государство, это чисто логическое размышление. Поверить что на смену доллару придет какой то юань тоже не верится. Я до 2020 года думал что доллар будет той валютой, которая сможет войти в историю как мировая валюта, которая поставит новый рекорд по доминированию, но после того как они начали штамповать новые доллары как не в себя, то я понял, что глобальные циклы будут сохранятся, потому что доллар так долго не выдержит.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "September 07, 2023, 09:27:22 AM",
      "body": "С 1400 по 2000 годы очень многое изменилось. Раньше были государства. Кроме того, монеты чеканили в различных землях, например, в герцогствах и графствах.Однако в 2000 году все изменилось. И это принципиальные изменения, так сказать квантовый скачок!Возник новый фронтир, новые территории, новое виртуальное пространство, Интернет и т.д. - а Биткоин по сути стал основным протоколом передачи стоимости в этом пространстве. И все остальные решения (даже если взять CBDC) они цифровые по своей сути. То есть сейчас доминирует виртуальное пространство, и у Биткоина, как основного протокола передачи стоимости тоже есть все основания претендовать на главную роль. Хотя и USDT тоже пытается претендовать. Он и наследник прежнего лидера (доллара США) и одновременно виртуальный протокол. А есть ещё и CBDC.То есть борьба Игры Престолов началась!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "September 07, 2023, 09:39:22 AM",
      "body": "Quote from: Julien_Olynpic on September 07, 2023, 07:58:07 AMТо есть, сейчас, в 2023-м году, доминированию доллара исполнилось 103 года.   Многие биткойн-максималисты считают, что эстафету доллара перехватит биткойн. Согласны?Если предполагать, что в ближайшее время будет смена лидера, что не факт, то биткойн в те ближайшие 7 лет, когда это теоретически должно случиться, ещё не готов к такой роли. Фактически проблема той же масштабируемости не позволит ему заменить ни одну из резервных валют, которые позволяют делать гораздо большее число транзакций. Стать одной из резервных валют — почему бы и нет, но, скорее, чуть позднее, когда волатильность ещё подснизится. А вот прямо заменить доллар никак. Потому что в какой-нибудь Камбодже наличный доллар прямо так и используется вместе с национальной валютой, и платежи по 1-5-10 долларов там, вероятно, из самых распространённых, и биткойн не сможет сделать то же для таких стран, как Камбоджа, на текущий момент.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "September 07, 2023, 11:06:25 AM",
      "body": "Quote from: Julien_Olynpic on September 07, 2023, 07:58:07 AMТо есть, сейчас, в 2023-м году, доминированию доллара исполнилось 103 года.   Многие биткойн-максималисты считают, что эстафету доллара перехватит биткойн. Согласны?В международных расчётах - нет. Скорее уж юань какой-нибудь. А биткоин пока не готов к тем оборотам, которые должны быть у валюты международных расчётов.Но вот ещё через 100 лет, то есть после юаня, - вполне. Думаю, к тому времени постепенно наработаются технологии, которые позволят биткоину выполнять все те же функции, которые сейчас выполняет доллар.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "September 07, 2023, 12:13:50 PM",
      "body": "Сомневаюсь что биткоин заменит доллар. У него ограниченное количество. А доллар можно печатать сколько угодно. Это надо тогда полностью искоренить коррупцию, инфляцию. Воровать государства как будут?  И как контролировать нефизические деньги? Нее. Никто не захочет такого. Я так думаю.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "September 07, 2023, 02:19:24 PM",
      "body": "Quote from: light_warrior on September 07, 2023, 12:13:50 PMСомневаюсь что биткоин заменит доллар. У него ограниченное количество. А доллар можно печатать сколько угодно. Это надо тогда полностью искоренить коррупцию, инфляцию. Воровать государства как будут?  И как контролировать нефизические деньги? Нее. Никто не захочет такого. Я так думаю.Мне, как-то не верится, что Bitcoin за 100 лет не займёт какую-нибудь нишу, например нишу резервного актива. А заняв эту нишу, он уже не сможет перепозиционироваться в платёжное средство. Мир очень динамичен, никто не будет ждать 100 лет, пока Bitcoin созреет стать платёжным средством. Ну типа  - сейчас юань пропустим на 100 лет, а потом .... Мне кажется, что это так не работает.Если Вы заметили, уже сейчас появился могущественный конкурент в виде USDT. Используют его очень активно, и в настоящее время этот актив уже стал классическим платёжным средством. Он очень популярен. И именно для расчётов.Другое дело, что это суррогатные деньги, и вообще непонятно почему их ещё не запретили. Вероятно есть у них мохнатая лапа на самом верху. При этом, USDT косвенно способствует росту и Биткоина, так как свободно конвертируется с ним. Мне кажется, что Биткоину нужно искать свою нишу. Ему не нужно пытаться стать платёжным средством. У него другие конкурентные преимущества.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "September 07, 2023, 06:02:55 PM",
      "body": "Quote from: Smartprofit on September 07, 2023, 02:19:24 PMQuote from: light_warrior on September 07, 2023, 12:13:50 PMСомневаюсь что биткоин заменит доллар. У него ограниченное количество. А доллар можно печатать сколько угодно. Это надо тогда полностью искоренить коррупцию, инфляцию. Воровать государства как будут?  И как контролировать нефизические деньги? Нее. Никто не захочет такого. Я так думаю.Мне, как-то не верится, что Bitcoin за 100 лет не займёт какую-нибудь нишу, например нишу резервного актива. Пока биток не научится жить в пределах как например тот же доллар к другим валютам, ни о каком резервном активе речи быть не может. Я имею виду волатильность. Кому надо такой резерв если он сегодня 1 рупь стоит а завтра полрубля. Я образно если кто не поймет. Кто ж захочет положив сегодня в свой кошелек 100 рублей (образно говоря) завтра там обнаружить 50 рублей. Понятно что там может и оказаться 200 вместо ста. Но это вилами по воде писано. Понятно что никто никто не хочет по ночам ворочаться и гадать 200 там будет или 50. Нужна более менее стабильнось по движняку. Я так думаю.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 07, 2023, 07:13:15 PM",
      "body": "А кстати вы практически все не верите в то что BTC может стать мировой резервной валютой.Я тоже с этим согласен но не из за исторических аналогий а совершено по другой причине.Для этого нужно чтобы прекратил свое существование  капитализм и воцарилась бы грубо говоря энная версия коммунизма или суперпродвинутого социализма, та что ещё с какими-то деньгами. Во всех остальных обществах и формациях а тем более в диком примитивном капитализма всегда найдётся та  страна которая хочет поживиться и шикарно жить за счёт других. И соответственно иметь при этом монополию на печатание своих денег, что мы и наблюдаем.Ну а разве такая страна может каким то образом отказаться от такой привилегии. Да ни за что. Легче изничтожить все айсики в мире, чем потерять такую возможность.Короче при капитализме биткоин это просто вариант ценой бумаги и он производная от базисной валюты, а не сама базисная валюта.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "September 08, 2023, 04:54:06 AM",
      "body": "QuoteПока биток не научится жить в пределах как например тот же доллар к другим валютам, ни о каком резервном активе речи быть не может. Я имею виду волатильность. Кому надо такой резерв если он сегодня 1 рупь стоит а завтра полрубля. Я образно если кто не поймет. Кто ж захочет положив сегодня в свой кошелек 100 рублей (образно говоря) завтра там обнаружить 50 рублей. Понятно что там может и оказаться 200 вместо ста. Но это вилами по воде писано. Понятно что никто никто не хочет по ночам ворочаться и гадать 200 там будет или 50. Нужна более менее стабильнось по движняку. Я так думаю.Ну а как он (биток) сможет научиться \"жить в пределах\"? Это ведь от самой природы актива зависит. Доллар (да и вообще почти любой фиат) - он почему является хоть сколько-нибудь стабильным и низковолатильным по отношению, например к евро: просто потому, что есть довольно мощная и сложная регуляторная система. У фиата есть такая уникальная штука, как ключевая ставка рефинансирования. Только с помощью одной этой ставки (я уже не говорю о других инструментах) можно манипулировать рынком. У битка такого инструментария нет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "September 08, 2023, 07:32:00 AM",
      "body": "Quote from: BVeyron on September 07, 2023, 07:13:15 PMНу а разве такая страна может каким то образом отказаться от такой привилегии. Да ни за что. Легче изничтожить все айсики в мире, чем потерять такую возможность.Так эта тема буквально про то, что какой бы супер-пуперной ни была страна, рано или поздно она перестаёт иметь достаточно финансовых сил (и прочих других), чтобы именно её валюта становилась доминирующей. Соответственно, хотелка-то может быть у кого угодно, а как будет развиваться положение дел на практике, это не так предсказуемо, как кажется. И классический Рим пал под натиском варваров, а уж насколько была мощная империя некогда. Со временем многое возможно...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "September 08, 2023, 09:50:05 AM",
      "body": "Quote from: BVeyron on September 07, 2023, 07:13:15 PMДля этого нужно чтобы прекратил свое существование  капитализм и воцарилась бы грубо говоря энная версия коммунизма или суперпродвинутого социализма, та что ещё с какими-то деньгами. Во всех остальных обществах и формациях а тем более в диком примитивном капитализма всегда найдётся та  страна которая хочет поживиться и шикарно жить за счёт других. И соответственно иметь при этом монополию на печатание своих денег, что мы и наблюдаем.Ну а разве такая страна может каким то образом отказаться от такой привилегии. Да ни за что. Легче изничтожить все айсики в мире, чем потерять такую возможность.В Европе очень многие страны отказались 25 лет назад от национальных валют.Стимулом было намерение найти альтернативу валюте одной страны, которая «хочет поживиться и шикарно жить за счёт других». Для внутриевропейских денежных потоков решение оказалось в целом неплохим, а на глобальном уровне ничего не получилось.Если один раз у какой-то группы государств уже было такое намерение, и его даже попытались реализовать, то, возможно, в следующий раз другая группа государств учтёт достижения и промахи евро и предложит ещё одну международную расчётную единицу. А зачем множить сущности без необходимости? Не эффективнее ли воспользоваться платёжной системой, которая давно и успешно функционирует и уже имеет множество участников?Вот скоро появится валюта БРИКС. Если она провалится, то в следующий раз государства, заинтересованные в смещении финансового гегемона, будут с гораздо бОльшим интересом присматриваться к Биткоину. Но это не в ближайшие годы будет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "September 08, 2023, 11:15:34 AM",
      "body": "Quote from: BVeyron on September 07, 2023, 07:13:15 PMА кстати вы практически все не верите в то что BTC может стать мировой резервной валютой.Я тоже с этим согласен но не из за исторических аналогий а совершено по другой причине.Для этого нужно чтобы прекратил свое существование  капитализм и воцарилась бы грубо говоря энная версия коммунизма или суперпродвинутого социализма, та что ещё с какими-то деньгами. Во всех остальных обществах и формациях а тем более в диком примитивном капитализма всегда найдётся та  страна которая хочет поживиться и шикарно жить за счёт других. И соответственно иметь при этом монополию на печатание своих денег, что мы и наблюдаем.Ну а разве такая страна может каким то образом отказаться от такой привилегии. Да ни за что. Легче изничтожить все айсики в мире, чем потерять такую возможность.Короче при капитализме биткоин это просто вариант ценой бумаги и он производная от базисной валюты, а не сама базисная валюта.Я вообще не считаю, что Сатоши Накамото хоть как-то был социалистом или левым. Он безусловно был за капитализм в достаточно жёстком виде, но без монополии государства, то есть негосударственный капитализм.Для построения коммунистического или социалистического общества Биткоин в общем-то не нужен. Никто в коммунистическом обществе не станет обогащать майнеров. Это исключено.Биткоин станет мировой резервной валютой по очень простой причине, -  из-за краха глобализации. В ситуации глобализации, когда есть одно государство, лидер - гегемон (например, США), оно может навязать свою валюту в качестве мировой резервной. Если же мир распадается на отдельные регионы, которые находятся друг с другом в напряжённых отношениях, то нужна некая единая общечеловеческая валюта, которая поможет как-то балансировать различные национальные (региональные) валюты. Их же нужно как-то между собой сравнивать, как-то присваивать им какие-то веса?Вот для этого, и нужен Bitcoin. Потому что в отношении Биткоина проще всего договориться, что это общечеловеческая мировая резервная валюта. Любое государство, которое с этим согласится может подставить у себя асики, назначить майнеров и поддерживать сеть. Может накапливать у себя Биткоины. И у этого государства не будет никаких подозрений, что это какая-то нечестная игра. Это игра изначально честная. Её такой придумали.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "September 09, 2023, 08:39:13 AM",
      "body": "Quote from: internetional on September 08, 2023, 09:50:05 AMQuote from: BVeyron on September 07, 2023, 07:13:15 PMДля этого нужно чтобы прекратил свое существование  капитализм и воцарилась бы грубо говоря энная версия коммунизма или суперпродвинутого социализма, та что ещё с какими-то деньгами. Во всех остальных обществах и формациях а тем более в диком примитивном капитализма всегда найдётся та  страна которая хочет поживиться и шикарно жить за счёт других. И соответственно иметь при этом монополию на печатание своих денег, что мы и наблюдаем.Ну а разве такая страна может каким то образом отказаться от такой привилегии. Да ни за что. Легче изничтожить все айсики в мире, чем потерять такую возможность.В Европе очень многие страны отказались 25 лет назад от национальных валют.Стимулом было намерение найти альтернативу валюте одной страны, которая «хочет поживиться и шикарно жить за счёт других». Для внутриевропейских денежных потоков решение оказалось в целом неплохим, а на глобальном уровне ничего не получилось.Если один раз у какой-то группы государств уже было такое намерение, и его даже попытались реализовать, то, возможно, в следующий раз другая группа государств учтёт достижения и промахи евро и предложит ещё одну международную расчётную единицу. А зачем множить сущности без необходимости? Не эффективнее ли воспользоваться платёжной системой, которая давно и успешно функционирует и уже имеет множество участников?Вот скоро появится валюта БРИКС. Если она провалится, то в следующий раз государства, заинтересованные в смещении финансового гегемона, будут с гораздо бОльшим интересом присматриваться к Биткоину. Но это не в ближайшие годы будет.Тут ведь как. Евросоюз шёл к этому постепенно. С другой стороны, евро, хоть оно и уничтожило локальные валюты европейских государств (тоже, кстати, не всех), но при этом оно не потеряло фиатной природы. Заметь, что, к примеру, если хотели бы внедрить нечто такое со справедливой эмиссией децентрализованное, то могли бы внедрить, к примеру, бумажное золото. Но нет, сделали такой же фиат, олько общий для всех.   Почему? Потому что и бумажное золото и биткойн невозможно регулировать. Для государства это минус. Допустим, в бюджете кончились битки. Сбор налогов в битках затруднём, все скрывают, да и не все платят битком, просто потому что тупо его не у всех есть. Что делать? Что платить бюджетникам, как платить пенсии? Призвать их сосать лапу?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "September 09, 2023, 01:49:22 PM",
      "body": "Quote from: internetional on September 07, 2023, 11:06:25 AMВ международных расчётах - нет. Скорее уж юань какой-нибудь. А биткоин пока не готов к тем оборотам, которые должны быть у валюты международных расчётов.Но вот ещё через 100 лет, то есть после юаня, - вполне. Думаю, к тому времени постепенно наработаются технологии, которые позволят биткоину выполнять все те же функции, которые сейчас выполняет доллар. Если не биткоин, то не ясно кто мог бы заменить доллар на данный момент. Согласен с тем, что биткион ещё слишком молод, чтобы сделать это, но и мне очень слабо верится, что через какой то десяток лет мы будем покупать/продавать недвигу за юани, как то это слишком сомнительно звучит, тем более что с Китая постоянно подгоняют негативные новости о состоянии экономики, так что и там не все так хорошо.100 лет это не интересно, нас уже к тому времен не будет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 09, 2023, 02:28:17 PM",
      "body": "Quote from: internetional on September 08, 2023, 09:50:05 AMВот скоро появится валюта БРИКС. Если она провалится, то в следующий раз государства, заинтересованные в смещении финансового гегемона, будут с гораздо бОльшим интересом присматриваться к Биткоину. Но это не в ближайшие годы будет.При валюте БРИКС никакого провала не будет и  никто не будет присматриваться  к биткоину потому что это вообще тут ни при чем и это новые деньги для совершенно другой финансовой системы и то чисто теоретически. В БРИКС собрались традиционные страны с традиционными финансовыми системами и ждать от них иного решения по общей валюте вообще невозможно. Это будет что-то уровня евро с разделением эмиссии по странам и просто с общей координацией процессов печатания и оборота этой валюты. И не более того.Quote from: Smartprofit on September 08, 2023, 11:15:34 AMБиткоин станет мировой резервной валютой по очень простой причине, -  из-за краха глобализации. В ситуации глобализации, когда есть одно государство, лидер - гегемон (например, США), оно может навязать свою валюту в качестве мировой резервной. Сомневаюсь, что это возможно. Посмотрите на шарахания власти в лице SEC и вы поймёте, что узда все равно в конце концов найдётся и все это просто станет небольшой частицей традиционной финансовой системы. И не более того. Я вижу будущее BTC как вариант ценной бумаги по типу облигации. Вот и все.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "September 09, 2023, 03:47:11 PM",
      "body": "Quote from: BVeyron on September 09, 2023, 02:28:17 PMQuote from: internetional on September 08, 2023, 09:50:05 AMВот скоро появится валюта БРИКС. Если она провалится, то в следующий раз государства, заинтересованные в смещении финансового гегемона, будут с гораздо бОльшим интересом присматриваться к Биткоину. Но это не в ближайшие годы будет.При валюте БРИКС никакого провала не будет и  никто не будет присматриваться  к биткоину потому что это вообще тут ни при чем и это новые деньги для совершенно другой финансовой системы и то чисто теоретически. В БРИКС собрались традиционные страны с традиционными финансовыми системами и ждать от них иного решения по общей валюте вообще невозможно. Это будет что-то уровня евро с разделением эмиссии по странам и просто с общей координацией процессов печатания и оборота этой валюты. И не более того.Quote from: Smartprofit on September 08, 2023, 11:15:34 AMБиткоин станет мировой резервной валютой по очень простой причине, -  из-за краха глобализации. В ситуации глобализации, когда есть одно государство, лидер - гегемон (например, США), оно может навязать свою валюту в качестве мировой резервной. Сомневаюсь, что это возможно. Посмотрите на шарахания власти в лице SEC и вы поймёте, что узда все равно в конце концов найдётся и все это просто станет небольшой частицей традиционной финансовой системы. И не более того. Я вижу будущее BTC как вариант ценной бумаги по типу облигации. Вот и все.SEC это же не власть. Это просто бюрократическая организация страны, которая хоть раньше и была могущественной и даже прогрессивной, однако сейчас такой уже не является. Достаточно посмотреть на геронтократию, которая процветает в США, на всех этих старичков - президентов и кандидатов в президенты, чтобы понять, что они контролируют далеко не все процессы в мире.Вот Индия уже название страны сменила и это не случайно. В мире идут процессы, которые уже не контролируются прежней мировой элитой.И Биткоин им тем более не по зубам. И Биткоин это явно не ценная бумага, его вообще никак к определению ценной бумаги не привязать, тем более к определению облигации. Облигация это долговая ценная бумага организации. Биткоин никаким образом, облигацией не может являться.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 09, 2023, 06:57:08 PM",
      "body": "Quote from: Smartprofit on September 09, 2023, 03:47:11 PMВот Индия уже название страны сменила и это не случайно. В мире идут процессы, которые уже не контролируются прежней мировой элитой.И Биткоин им тем более не по зубам. И Биткоин это явно не ценная бумага, его вообще никак к определению ценной бумаги не привязать, тем более к определению облигации. Облигация это долговая ценная бумага организации. Биткоин никаким образом, облигацией не может являться.Думаю, что сбрасывать все эти кланы со счетов преждевременно, тем более что у них идёт естественный процесс передачи власти следующим поколениям. И этот процесс, я думаю очень даже контролируется уходящими поколениями.Индия в обозримое время не сменит название это их такие фантазии на тему  поерничать над колониализмом, не более.Что касается облигации, то да, конечно я не имею ввиду полный аналог, я имел виду примерный статус ценной бумаги.  Так сказать ориентир.Ну пусть назову BTC просто \"специальная\" ценная  бумага с рядом оригинальных свойств\".Но суть вторичности такого финансового инструмента от этого не изменится все равно это будет производная от мировой резервной или от золота. Почему все до сих пор считают сколько долларов стоит  1 биткоин, но никто не считает, что 1 доллар это сколько то сатошей  ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "September 10, 2023, 06:58:13 AM",
      "body": "QuoteSEC это же не власть. Это просто бюрократическая организация страны, которая хоть раньше и была могущественной и даже прогрессивной, однако сейчас такой уже не является Бюрократия — это и есть власть, даже если она непрогрессивна и геронтологична (кстати, сейчас во многих странах своеобразная мода на геронтократию). Но у этой шаражки и функция такая не особо прогрессивная по своей природе — держать и не пущать, а также всячески ограничивать.QuoteПочему все до сих пор считают сколько долларов стоит  1 биткоин, но никто не считает, что 1 доллар это сколько то сатошей  ? В чём считают все остальные активы — это и есть признак главных денег на планете. Когда де факто все активы начнут считать в сатошах, а долларом перестанут пользоваться, тогда и наступит время биткойна. Пока, судя по всему, до этого далеко. Пусть сначала в США начнётся гиперинфляция. Для этого достаточно просто перестать периодически придерживаться жёсткой ДКП.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 10, 2023, 09:21:56 AM",
      "body": "Quote from: Julien_Olynpic on September 10, 2023, 06:58:13 AMQuoteSEC это же не власть. Это просто бюрократическая организация страны, которая хоть раньше и была могущественной и даже прогрессивной, однако сейчас такой уже не является Бюрократия — это и есть власть, даже если она непрогрессивна и геронтологична (кстати, сейчас во многих странах своеобразная мода на геронтократию). Но у этой шаражки и функция такая не особо прогрессивная по своей природе — держать и не пущать, а также всячески ограничивать.QuoteПочему все до сих пор считают сколько долларов стоит  1 биткоин, но никто не считает, что 1 доллар это сколько то сатошей  ? В чём считают все остальные активы — это и есть признак главных денег на планете. Когда де факто все активы начнут считать в сатошах, а долларом перестанут пользоваться, тогда и наступит время биткойна. Пока, судя по всему, до этого далеко. Пусть сначала в США начнётся гиперинфляция. Для этого достаточно просто перестать периодически придерживаться жёсткой ДКП.Вот я о том и говорю этой своей фразой - конечно в чем считают все остальные деньги, то и есть главная мировая валюта. Но никто даже не заикается пока о том чтоб попробовать все считать в Сатоши.  Тогда кстати у $ будет сумасшедшая волатильность",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}