{
  "id": "topic_5451296",
  "title": "Emmanuelex",
  "author": "Emmanuelex",
  "created_time": "May 05, 2023, 09:10:09 AM",
  "content": "This question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.But I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. I feel the reason for the low rate of adoption is just because people think it's not for them. Bitcoin has been around for over a decade, and any thought that most people would have had about it being a scam must have faded by now. But at the same time, if you look at it, Bitcoin is a risky business; if you invest money, there are two possibilities: it will either yield profits or losses. Many people today are not fans of investment, not to mention buying assets that heavily fluctuate in price. They would choose to save money earned from hard work, and a few might invest in low-risk markets, even though inflation is still eating them up.So it would be hard for them to consider holding Bitcoin to use it daily.Nevertheless, the community is still growing bigger 💗, and people's interest in Bitcoin and cryptocurrency keeps growing.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451296",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "May 05, 2023, 09:32:54 AM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMI feel the reason for the low rate of adoption is just because people think it's not for them. Bitcoin has been around for over a decade, and any thought that most people would have had about it being a scam must have faded by now. I wouldn't much agree with that, the low rate adoption of Bitcoin basically is because most people lack knowledge of what Bitcoin is all about. They see Bitcoin and other cryptocurrencies as a means where people get scammed. All over the world they are different views and reasons why Bitcoin adoption has been very slow. 1. In some countries, the government sees Bitcoin as something that could affect their economy so places a ban or restriction.2. Some countries lack technological equipment that would enable their citizens stay uptodate with Bitcoin e.g electricity and internet.3. In some countries there are not enough  Bitcoin or cryptocurrency experts and as such even though there are people to learn, there's no one to educate them on the whole idea about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "May 05, 2023, 09:35:20 AM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMBut at the same time, if you look at it, Bitcoin is a risky business; if you invest money, there are two possibilities: it will either yield profits or losses. Many people today are not fans of investment, not to mention buying assets that heavily fluctuate in price. They would choose to save money earned from hard work, and a few might invest in low-risk markets, even though inflation is still eating them up.I think There are several reasons why some people still view Bitcoin as a scam. Firstly, it is a relatively new technology and there have been several cases of fraud and scams involving cryptocurrencies in the past, which may have created a sense of mistrust in the minds of some. Also, Bitcoin's decentralized nature and lack of government regulation may make it appear less legitimate to some. However, there are also valid reasons why others see Bitcoin as a legitimate investment opportunity. For example, its limited supply and decentralized nature can provide protection against inflation and government manipulation.And regarding your opinion on the fact that Bitcoin is a high risk investment, and not everyone is comfortable with that level of uncertainty it's understandable that many people prefer to stick with safer investment options, even if they don't offer the same potential returns I think it's fair because all want to invest looking for profit not even a loss. I personally would say whether someone sees Bitcoin as a scam or a legitimate investment opportunity will depend on an individual's perspective and level of risk tolerance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Etranger",
      "created_time": "May 05, 2023, 09:48:52 AM",
      "body": "Quote from: Hatchy on May 05, 2023, 09:32:54 AMQuote from: Emmanuelex on May 05, 2023, 09:10:09 AMI feel the reason for the low rate of adoption is just because people think it's not for them. Bitcoin has been around for over a decade, and any thought that most people would have had about it being a scam must have faded by now. I wouldn't much agree with that, the low rate adoption of Bitcoin basically is because most people lack knowledge of what Bitcoin is all about. They see Bitcoin and other cryptocurrencies as a means where people get scammed. All over the world they are different views and reasons why Bitcoin adoption has been very slow. 1. In some countries, the government sees Bitcoin as something that could affect their economy so places a ban or restriction.2. Some countries lack technological equipment that would enable their citizens stay uptodate with Bitcoin e.g electricity and internet.3. In some countries there are not enough  Bitcoin or cryptocurrency experts and as such even though there are people to learn, there's no one to educate them on the whole idea about Bitcoin. I totally agree that the perception of bitcoin is highly dependent on the country. Countries in which, in principle, the tradition and culture of investing are not developed, still continue to perceive bitcoin and other cryptocurrencies as a scam. People from such countries find it easier to invest in local business schemes or real estate, which they have been familiar with for decades, although these sources have long ceased to bring profits that could equal those from bitcoin. They have outdated views that are difficult to change, convincing them that the world is changing very quickly, and financial instruments are becoming different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "May 05, 2023, 10:34:59 AM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.But I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case.There is no perfection in life and so is Bitcoin adoption. There are people who like Bitcoin and accept it but oppositely there are people consider Bitcoin as scam or they simply don't like Bitcoin.They are people who feel happy whenever Bitcoin falls a lot, has a big correction or a serious crash. Some of them can make call \"Bitcoin is dead\" which is less popular with time.https://buybitcoinworldwide.com/bitcoin-is-dead/https://99bitcoins.com/bitcoin-obituaries/QuoteNevertheless, the community is still growing bigger 💗, and people's interest in Bitcoin and cryptocurrency keeps growing.The adoption rate for Bitcoin is very good and can be considered as a best one in human civilization history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "May 05, 2023, 10:47:02 AM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.But I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. I feel the reason for the low rate of adoption is just because people think it's not for them. Bitcoin has been around for over a decade, and any thought that most people would have had about it being a scam must have faded by now. But at the same time, if you look at it, Bitcoin is a risky business; if you invest money, there are two possibilities: it will either yield profits or losses. Many people today are not fans of investment, not to mention buying assets that heavily fluctuate in price. They would choose to save money earned from hard work, and a few might invest in low-risk markets, even though inflation is still eating them up.So it would be hard for them to consider holding Bitcoin to use it daily.Nevertheless, the community is still growing bigger 💗, and people's interest in Bitcoin and cryptocurrency keeps growing.There are a lot of pros/cons of getting yourself into bitcoin, yeah there are risk but we all know that the risk is going to be worth in the long run specially if you want to be a long term holder.As for the used, one drawback is the volatility of the price, that's why merchants are not readily wanting to accept it unless the owner is pro-bitcoin and again, holding to hold until such time that he needs to sell it to continue with his business.Adoption is growing though, there are many investors right now and for sure when we are in the bull run, the number of bitcoin hodlers will grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 05, 2023, 11:21:21 AM",
      "body": "You yourself has just stated that the reason people see bitcoin as a scam is because they don’t have knowledge about it, and that is the only answer to it. People have always seen in the past that every investment associated with the internet most especially if it promises a return it is usually a Ponzi scheme, so when bitcoin came up they all had same narrative towards it. But as bitcoin continue to persist and proves all doubters wrong we can see that the adoption rate is fast growing. Concerning it risk, this is just a thing spread to discourage people from it vex there is no investment without although it is greater in some investments but the higher the risk the more return it could also generate so it is vice versa. As for those looking not to invest they can just buy and hold as it is better than fiat currency because of his advantage to hedge against inflation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 05, 2023, 11:38:44 AM",
      "body": "IMO, it's a matter of (lack of) education, but more in the economic and financial sense. If you randomly ask a merchant in the street why doesn't he takes Bitcoin as a payment he will tell you one of a few things: or he doesn't know what that is, or he says it's a scam, or he's unaware about how to deal with taxes and government and all the bureaucracy that he thinks it may have to deal with.So, I stand that youth should have some economic and financial concepts early in school, and when I said this, I mean at least have the chance to chose to learn between keynesian school and Ludwig von Mises school or the Austrian school of economics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 05, 2023, 12:05:35 PM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.I believe lack of adequate knowledge and proper awareness of the real essence of bitcoin have led many potential investors into making So me wrong investment decision and this have lead to them into falling for scam investments all in the name of bitcoin and while the got scammed through those scheme, their now have a general notions that Bitcoin is a scam. That is why there is need for adequate education and awareness before owning your first bitcoin, because there os a lot of scammers taking advantage of the anonymousity of bitcoin to use is in scamming gullible investors who fall into they trap. Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMBut I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. I feel the reason for the low rate of adoption is just because people think it's not for them. Bitcoin has been around for over a decade, and any thought that most people would have had about it being a scam must have faded by now. Now Bitcoin is gaining mainstream awareness and the usual misconceptions about Bitcoin is beginning to fade and people are now better informed and their desire for self-custody is pushing them into search for knowledge that could help guide they decision as the act along with the volatility of Bitcoin. And so far we now have countries making bitcoin legal tenders and that is something that show how strong and persistence bitcoin have been in the last decade to arrive at the present state of things. Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMBut at the same time, if you look at it, Bitcoin is a risky business; if you invest money, there are two possibilities: it will either yield profits or losses. Many people today are not fans of investment, not to mention buying assets that heavily fluctuate in price. They would choose to save money earned from hard work, and a few might invest in low-risk markets, even though inflation is still eating them up.So it would be hard for them to consider holding Bitcoin to use it daily.Nevertheless, the community is still growing bigger 💗, and people's interest in Bitcoin and cryptocurrency keeps growing.Bitcoin investment is not for the chicken-hearted and if you dont have the balls to practice patients,  Bitcoin is not for you because of Bitcoin's high volatility it has become risky to invest in it a bit since Bitcoin is a highly volatile asset, not many people are interested in is an investment since price of bitcoin can be speculated and there is no way to predict Bitcoin future price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "May 05, 2023, 12:43:31 PM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.But I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. The most popular view about bitcoins was that it was a scam before, but now it is not perceived as much as that before although some other people and in some areas such views are still held strong.Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMI feel the reason for the low rate of adoption is just because people think it's not for them.  I can agree to it. Some people have not seen reasons to buy bitcoins even though they no longer see it as a scam. Some people believe that they have already lost out and can no longer benefit from bitcoins since they cannot buy big amounts.Quote from: Emmanuelex on May 05, 2023, 09:10:09 AM Many people today are not fans of investment, not to mention buying assets that heavily fluctuate in price. They would choose to save money earned from hard work, and a few might invest in low-risk markets, even though inflation is still eating them up.These people need proper knowledge to know that saving money in banks will do them no good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "May 05, 2023, 01:14:24 PM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.But I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. The only people that sees bitcoin as scam are people that don’t know anything about bitcoin, I know of some people that still believe bitcoin is scam. But the government that still see bitcoin as a bad thing is just trying to stop bitcoin from growing, but they also know that bitcoin is not a scam, but they are looking for how to fight bitcoin so that bitcoin won’t grow and the only way which they can do that is only my saying bad things about bitcoin so that people will lose interest in bitcoin, they are just trying to tag bitcoin with bad name.Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMBut at the same time, if you look at it, Bitcoin is a risky business; if you invest money, there are two possibilities: it will either yield profits or losses.Yes we know bitcoin is a risky business, but I want you to mention any business or investment that’s not risky to me. Business is either profit or loss, if you make profit, you work on yourself to keep on growing your business and if lose, you look for the cause of the lose and you will work on it to avoid more loss in the future, same goes to bitcoin. So people saying bitcoin is a risky business those not have any excuse because any business you are planning to go into is risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "May 05, 2023, 01:34:30 PM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.But I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. If bitcoin is called a scam now, in my opinion, this opinion is very wrong. Because bitcoin has proven, that now more people support it and there are even countries that have adopted bitcoin as a legal transaction tool. So in my opinion, if now there are people who call bitcoin a scam, that's wrong. I am also of the opinion that the people who call bitcoin a scam are people who are not invested in bitcoin at all. They only conclude bitcoin based on illogical thinking, not with in-depth analysis.Maybe right now there are still people who think negatively about bitcoin, but it seems it's starting to decrease, because now it seems more people are more open-minded about bitcoin.Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMI feel the reason for the low rate of adoption is just because people think it's not for them. Bitcoin has been around for over a decade, and any thought that most people would have had about it being a scam must have faded by now. ~I think your opinion is not right. Because in my personal opinion, the reason why not many people have adopted bitcoin is caused by several factors. Such as lack of information, because it is undeniable that information about bitcoin has not spread evenly to all people, so that's why bitcoin has not been maximally adopted. The second cause of the delay in bitcoin adoption is caused by the fear of trying. Because not a few people are reluctant to try something new, because they don't want to take risks that they don't know. Maybe those are some of the factors that have hindered the adoption of bitcoin in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "May 05, 2023, 01:36:46 PM",
      "body": "Knowledge is power,lack of bitcoin knowledge is the cause of low adoption.1. Some newbies that think investing in any crptocurrency means that you have invested in bitcoin. The reason is that they don't know that all crptocurrency doesn't have the same value of bitcoin, therefore, they blindly invest in altcoins. Due to the fact that altcoin cannot survive in the market,it will crash to zero,making the investor to loss greatly and these set of investors will go about telling people that bitcoin is scam,unknowingly to them that it wasn't bitcoin that they invested on.2. If someone has the proper understanding of bitcoin and its decentralized network, they will know that if they don't use a centralized platform for their bitcoin dealings, the government will not be able to track them down,even though their government put a ban on bitcoin in their country. We have so many people in the forum that bitcoin was banned in their country but they still make use of bitcoin and have bitcoin investment.3. No business is not risky,if you have the knowledge on bitcoin, you will follow bitcoin four years cyclic and be patient with your bitcoin investment for you to always make profit. That is you will know that investing in a long term is the best for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "May 05, 2023, 01:44:43 PM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.But I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. I feel the reason for the low rate of adoption is just because people think it's not for them. Bitcoin has been around for over a decade, and any thought that most people would have had about it being a scam must have faded by now. But at the same time, if you look at it, Bitcoin is a risky business; if you invest money, there are two possibilities: it will either yield profits or losses. Many people today are not fans of investment, not to mention buying assets that heavily fluctuate in price. They would choose to save money earned from hard work, and a few might invest in low-risk markets, even though inflation is still eating them up.So it would be hard for them to consider holding Bitcoin to use it daily.Nevertheless, the community is still growing bigger 💗, and people's interest in Bitcoin and cryptocurrency keeps growing.It's both, lack of interest and lack of knowledge. Most of the people see Bitcoin as a scam, (1) because of its price/value, (2) because of scammers who are using or used Bitcoin as a bait to steal others money. People are scared of those two things, that's why they are always skeptical about investing in Bitcoin. Also the FUDs going around every bear market is not a joke for the people who doesn't really have any idea about cryptocurrency. We can't blame them though, they just not chose to get out of their safe zone, only few people chose to risk their money to grab opportunities that is in cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demonica",
      "created_time": "May 05, 2023, 01:55:53 PM",
      "body": "What I've noticed why people aren't interested in Bitcoin is because either they have no access to technology or find it hard to understand how all this stuff works, no means to invest, lack of awareness, afraid of losing money, and such. I agree with op, though maybe some people still see Bitcoin as a scam but it definitely decreased over time. We've seen more adoption of Bitcoin in the past years so those negative thoughts on Bitcoin are fading. I also believe that the often use of the internet helped a lot in spreading Bitcoin awareness faster to other people, especially to younger people who seem to be highly interested in Bitcoin and crypto right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "May 05, 2023, 02:22:39 PM",
      "body": "Because bitcoin is fluctuating and also with high volatility with high profits and also the risk is the same if people who don't understand bitcoin then they will think it's a scam because in their minds investing with high risk is the scam they think.In contrast to us where there are real reasons why believe in bitcoin even though it has a high risk of its decline rate, on the other hand bitcoin has influenced many other sectors there are also the opposite and that is where the bitcoin side has always been controversial, but I believe in adopting it slowly and make people understand what bitcoin is they will be aware of and how important it is to invest in bitcoin so in their minds it is not something bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "May 05, 2023, 03:13:32 PM",
      "body": "The Bitcoin adaptation process is still going on, even though we don't know how much growth it has for each country. But the progress has been better than in previous years because there has been a lot of attention from the wider community trying to use Bitcoin properly.And even though many governments haven't made Bitcoin legal, that won't stop the development of Bitcoin in other countries. But it's true that Bitcoin is still a tool for fraud for people who don't know Bitcoin clearly and eventually become victims of the scam.But in the future, Bitcoin will grow even more rapidly, especially if more countries or Bitcoin users can accept Bitcoin as a profitable investment for the long term. And they will see when Bitcoin can reach new ATH again very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "May 05, 2023, 03:25:50 PM",
      "body": "Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMThis question has been raised several times, and I have noticed that some people conclude that the lack of adoption is due to people not understanding Bitcoin or seeing it as a scam.Quality over quantity. I believe it’s better to have a slow growth on the number of Bitcoin user as long as those negative mindset will be filtered out. We don’t need user that see Bitcoin as scam so easily because they will not think that way of they will just put an effort to do more research.Here in Ph, most of the people see Bitcoin as scam because many ponzi and scam investment use Bitcoin as mode of investment. The result is those victim testify that Bitcoin is scam instead on blaming it to the real culprit which the person behind scam.Quote from: Emmanuelex on May 05, 2023, 09:10:09 AMBut I don't think the world still views Bitcoin as a bad thing today, though I know a lot of you thought that, but it is not the case. It’s very hard to determine what’s the real position of the “world” since its too generalized but Bitcoin is now becoming more established due to the regulation imposed by different country. Bitcoin will be valued more in due time. Let’s cherish while we are still the minority so that we can still benefit on low price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "May 05, 2023, 03:29:09 PM",
      "body": "OP, there are over 8 billion human population in the world today and you can't conclude that all these humans think the same about bitcoin. In fact you will find that there is always difference of opinion about which particular assets most people think are good while others think they are bad. Try to focus on the variable only, namely the community. I mean you can expect this community to grow stronger and grow to continue to support bitcoin and find one clear reason why they believe in bitcoin.Bitcoin is not scam, nor is it ponzi scheme, but you can't always prevent people from using bitcoin for scam schemes and other schemes. Remember, bitcoin is money, it can always be used for good or bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "May 05, 2023, 03:31:28 PM",
      "body": "If I am not wrong not even 5% of world population is using Bitcoin is simply because they don't have any idea what Bitcoin is, maybe they heard the name due to the internet adoption boom in the last few years but there is no knowledge about blockchain technology in the basic syllabus of school and some old rich people throw bad comments on Bitcoin so people are afraid of buying Bitcoin.But the adoption rate is actually lot faster than other monetary system and FYI it's just a decade old new system is fighting against all the governments, traditional assets, centuries old paper currency system etc so considering all these we are sitting at pretty good adoption rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}