{
  "id": "topic_5404909",
  "title": "Cryptornd",
  "author": "Cryptornd",
  "created_time": "July 02, 2022, 10:42:34 AM",
  "content": "Bitcoin was never supposed to be an inflation hedge in the first place. That was an idea built by influencers and speculators in the last years. What Bitcoin was supposed to be and is now becoming is a P2p uncontrollable payment network across the globe.West world uses it as an investment. Poor countries use it as money, as it was designed. The Lightning Network is dealing with the scaling problem BTC was facing mainly since 2016/17 though it processed slowly far today. countries adopt it you can see clearly ( El- salvador )The lightning network is the solution to the money problem & scalability problem which world is being faced at the moment. Bitcoin is the solution to the money problems not mainly to the inflation problem.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404909",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 02, 2022, 10:51:23 AM",
      "body": "Bitcoin was created with a limited supply, it has increasing demand as the adoption is increasing. In the past, this kind of money had been existing, but not in digital form, example are gold, silver, and other valuable substances which increasing demand increases market worth of the product, but just that those are still having unlimited supply unlike bitcoin. So bitcoin in design is an hedge against inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 02, 2022, 11:00:05 AM",
      "body": "Some people consider Bitcoin like gold, a store of value. That's why they consider it also an inflation hedge, we all know gold *maybe a limited supply that's why the price of Gold over time is increasing.They consider Bitcoin as digital gold. For investment. Bitcoin has a limited supply and with its block halving event, I can consider it is an inflation hedge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sbrys",
      "created_time": "July 02, 2022, 11:09:07 AM",
      "body": "Maybe it was never intended as an inflation hedge but anything with a fixed supply is hedged against inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 02, 2022, 11:37:42 AM",
      "body": "Been a few discussions recently around Bitcoin's (argued) role as an inflation hedge but you really can't deny it's got a great ability to defend against long-term inflation. Sure, right now, we're priced at 2017 levels, but this is what most people would say is Bitcoin at its worst.As a currency for day-to-day business, it's never a great store of value, which is why crypto businesses have always settled in cash at the end of the day or their books would be destroyed.But I can't think of a single currency that long term has the same or higher purchasing power (because of inflation).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "July 02, 2022, 11:48:16 AM",
      "body": "Quote from: Charles-Tim on July 02, 2022, 10:51:23 AMBitcoin was created with a limited supply, it has increasing demand as the adoption is increasing. In the past, this kind of money had been existing, but not in digital form, example are gold, silver, and other valuable substances which increasing demand increases market worth of the product, but just that those are still having unlimited supply unlike bitcoin. So bitcoin in design is an hedge against inflation.Technically speaking the answer is yes but based on the actual performance of Bitcoin No because of its volatility. Investors might end up losing rather than hedging if he enter on the bad price like what El Salvador and Microstrategy did. But of course this is a work in progress since we don’t know what will be the price in the future but based on the current price chart, Bitcoin can’t withstand a bad global market since it got dump when fed increase interest rate and other crypto business failure so which means we can’t use it to hedge against inflation.I believe we conclude this if Bitcoin manage to reach a new all time high the following years which I’m looking forward too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 02, 2022, 11:49:47 AM",
      "body": "Quote from: Charles-Tim on July 02, 2022, 10:51:23 AMBitcoin was created with a limited supply, it has increasing demand as the adoption is increasing. In the past, this kind of money had been existing, but not in digital form, example are gold, silver, and other valuable substances which increasing demand increases market worth of the product, but just that those are still having unlimited supply unlike bitcoin. So bitcoin in design is an hedge against inflation.Deflation is not the solution to inflation though. Both are bad. Bitcoin is deflationary and it is also bad for us. Why would anybody want to spend bitcoins if they knew they are going to be more valuable tomorrow? People spend their FIAT because they know their FIAT is going to worth less in the future. That's how currencies work.OP is right, bitcoin's strength lies in its decentralized nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "July 02, 2022, 12:29:45 PM",
      "body": "Blame Bitcoin's continuing journey in its path to price discovery, the hype during the bull market, and partly the speculators for the volatilty, the same speculators who are attacking it with FUD now because the probably lost money. I admit my mistake for believing it to be a good inflation hedge. It's still a hedge, but less a financial hedge. Because of the underlying nature of Bitcoin that makes it censorship-resistant, and gives its owners sovereignty over their own money, it's a hedge against the cabal and their manipulation over the financial system. Buy the DIP, and HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "July 02, 2022, 12:39:25 PM",
      "body": "Quote from: mindrust on July 02, 2022, 11:49:47 AMDeflation is not the solution to inflation though. Both are bad. Bitcoin is deflationary and it is also bad for us. I've seen it argued that, at least for now, it isn't strictly considered deflationary because there's still an emission of new money into the system.  However, it will later become deflationary when we reach the point where the rate at which BTC is becoming lost or unspendable outpaces the release of new BTC in the block rewards.  It's going to be almost impossible to determine when that point is reached, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 02, 2022, 01:29:42 PM",
      "body": "It's simply because it's too early for it to become an inflation hedge. There's a potential for bitcoin to be an actual inflation hedge once adoption is high enough to the point that it will be difficult for it to have price spikes in both directions.People should be saying \"bitcoin could potentially be a good inflation hedge in the future\" rather than \"bitcoin is an inflation hedge\". The latter being false, at least as of today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 02, 2022, 01:42:06 PM",
      "body": "Quote from: Cryptornd on July 02, 2022, 10:42:34 AMBitcoin was never supposed to be an inflation hedge in the first place. False.It is an objective and verifiable fact that Bitcoin has been the best performer in beating inflation since its inception.Quote from: Cryptornd on July 02, 2022, 10:42:34 AMThat was an idea built by influencers and speculators in the last years. What Bitcoin was supposed to be and is now becoming is a P2p uncontrollable payment network across the globe.It is not incompatible. Bitcoin is used as a currency and is also an inflation hedge, as happened in the past with gold. What happens is that I doubt it will maintain both characteristics in the long term, as people tend to spend the garbage coins and save the good coins (Gresham's law).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoYar",
      "created_time": "July 02, 2022, 01:44:43 PM",
      "body": "Bitcoin is not just an inflation hedge in fact it is much more than this, let's take a look at what is bitcoin. and what problems it solves.1) Bitcoin Fixes BailoutsBitcoin fixes bailouts by preventing governments from being able to print money to fund bailouts.2) Bitcoin Fixes Bank HolidaysBitcoin fixes bank holidays by being ‘open’ 24/7.3) Bitcoin Fixes BanksBitcoin fixes banks by creating market forces which bring back lending and risk-taking discipline.4) Bitcoin Fixes Central BankingBitcoin fixes central banking by providing an escape for people suffering under bad central bank policy.5) Bitcoin Fixes Civil Asset ForfeitureBitcoin fixes civil asset forfeiture by allowing people to carry any amount of value solely in their minds, anywhere, at any time.6) Bitcoin Fixes Climate ChangeBitcoin fixes climate change by incentivizing development of renewable energy resources on a massive scale.7) Bitcoin Fixes ColonialismBitcoin fixes colonialism by not giving structural advantages to anyone.8 ) Bitcoin Fixes DeflationBitcoin fixes deflation by allowing business cycles to naturally take place.9) Bitcoin Fixes EbolaBitcoin fixes Ebola by incentivizing low time-preference behavior such as investing in long-term research efforts.10) Bitcoin Fixes GoldBitcoin fixes gold by making it digital.11) Bitcoin Fixes HubrisBitcoin fixes hubris by making short-term traders get rekt.12) Bitcoin Fixes Idol WorshipBitcoin fixes idol worship by showing that leaders are weak-points.13) Bitcoin Fixes InequalityBitcoin fixes inequality by eliminating the Cantillon Effect which gives the wealthiest people access to new money before everyone else.14) Bitcoin Fixes Infant MortalityBitcoin fixes infant mortality by more efficiently moving capital to under-privileged regions.15) Bitcoin Fixes InflationBitcoin fixes inflation by making it impossible for anyone to decide to print more money.16) Bitcoin Fixes MaterialismBitcoin fixes materialism by causing people to shift their preferences from short-term consumption to long-term saving.17) Bitcoin Fixes SexismBitcoin fixes sexism by not knowing anyone’s sex or gender.18) Bitcoin Fixes The Surveillance StateBitcoin fixes the surveillance state by making both surveillance and the state less effective.19) Bitcoin Fixes VolatilityBitcoin fixes volatility by making people used to short-term volatility in order to achieve longer term prosperity.20) Bitcoin Fixes WarBitcoin fixes war by making it much more difficult for governments to fund their militaries.Source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "July 02, 2022, 06:12:08 PM",
      "body": "Quote from: sbrys on July 02, 2022, 11:09:07 AMMaybe it was never intended as an inflation hedge but anything with a fixed supply is hedged against inflation.This, maybe being a hedge against inflation was not one of that stated goals of bitcoin, however the characteristics of an asset and what you can do with it will dictate the way people use that asset.Bitcoin is a currency and yet its use as a currency is currently limited, while its use as a speculation vehicle and as a hedge against inflation are more popular due to its characteristics, so I think trying to argue that bitcoin does not have potential as a hedge against inflation just because it was not actively promoted by Satoshi as such is a mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "July 02, 2022, 08:30:47 PM",
      "body": "Being not being an inflation hedge totally depends on the investors, if you consider bitcoin as an asset for long-term investing this can be considered much more than just a hedge against inflation because if you check the market in long term you can clearly understand comparing to many other investment options bitcoin proved itself as one of the best options, but in the other hand, since some people have short term plans they chose bitcoin and this surely cannot be considered as a hedge against inflation for them generally it depends on the bitcoin investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 02, 2022, 08:37:13 PM",
      "body": "Quote from: Cryptornd on July 02, 2022, 10:42:34 AM now becoming is a P2p uncontrollable payment network across the globe.Bitcoin is not becoming a p2p payment network, it was always one since day one. It is getting more adopted, but the rate of adoption is extremely slow, even in developing countries. That's why the alternative narratives about digital gold, store of value, hedge against inflation have started to emerge. And I don't really see any big contradictions here, because  Bitcoin can serve different purposes, and it's totally in spirit of Bitcoin that people use it however they like, and not as Satoshi have envisioned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 02, 2022, 10:23:05 PMLast edit: July 03, 2022, 05:20:09 AM by franky1",
      "body": "bitcoin was designed as a inflation hedge right from the start. the whole purpose was to be deflationary..the halvings were coded in from the first ever version releasethe limited supply was too, as that is calculated due to the halving code to reach the near 21m coin cap.but the visible sign of deflation VALUE from a market view prospective, takes time to be more obvious. because its hidden by the speculative pricein short versioninflation currency starts at VALUE:speculation of 99.9%:0.1% and over years becomes 5%:95%deflation currency starts at VALUE:speculation of 0.1%:99.9% and over years becomes 95%:5%EG in the first 4 years 10.5 coins were released at this era it didnt feel like it was \"scarce\" and the value was low. and speculation was high..in the following 4 years 5.25m coins were released at this era it started to feel like it was \"scarce\" and the value was higher. and speculation was high but not extent/ magnitude as previous periodEG2011 value was a few cent but speculation caused a PRICE peak to $32, which was like a YYYx speculation bubble2013 value was  ~$50 but speculation caused a PRICE peak to $1,200, which was like a YYx speculation bubble2017 value was  ~$700 but speculation caused a PRICE peak of $20k which was like a YYx speculation bubblein 2021 the speculation peak were only Yx of valuethe deflationary VALUE is becoming more realised due to the less of a gap of the speculation between VALUE and PRICE (less obsurdly high speculation bubbles as time moves on)yep there are going to get less shockingly high prices in comparison to VALUE..  while the underlying deflationary value will rise and be more noticeableit just takes time to see the deflation VALUE in number form on a market because the speculation of PRICE hides it too well at the beginning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "July 02, 2022, 10:50:34 PM",
      "body": "Quote from: Cryptornd on July 02, 2022, 10:42:34 AMBitcoin was never supposed to be an inflation hedge in the first place. That was an idea built by influencers and speculators in the last years. What Bitcoin was supposed to be and is now becoming is a P2p uncontrollable payment network across the globe.That's not true. Deflation is built into the protocol and the limited supply is where this idea of crypto being an inflation hedge came from. Whether or not an inflation hedge was the inherent goal of Bitcoin isn't really the point. The inherent goal of BTC was a decentralized currency system and with it came the luxury of not having to worry about your purchasing power being siphoned off by 2% minimum a year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "July 02, 2022, 11:49:26 PM",
      "body": "+1It has strayed from its objective. But the devs try to keep it on track. As you mentioned, the development of lightning network attests to it.Whereas the market and economic side of bitcoin can't be controlled to align with its philosophy. It has turned into a memestock.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "July 03, 2022, 04:56:10 AM",
      "body": "Well probably it was not designed by per se, but as you can see, it could be a good hedge after all. And it has evolved that you can used it in whichever you want, store of value, hedge against inflation (we've seen in during the pandemic), currency, commodities, and others. And I don't think it's bad, on the contrary, the limited supply alone will tell us how it could be a good when you used it to protect your assets in the long term, although you have to factor it's volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 03, 2022, 05:50:56 AM",
      "body": "I'd say inflation must have already been in Satoshi's mind when he/she/they designed Bitcoin. One reason of inflation is the indiscriminate injection of large new supplies of money in the fiat circulation. This has contributed to the undervaluation of money. And the decision to print more money resides in a few powerful individuals up there. This fatal flaw in the fiat system has played an integral role in the design of Bitcoin.This must be the reason why Bitcoin's supply is fixed and hard-coded that tampering it is beyond possibility. So Bitcoin must be partly created in such a way that it avoids inflation. Bitcoin's design is made such in order for it not to share the same fate with the inflationary fiat. So, Bitcoin was in a way created to hedge against inflation. But I don't think Satoshi made it all from the point of view of an investor. The consumers, the day-to-day spenders, must have been the foremost consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}