{
  "id": "topic_5402709",
  "title": "lixueqi",
  "author": "lixueqi",
  "created_time": "June 15, 2022, 10:26:58 AM",
  "content": "copper member DireWoIfM14 is scammer, he let me provide him vcc first, then he goes disappear",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402709",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "June 15, 2022, 04:07:52 PM",
      "body": "Even though I know that you are just bullshitting (unless you got scammed by impersonator which has happened many times before), care to share some proof? Preferably using the scam report format that you can find pinned at the top of this board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 15, 2022, 08:04:07 PM",
      "body": "Quote from: lixueqi on June 15, 2022, 10:26:58 AMcopper member DireWoIfM14 is scammer, he let me provide him vcc first, then he goes disappearwould you mind linking his bitcointlak profile? the name you shared doesn't match the \"DireWoIfM14\" here in the forum. also, would mind sharing any evidence? DireWolfM14 has been trading with people here in the forum for a long time and having an accusation like this is a big deal. if you have evidence, share it. if you don't, you'll most likely be ignored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 15, 2022, 09:09:41 PMLast edit: June 15, 2022, 09:21:07 PM by DireWolfM14",
      "body": "Quote from: lixueqi on June 15, 2022, 10:26:58 AMcopper member DireWoIfM14 is scammer, he let me provide him vcc first, then he goes disappearYou are absolutely 100% correct that DireWoIfM14 is absolutely 100% a scammer.  Don't deal on Telegram without confirming the identity of the individual here on the forum!  My psudonym is DireWolfM14, not DireWoIfM14.  See the difference?  This is why I have my Telegram name on my profile page, so people can confirm whether they are really talking to me or not.In fact, I just posted a warning about this a couple of days ago:Quote from: DireWolfM14 on June 13, 2022, 02:59:22 PMI received a PM from a new member this morning, asking if I was in communication with him on Telegram.  I was not, but the person he was communicating with was claiming to be me.  This scammer has been at it for at least a couple of years.  His \"first name\" is spelled exactly like my forum handle, but for the Telegram user name he's using a capitol \"i\" instead of an \"l\" in the word wolf, i.e. DireWoIfM14.  The scammer's profile picture is a photo of some hardware wallets that I recently posted for sale.Here's his Telegram user info:Code:@DireWoIfM14Id: 5256982660First: DireWolfM14Be diligent when using Telegram.  Do not trust anyone who approaches you out of the blue claiming to be me.  I will never do that, and you can be sure it's a scam!  My Telegram ID is posted on my profile page, copy it and paste into Telegram to contact me.  I've been under attack myself recently because I don't tolerate any Telegram shitfuckery here on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "June 15, 2022, 09:37:16 PM",
      "body": "OP, sorry for your loss. You should have done business with people outside the forum not to talk of the telegram which is the empire of crypto scammers.Quote from: DireWolfM14 on June 15, 2022, 09:09:41 PM  My psudonym is DireWolfM14, not DireWoIfM14.  See the difference?  The scammer that played OP is really smart because it is hard to identify the difference between the 2 telegram ID if you don't point it out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "June 15, 2022, 10:24:40 PM",
      "body": "Quote from: lixueqi on June 15, 2022, 10:26:58 AMcopper member DireWoIfM14 is scammer, he let me provide him vcc first, then he goes disappearMaybe you should stop making deals over emails and telegram which is a haven for scammers. You already have a profile here, making adverts and getting customers in this forum. What's the point of carrying out the other part of the deal off the forum?Or at least try to confirm that the person sending you a message in telegram is not an impersonator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 16, 2022, 06:44:33 AM",
      "body": "Your Telegram and email address are publicly posted, which means that anyone can contact you and claim whatever they want. It's your job to filter out the scammers from genuine users, especially if someone claims to be a trusted member of the forum. Don't believe anything you see on the Internet and don't trust people you don't know. Had you asked that DireWoIfM14 to send you a PM on Bitcointalk, you would have been safe.The best thing you can do now is report him to Telegram as being a spammer. Not sure if anything will happen to the account though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "June 16, 2022, 07:09:18 AM",
      "body": "Quote from: logfiles on June 15, 2022, 10:24:40 PMMaybe you should stop making deals over emails and telegram which is a haven for scammers.I've done trades with members via PMs and used e-mail communications in the process, but telegram, man....you're absolutely right about it being a haven for scammers and impersonators of bitcointalk members.  I even had one of these scam accusation threads made against me because apparently someone with my forum username on telegram (apparently successfully) scammed someone who thought they were dealing with me.And OP, I'm not going to rub salt in your wounds here; I'll just tell you I'm sorry you got scammed.  I probably wouldn't have been attentive enough to tell the difference between DireWolfM14's imposter either.  Just be more careful in the future--and that should probably go without saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 16, 2022, 02:08:00 PM",
      "body": "Quote from: lixueqi on June 15, 2022, 10:26:58 AM~First I want to say I am sorry for your loss.  I should have lead with that when I responded yesterday.  I hope it wasn't an expensive lesson to learn, and that you did learn how to be more careful.Quote from: Myleschetty on June 15, 2022, 09:37:16 PMThe scammer that played OP is really smart because it is hard to identify the difference between the 2 telegram ID if you don't point it out.This idiot has been at it since Bitcoin was trading for under $10K.  If he was smart he would have squirreled away a bit, cashed out ATH, and buggered off.  Instead, the moron is still here, scrounging around the forum looking for naive newbies to scam.Quote from: logfiles on June 15, 2022, 10:24:40 PMMaybe you should stop making deals over emails and telegram which is a haven for scammers. You already have a profile here, making adverts and getting customers in this forum. What's the point of carrying out the other part of the deal off the forum?To some extent I can understand the need to use an off-site messaging app, especially for newbies who have PM sending restrictions.  Many old-timers block newbies from sending them PMs in the first place, I do not.  Anyone can send me a PM.  As for Telegram, I must admit I actually like it as a messaging app, I find it very useful.  But like any tool that offers it's users a measure of freedom, some will abuse it.Quote from: logfiles on June 15, 2022, 10:24:40 PMOr at least try to confirm that the person sending you a message in telegram is not an impersonator.That's it right there, and it really doesn't take much:  All the OP would have had to do is copy my Telegram UID from my profile page, and paste it into the search field in his Telegram app.  It would have been made clear that he was not talking to me, but the impostor.Quote from: The Pharmacist on June 16, 2022, 07:09:18 AMI even had one of these scam accusation threads made against me because apparently someone with my forum username on telegram (apparently successfully) scammed someone who thought they were dealing with me.If you have a good reputation here on the forum it's just a matter of time before someone tries to impersonate you on Telegram.  I have my suspicions about who's behind this, I even discussed it in the thread that you started back when this happened to you.Quote from: The Pharmacist on June 16, 2022, 07:09:18 AMI probably wouldn't have been attentive enough to tell the difference between DireWolfM14's imposter either.Me neither, which is why it's so important to be diligent.  I first notice this particular scammer when I started offering escrow services, but this is the first time I've seen where he was successful in scamming anyone.  The member who sent me a PM on Monday morning narrowly averted getting scammed himself.Hell, someone tried this scam on me a few years ago and I almost fell for it.  I posted about it at the time, but I don't want to bring up the thread because I had actually accused a reputable member of attempting to scam me.  It was during that discussion that I learned what had actually taken place.I've made it as easy as possible for people to confirm that they're talking to me.  I have my actual local time set as my forum time, you can see my local time on my profile page and I have a very typical schedule.  I have my real Telegram UID on my profile page, along with other contact information.  All of this in an effort to help people avoid being scammed by this impostor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "June 16, 2022, 05:04:04 PM",
      "body": "Quote from: Myleschetty on June 15, 2022, 09:37:16 PMThe scammer that played OP is really smart because it is hard to identify the difference between the 2 telegram ID if you don't point it out.Nothing smart really about this scam technique as its the most common one used at Telegram. Quote from: Pmalek on June 16, 2022, 06:44:33 AMThe best thing you can do now is report him to Telegram as being a spammer. Not sure if anything will happen to the account though.  Telegram accounts can get scam tag but since Telegram accounts are easily disposable I don't think that its even worth it to report that. I know I wouldn't waste a minute of my time on that anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 17, 2022, 07:32:43 AM",
      "body": "Quote from: Rikafip on June 16, 2022, 05:04:04 PMTelegram accounts can get scam tag but since Telegram accounts are easily disposable I don't think that its even worth it to report that. What about the usernames? If the DireWoIfM14 ID on a Telegram account associated with phone number A gets tagged, can the same ID be used again on a Telegram account associated to phone number B, but this time without the scam tag? If the scammer has been involved in various scams for years now, it's weird that the same username is still being used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "June 17, 2022, 08:05:32 AM",
      "body": "Quote from: Pmalek on June 17, 2022, 07:32:43 AMWhat about the usernames? If the DireWoIfM14 ID on a Telegram account associated with phone number A gets tagged, can the same ID be used again on a Telegram account associated to phone number B, but this time without the scam tag? I am not 100% sure but my guess is that it would be possible to remove scam tag that way. Thing is, people change their Telegram ID from time to time from various reasons so it makes more sense that scam tag is connected with phone number used to register that account, rather than username itself as some scammer may change his username but that won't remove scam tag and it wouldn't be fair if some new user gets tagged just because he used the same Telegram ID as that scammer. Keep in mind that beside Telegram ID there is also User ID that can't be changed and I guess tag is probably connected with that rather than Telegram ID.Quote from: Pmalek on June 17, 2022, 07:32:43 AMIf the scammer has been involved in various scams for years now, it's weird that the same username is still being used. That's because it is not enough for one person to report a scammer, but many in order for account to get tagged and on top of that people just don't bother reporting. I've been using Telegram frequently for 6 years now and I've seen maybe few dozens of accounts with that tag meaning its extremely rare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 17, 2022, 01:06:05 PM",
      "body": "Quote from: Rikafip on June 17, 2022, 08:05:32 AMQuote from: Pmalek on June 17, 2022, 07:32:43 AMWhat about the usernames? If the DireWoIfM14 ID on a Telegram account associated with phone number A gets tagged, can the same ID be used again on a Telegram account associated to phone number B, but this time without the scam tag? I am not 100% sure but my guess is that it would be possible to remove scam tag that way. Thing is, people change their Telegram ID from time to time from various reasons so it makes more sense that scam tag is connected with phone number used to register that account, rather than username itself as some scammer may change his username but that won't remove scam tag and it wouldn't be fair if some new user gets tagged just because he used the same Telegram ID as that scammer. Keep in mind that beside Telegram ID there is also User ID that can't be changed and I guess tag is probably connected with that rather than Telegram ID.Quote from: Pmalek on June 17, 2022, 07:32:43 AMIf the scammer has been involved in various scams for years now, it's weird that the same username is still being used. That's because it is not enough for one person to report a scammer, but many in order for account to get tagged and on top of that people just don't bother reporting. I've been using Telegram frequently for 6 years now and I've seen maybe few dozens of accounts with that tag meaning its extremely rare. After I got that PM on Monday I sent an email to Telegram support about the DireWoIfM14 account , but I haven't heard back.  I tried reporting him myself, but I couldn't figure out how to do it.  There is usually a link to report the user in the right-hand side bar, but I didn't see one for this user.  I figured we may have had to be in a conversation with each other, so I sent him the screenshot that I got in my PM, the idiot actually responded but kept deleting all the messages shortly after sending them.  I still couldn't see how to report him, what was I doing wrong?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 17, 2022, 02:02:53 PM",
      "body": "Quote from: DireWolfM14 on June 17, 2022, 01:06:05 PMI still couldn't see how to report him, what was I doing wrong? There is no dedicated report button on Telegram if I remember it correctly. Just open the PM chat with the impersonator and on the right there should be a \"block user\" button. When you click that, you should be able to click on an additional option to report the user for spam. I think that's all you can do. I don't know if there is a form that you can fill out to describe the issue you had with that user. Maybe there is an alternative way through a support page as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 17, 2022, 05:25:56 PM",
      "body": "Quote from: DireWolfM14 on June 17, 2022, 01:06:05 PMAfter I got that PM on Monday I sent an email to Telegram support about the DireWoIfM14 account , but I haven't heard back.  I tried reporting him myself, but I couldn't figure out how to do it.  There is usually a link to report the user in the right-hand side bar, but I didn't see one for this user.  I figured we may have had to be in a conversation with each other, so I sent him the screenshot that I got in my PM, the idiot actually responded but kept deleting all the messages shortly after sending them.  I still couldn't see how to report him, what was I doing wrong?I think you should talk to @theymos, asking him to change your account username to something that can be noticed because I thought you was the real scammer when I read the topic title for the first time.Choose a normal name  that any modification of one of the characters in it is visible and anyone can distinguish that it is not your account, and from here, you do not need to report to the Telegram administration to ban that account because you changed your account username here..You can also SPAM that account until your username changes.For people who have been scammed, I hope it will be a lesson for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 17, 2022, 06:01:48 PM",
      "body": "Quote from: hugeblack on June 17, 2022, 05:25:56 PMI think you should talk to @theymos, asking him to change your account username to something that can be noticed because I thought you was the real scammer when I read the topic title for the first time.It's pretty hard to see the difference, and on Telegram it's even harder.  The capitol \"I\" looks nearly identical to a lower-case \"L\" with the font used for Telegram user names.  I thought about asking theymos for a name-change, but unless I can come up with a character set that's impossible to mimic with this tactic it'll just be a temporary fix.  I really don't want to play that game, and it would feel like I was caving-in to that piece of shit.And, mine isn't the only account he's attempted to mimic, I recall someone (probably the same guy) attempted this scam by mimicking monbux, Condoras, The Pharmacist, Royse777, and I'm sure there are more that I'm forgetting, and many that I've never known about.  As far as I know, this is the first time I've heard of someone actually getting scammed by the \"DireWoIfM14\" account, but I've had at least three people warn me that he was running around with that handle.  That makes me think that most people are able to figure it out and avoid being scammed.  Which makes me wonder how worthless this guy's time be, if he's wasting it scamming people for VCCs.  I mean really, how many people do you have to attempt this on before someone finally falls for it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "June 17, 2022, 07:45:21 PM",
      "body": "Quote from: hugeblack on June 17, 2022, 05:25:56 PMChoose a normal name  that any modification of one of the characters in it is visible and anyone can distinguish that it is not your account, and from here, you do not need to report to the Telegram administration to ban that account because you changed your account username here..I honestly think that's just waste of time as even if he goes through hassle of doing that, scammer will just use the name of some other reputable member. Quote from: Pmalek on June 17, 2022, 02:02:53 PM I don't know if there is a form that you can fill out to describe the issue you had with that user. Maybe there is an alternative way through a support page as well. Regarding forms, you can use this link https://telegram.org/support, but I think that's what @DireWolfM14 already used. Another way to report scammer is via https://t.me/notoscam. Problem with both of these ways is that it usually won't work with just 1 report. I reported dozens of accounts, provided screenshots etc and never managed to get a single account tagged so in the end I just gave up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 17, 2022, 07:56:45 PM",
      "body": "Quote from: Rikafip on June 17, 2022, 07:45:21 PMQuote from: hugeblack on June 17, 2022, 05:25:56 PMChoose a normal name  that any modification of one of the characters in it is visible and anyone can distinguish that it is not your account, and from here, you do not need to report to the Telegram administration to ban that account because you changed your account username here..I honestly think that's just waste of time as even if he goes through hassle of doing that, scammer will just use the name of some other reputable member.I agree.  There are plenty of reputable members who's names can easily be mimicked.  I picture this douchebag as having a whole stable of accounts he breaks out when the opportunity presents itself.   If one of those members changes his name, he could just a few weeks or months until everyone is used to the new name and mimic that one as well.Quote from: Rikafip on June 17, 2022, 07:45:21 PMQuote from: Pmalek on June 17, 2022, 02:02:53 PM I don't know if there is a form that you can fill out to describe the issue you had with that user. Maybe there is an alternative way through a support page as well. Regarding forms, you can use this link https://telegram.org/support, but I think that's what @DireWolfM14 already used. Another way to report scammer is via https://t.me/notoscam. Problem with both of these ways is that it usually won't work with just 1 report. I reported dozens of accounts, provided screenshots etc and never managed to get a single account tagged so in the end I just gave up. I did indeed send a message to the support link, but not the notoscam link.  I'll submit a report using that link as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "16xypjnxlrew",
      "created_time": "June 20, 2022, 06:05:41 AM",
      "body": "Quote from: Rikafip on June 15, 2022, 04:07:52 PMEven though I know that you are just bullshitting (unless you got scammed by impersonator which has happened many times before), care to share some proof? Preferably using the scam report format that you can find pinned at the top of this board.Why are you so sure he's not a scammer? A few hours ago, he demanded $2,000 from me for a non-existent loan.Look it this     - https://bitcointalk.org/index.php?topic=5401083.msg60399947#msg60399947",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "June 20, 2022, 06:29:37 AM",
      "body": "Quote from: 16xypjnxlrew on June 20, 2022, 06:05:41 AMWhy are you so sure he's not a scammer? A few hours ago, he demanded $2,000 from me for a non-existent loan.Look it this     - https://bitcointalk.org/index.php?topic=5401083.msg60399947#msg60399947OMG you are right and I have been wrong all along. But your are exaggerating though as he only asked for $1,999.91 back, not $2,000. Big difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}