{
  "id": "topic_5454257",
  "title": "Kaliandra",
  "author": "Kaliandra",
  "created_time": "May 28, 2023, 05:16:50 AM",
  "content": "even though I can't cook, especially in terms of making pizza, of course I can't,but with the bitcoin pizza making contest I became interested in participating and enlivening it, and this is my first experience in making bitcoin pizza.and I have a unique story, namely when I was making bitcoin pizza, a guest came, namely he was my friend and he asked, what are you doing?and I replied that I was making bitcoin pizza, and at that time he immediately asked me about bitcoin and its uses, and I answered as knowledgeable as I could. and I also explain about the risk of investing in btc.until finally he was interested in investing in btc, but I reminded him to learn about btc investing first because so he would understand the risks and benefits of investing in btc, and so he wouldn't blame me if later he failed to invest in btc.but in the end he still wants to invest in btc and is ready for the risks.and finally he decided to invest and buy btc but at that time he bought btc only using a small capital of around $ 30.and he said he wanted to try with small money first so that the risk was not too big if he suffered a loss.and I said yes, it was a good decision.this is my unique story which of course has something to do with the bitcoin pizza contest that I participated in.i want to hear your opinion,and for those who are interested in joining the bitcoin pizza contest of course there is still time...Quote from: Kaliandra on May 25, 2023, 11:32:04 PMthis is my first pizza making, and I want to celebrate bitcoin pizza day here's a picture of the pizza...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454257",
  "comments": [
    {
      "author": "Plaguedeath",
      "created_time": "May 28, 2023, 05:24:55 AM",
      "body": "Why you're need to create a new thread about your entry? you already earn 9 merits in that post, does it still not enough for you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "May 28, 2023, 05:40:26 AM",
      "body": "Quote from: Plaguedeath on May 28, 2023, 05:24:55 AMWhy you're need to create a new thread about your entry? you already earn 9 merits in that post, does it still not enough for you? everything isn't about merits na, I believe op wasn't aware his initial post would even give him that much of a merit.Though this post isn't really about the Bitcoin pizza, it's rather about a friend be could convince to join the family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 28, 2023, 06:01:01 AM",
      "body": "I don't know if this is a true or a fake story, and I don't care.The real questions here is only one. What the hell is this abomination on the two pictures above?  Is this really a pizza?If this is pizza, I'm Brad Pitt. Do you even know how to make real pizza?Anyway, I really hope that your friend(if he is real person) will become a true Bitcoiner and he won't sell everything when the price crashes again.And after that, he won't act but-hurt, talking about how Bitcoin/crypto is a scam and he lost all his investments, because of {insert BS explanation here}.... Many newbies do such things(unfortunately).Happy Bitcoin pizza day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 28, 2023, 06:05:08 AM",
      "body": "Dear op, your Dish looks nice, and i really appreciate your efforts, as you asked us to take part in pizza competition too but i do not know how to make pizza, i am not a good cook but i will look into it because once you try something you always learn something. So, thanks for heads up, and btw, i am not making fun or disrespecting you, i just want to say, you pizza more looks like a cake. Sorry i just can't hold myself back but really as you said its your first try so, i think its worth the shot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kaliandra",
      "created_time": "May 28, 2023, 06:11:13 AMLast edit: May 28, 2023, 09:47:00 PM by Mr. Big",
      "body": "thank you for the comment, yes, the results of my homemade pizza are not good, please understand because I can't cook enough..I really appreciate your comments,Quote from: Plaguedeath on May 28, 2023, 05:24:55 AMWhy you're need to create a new thread about your entry? you already earn 9 merits in that post, does it still not enough for you?I'm just telling you about my unique story, because a friend is interested in investing in BTC as a result of me making bitcoin pizza, sorry I don't understand what you mean by merit?Quote from: Faisal2202 on May 28, 2023, 06:05:08 AMDear op, your Dish looks nice, and i really appreciate your efforts, as you asked us to take part in pizza competition too but i do not know how to make pizza, i am not a good cook but i will look into it because once you try something you always learn something. So, thanks for heads up, and btw, i am not making fun or disrespecting you, i just want to say, you pizza more looks like a cake. Sorry i just can't hold myself back but really as you said its your first try so, i think its worth the shot. thank you for the comment friend ,,, yes hopefully next year if there is another pizza contest I can improve my pizza and take part in the contest again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solokan",
      "created_time": "May 28, 2023, 06:34:27 AM",
      "body": "op this is an interesting story,and I also don't know if this is a true story or not, but I see that you are a great person because as you said you can't cook but you can still force yourself to make bitcoin pizzaand i appreciate that.because you have explained the risks of investing in btc to your friends, I think this is a good action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jatiluhung",
      "created_time": "May 28, 2023, 08:34:33 AM",
      "body": "Quote from: Plaguedeath on May 28, 2023, 05:24:55 AMWhy you're need to create a new thread about your entry? you already earn 9 merits in that post, does it still not enough for you?I hope you get into the habit of reading the whole story the OP has told first. Because the OP here tells the story behind making his first Pizza. So even if it has something to do with a bitcoin pizza baking contest. But it seems the OP's intention was to tell the story behind making his first pizza that relates to his friend's curious interest in bitcoin.Quote from: Kaliandra on May 28, 2023, 05:16:50 AM  ....I appreciate your efforts OP in making pizza. Even though it seems that what you said is true, namely that you are not good at cooking, your desire to participate and liven up the contest deserves a thumbs up.Actually I also intend to follow it. and actually I intend today to make it if I get off work. but sadly my job doesn't let it. because I have a target that must be completed quickly in my work. and indeed my type of work does not recognize red dates. if target has to be completed then i have to do it. A field that is fun but also makes me tired sometimes. but because I work in a field that is a hobby that I like, I enjoy it.I hope I can enter the pizza baking contest before the time ends.And about your friends who are interested in bitcoin, I hope you advise your friends to seek more insight regarding Bitcoin. Maybe you could even invite him to this forum to learn more. But with only $30 and it being used for investing in bitcoin then I think it's still a decent experiment step. as long as he uses money that is really ready if he has to suffer a loss.and don't forget to also remind your friends not to store their assets in a centralized Exchange. and teach him a lesson about personal Wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "May 28, 2023, 08:56:39 AM",
      "body": "Joining the contest is not an easy task because it requires money to buy the ingredients, time to study about pizza and to bake one. Therefore, I want to appreciate your effort. Introducing one person to Bitcoin is also not a small deal because that person can introduce more people. I also appreciate the fact that you informed your friend about the risks involved in investing. It is also good he invested a little money because he can afford to lose it. I hope you shared the pizza with your friend. I wish you win the pizza contest. Quote from: Plaguedeath on May 28, 2023, 05:24:55 AMWhy you're need to create a new thread about your entry? you already earn 9 merits in that post, does it still not enough for you?A hasty conclusion like this could be hurtful. OP has never said he wanted merits or were you able to read his mind? This could discourage OP from sharing some useful information in the future. If you think it is merit begging, don't give merit or ignore him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "May 28, 2023, 08:58:20 AM",
      "body": "Quote from: davis196 on May 28, 2023, 06:01:01 AMI don't know if this is a true or a fake story, and I don't care.The real questions here is only one. What the hell is this abomination on the two pictures above?  Is this really a pizza?If this is pizza, I'm Brad Pitt. Do you even know how to make real pizza?That's exactly what I wanted to comment on - I mean, come on, that's definitely not pizza! (It looks more like a scone with a random splattering of ketchup on top.)How dare they disgrace the sacred name of 'pizza' by using it for this abomination? It's nothing short of blasphemy!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "May 28, 2023, 09:05:24 AM",
      "body": "Quote from: Kaliandra on May 28, 2023, 05:16:50 AMI want to celebrate bitcoin pizza day...Celebrating bitcoin pizza day just on your socials is enough to get the attention of some doubters and people who do not believe in bitcoins yet to ask you what the celebration is about. ln your case, just from making pizza to celebrate the day, you were able to get one more person to believe in bitcoins and that is very good. Quote from: Kaliandra on May 28, 2023, 05:16:50 AMand he said he wanted to try with small money first so that the risk was not too big if he suffered a loss.and I said yes, it was a good decision.It is good decision to start investing in bitcoins with a small amount, but there is a better decision if you have not been informed. Bitcoin is not a ponzi were you put in a little money (in their terms \"invest\"), and get a very ridiculous return. That is why newbies to bitcoin after understanding what bitcoin is, it's benefits and what it is about are also encouraged the need need to develop a strategy to invest more often than once through a strategy called DCA (Dollar-cost averaging). Waiting for a very small investment in bitcoins to grow into some ridiculous amount is futile and a waste of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 28, 2023, 09:41:00 AM",
      "body": "A beautiful story and I hope it is true, but investing based on the opinions of friends or impulsive investment is not good. It is better for your friend to learn more about Bitcoin, the right time to invest, wallets, how to keep wallet seed and the safety of those currencies.I know many stories of people who invested good sums in Bitcoin like $1000 and lost it because the phone stopped working and they weren't writing down their seed or keeping it in digital form inside the same phone.Quote from: Kaliandra on May 25, 2023, 11:32:04 PMIt looks delicious even though it's not pizza.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "May 28, 2023, 10:24:59 AM",
      "body": "Quote from: Fiatless on May 28, 2023, 08:56:39 AMA hasty conclusion like this could be hurtful. OP has never said he wanted merits or were you able to read his mind? This could discourage OP from sharing some useful information in the future. If you think it is merit begging, don't give merit or ignore him.Who will say they want to earn merits directly in their post or have you seen anyone saying they are writing up this content solely for merit purposes? He is making judgement from his post creation as he has already received 9 merits on pizza post and now sharing stories give hint on that one.This is not to discourage members but to avoid similar post without any much use.But it's good that he has convinced someone to invest in btc by telling him the pros and cons making him aware about risks associated with it.Even with small amounts people can make progress on holding good amount with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "May 28, 2023, 10:39:31 AM",
      "body": "OP, your pizza looks good and tempting. I hope your friend will take his time to learn more about bitcoin because he needs to understand what he has invested into and the market analysis. There ate different ways in which people can be attracted to bitcoin, it is not mostly that we approach them but some events about bitcoin can speak louder than voices. If OP is telling us the truth, it means that his participation in the pizza content has brought someone into the cryptospace. This is a positive one for bitcoin adoption.Quote from: Kaliandra on May 28, 2023, 06:11:13 AMthank you for the comment, yes, the results of my homemade pizza are not good, please understand because I can't cook enough..I really appreciate your comments,Quote from: Kaliandra on May 28, 2023, 06:25:21 AMQuote from: Faisal2202 on May 28, 2023, 06:05:08 AMDear op, your Dish looks nice, and i really appreciate your efforts, as you asked us to take part in pizza competition too but i do not know how to make pizza, i am not a good cook but i will look into it because once you try something you always learn something. So, thanks for heads up, and btw, i am not making fun or disrespecting you, i just want to say, you pizza more looks like a cake. Sorry i just can't hold myself back but really as you said its your first try so, i think its worth the shot. thank you for the comment friend ,,, yes hopefully next year if there is another pizza contest I can improve my pizza and take part in the contest again.Quote from: Kaliandra on May 28, 2023, 06:20:53 AMQuote from: Plaguedeath on May 28, 2023, 05:24:55 AMWhy you're need to create a new thread about your entry? you already earn 9 merits in that post, does it still not enough for you?I'm just telling you about my unique story, because a friend is interested in investing in BTC as a result of me making bitcoin pizza, sorry I don't understand what you mean by merit?Next time you should compile your post in one and not posting them differently when you are replying to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demonica",
      "created_time": "May 28, 2023, 11:40:26 AM",
      "body": "Congrats on your achievement, joining a Bitcoin pizza contest. It seems a great experience, also the fact that you were able to share your knowledge about Bitcoin to others during the time you're making your pizza. Glad to hear that your friend is interested and the even if you reminded him about the risk, it didn't stopped him getting into Bitcoin. Hoping for him to have a great Bitcoin journey. Also, you can introduce him to the forum so he can learn and discover more about Bitcoin.As for your contest journey OP, I haven't tried baking or cooking for Bitcoin or any crypto related contest, but it would be interesting to join if I have a time cause that looks fun. Tbh your pizza looks interesting although for me, it looks more like a cake rather than a pizza. But great work!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "May 28, 2023, 12:21:54 PM",
      "body": "Your pizza looked nice, I would definitely have eaten a slice.This is what bitcoin is all about, helping others & making both yours & others around you lives better. I really hope your friend starts to allocate some money each month to invest in bitcoin. We are a massive movement, we get bigger & stronger every year with new people buying & HODLING bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "May 28, 2023, 06:15:38 PM",
      "body": "This is more awareness for bitcoin to have a pizza context. It is great that the message is touching more people and investment is growing and surely more related innovative program will unfold. Your pizza looks good and I feel Laszlo Hanyecz would have offered more bitcoin for it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 28, 2023, 07:01:33 PM",
      "body": "Quote from: Kaliandra on May 28, 2023, 05:16:50 AM  even though I can't cook, especially in terms of making pizza, of course I can't,but with the bitcoin pizza making contest I became interested in participating and enlivening it, and this is my first experience in making bitcoin pizza.and I have a unique story, namely when I was making bitcoin pizza, a guest came, namely he was my friend and he asked, what are you doing?and I replied that I was making bitcoin pizza, and at that time he immediately asked me about bitcoin and its uses, and I answered as knowledgeable as I could. and I also explain about the risk of investing in btc.until finally he was interested in investing in btc, but I reminded him to learn about btc investing first because so he would understand the risks and benefits of investing in btc, and so he wouldn't blame me if later he failed to invest in btc.but in the end he still wants to invest in btc and is ready for the risks.and finally he decided to invest and buy btc but at that time he bought btc only using a small capital of around $ 30.and he said he wanted to try with small money first so that the risk was not too big if he suffered a loss.and I said yes, it was a good decision.this is my unique story which of course has something to do with the bitcoin pizza contest that I participated in.i want to hear your opinion,and for those who are interested in joining the bitcoin pizza contest of course there is still time...Quote from: Kaliandra on May 25, 2023, 11:32:04 PMthis is my first pizza making, and I want to celebrate bitcoin pizza day here's a picture of the pizza...I think BTC is the thing not to invest into, but the thing to buy. Investment usually provides stable income, while BTC can either bring money after a long period of time, or prevent from losing money in case of fiat inflation. So BTC is not an investment, it's better to be described as the purchase of a valuable digital asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 28, 2023, 07:58:54 PM",
      "body": "I'm not here to advertise myself and I don't know if your story is true or not, I hope it is for your friend but in the contest I saw practically all the participants cooking something that is not a pizza.  As a good Italian I cannot accept this massacre.https://bitcointalk.org/index.php?topic=5247383.msg62301826#msg62301826",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "May 28, 2023, 08:18:25 PM",
      "body": "This is indeed a unique story, whether true or false I still think your friend was too hasty in his decision to buy bitcoins. He made a financial decision so suddenly without considering the pros and cons. He blatantly refused your advice to learn about the risks of investing, He will say this in the beginning but he will definitely blame you if he loses his money. Hope you won the pizza contest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}