{
  "id": "topic_5512524",
  "title": "asonganyi",
  "author": "asonganyi",
  "created_time": "October 09, 2024, 03:22:24 AM",
  "content": "The HBO Satoshi reveal turned out to be a no-event.As their Pick wrote on X \" I AM NOT SATOSHI\".X user had a more convincing candidate.There was just too much hype about the documentary, and the market didn't react to its release as some gurus anticipated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5512524",
  "comments": [
    {
      "author": "Fiatless",
      "created_time": "October 09, 2024, 04:01:13 AM",
      "body": "Quote from: asonganyi on October 09, 2024, 03:22:24 AMThe HBO Satoshi reveal turned out to be a no-event.As their Pick wrote on X \" I AM NOT SATOSHI\".X user had a more convincing candidate.There was just too much hype about the documentary, and the market didn't react to its release as some gurus anticipated.The documentary brought more questions than answers. How can you depend on someone's reply to a post as a basis or main evidence for your conclusion? There was not even one compelling evidence that Peter Todd is Satoshi. Just because he claimed to be knowledgeable about C++ and made an erroneous post doesn't make the dude Satoshi. Everyone knows the litmus test to prove who Satoshi is: The private keys to his wallet. I hope Cullen Hoback achieved his aim of making the documentary which is to make money. HBO just brought Peter Todd into the spotlight, and he might have to need private security to move around because he is now a big target for criminals. If I were in his shoes, the next step would be to sue the producers of the documentary for telling lies and exposing me to danger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "October 09, 2024, 04:02:18 AM",
      "body": "Quote from: asonganyi on October 09, 2024, 03:22:24 AMThe HBO Satoshi reveal turned out to be a no-event.As their Pick wrote on X \" I AM NOT SATOSHI\".X user had a more convincing candidate.We all knew that it was just going to be a theory and that they will not have an answer for sure. Notice how it is deliberate they say that it is 'likely' for Satoshi to be Peter Todd. They did not claim that that is 100% true. I have not watched the documentary but I will definitely check it out even if I already know that at the end of it, they just presented us with more questions and less answers.QuoteThere was just too much hype about the documentary, and the market didn't react to its release as some gurus anticipated.There was hype because they made it seem like they actually found the real Satoshi. Thankfully they did not create some blatant lie to sell the documentary. It would have affected the market more if they actually had a breakthrough but so far from what I have seen, they do not seem to have presented something no one knows yet. It is kind of funny that Peter Todd denied immediately the accusations making the documentary almost pointless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 09, 2024, 04:21:06 AM",
      "body": "It was hyped simply because it's HBO. HBO had the funds to make a very interesting and high-production-value documentary with good marketing. This is to be expected, as with having a lack of research and instead just focused on making the documentary look enticing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "October 09, 2024, 05:02:55 AM",
      "body": "To your topic question What has been more Hyped than the HBO doc?That would be the Fiat system. Quote from: asonganyi on October 09, 2024, 03:22:24 AMThe HBO Satoshi reveal turned out to be a no-event.As their Pick wrote on X \" I AM NOT SATOSHI\".X user had a more convincing candidate. I'm quite surprised they were individuals that were expecting something of concrete. I'm a very curious person but the documentary never piqued my interest Even if they wanted to speculate, I believe they could have done better with their marketing strategy and their reveal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "October 09, 2024, 06:00:28 AM",
      "body": "I have not seen the documentary yet but from the reactions on social media it appears to have been a dud. The filmmakers were probably just looking to make a quick buck and created a narrative that was convincing enough for a major platform, like HBO, to give them a lot of money. The speculation on Satoshi’s identity has become a sideshow. The whole Craig Wright saga was such an embarrassment and now people are just picking names at random. People are taking advantage of genuine curiosity for their personal financial gain. It is no longer interesting and we should completely ignore this nonsense from now on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "October 09, 2024, 06:22:49 AM",
      "body": "Quote from: Fiatless on October 09, 2024, 04:01:13 AMHBO just brought Peter Todd into the spotlight, and he might have to need private security to move around because he is now a big target for criminals. If I were in his shoes, the next step would be to sue the producers of the documentary for telling lies and exposing me to danger. I support this, I guessed he should warn HBO now that if he or his love ones suffers any criminal attacks in regarding this claim, then they should be ready to pay for the damages and every stress they will cause them also. There have been others who have been victims of this, which is very disturbing to their personal life, HBO only got good marketing but empty proof, though I hope he sue them for this, then it will become a lesson for others not to wide their mouth for nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "October 09, 2024, 06:23:39 AM",
      "body": "I don’t get why people are so hyped about that documentary. The whole “revealing Satoshi” thing is already misleading. Satoshi will stay anonymous, and there’s no reason for him to come forward. HBO is just trying to ride the Bitcoin hype, like they always do. It’s surprising that some people still fall for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "October 09, 2024, 07:17:08 AM",
      "body": "Quote from: asonganyi on October 09, 2024, 03:22:24 AMThe HBO Satoshi reveal turned out to be a no-event.As their Pick wrote on X \" I AM NOT SATOSHI\".Peter Todd denied that he is Satoshi Nakamoto.QuoteX user had a more convincing candidate.Who is a more convincing candidate to be Satoshi Nakamoto?I don't know about X users but theymos has his thinking about it.Quote from: theymos on October 04, 2024, 05:13:36 PMAre all of the interviews in the trailer original? I got the feeling that several of them were interviews I saw many years ago, though I could be wrong.My current feeling on Satoshi's identity is: - Sassaman is a very bad candidate. If this is their conclusion, then they totally failed to do proper research. - 50% chance it's someone nobody's ever heard of, and nobody will ever figure it out - 35% chance it's Hal Finney. (Over time, I've moved more probability into this category.) - 10% chance it's someone else in the Bitcoin-verse - 5% chance it's a group within the CIABut I'm really not a fan of the whole \"search for Satoshi\" genre. Being anonymous, Satoshi is an excellent myth and source of inspiration, since we can't see much of his flawed humanity. Mythical-Satoshi is a humble man who, with a lot of persistence and skill, but not with a level of brilliance beyond the reach of us mortals, single-handedly created a clockwork device so powerful that it shook the world. And then, in an action which nobody in the traditional halls of power would ever take, he had the wisdom to walk away: a modern Cincinnatus. I like that myth very much, and I'd rather it not be tainted by association with an actual human.I don't know X users have same candidates like ones shared by theymos.Several topics on this HBO's documentary film.Satoshi Identity Revealed LOLMoney Electric: The Bitcoin Mystery (2024 documentary)Could this just be the \"LAMEST\" News?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 09, 2024, 08:24:22 AM",
      "body": "Stirring up controversy in this way and reaching this result makes me unwilling to watch the documentary. They are looking for profits more than it is historical documentation or a narration of some facts, and therefore all the information contained in the documentary is questionable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 09, 2024, 10:41:35 AM",
      "body": "Quote from: asonganyi on October 09, 2024, 03:22:24 AMThe HBO Satoshi reveal turned out to be a no-event.As their Pick wrote on X \" I AM NOT SATOSHI\".X user had a more convincing candidate.There was just too much hype about the documentary, and the market didn't react to its release as some gurus anticipated.It was obvious from the start that it was just a futile exercise. What were they thinking? Satoshi would just admit to them that he was Satoshi the inventor of Bitcoin? I just don't understand what they were planning to gain from all that show they put up and to me was just a waste of time. I guess if the real Satoshi is still alive and seeing this. He will just be smiling at their foolishness right now. Someone who decided to exit the public a decade ago will just burst out of the dark and says he is was the one? They should end this their hunt for Satoshi as it's becoming a waste of their effort and research..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "October 09, 2024, 12:51:18 PM",
      "body": "Quote from: asonganyi on October 09, 2024, 03:22:24 AMThe HBO Satoshi reveal turned out to be a no-event.As their Pick wrote on X \" I AM NOT SATOSHI\".X user had a more convincing candidate.There was just too much hype about the documentary, and the market didn't react to its release as some gurus anticipated.Now what next with this after they made that claims? Todd denies his involvement with Satoshis identity. Its like HBO just pointing fingers towards possible candidate but they don't show any great proof that can unveil the mask of Satoshi Nakamoto. What they did leaves great question that what documentary they show is true or just base on their mischievous thinking.There was to much hype on their documentary release since HBO is big platform. But they didn't satisfied the old lads on crypto since many think about what they released is not actually mind blowing.Now Todd is gaining a lot of unnecessary attention and let see what possible action he do regarding on HBO claims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 09, 2024, 01:27:41 PM",
      "body": "Quote from: Taskford on October 09, 2024, 12:51:18 PMNow Todd is gaining a lot of unnecessary attention and let see what possible action he do regarding on HBO claims.Only amateur people believe in what revealed in HBO documentary film.People who understand about Bitcoin will not believe in it, and can not identify Satoshi Nakamoto or any Bitcoin owner if there is no signed message from a private key of a public address that is known. Another way is message signed with PGP key.Without these messages with Bitcoin private key and PGP key, anyone who claim to be Satoshi Nakamoto, is not enough to prove it like Craig Wright failed.Quote from: theymos on April 25, 2013, 06:12:22 PMQuote from: mokimarket on April 25, 2013, 12:39:38 AMDo you think \"satoshi\" will ever just randomly log in one day and post something? His account is locked, so no. If he wants to claim his account, he'll have to contact me with a PGP signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "October 09, 2024, 02:28:18 PM",
      "body": "HBO is spreading wrong information about who Satoshi is and if a documentary like this can draw more attention, I guess HBO is misusing the opportunity of his documentary to extort the public with fake information about the identity of Satoshi when he knows that it is impossible for anyone to know who Satoshi is. Only dumb ass will believe all the cooked stories in HBO documentary.I am Satoshi and I live in space where I have a bitcoin Island. If you want to see me, come over to space as I am working on a new project, and it will take me up to two years to finish this project. I know some dumb ass might want to come to space to see if it is true. When you are successful people frame up a lot of stories about you and claim to be your friend. Satoshi, bitcoin have made you like a god on earth that nobody has seen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "October 09, 2024, 02:35:37 PM",
      "body": "Quote from: Frankolala on October 09, 2024, 02:28:18 PMHBO is spreading wrong information about who Satoshi is and if a documentary like this can draw more attention, I guess HBO is misusing the opportunity of his documentary to extort the public with fake information about the identity of Satoshi when he knows that it is impossible for anyone to know who Satoshi is. Only dumb ass will believe all the cooked stories in HBO documentary.I am Satoshi and I live in space where I have a bitcoin Island. If you want to see me, come over to space as I am working on a new project, and it will take me up to two years to finish this project. I know some dumb ass might want to come to space to see if it is true. When you are successful people frame up a lot of stories about you and claim to be your friend. Satoshi, bitcoin have made you like a god on earth that nobody has seen.HBO is rolling down with the hype on it, and in some years, I do think we will see even more \"films\" like that. Just you wait:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 09, 2024, 03:35:04 PM",
      "body": "Do not expect that these hyped documentaries are going to move the market. What's more recognizable that can move the market? Some of the X accounts from the popular people twitting about dogs, frogs, cats, and other animal types of memecoins. And most of the people don't have enough time to watch long hours or minutes of these documentaries and that's why many just chooses to read the reviews from the people who have watched it. So, where's the hype with that? only to the ones who have made it and it seems that there's really no excitement from the end of the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 09, 2024, 03:43:00 PM",
      "body": "No reaction is exactly what they expect. Until Millions of Satoshi's BTC is dumped and there will be no reaction still. What got into HBO for publishing such documentary when it has proven nothing. But then this kind of documentary and claims are going to be usual and then one day Satoshi is going to send his million BTC somewhere and yet no market reaction will happen. This is just programming us all to something we will not react even when its real already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "October 09, 2024, 04:11:42 PM",
      "body": "Quote from: Fiatless on October 09, 2024, 04:01:13 AMThe documentary brought more questions than answers. How can you depend on someone's reply to a post as a basis or main evidence for your conclusion? There was not even one compelling evidence that Peter Todd is Satoshi. Just because he claimed to be knowledgeable about C++ and made an erroneous post doesn't make the dude Satoshi. Everyone knows the litmus test to prove who Satoshi is: The private keys to his wallet. I hope Cullen Hoback achieved his aim of making the documentary which is to make money. I was expecting something shocking with unknown arguments before. Still, then I remembered that this is a documentary made by HBO, which wants to generate revenue by selling HBO subscriptions. Then I also asked myself, if they really found a new satoshi, wouldn't that information be leaked? There is no way their team knew the real identity of Satoshi and someone inside didn't leak the information before the documentary debut.HBO's argument was that Peter Todd comment - \"Of course, to be specific, the inputs and outputs can't match *exactly* if the second transaction has a transaction fee.\" after Satoshi's post, meant that it was Satoshi himself and accidentally posted via Peter's account. This is funny but at the same time shameful from a company that made one of the best TV shows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "October 09, 2024, 07:24:40 PM",
      "body": "Quote from: asonganyi on October 09, 2024, 03:22:24 AMThere was just too much hype about the documentary, and the market didn't react to its release as some gurus anticipated.The meme coins based on Solana that were linked to Todd saw a big pump, but HBO was just a joke, and they made some hype for a few days. Still, I am grateful that Peter Todd is alive to respond to these allegations and deny them. How can the market react to a documentary with stupid conclusions like this, as if they don't know about online forums on the internet? I agree with what Todd said on his official account on X that it was just a marketing ploy by Cullen Hoback to promote his film, so I hope this matter is not given more than it deserves. Satoshi will remain a mystery forever, and we should always know that documentaries and their producers are primarily for profit and controversy, regardless of anything else.Source: https://x.com/peterktodd",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bit3012009",
      "created_time": "October 10, 2024, 01:32:21 AM",
      "body": "Quote from: hd49728 on October 09, 2024, 01:27:41 PMPeople who understand about Bitcoin will not believe in it, and can not identify Satoshi Nakamoto or any Bitcoin owner if there is no signed message from a private key of a public address that is known. Another way is message signed with PGP key.Without these messages with Bitcoin private key and PGP key, anyone who claim to be Satoshi Nakamoto, is not enough to prove it like Craig Wright failed.Satoshi is alive and even now making transactions on his accounts.For example 5 accounts:Created 2009.01.29: 1C4rE41Kox3jZbdJT9yatyh4H2fMxP8qmDCreated 2009.01.30: 18E5d2wQdAfutcXgziHZR71izLRyjSzGSXCreated 2009.01.31: 13J8FkimCLQ2EnP1xRm7yHhpaZQa9H4p8ECreated 2009.01.31: 1MBBJBFEaYKHFZAeV7hQ7DWdu3aZktjzFHCreated 2009.02.02: 1CGT3Ywaa2upJfWtUtbXonDPNTfZPWqzmAEach account had 50 BTC frozen, which were transferred on 2024.09.20.Let me remind you:2009-01-03 - Satoshi Nakamoto generated the first Bitcoin block (received 50 BTC).2009.01.10 - The second to generate a block was the late Hal Finney (received 50 BTC).2009-01-12 - First transaction, Satoshi transferred 10 BTC to Hal Finney.The real Satoshi is Adam Back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}