{
  "id": "topic_5409539",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "August 11, 2022, 09:02:36 PM",
  "content": "De vez em quando comentamos aqui que apesar de o bitcoin e outras criptomoedas não podem ser paradas a forma do governo tentar regular o uso será através das corretorasse liga nessa:EUA lançam onda de investigações contra corretoras de criptomoedasDiferentes agências americanas estão investigando as exchanges Coinbase, Bitfinex e BitmartNada de super novo na história mas sempre bom ficar de olho no que está acontecendo",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409539",
  "comments": [
    {
      "author": "Disruptivas",
      "created_time": "August 11, 2022, 09:44:28 PM",
      "body": "Gente, eu só consigo pensar que os sistemas do governo são tão tão chatos e desatualizados e obsoletos que a única alternativa que serve pra eles SEMPRE é ir atrás do que é válido e vale a pena e funciona e porque funciona dá dinheiro. Mas assim que eles colocam as mãos, já passa a funcionar menor. E é realmente só sobre parasitismo ou como diria o ditado ''Aqui em Minas, o carrapato está maior que a vaca.'''Eu só odeio e tenho raiva de todos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 12, 2022, 11:04:59 PM",
      "body": "A Binance diz que está a ganhar clientes de criptomoedas graças à inflação, mas será também por causa dessa onde de investigação?Visto que a Binance tem uma versão US, podem muito bem motivar os utilizadores de lá a tentarem entrar na plataforma internacional da Binance.Enfim, umas descem outras sobem. Qual vai ser o futuro das exchanges, com cada vez maior regulação e pouco favorável a este mercado?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "August 13, 2022, 12:47:32 AM",
      "body": "Quote from: Lucasgabd on August 11, 2022, 09:02:36 PMDe vez em quando comentamos aqui que apesar de o bitcoin e outras criptomoedas não podem ser paradas a forma do governo tentar regular o uso será através das corretorasse liga nessa:EUA lançam onda de investigações contra corretoras de criptomoedasDiferentes agências americanas estão investigando as exchanges Coinbase, Bitfinex e BitmartNada de super novo na história mas sempre bom ficar de olho no que está acontecendoEu acredito que a intenção do governo não é falir ou fechar arbitrariamente essas exchanges, mas sim abocanhar uma boa fatia dos lucros que essas exchanges grandes conseguem arrecadar, e isso pode ser feito de duas formas:- Aplicando multas pesadas com base em leis arcaicas que difcilmente se aplicam no mundo das criptos, ou;- Exigir a regulamentação e o aumento no recolhimento dos impostos de forma frequente.Até onde sei, nos EUA essas investigações costumam ser bem mais sérias e com penalidades muito mais severas se comparado à morosidade do nosso Brasil, então veremo o quanto isso irá impactar nessas exchanges e também os respingos que irá causar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 14, 2022, 01:00:34 PM",
      "body": "Quote from: alegotardo on August 13, 2022, 12:47:32 AMEu acredito que a intenção do governo não é falir ou fechar arbitrariamente essas exchanges, mas sim abocanhar uma boa fatia dos lucros [...]Até onde sei, nos EUA essas investigações costumam ser bem mais sérias e com penalidades muito mais severas se comparado à morosidade do nosso Brasil, então veremo o quanto isso irá impactar nessas exchanges e também os respingos que irá causar.Isso sem dúvida né, a primeira e a última preocupação dos governos é como eles podem aumentar a arrecadação. Então quaisquer que sejam as atividades ou industrias, sempre que elas estiverem indo vem, haverá pressão de regulação, não importa o que seja. Agora sobre isso da seriedade das penalidades, será que EUA realmente é mais rígido ou tem a haver com o tamanho dos mercados em questão? Até uma curiosidade minha mesmo, não sei se existem estudos disso, sobre quanto a 'criptoeconomia' gira em cada um dos países. Por que Brasil pode ser super lider em adoçao, mas o ticket pode ser baixo por exemplo, de forma que o tamanho do impacto na economia seja até menor do que em paises com menos adoçao. E visto que brasileiros tem um fraco por projetos bem lixo, o impacto pode ainda ser menores do que locais onde há liderança no desenvolvimento de tecnologias correlacionadas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 15, 2022, 07:15:48 AM",
      "body": "Quote from: Disruptivas on August 14, 2022, 01:00:34 PMAgora sobre isso da seriedade das penalidades, será que EUA realmente é mais rígido ou tem a haver com o tamanho dos mercados em questão?Acho que não é uma questão de tamanho, essas penalidades dos EUA.Os EUA dão muito valor ao sistema económico deles, e quando alguém tenta prejudicar esse sistema, a justiça não costuma ser branda. Eles não só levam muito a serio esses processos, como são muito rápidos a resolve-los. Deve ser das poucas coisas que funcionam minimamente bem na justiça americana - crimes económicos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 15, 2022, 06:54:04 PM",
      "body": "Quote from: alegotardo on August 13, 2022, 12:47:32 AMEu acredito que a intenção do governo não é falir ou fechar arbitrariamente essas exchanges, mas sim abocanhar uma boa fatia dos lucros que essas exchanges grandes conseguem arrecadar, e isso pode ser feito de duas formas:- Aplicando multas pesadas com base em leis arcaicas que difcilmente se aplicam no mundo das criptos, ou;- Exigir a regulamentação e o aumento no recolhimento dos impostos de forma frequente.Não só abocanhar o lucro das exchanges, mas os lucros dos usuários das exchanges. Ao forçar as exchanges a reportar tudo, a sonegação diminui.Ao entupir eles de regulamentos e obrigações essas corretoras tb acabam agindo de forma mais previsível, pagam mais impostos e eles acabam também pegando mais gente que usa cripto de forma irregular. InfelImente dificulta também a vida de quem opera cripto dentro da lei, com tanto kyc e documentação exigida pra todo lado.Já falei aqui antes, aqui no brasil vc abre conta num banco c mais facilidade do que numa corretora de bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "August 15, 2022, 08:25:14 PM",
      "body": "O que é interessante é que são essas mesmas corretoras que pedem para o Estado intervir quando são hackeadas. Uma notícia da semana passada: \"PF faz operação contra suspeitos de roubar R$ 6 milhões em bitcoin de corretora americana\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 15, 2022, 10:06:08 PM",
      "body": "Quote from: Paredao on August 15, 2022, 08:25:14 PMO que é interessante é que são essas mesmas corretoras que pedem para o Estado intervir quando são hackeadas. Uma notícia da semana passada: \"PF faz operação contra suspeitos de roubar R$ 6 milhões em bitcoin de corretora americana\". Eu disso faço duas leituras:- São as que dão mais nas vistas, levando a uma ação mais detalhada por parte das autoridades- São as que mexem em mais dinheiro sujo... quem trabalha com dinheiro sujo são as mais prováveis a ter problemas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 16, 2022, 01:20:48 PM",
      "body": "Quote from: Paredao on August 15, 2022, 08:25:14 PMO que é interessante é que são essas mesmas corretoras que pedem para o Estado intervir quando são hackeadas. Uma notícia da semana passada: \"PF faz operação contra suspeitos de roubar R$ 6 milhões em bitcoin de corretora americana\". Ué, mas que opção elas tem?Quando são hackeadas os usuários vão entrar na justiça pedindo os valores que perderam, e a corretora vai ter que ressarcir.Se a PF recuperar é melhor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 16, 2022, 06:51:23 PM",
      "body": "Quote from: bitmover on August 16, 2022, 01:20:48 PMUé, mas que opção elas tem?Quando são hackeadas os usuários vão entrar na justiça pedindo os valores que perderam, e a corretora vai ter que ressarcir.Se a PF recuperar é melhor.Ai entra a questão. Se a corretora se posicionar como vitima... essa questão de ressarcir fica logo diferente.Porque, entram os seguros e afins que irão lidar com isso. Agora, existem seguradoras a darem seguro para corretoras cripto?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 17, 2022, 02:58:58 PM",
      "body": "Quote from: joker_josue on August 16, 2022, 06:51:23 PMQuote from: bitmover on August 16, 2022, 01:20:48 PMUé, mas que opção elas tem?Quando são hackeadas os usuários vão entrar na justiça pedindo os valores que perderam, e a corretora vai ter que ressarcir.Se a PF recuperar é melhor.Ai entra a questão. Se a corretora se posicionar como vitima... essa questão de ressarcir fica logo diferente.Porque, entram os seguros e afins que irão lidar com isso. Agora, existem seguradoras a darem seguro para corretoras cripto?Claro que existe. Isso qe é a Secure Asset Fund for Users (SAFU) da binance.QuoteThe Secure Asset Fund for Users (SAFU) is an emergency insurance fund that was established by Binance in July 2018 to protect users' funds. When the fund was established, Binance committed a percentage of trading fees in order to grow it to a sizable level to safeguard users.The Secure Asset Fund was valued at US$1 billion based on the opening price on January 29, 2022. The value of the fund will fluctuate based on the market. The SAFU fund wallets comprise BNB, BUSD, and BTC. The wallet addresses can be found here and here.https://academy.binance.com/pt/glossary/secure-asset-fund-for-usersBasicamente, eles tem bilhões guardados como seguro em casa de hack e fal. Já foram hackeados e o segurou pagou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 17, 2022, 04:53:03 PM",
      "body": "Quote from: bitmover on August 17, 2022, 02:58:58 PMBasicamente, eles tem bilhões guardados como seguro em casa de hack e fal. Já foram hackeados e o segurou pagou.Ainda bem! Excelente exemplo.Agora, quantos hacks é que a Binance sofreu ao ponto de ter de acionar o seguro? Um?Em contra partida, quantos hacks outras exchanges sofreram?A diferença esta aqui. A Binance tem seguro e um sistema de segurança eficiente que consegue reduzir ao máximo os problemas. Já outras, com observamos neste tópico, estão sempre com problemas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 18, 2022, 02:43:26 AM",
      "body": "Quote from: joker_josue on August 17, 2022, 04:53:03 PMAgora, quantos hacks é que a Binance sofreu ao ponto de ter de acionar o seguro? Um?Em contra partida, quantos hacks outras exchanges sofreram?Esse fundo faz muito bem para o marketing, já que muita gente vai dormir mais tranquila pensando que suas moedas estão à salvo.Eles tem cerca de $186m em BTC + $300m em BUSD + $316m em BNB, de acordo com os endereços publicados. Ou seja, $486m caso nós desconsideremos o BNB (que obviamente vai cair feio em um hack de escala). Não são bilhões. É melhor do que nada, mas um hack do tipo armagedon ainda seria catastrófico.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}