{
  "id": "topic_5417557",
  "title": "mu_enrico",
  "author": "mu_enrico",
  "created_time": "October 18, 2022, 02:59:48 PM",
  "content": "Resesi 2023 adalah isu yang belakangan ini ramai diperbincangkan oleh masyarakat. Ada yang percaya kalau di 2023 dunia akan mengalami resesi, ada yang percaya tidak akan resesi, ada juga yang mengatakan kalau dunia akan resesi tapi Indonesia tidak akan terpengaruh. (wuidih hebat bener )Terlepas dari kepercayaan bahwa resesi akan terjadi atau tidak, berbagai sumber sudah mulai merancang berbagai strategi untuk berjaga-jaga, salah satu strategi yang penting adalah rebalancing portfolio, dari aset yang high-risk menjadi low-risk. Aset yang high-risk akan mengalami rekt tajam ketika terjadi resesi, sehingga kalau agan memiliki proporsi aset high-risk yang tinggi, agan juga bakal ikutan rekt. Ketika banyak artikel seperti ini, seolah-olah kita sedang di-FUD oleh media mainstream, sehingga bisa saja yang tadinya resesi hanya suatu prediksi, namun menjadi kenyataan ketika cukup banyak orang memercayainya. Ingat \"self-fulfiling prophecy!\"Bitcoin adalah aset yang high-risk dan berkorelasi positif terhadap pasar saham, terutama IHSG yang telah ane buktikan pada bahasan (Statistik) BTC vs S&P 500 vs IHSG. Hal ini menjadi menarik karena akan ada peluang diskon gila-gilaan ketika benar di 2023 terjadi resesi, dengan asumsi segala sesuatunya sesuai dengan \"teori\" di atas. Ketika agan sudah melakukan rebalancing portfolio sehingga memiliki cukup banyak cash, agan dengan mudah dapat menyerok BTC ketika bottom.Akhir kata ingat bahwa tidak ada prediksi yang 100% benar (nanti malah kek prediksi PlanX). Bitcoin belum pernah melalui resesi (kalau beneran terjadi), jadi belum dapat kita pastikan pergerakan harganya. Namun indikasi kalau kripto rekt lebih dalam dari pasar saham sudah ada seperti pada periode awal heboh Covid-19.Disclaimer: bukan saran finansial (NFA), DYOR & DWYORAda rencana nyerok? Ataukah agan malah optimis hodl?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417557",
  "comments": [
    {
      "author": "masulum",
      "created_time": "October 18, 2022, 03:19:19 PM",
      "body": "Kalau resesi benar terjadi, saya sepakat dengan mas akan berpotensi lebih dalem koreksinya, pasalnya bitcoin saat ini tidak hanya di hold oleh trader tetapi banyak instansi yang menyimpan BTC, yang mungkin saja akan menyelamatkan aset secepat mungkin ketika meliha pasar saham ambruk. karena kayaknya tak banyak perusahaan yang akan benar-benar mempertahankan BTC mereka ketika resesi terjadi.saya juga khawatir dengan kepercayaan diri Bukele terhadap BTC, akankah tetap terjaga jika mengalami down di bawah 15K atau akan memilih mundur dari kursi presiden  Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?Optimis narik tiap minggu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "October 19, 2022, 12:12:59 AM",
      "body": "Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?Kata orang pinter mending nyimpen emas, karena emas itu sudah lama tahan banting sejak zaman purba. Akan tetapi, ada banyak anggapan bahwa bitcoin itu sudah seperti emas, saya juga beranggapan gitu sebenarnya, karena dari penerawangan (dukun), saya sudah mau hampir 7 tahun berkecimpung di bitcoin ini sudah cukup yakin kalau nyimpan bitcoin tetap aman di kala resesi, mengapa?, ya saya lihat di kala perekonomian tidak menentu di covid-19 kemaren, banyak yang lebih pesimis dari pada resesi yang akan datang, padahal saat itu di zona halving, dimana akan puncak bullrun, jadi di tahun depan itu merupakan penjajakan ke zona halving berikutnya juga, mungkin saja harga down kayak maret 2020 lalu, tapi kan mantulnya mantap. jadi saya pikir, situasi akan sama seperti periode lalu, bisa jadi tidak akan separah covid kemaren jika rusia tidak pakai nuklir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 19, 2022, 02:57:39 AM",
      "body": "Quote from: mu_enrico on October 18, 2022, 02:59:48 PMResesi 2023 adalah isu yang belakangan ini ramai diperbincangkan oleh masyarakat. Ada yang percaya kalau di 2023 dunia akan mengalami resesi, ada yang percaya tidak akan resesi, ada juga yang mengatakan kalau dunia akan resesi tapi Indonesia tidak akan terpengaruh. (wuidih hebat bener )Hahah dulu saya juga sempet bilang mirip kek gini ke covid19 (dalam hati saya bilang covid ini kayaknya gak bakal masuk indonesia) eh ternyata masuk juga. mungkin resesi juga seperti itu walaupun saya berharap tidak terjadi karena inflasi aja mungkin dampaknya udah luar biasa Quote from: masulum on October 18, 2022, 03:19:19 PMsaya juga khawatir dengan kepercayaan diri Bukele terhadap BTC, akankah tetap terjaga jika mengalami down di bawah 15K atau akan memilih mundur dari kursi presiden  Pak Bukele ini saya dengar dia mau mencalonkan lagi mas malahan hehehe https://www.aljazeera.com/news/2022/9/16/el-salvadors-bukele-says-he-will-seek-re-election-despite-ban tapi pasti akan kena hujat jika bitcoin dibawah harga 15K dulu aja waktu bitcoin jadi legal tender ada kericuhan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "October 19, 2022, 06:26:24 PM",
      "body": "Quote from: DroomieChikito on October 19, 2022, 12:12:59 AMKata orang pinter mending nyimpen emas, karena emas itu sudah lama tahan banting sejak zaman purba. Akan tetapi, ada banyak anggapan bahwa bitcoin itu sudah seperti emas, saya juga beranggapan gitu sebenarnya, karena dari penerawangan (dukun), saya sudah mau hampir 7 tahun berkecimpung di bitcoin ini sudah cukup yakin kalau nyimpan bitcoin tetap aman di kala resesi, Tapi jangan lupa volatilitas, meskipun trend harganya terus naik dalam jangka panjang, dalam jangka pendek ada kemungkinan BTC koreksi dalam. Nah inilah yang sedang kita prediksi, kan kalau betul prediksinya cuan dari serok di bawah bakal lebih besar dari hodl.Btw betul kalau emas termasuk stabil akan tetapi strategi konversi ke cash itu bukan mencari stabilitas, tapi peluang untuk masuk nyerok.Quote from: dansus021 on October 19, 2022, 02:57:39 AMmungkin resesi juga seperti itu walaupun saya berharap tidak terjadi karena inflasi aja mungkin dampaknya udah luar biasa Justru ketika kondisi porak poranda, yang bakalan cuan gede itu yang punya duit buat masuk beli aset-aset yang kena diskon, hanya masalahnya:1. Ada duit ngga2. Berani ngga wkwkwMungkin cocok buat Ulum yg ballsnya gede wkwkw",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "October 20, 2022, 05:30:30 PM",
      "body": "Quote from: dansus021 on October 19, 2022, 02:57:39 AMPak Bukele ini saya dengar dia mau mencalonkan lagi mas malahan hehehe https://www.aljazeera.com/news/2022/9/16/el-salvadors-bukele-says-he-will-seek-re-election-despite-ban tapi pasti akan kena hujat jika bitcoin dibawah harga 15K dulu aja waktu bitcoin jadi legal tender ada kericuhanKalau BTC semakin dalam koreksinya karena resesi benar-benar terjadi, saya tidak yakin akan mendapatkan banyak dukungan. Karena ini bisa menjadi kesempatan bagi pihak lawan untuk mengambinghitamkan keputusannya dalam membeli BTC. Kita tahu, saat ini El Salvador sedang kesulitan ekonomi dan sulit untuk berkembang karena terlilit hutang, ditambah aset mengalami penyusutan valuasi, ini pasti akan mudah untuk membuat bukele ditinggalkan karena black campaign yang mempermasalahkan pembelian BTC. Jika resesi terjadi, kesulitan keuangan dapat meningkat. jika hal tersebut juga dialami oleh El Salvador, mungkin mereka kesulitan untuk mendapatkan pinjaman dari bank dunia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 20, 2022, 05:55:18 PM",
      "body": "Quote from: mu_enrico on October 18, 2022, 02:59:48 PMResesi 2023 adalah isu yang belakangan ini ramai diperbincangkan oleh masyarakat. Ada yang percaya kalau di 2023 dunia akan mengalami resesi, ada yang percaya tidak akan resesi, ada juga yang mengatakan kalau dunia akan resesi tapi Indonesia tidak akan terpengaruh. (wuidih hebat bener )...sumber:melihat berita di atas membuat saya berpikir bahwa jika resessi global terjadi maka indonesia bakal sulit untuk terhindar, namun saya yakin dampaknya pada indonesia tidak akan sebesar ketika awal pandemik lalu karena masih banyak negara2 yang memiliki ketergantungan pada produk indonesia.Quote from: masulum on October 18, 2022, 03:19:19 PMQuote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?Optimis narik tiap minggu  mas masulum nerima murid kagak, umlam ilmu nya donk  kalo saya udah pasti tiarap dulu, heheheQuote from: dansus021 on October 19, 2022, 02:57:39 AMQuote from: masulum on October 18, 2022, 03:19:19 PMsaya juga khawatir dengan kepercayaan diri Bukele terhadap BTC, akankah tetap terjaga jika mengalami down di bawah 15K atau akan memilih mundur dari kursi presiden  Pak Bukele ini saya dengar dia mau mencalonkan lagi mas malahan hehehe https://www.aljazeera.com/news/2022/9/16/el-salvadors-bukele-says-he-will-seek-re-election-despite-ban tapi pasti akan kena hujat jika bitcoin dibawah harga 15K dulu aja waktu bitcoin jadi legal tender ada kericuhanQuoteAdapun Bukele membagikan data mengenai perkembangan negaranya setelah menjadikan Bitcoin sebagai alat pembayaran sah. Pada 2021, PDB El Salvador naik 10,3 persen, pendapatan dari pariwisata naik 52 persen, lapangan kerja naik 7 persen, bisnis baru naik 12 persen, ekspor naik 17 persen, pembangkit energi naik 19 persen, ekspor energi naik 3,291 persen, dan pendapatan internal naik naik 37 persen, semuanya tanpa menaikkan pajak. Bukele juga menyoroti tingkat kejahatan dan pembunuhan di El Salvador pada 2022 telah turun hingga 95 persen.sumber:bukele sepertinya sudah mempersiapkan jawabannya ketika ada black campaign yang bertujuan menyerang dia muncul. saya salut dengan keyakiannnya pada Bitcoin, mengenai apakah ketika resesi terjadi mereka bakal di kasih pinjaman uang sepertinya itu bakal sulit karena US masih berupaya membuat bukele menarik kembali keputusannya menjadikan bitcoin legal tender, kita sendiri tahu bahwa bank dunia dan IMF masih agak di kendalikan US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "October 21, 2022, 12:30:14 PM",
      "body": "Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAkhir kata ingat bahwa tidak ada prediksi yang 100% benar (nanti malah kek prediksi PlanX). Bitcoin belum pernah melalui resesi (kalau beneran terjadi), jadi belum dapat kita pastikan pergerakan harganya. Namun indikasi kalau kripto rekt lebih dalam dari pasar saham sudah ada seperti pada periode awal heboh Covid-19.Tetap optimis tapi sebenarnya ini yang membuat saya sedikit khawatir (waspada)juga dengan kekuatan periode Halving. Yang biasanya diikuti periode bullis dan membawa harga kembali mencapai ATH baru. Karena keadaan ekonomi pada periode sebelum nya itu ekonomi tidak seburuk kalau terjadi resesi seperti yang akan di prediksi. Itu juga pernah saya coba up di Thread [DISKUSI] Harga Bitcoin, diskusi sama om @DroomieChikito dan logikanya juga masuk akal saya pikir. Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?Yang pasti Hold om,  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhooscream",
      "created_time": "October 21, 2022, 11:39:04 PM",
      "body": "Quote from: mu_enrico on October 18, 2022, 02:59:48 PMBitcoin belum pernah melalui resesi (kalau beneran terjadi), jadi belum dapat kita pastikan pergerakan harganya. Namun indikasi kalau kripto rekt lebih dalam dari pasar saham sudah ada seperti pada periode awal heboh Covid-19.Kalau dari definisinya resesi itu sederhananya adalah kondisi perekonomian yang memburuk. Nah, bukannya dari dulu ekonomi dunia sudah memburuk ya?Jadi bisa diartikan selama ini BTC sudah melalui fase-fase di mana perekonomian dunia kacau balau. Termasuk ketika perekonomian hancur karena dampak Covid-19.Mengenai crypto rekt pas jaman saham anjlok, itu cuman di awal-awal saja. Selanjutnya malah orang-orang saham rame-rame pindah ke crypto. Hasilnya malah harga-harga koin crypto signifikan naiknya karena banyaknya demand yang datang dari stock user atau ex-stock user. Bisa jadi isu resesi ini malah membuat orang-orang untuk berinvestasi ke BTC yang pada dasarnya tahan banting dengan isu-isu buruk yang ada.Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?Nyerok pake apa, gan?  Kalau resesi, duid makin tipis padahal aset masih nyangkut. Bukannya nyerok, malah adanya jual rugi.Quote from: masulum on October 18, 2022, 03:19:19 PMsaya juga khawatir dengan kepercayaan diri Bukele terhadap BTC, akankah tetap terjaga jika mengalami down di bawah 15K atau akan memilih mundur dari kursi presiden  Bahaya kalau Bukele mundur gegara gagal invest BTC. Bisa-bisa harga BTC terjun bebas balik lagi ke bawah $10k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "October 23, 2022, 04:26:49 AM",
      "body": "Quote from: mu_enrico on October 19, 2022, 06:26:24 PMQuote from: DroomieChikito on October 19, 2022, 12:12:59 AMKata orang pinter mending nyimpen emas, karena emas itu sudah lama tahan banting sejak zaman purba. Akan tetapi, ada banyak anggapan bahwa bitcoin itu sudah seperti emas, saya juga beranggapan gitu sebenarnya, karena dari penerawangan (dukun), saya sudah mau hampir 7 tahun berkecimpung di bitcoin ini sudah cukup yakin kalau nyimpan bitcoin tetap aman di kala resesi, Tapi jangan lupa volatilitas, meskipun trend harganya terus naik dalam jangka panjang, dalam jangka pendek ada kemungkinan BTC koreksi dalam. Nah inilah yang sedang kita prediksi, kan kalau betul prediksinya cuan dari serok di bawah bakal lebih besar dari hodl.Kalau bicara jangka pendek, khususnya di tahun 2023 saja, mungkin sebaiknya (*disklaimer - bukan saran), segeralah menjual emas atau aset simpanan lainnya, karena tentunya volatilitas bitcoin lebih menjanjikan dari pada emas. Profitnya tentu lebih \"wah\", apa lagi kalau belinya BTC di 1/2 harga dari sekarang. Tapi, tetap ada resiko di tiap instrumen apa pun jenisnya, memang resiko nyimpan emas itu kecil, tapi hasilnya juga akan sama dengan resiko, begitu juga sebaliknya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "October 23, 2022, 07:49:30 AM",
      "body": "Sepertinya akan lebih baik untuk melihat situasi dulu daripada bertindak gegabah. Kalaupun tahun 2023 resesi dimulai dan terjadi keruntuhan pasar di mana-mana, saya kira bitcoin pasti akan kena dampaknya. Kalau rakyat yang kena dampaknya, boro-boro mereka mikir mau investasi ke bitcoin, mereka lebih mending mengutamakan bahan pokok dulu baru ngeliat apa masih ada persediaan uang untuk investasi atau ngga. Tapi sepertinya untuk kebanyakan orang di Indonesia lebih memilih bahan pokok dulu dibanding investasi.Tapi untuk yang sudah mengenal bitcoin, pasti mereka akan menyediakan uang yang lebih, entah itu jual apa dulu biar ada stok uang sekalian mengamankan uang untuk membeli kebutuhan pokok.Tapi mau resesi atau ngga, kita tunggu saja sambil menikmati garis naik dan turunnya harga bitcoin di Binance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 23, 2022, 01:00:19 PM",
      "body": "Baiknya anggap aja rumor ini akan benar-benar terjadi, itung-itung buat belajar kritis tentang money management. Seperti biasa, saat resesi global dianggap reset session dimana banyak kemungkinan perubahan tingkat ekonomi (wealth transfer). Ini menjadi kesempatan mencari strategi yang pas untuk membangun keuangan yang lebih baik. Siapa tau diantara kita adalah OKB berikutnya. Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?Hodl aja gan ato DCA pake income dari forum.Buat kebutuhan harian ya cari usaha sampingan di dunia nyata, mumpung masih ada 2 bulan lagi sebelum rumor tahun resesi dimulai. Dan bukan berarti resesi akan seketika terjadi saat masuk januari juga, mungkin aja Q2 ato Q3.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "indah rezqi",
      "created_time": "October 23, 2022, 05:58:40 PM",
      "body": "Quote from: noorman0 on October 23, 2022, 01:00:19 PMHodl aja gan ato DCA pake income dari forum.Aset yang sudah ada di hold, sementara income dari campaign bisa diakumulasikan om jika bayarannya dalam bitcoin.Saya setuju dengan saran diatas karena sejauh ini saya mulai merencanakan hold jangka panjang untuk bitcoin. Terlepas dari isu resesi yang mungkin akan terjadi ditahun depan atau kapanpun itu, maka saya memilih untuk konsisten tentang rencana ini.Rugi atau untuk dalam jangka panjang itu sudah pasti, tapi selama bitcoin di dompet tetap aman maka saya pikir nilainya akan tetap berfluktuasi mengikuti tren pasar. Semoga ada hal yang bagus ditahun-tahun mendatang tentang bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "October 24, 2022, 02:31:46 AM",
      "body": "Quote from: noorman0 on October 23, 2022, 01:00:19 PMSeperti biasa, saat resesi global dianggap reset session dimana banyak kemungkinan perubahan tingkat ekonomi (wealth transfer). Ini menjadi kesempatan mencari strategi yang pas untuk membangun keuangan yang lebih baik. Siapa tau diantara kita adalah OKB berikutnya. Iya kalau punya uang, kalau tidak, hidup akan sama seperti sebelum krisis. jadi, OKB-nya juga bukan karena krisis tapi, karena nyerok. Dulu di tahun 1998 dan 2008 ketika krisis terjadi dan saham di Indonesia (IHSG) banyak yang rontok dari 700 (tahun 97) ke 50 (tahun 98), kala itu beberapa investor yang jeli (yg belum kaya tapi masih sempat nyimpen cash) nyerok. Dan, baru jadi OKB 10 tahun berikutnya, tapi ada yang kembali miskin ketika 2008, karena tidak melihat tanda-tanda krisis.Quote from: indah rezqi on October 23, 2022, 05:58:40 PMtapi selama bitcoin di dompet tetap aman maka saya pikir nilainya akan tetap berfluktuasi mengikuti tren pasar. Nilai bitcoin tidak akan berfluktuasi jika berpikir 1 btc= 1 btc karena selama ini kan masyarakat selalu meng-compare-nya dengan fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "October 24, 2022, 04:35:06 AM",
      "body": "Kalau memang benar-benar terjadi resesi seperti yang diisukan di atas, kemungkinan apa yang menjadi keperluan pokok dulu yang diutamakan, termasuk jika pilihannya terpaksa harus menjual aset BTC yang ada saat nilainya drop. Kecuali kalau memang yang pokok sudah aman, dan ada kelebihan dana untuk 'nyerok' disaat ada 'diskon harga' karena resesi seperti itu. Hal ini bisa jadi peluang, karena dari yang sudah-sudah, nilai tukar BTC bisa saja naik lagi pasca halving berikutnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "October 24, 2022, 12:05:35 PM",
      "body": "Quote from: bhooscream on October 21, 2022, 11:39:04 PMKalau dari definisinya resesi itu sederhananya adalah kondisi perekonomian yang memburuk. Nah, bukannya dari dulu ekonomi dunia sudah memburuk ya?Jadi bisa diartikan selama ini BTC sudah melalui fase-fase di mana perekonomian dunia kacau balau. Termasuk ketika perekonomian hancur karena dampak Covid-19.Kalau dilihat dari GDP growth, resesi itu terjadi ketika growthnya negatif. Misalnya dari data worldbank, Indonesia resesi di tahun 1998:-13.1% dan 2020:-2.1%.Akan tetapi di 2020 ekonomi cepat sekali pulih di 2021, istilahnya mau boker udah keluar dikit, terus ditahan, nah di 2023 ditakutkan beneran plong ga bisa nahan lagi, jadi rektnya lebih dalam lagi. Ada juga yang memprediksi resesi kali ini akan menjadi yang terparah sepanjang sejarah, tapi masa depan siapa yang tahu Quote from: bhooscream on October 21, 2022, 11:39:04 PMNyerok pake apa, gan?  Makanya kan ane bilang ada syaratnyaQuote from: mu_enrico on October 19, 2022, 06:26:24 PM1. Ada duit ngga2. Berani ngga wkwkwBuat yang berencana nyerok, itu juga bakal serem kek waktu rektnya UST. Yang korban LUNA jilid 1 lebih tepatnya. Momen kek gini keliatannya aja bisa diprediksi tapi nanti pas kejadian serem bos. Mungkin tidak perlu masuk spekulasi, tapi menghindari nyangkut. Kek saat ini mulai rebalancing dulu sedikit...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "October 24, 2022, 05:41:19 PM",
      "body": "Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?Kalau saya pribadi tergantung situasi keuangan om dan saya memilih untuk mengkondisikan dulu daripada sekarang bilangnya nyerok tapi ujungnya jual. LolYang pertama tetap tentang kebutuhan dasar yang perlu dipenuhi, dan kemudian baru memikirkan tentang peluang investasi. Jika yang pertama sudah aman, maka saya mungkin akan memikirkan bagaimana caranya supaya uang yang ada itu berguna dan dimanfaatkan untuk menghasilkan keuntungan. Tidak hanya tentang crypto atau bitcoin, saya pikir beberapa pilihan investasi lain juga bagus untuk tujuan investasi kan?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "October 25, 2022, 01:29:18 AM",
      "body": "Quote from: skarais on October 24, 2022, 05:41:19 PMsaya pikir beberapa pilihan investasi lain juga bagus untuk tujuan investasi kan?Kalau untuk Investasi, apa pun kejadian di tahun depan baik itu resesi atau ekonomi ambruk sekalipun tidak berdampak apa-apa karena prediksi resesi di tahun 2023 itu untuk Jangka pendek, sedangkan Investasi adalah bisnis untuk jangka panjang (range 10-20 tahunan). Tentu beda lagi pengamatan antara trader dan Investor, Trader lebih kepada analisa teknikal, sedangkan Investor pada Fundamental sehingga peluang untuk nimbun sama, cuma beda di waktu narik keuntungannya. Tentu kalau untuk investasi, Coin yang fundamental yang paling patenlah yang paling diburu, coin yang sudah bertahan di atas 10 tahun dan kebal pada 1 kejadian besar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "October 25, 2022, 11:12:00 PM",
      "body": "Quote from: noorman0 on October 23, 2022, 01:00:19 PMBaiknya anggap aja rumor ini akan benar-benar terjadi, itung-itung buat belajar kritis tentang money management. Seperti biasa, saat resesi global dianggap reset session dimana banyak kemungkinan perubahan tingkat ekonomi (wealth transfer). Ini menjadi kesempatan mencari strategi yang pas untuk membangun keuangan yang lebih baik.Setuju. Anggap saja ini sebagai momentum untuk menata ulang manajemen keuangan. Walaupun mungkin dampaknya nanti tidak sebesar yang dibayangkan, setidaknya kita sudah siap dengan kemungkinan situasi terburuk. Jangan sampai nanti resesi beneran terjadi, kita sampai panik karena tidak ada persiapan dari dini.Saya pribadi pun tidak tau berita terkait resesi ini valid atau tidak, meskipun sudah banyak tayangan atau beritanya di sosial media atau TV. Namun yang pasti, kondisi perekonomian di negara kita jelas memburuk ditandai dengan naiknya BBM. Naiknya BBM memicu naiknya semua barang-barang kebutuhan pokok, jadi saat ini pun sudah terlihat bahwa harus ada perubahan manajemen keuangan kita.Lebih kurang ada beberapa hal yang mungkin bisa dipertimbangkan:- Prioritaskan kebutuhan pokok- Kurangi pengeluaran untuk hal-hal yang tidak urgent- Perbanyak aset yang punya potensi bagus di masa resesi. Misalnya: Emas, BTC.- Tingkatkan alokasi tabungan- Kurangi aset yang terlalu spekulatif- Banyak-banyak sodakoh (katanya bisa membuka pintu rejeki).IMOQuote from: noorman0 on October 23, 2022, 01:00:19 PMSiapa tau diantara kita adalah OKB berikutnya. OKB apa Om? Orang Kaya Baru atau Orang Kurang Beruntung?  Quote from: mu_enrico on October 18, 2022, 02:59:48 PMAda rencana nyerok? Ataukah agan malah optimis hodl?HODL itu pasti, tapi nyerok pilihan (tergantung sikon).Misalnya ada uang, pasti nyerok kalau diskon dibawah $15k. Karena saya yakin tetap ada bullish setelah halving BTC 2024.BTW, bro kenapa gak beli emas dulu sekarang?Dengar-dengar ada potensi naik di 2023. Keuntungannya kan bisa buat beli BTC.  - https://www.liputan6.com/bisnis/read/5098860/dibayangi-resesi-harga-emas-bakal-melambung-di-2023- https://www.bareksa.com/berita/emas/2022-10-24/pejabat-bank-sentral-as-beda-pendapat-buat-harga-emas-hari-ini-melesatDWYOR/DYOR ya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antonas1",
      "created_time": "October 26, 2022, 12:49:09 PMLast edit: October 26, 2022, 01:43:58 PM by Antonas1",
      "body": "Saya kira Indonesia tetap akan merasakan efeknya di beberapa sektor, meskipun data BPS dan juga Kemenkeu mengklaim pertumbuhan ekonomi di Indonesia pada kuartal II tahun 2022 mengalami peningkatan sebesar 5,4 persen. Menurut mereka itu merupakan pertanda yang bagus ditengah labilnya kondisi ekonomi global. Sumber:- Siaran Pers: Pertumbuhan Ekonomi Triwulan II 2022 Menguat Signifikan di Tengah Ketidakpastian dan Tren Perlambatan Global- Ekonomi Indonesia Triwulan II-2022 Tumbuh 5,44 Persen (y-on-y)Resesi kayak lingkaran setan, sektor industri dihajar, imbasnya perusahaan mengurangi beban dengan PHK, pengangguran berlimpah, daya beli melemah sementara harga kebutuhan naik membuncah, produsen barang dan jasa supaya bisa bertahan harus bersaing harga dan ngurangin beban produksi, balik lagi ke PHK, gitu aja terus.Tapi saya tidak berpikir ini akan memberikan efek yang besar pada Bitcoin, karena di tiap negara masih ada:1. Lapisan masyarakat yang memang masih tetap kaya dan aman untuk membeli aset apapun termasuk Bitcoin.2. Lapisan masyarakat non pegawai yang terkena efek hanya sedikit saja dan masih bisa berinvestasi pada Bitcoin.3. Lapisan masyarakat yang berpikir Bitcoin adalah solusi keuangan untuk mereka.4. Lapisan masyarakat dari sektor pertanian dan pertambangan (terutama di kawasan Asia Tenggara) yang juga berinvestasi dalam Bitcoin.Apalagi jika melihat grafik rainbow Bitcoin yang terlihat kayak udah masuk masa Buy:*Bukan saran untuk melakukan aksi, selalu DYOR & DWYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}