{
  "id": "topic_5524297",
  "title": "angarlo",
  "author": "angarlo",
  "created_time": "December 26, 2024, 03:19:41 PM",
  "content": "Here’s a concept I want to start talking about and propagating:Salaries don’t work well to express economic power over time. Best approaches to measure this in the past have been in the form of converting to dollars or comparing against an arbitrary basket of goods. This is inaccurate and doesn’t reflect the dilution of purchasing power over time.Enter SALISatoshi Annual Labor Index (SALI)Pronounced: \"Sally\"1. IntroductionToday’s financial system measures salaries in fiat currencies—dollars, euros, pesos, etc.—that can lose purchasing power over time due to inflation and money printing. Many people see their “real” wages stagnate or decline even if the nominal number on their paycheck rises.SALI (Satoshi Annual Labor Index) offers a simple way to measure the true value of your labor each year by indexing your salary to Bitcoin—a hard, non-dilutive asset with a fixed supply of 21 million coins. SALI helps you see if your real purchasing power is going up or down, without complicated financial jargon.2. What Is SALI?SALI is an annual measure of how many satoshis (the smallest unit of Bitcoin) your yearly salary equates to.Think of SALI as a “personal CPI” that tracks whether your labor is gaining or losing real value over time. Unlike traditional fiat-based metrics, which can be distorted by inflation and exchange rate fluctuations, a personal CPI tied to Bitcoin offers a more stable and universal measure of value. Bitcoin’s fixed supply and global accessibility make it an ideal benchmark for evaluating the true purchasing power of your labor.Why the Name?Satoshi: Bitcoin’s smallest unit (1 BTC = 100,000,000 satoshis).Annual: SALI is recalculated yearly to show clear trends.Labor: Focused on wages or salary.Index: Like a personal CPI but measuring labor value against Bitcoin.3. Why Satoshis as a Benchmark for Economic Power?Historically, there hasn’t been an accurate or universal benchmark to measure purchasing power or economic power across time and regions. Satoshis now make this possible by offering a precise, globally consistent metric tied to Bitcoin—a scarce and non-dilutive asset. Unlike larger units like BTC, satoshis are practical for tracking wages at all income levels, ensuring stability and relevance as Bitcoin’s adoption grows and its price rises.4. SALI FormulaSALI Formula:SALI = (Yearly Salary ÷ Bitcoin Price) × 100,000,000Example:Yearly salary: $50,000Average BTC price: $75,000SALI = ($50,000 ÷ $75,000) × 100,000,000 = 66,666,667 satoshis/yearIf Bitcoin’s avg price doubles to $150,000:SALI = ($50,000 ÷ $150,000) × 100,000,000 = 33,333,333 satoshis/yearThis shows a 50% drop in the real value of your labor when measured in Bitcoin.5. Why SALI MattersReveals Inflation’s Impact:SALI highlights if your labor’s purchasing power is eroding, even if your nominal salary increases.Borderless Comparison:SALI works across countries, free from exchange rate fluctuations, and tracks value trends year over year.Encourages Saving in Hard Assets:A declining SALI shows the potential benefit of saving in Bitcoin or other non-dilutive assets to preserve value.Simplicity:SALI gives a single, relatable metric: “How many satoshis can I earn in a year?”6. How to Use SALIPick a Year: Choose a snapshot date (e.g., Jan 1) or an annual avg for salary & Bitcoin price.Calculate SALI: Use the SALI formula.Compare Over Time: Plot yearly SALI on a chart to see trends.Make Informed Decisions: Adjust financial strategies (e.g., negotiate a raise or save in Bitcoin) if SALI trends down.7. Key ConsiderationsBitcoin Volatility: Price swings matter less over yearly averages.Salary Fluctuations: For freelancers or contractors, use realistic and consistent annual earnings.Macro Changes: Economic factors affect both fiat salaries & Bitcoin prices.Adoption & Understanding: Regular tracking makes SALI a valuable personal CPI.8. ConclusionSALI (Satoshi Annual Labor Index), or “Sally,” is a clear yearly measure of your labor’s purchasing power in Bitcoin. By tracking SALI, you can see if your salary is gaining or losing value in the face of inflation and fiat currency depreciation.Key Takeaways:Track SALI annually to reveal wage erosion or progress.Use SALI to compare purchasing power across years or borders.Consider storing value in non-dilutive assets like Bitcoin.Next Steps:Calculate your SALI: Divide your salary by Bitcoin’s avg price, then multiply by 100M.Track it yearly.Use the data to negotiate wages or explore saving in Bitcoin.SALI is your personal scorecard for understanding and protecting the real value of your labor.Feedback is welcomed!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5524297",
  "comments": [
    {
      "author": "hd49728",
      "created_time": "December 26, 2024, 03:29:58 PM",
      "body": "I would do it simple, focus on my work, job and get as highest salary then savings as possible. After that, I can use my savings after deduct emergency fund, to invest in Bitcoin.It's DCA Investment in Bitcoin, and I don't care about this complicated index.\"Satoshi per dollar, how much is it?\" is enough for me.https://charts.bitbo.io/satoshi-per-dollar/I can not change the fiat currency inflation, but I can change myself and increase my salary, that helps me to accumulate more bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "December 26, 2024, 03:34:52 PM",
      "body": "I assume by comparing against an arbitrary basket of goods, you're computing CPI, which is a measure of inflation as well. I think CPI does make sense in computing the relative purchasing power over time and you're able to compare it against your base salary and see if the salary moves in tandem with it.Bitcoin is far too unstable for it to be used in an index over a long period of time, because it can move either direction which makes it difficult for us to ascertain the exact impact of your loss/gain of purchasing power. It'd be quite a pointless metric since purchases are meant to be made in fiat, which is why CPI works for the most cases. In addition, you're still exposed to exchange rates differences when computing for the metrics because you're not paid in Bitcoins.Your proposal likely would represent the purchasing power of Bitcoin with your salary, since you're using Bitcoin as an index without considering the real costs.CPI works well because it can be generalized. You cannot generalize a unit of labour, information gap, skills gap, etc, makes for a huge part of salary differential/progression. This makes it hard to generalize across to draw any meaningful conclusion; I may be working in an MNC, while another guy may be working in a smaller firm. My progression is better though I do less work, then my SALI is higher than his though by logic, we should be similar. Personal CPI doesn't make too much of a difference either, you would want to just adjust it to a base year for inflation if that's the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angarlo",
      "created_time": "December 26, 2024, 04:00:43 PM",
      "body": "I’m not computing CPI in the equation. Inflation is expressed within the price of Bitcoin itself for simplicity.I agree RIGHT NOW Bitcoin is too high vol measure for any meaningful salary negotiation. This rather is a proposal for regular folks to start expressing their salary on a bitcoin standard without a low unit bias and without having to make the jump into BTC right away.It’s a trojan horse for normies to think in sats.The intent for this is to become a “Personal CPI” of how many sats your salary gets you annually.Being originally from Mexico, I recall measuring my salary in pesos against the dollar. And while better, it’s equally flawed. CPI also can get easily manipulated by changing the goods it measures. I think Bitcoin and its scarcity is the obvious way to introduce a normie-metric for folks to see their loss of purchasing power expressed in future money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "December 26, 2024, 04:29:55 PM",
      "body": "This is a good concept. Labour is one of the most fundamental variables in terms of how the economy is calculated. Unfortunately our current economic system focuses too much on capital. Labour is always going to be required for any good to be ready for consumption and definitely for all services. The only way the labour intensity for production and services can change are advances in technology. However worker's interests fall last in the chain of profits for the big capital. If crypto could be tied to a labour unit it would be introducing a new and very interesting aspect to the economy. Currently, just as a replacement to capital, it has run a course that showed we aren't bound for a revolution just by that. What if we even replace the federal reserve with a crypto standard. Then what? There are still gonna be wars and a war industry, a government of the rich will likely still continue rulling etc. More is needed to change the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 27, 2024, 12:36:36 AM",
      "body": "Quote from: angarlo on December 26, 2024, 03:19:41 PMToday’s financial system measures salaries in fiat currencies—dollars, euros, pesos, etc.—that can lose purchasing power over time due to inflation and money printing. Many people see their “real” wages stagnate or decline even if the nominal number on their paycheck rises.SALI (Satoshi Annual Labor Index) offers a simple way to measure the true value of your labor each year by indexing your salary to BitcoinUnlike traditional fiat-based metrics, which can be distorted by inflation and exchange rate fluctuations, a personal CPI tied to Bitcoin offers a more stable and universal measure of value. Bitcoin’s fixed supply and global accessibility make it an ideal benchmark for evaluating the true purchasing power of your labor.Historically, there hasn’t been an accurate or universal benchmark to measure purchasing power or economic power across time and regions. Reveals Inflation’s Impact:SALI highlights if your labor’s purchasing power is eroding, even if your nominal salary increases.8. ConclusionSALI (Satoshi Annual Labor Index), or “Sally,” is a clear yearly measure of your labor’s purchasing power in Bitcoin. By tracking SALI, you can see if your salary is gaining or losing value in the face of inflation and fiat currency depreciation.Key Takeaways:Track SALI annually to reveal wage erosion or progress.Calculate your SALI: Divide your salary by Bitcoin’s avg price, then multiply by 100M.you keep mentioning that its a simple way to display how your labour wage(fiat) is eroding purchasing power by inflationhowever..a 'sali' does not reveal how much fiat inflation erodes purchasing power..... because bitcoins own deflationary rate impacts the ratio of $:sat toofor instance if fiat suggests that $100 can buy 100 tincans of soda in january and december 2024you would think that this would mean the sats would be the same,yet $1:0.00001 december 2024$1:0.00004 january 2024so even though fiat inflation was flat. bitcoins measure went 4x.. so the measure becomes useless of a way to show fiat inflation eroding purchase power..oh and by the way.. although it has a 4x growth this year due to halving and as we start to enter the bull to ATH.... guess what happened if we measured next summer and then the following summer, during the correction post-ATHso while you want to at some point exaggerate fiats 2-10% inflation to be a 400% loss due to bitcoin growth.. if you took the tip of the ATH next year and then done the bottom of the correct there after you would see a stat that works against your objectivetake for instance, imagine bitcoin hitting a $250k ATHmeaning $1:0.000004 but then it corrects down to say $125k/btcmeaning0.000004:$0.50so now someone getting $100k a year income loses half of it, which is far worse than fiats 2-10%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "December 27, 2024, 01:40:09 AM",
      "body": "Quote from: angarlo on December 26, 2024, 04:00:43 PMI’m not computing CPI in the equation. Inflation is expressed within the price of Bitcoin itself for simplicity.Oh that statement was made when you said rate of change in salary adjusted for inflation, which is equivalent to rate of change in salary adjusted for rate of change in CPI, is not a good representation of change in purchasing power.Quote from: angarlo on December 26, 2024, 04:00:43 PMI agree RIGHT NOW Bitcoin is too high vol measure for any meaningful salary negotiation. This rather is a proposal for regular folks to start expressing their salary on a bitcoin standard without a low unit bias and without having to make the jump into BTC right away.It’s a trojan horse for normies to think in sats.The intent for this is to become a “Personal CPI” of how many sats your salary gets you annually.Then this is an index solely to determine how much salary you've earned relative to Bitcoin, but it is not representative of purchasing power or any macroeconomic factors. Bitcoin is speculative by nature and any metrics you're using cannot be compared or used as an argument. Similarly, a better alternative would be to compare it to precious metals, which holds similar characteristics and trends to Bitcoin but without having the regular large fluctuation in price. Quote from: angarlo on December 26, 2024, 04:00:43 PMBeing originally from Mexico, I recall measuring my salary in pesos against the dollar. And while better, it’s equally flawed. CPI also can get easily manipulated by changing the goods it measures. I think Bitcoin and its scarcity is the obvious way to introduce a normie-metric for folks to see their loss of purchasing power expressed in future money.Methodology of CPI is not changed from year on year and is thus not easily manipulated. Generally, it is kept consistent and the weightage is also the same throughout the years. You should be measuring the rate of change of your salary as compared to inflation. If your salary outpaces inflation, then you're doing well, else you're not.There are certainly drawbacks to CPI but they're still commonly used because it is the best representation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angarlo",
      "created_time": "December 27, 2024, 05:54:48 PM",
      "body": "Thank you all for the thoughtful and diverse feedback—it’s exactly the kind of dialogue I hoped SALI would spark. Let me address a few key points raised:SALI’s Purpose: SALI isn’t trying to replace CPI or claim to be a perfect measure of purchasing power. It’s a personal index meant to show how your salary stacks up against a fixed, non-dilutive asset like Bitcoin. The goal is to shift the conversation and encourage people to think beyond fiat, not to replace established metrics like CPI.Bitcoin Volatility: I fully agree—Bitcoin’s volatility makes SALI unsuitable for salary negotiations or daily financial planning right now. But SALI’s value lies in the long-term perspective it introduces. As Bitcoin matures and volatility potentially stabilizes, the index becomes even more relevant.CPI vs. Bitcoin: CPI is a useful tool, and I’m not dismissing it. But it isn’t without flaws—substitution bias and exclusions can mask the true impact of inflation. SALI complements CPI by offering a fresh perspective tied to an asset immune to dilution. It’s not a replacement but a way to think differently about the erosion of value over time.Deflation and Distortion: Bitcoin’s deflationary nature is a feature, not a bug. SALI isn’t about exaggerating fiat inflation—it’s about showing how a scarce, globally accessible asset contrasts with a system where purchasing power often erodes unnoticed. Yes, Bitcoin’s growth can make comparisons tricky in the short term, but over time, it highlights the broader trend of fiat depreciation.At its core, SALI is about encouraging people to think in sats—tracking their earnings relative to a scarce, fixed-supply asset.Think about it. We work and that work worth ECONOMIC ENERGY. Today, there's no measurement allowing us to represent how much such energy is preserved, why? There has been no global asset with a fixed supply like Bitcoin. I believe this can be a trojen horse for regular folks not giving a damn about bitcoin actually seeing on an index, over time, how their economic energy keeps getting diluted versus bitcoin. It's the way for folks to start thinking in Sats.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}