{
  "id": "topic_5399138",
  "title": "MrDave",
  "author": "MrDave",
  "created_time": "May 18, 2022, 07:15:48 AM",
  "content": "Can anyone explain how to analyze a project so that one can escape from getting scammed?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399138",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "May 18, 2022, 07:36:31 AM",
      "body": "The best is to stay away from new projects, there are still some good altcoins in the first 100 rank that you can invest on, but know generally that altcoins are risky just like luna that was in the first 15 rank that is not in first 100 in just few days. New projects are more risk. Go to Coinmarketcap and check the contract address of the new project Follow the developers like on social media, question them and know what the project is all about. This is one of the most important part, read the white paper, check for plagiarism, if plagiarised, it is a scam. Even a new project can become pump and dump. New projects are highly risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "May 18, 2022, 07:56:14 AM",
      "body": "The daily change makes me feel like scams are also sophisticated and there are many ways in which we remain blind to them. Some of the things that I've been through in this space have left me with some choices that I think are safe for me but may not be suitable for others. BTC is the only option, and the rest is just that. Watch them, but the trial plays with more risk. These new projects these days have a lot of ways to deceive us from the team, plans, funds,... things that are not easily verified and people look at the profits they built up to believe in them. They feel very familiar with very large scams when they create a whole system process and link them together. It is very easy for people who believe in such things to fall into the trap. The greed for money makes it difficult for us to keep the profits we once enjoyed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Farma",
      "created_time": "May 18, 2022, 08:08:41 AM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?The only way to know if it's a scam or not is to do some research. all aspects need to be examined, not just one day, but we need to do a gradual check, and endlessly find out about the development of the project.however, you can't tell if a project is scam or not just in a few times of research. it is very difficult to detect, because if it is a centralized system, then it can happen anytime. the point is that there will be an opening for them to show that. whether it's fraud, rugpull, and others. besides that you will understand the quality of a project when you continue to do research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "diminizio",
      "created_time": "May 18, 2022, 08:12:49 AM",
      "body": "There is no. We can only indicate it's a scam but nothing is 100% true. Even if it's right, it's not necessarily the next prediction that will work, because cryptocurrencies really work in mystery. At least you can predict with accuracy up to 80% is enough to get trust for the project, the rest is how you dare to make a decision to invest here, because the risk is high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "May 18, 2022, 09:06:21 AM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?It's hard to say that because there are many things that must be analyzed to make sure if the project will be a scam or not. It's started from you need to analyze the wallet that owned by the developers. Sometime when the project will become a scam started by the owner was doing soft rug pull by dumping more and more tokens to the market. I meant when you are seeing it carefully and the developers are silently spreading their minted tokens to the various wallets to be dumped to the buyers. There are also developer who blatantly saying they are rugpulling the users",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jaered",
      "created_time": "May 18, 2022, 09:15:45 AM",
      "body": "I always tell people that social media is one of the best things to happen to crypto. Especially crypto twitter. It's a good indication to check it. Also check the social media handles of the particular project. Scam projects always have a lull in their presence. Also always look out for dev/ team presence and service. Sometimes too the explainer vids are bot voiced. That shows scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drumamat",
      "created_time": "May 18, 2022, 10:10:26 AM",
      "body": "The main indicator is the source of information from where you learned about the project. I am sure the community is very active in all respects. Therefore, it is better to discuss the project collectively and make a decision accordingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "May 18, 2022, 10:30:00 AM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?First of all i would say that you should never ever click on any link that someone is sending to you on telegram. I have seen a lot of such posts going around lately and all of those are scams. Most of the times those scammers are waiting to the day when a big project that people are waiting for gets listed on pancakeswap or sushiswap and then they create their own scam token and a pool on the swap and they spam the telegram groups and even DM thousands of users that the project is live now and can be bought. So never ever click on links that someone sent you in a DM in telegram.Also always check the team of a project, the roadmap and the backers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "May 18, 2022, 12:40:37 PM",
      "body": "There's no clear indicator about how to detect the scam project, when the developers were doing shady thing and community was starting to realize it and it will become the best time to go out from the project. you have need to know the history of developers, whether the project has some cases of plagiarization or not, and many more. You can try to take a look at the scam accusation sections. When the developers were doing one or two shady things and this can be a sign if the project will turn to be another scam project as soon as possible. Avoid to invest in a high risk project when you don't wanna be scammed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypto-project",
      "created_time": "May 18, 2022, 01:11:33 PM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?It will be very difficult to detect a scam project, because now there are many potential projects with clear roadmaps and whitepapers, but still scams. Even tokens ranked at 100 CMC are pretty much a scam. The point is when investing in crypto projects we are prepared that our money will be lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 18, 2022, 01:15:36 PM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?It's really hard to analyse in the beginning, nevertheless you may want to look at:1. the people behind the project, do they have real names or maybe some of them have some shady past.2. what the project can offer, maybe it is unique, then maybe they will want to succeed and not to scam3. to good to be true promises4. websites, it is done professionally? or it may seem that their website by put up by a 5 year oldThat's just a few on top of my head right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "May 18, 2022, 01:22:00 PM",
      "body": "You can't always tell them. Some are obvious but some are good enough to hide it. One good example is what I saw in the news about students using the face of their teachers as the team behind the project. It looks real but they are caught in the end. They still managed to fool a lot of investors because they made millions of dollars in their ICO. If you are trying to avoid scams then just focus on investing in projects that have roots. They may be expensive but you are paying not to be a millionaire in a rush but for the assurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spiker777",
      "created_time": "May 18, 2022, 01:23:11 PM",
      "body": "There are some step which should be followed to avoid scam project1: whitepaperAlways check Project Whitepaper and use Pilgrism software and sites. Most of scam Project steal idea from other top projects and they have not own idea.2: Team:Scam project used fake team picture you can Google it to see if they download from any LinkedIn profile.3: always check investor and backer. Most of scam project have no backer and investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdzahed134",
      "created_time": "May 18, 2022, 02:03:33 PM",
      "body": "Quote from: crypto-project on May 18, 2022, 01:11:33 PMQuote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?It will be very difficult to detect a scam project, because now there are many potential projects with clear roadmaps and whitepapers, but still scams. Even tokens ranked at 100 CMC are pretty much a scam. The point is when investing in crypto projects we are prepared that our money will be lost.Right, there are no way to detect 100% SCAM project because i've experienced a several projects which was looks fundamentally strong and professional team but team was greedy. I don’t believe all of those projects even which is top 100 ranked in the Coinmarketcap. First of all we have to some own researches to detect SCAM project, team is most important, most of the time SCAM projects team using fake profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "May 18, 2022, 02:19:22 PM",
      "body": "There are some projects you can't know they are scam until they become scam. To avoid scam projects entirely, you should only to buy btc, then eth, bnb and maybe a few other top alts projects on cmc. Another suggestion is to join any reputable exchange launchpad (if your desire is to invest in new projects) reason why is, these popular exchanges did the background check for any new project they are launching, yours is to invest. However, it doesn't give 100% guarantee that such projects won't disappoint in the future. You should always understand the risk of crypto investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "May 18, 2022, 02:26:37 PM",
      "body": "50 : 50Very unpredictable. Sometimes from a good roadmap and whitepaper, developers are convincing, but after getting funds from an ICO or other fund-raising method, they suddenly disappear and take investors' money. There are also those who are successful and provide huge profits for investors and project coin holders/traders.Of course there are clear benchmarks for us to choose a project with an investment objective, including developers and founders who have clear origins and have the capability and effort, then a clear and firm roadmap and whitepaper in each milestone, has the potential for large adoption, is unique, useful and able to be applied in the real world as a breakthrough, reasonable, utility, having cooperation with other well-known or relevant institutions that can be proven true.More or less that, but still some of these points can not be a benchmark for the success of a new project. Be careful, invest with money that you are willing to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "May 18, 2022, 02:58:20 PM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed? Escaping from getting scammed is a general topic, but thinking specifically for a project that uses altcoins, there are many factors to think about.There is also the dichotomy of scams vs failures. Both end up with the same outcome for the investors.Is the project a niche one or mainstream one - if it is the second one it will fail for sure.Copied whitepapers, placeholder images for team members - immediate red flag signs.Then there are those who use Advisor images of legitimate linkedin personnel but they are never actually involved - check on linkedin yourself to know how much they are involved in the project.Overall this is a broad topic to discuss, it is better to learn from the stuff that gets reported in the \"Scam Accusations\" section and see how they are uncovering them. Even then this is the tip of the iceberg, majority of the scams dont get reported.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "May 18, 2022, 03:36:49 PM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?Hey Dave, that's not easy. They can be hiding it at a better way than other legitimate projects who have better goals. I have been in this kind of position before when I ask myself on how I could surface whatever their evil intent is, but you may not even see it unless you know someone behind it. They are getting better at making whitepapers, a fake team, a fake project and so on. I am victim in short.   So I learned. Don't force your way into buying cheap coins because they look to have promising future. Go easy and take the clean route with known crypto's like BTC and ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "May 18, 2022, 04:00:31 PM",
      "body": "Quote from: MrDave on May 18, 2022, 07:15:48 AMCan anyone explain how to analyze a project so that one can escape from getting scammed?There is no universal solution! Scams happen all the time, from those pretty stupid and naive to very complex scam schemes! In order to be able to recognize fraud, you must first know something about it, read about it, and research... we who have been in the crypto for a long time have seen everything, and with that experience, we check some projects from all angles, if there's something suspicious we just stay away!So how one can escape from getting scammed is to be careful and not get trapped! They can't scam you if they don't pull you into their story and you give them some money!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}