{
  "id": "topic_5467640",
  "title": "jvanname",
  "author": "jvanname",
  "created_time": "September 21, 2023, 08:17:58 PM",
  "content": "I have been the only entity advocating for all bio-safety level 4 laboratories to implement a specific bio-safety protocol. This bio-safety protocol is needed to ensure that if the BSL-4 lab leaks a pathogen, the investigators will be able to actually investigate without worrying that the BSL-4 laboratory is hiding something. And if the BSL-4 laboratory is lacking in other information security measures, then this information security protocol will Now I am not advocating for this information security protocol anymore. Why is that? Was I wrong? No. I was not wrong. BSL-4 labs still need to follow this protocol. I have simply been exacerbated by all the chlurcmks who are absolutely everywhere who have such sick minds that they erupt in unceasing hatred whenever I mention anything sensible. These chlurmcks are pro-death. They just want people to die in the next pandemic. And the worst part is that these chlurmcks hate the idea that I would be compensated in any way for advocating for a protocol that could prevent pandemics. Well, if you do not like that I would like to be compensated in any way for helping to prevent pandemics, then I guess you just want to all f@#$ing die in another pandemic. I will not impede your wishes. I will not advocate for bio-safety any more. If you want me to change my mind, pay me (figure out how to pay me yourself, b@#$%).In the next pandemic, there will be just as much economic destruction, death, lockdowns, masks, misery, and hatred against one another. And in the next pandemic, the vaccine will be in the ass and not the arm. And in the next pandemic, you will deserve all the suffering that you get.-Joseph Van Name Ph.D.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467640",
  "comments": [
    {
      "author": "wallet4bitcoin",
      "created_time": "November 15, 2023, 01:52:25 AM",
      "body": "I will advice you not to stop the sensitization that you have started, the difficulty in what you are doing is that you might be playing against the 'big wigs' with affluence and your voice can only go but a little far, they on the other hand control mega institutions that will do their biding at the sight of few 'green backs'.One of the motivations you should have is family, if your voice can save even one member of your family, its  a big win for you and posterity will not hold you responsible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "November 26, 2023, 01:09:14 AM",
      "body": "Quote from: jvanname on September 21, 2023, 08:17:58 PMAnd in the next pandemic, the vaccine will be in the ass and not the arm. Interesting. I have to think though that people would resist a vaccine like that even more than they did the one in the arm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "November 26, 2023, 09:54:18 AMLast edit: November 26, 2023, 01:04:41 PM by jvanname",
      "body": "No. People are just going to take it in the ass like the bitches that they are. In fact, the next vaccine will be in the ass as a marketing scheme. The vaccine makers know that humans are all a bunch of bitches who love being humiliated and enslaved (they do not care that biological laboratories do not follow proper safety protocols; they would rather suffer another pandemic than think), so these vaccine makers will capitalize on the desire than humans have to be enbitched. With a vaccine injected straight into the gluteus maximus, I predict that 99.9999% of all people will faithfully get their Covid-26 vaccine (2 doses) along with a booster every 6 months. Never underestimate a human's ability to obey like an obedient pet bitch.THE TRUTH ABOUT BITCHES: Do you see those pet bitches on leashes? They are spayed, so they are not even legitimate bitches, but I am still going to call them bitches. Those bitches were originally wolves. But then humans took them and selectively bred as many genetic anomalies into them as possible. This is why bulldogs have noses that as squashed so far into their faces that their noses come out their assholes, into their mouthes, out their assholes again, and up their noses. Pet bitches are obedient and happy because they have a genetic anomaly that in humans is called Williams–Beuren syndrome. In humans, Williams–Beuren syndrome makes the humans that have this anomaly dumb and happy.Don't be a bitch. Don't be obedient. Don't just take a vaccine in the ass. Don't accept your own death without any questions.Oh? Do you think that you won't just accept another pandemic released by a lab even though you just accepted Covid-19 without questions?What about when they used to add lead to gasoline? That lead went into everyone's brains and @#$%ed them up badly. Why do you think the boomers are they way they are? It is not just age. It is brain damage. The appropriate response to such a disaster would be for every single lawyer on Earth to sue all oil companies and automobile manufacturers. All of the car companies should have gone out of existence when they banned lead from vehicles in order to tell such corporations not to do so much @#$%ed up shit. And that never happened. At least they banned lead from gasoline.-Joseph Van Name Ph.D.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "December 30, 2023, 12:28:03 AM",
      "body": "The Immune System does not work if you hide before germs. Its the other way round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "December 30, 2023, 04:37:34 PM",
      "body": "Quote from: WillyAp on December 30, 2023, 12:28:03 AMThe Immune System does not work if you hide before germs. Its the other way round. If there were no germs, there would not be any need for an immune system now would there?  But I agree that those 2020 lockdowns were stupid. It would have been smart if biological laboratories exercised enough bio-safety so that we could rule out a lab leak as the origin of Sars-Cov-2, but this did not happen because people lack the intelligence to exercise proper bio-safety, so we had lockdowns instead. -Joseph Van Name Ph.D.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "December 30, 2023, 11:53:59 PM",
      "body": "Our body is full of bacteria workling with us. Germs are all around us, and the biggest issue humankind has is to let go of their loved ones. Spartans had that right. For real numbers I think the 1920 flu was harder than covid still is. Covid still is among us as the vaccine does not deserve that name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "December 31, 2023, 12:37:48 AM",
      "body": "I don't agree that the lockdowns were stupid.  They were needed to try and slow down the virus so hospitals didn't get overwhelmed. For sure they weren't perfect and made some crappy things happen.  But at the time, felt like lockdowns were our best shot.  With the biosafety stuff, yeah theres always gonna be risks when dealing with sketchy germs and whatnot.  but we can't just throw our hands up and be like screw it let people get sick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "December 31, 2023, 01:58:19 PM",
      "body": "People need to perform a much better cost/benefit analysis for preventing the next pandemic. It costs a lot of resources to lock down Earth (and the benefits have been questioned; going outside and getting exercise is healthy). It costs barely anything to make sure that biological laboratories are safe. But the desire that humans has to be enbitched and refuse to think causes them to want to lock down Earth and get the vaccine in the @$$.Oh. And Pfizer will start to market @$$ vaccines by telling people that an arm bruise caused by the vaccine will be unsightly, so they should get their vaccine in a place that is usually covered. When we get Covid-26, a lot of people will be pulling down their pants in public at KFC for the vaccine.-Joseph Van Name Ph.D. (Mathematics, and yes, this is relevant)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "December 31, 2023, 02:53:42 PM",
      "body": "Quote from: Marvelman on December 31, 2023, 12:37:48 AMI don't agree that the lockdowns were stupid.  They were needed to try and slow down the virus so hospitals didn't get overwhelmed.Hospitals get overwhelmed due to people believing that hospitals provide miracles. Earlier we went to churches for that.Quote from: jvanname on December 31, 2023, 01:58:19 PMPeople need to perform a much better cost/benefit analysis for preventing the next pandemic.Pandemics cannot be avoided. Disease is part of the natural selection prozess. We can prepare better by eating better, going out and walk, do a little sport and such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "December 31, 2023, 06:36:32 PMLast edit: December 31, 2023, 08:03:08 PM by jvanname",
      "body": "Quote from: WillyAp on December 31, 2023, 02:53:42 PMQuote from: jvanname on December 31, 2023, 01:58:19 PMPeople need to perform a much better cost/benefit analysis for preventing the next pandemic.Pandemics cannot be avoided. Disease is part of the natural selection prozess. We can prepare better by eating better, going out and walk, do a little sport and such. I agree that people need to eat better and stop being such disgusting fat piles of lard. And the hypothesis that pandemics are unavoidable is a reasonable hypothesis. Now that you have established a reasonable hypothesis, you will need to provide a source of evidence of your hypothesis.Quote from: wallet4bitcoin on November 15, 2023, 01:52:25 AMI will advice you not to stop the sensitization that you have started, the difficulty in what you are doing is that you might be playing against the 'big wigs' with affluence and your voice can only go but a little far, they on the other hand control mega institutions that will do their biding at the sight of few 'green backs'.One of the motivations you should have is family, if your voice can save even one member of your family, its  a big win for you and posterity will not hold you responsibleDo you think that trying to prevent a pandemic is something that I should do for free? If you do, then my only response to that is to not give a s#$%. Preventing a pandemic should be HIGHLY REWARDED. And I hope you know that preventing a pandemic will be EXPENSIVE and difficult. Of course, making a good effort at preventing a pandemic will be far easier than dealing with the pandemic itself, but I am not going to put in the work without any pay when there are many people here who have nothing but HATE and MALICE.My family is actually a demotivation. My family members consist of people who are obese, smoke, eat s@#$, don't exercise, and who are very angry sociopaths. If anything, my family is just another reason why I should not give a s@#$. My brother is one of my more reasonable family members, but he is not talking to me anymore. And they did not pay me s@#$ to prevent any pandemic, so I don't give a @#$%.Happy New Years-Joseph Van Name Ph.D.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "December 31, 2023, 08:36:02 PM",
      "body": "Quote from: jvanname on December 31, 2023, 06:36:32 PMAnd the hypothesis that pandemics are unavoidable is a reasonable hypothesis.Well humans from the beginning of time were victims of diseases.That in itself should be a fact rather than a hypothesis, disease is nature's selection process.Thus it cannot be avoided to fall ill, the laziness of us humans make pandemic more susceptible, we rather look for a Dr. then seeing that we eat crap and convert into crap by eating useless materials. Already today hospitals turn into spreader locations. Nature has waited too long or humans have learned too well to avoid catastrophes  Common sense is my tool to look for reasons. I also believe that we only have seen little. https://www.scmp.com/news/china/article/1573511/shenzhen-company-develops-kit-test-ebola-virus-report-says  The Chinese are always a step ahead. once a virus mixes with another .....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "December 31, 2023, 08:56:45 PM",
      "body": "Quote from: WillyAp on December 31, 2023, 08:36:02 PMQuote from: jvanname on December 31, 2023, 06:36:32 PMAnd the hypothesis that pandemics are unavoidable is a reasonable hypothesis.Well humans from the beginning of time were victims of diseases.That in itself should be a fact rather than a hypothesis, disease is nature's selection process.Thus it cannot be avoided to fall ill, the laziness of us humans make pandemic more susceptible, we rather look for a Dr. then seeing that we eat crap and convert into crap by eating useless materials. Already today hospitals turn into spreader locations. Nature has waited too long or humans have learned too well to avoid catastrophes  Common sense is my tool to look for reasons. I also believe that we only have seen little. https://www.scmp.com/news/china/article/1573511/shenzhen-company-develops-kit-test-ebola-virus-report-says  The Chinese are always a step ahead. once a virus mixes with another ..... Those are great hypotheses. And I totally agree that we eat crap and that it will be very healthy for us to eat a little bit less crap and that our lifestyle is quite unhealthy. But there are still two incompatible hypotheses for the origin of covid-19. Either it was engineered from some other virus (probably a bat virus) in the laboratory so that it can infect humans or it has arisen naturally and biological laboratories have nothing to do with its origin. You should now use the scientific method to make a conclusion one way or the other. And if we cannot use the scientific method to make such a conclusion, then we need to improve our biological laboratories worldwide so that such a question can be answered.Happy New Years-Joseph Van Name Ph.D.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "January 01, 2024, 02:05:00 PM",
      "body": "Quote from: jvanname on December 31, 2023, 08:56:45 PM Either it was engineered from some other virus (probably a bat virus) in the laboratory so that it can infect humans or it has arisen naturally and biological laboratories have nothing to do with its origin.Happy new year to you too,) Well I don't think that by finding out how the virus came into existence has an effect on the outcome. I believe that people engineering a virus as a weapon would not take a flu virus as starters. They would go with ebola or the nipah virus.Yeah I know the current tenor of the mainstream media is that the flu has killed more people than Ebola. But who would you rather talk to face to face? A person with the flu or with the Nipah Virus.Nipah made its way from Malaysia China towards India. The bats move also through climate changes. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8005932/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "January 01, 2024, 02:15:26 PM",
      "body": "Quote from: WillyAp on January 01, 2024, 02:05:00 PMQuote from: jvanname on December 31, 2023, 08:56:45 PM Either it was engineered from some other virus (probably a bat virus) in the laboratory so that it can infect humans or it has arisen naturally and biological laboratories have nothing to do with its origin.Happy new year to you too,) Well I don't think that by finding out how the virus came into existence has an effect on the outcome. I believe that people engineering a virus as a weapon would not take a flu virus as starters. They would go with ebola or the nipah virus.Yeah I know the current tenor of the mainstream media is that the flu has killed more people than Ebola. But who would you rather talk to face to face? A person with the flu or with the Nipah Virus.Nipah made its way from Malaysia China towards India. The bats move also through climate changes. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8005932/In order to make a conclusion as to what virus the virologists will tinker with, one has to have a clear understanding of the motivation of the virologists. Were the virologists even trying to cause as much harm to humanity as possible? Was the leak accidental or intentional? If it were accidental, then the virologists could have been working with any virus. And the prospect of a version of Nipah with both a high mortality rate and infectivity rate for humans is something that we need to be as secure as possible against. Stating that biological laboratories would not work with coronaviruses simply because there are viruses with a higher mortality rate is not evidence that Sars-Cov-2 originated naturally in the wild.Happy New Years,-Joseph Van Name Ph.D.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "January 01, 2024, 02:22:37 PM",
      "body": "Quote from: jvanname on January 01, 2024, 02:15:26 PMStating that biological laboratories would not work with coronaviruses simply because there are viruses with a higher mortality rate is not evidence that Sars-Cov-2 originated naturally in the wild.so is the assessment of the virus being created. A lab living of testing blood samples is sufficient nowadays to kick in the social media logic. Journalist living off the input from twitter, now x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "January 01, 2024, 02:50:26 PM",
      "body": "Quote from: WillyAp on January 01, 2024, 02:22:37 PMQuote from: jvanname on January 01, 2024, 02:15:26 PMStating that biological laboratories would not work with coronaviruses simply because there are viruses with a higher mortality rate is not evidence that Sars-Cov-2 originated naturally in the wild.so is the assessment of the virus being created. A lab living of testing blood samples is sufficient nowadays to kick in the social media logic. Journalist living off the input from twitter, now x.  That is not evidence of a natural origin of Sars-Cov-2. You should try using the scientific method to produce evidence of your claims. I want for biological laboratories to be more secure so that we can more easily use the scientific method to evaluate claims of the origin of viruses. Or maybe I don't anymore because I am tired of the attitudes of angry hateful people who do not care about their own deaths. There is no excuse for this. We are 4 years into Covid-19, and nearly all people still have not learned some basic lessons in bio-safety, and it is going to cost them dearly.Happy New Years,-Joseph Van Name Ph.D.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "January 01, 2024, 06:35:03 PM",
      "body": "Quote from: jvanname on January 01, 2024, 02:50:26 PMThat is not evidence of a natural origin of Sars-Cov-2.I accept the report printed by nature:QuoteSARS-CoV-like coronavirus. As noted above, the RBD of SARS-CoV-2 is optimized for binding to human ACE2 with an efficient solution different from those previously predicted7,11. Furthermore, if genetic manipulation had been performed, one of the several reverse-genetic systems available for betacoronaviruses would probably have been used19. However, the genetic data irrefutably show that SARS-CoV-2 is not derived from any previously used virus backbone20. Instead, we propose two scenarios that can plausibly explain the origin of SARS-CoV-2: (i) natural selection in an animal host before zoonotic transfer; and (ii) natural selection in humans following zoonotic transfer.Read the entire piece here:https://www.nature.com/articles/S41591-020-0820-9The speed the disease spread was quite astonishing.Me and my wife had a covid like phase about 6 weeks before it was \"discovered\" or broke out in China. We live just off the Venezuelan coast.  A heavy flu, with all the symptoms covid is known for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "January 01, 2024, 11:45:01 PM",
      "body": "Quote from: WillyAp on January 01, 2024, 06:35:03 PMQuote from: jvanname on January 01, 2024, 02:50:26 PMThat is not evidence of a natural origin of Sars-Cov-2.I accept the report printed by nature:QuoteSARS-CoV-like coronavirus. As noted above, the RBD of SARS-CoV-2 is optimized for binding to human ACE2 with an efficient solution different from those previously predicted7,11. Furthermore, if genetic manipulation had been performed, one of the several reverse-genetic systems available for betacoronaviruses would probably have been used19. However, the genetic data irrefutably show that SARS-CoV-2 is not derived from any previously used virus backbone20. Instead, we propose two scenarios that can plausibly explain the origin of SARS-CoV-2: (i) natural selection in an animal host before zoonotic transfer; and (ii) natural selection in humans following zoonotic transfer.Read the entire piece here:https://www.nature.com/articles/S41591-020-0820-9The speed the disease spread was quite astonishing.Me and my wife had a covid like phase about 6 weeks before it was \"discovered\" or broke out in China. We live just off the Venezuelan coast.  A heavy flu, with all the symptoms covid is known for. Sorry. Universities promote violence. Universities are extremely unprofessional. They have promoted violence against me. You should not trust anything that anyone in academia has to say unless it has been out for about 10 years because they are @#$%ing liars. Just look at the studies on reproducibility of 'scientific' studies. Most 'scientific' studies are not reproducible, so you should not believe them unless you have a really good reason to do so. I have heard of that proximal origins paper that you have cited for a long time and it has been thoroughly debunked. Here is the reasoning of the people who were writing that paper.Kristian G. Andersen-F@#$.Anthony Fauci-F@#$.Kristian G. Andersen-F@#$ing s@#$.Some other doctor-Holy f@#$ing s@#$.Doctor-So I am like 50 percent confident that this coronavirus that is f@#$ing s@#$ up came from a lab.Doctor 2-Me too. F@#$ing s@#$.Doctor Fauci-So what are we gunna do bout this?Doctor 2-I know what to do. We will write a paper in Nature defending the natural origin hypothesis. And everyone will gobble that paper up without any questions whatsoever because they hate science. And we will call anyone who believes that 2019-NCov came from a lab a stupid moron and a s@#$face.Doctor 3-Yeah?Doctor-Well, I heard that Joseph Van Name will not gobble up our bullshit. He is a mathematician who questions everything and who is solving the problem of reversible computation which will bring about dangerous AI systems. But he has a solution to the problem of dangerous AI that he is developing from his cryptocurrency research. He will demand that biological laboratories be secure. But pretty much everyone else will gobble up anything that we print in Nature. Nobody is going to listen to Joseph Van Name because humans are f@#$ing stupid.Kristian G. Andersen-That settles it. Sars-Cov-2 did not come from a lab because if people suspect that it came from a lab, then we are f@#$ed. Haha. What a bunch of morons. They will buy anything, and they will accept their own deaths without question. I hate them.Watch this video about the unredacted e-mails that lead up to that f@#$ing proximal origins paper.https://www.youtube.com/watch?v=Gc9YHBXad5oHmm. That gives me an idea. Maybe I should ban anyone who has a paper accepted into Nature from contributing to the open source project that I am working on.Happy New Years,-Joseph Van Name Ph.D.P.S. The director of the FBI in about March of 2023 stated that Covid-19 likely came from a lab. Do you not think that the director of the FBI had access to the proximal origins paper?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "January 04, 2024, 03:55:39 AM",
      "body": "Quote from: jvanname on January 01, 2024, 02:50:26 PMThat is not evidence of a natural origin of Sars-Cov-2. You should try using the scientific method to produce evidence of your claims. I want for biological laboratories to be more secure so that we can more easily use the scientific method to evaluate claims of the origin of viruses. So lets say a laboratory was going to work with a very contagious virus and it broke out inside the lab and infected some of the workers. Do you think they should try and lock them inside the lab and let the whole thing play out rather than risk letting the virus escape out into the general population? If it was a really dangerous contagion then I think the answer is clear. You can't just let something like that get the chance to get outside the lab.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}