{
  "id": "topic_5466063",
  "title": "DenisReach",
  "author": "DenisReach",
  "created_time": "September 07, 2023, 10:41:37 PMLast edit: September 07, 2023, 10:59:32 PM by DenisReach",
  "content": "Есть упакованные несколько игр   p2eНужна команда для реализацииНедвижимость и магия: Реальность и Легенды:Описание: В этой игре на блокчейне игроки вступают в мир магии, волшебства и недвижимости. Игра сочетает в себе элементы симулятора строительства и RPG. Игроки начинают с небольшого участка земли в фэнтезийном мире и должны развивать его, строить магические сооружения, исследовать загадочные леса и сражаться с монстрами.Заработок: Игроки могут зарабатывать токены магии (MAGIC), выполняя задания, сражаясь с боссами и создавая магические предметы, которые можно продавать на внутриигровом рынке. Недвижимость также может приносить доход в зависимости от развития и привлечения других игроков.Коллекционирование: В игре есть разнообразные волшебные существа, артефакты и заклинания, представленные в виде NFT, которые игроки могут коллекционировать, обменивать и продавать.Соревнование: Игроки могут участвовать в турнирах, сражаясь за титулы легендарных волшебников и право управления частями виртуального мира.Эта игра предоставляет игрокам возможность объединить в себе интересы владения виртуальной недвижимостью, коллекционирования NFT и участия в увлекательных приключениях в мире магии и фэнтези.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466063",
  "comments": [
    {
      "author": "BVeyron",
      "created_time": "September 08, 2023, 09:29:16 AM",
      "body": "Quote from: DenisReach on September 07, 2023, 10:41:37 PMЕсть упакованные несколько игр   p2eНужна команда для реализацииНедвижимость и магия: Реальность и Легенды:Как я понимаю р2е вообще все переживают совсем не лучшие, а можно сказать даже очень плохие времена. Это все уже в прошлом да и то в основном в регионе юго-восточной Азии, где видимо прожить можно было на всякие мелкие деньги от этих развлечений. Я думаю что это теперь в принципе дело дохлое и вряд ли кому то здесь на форуме это вообще интересно.Уж я не знаю как у вас с белой бумагой или бизнес планом все ли там в порядке или вы просто  прикалываетесь над нами",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "September 08, 2023, 11:04:01 AM",
      "body": "Quote from: BVeyron on September 08, 2023, 09:29:16 AMКак я понимаю р2е вообще все переживают совсем не лучшиеДа, наверное только  Axie Infinity более менее держится на плаву, остальные же болтаются где-то по низу рынка/активности.На Gods Unchained и Axie неплохо в общем-то заработали, и без лютого абуза. DenisReach, что конкретно Вы подразумеваете под упакованной игрой? Что конкретно требуется от исполнителя? Есть ли бюджет, или готовы расплачиваться только фантиками?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artifex",
      "created_time": "September 14, 2023, 11:16:29 AM",
      "body": "АВТОР, НАПИШИ В ЛИЧКУ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hepokid",
      "created_time": "September 15, 2023, 11:04:57 AM",
      "body": "Если есть бюджет на разработку, то пишите в тг uuxte",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "surovichenko",
      "created_time": "January 19, 2024, 08:53:33 AM",
      "body": "Актуально еще, автор?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}