{
  "id": "topic_5407597",
  "title": "ed valdis",
  "author": "ed valdis",
  "created_time": "July 25, 2022, 05:02:50 PMLast edit: September 02, 2022, 03:17:06 PM by ed valdis",
  "content": ".json parser onlinehttp://json.parser.online.fr/ ...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407597",
  "comments": [
    {
      "author": "Edwardard",
      "created_time": "July 25, 2022, 05:38:17 PM",
      "body": "Quote from: ed valdis on July 25, 2022, 05:02:50 PMHello.I have 156 bitcoins for sale. Exchange for tether(USDT), etherum or other crypto altcoins.Price is 15300$ for one btc. IF you want more than 10 btc - the price will be wholesale (10-12K).PM or let me know when interested.Could you also specify the reason for selling it so cheaper than the current market rates? Also this is your first post and you are talking about lots of btc ,hope you dont end up scamming any innocent one!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 25, 2022, 05:54:05 PM",
      "body": "Quote from: Edwardard on July 25, 2022, 05:38:17 PMCould you also specify the reason for selling it so cheaper than the current market rates? Also this is your first post and you are talking about lots of btc ,hope you dont end up scamming any innocent one!Probably a scam attempt. Better for everyone to avoid this scam attempt or coin that has been used for illegally activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 25, 2022, 07:18:13 PM",
      "body": "Everyone here understands that there is no such thing as a generous offer, where the discount on the bitcoin price is almost 50% of its market price. There's a reason for that. What is the point of such a discount? Most often such bitcoins can be involved in some criminal scheme or lying on the wallets of some service that won't pass any AML check. But if the bitcoins aren't exactly clean, why not use some bitcoin mixer or something? Where did such a ride of unprecedented generosity come from, no sane person would go for such an offer for sure, because the feeling that it could be some kind of fraud is too great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "July 25, 2022, 10:10:17 PM",
      "body": "Quote from: Desmong on July 25, 2022, 08:59:22 PMQuote from: ed valdis on July 25, 2022, 05:02:50 PMHello.I have 156 bitcoins for sale. Exchange for tether(USDT), etherum or other crypto altcoins.Price is 15300$ for one btc. IF you want more than 10 btc - the price will be wholesale (10-12K).PM or let me know when interested.This is one of the most funny offer I have ever seen selling Bitcoin lower than the market price. The only reason that could make a person sell his or her Bitcoin at low price is when the Bitcoin is a stolen one or a scam attempt. The market is down and many investors are in loses and I keep thinking why op will want to sell bitcoin at a very low price when there are Exchanges he can sell them.There's nothing funny there someone is just discussing from what he does have so everybody have the right to discuss and also disclose its opinion or its observation through any other thing that happened into cryptocurrency so it's not a laughable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 25, 2022, 11:11:48 PM",
      "body": "Quote from: ed valdis on July 25, 2022, 05:02:50 PMHello.I have 156 bitcoins for sale. Exchange for tether(USDT), etherum or other crypto altcoins.Price is 15300$ for one btc. IF you want more than 10 btc - the price will be wholesale (10-12K).PM or let me know when interested.Be careful everybody, likely a scam.Why would you sell that with lower price market? Tainted bitcoins? LOL. Even someone who has that amount of bitcoin won't sell that with a lower market price.You can sell that in exchanges easily so why offer it?Come on man, I know that there are still a lot of newbies that don't know this is a scam but please stop scamming people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "July 25, 2022, 11:18:36 PM",
      "body": "Quote from: Charles-Tim on July 25, 2022, 05:54:05 PMQuote from: Edwardard on July 25, 2022, 05:38:17 PMCould you also specify the reason for selling it so cheaper than the current market rates? Also this is your first post and you are talking about lots of btc ,hope you dont end up scamming any innocent one!Probably a scam attempt. Better for everyone to avoid this scam attempt or coin that has been used for illegally activity.If there's someone have an interest in this I think that's dumb and greedy people who usually become prey on scammers, obviously, this is a scam attempt though it sounds funny why selling his Bitcoin at a low price.People who want to try must use an escrow.Quote from: ed valdis on July 25, 2022, 05:02:50 PMHello.I have 156 bitcoins for sale. Exchange for tether(USDT), etherum or other crypto altcoins.Price is 15300$ for one btc. IF you want more than 10 btc - the price will be wholesale (10-12K).PM or let me know when interested.If you really have this number of coins (which is impossible to believe) just sell them in p2p exchange which you can lower the price as you want, you can cover your ass if you want privacy and for sure it's a matter of a minute everything you have will be sold it out.  Hodl HodlBisq",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 25, 2022, 11:41:15 PM",
      "body": "Quote from: sheenshane on July 25, 2022, 11:18:36 PMIf you really have this number of coins (which is impossible to believe) just sell them in p2p exchange which you can lower the price as you want, you can cover your ass if you want privacy and for sure it's a matter of a minute everything you have will be sold it out.  Hodl HodlBisqIf he followed the advice you just gave him, then there will be no fish for him to catch (no one to scam) which we all know was his initial intention. So I doubt if he will take it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "July 26, 2022, 05:20:05 AM",
      "body": "Clearly seems to be scam attempt as why are you willing to sell at such low rates? You have 150 btc so you are big fish and can easily sell it on any of the exchange as there is liquidity for it so why you are offering discount to forum members? I don't think you are going to find out any victim with this attempt so try somewhere else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "July 26, 2022, 11:17:37 AM",
      "body": "I have not understood any reason you want to lower price of your bitcoin before offering to sell them , if you actually have 1 bitcoin. Put a sell order in an exchange and safe yourself the stress. Only a dumb fellow will fall for this trap. Don't buy cheap stuff because there could be something more to it that you don't know, stay away from scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "July 26, 2022, 11:55:58 AM",
      "body": "Logic that doesn't make sense by everyone and it's definitely a classic type of scam.I hope anyone doesn't get stuck with the cheap price but I'm sure no one will believe the OP by selling at a lower price than the market.There's no way he has that many bitcoins and he's dreaming from his sleep. Lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "July 26, 2022, 12:30:35 PM",
      "body": "Quote from: ed valdis on July 25, 2022, 05:02:50 PMHello.I have 156 bitcoins for sale. Exchange for tether(USDT), etherum or other crypto altcoins.Price is 15300$ for one btc. IF you want more than 10 btc - the price will be wholesale (10-12K).PM or let me know when interested.That is a lot of money if we want to buy more than 10 btc and I only recommend to buy from the exchange such Binance because that is safer. I do not think there are people who want to buy directly from others as we risk a big money to make a deal. But if some people interest with the offers because the price is low than the current price, I hope you can be careful and not easily get tempt instead searching for the other way to buy bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "July 26, 2022, 02:00:59 PM",
      "body": "Quote from: Charles-Tim on July 25, 2022, 05:54:05 PMQuote from: Edwardard on July 25, 2022, 05:38:17 PMCould you also specify the reason for selling it so cheaper than the current market rates? Also this is your first post and you are talking about lots of btc ,hope you dont end up scamming any innocent one!Probably a scam attempt. Better for everyone to avoid this scam attempt or coin that has been used for illegally activity.Quite fishy I guess, but not to throw accusation but to be someone who holds such amount of BTC and to sell it like something of an object or property seems odd. There are lots of exchangers to sell it so why would someone sell it on a bargain? I do agree that it COULD be a scheme, but I doubt there will be people 'buying' this idea especially at this point wherein situation is touch to most of us.But if ever this one would be real, I guess those who would be able to risk for this transaction will definitely earn, so I do hope that it won't be turned out as one of the 'scam issues' in this forum. So yeah, better be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}