{
  "id": "topic_5463422",
  "title": "klfdos",
  "author": "klfdos",
  "created_time": "August 15, 2023, 11:06:05 PM",
  "content": "HeyI sent a few deposits of 0.1 ETH and 1 ETH to tornado.cashI can withdraw the 0.1 ETH deposits just fine but the 1 ETH one I keep getting \"Failed to fetch all deposit events from contract\".There's no info on this anywhere else except here (https://bitcointalk.org/index.php?topic=5412746.0) but not sure how to use any of the codePlease help I'm lost here",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463422",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 15, 2023, 11:46:16 PM",
      "body": "It might be an issue with your internet connection or you are using the RPC that't not working/functionalCheck this article Tornado Cash post-censorship especially under FAQQuoteWhy do I keep receiving the error Failed to fetch all deposit events from contract when trying to withdraw?This error is related to a poor connection or using a censored RPC endpoint. To resolve this, either:- change VPN location for better latency- try a new browser or method of access- configure the application RPC configuration to an alternative",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 25, 2023, 06:27:18 AM",
      "body": "Quote from: klfdos on August 15, 2023, 11:06:05 PMHeyI sent a few deposits of 0.1 ETH and 1 ETH to tornado.cashI can withdraw the 0.1 ETH deposits just fine but the 1 ETH one I keep getting \"Failed to fetch all deposit events from contract\".There's no info on this anywhere else except here (https://bitcointalk.org/index.php?topic=5412746.0) but not sure how to use any of the codePlease help I'm lost hereIt's been ten days since you posted the problem and you haven't come back to tell us what happened to you. I hope you finally succeeded in withdrawing your Ethereum from Tornado Cash.I would like to inform you that this platform cannot be completely reliable due to the accusations leveled against a number of its developers. The first one was arrested last year by authorities in Deutschland and was later released under surveillance until the date his trial. Then Two days ago, two other devs have been charged by the US department of justice with \"conspiracy to commit money laundering, sanctions violations, and conspiracy to operate an unlicensed money-transmitting business\". One of them was arrested accordingly.You can follow this topic for better understanding: Tornado cash founders charged with money laundering/sanctions violationsBe Careful!Cheers,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 26, 2023, 09:19:54 AM",
      "body": "As posted above, if OP was unsuccessful in withdrawing it until the time that the co-founder was arrested. Then, his funds are gonna be stuck there and unknown when it will be resolved.(https://www.geekwire.com/2023/tornado-cash-co-founder-from-seattle-area-arrested-and-charged-with-money-laundering/)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 01, 2023, 11:30:06 PM",
      "body": "Quote from: blockman on August 26, 2023, 09:19:54 AMAs posted above, if OP was unsuccessful in withdrawing it until the time that the co-founder was arrested. Then, his funds are gonna be stuck there and unknown when it will be resolved.(https://www.geekwire.com/2023/tornado-cash-co-founder-from-seattle-area-arrested-and-charged-with-money-laundering/)The Mixer is based on a smart contract which is immutable. There is nothing authorities can do to stop it unless if they just decided to stop the whole Ethereum Blockchain on which the smart contract is based.If OP followed the instructions I posted, he may be able to still use the serviceDuring the time of the arrest of tornado cash dev, most of the domains and RPC were closed/censored. OP would have to look for a working RPC and change configuration if he wants to use the mixer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}