{
  "id": "topic_5452805",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "May 15, 2023, 11:54:36 AM",
  "content": "Как я всех понимаю! И наших и ненаших. Не всем нравится мое творчество на данном ресурсе.Но ведь существует простой выход – ДАТЬ ДЕНЕГ!           Те, кому не нравится то, что я публикую на данном форуме, могут дать мне денег, и я навсегда выпилюсь отсюда (как это уже много раз бывало), и меня здесь больше никто никогда не увидит (если что – в виде данного аккаунта, это так, на всякий случай). Кто знает... можно договориться... финансы решают все!   А вот поклонникам моего творчества – проще. Им достаточно задонатить мне средств, чтобы я писал тут чаще и активнее. Типа предложить твердую таксу – столько то рублей за символ. И я тоже буду следовать договоренностям. Слово – дело!   Но есть и третий вариант – дать взятку модераторам. Чтобы они меня выпилили и забанили. Хотя бы в виде данного аккаунта. Я тут точно не знаю, можно ли банить по IP, если я перерегистрируюсь заново… тут я не в теме. Но и тут, по сути, как мне кажется, все опять упирается в финансы. И в возможности.   В любом случае, оставайтесь с нами, читайте данный раздел форума – и вам никогда не будет скучно в этом мире. Обещаю! Следите за публикациями!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452805",
  "comments": [
    {
      "author": "Excimer",
      "created_time": "May 15, 2023, 11:58:39 AMLast edit: May 15, 2023, 12:20:01 PM by Excimer",
      "body": "У меня на кошельке лежит немного. Перевел бы. Да вот комиссия бетковена выше этой пыли получаетсяbonfire66, зачем уходишь? у тебя прикольные посты. эх форум не тот станет без тебя",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 15, 2023, 12:25:16 PMLast edit: May 15, 2023, 12:36:40 PM by bonfire66",
      "body": "Спасибо. Ждите сегодня чуть позднее совершенно мерзкий грязный и развратный пост. На политическую тему. Раз народ одобрил - то я за себя не отвечаю... ДА, еще рекомендую читать раздел \"разное\". Я там публикую (почти) все то, что не подходит под раздел \"политика\". Например \"познавательное\" или \"философское\". И тоже весьма обильно и регулярно!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "May 15, 2023, 02:02:26 PM",
      "body": "Бонифаций, зачем тебе деньги то?Ты же нам совсем недавно заливал здесь, что уж много лет не работаешь и при этом полностью обеспечен, катаешься постоянно по заграницам, содержишь в тех же заграницах чью-то жену с дочкой месяцами и годами …Ну и зачем тебе деньги (жалкие копейки за бездарные посты), если у тебя и так всё есть давно уж?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 15, 2023, 03:32:21 PM",
      "body": "Никакие деньги никогда не помешают. Даже копейки. К тому же, за жалкие копейки я не продамся. Именно потому, что я полностью обеспечен и только недавно вернулся из Прибалтики. Вы не поняли, этот пост не ради денег, а просто манифест. Декларация намерений. Декларация независимости от денег. Хочу - значит могу. Есть - значит имею, достиг - значит все у меня хорошо. Аминь!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Excimer",
      "created_time": "May 15, 2023, 04:31:08 PMLast edit: May 15, 2023, 05:09:33 PM by Excimer",
      "body": "bonfire66 - никого не слушай. в тебе есть потенциал человека способного сделать какое-нибудь революционное открытие.это мы тут со Снорком уже погрязли в испорченной системе бытия и нас уже не исправить, а вот у тебя bonfire66 энтузиазм как у ребенка, а это значит все еще впередивот над Коперником тоже светское общество смеялось - а ведь оказался прав.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 15, 2023, 05:57:58 PM",
      "body": "Спасибо за понимание. Стараюсь как могу. Но без дозы пива уже никак. Хотя я до примерно 42 лет был законченным трезвенником. И также всем молодым людям рекомендую поступать так же. Чтобы сохранить ясность мышления, а член всегдастоящим. Ибо я твердо убежден, что проблема людей в том, что они начинают активно бухать в возрасте 16-20 лет. И бухают до старости. А это - неправильно! Не надо так делать! Алкоголь - это зло! Надо сохранять мозги свежими, а попу девственной. И будет вам счастье!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pavel.Savelev",
      "created_time": "May 15, 2023, 06:57:27 PM",
      "body": "Quote from: bonfire66 on May 15, 2023, 05:57:58 PMСпасибо за понимание. Стараюсь как могу. Но без дозы пива уже никак. Хотя я до примерно 42 лет был законченным трезвенником. И также всем молодым людям рекомендую поступать так же. Чтобы сохранить ясность мышления, а член всегдастоящим. Ибо я твердо убежден, что проблема людей в том, что они начинают активно бухать в возрасте 16-20 лет. И бухают до старости. А это - неправильно! Не надо так делать! Алкоголь - это зло! Надо сохранять мозги свежими, а попу девственной. И будет вам счастье!Насчет алкашки согласен полностью. Очень часто эта проблема возникает из-за отсутствия цели в жизни своей и жизни общества в котором существует чевовек.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}