{
  "id": "topic_5437109",
  "title": "wealth2wealth",
  "author": "wealth2wealth",
  "created_time": "January 28, 2023, 01:32:23 PM",
  "content": "Many people from north africa, middle east and subsaharian countries cross thé lediterranian sea to reach italy in order to settle in Europe. They pay about 2000 dollars for this illégal migration and Thousands of them sink during this travel.M'y idea is to find partners who can afford job contracts for people looking for migration and we get 3000 dollars for each one.We share earning 50/50I have hundreds of CV of people interested in job contracts and able to pay 3k or even more.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437109",
  "comments": [
    {
      "author": "Babaaziz",
      "created_time": "January 30, 2023, 01:32:46 PM",
      "body": "Hello , i want to contact you , please to open newbie messages thanks .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "January 30, 2023, 10:03:38 PM",
      "body": "Quote from: wealth2wealth on January 28, 2023, 01:32:23 PMM'y idea is to find partners who can afford job contracts for people looking for migration and we get 3000 dollars for each one.We share earning 50/50I have hundreds of CV of people interested in job contracts and able to pay 3k or even more.If the deal is too good to be true, then it's probably scamThis sounds like bullshit to me, and I am pretty sure it's a scam. I hope Newbies don't fall for this scam trick. Use your head and do your own research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "January 30, 2023, 11:26:03 PM",
      "body": "Quote from: wealth2wealth on January 28, 2023, 01:32:23 PMMany people from north africa, middle east and subsaharian countries cross thé lediterranian sea to reach italy in order to settle in Europe. They pay about 2000 dollars for this illégal migration and Thousands of them sink during this travel.M'y idea is to find partners who can afford job contracts for people looking for migration and we get 3000 dollars for each one.We share earning 50/50I have hundreds of CV of people interested in job contracts and able to pay 3k or even more.Who are these partners who can afford the costs of job contracts for persons seeking immigration? What are the guarantees that make anyone who wants to migrate pay his money to you or your partners? Frankly, I do not feel credible in what you said, and no one can trust your words, excuse me, but most scammers make false promises to people and when they pay money they do not get a job contract or legal immigration, so I advise anyone who wants to migrate to put his money in the right place and deal with trusted people and companies instead of building his dreams in a mirage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "January 30, 2023, 11:59:16 PM",
      "body": "Why is it that I'm feeling like some problem might occur with this one and it's like people will be sent to the job that they're not expecting. And, much worse will be exploited. It will create more problem like illegal immigration and undocumented immigrant for which they might be just sent back to their originated country.I think that this is human trafficking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "January 31, 2023, 06:01:32 PM",
      "body": "Quote from: wealth2wealth on January 28, 2023, 01:32:23 PMMany people from north africa, middle east and subsaharian countries cross thé lediterranian sea to reach italy in order to settle in Europe. They pay about 2000 dollars for this illégal migration and Thousands of them sink during this travel.M'y idea is to find partners who can afford job contracts for people looking for migration and we get 3000 dollars for each one.We share earning 50/50I have hundreds of CV of people interested in job contracts and able to pay 3k or even more.It has created a trap of deception. None of you should fall prey to this scam. He said here that he has hundreds of CB lying around. That means he is not able to give employment to any person. OP I want to message you never cheat people like this. Any time you will see that you are facing many dangers from which you will not find any way out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "January 31, 2023, 11:54:56 PM",
      "body": "Quote from: wealth2wealth on January 28, 2023, 01:32:23 PMGoing through what you've got there in OP, I seem to be drawn to the words illegal and sink. Clearly, there is everything not right with these and having to offer this job on a 50/50 terms if there were anything legit about it feels as though, your out to reap this people. Your terms for sure but, it would be a lot of suffering for anyone who dares to go through with it and in time, there surely would be trouble.About the word sink as it is used there in OP, does that mean,These migrants die by drawing in the process of there travels or they are being scammed of there funds. What are you saying in particular because, I don't really get you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Babaaziz",
      "created_time": "February 01, 2023, 09:06:25 PM",
      "body": "Dear members , what is he talking about is really popular in africa that people immigrates illegal everyday using boats crossing seas , i won't talk about the legal immigrations from africa to europe beacause it's not easy at all since the embassies puts too hard restrictions for those who want to immigrate , and the unstable life with it's gorvernments makes life in africa worthless to live , so everyone dreaming to immigrate to such a perfect countries with good lifestyle , education , salary , and etc... , so paying to reach such a country isn't important , for me as a person living in an african country , i have no clue why iam living , as a higher educated person , i live like acheap sheep , built lots of power stations and worked in many companies and salary ? Not enough to rent an apartment to live in . So there's no doubt i can sacrificing my life , my education , and everything for just a real ruled worth lives that i can live in peace , so paying is nothing worth tge dreams , i tried many methods to immigrate through companies and etc . And all was a cheat , but the contractors are the best for travelling , also we won't pay until we are sure that  it is a real company certified through the embassy , whatever many people fall in that trap , they have no other solutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "February 06, 2023, 08:14:01 PM",
      "body": "Quote from: Babaaziz on February 01, 2023, 09:06:25 PMAnd all was a cheat , but the contractors are the best for travelling , also we won't pay until we are sure that  it is a real company certified through the embassy , whatever many people fall in that trap , they have no other solutions.Just like this one being promoted on this thread is also a cheat. I understand what you say, it's really difficult to migrate from a poor country to a developed one, because there are many restrictions, besides having many requirements, especially financial ones.If you are looking for a contract I guess the first step would be to seek it through an educational institution in your country which has partnership and contact with employers from first world countries. But you need to improve your English skills, anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "February 07, 2023, 02:01:11 PM",
      "body": "Without going too much into what a mire of issues you can get discussing legality and illegality of migration (which really just has only something to do with basic human rights), you can almost be sure that if you're looking to profit off it, you're likely only making the situation worse for actual migrants who have urgent needs and rights in any system.In short, if people have the rights to migrate but can't afford it, who are we to add an additional barrier of cost for them?May not be the \"gold visas\" that much of the developed world is trying to erase (lesson learnt, paying millions for citizenship or residency doesn't necessarily bring long-term gains), but the premise is the same.Now if we're talking about using Bitcoin to help facilitate systems and protect those migrants who are being exploited by fiat systems, maybe there's a use?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "February 07, 2023, 08:41:03 PM",
      "body": "It sounds shady and I think that people who will get involved here may get serious problems and risk isn't worth money that you can earn potentially. After all, it's illegal immigration. I'm not very familiar with this stuff, but how it's possible to employ person who don't even have permission to be in that country.I think it's very likely that not just these poor migrants, but also people who will help will get scammed or will have problems with law enforcement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "February 07, 2023, 11:08:06 PM",
      "body": "Quote from: wealth2wealth on January 28, 2023, 01:32:23 PMI have hundreds of CV of people interested in job contracts and able to pay 3k or even more.It's the 3k dollars won't sink than the 2k dollars?  What's the difference?This is illegal and we know most countries have to combat or fight this illegal migrant.  You may face the cause and possible consequences if you'll do this even with how much you pay to them, it's illegal to cross borders without legal papers.  Using Bitcoin won't help with this, it's a complete scam attempt at poor people who desperately move to other countries without knowing the consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jayce",
      "created_time": "February 08, 2023, 09:43:14 AM",
      "body": "It's not just as easy as it looks, since there are many social problems involving in this, especially when it's about the international laws. Beside that, there might be exploitation on them once they get a job in a country, and no one could defend nor fight for their rights because of their status. I'm not underestimating any people but if they are qualified enough, then they could just apply in a proper way as there are many international companies accepting international applicants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "February 25, 2023, 06:43:03 AM",
      "body": "-   It's hard what you're saying, and no one will believe what you're offering, mate. An illegal or wrong method can never be right.Of course, what do you expect with the wrong method but the result is not good in the end either? Also, the 50/50 income sharing is easy to say if there is nothing shown to be held that will be given.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "February 27, 2023, 12:27:13 PM",
      "body": "Nope and Red Flag. It's ok to help people acquiring work in countries where they come from. Build up some sort of (legal) business in their home countries. But what you're supposing is not legal. To get asylum in countries should never be a matter of money and to do some sort of business with migration must not be supported in any ways - no matter if it's concerning asylum or migration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "February 27, 2023, 08:28:23 PM",
      "body": "Quote from: Danydee72 on February 27, 2023, 12:27:13 PMNope and Red Flag. It's ok to help people acquiring work in countries where they come from. Build up some sort of (legal) business in their home countries. But what you're supposing is not legal. To get asylum in countries should never be a matter of money and to do some sort of business with migration must not be supported in any ways - no matter if it's concerning asylum or migration. There's nothing wrong on helping other people landing a job but just like what others are feeling on this one, it seems that there's a human trafficking and if he said that there's an illegal migration that will happen, then you better not be part of this circle.Having an entry to another country through illegal migration, it's going to be such a waste of time and money for those people that will trust on this process. It's better to get through the legal process and that amount that shall be paid, they won't have any problems about it. Aside from that, I've seen a lot of news that those poor folks have been promised with a job but ended up with an immoral job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Transferli",
      "created_time": "February 28, 2023, 09:05:34 AM",
      "body": "nice idea, contact me, also i can help these migrants to send money to their family in any country in the world, Telegram: @transferli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "February 28, 2023, 10:54:23 PM",
      "body": "Your deal only sounds very funny to me and I'm been trying trying to comprehend how someone just wakes up and expect people to entrust them with some reason sum of money upto $3000,. What sort of boldness so you guys have and most times I wonder if this newbie accounts that just wake up from the blues and just transact with people without any reputation really think users over here are dump, if not then I see no reason with so much boldness and guts.On the only hand @OP, no matter how legit you prove to be there are very slim chances buying your idea because you don't have any reputation to protect over here so you shouldn't expect people turn up so easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "March 02, 2023, 07:37:32 AM",
      "body": "Quote from: Smartvirus on January 31, 2023, 11:54:56 PMQuote from: wealth2wealth on January 28, 2023, 01:32:23 PMGoing through what you've got there in OP, I seem to be drawn to the words illegal and sink. Clearly, there is everything not right with these and having to offer this job on a 50/50 terms if there were anything legit about it feels as though, your out to reap this people. Your terms for sure but, it would be a lot of suffering for anyone who dares to go through with it and in time, there surely would be trouble.About the word sink as it is used there in OP, does that mean,These migrants die by drawing in the process of there travels or they are being scammed of there funds. What are you saying in particular because, I don't really get you.It turns out that OP wants the people to be illegal aliens in the country they will see for the procedure illegally. It is as if these people will be able to cross abroad and then the illegal aliens will be consumed by this half of their wages will go to help them, but I don't know if I understand it correctly.     But anyway, a wrong plan can never be right, let's just remember that what started wrong with bad results in the latter, and I believe in this saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "March 05, 2023, 05:07:26 PM",
      "body": "This is so sad and disheartening for me knowing how those of the third world countries particularly Africans go through a deadly risk in the adventure to look for a greener pasture as a result of the brunt of  bad leadership and mismanagement of the public goods which has led to the dilapidation of all sectors of the African states. OP if true that this is a scam as other users have raised a caveat about it, then you should understand that you're only aggravating the conditions of these eager to migrate migrants that don't only face the risk of sinking in the middle of the Mediterranean but also being scammed of their hard earned money that they have laboured through their anus to make, cause $3k  runs in millions when exchanged in the local currency. Which may seem nothing much to you but a great amount to these desperate migrants. Just think about it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}