{
  "id": "topic_5468104",
  "title": "heartbit.offical",
  "author": "heartbit.offical",
  "created_time": "September 25, 2023, 11:41:40 PM",
  "content": "[News article]\"Shanghai Court Recognizes BTC as Digital Currency\"Shanghai court recognizes Bitcoin as digital currency, citing its uniqueness and potential for ownership disputes.[Open question]China is a socialist country. I don't quite understand the recognition of Bitcoin.Indeed, we should engage in an extended thought process to understand why China has chosen to recognize it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468104",
  "comments": [
    {
      "author": "mk4",
      "created_time": "September 26, 2023, 02:01:16 AM",
      "body": "If I were to guess — since it doesn't make sense for such a 'controlling' country to be interested in a currency they can control; (this is a sort of tinfoil-hat theory so bear with me) I think it's because they might think that bitcoin is(or can be) some sort of competitor to the USD.That, or the fact that they don't care and that Bitcoin can be a surveillance thing for them (because transparent blockchain).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 26, 2023, 05:39:56 AM",
      "body": "Quote from: mk4 on September 26, 2023, 02:01:16 AMIf I were to guess — since it doesn't make sense for such a 'controlling' country to be interested in a currency they can control; (this is a sort of tinfoil-hat theory so bear with me) I think it's because they might think that bitcoin is(or can be) some sort of competitor to the USD.That, or the fact that they don't care and that Bitcoin can be a surveillance thing for them (because transparent blockchain).Chinese government is actually a crypto whale. This article is pretty old but it claims that chinese government owns 194k of BTC and 833k of ETH. As I understood, most of these coins are the funds seized from from PlusToken ponzi scam but for some reason they are not rushing to sell the coins. My guess is that china is preparing a regulatory base for the cryptocurrencies and they might need a lot of liquidity in crypto in order to launch their own exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MetaTeraX1",
      "created_time": "September 26, 2023, 06:03:06 AM",
      "body": "it should be, there is no reason to reject bitcoin. Not only China, but the whole world should accept Bitcoin as legal payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 26, 2023, 06:15:06 AM",
      "body": "Quote from: Beerwizzard on September 26, 2023, 05:39:56 AMChinese government is actually a crypto whale. This article is pretty old but it claims that chinese government owns 194k of BTC... Thats 1% of supply. Its nowhere close to be a \"crypto whale\". MicroStrategy - a single company with average recognition (before investing in BTC) and average financial situation - owns 150k.The US has more bitcoins - \"As of August 25, 2023, the US government owns 205,515 bitcoins\". definitely the amount of bitcoins they officially have is not a justification for why they started supporting crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 26, 2023, 06:15:13 AM",
      "body": "Quote from: mk4 on September 26, 2023, 02:01:16 AMIf I were to guess — since it doesn't make sense for such a 'controlling' country to be interested in a currency they can control; (this is a sort of tinfoil-hat theory so bear with me) I think it's because they might think that bitcoin is(or can be) some sort of competitor to the USD.China do not have international dealings with other countries with bitcoin or any other cryptocurrencies and they have not shown that they have it in mind. It only recognize bitcoin as a digital property that Chinese can hold legally. The country prefer the BRICS way to compete with United States dollar, but those BRICS nation are still not able to do something that will significantly affect United States dollar.Quote from: MetaTeraX1 on September 26, 2023, 06:03:06 AMit should be, there is no reason to reject bitcoin. Not only China, but the whole world should accept Bitcoin as legal payment.But China did not accept bitcoin as a currency, but as something that you can hold. As China is not accepting gambling but it is one of the countries that are mostly gambling. Also in crypto, it is the second country with bitcoin mining hashrates. There are a lot that is not accepted in that country, but there citizens are doing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 26, 2023, 06:20:23 AM",
      "body": "Quote from: MetaTeraX1 on September 26, 2023, 06:03:06 AMit should be, there is no reason to reject bitcoin. Not only China, but the whole world should accept Bitcoin as legal payment.China court declares virtual assets legal properties protected by law:They are recognizing BTC, they are going to embrace it. AFAIK China still has miners and the Chinese have a big chunk of volume contribution in Binance market. I have read articles about Hong Kong going to become the biggest crypto hub in Asia. They may not control BTC but they control the people and their data, I think they will not find it problematic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 26, 2023, 06:37:57 AM",
      "body": "Quote from: Tytanowy Janusz on September 26, 2023, 06:15:06 AMQuote from: Beerwizzard on September 26, 2023, 05:39:56 AMChinese government is actually a crypto whale. This article is pretty old but it claims that chinese government owns 194k of BTC... Thats 1% of supply. Its nowhere close to be a \"crypto whale\". MicroStrategy - a single company with average recognition (before investing in BTC) and average financial situation - owns 150k.The US has more bitcoins - \"As of August 25, 2023, the US government owns 205,515 bitcoins\". definitely the amount of bitcoins they officially have is not a justification for why they started supporting crypto.They don't actually need to own the entire supply. But if they launch their own crypto exchange or any other crypto service which will be used across the china then they gonna need to keep lots of money in crypto in order to provide the liquidity for the freshly created market. I'm not saying this is exactly how it gonna work, but this is just an option that gives a reasonable explanation of how China is going to use its stash. Quote from: Tytanowy Janusz on September 26, 2023, 06:15:06 AMThats 1% of supply. Its nowhere close to be a \"crypto whale\". MicroStrategy - a single company with average recognition (before investing in BTC) and average financial situation - owns 150k.This actually proves as China is a crypto whale.MicroStrategy 158k vs Chinese 194k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 26, 2023, 07:15:52 AM",
      "body": "Quote from: Beerwizzard on September 26, 2023, 06:37:57 AMMicroStrategy 158k vs Chinese 194kMicrostrategy is a company that employs 2,000 people and built its recognition on investing in bitcoin, but before that it generated practically no profits. China is a country with 1.4 billion citizens and a GDP of $17TQuote from: Beerwizzard on September 26, 2023, 06:37:57 AMBut if they launch their own crypto exchange or any other crypto service which will be used across the china then they gonna need to keep lots of money in crypto in order to provide the liquidity for the freshly created market. All they need is a good arbitrage trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 26, 2023, 09:09:44 AM",
      "body": "Quote from: Tytanowy Janusz on September 26, 2023, 07:15:52 AMQuote from: Beerwizzard on September 26, 2023, 06:37:57 AMMicroStrategy 158k vs Chinese 194kMicrostrategy is a company that employs 2,000 people and built its recognition on investing in bitcoin, but before that it generated practically no profits. China is a country with 1.4 billion citizens and a GDP of $17TMicrostrategy is one of the world's largest BTC whales.But anyway, I see not much reasons to compare the company with the government. Both own the large amount of BTC and this is all I need to know in regards to the crypto market.Quote from: Tytanowy Janusz on September 26, 2023, 07:15:52 AMAll they need is a good arbitrage trader.With no funds? Or you want them to buy shit tons of BTC on spot once they going to launch an exchange?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "September 26, 2023, 09:23:12 AM",
      "body": "Sometimes it's hard to understand this country, China. To be honest, before, they were very negative about bitcoin or cryptocurrency, but they have a Bitcoin mining farm. There was a time when they banned crypto, but now they recognize it. Why?Because they know something good will happen to Bitcoin in the upcoming halving? So they sense that when the bull run comes, Bitcoin's price value will plummet in the market, so they don't want to lag behind when it comes to Bitcoin holding countries? So sometimes I think that what they give negative to Bitcoin is just a strategy of China to dump the price of BTC, and then they will suddenly buy a lot of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 26, 2023, 09:23:50 AM",
      "body": "Quote from: heartbit.offical on September 25, 2023, 11:41:40 PMShanghai court recognizes Bitcoin as digital currency, citing its uniqueness and potential for ownership disputes.No it didn't!It has just ruled that:Virtual assets represent property and are thus protected by law!What this means is that if you have 200 BTC and they got stolen that's a criminal act and the victim should seek compensation, if I lend you 1 BTC and you don't pay back it's like I lend you a car and you run with it or you take $20 000 and again don't pay back!The court decided that virtual currencies have value, that's it, and they can't be treated like Candy Crush saga diamonds or saved games!It's not about BTC it's about all virtual currencies and they recognized them as property, not as a currency!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "September 26, 2023, 11:38:26 AM",
      "body": "Quote from: heartbit.offical on September 25, 2023, 11:41:40 PM[News article]\"Shanghai Court Recognizes BTC as Digital Currency\"Shanghai court recognizes Bitcoin as digital currency, citing its uniqueness and potential for ownership disputes.[Open question]China is a socialist country. I don't quite understand the recognition of Bitcoin.Indeed, we should engage in an extended thought process to understand why China has chosen to recognize it.Let me use this opportunity to correct a small impression concerning the precised board that this post or thread have to allocate to, from my observation concerning this, I think that the main place whereby this thread suppose to have more traffic for discussion is bitcoin discussion, because trading is basically meant for buying and trading of cryptocurrencies and also learning of the strategies to implies so that investor especially the new ones won't be able to be victims of losing all of what they invested in trading. The aspect of China accepting bitcoin or recognised bitcoin through court order, I think it's a welcomed development in cryptocurrency market because if the information is real I think bitcoin will be positive in the market, only if the companies in China embrace bitcoin for monetary transactions and also invest in bitcoin and as well choose an option of payment with bitcoin their participates or employee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "September 26, 2023, 12:49:08 PM",
      "body": "What a roller coaster ride of Bitcoin on that country. They've announced a lot of bans from Bitcoin to ICO, mining, etc. Last time, there was a news that they're pilot testing CBDC. This time, they're recognizing and its court declared that it's a digital currency.Quote from: heartbit.offical on September 25, 2023, 11:41:40 PM[Open question]China is a socialist country. I don't quite understand the recognition of Bitcoin.Indeed, we should engage in an extended thought process to understand why China has chosen to recognize it.Don't get confused by them. Anything that there's gonna be money on it, they're going to recognize it. Just like the other known economists telling that they dislike Bitcoin or it's a shit, they're the same as theirs. As long as there's a cash cow on this space, they'll not tell things that they're planning to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "September 26, 2023, 12:49:48 PM",
      "body": "Regardless of their views about Bitcoin, I am still having doubts on their initiatives, intentions, etc., because they still want to control the people’s lives there. I do not know if banks and financial institutions there are still prohibited from accepting Bitcoin and other cryptocurrencies as of this time as BTC being categorized as properties and not legalized as mode of payment like in Russia.As long they are not being recognized as currency, I would remain having doubts on China in terms of adoption. But still there are people there doing BTC transactions underground via P2P trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AliMan",
      "created_time": "September 26, 2023, 01:02:06 PM",
      "body": "There's a huge reason why China had come up to that certain decisions to choose bitcoin in the first place, but I see it has a lot of advantages in the near future of making our mode payment become digitalize. The convenience and value of money became more important compared with traditional way of payment which is existing in different parts of the world. Unfortunately, it's hard to adopt on some countries that's poor in education towards cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "September 26, 2023, 10:32:40 PM",
      "body": "Quote from: heartbit.offical on September 25, 2023, 11:41:40 PM[News article]\"Shanghai Court Recognizes BTC as Digital Currency\"Shanghai court recognizes Bitcoin as digital currency, citing its uniqueness and potential for ownership disputes.In fact, when there was a ban on all crypto activities in China several years ago, crypto activities there also did not stop, in fact they continue and develop to this day. And what's more, if now their activities are protected by law, this will make things easier for them. However, we will see later whether this will change again or not as time goes by. Because we know how this country plays against Bitcoin and Crypto as a whole. Let's just follow them. This might be a good trigger for positive trends, at least it would be good to pick up the bullish era. But once again, however, we shouldn't just be careless when it comes to dealing with things like this. Remain as usual and continue to be wise in all decision making for the crypto activities that we personally undertake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "September 26, 2023, 11:02:52 PM",
      "body": "Quote from: AliMan on September 26, 2023, 01:02:06 PMThere's a huge reason why China had come up to that certain decisions to choose bitcoin in the first place, but I see it has a lot of advantages in the near future of making our mode payment become digitalize. The convenience and value of money became more important compared with traditional way of payment which is existing in different parts of the world. Unfortunately, it's hard to adopt on some countries that's poor in education towards cryptocurrency.The reasons why China keep banning and accepting Bitcoin is what I don't really know. They once ban Bitcoin and after a while it was recognized and a currency and later Bitcoin was also ban and now it is acceptable in the country. I think there is a reason to this which we might not know yet unless we live in China or understand the reasons behind the decisions. Although it is quite interesting for China to bring back all the lost Bitcoin investors which might have decided to give cryptocurrency a halt for a while since there country do not recognize Bitcoin then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "September 27, 2023, 04:39:11 AM",
      "body": "There are millions of people in China who hold Bitcoin from before it was banned. If if trading and other activity is illegal people are still entitled to protection from theft. It is their property and it may hold substantial value so criminals shouldn't just be allowed to take it. The courts are doing the bare minimum to acknowledge Bitcoin holders' rights but I don't think it means that they will fully reverse their ban anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 28, 2023, 05:57:08 AM",
      "body": "Quote from: Beerwizzard on September 26, 2023, 09:09:44 AMMicrostrategy is one of the world's largest BTC whales.But anyway, I see not much reasons to compare the company with the government. Both own the large amount of BTC and this is all I need to know in regards to the crypto market.that's a lot of BTC for one little-known company. This is an average of a lot of BTC for the BTC network (1% is not much), and negligible compared to the capital flowing through China. Therefore, in my opinion, they will not change the law that affects 1.3 billion people just for pennies.Quote from: Beerwizzard on September 26, 2023, 09:09:44 AMWith no funds? Or you want them to buy shit tons of BTC on spot once they going to launch an exchange?You can arbitrage BTC without BTC via margin trading or futures trading. And the arbitrage trading itself is usually decentralized to many smaller entities - the Chinese government does not have to have anything to do with providing liquidity. All it takes is for the price of BTC to drop by 1% compared to other exchanges and people will start making money, earning $10,000 for every $1 million they arbitrage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}