{
  "id": "topic_5475132",
  "title": "blue Snow",
  "author": "blue Snow",
  "created_time": "November 23, 2023, 12:01:16 AM",
  "content": "I have Trezor one, and want to connect to Electrum. I just have a question, can I get a private key on a spesific address while my trezor connected on electrum?, If can, how?. I never tried, because all this time, if I want to see a private key on a specific address, I used iancoleman tool offline on my localy PC.Thanks for advance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475132",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 23, 2023, 12:11:16 AM",
      "body": "If the private key never left trezor, you will not be able to have access to the private key unless you import the seed phrase on Electrum on an airgapped device. Or use the html file of incoleman on a word editor on an airgapped device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "November 23, 2023, 01:12:03 AM",
      "body": "Quote from: blue Snow on November 23, 2023, 12:01:16 AMI have Trezor one, and want to connect to Electrum. I just have a question, can I get a private key on a spesific address while my trezor connected on electrum?, If can, how?. I never tried, because all this time, if I want to see a private key on a specific address, I used iancoleman tool offline on my localy PC.Thanks for advance.You cannot gain access to the seed or export the Private key from a hardware wallet (Trezor, Ledger, etc.) connected to any wallet application, including Electrum.  To get the private key for a specific address in your hardware wallet, import your hardware wallet's Seed phrase to Electrum; then, you can get the private key by exporting it.However, I don't recommend this method because it means you have indirectly compromised your hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 23, 2023, 01:49:57 AM",
      "body": "Quote from: Husna QA on November 23, 2023, 01:12:03 AMHowever, I don't recommend this method because it means you have indirectly compromised your hardware wallet.By compromising his hardwallet do you mean because the electrum wallet is a software wallet? Then it is quite possible because he can just get an airgapped device ( not necessarily making his device go offline now but the device should have always been offline), this way it is as good as the hardware wallet himself. It is even more secure than the iancoleman tool he is using",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "November 23, 2023, 03:03:32 AM",
      "body": "Quote from: Zaguru12 on November 23, 2023, 01:49:57 AMQuote from: Husna QA on November 23, 2023, 01:12:03 AMHowever, I don't recommend this method because it means you have indirectly compromised your hardware wallet.By compromising his hardwallet do you mean because the electrum wallet is a software wallet? Then it is quite possible because he can just get an airgapped device ( not necessarily making his device go offline now but the device should have always been offline), this way it is as good as the hardware wallet himself. It is even more secure than the iancoleman tool he is using What I mean was that the private keys from the addresses in the hardware wallet are also used in other wallets such as Electrum, etc. (non-hardware wallets), which can be riskier, mainly if the OS used is prone to viruses even though you can use an air-gapped device and keep it offline to export the private keys.I prefer to use a new address in a different wallet rather than the same address in multiple wallets, especially if the address results from importing a private key from an address in a hardware wallet.So, let the secure chip in the hardware wallet function as it should as a private key store.- https://trezor.io/learn/a/secure-element-in-trezor-safe-3- https://blog.coinkite.com/understanding-mk4-security-model/- https://www.coolwallet.io/blog/hardware-wallet-secure-element-complete-guide/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "November 23, 2023, 08:52:48 PM",
      "body": "As the above members have said, this is not possible. Trezor device does not communicate the seed phrase with Electrum when it connects to it (it's not needed). So, Electrum does not know your seed, hence, it can't show individual private keys.This is the case even for Trezor Suite which is the official desktop wallet software for Trezor devices.The only way to get individual private keys is by exporting the seed phrase and use a third party tool to derive the private keys, which is not recommended for security reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 25, 2023, 04:24:27 AM",
      "body": "Thanks for all the answers, It seems impossible to get the private key on my Trezor, except to import the mnemonic seed manually on the Electrum wallet because the key is never left the device. Trezor Wallet or any kind of hardware wallet seems to provide complete security to users. This is very good for beginners to buy hardware wallets if begin with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "November 29, 2023, 05:01:42 PM",
      "body": "Quote from: blue Snow on November 25, 2023, 04:24:27 AMThanks for all the answers, It seems impossible to get the private key on my Trezor, except to import the mnemonic seed manually on the Electrum wallet because the key is never left the device. Trezor Wallet or any kind of hardware wallet seems to provide complete security to users. This is very good for beginners to buy hardware wallets if begin with Bitcoin.Why would you ever want to do that?  It's not like you are destined to use single private key for the rest of your life... and it takes only few minutes to create new one seed phrase or private key.Keys for hot and cold wallets should always be kept separately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 30, 2023, 12:02:47 AM",
      "body": "Quote from: dkbit98 on November 29, 2023, 05:01:42 PMQuote from: blue Snow on November 25, 2023, 04:24:27 AMThanks for all the answers, It seems impossible to get the private key on my Trezor, except to import the mnemonic seed manually on the Electrum wallet because the key is never left the device. Trezor Wallet or any kind of hardware wallet seems to provide complete security to users. This is very good for beginners to buy hardware wallets if begin with Bitcoin.Why would you ever want to do that?  It's not like you are destined to use single private key for the rest of your life... and it takes only few minutes to create new one seed phrase or private key.Keys for hot and cold wallets should always be kept separately.I just want to import my address on Trezor to Electrum. I want to use that for receiving and sending the Bitcoin I got from the signature campaign. Because I've used Trezor every time when sending it to exchange. I just want to separate like your suggestion, Trezor for a cold wallet, and Electrum for a hot wallet.but, because it's enough completely, maybe better to create another address on Electrum just for use for frequent transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 30, 2023, 03:32:22 AM",
      "body": "Quote from: blue Snow on November 30, 2023, 12:02:47 AMbut, because it's enough completely, maybe better to create another address on Electrum just for use for frequent transactions.There is an easier solution, which is to extract Xpub aka Extended Public Key, which gives you the option to obtain more addresses, monitor them, and track your assets without the need to access the private key or connect a Trezor. You can track your Electrum balance or even request a new address without having to connect the Trezor and connect it only when you want to send transactions.You can get it either via Trezor Bridge (Basic then Show XPUBs) or from Electrum Wallet (Wallet then Master Public Keys).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 01, 2023, 07:22:00 AM",
      "body": "Quote from: blue Snow on November 30, 2023, 12:02:47 AMI just want to separate like your suggestion, Trezor for a cold wallet, and Electrum for a hot wallet.You already have a \"convenient cold-storage\" which is your Trezor, just use it instead of creating a hot wallet with less security.The only hard part of using it is when plugging and signing transactions which IMO, isn't that inconvenient.Quote from: Yamane_Keto on November 30, 2023, 03:32:22 AMQuote from: blue Snow on November 30, 2023, 12:02:47 AMbut, because it's enough completely, maybe better to create another address on Electrum just for use for frequent transactions.There is an easier solution, which is to extract Xpub aka Extended Public Key, The alternative to that solution is to disable wallet encryption.That way, the wallet can be opened without the plugging the hardware wallet, it'll only be required when the keys are needed.There's no private keys in the wallet file so there's no major issue aside from privacy issue for when the unencrypted wallet file got in the hands of a hacker.(the public servers if you're using those already know your addresses anyways)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}