{
  "id": "topic_5473263",
  "title": "Question:",
  "author": "OgNasty",
  "created_time": "November 07, 2023, 08:47:14 PM",
  "content": "I find myself eating tacos on Tuesdays quite frequently for a variety of reasons. Some of the reasons include lower prices, being part of something fun, and I figure that taco places are moving through a lot of product so maybe the food is fresher. What are some reasons why you do or do not eat tacos on Tuesdays?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473263",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "November 08, 2023, 09:33:28 AM",
      "body": "I don’t do it regularly but I have definitely eaten Tacos on a Tuesday more than once. They are a great food, filled with beef mince, onions, tomato, lettuce, chilli, sour creme. I’m getting hungry now thinking about it, might have to be a Taco Wednesday in my household tonight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 09, 2023, 10:20:32 AM",
      "body": "Taco Tuesday is not a thing here in my country, so no. We do not eat tacos on Tuesdays. Actually, Mexican food is the kind of thing you would need to get out your way to find here, because it would imply to go to a special restaurant focused in it or buy the ingredients needed to prepare tacos at home. I was aware in the United States people have some inclination on eating Mexican food on Tuesdays but I never fully understood why. What is your favorite kind of taco by the way? (assuming we are talking about real tacos/traditional tacos and not those which are offered in Taco Bell).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 09, 2023, 10:59:30 AM",
      "body": "This does not applies to my own country as well, taco is not eating by the common average citizens, but believed to be served at occasions or small gathering and also the educated elites often eat this more, but not really on Tuesdays, it can be eaten at any time or day of the week, just as we have other kinds of food we eat, it's nit also considered cheap here because there are other food items that are more cheaper than taco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 09, 2023, 11:53:41 AM",
      "body": "Interesting to hear that Taco Tuesday is an American thing. I had no idea. It is big here though. For example, the place I go usually sells tacos for $3.99, but they sell them on Tuesdays for $1.79 which usually results in a line around the lot. The tacos are quite basic though. Typically just beef, cheese, and lettuce with a side of hot sauce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 09, 2023, 04:31:06 PM",
      "body": "Quote from: OgNasty on November 09, 2023, 11:53:41 AMInteresting to hear that Taco Tuesday is an American thing. I had no idea. It is big here though. For example, the place I go usually sells tacos for $3.99, but they sell them on Tuesdays for $1.79 which usually results in a line around the lot. The tacos are quite basic though. Typically just beef, cheese, and lettuce with a side of hot sauce.I have always assumed it was a custom from.the United States, for reference I am from Venezuela and here we do not have any custom about eating specific sort of food depending on the day of the week, it only happens when we celebrate very known seasons or holidays, like Eastern, Christmas, etc. I have also read and seen on Television that American Highschool also have their own version of Taco Tuesdays. By the way, for that price obviously any taco you get would be simple, but getting a couple of tacos as lunch for a little bit over 3 Dollars sounds quite reasonable. It would the the sort of thing people would try to get here, in order to save money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "November 09, 2023, 09:48:45 PM",
      "body": "We don't have anything like that here in Europe. They don't even eat tacos in Spain. You have to go to a restaurant that specializes in Mexican food. I've eaten them only once in my whole life. When it comes to fast food options, kebabs are probably the most popular here, but there's a lot of burger and pizza joints as well. I honestly don't know if people here eat more pizza or kebabs, but it has to be close.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 09, 2023, 10:36:07 PM",
      "body": "Quote from: Hispo on November 09, 2023, 04:31:06 PMQuote from: OgNasty on November 09, 2023, 11:53:41 AMInteresting to hear that Taco Tuesday is an American thing. I had no idea. It is big here though. For example, the place I go usually sells tacos for $3.99, but they sell them on Tuesdays for $1.79 which usually results in a line around the lot. The tacos are quite basic though. Typically just beef, cheese, and lettuce with a side of hot sauce.I have always assumed it was a custom from.the United States, for reference I am from Venezuela and here we do not have any custom about eating specific sort of food depending on the day of the week, it only happens when we celebrate very known seasons or holidays, like Eastern, Christmas, etc. I have also read and seen on Television that American Highschool also have their own version of Taco Tuesdays. By the way, for that price obviously any taco you get would be simple, but getting a couple of tacos as lunch for a little bit over 3 Dollars sounds quite reasonable. It would the the sort of thing people would try to get here, in order to save money. Ya, saving money is probably why Taco Tuesday has become insanely popular here recently. The taco place I go to just actually raised their Taco Tuesday prices from $0.99 to $1.79 (Bidenflation) and it’s still a huge deal. I get 3 every Tuesday and it comes out to $5.84 after taxes. That’s about how much I usually tip the DoorDash delivery guy…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 09, 2023, 11:58:23 PM",
      "body": "I miss them as with diabetes I can't eat wheat products.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "November 10, 2023, 08:07:16 PM",
      "body": "Quote from: OgNasty on November 09, 2023, 11:53:41 AMInteresting to hear that Taco Tuesday is an American thing. I had no idea. It is big here though. For example, the place I go usually sells tacos for $3.99, but they sell them on Tuesdays for $1.79 which usually results in a line around the lot. The tacos are quite basic though. Typically just beef, cheese, and lettuce with a side of hot sauce.Here in Europe tacos isn't a thing at all, not even talking about thing like Taco Tuesday. Here you can find proper taco only in Mexican food restaurants, but there is no such restaurants at every corner. Or you can make taco yourself, you can find tortillas at most of supermarkets.I heard about Taco Tuesday's before, but for me it's difficult to understand how it turned into such big thing in America. Regular price $3.99 isn't high, but $1.79 is something extremely cheap, here for such price you only can get something to eat at places like Mcdonalds. But in general, in many European countries kebab is huge thing, it's something similar to Taco, you can find kebab vendors at almost every corner, though, proper kebab costs about $5.00.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chmod755",
      "created_time": "November 12, 2023, 04:25:26 AM",
      "body": "Quote from: coolcoinz on November 09, 2023, 09:48:45 PMWe don't have anything like that here in Europe. Yep, Taco Tuesday is not a thing here. Quote from: LTU_btc on November 10, 2023, 08:07:16 PMBut in general, in many European countries kebab is huge thing, it's something similar to Taco, you can find kebab vendors at almost every corner, though, proper kebab costs about $5.00.Indeed. Turkish food (Döner Kebab) is extremely popular in german speaking countries. I live in a small town, but we have several places selling kebab.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 12, 2023, 06:59:02 PM",
      "body": "Quote from: philipma1957 on November 09, 2023, 11:58:23 PMI miss them as with diabetes I can't eat wheat products.It should not be a problem though, as far as I know the authentic tacos made in Mexican Cuisine are made of corn dough. So, even though you would not been able to buy and eat the highly processed versions which are common in the European and North American market, you can still give a try to 100% corn taco crusts, instead those which are made with processed wheat flour. It may take you some search, but you even try to prepare tacos with won't even have any negative impact on your heath.  I have been told that authentic tacos like those found in Mexico are better than those you can find in American franchises anyways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 14, 2023, 08:33:39 AM",
      "body": "Quote from: Hispo on November 12, 2023, 06:59:02 PMQuote from: philipma1957 on November 09, 2023, 11:58:23 PMI miss them as with diabetes I can't eat wheat products.It should not be a problem though, as far as I know the authentic tacos made in Mexican Cuisine are made of corn dough. So, even though you would not been able to buy and eat the highly processed versions which are common in the European and North American market, you can still give a try to 100% corn taco crusts, instead those which are made with processed wheat flour. It may take you some search, but you even try to prepare tacos with won't even have any negative impact on your heath.  I have been told that authentic tacos like those found in Mexico are better than those you can find in American franchises anyways. I’ll admit I was a bit confused by this as well because I didn’t think wheat and tacos had anything to do with each other, but I’m no nutritionist. I’m a fan of hard tacos which I believe are as you said mostly corn. As we make our way to another Tuesday I can’t help but feel a hunger growing inside me. Perhaps later today I’ll post a taco picture if I don’t devour them before I remember to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 14, 2023, 10:21:06 AM",
      "body": "Quote from: OgNasty on November 14, 2023, 08:33:39 AMQuote from: Hispo on November 12, 2023, 06:59:02 PMQuote from: philipma1957 on November 09, 2023, 11:58:23 PMI miss them as with diabetes I can't eat wheat products.It should not be a problem though, as far as I know the authentic tacos made in Mexican Cuisine are made of corn dough. So, even though you would not been able to buy and eat the highly processed versions which are common in the European and North American market, you can still give a try to 100% corn taco crusts, instead those which are made with processed wheat flour. It may take you some search, but you even try to prepare tacos with won't even have any negative impact on your heath.  I have been told that authentic tacos like those found in Mexico are better than those you can find in American franchises anyways. I’ll admit I was a bit confused by this as well because I didn’t think wheat and tacos had anything to do with each other, but I’m no nutritionist. I’m a fan of hard tacos which I believe are as you said mostly corn. As we make our way to another Tuesday I can’t help but feel a hunger growing inside me. Perhaps later today I’ll post a taco picture if I don’t devour them before I remember to do so. I suppose it depends wherever he buys his tacos or how prepares them, it is possible some specific recipes add some wheat flour so it helps to get a desired consistency, specially for those who are not very into hard tacos. Feel free so share a picture of them, I am curious how Tuesdays Tacos look like in the United States, but remember to be sure not to include some branding in the pictures, or something similar which would likely be used to try to identify your precise location. Not tacos for me today, just likely some arepa or an empanada. Have you ever tried those?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 14, 2023, 11:04:59 PM",
      "body": "By request, here’s a picture of 3 tacos that I have just eaten and enjoyed immensely. It came out to $5.84 after taxes, which is a hell of a deal. They’re also available in 3 types, shredded beef, ground beef, or chicken. I’ve never tried the chicken before but maybe next Tuesday. I’m also curious what tacos look like and how much they cost in your country if you wanted to post a similar picture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "November 15, 2023, 08:20:01 PM",
      "body": "Quote from: chmod755 on November 12, 2023, 04:25:26 AMIndeed. Turkish food (Döner Kebab) is extremely popular in german speaking countries. I live in a small town, but we have several places selling kebab.Not just German speaking countries, but probably half of Europe - Eastern and Central Europe, Balkans, Nordics maybe.Quote from: Hispo on November 14, 2023, 10:21:06 AMNot tacos for me today, just likely some arepa or an empanada. Have you ever tried those?Never heard about it before, now I googled it and it looks tasty. Would like to try it, but probably I wouldn't find it anywhere near to my location. There is always option to do your own, but I'm not good at kitchen and a bit lazy for it .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "November 15, 2023, 10:16:55 PM",
      "body": "If you've never been to Tijuana you have no idea how awesome tacos can be.I grew up in the northern California Bay Area, were we have many Mexican immigrants (most from the states of Jalisco and Michoacán) so I grew up with above average Mexican food readily available.  However, I just got back from visiting Tijuana for the first time, and I can't believe how awesome the food is there.  Tacos of all types, carne asada, adobada, cabeza, lingua, camarones, and that's just the tacos.  The ceviche was also the most amazing I've ever tasted.I also tried this rare delicacy which is usually only served with a shot of quality mescal:Tacos in Mexico are most commonly served on soft tortillas, I'll take some photos from one of the local vendor in NorCal that serve them the authentic way.In Tijuana a typical taco is about 30 to 35 Pesos, ($1.75 to @2.00 USD)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "November 15, 2023, 11:17:47 PM",
      "body": "Taco tuesday... I guess just another \"San Valentine\", \"Xtmas\", \"Birthay\", \"Black Friday\", like if people needed any more reasons to consume in excess and waste their money and their health. But, now that you say it, I think I actually did eat a crappy Chipotle Mexican Grill taco on Tuesday! But I promise I did not enjoy it and that it was a mere coincidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 15, 2023, 11:58:48 PM",
      "body": "Quote from: DireWolfM14 on November 15, 2023, 10:16:55 PMIf you've never been to Tijuana you have no idea how awesome tacos can be.I grew up in the northern California Bay Area, were we have many Mexican immigrants (most from the states of Jalisco and Michoacán) so I grew up with above average Mexican food readily available.  However, I just got back from visiting Tijuana for the first time, and I can't believe how awesome the food is there.  Tacos of all types, carne asada, adobada, cabeza, lingua, camarones, and that's just the tacos.  The ceviche was also the most amazing I've ever tasted.I also tried this rare delicacy which is usually only served with a shot of quality mescal:Tacos in Mexico are most commonly served on soft tortillas, I'll take some photos from one of the local vendor in NorCal that serve them the authentic way.In Tijuana a typical taco is about 30 to 35 Pesos, ($1.75 to @2.00 USD)I grew up in Nor Cal as well. It is amazing how people there think they have the best of everything when it comes to food. It’s actually quite laughable when you get older and start traveling. I’ve never been to Tijuana, but I live close enough that I’m sure the food isn’t incredibly different. My tacos are irrefutably “white people” tacos though. In my opinion, when it comes to food nothing beats Mexican or Italian. They’re in their own class. Everyone else is just fighting for second tier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "November 16, 2023, 02:21:01 AMLast edit: November 16, 2023, 07:19:54 PM by DireWolfM14",
      "body": "Quote from: OgNasty on November 15, 2023, 11:58:48 PMI grew up in Nor Cal as well. It is amazing how people there think they have the best of everything when it comes to food. It’s actually quite laughable when you get older and start traveling.We have some amazing food in area, but much of the authentic ethnic foods are concentrated is in the south Bay Area.  I've spent some time in places like Fremont, Santa Clara, San Jose...  Each little pocket of those cities has a different ethnic flare, with many authentic restaurants.  Some of the best Thai food I've had was, ironically, not in Thailand but in Freemont California.  In general you're right that people here are can be pretty obtuse about some ethnic foods.Quote from: OgNasty on November 15, 2023, 11:58:48 PMI’ve never been to Tijuana, but I live close enough that I’m sure the food isn’t incredibly different. My tacos are irrefutably “white people” tacos though.I find it different enough from San Diego, lol.  If you care to make a day trip out of it, check out Las Ahumaderas, Tacos El Frank, and La Cevicheria.Quote from: OgNasty on November 15, 2023, 11:58:48 PMIn my opinion, when it comes to food nothing beats Mexican or Italian. They’re in their own class. Everyone else is just fighting for second tier.  Well... I'm partial to Middle Eastern food, but you know, I'm biased.  Unfortunately though, good Middle Eastern food is nearly impossible to find in NorCal (outside of mom's house of course.)  There are delis here and their that get one or two things right, but across the board most of it is shit.Other than that, I can't disagree with you about Mexican and Italian foods, they're staples in my diet.  I don't even think of them in terms of ethnic food anymore, not like other types.  I don't have to be in the mood for a fajita plate, or a plate of spaghetti and a meatball.  It helps that I'm surrounded by great restaurants of both types, and I'm not a bad cook myself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}