{
  "id": "topic_5472566",
  "title": "kioprince",
  "author": "kioprince",
  "created_time": "November 02, 2023, 11:23:22 AM",
  "content": "Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472566",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 02, 2023, 11:43:22 AM",
      "body": "Read the sticky threads on meta and beginners & help.To have knowledge about bitcoin:https://www.coindesk.com/learn/what-is-bitcoin/https://learnmeabitcoin.com/Mastering Bitcoin 2nd Edition - Programming the Open BlockchainMastering the Lightning Network (LN)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 02, 2023, 11:49:44 AM",
      "body": "To learn in this forum you must read. Being an avid reader and a voluminous writer is an added quality. I find learnmeabitcoin.com very easy for anyone to read and understand. Acknowledge what you read about bitcoin; write them down. It'll help you memorize and understand the term for a long time.  Especially, when you follow and contribute to discussions.  Asking questions from what you've learnt would help you stay aloof or ahead of other newbies, who don't practice it. Also don't fail because other members failed; quitting to learn bitcoin. Keep on visiting the forum on your leisure time or day. The categories or boards in the forum should be a simple guide to you in the forum. Often, read the board that interests you. Don't hesitate to look up new bitcoin terms. It'll help you feel among, when discussing about crypto in the forum and beyond.  If you've got closed persons in your neighborhood, you can engage them in a bitcoin conversation. Talking to them about those basic bitcoin information is also a better strategy of fastening your growth here. As these students may ask reasonable questions in the discussion section, between you and them. Which may require that you find more answers here. The forum condones reasonable questions, and, the comments or thread should pass the plagiarism test of the forum. When in search of new bitcoin information, some good social media platforms like Twitter still have writers who post genuine thread on their profile to help educate people on bitcoin. The best other methods of learning bitcoin is through reading bitcoin books like mastering bitcoin. The book will give you upper hand in the tech behind bitcoin and how they all work in line to maintain the security of network. Good luck and welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 02, 2023, 12:12:32 PM",
      "body": "Quote from: kioprince on November 02, 2023, 11:23:22 AM Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.Welcome to the forum, Let's have a start with these i will be dropping for you to take your time and read through, all you needed is the determination for learning, activeness and adhering to instructions.bitcoin historyhttps://bitcointalk.org/index.php?topic=5438353.0Beginners and Help Encyclopediahttps://bitcointalk.org/index.php?topic=5364418.0From the encyclopedia, you could discover more other important aspect of blockchain and bitcoin, also make use of the forum search engine to learn more on other areas of interest already discussed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "November 02, 2023, 12:35:51 PM",
      "body": "Welcome to bitcointalk great platform where many have been made. I am happy you found your way here and I can assure you that you would not regret your coming here. As a new beginner, you would need some guide and directions around so I would recommend you look into this;Bitcointalk.org rules, guidelines, FAQ Unofficial listNewbies - Read before postingThere are other recommendations made by other members as well. You can read them for guidance too.Lastly,  avoid plagiarism and the use of AI here of you do not want to have any issues as the forum policies does not permit such here. Feel free to ask questions here just as you have done so that members would be able to reply you with possible solutions to your plight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "November 02, 2023, 01:16:41 PM",
      "body": "I can only welcome you by saying welcome to this forum. Because it looks like other users have provided what you need to read if you want to learn about bitcoin. And because you are on this forum, you don't need to hesitate to ask whatever you want to know about bitcoin. Even though all the information about Bitcoin has actually been widely discussed and posted on this forum. But I understand that new users sometimes prefer to ask directly. And sometimes learning through discussion and two-way interaction is easier to remember and learn. One thing that is certain is that please do your own research if you want to start investing in anything, including Bitcoin. And please read all the rules in this forum and be more active in this forum while still adhering to the rules which are clearly written on several boards in the top posts which have been deliberately pinned for new users to read.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 02, 2023, 01:45:10 PM",
      "body": "Welcome aboard, Kioprince. So far, some helpful links have been sent to you, but I will also urge you to read Jameson Lopp Bitcoin Resources.  What this forum is greatly against is \"Plagerism.\" If you want to create a topic that is not authored by you, always drop a link to the original content. Punishment for plagerism is banned, and I believe you don't want to face such a situation. Also, never use AI or chat gpt to create topics or make comments; endeavor to contribute organically. Create time and read all the reference articles and threads you have received on this topic, and you will surely gain good knowledge about Bitcoin and the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "November 02, 2023, 01:46:15 PM",
      "body": "Quote from: kioprince on November 02, 2023, 11:23:22 AM Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.You are welcome. Learning bitcoin all depend on your interests and you are at the right place where you can get all the things you need to know about Bitcoin. Learning bitcoin is about interests and if you are willing to know you will definitely get the knowledge you are looking. The forum is a good place to learn bitcoin if you give your time yo learn,  and the forum will give you good Idea how to go the best way about bitcoin.  Doing your own research will also expand your knowledge about bitcoin too, your interest to learn bitcoin is what will determine understanding about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 02, 2023, 02:55:26 PM",
      "body": "Quote from: kioprince on November 02, 2023, 11:23:22 AM Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.[SEPTEMBER UPD.] Beginners & Help Encyclopedia by Ratimov has the links to everything you wanted to know about bitcoin, blockchain, bitcointalk, and more.If you really want to learn then spend more time on reading and also engage in the discussions especially here you asked a query and community members responded so you have to come back here and make a reply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 02, 2023, 04:02:58 PM",
      "body": "Quote from: kioprince on November 02, 2023, 11:23:22 AM Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.First and most important, before you ask, read pinned threads.Charles-Tim gave you some good resources, I only add some more.Awesome BitcoinYoutube of Andreas M. Antonopoulos - author of some Bitcoin books aforementionedBecause you only started, let's watch this playlist firstBitcoin for beginners: Learn the basicsBitcoin information & resources",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "November 02, 2023, 04:13:43 PM",
      "body": "Welcome to Bitcointalk. Check these threads if you have time.Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQNewbies - Read before postingPosting techniqueMerit and rank requirementMake Your Topic Title, Posts More AttractiveTopic Title Style GuideHere are also some links if you wanna learn more of Bitcoin.https://github.com/bitcoinbook/bitcoinbook#chaptershttps://bitcoin.org/en/bitcoin-paperhttps://www.bitcoin.com/get-started/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 02, 2023, 04:21:19 PM",
      "body": "Quote from: DYING_S0UL on November 02, 2023, 04:13:43 PMWelcome to Bitcointalk. Check these threads if you have time.Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQNewbies - Read before postingPosting techniqueMerit and rank requirementMake Your Topic Title, Posts More AttractiveTopic Title Style GuideIt's off topic. OP did not ask about it.QuoteHere are also some links if you wanna learn more of Bitcoin.https://github.com/bitcoinbook/bitcoinbook#chaptersIt's shared above. Please spend some seconds, minutes to read before answering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "November 02, 2023, 05:32:12 PM",
      "body": "Quote from: kioprince on November 02, 2023, 11:23:22 AM Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.I will first say that you should not be overwhelmed and intimidated to be in the presence of people who know better than you concerning bitcoins. I was once like you when I just joined this forum some months back because I joined on recommendation, and since then I can boast that I have greatly learnt a lot and now know better than I did then. Every member of this forum started one day and not everybody started with the knowledge of Bitcoin, some people started not knowing anything about Bitcoin just like me and you, but right now they are doing well for themselves by reason of being committed to always following up activities here. If you follow that pattern of always showing up and reading topics even when you think you do not understand what is going on here, you will soon find yourself to be catching up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "November 02, 2023, 05:50:08 PM",
      "body": "Now you just need to read the link provided by many members above, you can learn from the start about Bitcoin, Blockchain and how the crypto ecosystem works. If you keep learning, you will quickly develop. Beginners will be tested by how consistently they learn new things in the crypto world, if they can be consistent I'm sure everything will be easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "November 02, 2023, 06:42:11 PM",
      "body": "Quote from: tranthidung on November 02, 2023, 04:21:19 PMQuote from: DYING_S0UL on November 02, 2023, 04:13:43 PMWelcome to Bitcointalk. Check these threads if you have time.Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQNewbies - Read before postingPosting techniqueMerit and rank requirementMake Your Topic Title, Posts More AttractiveTopic Title Style GuideIt's off topic. OP did not ask about it.QuoteHere are also some links if you wanna learn more of Bitcoin.https://github.com/bitcoinbook/bitcoinbook#chaptersIt's shared above. Please spend some seconds, minutes to read before answering.Well, I think OP will also ask that later on but as you have said I do agree that it is off topic since OP wanted to know about Bitcoin and other related information regarding to Bitcoin or connected to Bitcoin. My guess why it is shared is because of getting merits but I don't think other forum members are giving merits. That is what I noticed before where many forum members give the same answer to newbies who are asking about what they want and also about merits and then getting merited but now, I think many forum members realized it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 02, 2023, 08:19:35 PM",
      "body": "You are welcome to the forum dear! The search engine is one of the most useful tools that will be of help to you in this forum and I will advise you to make the best use of it. Just take the forum like your Google that has a niche(i.e. that is focused on Bitcoin. It means just like your Google, if you are confused and you need guidance on anything related to Bitcoin and other Bitcoin-related topic, you just search for it and you will be directed to so many threads that have explained them in detail for you. If you follow this process, I bet it won't take time before you become knowledgeable on so many crypto and bitcoin-related topics.Of course, you might have ideas and contributions you want to share with the forum members, you can post them on the forum, and our experienced bosses will through light to it.For your knowledge's sake, make use of these;1. Beginners and Help Encyclopediahttps://bitcointalk.org/index.php?topic=5364418.02. Newbie read before postinghttps://bitcointalk.org/index.php?topic=1689727.0They will give you a very strong foundation in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "November 02, 2023, 08:36:55 PM",
      "body": "Quote from: kioprince on November 02, 2023, 11:23:22 AM Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.Welcome to the forum! Understanding bitcoin is one thing and understanding how this forum works is another so endeavor to read the community rules and guidelines so you don’t break them. I hope you can create time to go through the links provided above, those threads will help you understand more about Bitcoin. I’d advise you learn at your own pace, feel free to ask questions about what you have learnt. I will be looking forward to your next topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "November 02, 2023, 08:51:22 PM",
      "body": "Quote from: Charles-Tim on November 02, 2023, 11:43:22 AMRead the sticky threads on meta and beginners & help.To have knowledge about bitcoin:https://www.coindesk.com/learn/what-is-bitcoin/https://learnmeabitcoin.com/Mastering Bitcoin 2nd Edition - Programming the Open BlockchainMastering the Lightning Network (LN)I think with just these above mentioned and quoted links, you should be good to go with all the preliminary knowledge about bitcoin and cryptocurrencies in general and about the forum, simply don’t plagiarize and whatever writing you aren’t the original writer, please do well to add a reference link as this single act can lead to ban of account, also avoid every firm of scam as I’m sure you wouldn’t find it funny.I will also add that you shouldn’t be in a haste to start making post but rather spend more time in reading the post of others and picking interest in the things you’ve read before jumping to make a respond.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Essential10",
      "created_time": "November 07, 2023, 11:59:41 PM",
      "body": "Your best welcome to this forum.You join popular forums and communities to learn more about Bitcoin.This forum is a good place to learn about Bitcoin.  Here are specially published questions and answers, breaking news, tips and experiences shared. BitcoinTalk is a popular forum about Bitcoin, where administrators, developers and users interact. This forum can help you grow your bitcoin cryptocurrency knowledge. Already submitted a lot of information for you to know about Bitcoin.  As you start focusing on them, you will gradually come to master Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "November 08, 2023, 02:36:54 AM",
      "body": "Quote from: kioprince on November 02, 2023, 11:23:22 AM Just like the topic says, I am a brand new member of this forum and I want to learn. I will appreciate any help I can get on how to know about Bitcoin, how to use it and just anything that can help.First of all I welcome you to this forum. If you have a strong desire to learn, you will surely learn. Since you are here to learn you must learn so you need to post on help and beginners first. Which you have already done. Of course you will get help as every reputable person here comes forward to help newbies. Every big member here is helping the small members and because of them today the small members are moving to better positions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}