{
  "id": "topic_5457094",
  "title": "20kevin20",
  "author": "20kevin20",
  "created_time": "June 21, 2023, 01:30:08 PM",
  "content": "As an initiative to stop this analysis and doxxing BS, I’m looking for the easiest way I can edit all my posts containing suggestions for readers to start using Wasabi or containing links to their docs. Is there a faster route than going through each and every single page of my posts and using CTRL + F to find those containing Wasabi’s name? I have quite a lot of such posts IIRC from when I used to support them heavily and I want them edited ASAP before anyone finds them and starts using their nonsense software.Loyce, save me",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457094",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "June 21, 2023, 01:33:28 PM",
      "body": "Check this one[1] from ninjastic.space of tryninja, access the post link and manually delete them as i don't know if there is a bot of deleting multiple posts. You can edit the content to search on that page then.[1] https://ninjastic.space/search?author=20kevin20&content=Wasabi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 21, 2023, 01:44:13 PM",
      "body": "Quote from: PX-Z on June 21, 2023, 01:33:28 PMCheck this one[1] from ninjastic.space of tryninja, access the post link and manually delete them as i don't know if there is a bot of deleting multiple posts. You can edit the content to search on that page then.[1] https://ninjastic.space/search?author=20kevin20&content=WasabiIt is a great third party tool but you can do it with Forum Search too.Use this page: https://bitcointalk.org/index.php?action=searchSearch for: WasabiMatch all wordsBy user: 20kevin20 Choose a board to search in, or search all: Choose \"Check all\"Options: Show results as messages. This option is important to give your more friendly readable results. You can try results with or without this option.Next step is manually delete those posts or edit them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 21, 2023, 02:12:14 PM",
      "body": "You can use any of the tools suggested above. ninjastic.space which was suggested by PX-Z and the forum search engine which was suggested by tranthidung.Just pay attention to two things.1. ninjastic.space searches for unedited version of your posts. So, if you have edited a post and added the word \"Wasabi\" after the edit, ninjastic.space won't find that post. 2. If you have made multiple posts containing the word \"wasabi\" in a single thread, the forum search tool will display only one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 21, 2023, 07:55:32 PM",
      "body": "Quote from: 20kevin20 on June 21, 2023, 01:30:08 PMAs an initiative to stop this analysis and doxxing BS, I’m looking for the easiest way I can edit all my posts containing suggestions for readers to start using Wasabi or containing links to their docs. Is there a faster route than going through each and every single page of my posts and using CTRL + F to find those containing Wasabi’s name? I have quite a lot of such posts IIRC from when I used to support them heavily and I want them edited ASAP before anyone finds them and starts using their nonsense software.You will have to do this manually, but searching all your posts with word Wasabi should be easy with Ninjastic website, than you have to edit all of them.I honestly don't see any valid reason to do something like this, for me it's waste of time and your opinions can change in time.You can't go back in past and change your thoughts from younger age, and changing the whole  flow of conversation in bitcointalk forum is also not good.For example, If I liked potatoes in 2018, it wouldn't be good for me to edit all my posts from 2018 and say I hated potatoes back than.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "June 21, 2023, 08:33:27 PM",
      "body": "Maybe I'm missing something, but what's exactly wrong with Wasabi wallet, I didn't hear anything. Can you give some context?As already posted above, you can find all posts with key word in automated way, but you will have to edit it manually. Well, it's good that there is not that many posts you made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "June 21, 2023, 10:12:21 PM",
      "body": "How are you going to convince Ninja or anyone else who has archived your posts to also remove your posts from their services?People are now asking what it is, so you've put a spotlight on the subject.If it was a signature campaign, are you going to refund the campaign payments you received?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 21, 2023, 10:20:27 PM",
      "body": "Quote from: LTU_btc on June 21, 2023, 08:33:27 PMMaybe I'm missing something, but what's exactly wrong with Wasabi wallet,<snip>The discussion has been occuring on some different threads but you can follow the discussion from their office ANN thread on the forum - https://bitcointalk.org/index.php?topic=5286821.700On that page you would be able to get a feel of the previous discussions and follow it up.It's basically about them using analysis to try and decipher who is mixing through their coinjoining services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "June 21, 2023, 11:05:09 PM",
      "body": "Quote from: PX-Z on June 21, 2023, 01:33:28 PM[1] https://ninjastic.space/search?author=20kevin20&content=WasabiJust 27 threads in which he has posted about wasabi, it could even be less, so manual editing is doable even within a couple of hours. I don't think a post editing bot is even necessaryQuote from: Timelord2067 on June 21, 2023, 10:12:21 PMHow are you going to convince Ninja or anyone else who has archived your posts to also remove your posts from their services?Do Ninjastic archived posts also show up on a search engine's search results when someone tried to search about a certain topic?If not, then I don't think it would be necessary to request them to delete the posts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 22, 2023, 07:33:22 AM",
      "body": "Quote from: logfiles on June 21, 2023, 11:05:09 PMQuote from: Timelord2067 on June 21, 2023, 10:12:21 PMHow are you going to convince Ninja or anyone else who has archived your posts to also remove your posts from their services?Do Ninjastic archived posts also show up on a search engine's search results when someone tried to search about a certain topic?If not, then I don't think it would be necessary to request them to delete the postsThis is a non-issue, because Google doesn't index Ninjastic individual posts. The only people who are going to be looking at Ninjastic posts are detectives.Quote from: Upgrade00 on June 21, 2023, 10:20:27 PMQuote from: LTU_btc on June 21, 2023, 08:33:27 PMMaybe I'm missing something, but what's exactly wrong with Wasabi wallet,<snip>The discussion has been occuring on some different threads but you can follow the discussion from their office ANN thread on the forum - https://bitcointalk.org/index.php?topic=5286821.700On that page you would be able to get a feel of the previous discussions and follow it up.It's basically about them using analysis to try and decipher who is mixing through their coinjoining services.More accurately, their \"official statement\" is that they will make a blacklist with such analysis in order to prevent \"criminals\" from participating in the coinjoins with their own UTXOs (blows my mind how that's even possible because CoinJoins make your UTXOs anonymous already!)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 22, 2023, 01:41:12 PM",
      "body": "Making use of the ninjastic thread will go along way by searching through your post made using the keyword there but as Timelord2067 already mentioned, how are you going to prevent or avoid the tags on your post on thesame subject matter on other profiles and threads on the forum, i think the best way is to move on of we can't adjust the hands of time and never look back on it again, fine and good editing or deleting could perfectly work for you but your tags, reference, links on others remain undealt with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 22, 2023, 06:52:46 PM",
      "body": "Quote from: PX-Z on June 21, 2023, 01:33:28 PMCheck this one[1] from ninjastic.space of tryninja, access the post link and manually delete them as i don't know if there is a bot of deleting multiple posts. You can edit the content to search on that page then.[1] https://ninjastic.space/search?author=20kevin20&content=WasabiAs per the results of this search OP made 27 posts which contains the word Wasabi in it so it's not going to take that long to edit the 26 of them.But here is the catch if someone who quoted those posts already then it's going to be there unless the person edit that so I suggest do take things too deep just let the users to gain the information on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "June 23, 2023, 02:27:13 AM",
      "body": "Quote from: Findingnemo on June 22, 2023, 06:52:46 PMBut here is the catch if someone who quoted those posts already then it's going to be there unless the person edit that so I suggest do take things too deep just let the users to gain the information on their own.Newbies won't really visit multiple pages in old threads. And I rarely find quoted posts also indexed by google search.Also, the OP is trying to change his own suggestions about wasabi. I don't know what the actual critical level is if the suggestions are made by other people so they need to change them too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "June 23, 2023, 06:18:20 AM",
      "body": "Quote from: rat03gopoh on June 23, 2023, 02:27:13 AMNewbies won't really visit multiple pages in old threads. And I rarely find quoted posts also indexed by google search.Forum search option indexes quoted posts just as regular posts but they would be attributed to the user who quoted them until you click on the message.If the OP edits all posts they made it would still be on the different archives made by users but not through a google search.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}