{
  "id": "topic_5428750",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "December 14, 2022, 09:35:23 PM",
  "content": "QuoteThe cost of produce in the U.S. is continuing to rise as crops dwindle from increasing levels of climate change.Vegetable prices in the U.S. are around 40% higher this year and experts are saying climate change has played a prominent role. Bloomberg is reporting that Arizona produces 90% of leafy greens in the U.S. from November through March each year, but crop production has been greatly affected this year by a drought forming from reduced water levels in the Colorado River.The decreasing amount of snow and rain has dwindled in recent years, moving into its 23rd year of drought, causing the Colorado River to shrink, according to research by Nature Climate Change.The U.S. announced it plans to withhold about one-fifth of the water next year that’s given to Arizona’s farmers as climate change and the drought impact the Colorado River.Meanwhile, California is known as the top state in the U.S. for agriculture but has faced severe droughts this year, resulting in $3 billion worth of losses, and after Hurricane Ian and Hurricane Nicole made landfall in Florida, it cost the produce industry nearly $2 billion across the state.The loss in agriculture has prompted a rise in retail prices across the U.S., helping to drive inflation costs to the highest levels in 40 years. “There’s just not enough water to grow everything that we normally grow,” Don Cameron, president of the State Board of Food and Agriculture, told the Times of San Diego.The cost of produce was up by 38.1% in November from the previous month, and the producer price index, which measures what companies are paid for their products, increased by 0.3% in November compared to the previous month, and increased 7.4% from a year ago, according to the U.S. Bureau of Labor Statistics.Scientists have warned against climate change for decades, saying increased global temperatures will bring about extreme and unusual weather changes. The National Oceanic and Atmospheric Administration reported as of October of this year, there have been more than a dozen weather or climate disaster events, resulting in over $1 billion in losses in each instance. “Every year the farmers who feed our nation get smarter and more resilient, but it’s increasingly stressful to adapt to the extreme variability they face,” Erica Kistner-Thomas, with the U.S. Department of Agriculture’s National Institute of Food and Agriculture, told USA Today. She added, “One year they’ll have the best year ever and then the next year they’ll be hit with a major flooding event or drought.”Paul Mitchell, a professor of agriculture and applied economics at the University of Wisconsin, Madison told the outlet although “crops are more resilient to dry weather than they were 20 years ago,” as the events devastating crops become more frequent, crops won’t be able to adapt quickly enough.“U.S. agricultural productivity is rising, but it’s not becoming more resilient to extremes,” Mitchell said and questioned, “When bad years start to line up, are we doing things to prepare for the unusual as it becomes more usual?”https://gizmodo.com/food-prices-climate-change-inflation-drought-1849883609....Its still not too late to get in on agriculture HODL.QuoteThe cost of produce was up by 38.1% in November from the previous monthIf it was possible to buy and hold produce, investment holdings could conceivably appreciated in value 38% in roughly 31 days.Unfortunately, produce is a perishable commodity which makes it difficult to hold over the long term. Investors have access to futures contracts can allow them to HODL agriculture sectors if they believe prices will rise. This is the typical approach for wealthier investors.What options do those with less disposable income have? A pack of seeds can cost as low as $5 which could conceivably allow for percentage interest on gains within an entry level setting. If it is possible to grow $50 of food from a $5 pack of seeds, then in theory 10x return on investment becomes possible. Another approach could be for stablecoins pegged to the value of agriculture commodities. For example, if there was a theoretical crypto token called potato coin, which guaranteed it could be exchanged for 5 potatos. Said crypto token could be pegged to the value of potato commodities. This could be useful in various circumstances. Can anyone guess how?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428750",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "December 15, 2022, 02:15:31 AM",
      "body": "This makes me think whether the solution to water scarcity in the future will depend on our Desalination capacity (turn water from the ocean into potable water).If I recall correctly, it is a process which consumes a big quantity of energy but it may be worth a shot to industrialize it, ideally using renewable energy or nuclear energy. It would be also productive to use that obtained water efficiently, I have read some articles on how watering plants is better at night, since the evaporation rates are slower, for obvious reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karmamiu",
      "created_time": "December 15, 2022, 03:37:58 AM",
      "body": "Quote from: Hispo on December 15, 2022, 02:15:31 AMThis makes me think whether the solution to water scarcity in the future will depend on our Desalination capacity (turn water from the ocean into potable water).If I recall correctly, it is a process which consumes a big quantity of energy but it may be worth a shot to industrialize it, ideally using renewable energy or nuclear energy. It would be also productive to use that obtained water efficiently, I have read some articles on how watering plants is better at night, since the evaporation rates are slower, for obvious reasons. This'll be a large scale project that every country should be in. Polution is already seeping in each corner of this planet, and I could say based on my experience here in my country that crops are very hard to grow unlike before. It could only be said that agriculture is on a huge crisis right now, we even have several plots of land cultivated before for mud pond but it all dried up. Lots of farmers here in my country now opted to working and adapting to tech society because of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 15, 2022, 04:05:45 AM",
      "body": "I'm not a fan of issuing a coin out of everything. I think the time for tokenization has already passed. The year 2017 was the year when everything was tokenized, from banana to taxi, to tickets, to freelancing, to songs, to Trump and Beiber, to boobs, to Jesus, and everything else under and beyond the sun. And, yes, there's already POTATO and POTATOZ and, of course, Potcoin, and anything you can think of.But I agree there's indeed money in HODLing agricultural produce. If only they're not perishable. But thanks God they're perishable. This HODLing is basically hoarding and it might really be bad. As a matter of fact, despite being perishable, there are issues arising every now and then here in my country of hoarding agricultural products to manipulate the supply and, therefore, the price. Right now, in fact, red onions is getting very expensive that day-to-day dishes of ordinary people don't use them anymore. I'm afraid many are sacrificing how their food tastes just to save a good deal. Accordingly, one of the reasons for this are syndicates hoarding this specific agricultural product. So perhaps instead of making profit out of this, why don't governments just address this problem? A senator here, who is also the chairperson of the senate committee on agriculture, just brush the issue off by saying she can live without onions. I mean, is that it? Is that how the soaring prices of agricultural products are addressed? Why not programs and all kinds of initiatives?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "December 15, 2022, 04:20:32 AM",
      "body": "Quote from: Hydrogen on December 14, 2022, 09:35:23 PMVegetable prices in the U.S. are around 40% higher this year and experts are saying climate change has played a prominent role. Bloomberg is reporting that Arizona produces 90% of leafy greens in the U.S. from November through March each year, but crop production has been greatly affected this year by a drought forming from reduced water levels in the Colorado River.this is the reason why technology plays such an important role in overcoming crop failures like this .. with technology we can manipulate the weather and grow crops without worrying about crop failure or pest attacks .. even though developing this kind of technology is quite expensive, but in the long run it will really worth it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 15, 2022, 04:43:14 AMLast edit: December 15, 2022, 05:02:38 AM by franky1",
      "body": "though rainfall is low.. what you are also finding is the stupid politics of the water authority that gives out water \"quota's\" to counties, which the water authorities has for years been pretending more water exists than actually available to ensure california gets a nice amount of quota for water that does not existhowever because it awarded quota's to states that then divide it up to counties that then divide those quotas to farmers, where those farmers dont want to lose those quota's rate next year and so they have to fully use up their water amount this year to retain that rate. (it doesnt benefit them to save water) so they plant silly produce like nuts and avocado's that waste more water. just so they can use up their quota to retain their quota rate for the next year.. this leads to more water being sent to upstream counties which then means by the time the river flows down stream there is less water left.3 months ago. the water authority demanded cuts to the quotas for ONLY arizona and nevada.. meaning good old california get to have as much as they want(quotad to have)this meant that the cut to the quota's left some farmers with less water. in arizona. yet the californian vineyards got to keep making their wine without exclusionshttps://youtu.be/cp1ST9MxDcY?t=147in shortnevada had to cut back to give more to califorina so that california can keep going, but meant arizona had to cut back as there were obligations that there needed to be some water left south of arizonaits funny how they say nevada and arizona are experiencing a drought of the colorado of decades .. yet california only 3 years.. and lets not get started on the fact that nevada, california and arizona are naturally desert states, where by there is a stupid over population of people on land that meant to be uninhabitable naturallygotta love how the water agencies shuffle quotas around to give favourable amounts to certain locations and unfavourable limits to others OF THE SAME RIVER, and then say \"blame climate\"if they for the last 2 decades actually measured water yields of reservoirs and then done a proper % split of amount per state. they might actually have had a better share and used less over all to keep some of the reservoir water locked in. instead of sending it all to california to grow nuts and avocadosits basically 80% bad math of quotas cause and 20% due to less rainfull to cover the bad math up",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 15, 2022, 04:08:40 PM",
      "body": "Quote from: Hydrogen on December 14, 2022, 09:35:23 PMWhat options do those with less disposable income have? A pack of seeds can cost as low as $5 which could conceivably allow for percentage interest on gains within an entry level setting. If it is possible to grow $50 of food from a $5 pack of seeds, then in theory 10x return on investment becomes possible. How about you go back to one of your countless threads in which you ask yourself this identical question - or show us with your own example how this whole operation, which we can call \"from seed to product\" works in practice? In the whole thing, you forget how much time, effort and knowledge you need to invest in producing $50 worth of food from $5 seeds - not to mention the costs of fertilizers, crop protection from diseases, water and protection from the sun, hail and wind.Quote from: Hydrogen on December 14, 2022, 09:35:23 PMAnother approach could be for stablecoins pegged to the value of agriculture commodities. For example, if there was a theoretical crypto token called potato coin, which guaranteed it could be exchanged for 5 potatos. Said crypto token could be pegged to the value of potato commodities. This could be useful in various circumstances. Can anyone guess how? Again, I ask you to show with a concrete example the famous tokenization of everything in the world, including tomatoes? These are crazy ideas that lead to nothing but the downfall of anyone who would try something like that - haven't we established that countless times already, should I post links to all the threads in which you present such ideas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "December 15, 2022, 06:21:35 PM",
      "body": "Quote from: Lucius on December 15, 2022, 04:08:40 PM#1 How about you go back to one of your countless threads in which you ask yourself this identical question - or show us with your own example how this whole operation, which we can call \"from seed to product\" works in practice? #2 Again, I ask you to show with a concrete example the famous tokenization of everything in the world#1  I have done it. But rather than sell for profit, I wound up eating my produce instead. What would you like to know about it? Do I get credit for predicting the price of agriculture was going up and recommending others invest in the sector? #2  You shouldn't have to ask for information or examples, you should already know the answer. I'll give you one example:https://bitcointalk.org/index.php?topic=5423456.msg61353854#msg61353854There you see the african nation of ghana choosing to make oil payments in gold rather than its native currency the ceti. Making payments in gold allows it to avoid inefficiencies and losses due to inflation.The same could be said of stablecoins pegged to agriculture. Buying potatos in a stablecoin pegged directly to the commodity would make it possible to circumvent inflation virtually identical to ghana using gold to avoid inflation on their own native currency. A stablecoin pegged to 5 pounds of potatos is the same no matter which direction inflation trends. Which could be useful for protecting the cost of agricultural produce from inflation. However, a stablecoin like this would not be protected from trends in supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 16, 2022, 07:01:52 PM",
      "body": "And when people talk about climate change, many people think that it's a fud and not a real thing. This is it, the bone dry California, the monsoon rains in Florida, the Chinese weather, the Ukraine war, and all the things in between.Just because there is a global warming, do not think that it's only about warning, it's about cold being too cold, and hot being too hot that is why they changed it to climate change instead of global warming so people would understand. The prices will soar even more, and weather will be even worse, and drinkable water will be even more hard to find, that is all we can do right now and nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 16, 2022, 07:48:55 PM",
      "body": "Quote from: Hispo on December 15, 2022, 02:15:31 AMThis makes me think whether the solution to water scarcity in the future will depend on our Desalination capacity (turn water from the ocean into potable water).If I recall correctly, it is a process which consumes a large quantity of energy but it may be worth a shot to industrialize it, ideally using renewable energy or nuclear energy.It would be also productive to use that obtained water efficiently, I have read some articles on how watering plants is better at night, since the evaporation rates are slower, for obvious reasons.The problem of water desalination is one of the most important in today's world. One of the main problems is that most of the desalination technologies consume a lot of energy.So far, there are no highly efficient / high-performance technologies for water purification / desalination, without supplying large capacities.But the light of a solution loomed on the horizon - thermonuclear energy! Just a couple of days ago, very positive information appeared that it was possible to get a controlled, controlled reaction, with 120% of the output energy in relation to the expended. If this technology is transferred to commercial operation, the issue of desalination will be instantly resolved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 16, 2022, 08:30:40 PM",
      "body": "Quote from: Hydrogen on December 14, 2022, 09:35:23 PMAnother approach could be for stablecoins pegged to the value of agriculture commodities. For example, if there was a theoretical crypto token called potato coin, which guaranteed it could be exchanged for 5 potatos. Said crypto token could be pegged to the value of potato commodities. This could be useful in various circumstances. Can anyone guess how? I don't know what a potato farmer can gain from a cryptocurrency called Potato Coin? In the end, the farmer is interested in converting the value of the potatoes into dollars, so who will determine how much this crypto token is worth?I do not know how things are going there in the United States, but here in my country it is not the farmers who determine the price of potatoes, nor even the government, but the brokers!!!The broker is the one who buys potatoes from the farmer and sells it to the consumer at the price that he determines. He earns much more than the farmer and does not care about the farmer's real production cost and how much he paid for water, fertilizer, workers, and so on.The farmer here only earns a little for all the effort and money he spent on producing potatoes, while the broker gets the biggest profit without any effort!!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 16, 2022, 10:41:48 PM",
      "body": "My country is also experiencing these global challenges, especially in the Lake Chad Basin which has led to bloody conflicts and food crisis. It is the role of the government to ensure that these farmers have access to water because not doing that would cause the scarcity of essential food crops. Drilling of water boreholes in farms could also help in the course of searching for water sources. Perishables like vegetables are very easy to plant and maintain which makes it a potential garden plants. Creating awareness on the need to plant few vegetables in family gardens might also help reduce the cost of these plants. The rise in population has increased the rate of urbanization in some countries. Which have led to using farmlands for housing projects. Home gardens even in rooftops could be an important practice that can enhance household nutrition and food security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 16, 2022, 10:42:01 PM",
      "body": "The US is not the only one experiencing these extreme price rises in vegetables recently. Here in the Philippines, the cost of onions soared over 200% within the last 6 months, and even though crop farming is good since there aren't that much typhoons that devastated the farmlands that produce these things, the gov't can't do something about the price of the produce and have just suggested people to be 'thrifty' in any way they can. Other greens such as cabbage and lettuce have also experienced price increases over the months, although not as harsh as onions and chilis but you can feel it in your pocket. Imagine trying to be healthy and eat healthy, but the prices of green produce which should be a cheap and viable option is now more expensive than chicken, pork, and beef per kilo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 17, 2022, 01:16:28 AM",
      "body": "Quote from: Hydrogen on December 14, 2022, 09:35:23 PMWhat options do those with less disposable income have? A pack of seeds can cost as low as $5 which could conceivably allow for percentage interest on gains within an entry level setting. If it is possible to grow $50 of food from a $5 pack of seeds, then in theory 10x return on investment becomes possible. its not a 10x on investmentthat pack of seeds contains say 20 seeds that are viableyes they may produce more then a yield of tomato's that are equivalent to the retail grocery store of $50 of tomato's..but those 20 tomato plants end up needing a litre of water a day per plant(i too grew tomato plants on my balcony. they do love water)the cost per cubic metre of water and the couple months of maintenance time eats into the $50 value equivalent of retail bought tomato'sin short although you yielded more then $50 of retail yield of tomato's. it cost YOU more then $50 of water/maintenance to get that $50 retail yield. which means you were operating at a loss.. though i gotta admit ;grow your own' are a better tasting loss than the taste of the bland retail tomato's",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "og kush420",
      "created_time": "December 18, 2022, 10:24:47 PM",
      "body": "Quote from: dothebeats on December 16, 2022, 10:42:01 PMThe US is not the only one experiencing these extreme price rises in vegetables recently. Here in the Philippines, the cost of onions soared over 200% within the last 6 months, and even though crop farming is good since there aren't that much typhoons that devastated the farmlands that produce these things, the gov't can't do something about the price of the produce and have just suggested people to be 'thrifty' in any way they can. Other greens such as cabbage and lettuce have also experienced price increases over the months, although not as harsh as onions and chilis but you can feel it in your pocket. Imagine trying to be healthy and eat healthy, but the prices of green produce which should be a cheap and viable option is now more expensive than chicken, pork, and beef per kilo.  That is correct - in our country the prices of vegetables have increased to the extremethe poor community is so upset that for them it is very difficult for them to purchase the vegetables at such high prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 19, 2022, 09:04:35 AM",
      "body": "Quote from: Hispo on December 15, 2022, 02:15:31 AMThis makes me think whether the solution to water scarcity in the future will depend on our Desalination capacity (turn water from the ocean into potable water).Unfortunately that is extremely harmful to the environment and the cost isn't that low either. It destroys the local fish and other sea animals' life (so it also ruins fishing market) and the remainder salt and other impurities has to be disposed usually in the middle of the sea which is costly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 19, 2022, 10:20:53 AM",
      "body": "Quote from: pooya87 on December 19, 2022, 09:04:35 AMQuote from: Hispo on December 15, 2022, 02:15:31 AMThis makes me think whether the solution to water scarcity in the future will depend on our Desalination capacity (turn water from the ocean into potable water).Unfortunately that is extremely harmful to the environment and the cost isn't that low either. It destroys the local fish and other sea animals' life (so it also ruins fishing market) and the remainder salt and other impurities has to be disposed usually in the middle of the sea which is costly.Yes, number one factor is the cost.Here, even the cost of onions, has exceeded as well and so as other vegetables, I'm from Asia so it's doesn't make sense but then again, due to climate change, (we are in December, and around this time, there should be no rain, but we experience occasion rain pour which is very uncanny at this time of the year).And going back to onions, I remember I have planted a good amount, maybe more than 10 years ago, but that it was a bad timing  as the market was over saturated and lost my investment. And thinking now that we have shortage? Time really change for the worst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nhazwrath",
      "created_time": "December 19, 2022, 11:01:50 AM",
      "body": "Oh look,  Moar fear pron. Wait until you learn that Only 10,000 years ago we still had giant ice sheets in the north.   And the great lakes were pretty close to 1 great lake instead of 5.  why?  natural climate change. I am still waiting on that extreme weather from the 80's (acid rain)that didn't happen.. Missing Ozone layer...also didn't happen... or the ice free arctic from the 2000s that didn't happen.  Or that fact we are all dead from net neutrality...(I know, its not climate related...  or is it?)  And on and on and on.   Facts never once mentioned in articles that deal with Climate change.    What is the primary green house gas?  And in what proportion? (its H2O BTW at about 65% to 85% total greenhouse gases) varies between deserts and oceans.  I can tell you whats its not.   It's Not CO2 (under 0.01% BTW) not even close.  If its not co2 then, the ideas of man made climate change falls flat very quickly.    As a matter of fact it falls in to the realm of children's logic.   \"This is somehow my fault\" and \"Oh...  whats did I do wrong?\"    Remember that grant time article about fusion?  This is the Same thing.   But with climate scientists looking for their continued gravy train of grant money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "December 19, 2022, 11:44:37 AM",
      "body": "Quote from: Moneyprism on December 15, 2022, 04:20:32 AMQuote from: Hydrogen on December 14, 2022, 09:35:23 PMVegetable prices in the U.S. are around 40% higher this year and experts are saying climate change has played a prominent role. Bloomberg is reporting that Arizona produces 90% of leafy greens in the U.S. from November through March each year, but crop production has been greatly affected this year by a drought forming from reduced water levels in the Colorado River.this is the reason why technology plays such an important role in overcoming crop failures like this .. with technology we can manipulate the weather and grow crops without worrying about crop failure or pest attacks .. even though developing this kind of technology is quite expensive, but in the long run it will really worth itMaybe artificial rain technology is important to do at certain times such as very dry droughts, but it is not recommended to do it on a long-term scale because it will affect soil fertility and soil pollution. After all, artificial rain usually contains too much salt.Also, when this technology is implemented on a large scale and continuously, it will affect the hydrological cycle which will endanger the water supply in the soil during the dry season.Maybe all of this happened because farmers in California used this technology several years ago so that agricultural land cannot hold water in it so it dries up easily when the dry season arrives.Quote from: Hispo on December 15, 2022, 02:15:31 AMThis makes me think whether the solution to water scarcity in the future will depend on our Desalination capacity (turn water from the ocean into potable water).If I recall correctly, it is a process which consumes a big quantity of energy but it may be worth a shot to industrialize it, ideally using renewable energy or nuclear energy.  Desalination will be the most effective solution and can be used for the long term, apart from using artificial rain technology, apart from that there are other methods such as drilling water wells to a certain depth, but this must be considered carefully, do not drill carelessly into the ground, otherwise there is a ground reset for drilling, it is better not to drill because it can release more harmful substances from the ground.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 19, 2022, 06:54:48 PM",
      "body": "Quote from: BigBos on December 19, 2022, 11:44:37 AMQuote from: Moneyprism on December 15, 2022, 04:20:32 AMQuote from: Hispo on December 15, 2022, 02:15:31 AMThis makes me think whether the solution to water scarcity in the future will depend on our Desalination capacity (turn water from the ocean into potable water).If I recall correctly, it is a process which consumes a big quantity of energy but it may be worth a shot to industrialize it, ideally using renewable energy or nuclear energy.  Desalination will be the most effective solution and can be used for the long term, apart from using artificial rain technology, apart from that there are other methods such as drilling water wells to a certain depth, but this must be considered carefully, do not drill carelessly into the ground, otherwise there is a ground reset for drilling, it is better not to drill because it can release more harmful substances from the ground.What harmful substances you mean, Radon?Also, I do not think drilling for water is the best solution because it cannot be a long time solution for the a constant increase of the demand for fresh water, those wells can dry out and the impact of those empty water reservoirs underground can be dangerous for the structures placed on the surface, entire buildings could start to sink, resulting in millions of dollars in damages.Even though, desalination uses a lot of energy I still believe it is one of the best potential solutions we have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}