{
  "id": "topic_5453209",
  "title": "Y3shot",
  "author": "Y3shot",
  "created_time": "May 18, 2023, 03:09:03 PMLast edit: May 19, 2023, 06:00:02 PM by Y3shot",
  "content": "I have heard lot of complains from users in the forum, so many complains all the times and I had to make findings about 1xbit outside the forum to be sure if they are what people complain about them in the forum but I still found more complains even outside the forum. This means 1xbit have already decides to continue in their way of how they do things despite the degree of complains all the time, 1xbit is not ready to work on their reputation from bad to good.And I still see some members working with 1xbit , this is very risky. If 1xbit decides not to pay their participants as they are not straight forward company can their participants come out boldly to complain?. And I noticed members working with 1xbit will receive negative trust that can not be reverse and will also limit them from working with other casinos in the forum, this is nothing but slavery by remaining stagnant and to stick to them forever promoting scam.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453209",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "May 18, 2023, 03:33:27 PM",
      "body": "Scams are not moderated here so that is why they are still operating in the forum and promoting their site via people called signature campaign.They have already negative tag under their name and known for their scamming behaviour so even if the campaign participants comes out and buzz they didn't get paid for their participation of promotional campaign there is no change for them because their reputation is already ruined so anyone who is promoting is doing at their own risk and am sure they are well aware of it as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 18, 2023, 04:37:21 PM",
      "body": "Quote from: Findingnemo on May 18, 2023, 03:33:27 PMScams are not moderated here...I wonder why that's still so till date. I think it's time that got reviewed.Quoteeven if the campaign participants comes out and buzz they didn't get paid for their participation of promotional campaign there is no change for them because their reputation is already ruined...Those whose accounts got red tagged two or three years ago know what the disadvantages of joining in such a scam tagged campaign are and how they can't find a different campaign thereafter. For those who are rushing into it now, I can only say they shouldn't jeopardize their account by joining. Steer clear of such. Scam is a serious issue here even though it's not regulated and I honestly don't know why it's that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "May 18, 2023, 05:10:57 PM",
      "body": "Quote from: Mpamaegbu on May 18, 2023, 04:37:21 PM...Scam is a serious issue here even though it's not regulated and I honestly don't know why it's that way.Not to burden moderators with undue responsibility: how should they decide if something is scam or not? And if they'll make a mistake? Users will blame forum for not protecting them from what they'll think moderators should do. So scam is not moderated.But there is a kind of decentralized Trust system where users decide if there is scam and leave reviews on scummers or on reputable users. So you have a way of escaping scam being warned by others. Trust system is based on a consensus, so no one can usurp it by one self and also no one bears all responsibility. Take a part in it, form your trust list, leave reviews on others who deserve it. That's how scam is being fought on this forum.And a couple of quotes of theymos:Quote from: theymos on February 07, 2011, 05:24:25 AMI, for one, am glad that the forum has not become ruled by authoritarian moderators (as most forums are). The ideals of libertarianism should be extended to moderation as much as possible: everyone should be free to express any idea unless doing so infringes on the equal right of others.The idea expressed in the OP was given an accurate title, and it is in the correct section. Neither Sirius nor Satoshi (bitcoin.org operators) have expressed a desire to filter potentially-illegal content. Therefore, the topic is OK. Use your own brain to determine whether the offer is a scam....Quote from: theymos on March 12, 2012, 08:45:48 PM...The forum doesn't arbitrate disputes or handle justice. These are messy, complicated issues unrelated to forum moderation. Other people should independently handle these things. The scammer tag is designed to be the least-severe reasonable response to scamming. If I could do less in this area, I would....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tumanggor",
      "created_time": "May 18, 2023, 05:57:11 PM",
      "body": "Quote from: Y3shot on May 18, 2023, 03:09:03 PMI have heard lot of complains from users in the forum, so many complains all the times and I heard to make findings about 1xbit outside the forum to be sure if they are what people complain about them in the forum but I still found more complains even outside the forum. This means 1xbit have already decide to continue in their way of how they do things despite the degree of complains all the time, 1xbit is not ready to work on their reputation from bad to good.And I still see some members working with 1xbit , this is very risky. If 1xbit decides not to pay their participants as they are not straight forward company can their participants come out boldly to complain?. And I noticed members working with 1xbit will receive negative trust that can not be reverse and will also limit them from working with other casinos in the forum, this is nothing but slavery by remaining stagnant and to stick to them forever promoting scam.if you have a problem with your account then include evidence then contact the support team available on the siteI also highlight about you offending the campaign participants, to be honest, it's a must that we are prepared with the potential of not getting paid (so far the team is very professional with signature campaign payments), getting red flags or something, this is an amazing forum and the moderators keep the quality of this forum wellhave a nice day, best regard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 18, 2023, 06:03:31 PM",
      "body": "Quote from: Mpamaegbu on May 18, 2023, 04:37:21 PMI wonder why that's still so till date. I think it's time that got reviewed.there are many reason. first of all, it's likewise impossible stay updated on ALL scams that are posted / conducted here on forum. daily you can find hundred of complaints, ponzi scheme, accusation and everything related the scam.they can't investigate all scam proposed (maybe some site is just suspicious, so it will required a lot of effort)...but moreover what if some group of people decide deliberately to attack a service /site providing fake info?  moderators should check by themself a service or just trust some users? well, this is the reason moderators doesn't act in such diatribe and there is a trust system that it's something really useful for everyone on forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "May 18, 2023, 06:57:08 PM",
      "body": "Quote from: Y3shot on May 18, 2023, 03:09:03 PMAnd I still see some members working with 1xbit , this is very risky. If 1xbit decides not to pay their participants as they are not straight forward company can their participants come out boldly to complain?. And I noticed members working with 1xbit will receive negative trust that can not be reverse and will also limit them from working with other casinos in the forum, this is nothing but slavery by remaining stagnant and to stick to them forever promoting scam.I've tagged many 1xbit participants as a basis for my concern for other users. Every forum user should be aware that 1xbit is a gambling platform that has earned a bad reputation due to its scams, and everyone should pay attention to the trust page of each of its campaign participants to avoid being scammed.Every participant in their campaign probably knows what the risk is [negative tag - not paid] but this is not a forum issue. The only problem forum have about campaign participants is when all of their participants spam the forum heavily. If this happens then the campaign can be stopped and the participant banned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "May 18, 2023, 07:06:37 PM",
      "body": "Quote from: Y3shot on May 18, 2023, 03:09:03 PMAnd I noticed members working with 1xbit will receive negative trust that can not be reverse and will also limit them from working with other casinos in the forum, this is nothing but slavery by remaining stagnant and to stick to them forever promoting scam.1xbit has known this forum for so long, so we really don't know how much of their team is hanging around here and we don't know how many red trust accounts they manage in their campaign, it could be the BTT accounts you see/participants of their own 1xbit campaign running, by the way they buy btt accounts, that's my assumption.Logically and with reason.1. There are no 1xbit campaign participants complaining about payment, paid or not, if those who manage the btt account are them/the 1xbit team, of course payment is not a problem for them.2. Another piece of evidence, 1xbit manager, has created different accounts many times here, despite the scam warnings. meaning: they know how to manage btt accounts here.3. They don't care about warnings here, they keep doing things that are detrimental to the community here. although, there are a thousand red cat in their profile.From some of the things that I said, now we return to the gamblers themselves on the 1xbit site, there have been many warnings, now the consideration is on the 1xbit users themselves, As far as I know, the members involved in gambling are adults, they should be able to think about what is good and bad for themselves, who knows how many fraud alerts there are, if we ourselves don't care about that, of course we are always trapped in a circle of fraud, no one forces us to gamble, but common sense must be put in front, not knees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 18, 2023, 07:37:53 PMLast edit: May 19, 2023, 09:35:39 AM by CryptSafe",
      "body": "Quote from: YOSHIE on May 18, 2023, 07:06:37 PMQuote from: Y3shot on May 18, 2023, 03:09:03 PMLogically and with reason.1. There are no 1xbit campaign participants complaining about payment, paid or not, if those who manage the btt account are them/the 1xbit team, of course payment is not a problem for them.2. Another piece of evidence, 1xbit manager, has created different accounts many times here, despite the scam warnings. meaning: they know how to manage btt accounts here.As far as I know, the members involved in gambling are adults, they should be able to think about what is good and bad for themselves, who knows how many fraud alerts there are, if we ourselves don't care about that, of course we are always trapped in a circle of fraud, no one forces us to gamble, but common sense must be put in front, not knees.At first, the 1xbet campaign is up and doing because they realize a lot of funds from their scams and fraud. I have no doubt that they would relent because they seems to be well positioned comfortably on this platform without any threat. No admin, no moderator questioning their existence here as to why they should be Promoting scam on this platform.Secondly, I have the feelings that the representative to 1xbet here is a well knowledgeable member probably a well ranked and placed member on board this platform. I see how they handle the campaign and I doubt if truly their representative is not a high ranked member here. To be frank, since I came onboard, I have never heard any  1xbet campaign promoters complain of delay or being owed or any issues  with the casino in terms of discrepancies. Nothing of that nature. What even baffles me is that they keep launching and relaunching new campaigns with no stress and hindrance here.Lastly, it is true that adults are majority of the gamblers there and it is wisely advised to take caution before going into gambling coupled with the series of complaints So therefore as an adult,  it is assumed that you know the good the bad, the ups and downs and all the rights to do but of you pay blind eyes and deaf ears to get entangled, you may likely be in your own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "May 18, 2023, 08:25:10 PM",
      "body": "Quote from: Mpamaegbu on May 18, 2023, 04:37:21 PMThose whose accounts got red tagged two or three years ago know what the disadvantages of joining in such a scam tagged campaign are and how they can't find a different campaign thereafter. For those who are rushing into it now, I can only say they shouldn't jeopardize their account by joining. Steer clear of such. Scam is a serious issue here even though it's not regulated and I honestly don't know why it's that way.What do these accounts do once 1xbit closes up shop? The answer is fade into the background and disappear. They will never find another sig job on the forum unless another site with a bad reputation appears. So ruining your account(no matter the rank) is a silly thing to do. It makes me want to believe the conspiracy that all these accounts are owned by the same farm. @OP I see 1xbit being advertised on a few different sites. I was checking out a couple of my transactions last week on blockchain.com and seen 1xbit had advertisements there as well. So it's definitely not just bitcointalk. The only way we can fight them is by not joining their campaigns, but some have already shown that they value money over morals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 18, 2023, 08:29:00 PM",
      "body": "They have no reason not to pay the people posting. If they stopped that then advertising would fall and they might not get as many people to play there.With all the other places they seem to be having people post referrals and promoting them, there are always other players.Even with the horrible reputation here, we still get new posts about them not paying out because people don't pay attention. https://beaconcha.in/   <- click the play casino button and you see them. And in general that site is not a place where you would expect to see a place with such a bad reputation.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "May 18, 2023, 10:56:08 PM",
      "body": "Quote from: Y3shot on May 18, 2023, 03:09:03 PM And I noticed members working with 1xbit will receive negative trust that can not be reverse Negative trust given by some members is not permanent. As long as the problem that caused it to be given a negative tag is resolved then the tag can be removed at any time by the tag giver.but with the casino scam case, I think it is very unlikely that the casino will improve its reputation. although we see some attempted duping they say they want to fix things.and what the participants take is a decision they have taken at risk. they think about it, either if it doesn't get paid in the future, or the casino just leaves the forum. or account reputation. all of those participants had thought about it and had no problem with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "May 19, 2023, 04:58:35 AM",
      "body": "It's only me who think there's no point about this thread?There are many thread created about 1xbit on scam accusations, reputation, beginners & help and gambling boards, now @OP creating this thread is just somehow advertising 1xbit to make remember with 1xbit again.Yeah 1xbit is scam and the forum will not remove it, now what?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "May 19, 2023, 09:35:24 AM",
      "body": "Quote from: Plaguedeath on May 19, 2023, 04:58:35 AMIt's only me who think there's no point about this thread?There are many thread created about 1xbit on scam accusations, reputation, beginners & help and gambling boards, now @OP creating this thread is just somehow advertising 1xbit to make remember with 1xbit again.Yeah 1xbit is scam and the forum will not remove it, now what?There's still sense on creating this thread since this could refresh the mind of the people forgot about the 1xbit reputation. Its good to discuss such topic like this since they didn't shutdown there service and they also running a signature campaign which can trick newbies to try their casino.Many know that 1xbit is a scam casino so its good to have thread refresher to avoid mistakes commonly happen to newbies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 19, 2023, 10:17:01 AM",
      "body": "Quote from: Pandu Geddon on May 18, 2023, 10:56:08 PMQuote from: Y3shot on May 18, 2023, 03:09:03 PM And I noticed members working with 1xbit will receive negative trust that can not be reverse Negative trust given by some members is not permanent. As long as the problem that caused it to be given a negative tag is resolved then the tag can be removed at any time by the tag giver.but with the casino scam case, I think it is very unlikely that the casino will improve its reputation. although we see some attempted duping they say they want to fix things.and what the participants take is a decision they have taken at risk. they think about it, either if it doesn't get paid in the future, or the casino just leaves the forum. or account reputation. all of those participants had thought about it and had no problem with it.How many examples do you have of removing negative tags, mate? Almost all members of the 1xbit company previously had a negative tag; these accounts represent people on the forum without any moral rules. Having lied once, a person will lie the next time. I'm not sure if any of the participants with multiple negative tags were puzzled by the task of showing themselves in the best light and dropping their tags.OP, you don't have to worry about these members; they chose their role on the forum. As long as this signature campaign exists, they will spam. If this campaign stops without paying someone, I would call it a fair response to the fact that all these people are going against the rules of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "May 19, 2023, 12:50:58 PM",
      "body": "Quote from: Y3shot on May 18, 2023, 03:09:03 PMSnippedWhy are you so much concerned about this gambling signature campaign, there have been more than enough threads already created on them here and on scam accusation, you could have just locate one and post under than creating another thread constituting to the ones already existing, to me you're only but helping in advertising their brand fornth since the campaign thread, participants and anything that has to do with the campaign were already tagged, that alone is enough in telling those coming across th about whom they are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "May 19, 2023, 01:40:34 PM",
      "body": "Quote from: Y3shot on May 18, 2023, 03:09:03 PMI have heard lot of complains from users in the forum, so many complains all the times and I heard to make findings about 1xbit outside the forum to be sure if they are what people complain about them in the forum but I still found more complains even outside the forum. This means 1xbit have already decide to continue in their way of how they do things despite the degree of complains all the time, 1xbit is not ready to work on their reputation from bad to good.they would not care about the complaints thrown at them. The scam casino does not only advertise on this forum through campaigns. they also do advertising on certain sites. they pay to display their scam casino name to get new members to deposit their money. even some of the victims who complained because they lost money and could not access their accounts at the casino also claimed that they did not know about this forum before. they create an account on the forum to make a complaint. but it will not make the stolen money back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "May 19, 2023, 02:33:52 PM",
      "body": "1xbit  really has bad reputation both on and off the forum. But I am very confused on how they keep getting customers and being patronised. By now everyone should have known that they are dubious and avoid them, but that's not the case. I still believe they would be caught up with time.Quote from: Y3shot on May 18, 2023, 03:09:03 PMAnd I noticed members working with 1xbit will receive negative trust that can not be reverse and will also limit them from working with other casinos in the forum, this is nothing but slavery by remaining stagnant and to stick to them forever promoting scam.Sticking with them forever promoting scam. It is something bad, but it is still about who promotes them and their conscience and system of believe. I am thinking that the promoters of 1xbit might have good accounts here active and decided to condemn the 1xbit account for life with 1xbit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "May 19, 2023, 02:54:28 PM",
      "body": "Quote from: Plaguedeath on May 19, 2023, 04:58:35 AMIt's only me who think there's no point about this thread?There are many thread created about 1xbit on scam accusations, reputation, beginners & help and gambling boards, now @OP creating this thread is just somehow advertising 1xbit to make remember with 1xbit again.Yeah 1xbit is scam and the forum will not remove it, now what?I agree it's useless posting facts about 1XBIT we have already established that they are a scam casino that they are launching signature campaigns and they are paying their signature participants we already have a long discussion on this.But I do welcome complaints and accusations about 1XBIT provided that there are proofs attached to these complaints and it should be in the scam section, there will always be new topics about 1XBIT, they are aggressive in their marketing and they will continue to scam, but we will always welcome complaints and continue to warn people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "May 19, 2023, 04:05:58 PM",
      "body": "OP, I understand what you wrote (barely), but I'm having a hard time trying to understand what your point is and why it was so important that you had to start another thread about 1xbit when it's been well-known for a long time they're scammy as fuck.Quote from: Plaguedeath on May 19, 2023, 04:58:35 AMIt's only me who think there's no point about this thread?There are many thread created about 1xbit on scam accusations, reputation, beginners & help and gambling boards, now @OP creating this thread is just somehow advertising 1xbit to make remember with 1xbit again.Doh!  I was skimming to find the post of another member I wanted to quote when I saw yours; I'm glad I'm not the only one who's still trying to grasp the point of this.  My first guess was that he's just trying to earn merits (and it's probably true).  I looked at his merit history and there are a couple of members whose back he scratched.  Not accusing him of anything, but his English is so bad that I don't know how he was able to earn as many merits as he has with so few posts.  Curious indeed.Quote from: Mpamaegbu on May 18, 2023, 04:37:21 PMQuote from: Findingnemo on May 18, 2023, 03:33:27 PMScams are not moderated here...I wonder why that's still so till date. I think it's time that got reviewed.Don't hold your breath.  That issue has been brought up many times before, and it's fallen on deaf ears without fail.  I don't buy all the excuses people make, because other forums don't seem to have any problems whatsoever banning members if there's enough evidence that they've scammed somebody--and there are plenty of proven scams that have happened here over the years where there was no doubt about the guiltiness of the scammer.  Theymos just doesn't want to do it, and it's as simple as that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}