{
  "id": "topic_5437897",
  "title": "cryptoconsulting",
  "author": "cryptoconsulting",
  "created_time": "February 03, 2023, 08:06:02 AM",
  "content": "BiXBiT is building a complete mining ecosystem, with top-notch mining firmwares, immersive cooling equipment, and now also an automated monitoring system, or AMS.The goal of the bug bounty is to test the AMS and make sure that it meets the needs of the mining market and users.Try the monitoring system and submit a detailed review, and BixBit will generously reward you for your effort.https://bixbit.io/en/bug-bounty",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437897",
  "comments": [
    {
      "author": "digaran",
      "created_time": "February 03, 2023, 07:07:00 PM",
      "body": "Suggestions: we don't trust newbies by default, so I'm not going to click on the link, first create a nice announcement thread and then explain in details. A simple post with no efforts in making it is suspicious to most people. Hope it helps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "February 03, 2023, 07:34:53 PM",
      "body": "I can only agree with what digaran mentioned. Additionally, those interested in testing should know how big the bounties are and what they can expect to earn by providing their services. A \"generous reward\" doesn't mean the same thing in East Asia and in Germany. Since you are new to Bitcointalk, I would suggest having a trusted member escrow the funds you intend to spend on the bug bounty. You can check Recommended bitcointalk escrow services for a list of some of the escrow agents we have on the forum.Or create a thread in the services section asking for an escrow to get in touch with you.One way to at least prove you have the money is signing a message from the bitcoin address from which payments will be made. That isn't proof you will pay, but it shows you have the coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}