{
  "id": "topic_5455002",
  "title": "Hvdv",
  "author": "Hvdv",
  "created_time": "June 03, 2023, 07:12:54 PM",
  "content": "Cumhurbaşkanı yardımcısı : Cevdet Yılmaz İçişleri Bakanı : Ali YerlikayaDışişleri Bakanı : Hakan FidanAdalet Bakanı : Yılmaz Tunç Aile ve sosyal hizmetler : Mahinur Özdemir GöktaşÇalışma ve sosyal güvenlik bakanı : Vedat IşıkhanÇevre Şehircilik bakanı : Mehmet ÖzhasekiEnerji Bakanı: Alpaslan Bayraktar Gençlik ve spor Bakanı: Osman Aşkın BakHazine Maliye bakanı : Mehmet Şimşek Kültür ve turizm bakanı : Mehmet Nuri ErsoyMilli eğitim bakanı: Yusuf TekinMilli Savunma bakanı : Yaşar GülerSağlık bakanı : Fahrettin KocaSanayi ve teknoloji bakanı : Mehmet Fatih KacırTarım ve orman bakanı : İbrahim Yumaklı Ticaret Bakanı: Ömer BolatUlaştırma ve altyapı bakanı : Abdülkadir Uraloğlu değişmeyen tek bakan yanlış görmediysem sağlık bakanı. O da işini iyi yapıyordu bence.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455002",
  "comments": [
    {
      "author": "Silence Scream",
      "created_time": "June 03, 2023, 08:08:48 PM",
      "body": "Yeni bakanlarda dikkat çeken Fahrettin Koca’nın bakanlığa devam etmesi oldu. Bunun dışında teknoloji bakanının 84 doğumlu olması da başka dikkat çeken bir detay. Hulusi Akar’ın milletvekili olmasından sonra Yaşar Güler’in Milli Savunma Bakanı olarak yer alması da dikkat çeken başka bir atama olmuş. İstanbul’un yakından tanıdığı Vali Ali Yerlikaya artık içişlerine bakacaklar. Yeni dönem hayırlı olur umarım. Bu dönemde Mehmet Şimşek’e büyük bir iş düşecek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "June 03, 2023, 08:31:58 PM",
      "body": "Açıklamalar öncesinde konuşulan isimlerin büyük kısmı gerçek çıkmamış. Buradaki isimlere bakınca geçmiş döneme göre daha nitelikli kişileri almaya çalışmışlar gibi görünüyor. Benim dikkatimi çeken Hakan Fidan ve Mehmet Şimşek oldu. Hakan Fidan'ın o koltukta ne kadar başarılı olabileceğini merak ediyorum.Mehmet Şimşek ise geçmişte şimdiki düzen için çok zıtlaşmış bir isim. Birçok şart ile beraber masaya oturulduğu söyleniyordu ve bu şartlar kabul edilmiş gibi görünüyor. Hatta vatandaşlar temmuz ayında asgari ücrete zam verilmeyeceği konusunda konuşmaya başlamış bile",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "June 03, 2023, 08:53:10 PM",
      "body": "Tabi ki en önemlisi ve dikkat çekeni Mehmet Şimşek. Eskiden başarılı olduğu gibi bir düşünce var ama ben katılmıyorum. Onunla ilgili uzun uzun analizleri bu aralar oldukça gördük. Sadece sıkılaştırma politikasını sevdiği söyleniyor da ben olması gerektiği kadar yapabileceklerini düşünmüyorum. Şu anda akıl almaz şeyler yapılıyor ve tak diye kesemezler gibi geliyor. Ayrıca asgari ücret dolar olarak çok yüksek kaldı, bunu ya asgari ücrete çok az zam yaparak ya da dolar kurunu salarak yani yükselmesine izin vererek dengeleyeceklerdir diye düşünüyorum. Asgari ücretliler düşük alsın istemiyorum tabi ki de ülkece alım gücümüz yükselse ve ülkenin asgari ücretli çalışan oranı düşse istiyorum. Ama uzun vadede bile böyle bir şeyin olabileceğini düşünmüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "June 03, 2023, 09:15:55 PM",
      "body": "Quote from: xzone on June 03, 2023, 08:31:58 PMAçıklamalar öncesinde konuşulan isimlerin büyük kısmı gerçek çıkmamış. Buradaki isimlere bakınca geçmiş döneme göre daha nitelikli kişileri almaya çalışmışlar gibi görünüyor. Benim dikkatimi çeken Hakan Fidan ve Mehmet Şimşek oldu. Hakan Fidan'ın o koltukta ne kadar başarılı olabileceğini merak ediyorum.Mehmet Şimşek ise geçmişte şimdiki düzen için çok zıtlaşmış bir isim. Birçok şart ile beraber masaya oturulduğu söyleniyordu ve bu şartlar kabul edilmiş gibi görünüyor. Hatta vatandaşlar temmuz ayında asgari ücrete zam verilmeyeceği konusunda konuşmaya başlamış bile Temmuz ayında zam olmasın da, var olan maaşların alım gücünü düşürünce otomatik zam yapmış gibi olacaklar. O yüzden umarım Mehmet Şimşek ekonominin şimdiki durumunu tersine çevirici etki yapabilecek hamleler yapar. Yakında yönetmelikler ile bazı hareketler görebiliriz. Ayrıca benim dikkatimi Cumhurbaşkanının açıklamaları yaptığı andaki yorgunluğu çekti. Sanırım artık yaşlılığın verdiği bir yorgunluk var. Sesi kısılmıştı. Bakanlardan birisi Valilikten gelme ve İçişleri bakan yardımcılığı da yapmış. Atamalar liyakata esas gibi görünüyor umarım ülkenin durumu geçmişi aratmadan adam akıllı bir değişikliğe uğrar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "June 04, 2023, 05:08:39 AM",
      "body": "Quote from: Silence Scream on June 03, 2023, 09:15:55 PMQuote from: xzone on June 03, 2023, 08:31:58 PMAçıklamalar öncesinde konuşulan isimlerin büyük kısmı gerçek çıkmamış. Buradaki isimlere bakınca geçmiş döneme göre daha nitelikli kişileri almaya çalışmışlar gibi görünüyor. Benim dikkatimi çeken Hakan Fidan ve Mehmet Şimşek oldu. Hakan Fidan'ın o koltukta ne kadar başarılı olabileceğini merak ediyorum.Mehmet Şimşek ise geçmişte şimdiki düzen için çok zıtlaşmış bir isim. Birçok şart ile beraber masaya oturulduğu söyleniyordu ve bu şartlar kabul edilmiş gibi görünüyor. Hatta vatandaşlar temmuz ayında asgari ücrete zam verilmeyeceği konusunda konuşmaya başlamış bile Temmuz ayında zam olmasın da, var olan maaşların alım gücünü düşürünce otomatik zam yapmış gibi olacaklar. O yüzden umarım Mehmet Şimşek ekonominin şimdiki durumunu tersine çevirici etki yapabilecek hamleler yapar. Yakında yönetmelikler ile bazı hareketler görebiliriz. Ayrıca benim dikkatimi Cumhurbaşkanının açıklamaları yaptığı andaki yorgunluğu çekti. Sanırım artık yaşlılığın verdiği bir yorgunluk var. Sesi kısılmıştı. Bakanlardan birisi Valilikten gelme ve İçişleri bakan yardımcılığı da yapmış. Atamalar liyakata esas gibi görünüyor umarım ülkenin durumu geçmişi aratmadan adam akıllı bir değişikliğe uğrar. Bu basılan paralarla ve harcanan miktarlarla alım gücünün nasıl artabileceği konusunda fikri olan varsa buyursun. Mehmet Şimşek Ekonominin başına geçtiğine göre biraz eline koz verilmiş. Kendisi merkez bankası başkanını da atayacak ve bağımsız kalmasını sağlayacak gibi bir istekte bulunmuş. Muhtemelen kabul edilmiştir. Ülkenin 20 yıl sonra geldiği yer 20 yıl öncesi oldu. Allah yardımcımız olsun. Umarım bu kabine bir şeyleri değiştirebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "June 04, 2023, 05:15:59 AM",
      "body": "Yeni kabineden beklentiler çok yüksek, sağlık bakanının değişmemesi güzel olmuş, bence işini en iyi yapan bakan oydu, elbette iyinin iyisi vardır ama en azından sistemi bildiği, bazı şeyleri bu süreçte oturttuğu, koronavirüs gibi bir pandemide büyük tecrübe kazandığı için önemli bir isim Fahrettin Koca, dışişleri bakanı Hakan Fidan olması da yerinde bir karar gibi görünüyor, görevi devreden kabineye göre daha mantıklı hamleler yapılmış gibi görünüyor,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "June 04, 2023, 05:29:54 AM",
      "body": "özellikle mehmet şimşek isminden dolayı borsa birkaç gün tavan gider. hele ki güzel açıklamalar yaparsa bu süre birkaç ay sürebilir. kaç zamandır insanlar resmen bunu bekliyordu ama başkanlık sistemi sonucu bu büyü bence kısa süre sonunda sona erecektir. bakalım kkm, faiz gibi olaylar ne olacak?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "June 04, 2023, 06:52:54 AM",
      "body": "Yerinde kalan bakanlar için çok da birşey söyleyemem, demek ki yeterli görülmüş geçmiş dönem çalışmaları, yenilerden ise özellikle Mehmet Şimşek, umarım yeterince yetki sahasına sahip olur, çünkü ekonomide ihtiyacımız olan önce kısa vadeli çözümlerle arabayı yolda tutup, sonrasında ise uzun vadeli ve istikrarlı planlamalar ile yolda tutulan arabaya yeniden ivme kazandırmak gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "June 04, 2023, 04:57:39 PM",
      "body": "Mehmet Şimşek AKP ekonomi politikalarını düzenleyebilecek isim mi olacak nasıl olacak bakalım görelim Mehmet Şimşek serbest piyasa ekonomisini benimseyen bir duruşu var ilk izlenimler olumlu borsa İstanbul da olumlu bir tepki vereceğini düşünüyorum hafta başında. Tek bir kişi değişmemiş bütün kadro değişmiş farklı bir yol izlemeye karar verilmiş gibi gözüküyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "June 04, 2023, 06:17:40 PM",
      "body": "Quote from: SUPERSAIAN on June 04, 2023, 04:57:39 PMMehmet Şimşek AKP ekonomi politikalarını düzenleyebilecek isim mi olacak nasıl olacak bakalım görelim Mehmet Şimşek serbest piyasa ekonomisini benimseyen bir duruşu var ilk izlenimler olumlu borsa İstanbul da olumlu bir tepki vereceğini düşünüyorum hafta başında. Tek bir kişi değişmemiş bütün kadro değişmiş farklı bir yol izlemeye karar verilmiş gibi gözüküyor.İnşallah ülke için iyi bir şeyler olur. Artık iyi şeyleri görmeyi o kadar çok istiyoruz ki böyle geçmiş dönemde bakanlık yapmış kişileri tekrar getirdikleri için sevinir hale geldik. Bu arada Mehmet Şimşek AKP döneminde yapılan özelleştirmelerin bir çoğunun kaynağında olan kişilerden. Umarım yine elde kalan bir kaç kurum özelleştirilmez. Şu an piyasalara sert bir pozitif yansıma olacaktır. Doları gece yarısı kaçtan işlem göreceğini merak ediyorum. Yarın borsanın tavan yapacağına neredeyse herkes emin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "June 04, 2023, 09:58:55 PM",
      "body": "Yeni ekonomi bakanı Mehmet Şimşek'in işi hiç kolay değil. Döviz yokluğu, KKM gibi ucube sistemler ile Türk Lirasına uygulanan sonsuz faiz sözü gibi uygulamaların USD/TL paritesini sadece sabit tutmaya yetişebildiği bir ortamda temel problemlerden birisi güvendir. Merkez bankaları, bankalar yada ekonomi yönetimleri için en temel etmenlerden birisi paranın güvende olduğu hissiyatıdır. Bunu merkezi borsalar gibi düşünebilirsiniz. FTX gibi kullanıcı yatırımlarını kendisi kullanan ve kasası kullanıcı varlıklarını karşılamayan bir borsa bile uzun bir süre ayakta kalmayı başardı çünkü duyulan güven sayesinde gelen para dükkanın dönmesini sağlıyordu. Döviz karşısında senelerdir ezilmekte olan Türk Lirasına ve merkez bankasına duyulan güvensizliği tamir etmek düşünüldüğü kadar kolay değil. Ekonomi sihirli değnek kullanabileceğiniz bir alan değil ve sadece bir isim değişikliği her şeyin yerli yerine oturacağı anlamına gelmiyor. Kafamda değişik sorular var. Örneğin 1 seneden fazla süredir resmi olarak dillendirilmese dahi neredeyse sabit kur rejimine benzer bir para politikası izliyoruz. Doların artmaması için çok fazla yanlış hamle yapıldı ve şu an USD/TL paritesi bu baskı nedeniyle çok gergin durumda. Serbest mi bırakacaklar ? Serbest bırakmazlarsa yabancı yatırımcının güvenini kazanma olasılıkları yok. KKM gibi süreçlerin ödemeleri halen bitmedi ve seçin öncesi verdikleri abartı faiz oranları sayesinde KKM ve türevlerinde tutulan miktar rekor hacime ulaştı. Döviz yokluğunda bu ödemeler nasıl karşılanacak ?%35-%40 gibi uçuk faiz vaatleri verildi ve bu faizler duruma göre kişilere peşin ödendi ancak ana para kasada kaldığı için faizleri ödemek kolaydı. Süreç bittiğinde ödenen miktarın 2.5-3 katının kişilere ödenmesi gerekecek. Ve böyle bir ödeme yükü sağlıklı ekonomileri bile krize sokabilecekken biz bu süreçten çıkmayı nasıl başaracağız ? Özelleştirecek bir şey kaldı mı ? Özelleştirmenin çözüm olmadığını da geçmişte görmüştük. Tabi ki ele geçen paranın yüksek sanayi yatırımlarında kullanılmamasının da bunda etkisi vardı.%40 faizle dahi herkesi dövizden vazgeçiremezken, şirketlere dayatmalar uygularken dahi döviz açığını dolduramazken faiz arttırma kararları gelmeye başlasa bile kendi yaktığımız ateşi söndürmek çok kolay olmayacak.Sadece en azından önceki kadar saçma politikalar uygulanmayacağını ümit etmek istiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "June 05, 2023, 04:59:28 AM",
      "body": "Quote from: Bthd on June 04, 2023, 09:58:55 PMYeni ekonomi bakanı Mehmet Şimşek'in işi hiç kolay değil. Döviz yokluğu, KKM gibi ucube sistemler ile Türk Lirasına uygulanan sonsuz faiz sözü gibi uygulamaların USD/TL paritesini sadece sabit tutmaya yetişebildiği bir ortamda temel problemlerden birisi güvendir. Merkez bankaları, bankalar yada ekonomi yönetimleri için en temel etmenlerden birisi paranın güvende olduğu hissiyatıdır. Bunu merkezi borsalar gibi düşünebilirsiniz. FTX gibi kullanıcı yatırımlarını kendisi kullanan ve kasası kullanıcı varlıklarını karşılamayan bir borsa bile uzun bir süre ayakta kalmayı başardı çünkü duyulan güven sayesinde gelen para dükkanın dönmesini sağlıyordu. Döviz karşısında senelerdir ezilmekte olan Türk Lirasına ve merkez bankasına duyulan güvensizliği tamir etmek düşünüldüğü kadar kolay değil. Ekonomi sihirli değnek kullanabileceğiniz bir alan değil ve sadece bir isim değişikliği her şeyin yerli yerine oturacağı anlamına gelmiyor. Kafamda değişik sorular var. Örneğin 1 seneden fazla süredir resmi olarak dillendirilmese dahi neredeyse sabit kur rejimine benzer bir para politikası izliyoruz. Doların artmaması için çok fazla yanlış hamle yapıldı ve şu an USD/TL paritesi bu baskı nedeniyle çok gergin durumda. Serbest mi bırakacaklar ? Serbest bırakmazlarsa yabancı yatırımcının güvenini kazanma olasılıkları yok. KKM gibi süreçlerin ödemeleri halen bitmedi ve seçin öncesi verdikleri abartı faiz oranları sayesinde KKM ve türevlerinde tutulan miktar rekor hacime ulaştı. Döviz yokluğunda bu ödemeler nasıl karşılanacak ?%35-%40 gibi uçuk faiz vaatleri verildi ve bu faizler duruma göre kişilere peşin ödendi ancak ana para kasada kaldığı için faizleri ödemek kolaydı. Süreç bittiğinde ödenen miktarın 2.5-3 katının kişilere ödenmesi gerekecek. Ve böyle bir ödeme yükü sağlıklı ekonomileri bile krize sokabilecekken biz bu süreçten çıkmayı nasıl başaracağız ? Özelleştirecek bir şey kaldı mı ? Özelleştirmenin çözüm olmadığını da geçmişte görmüştük. Tabi ki ele geçen paranın yüksek sanayi yatırımlarında kullanılmamasının da bunda etkisi vardı.%40 faizle dahi herkesi dövizden vazgeçiremezken, şirketlere dayatmalar uygularken dahi döviz açığını dolduramazken faiz arttırma kararları gelmeye başlasa bile kendi yaktığımız ateşi söndürmek çok kolay olmayacak.Sadece en azından önceki kadar saçma politikalar uygulanmayacağını ümit etmek istiyorum.Yavaş yavaş bunları kaldırması gerekecek Mehmet Şimşek’in, sanırım işlerinde bağımsız olma, karışmama sözü de almış olmalı, bakanlık teklifinde böyle bir şey olduğunu konuşuyordu herkes, ilk mesajında da rasyonelleşme sözü verilmiş, böyle giderse ekonominin serbest bırakılması söz konusu, herkes ilk başta dolardan düşük tepki bekliyor ama daha önce doları baskılamak için yapılan hareketleri iptal edip, akabinde doların ulaşabileceği seviyeyi görüp, buna göre hareket etme  yoluna gidebilir, böyle bir durumda da bu sene doları 30 liraya yakın görebiliriz, gelecek seneden itibaren ise belki ek tedbirler ve doların durumunu kontrol altına ekonomik olarak almaya çalışma yöntemleriyle doları düşürmeye çalışabilir, yani önce piyasalara 30’u kabul ettirip, daha sonra 20’ye düşürerek bir alım gücü yükselişi yaşatmaya çalışabilir bence, aklıma başka yöntem gelmiyor,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "June 05, 2023, 08:38:07 AM",
      "body": "Quote from: Silence Scream on June 03, 2023, 08:08:48 PMYeni bakanlarda dikkat çeken Fahrettin Koca’nın bakanlığa devam etmesi oldu. Bunun dışında teknoloji bakanının 84 doğumlu olması da başka dikkat çeken bir detay. Hulusi Akar’ın milletvekili olmasından sonra Yaşar Güler’in Milli Savunma Bakanı olarak yer alması da dikkat çeken başka bir atama olmuş. İstanbul’un yakından tanıdığı Vali Ali Yerlikaya artık içişlerine bakacaklar. Yeni dönem hayırlı olur umarım. Bu dönemde Mehmet Şimşek’e büyük bir iş düşecek. Mehmet Şimşek’e büyük iş düşeceği malum ve devir teslimde eski bakan bıraktığında bir oh çekti. İçinde bulunduğumuz durum neticesinde kim olursa olsun zaten yapacağı her şey atacağı her adım dikkatle izlenecek. Teknoloji bakanının 84 doğumlu olduğunu bilmiyordum. Yaş ortalamasını düşürmüş baya. Diğer isimlerin bazıları beklenen isimlerdi. Fahrettin Koca’nın göreve devam edeceğini düşünüyordum. Pandemi dönemi bu durumda etkili oldu. Göreve gelen herkesin vatana millete faydalı olmasını diliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "June 05, 2023, 08:45:47 AM",
      "body": "Quote from: flyingcarpet on June 05, 2023, 08:38:07 AMQuote from: Silence Scream on June 03, 2023, 08:08:48 PMYeni bakanlarda dikkat çeken Fahrettin Koca’nın bakanlığa devam etmesi oldu. Bunun dışında teknoloji bakanının 84 doğumlu olması da başka dikkat çeken bir detay. Hulusi Akar’ın milletvekili olmasından sonra Yaşar Güler’in Milli Savunma Bakanı olarak yer alması da dikkat çeken başka bir atama olmuş. İstanbul’un yakından tanıdığı Vali Ali Yerlikaya artık içişlerine bakacaklar. Yeni dönem hayırlı olur umarım. Bu dönemde Mehmet Şimşek’e büyük bir iş düşecek. Mehmet Şimşek’e büyük iş düşeceği malum ve devir teslimde eski bakan bıraktığında bir oh çekti. İçinde bulunduğumuz durum neticesinde kim olursa olsun zaten yapacağı her şey atacağı her adım dikkatle izlenecek. Teknoloji bakanının 84 doğumlu olduğunu bilmiyordum. Yaş ortalamasını düşürmüş baya. Diğer isimlerin bazıları beklenen isimlerdi. Fahrettin Koca’nın göreve devam edeceğini düşünüyordum. Pandemi dönemi bu durumda etkili oldu. Göreve gelen herkesin vatana millete faydalı olmasını diliyorum. Zaten kukla bir bakandı. Boş yere Oh çekmesine gerek yoktu. Baksanıza ülkenin geldiği ekonomik durumdan adamın haberi bile yok. Dolar düşmüş, çıkmış umrunda mı. Bina yanarken saçını tarayanlar gibi rahat takılıyordu. Mehmet Şimşek bakanın konuşma esnasında yüz ifadesinden edindiğim izlenim ise büyük bir yük ve topun altındayım, bakalım inşallah beraber bu topun altından çıkabiliriz ifadesiydi. Ülkenin şu an geldiği durumdan kim sorumluysa zamanı gelince hesabının sorulması tek temennim. Yazık ülkenin düştüğü şu duruma. Türkiye, Shell CEO’sunun söylediği gibi “Bir petrol okyanusunun üstünde oturan” bir devletken, bunları çıkartamamak en büyük ekonomik kayıptır. Umarım bir gün biz de bu ana gelirlerden ülke içerisinde kazançlı çıkabiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "June 05, 2023, 10:15:58 AM",
      "body": "Aralarından en çok tanıdığım Yılmaz Tunç, Bartın - Ulus milletvekili bizim köylü, iyi adamdır, umarım güzel işler yapar Adalet Bakanlığında, şu sisteme bi düzeltir.Hakan Fidan'ın başarılı olacağını düşünüyorum Dış İşleri Bakanlığında.Mehmet Şimşeğin Politikaları çalışanlar için kötü diyorlar, daha zor zamanlar bekliyormuş çalışanları.Diğerlerini izleyip göreceğiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "June 05, 2023, 10:26:32 AM",
      "body": "Quote from: MK-74 on June 05, 2023, 10:15:58 AMAralarından en çok tanıdığım Yılmaz Tunç, Bartın - Ulus milletvekili bizim köylü, iyi adamdır, umarım güzel işler yapar Adalet Bakanlığında, şu sisteme bi düzeltir.Hakan Fidan'ın başarılı olacağını düşünüyorum Dış İşleri Bakanlığında.Mehmet Şimşeğin Politikaları çalışanlar için kötü diyorlar, daha zor zamanlar bekliyormuş çalışanları.Diğerlerini izleyip göreceğiz.Hakan Fidan konusunda emin değilim. 100 yıl sonra ilk defa asker kökenli bir dışişleri bakanı seçilmiş öyle deniliyor. Hakan Fidan MİT’de başarılı işler çıkarmış olabilir ama Dışişleri’nde ne kadar başarılı olacak zamanla göreceğiz bunu.Adalet bakanını tanımıyorum. Umarım HSK başkanı olarak, Adaletin başı olarak liyakatli atamalar yapar ve yargı sistemine güzel dokunuşlar getirir.Mehmet Şimşek konusunda haklılar. Özelleştirmeler ile bir döneme damga vurmuş bir bakandı. Onun zamanında pek çok kurum, memur doğru düzgün zam alamamıştı. Bu dönemde de memur ve çalışanlar üstünden bir kemer sıkma politikasına gideceğiz. Ne de olsa insanlar bir şekilde başının çaresine bakıyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "June 06, 2023, 05:18:51 AM",
      "body": "Quote from: Phoenix Anka on June 04, 2023, 05:08:39 AMQuote from: Silence Scream on June 03, 2023, 09:15:55 PMQuote from: xzone on June 03, 2023, 08:31:58 PMAçıklamalar öncesinde konuşulan isimlerin büyük kısmı gerçek çıkmamış. Buradaki isimlere bakınca geçmiş döneme göre daha nitelikli kişileri almaya çalışmışlar gibi görünüyor. Benim dikkatimi çeken Hakan Fidan ve Mehmet Şimşek oldu. Hakan Fidan'ın o koltukta ne kadar başarılı olabileceğini merak ediyorum.Mehmet Şimşek ise geçmişte şimdiki düzen için çok zıtlaşmış bir isim. Birçok şart ile beraber masaya oturulduğu söyleniyordu ve bu şartlar kabul edilmiş gibi görünüyor. Hatta vatandaşlar temmuz ayında asgari ücrete zam verilmeyeceği konusunda konuşmaya başlamış bile Temmuz ayında zam olmasın da, var olan maaşların alım gücünü düşürünce otomatik zam yapmış gibi olacaklar. O yüzden umarım Mehmet Şimşek ekonominin şimdiki durumunu tersine çevirici etki yapabilecek hamleler yapar. Yakında yönetmelikler ile bazı hareketler görebiliriz. Ayrıca benim dikkatimi Cumhurbaşkanının açıklamaları yaptığı andaki yorgunluğu çekti. Sanırım artık yaşlılığın verdiği bir yorgunluk var. Sesi kısılmıştı. Bakanlardan birisi Valilikten gelme ve İçişleri bakan yardımcılığı da yapmış. Atamalar liyakata esas gibi görünüyor umarım ülkenin durumu geçmişi aratmadan adam akıllı bir değişikliğe uğrar. Bu basılan paralarla ve harcanan miktarlarla alım gücünün nasıl artabileceği konusunda fikri olan varsa buyursun. Mehmet Şimşek Ekonominin başına geçtiğine göre biraz eline koz verilmiş. Kendisi merkez bankası başkanını da atayacak ve bağımsız kalmasını sağlayacak gibi bir istekte bulunmuş. Muhtemelen kabul edilmiştir. Ülkenin 20 yıl sonra geldiği yer 20 yıl öncesi oldu. Allah yardımcımız olsun. Umarım bu kabine bir şeyleri değiştirebilir. Valla hocam çok haklısınız genel olarak, sadece bir nokta var takıldığım, ülkenin 20 yıl sonra geldiği yer 20 yıl oncesi gibi görünse de, cumhuriyet döneminin bütün kazanimlari artık elden çıkmış durumda, ne fabrika var artık satılacak, ne de liman. Resmen Arap yarımadasının yancisi durumundayız 20 yıl önceye göre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "June 06, 2023, 05:22:22 AM",
      "body": "Quote from: MK-74 on June 05, 2023, 10:15:58 AMAralarından en çok tanıdığım Yılmaz Tunç, Bartın - Ulus milletvekili bizim köylü, iyi adamdır, umarım güzel işler yapar Adalet Bakanlığında, şu sisteme bi düzeltir.Hakan Fidan'ın başarılı olacağını düşünüyorum Dış İşleri Bakanlığında.Mehmet Şimşeğin Politikaları çalışanlar için kötü diyorlar, daha zor zamanlar bekliyormuş çalışanları.Diğerlerini izleyip göreceğiz.Hocam Mehmet Şimşek özelinde, durumu duzeltebilecekse zor zamanlar makul görülebilir. Zaten yıllardır zor zamanlar yaşadık, istesek de istemesek de katlandık, sonuçta ne oldu, zor zamanlar bitti daha zor zamanlara ulaştık hep, hakan fidan bence de başarılı olabilecek seviyede, diğerleri için de zaman gösterecek ne kadar faydalı olabileceklerini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "June 06, 2023, 02:38:05 PM",
      "body": "Quote from: totti67 on June 06, 2023, 05:22:22 AMQuote from: MK-74 on June 05, 2023, 10:15:58 AMAralarından en çok tanıdığım Yılmaz Tunç, Bartın - Ulus milletvekili bizim köylü, iyi adamdır, umarım güzel işler yapar Adalet Bakanlığında, şu sisteme bi düzeltir.Hakan Fidan'ın başarılı olacağını düşünüyorum Dış İşleri Bakanlığında.Mehmet Şimşeğin Politikaları çalışanlar için kötü diyorlar, daha zor zamanlar bekliyormuş çalışanları.Diğerlerini izleyip göreceğiz.Hocam Mehmet Şimşek özelinde, durumu duzeltebilecekse zor zamanlar makul görülebilir. Zaten yıllardır zor zamanlar yaşadık, istesek de istemesek de katlandık, sonuçta ne oldu, zor zamanlar bitti daha zor zamanlara ulaştık hep, hakan fidan bence de başarılı olabilecek seviyede, diğerleri için de zaman gösterecek ne kadar faydalı olabileceklerini.Durumun düzelebileceğini pek sanmıyorum, durum daha da kötüye gidecek bu sefer işçi ve memurun alım güçleri daha da azalacaktır.Olanları bitenleri oturup izleyeceğiz bakalım neler yapacak, politikalarını çok merak ediyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}