{
  "id": "topic_5400233",
  "title": "burenka",
  "author": "burenka",
  "created_time": "May 26, 2022, 07:49:45 AM",
  "content": "There is a huge question for professionals in the online gambling industry. How to get customer's payments? Trivial but in detail a complicated issue. Legal & Licences restrictions, country's coverage and A/R rates, fees, delays, bank compliances, fraud protection, regulators' supervision and all small things could transform this common issue into a disaster. Especially whether you need not just get clients money, but when you want to send their winnings back.Let's start with the most common and well-known system gates for gambling operators:Name   Link   Traffic 04.22CyberSource   https://www.cybersource.com/   13,880,000Przelewy24   https://www.przelewy24.pl/   10,830,000Paysafecard   https://paysafecard.com/   4,816,000CCBill   https://ccbill.com/   4,462,0001Cupis   https://1cupis.ru/   4,141,000If we rely on traffic data that might be enough. But, DNS-tracking is not that good an index to measure real convenience and popularity. Some payment gates use their inner technical domains to proceed with payments, so some real amount of client's payments could be hidden in such a data approach.Let’s change POV and try to find out payment gates with the most amount of payment methods inside, so it beName   Link   Payment methods amountNuvei   https://nuvei.com/   550PayU   https://corporate.payu.com/   400Payop   https://payop.com/   300EasyPaymentGateway   https://easypaymentgateway.com/   240ApcoPay   https://apcopay.com/   240Better? Well, not yet. This chart doesn't say anything about geo-restrictions. If we want to know the top payment gate for the USA, for example, we need to include country operations restrictions. And the new chart will be like this:Code:Name Link Traffic 04.22 Payment methods amount RegionsPrzelewy24 https://www.przelewy24.pl/ 10,830,000 10 Canada, USA, Mexico, El Salvador, Panama, Colombia, Brazil, Argentina, Chile, South Africa, Cyprus, Turkey, Greece, Albania, Macedonia, Bulgaria, Romania, Ukraine, Hungary, Slovakia, Poland, Czech Republic, Austria, Slovenia, Croatia, Italy, Switzerland, Germany, Netherlands, Belgium, France, Spain, Portugal, Denmark, Ireland, UK, Norway, Sweden, Finland, Russia, Lithuania, Latvia, Estonia, Japan, South Korea, China, India, Thailand, Vietnam, Taiwan, Malaysia, Indonesia, Australia, New ZealandPaysafecard https://paysafecard.com/ 4,816,000 100 Arabic, Bulgarian, Croatian, Czech, Danish, Dutch, English, Finnish, French, Georgian, German, Greek, Hungarian, Italian, Latvian, Montenegrin, Norwegian, Polish, Portuguese, Romanian, Russian, Serbian, Slovakian, Slovenian, Spanish, Swedish, Turkish, USACCBill https://ccbill.com/ 4,462,000 18 Andora, Austria, Bear Island, Belgium, Bulgaria, Canada, Channel, Island, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Hungary, Iceland, Ireland, Isle of Man, Israel, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia,Slovenia, Spain, Sweden, Switzerland, Turkey, UK, USA, Vatican CityBambora https://bambora.com/ 1,266,000 200 Australia, Canada, Denmark, Finland, Norway, Sweden, USAPaySafe https://www.paysafe.com/en/ 576,773 13 Dublin, London, Vienna, Miami, Canada, USAAdyen https://docs.adyen.com/ 559,640 65 Australia, Belgium, Brazil, Canada, China, Czech Republic, France, Germany, Italy, Japan, Malaysia, Mexico, Netherlands, New Zealand, Portugal, Poland, Singapore, Spain, Sweden, UK, USAPayvea https://payvea.com/ 545,198 100 Europe, Asia, USABut if we seek for LATAM and Brasil spec, it’d be like this:Code:Przelewy24 https://www.przelewy24.pl/ 10,830,000 10 Canada, USA, Mexico, El Salvador, Panama, Colombia, Brazil, Argentina, Chile, South Africa, Cyprus, Turkey, Greece, Albania, Macedonia, Bulgaria, Romania, Ukraine, Hungary, Slovakia, Poland, Czech Republic, Austria, Slovenia, Croatia, Italy, Switzerland, Germany, Netherlands, Belgium, France, Spain, Portugal, Denmark, Ireland, UK, Norway, Sweden, Finland, Russia, Lithuania, Latvia, Estonia, Japan, South Korea, China, India, Thailand, Vietnam, Taiwan, Malaysia, Indonesia, Australia, New ZealandStripe https://stripe.com/?utm_medium=paid-review-site&utm_source=quicksprout&utm_campaign=US/CA_quicksprout&utm_content=qsp11581 3,544,000 135 Australia, Austria, Belgium, Brazil, Bulgaria, Canada, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Gibraltar, Greece, Hong Kong, Hungary, India, Italy, Japan, Latvia, Liechtenstein, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, UAE, UK, US, Indonesia, Philippines, ThailandAdyen https://docs.adyen.com/online-payments/supported-payment-methods 559,640 65 Australia, Belgium, Brazil, Canada, China, Czech Republic, France, Germany, Italy, Japan, Malaysia, Mexico, Netherlands, New Zealand, Portugal, Poland, Singapore, Spain, Sweden, UK, USADirecta24 https://www.directa24.com/ 273,765 28 Mexico, Brazil, Chile, Argentina, Uruguay, Paraguay, Bolivia, Peru, Ecuador, Kolumbia, Costa Rica, Dominican Republic, Galapagos Islands, India, China, Andaman und Nicobar IslandsEasyPaymentGateway https://easypaymentgateway.com/ 61,200 240 UK, Switzerland, Sweden, Spain, Russia, Romania, Portugal, Poland, Norway, Netherlands, Malta, Luxemburg, Latvia, Italy, Ireland, Iceland, Hungary, Greece, Germany, France, Finland, Denmark, Czech Republic, Croatia, Bulgaria, Belgium, Austria, Canada, USA, Argentina, Brazil, Chile, Colombia, Mexico, Panama, Paraguay, Peru, Uruguay, Australia, China, India, Israel, Japan, New Zealand, Singapore, Thailand, South Africa, AlbaniaGlobalPayments https://www.globalpaymentsinc.com/en-us/industries/gaming 27,263 140 Asia-Pacific, India, Philippines, Australia, Macau, Singapore, China, Malaysia, Sri Lanka, Maldives, New Zealand, Taiwan, Malta, Slovakia, Romania, Spain, Czech Republic, Russia, UK, USA, Brazil, Canada, BermudaPaySpacelv https://payspacelv.com/ 10,862 150 USA, Canada, Brazil, Mexico, Colombia, Austria, Belgium, Czech Republic, Denmark, France, Germany, Finland, Italy, Netherlands, Norway, Poland, Portugal, Russia, Spain, Sweden, Switzerland, UK, Turkey, China, India, Thailand, Indonesia, Australia, Malaysia, New Zealand, Philippines, Singapore, Japan, South Korea, Taiwan, Vietnam, South Africa, Nigeria, UAEMoneyNetint https://www.moneynetint.com/ 5,000 35 Andorra, Australia, Austria, Bangladesh, Belgium, Brazil, Bulgaria, Canada, Chile, China, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong, Hungary, India, Indonesia, Ireland, Israel, Italy, Japan, Latvia, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Monaco, Montenegro, Nepal, Netherlands, New Zealand, Nigeria, Norway, Philippines, Poland, Portugal, Romania, Russia, San Marino, Singapore, Slovakia, Slovenia, Spain, Sri Lanka, Sweden, Switzerland, Thailand, Turkey, UK, Northern Ireland, USA, VietnamThere are more than a hundred commercial payment gates for gambling operators, which are manifesting their proficiency and specialization at gambling. And more than forty large payment gates without that gambling-specialization-criteria. Here is a short list of 29 (out of 90) payment gates to explore in more convinient form.How to choose the best one for you after all? Which factors are concerned? Let’s name some of themRegions of operations - your gate has to be enriched with payment methods popular in target countries and be legally approved to work with country coverage by licenses.Fees and commissions. The gambling industry is well known for heavily commissions and royalties loaded, which makes it a very low margin in revenue, so every decimal of payment commission charge really affects a business efficiency.Security and Privacy. All gambling clients would prefer to keep their data safe and clear. Amount of measures and approaches in payment gates matters.Time to income delivery. Fraud checks and transaction clearance can transform an easy task to “get your money” into a struggle. Common approach “30-30” (getting transaction after full month after cleared report, i.e. you get money for successful payments May-payments in July, etc.). But it could be 30-60 or even 30-90 due to fraud protection regulations. Try to imagine what amount of reserves for winnings you have to keep if your RTP rates for example 93-96%.National currencies and exchange rates. Wherever every 0.1% of commission matters, getting low rates can significantly drop your total margin.Minimal revenue requirements. You can easily find good commissions and rates, but they work mostly on high revenues. Check if your platform revenue is high enough to get them.Time to AML, contract sign, and compliance check. Setting up a new payment gate can take years. Literally - years.Reputation and public issues. It might be hard to convince your clients to pay through the system if it ever was publicly discredited.Fraud protection. Gambling is a high-fraud-risk industry. You can't completely exclude chargebacks, but you want to believe that your payment gate does everything to decrease that amount. KYC tools. Such a pain to spend tons on marketing and not to have an opportunity to get your client a high deposit, because KYC restrictions are applied without any tool to recognize your client right in the middle of their payment.Licenses and regulators compliance. You really want your payment gateway to work with your license. And even more, you would love to have your gateway in compliance with our bank.VAT and taxes appliance. International VAT can drive everyone mad. You probably want to work with a partner who is experienced enough with VAT.Those criteria are just the top of the head. Every platform has a unique set of business parameters. Most agents and turn-key providers can easily set up a common payment gate for you. But in most cases that might be expensive and inefficient. This might be not the first question when you just starting your brand new gambling project. But as soon as all platforms, CRM, and content questions are settled, your payment gate is strongly recommended.And here are several questions, What payment gate do you use for your projects?  Do crypto payments improve your business?  What criteria are important for you?  What issues have you experienced?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400233",
  "comments": [
    {
      "author": "raatnak",
      "created_time": "May 26, 2022, 09:23:53 AM",
      "body": "Hello everyone, when I started working in one of the major casinos, I was faced with the task of expanding the list of payment systems. It was absolute hell. There are so many restrictions that it is challenging to keep it all in your head. Finding ways to replenish the game account was not tricky - almost any payment system can do this, but there were problems with the withdrawal of winnings. For example, you can replenish your account from a MasterCard, but you can sign it up not in all countries of the world. In addition, problems arise with PaySafe if the user does not want to issue a card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VilliGano",
      "created_time": "May 26, 2022, 11:50:12 AM",
      "body": "Is it possible to withdraw money on PaySafe? the first time I've heard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxRoman",
      "created_time": "May 26, 2022, 02:59:00 PM",
      "body": "Quote from: VilliGano on May 26, 2022, 11:50:12 AMIs it possible to withdraw money on PaySafe? the first time I've heardPaySafe is an adequate payment system. You can buy vouchers to replenish your gaming account in the nearest store without registration. Still, in this case, you really won’t be able to withdraw money to this payment system since you don’t have a personal account. However, at PaySafe branches, you can also open a full-fledged card that you can use as a bank card. You can already withdraw money from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "burenka",
      "created_time": "May 26, 2022, 04:53:29 PM",
      "body": "PaySafe, and other type of pre-paid (or alternatively \"gift-cards) - seems good as common payment method for gambling. I believe it is because in a lot of countries there are restrictions to use banking cards for gambling payments. And pre-paid card could be easily bought at market, and then could be used for cashing your gambling site.However, pre-paid cards are the most popular for different scam and fraud schemes, so gambling operators usually have to be cautios with cliens who pay only with gift cards, without thorougfull validation, and who try to make deposit out shortly. So clients with pre-paid cards can face additional KYC checks whenever they try to cash out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AlexSnowSnow",
      "created_time": "May 26, 2022, 08:04:59 PM",
      "body": "Casino taxation is a real headache. Those who have not done this will not understand. We somehow chose a payment partner who did not have VAT instruments connected. It is hell. It's good that the problem was pointed out to us in time, and we were able to solve it without significant problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MikeSorino",
      "created_time": "May 27, 2022, 06:21:29 AM",
      "body": "For a long time, I thought that all payment systems have good protection against fraud. This was until the scammers deducted a large amount of money from my account. Now I carefully study all the data protection and encryption tools when choosing a partner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alice Bloom",
      "created_time": "May 27, 2022, 10:01:03 AM",
      "body": "My casino works simultaneously in different countries. There are usually no problems with the EU, but there are always questions with the countries of the post-Soviet space. Payment systems do not match, there are no logical rules for licensing, and problems with currency conversion. Can you recommend some reliable methods that work here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NanLomarig",
      "created_time": "May 27, 2022, 12:40:34 PM",
      "body": "Guys, tell me which gateways are suitable for the gaming market in Kazakhstan? I will be very grateful!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jason Rubar",
      "created_time": "May 27, 2022, 04:04:48 PM",
      "body": "We want to open a gaming business for Asian countries - Japan, China, and Thailand. What payment systems do you think will be convenient for this region? Thanks in advance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "May 27, 2022, 09:01:57 PM",
      "body": "Quote from: Jason Rubar on May 27, 2022, 04:04:48 PMWe want to open a gaming business for Asian countries - Japan, China, and Thailand. What payment systems do you think will be convenient for this region? Thanks in advance.If you'll use crypto then a normal crypto payment gateway would suffice but if you want to accept and send money thru their local fiat then search for those countries' local digital wallets (regardless of being a crypto supporting or not, you can still take their gateways accept their fiat then just convert it to your end). There are no such thing as Region-based payment system. If you really want a crypto-based payment system, then go chat all of existing platform's chat support then ask them for what gateway are they using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "May 27, 2022, 11:20:48 PM",
      "body": "Quote from: Jason Rubar on May 27, 2022, 04:04:48 PMWe want to open a gaming business for Asian countries - Japan, China, and Thailand. What payment systems do you think will be convenient for this region? Thanks in advance.Have someone research for you what are the known payment systems for each of those countries. Because there could be conflicts if your payment system will be in crypto. We've heard the news about China restricting crypto transactions.And that's why you have to make a research first before deciding what is to accept and that depends on the demand for each of those countries if those are the countries as your target market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "May 27, 2022, 11:26:35 PM",
      "body": "Quote from: jossiel on May 27, 2022, 11:20:48 PMQuote from: Jason Rubar on May 27, 2022, 04:04:48 PMWe want to open a gaming business for Asian countries - Japan, China, and Thailand. What payment systems do you think will be convenient for this region? Thanks in advance.Have someone research for you what are the known payment systems for each of those countries. Because there could be conflicts if your payment system will be in crypto. We've heard the news about China restricting crypto transactions.And that's why you have to make a research first before deciding what is to accept and that depends on the demand for each of those countries if those are the countries as your target market.Maybe conduct a short market survey or just dig info over the net. Because just like you said, since China has restrictions when it comes to crypto, it is not advisable to have payment in crypto only.You will consider their fiat, CNY, and that will entail other legal requirements to fulfill to accept this method.Japan and Thailand may be more acceptable with crypto payment, but then again, you need to research about their gambling protocols.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "May 27, 2022, 11:39:14 PM",
      "body": "Japan and China are going to vary because of their regimes attitudes towards crypto.  China wants their citizens to use only their approved currency payment methods and generally they have capital controls to restrict freedoms.  Japan is pro crypto and has an open currency system so I cant see the two would be comparable.  I'd advise people not to swap back and forth if possible, swapping to FIAT at these prices is not great timing just retain a modest amount in crypto for long term usage will save alot of hassle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "May 28, 2022, 12:20:01 AM",
      "body": "I don't have any experience to answer about this, I've always played games of chance only as a player (end consumer) and fortunately I don't have to worry about these details.But what I would like to add to the discussion is that the best way out of all this is the use of crypto in 100% of the receiving payment methods.More security and less bureaucracy for everyone involved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "May 28, 2022, 04:46:54 AM",
      "body": "Why would they have to use a thirdparty payment gateway when they can use crypto currencies? If they are using fiat, yeah, then it's their disadvantage and they have to struggle with the payment gateways and pay those massive fees when funds enter or moves out of the casino.That's why most online casinos and players now prefer to use crypto currencies. No need for any third party payment gate way. They can set their own wallet within few minutes and start accepting payments without issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rakokiller1",
      "created_time": "May 28, 2022, 10:48:34 AM",
      "body": "Is there a safety rating for a regular player on the list? Is the list checked for miscoding?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alex Braun",
      "created_time": "May 28, 2022, 03:35:37 PM",
      "body": "As a rule, an online casino allows you to withdraw funds only by the payment methods that were used for replenishment. Although there should be systems where this point is not important and the player can change. Is there such a thing on your list?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "May 28, 2022, 05:10:20 PM",
      "body": "Quote from: TimeTeller on May 27, 2022, 11:26:35 PMQuote from: jossiel on May 27, 2022, 11:20:48 PMHave someone research for you what are the known payment systems for each of those countries. Because there could be conflicts if your payment system will be in crypto. We've heard the news about China restricting crypto transactions.And that's why you have to make a research first before deciding what is to accept and that depends on the demand for each of those countries if those are the countries as your target market.Maybe conduct a short market survey or just dig info over the net. Because just like you said, since China has restrictions when it comes to crypto, it is not advisable to have payment in crypto only.You will consider their fiat, CNY, and that will entail other legal requirements to fulfill to accept this method.Japan and Thailand may be more acceptable with crypto payment, but then again, you need to research about their gambling protocols. Yes.Every single payment method that will give them demand is what they must have. Any adaptable payment method that's friendly not just to them but mostly to their players for those specific countries is what they aim for. It's actually one of the first moves that they have to do and that's good since someone has asked for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "May 28, 2022, 09:54:08 PM",
      "body": "Quote from: Jason Rubar on May 27, 2022, 04:04:48 PMWe want to open a gaming business for Asian countries - Japan, China, and Thailand. What payment systems do you think will be convenient for this region? Thanks in advance.I think starting with their local currency is a good start in knowing what payment systems should be accepted. At least, you must implement a function where they can conveniently convert their local currency to cryptocurrency so this could attract their attention if you were to open a gaming business in Asia.In the Philippines, I highly suggest that you have an option to pay using our convenient mobile app (e.g. GCash) since such is already linked to several payment methods that can be conveniently converted and transferred from one currency to another. This kind of step must be discovered and studied by your team before implementing such option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}