{
  "id": "topic_5464799",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "August 28, 2023, 08:23:36 AM",
  "content": "With not much newsworthy going on in the crypto space recently, Forbes publishes this article. As with any article that is based on a \"leak\", take it for what it's worth.Leak Reveals Elon Musk, X And Wall Street Could Be About To Cause Bitcoin And Crypto Price Chaos With ‘PayPal Update’https://www.forbes.com/sites/digital-assets/2023/08/26/leak-reveals-elon-musk-x-and-wall-street-could-be-about-to-cause-bitcoin-and-crypto-price-chaos-with-paypal-update/QuoteTesla billionaire and X owner Elon Musk has a habit of causing wild swings for the bitcoin price and other major cryptocurrencies (with Musk lobbing a grenade into the crypto market earlier this month).The bitcoin price has swung wildly over the last few months as economic and regulatory pressures mount—though traders are now braced for a $15.5 trillion September Wall Street earthquake.Now, after a U.S. Securities and Exchange Commission (SEC) insider has warned bitcoin and crypto buyers to beware of Binance, a leak has suggested Musk could turn X (Twitter) into an \"updated version of PayPalMusk \"continues to have conversations [with] top Wall Street executives on [the] future of X,\" Fox Business News correspondent Charles Gasparino, posted to X.\"Seems to be settling, they tell me, on a new-fangled payment system, [an] updated version of PayPal. It will offer low transaction costs (as opposed to credit cards) and monetize user info.\"...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464799",
  "comments": [
    {
      "author": "Kakmakr",
      "created_time": "September 01, 2023, 06:17:04 AM",
      "body": "Well, it might be a good move for Elon Musk, because he was the father of PayPal back in the day. (They bought his software and then expanded it into the empire it is today) So Elon Musk are very familiar with the inner workings of centralized payment systems and we hope he can take that next step to go into decentralized Blockchain technology like Bitcoin. Knowing him, he will take some small shitcoin like Shiba again and turn it into something huge, right after he bought a shitload of those tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "September 03, 2023, 06:52:25 AM",
      "body": "Hold on, how will this transformation of X (twitter) a social media platform move to become a PayPal kind of platform?? Aren't these two built for different purposes??Btw, with bitcoin being pushed under the umbrella of regulation...is it possible to have Elon Musk cautioned for his market manipulation to save our markets as these wild swings he causes on the crypto market cause alot of fear and panic and few are ready for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "September 03, 2023, 11:12:04 PM",
      "body": "Quote from: Woodie on September 03, 2023, 06:52:25 AMHold on, how will this transformation of X (twitter) a social media platform move to become a PayPal kind of platform?? Aren't these two built for different purposes??Btw, with bitcoin being pushed under the umbrella of regulation...is it possible to have Elon Musk cautioned for his market manipulation to save our markets as these wild swings he causes on the crypto market cause alot of fear and panic and few are ready for this.I think the goal is to have one platform where you can do everything, including pay people if you wish.  Instead of having to go to PayPal, Venmo, Facebook, Twitter/X and Instagram etc, you would just go one place and do everything there.Kind of like using HTTP/S on the internet except it is private.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "September 04, 2023, 09:32:42 PM",
      "body": "Quote from: Woodie on September 03, 2023, 06:52:25 AMHold on, how will this transformation of X (twitter) a social media platform move to become a PayPal kind of platform?? Aren't these two built for different purposes??Good question actually. I can't find any concrete information on what exactly are they planning to do. I don't think the move is only for the purpose of user-to-user tipping or for subscription fees etc. It'll probably be more than that.A little update: X obtained money transmitter licences from seven US states: https://www.finextra.com/newsarticle/42869/x-gains-payment-licences-in-seven-us-states",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}