{
  "id": "topic_5517788",
  "title": "bigmanik",
  "author": "bigmanik",
  "created_time": "November 11, 2024, 08:28:05 AM",
  "content": "One of the things I love about bitcoin is how it proved most people around the world wrong I came across this picture of someone who called Bitcoin a mess back in 2011, and it made me laughI really want to see his face now when he finds out that 1 of the mess is worth 80 thousand dollarsI'm really pained that I didn't invest in Bitcoin sooner, but I'm glad that I'm here nowCheers to better days ahead for BitcoinAnd to prove more skeptic wrong",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5517788",
  "comments": [
    {
      "author": "BIT-BENDER",
      "created_time": "November 11, 2024, 08:58:32 AM",
      "body": "This is just a picture and there is a high chance that this guy got into Bitcoin soon enough, maybe not during this tweet but even a year after this is tweet he got into Bitcoin and maintained consistency he would be good.One thing I have come to discover and I want you to understand is that the next best time is now. Being skeptical about Bitcoin from the time you heard it isn't a bad thing, infact I encourage everyone not to go head first into something because many people are backing it especially in finance.We all have our entry point in bitcoin after we must have done our research, and still more people would join in the cycle never ends. THE NEXT BEST TIME IS NOW",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "November 11, 2024, 09:07:10 AM",
      "body": "That guy should be the one in a mess now, because he didn't buy bitcoin then. In the beginning most people failed to take the risk on investing in bitcoin because they feel it wouldn't survive but bitcoin proved many of them wrong due to the problem it is solving in the world, which made people see its potentials and started adopting it making the price to increase in value.The fact is that, if you cannot beat them, you join them. Thi is why you see that even the people that have criticized bitcoin before has no option than to join the moving train because they don't want to be left out. Banks started failing and fiat depreciating, investors started diversifying their wealth into bitcoin to safe the value of their wealth and bitcoin didn't disappoint them. If you don't have any bitcoin investment yet, learn from that guy in the OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 11, 2024, 09:16:04 AM",
      "body": "Yeah, it's crazy how things change, isn't it? I bet that person is kicking themselves now! It's a good reminder to keep an open mind and not dismiss new ideas too quickly.It's wild to look back and see how far Bitcoin has come. I remember those early days too. It's inspiring to think about the potential for the future. Here's to hoping for continued growth and adoption!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 11, 2024, 09:27:09 AM",
      "body": "I think that if we're on that day, we'd also probably think the same thing. Uncertain is very high on those years when the majority don't trust internet assets that were new to everybody. So, those that have held for so long and are enjoying the profits now, they deserve it. They've taken the bashing of many about Bitcoin being a fraud, a scam, and any other negative characteristics that they've thrown to the early adopters. There are too many stories like that in the image and I can remember one who's Greg Schoen who have also bought bitcoin on the cheapest few bucks price but sold them eventually at little profit to losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "November 11, 2024, 09:29:29 AM",
      "body": "There were so many doubters back in the \"early years\". I myself in around 2014?when introduced to Bitcoin didnt give it too much thought.I would also say that there are a very small minority who carried Bitcoin throughthe years are are still active - otherwise we wouldnt be talking about it.And very few people back then if you said Bitcoin would grow to be valued at $80,000 one day would have believed you.Its easy to look back, its harder for many to look forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "November 11, 2024, 09:49:48 AM",
      "body": "When I was introduced to Bitcoin, I didn't believe in it either. I thought it was already suspiciously expensive (when the price was in the range of hundreds of dollars), and I didn't believe something purely digital could be considered real money and have real value. And that was years later than the guy in the tweet. It's understandable that it was a different time when it wasn't easy to believe in something so different from the rest of money and the rest of the asset market as well. What's important is to learn from mistakes. Both our own and those of others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "November 11, 2024, 09:51:53 AM",
      "body": "Quote from: BIT-BENDER on November 11, 2024, 08:58:32 AMThis is just a picture and there is a high chance that this guy got into Bitcoin soon enough, maybe not during this tweet but even a year after this is tweet he got into Bitcoin and maintained consistency he would be good.He is still using the same account and is still active there.Two years after that post, he posted again about bitcoin expressing shock about how bitcoin is already at $100. I could not find anything else that may imply that he has bought bitcoin but in 2021 he replied to the exact picture OP posted with a sad face. So, we can assume that he did learn his lesson and now regrets not buying bitcoin at that time.QuoteOne thing I have come to discover and I want you to understand is that the next best time is now. Being skeptical about Bitcoin from the time you heard it isn't a bad thing, infact I encourage everyone not to go head first into something because many people are backing it especially in finance.I do understand the skepticism though. Back then they did not have the historical data to prove or at least allow them to estimate future prices the way we do now. Crypto was very new back then and not everyone would have imagined for it to reach this high back then. But now with the rise of tech and crypto industry, no need to skeptical anymore and just buy bitcoin the moment the best possible entry to the market opens up for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "November 11, 2024, 10:07:00 AM",
      "body": "Quote from: bigmanik on November 11, 2024, 08:28:05 AMOne of the things I love about bitcoin is how it proved most people around the world wrong I came across this picture of someone who called Bitcoin a mess back in 2011, and it made me laughI really want to see his face now when he finds out that 1 of the mess is worth 80 thousand dollarsI'm really pained that I didn't invest in Bitcoin sooner, but I'm glad that I'm here nowYou need to know that the future is unpredictable and even Satoshi did not dare to make any assertions about the future of bitcoin at that time. So don't laugh or look down on those who have underestimated bitcoin in the past because I bet if you were in his position, you would not invest in bitcoin either or even despise it because at that time it really had no value. We are in bull season right now and making profits is quite easy so there are many newbies making very bold claims like you. But I wouldn't be surprised if you don't make a profit in this bull cycle and exit bitcoin when the bear season hits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "November 11, 2024, 10:27:11 AM",
      "body": "The fact is many persons who did HODL bitcoin back then didn't know for sure that it would eventually pump and turn out to be like this. Many of them mined and had them sitting in some wallets. Some bought very early when it had not much value from those that were either scared of Hodling or probably felt it was a waste of time. Either way only a few persons held because they believed for sure that bitcoin will be this big someday.The truth is that even for some persons that saw potential in bitcoin, many didn't imagine it to be this big today that's because if they did most of them would have bought more obviously. I bet that guy would have probably deleted the post if  he remembers he made it very long ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "November 11, 2024, 10:42:04 AM",
      "body": "If they knew Bitcoin price can be at $81k, they will not say like that but will buy as many Bitcoin as they can and hold it until now. But no one will know what will happen with the future especially to Bitcoin. That is happened to some people who knew about Bitcoin in that year or before that year. But they didn't trying to buy Bitcoin and say that Bitcoin will scam you. Well, that is okay if they say like that but they will regret if they see what happen to Bitcoin. Maybe we are regret not to invest in the beginning but that will not be a problem because we can still invest in Bitcoin now even if the price is at $81k. That is because considering of Bitcoin price can increase more than $81k so we can buy Bitcoin by allocating some money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandorak",
      "created_time": "November 11, 2024, 11:06:25 AM",
      "body": "Quote from: bigmanik on November 11, 2024, 08:28:05 AM[...] One of the things I love about bitcoin is how it proved most people around the world wrong I came across this picture of someone who called Bitcoin a mess back in 2011, and it made me laughI really want to see his face now when he finds out that 1 of the mess is worth 80 thousand dollarsI'm really pained that I didn't invest in Bitcoin sooner, but I'm glad that I'm here now [...]From the year the tweet was published, i'm sure that the person does not fully understand bitcoin, he probably only thinks of bitcoin as a ponzi scheme business. I tried to find out what he's doing now, and it's not crypto related. I'm sure he's involved in crypto at the moment, he just doesn't publicize it. Now that bitcoin prices are going up, do you think we will see $200,000 when the next halving happens?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 11, 2024, 11:12:07 AM",
      "body": "Quote from: bigmanik on November 11, 2024, 08:28:05 AMOpinions can often change, but not everyone's opinions can change. Maybe this person is one of those whose opinion changed; maybe not. If he is a person of influence who some people see as a mentor, his opinion must have influenced some of them into remaining skeptics until this day. Those are the people I pity the most: the ones who adopted these wrong opinions of their mentors on bitcoins and never bothered to research and get the correct info. Mentors can be wrong as well; this is why DYOR is necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "November 11, 2024, 12:00:31 PM",
      "body": "At first, I thought it was just a photoshop to draw traffic and attention on media until I verified the post and confirm it is real. I don't blame the poster for doubting bitcoin at that time and majority will do the same because of non popularity then. Moreover, not everyone update their real life activities on media, it might just be a deceit post or probably change of opinion occurred after making that post. From the history, that poster was an old influencer and they can post anything for attention. Don't be surprised if he owns thousands of dollars in bitcoin now. On the contrary, he will be regretting now if he failed to hope in then thinking it was a mess as he assumed. It's regrettable knowing about bitcoin for that long without having a reasonable amount of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "November 11, 2024, 12:26:14 PM",
      "body": "I guess this is not new for bitcoin. A lot have criticized bitcoin and conclude that it will never be a profitable investment. But look at it now, bitcoin is now the most talked and the most profitable investment so far. However, I don’t think this person is still seeing bitcoin as a mess until now, because just like anyone else, everyone is craving to invest in bitcoin, knowledge and sufficient funds are the keys. Otherwise, if you keep missing bitcoin investment, then you will never experience what it takes to be a successful bitcoin investor and enjoy all its benefits and advantages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "November 11, 2024, 01:57:43 PM",
      "body": "If that happened in 2011, it is likely that in 2013 onwards, he suddenly decided to save bitcoin, so if he started saving bitcoin in 2014, he somehow got a profit in Bitcoin. This is if he starts buying bitcoin. But if he didn't buy, he would probably feel guilty and ask himself why he didn't buy bitcoin when he criticized it.So it was difficult to criticize bitcoin at that time because now for sure they are putting Bitcoin to shame because their prediction and belief that bitcoin is wrongis now being swallowed because of shame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "November 11, 2024, 02:53:34 PM",
      "body": "Quote from: bigmanik on November 11, 2024, 08:28:05 AMOne of the things I love about bitcoin is how it proved most people around the world wrong If it weren't for this human quality, there would be no rich people (like early investors).When choosing a \"behavior model\" (in any business, not just finance), the opinion of the majority should be ignored. The same like \"act against the crowd.\"Quote from: bigmanik on November 11, 2024, 08:28:05 AMI came across this picture of someone who called Bitcoin a mess back in 2011, and it made me laughAnd your mention of this makes him burst into tears..  Quote from: bigmanik on November 11, 2024, 08:28:05 AMI really want to see his face now when he finds out that 1 of the mess is worth 80 thousand dollarsNo, not at all. You'll have to see that face when bitcoin costs $100-150k. Quote from: bigmanik on November 11, 2024, 08:28:05 AMI'm really pained that I didn't invest in Bitcoin sooner, but I'm glad that I'm here nowAnd yet, even having invested late, you were far ahead of those @NickAllen, who, having a big head start (discount) for buying, did not buy anything (bitcoin).Quote from: bigmanik on November 11, 2024, 08:28:05 AMCheers to better days ahead for BitcoinAnd to prove more skeptic wrong With each new ATH, the number of skeptics decreases. I hope it doesn't sound like they're going to commit suicide decreases because of lost profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "November 11, 2024, 02:59:58 PM",
      "body": "This isn’t new anymore, every bull run brings stories like this. It’s a reminder not to sell too early, since Bitcoin will eventually rise in the long run. If that person knew how to HODL, they wouldn’t be getting laughed at now. Right now, someone might even post about selling at $80k, doubting it’ll reach $500k. But we know that, over time, it’ll happen - the market always bounces back and turns bullish. That’s been proven time and time again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "November 11, 2024, 03:01:24 PM",
      "body": "That was sarcastic of him as I can see the date of that post on X which was November 2011 and if we have to refer adopt spreads of Bitcoin by then, it was not so large enough to kick a value higher than $2-$3 which it was able to attain then.So much interestingly as the widespread of the Bitcoin adoption expands on a wider range, so also the value increases. That is just how Bitcoin price was able to reach $80K + as at today.Never can tell that he must have become one of the adoptors of Bitcoin todays since he has wanted the value of Bitcoin to stably appreciate before he could buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "November 11, 2024, 03:02:27 PM",
      "body": "Quote from: bigmanik on November 11, 2024, 08:28:05 AMOne of the things I love about bitcoin is how it proved most people around the world wrong I came across this picture of someone who called Bitcoin a mess back in 2011, and it made me laughI really want to see his face now when he finds out that 1 of the mess is worth 80 thousand dollarsI'm really pained that I didn't invest in Bitcoin sooner, but I'm glad that I'm here nowCheers to better days ahead for BitcoinAnd to prove more skeptic wrong Do you really think he would be mess now? Maybe he realised bitcoin wasn't really a mess and later invested. 2011 was quite too early for anyone to really have faith in Bitcoin. Most of us here now would have said same about bitcoin considering the value of bitcoin as at that time. I do not blame those early guys for being ignorant, I'm sure some of them realised earlier and are here now. Those I would really be laughing at are those who are currently seeing the massive progress bitcoin is getting and still doubting the authencity of bitcoin. Sometimes I am forced to ask, what do these guys really want?Bitcoin has really gone through many ups and downs, what matters most right now is that we are all here partaking in bitcoin's growth.  There's a lot to gain, those still having doubts are really missing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}