{
  "id": "topic_5414673",
  "title": "FantasyDigital",
  "author": "FantasyDigital",
  "created_time": "September 23, 2022, 10:05:00 PMLast edit: September 04, 2023, 04:19:40 PM by FantasyDigital",
  "content": "WEBSITE | TWITTER | DISCORD | INSTAGRAM | WHITEPAPER | SWAPFantasy Digital Adult NFTS & CryptocurrencyCommunity-centric engagement ecosystem powered by the blockchain that provides creators & fans interactions via future technologies (AR/VR)https://www.fantasydigital.co/assets/images/twitter-screencap.jpgMORE THAN JUST ANOTHER ADULT TOKENFantasy Digital is not just a social token(FTXXX) & NFTs, we’re also focused on financial freedom in general, as well as mental health & wellness; entrepreneurship; and self leadership. We want every adult content creator to grow from each other.VISIONFantasy Digital will revolutionize the world of uncensored content by pairing our digital currency(FTXXX) with our upgradable membership NFTs. Weare able to provide fans with exclusive access to mixed reality content while providing a financial and technological infrastructure for adult content creators.Fantasy Digital will provide greater control and flexibility to content providers, while still providing fans with exclusive digital & physical collectibles. Supported by future web technologies, our unique Participate to Earn(P2E) business model will connect creators and fans/clients directly in new ways never imagined.The Solution: Fantasy DigitalFantasy TokenThe bedrock our operations and deployed on the Polygon Network. It creates the low fee, fast transaction monetization needed for content creator & fan interactions. This interaction includes tipping, membership upgrades, off chain gifting and our exclusive fan favorite voting system.Fantasy NFTsOur collectable utility NFTs.Starting with our StripNFTease which are our exclusive upgradable membership NFTs. Fans will use Fantasy Tokens to vote for their favorite adult artist, which will be featured in the next month's NFT. These NFTs will be the only way to gain access to artists' content & mixed reality experiences.Our secondary FantasyFetishNFT will be designed to connect content providers to fans that are looking for specialized content based on the needs of the fans/clients.Lastly our ContentCreatorNFT is how Fantasy Digital will onboard adult content providers and reward those participating in the mixed reality experiences. These will also be used for the token snapshot that will create the ContentCreatorsDAO for future platform governance.ExperiencesFantasy Digital will use current & future technologies to curate adult content for both virtual reality (VR) and augmented reality. Additionally Fantasy digital will host real life hybrid members’ only events that are synced to VR assets in the metaverse. These events could include club nights, hotel & cruise takeovers and worldwide fan meetups. Unlike other adult companies our focus will be on connecting adult content providers with fans/clients on a more personal interactive level then just creating an NFT marketplace.Fantasy RewardsDistributed monthly via the promotional pool both Content Providers and fans/clients are rewarded in FTXXX based on how they are participating in the Fantasy Digital ecosystem. Additional random airdrops of Special Edition NFTs, Private Event Tickets (physical/virtual) or FTXXX tokens will be sent to the most active fans/clients within the ecosystem.Monetization StrategyFantasy DigitalFantasy Digital will earn digital revenue by way of a 2% fee on token transactions, sale/resale of upgradable membership NFTs & ad based revenue within VR/AR digital experiences.Ambassadors/Content CreatorsAmbassadors & Content Creators can earn digital revenue via our StripNFTeases voting system, fan/client in world tipping, NFT Membership upgrades/activation, Promotional pool distribution, virtual/real world event attendance & sales of AR enabled physical items.Fans/ClientsFans/Clients can earn passive digital revenue by participating (P2E) within the Fantasy Digital ecosystem. These rewards will be distributed via the Promotional pool, as well as exclusive content creators collectable NFTs, digital wearables and AR enabled physical items.In The MediaFantasy Digital Launches Mixed Reality Adult Content (Ecosystem) Powered by NFTsAdult Content DeFi Ecosystem Fantasy Digital Announces $FTXXX Token Sale is Now Live2022 Review: Fantasy DigitalFantasy Digital to Showcase Creator Platform at XBIZ BerlinFantasy Digital Announces Peepshow Event & Award-Winning Cam Star Cara Vega Is Now on the PlatformPlatform Live. Click Here!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414673",
  "comments": [
    {
      "author": "FantasyDigital",
      "created_time": "September 23, 2022, 10:27:23 PMLast edit: September 24, 2022, 12:16:19 AM by FantasyDigital",
      "body": "Peepshow | Part 2Decentralands' naughtiest group NFT exhibition is back!Prepare yourself for dozens of artists displaying sexually explicit NFTs from fine art nude to the extreme erotica.The Peep Show is your big excuse to delve into the deepest regions of your depraved mind and explore the diversity of human sexuality in all its intimate seductions.When: September 30, 2022Where: Decentraland Metaverse | https://play.decentraland.org/?position=-13%2C30This 18+ event is available to Fantasy Token holders of 100+ FTXXXToken holders will have exclusive access to the event, as well as being rewarded via Fantasy Digitals Participate 2 Earn program!https://www.fantasydigital.co/templates/assets/img/news/peepshow-blog-sept.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blowon",
      "created_time": "September 24, 2022, 08:23:15 PM",
      "body": "Can't wait to wait for 5 more days, my depraved mind starts crazy, hopefully I can find something that is satisfying here yes I mean cool NFT, want to see more collections that are even cooler and more watering",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "September 25, 2022, 04:43:00 PM",
      "body": "Nominate blockchain ecosystem Fantasy Digital in the 2022 Fleshbot Awards for Emerging Brand in the tech category!Head over to http://fleshbotawards.com/submit-a-nominee/ to get us nommed!Nominations close on September 28th.You must have an account to #rockthevote but it FREE to open one.https://pbs.twimg.com/media/FcepRdZaUAAB0WX?format=jpg&name=small",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "September 26, 2022, 02:35:29 PM",
      "body": "Last Chance to take part in our September promotionClick Here to Get Startedhttps://pbs.twimg.com/card_img/1573753729433870336/aJ70XKeN?format=jpg&name=small",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "September 26, 2022, 04:31:12 PM",
      "body": "Have a listen to our amazing co-founder as she chats with stripped by sia about cryptocurrency, nfts, the metaverse & empowering nsfw content creators & their fans 💯🔽https://podcasts.apple.com/ca/podcast/stripped-by-sia/id1480743814?i=1000580546655",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blowon",
      "created_time": "September 26, 2022, 05:02:16 PM",
      "body": "Quote from: FantasyDigital on September 26, 2022, 04:31:12 PMHave a listen to our amazing co-founder as she chats with stripped by sia about cryptocurrency, nfts, the metaverse & empowering nsfw content creators & their fans 💯🔽https://podcasts.apple.com/ca/podcast/stripped-by-sia/id1480743814?i=1000580546655 interesting I can't wait for about 3 more days, I hope you will also hold an AMA, this way we also get useful information and we can also ask questions directly and get answers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "September 26, 2022, 05:15:26 PM",
      "body": "Quote from: Blowon on September 26, 2022, 05:02:16 PMQuote from: FantasyDigital on September 26, 2022, 04:31:12 PMHave a listen to our amazing co-founder as she chats with stripped by sia about cryptocurrency, nfts, the metaverse & empowering nsfw content creators & their fans 💯🔽https://podcasts.apple.com/ca/podcast/stripped-by-sia/id1480743814?i=1000580546655 interesting I can't wait for about 3 more days, I hope you will also hold an AMA, this way we also get useful information and we can also ask questions directly and get answersWe are planning to do a little open house before the Peepshow experience to reveal the new build in Decentraland.There you are more then welcome to ask any questions.We are also available anytime in our discord https://discord.com/invite/8ugU8rwgXrWe offer a Participate 2 Earn model so any questions should be asked on discord to take advantage of our rewards program",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blowon",
      "created_time": "September 28, 2022, 09:27:37 PM",
      "body": "Quote from: FantasyDigital on September 26, 2022, 05:15:26 PMQuote from: Blowon on September 26, 2022, 05:02:16 PMQuote from: FantasyDigital on September 26, 2022, 04:31:12 PMHave a listen to our amazing co-founder as she chats with stripped by sia about cryptocurrency, nfts, the metaverse & empowering nsfw content creators & their fans 💯🔽https://podcasts.apple.com/ca/podcast/stripped-by-sia/id1480743814?i=1000580546655 interesting I can't wait for about 3 more days, I hope you will also hold an AMA, this way we also get useful information and we can also ask questions directly and get answersWe are planning to do a little open house before the Peepshow experience to reveal the new build in Decentraland.There you are more then welcome to ask any questions.We are also available anytime in our discord https://discord.com/invite/8ugU8rwgXrWe offer a Participate 2 Earn model so any questions should be asked on discord to take advantage of our rewards programok thank you for your response, I will participate in your event you will do it too I will join your discord communitythe more active you work apart from development, the community will also be happy if you are often involved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "September 29, 2022, 03:24:10 AM",
      "body": "🚀  Smart Contract Audit Completed  🔐We are happy to announce that we have performed a successful smart contract audit with Solidity Finance and our contract has no major vulnerabilities 🦄📄  Audit Report: https://solidity.finance/audits/FantasyToken/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "September 29, 2022, 06:39:31 PM",
      "body": "Hey, FantasyFanatic!We have another podcast announcement 🔥 Dick Dangle - Show 408 with guest host Madalynn Raye & an interview with our co-owner at the 43:38 mark! Dangle On!🎧 Available on Spotify, IHeart, Google Pod, Apple Pod @skyhawkafterda1, Stitcher & Castbox Apphttps://danglinafterdark.com/fantasy-digital-episode-408/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "September 30, 2022, 07:08:38 PM",
      "body": "We are just moments away from our Peepshow Adult NFT showcase in Decentraland.Jump in early to avoid the crowdhttps://play.decentraland.org/?position=-12%2C30&realm=hephaestus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "October 03, 2022, 03:26:55 AM",
      "body": "Thank you Everyone that attended our Adult NFT showcase in Decentraland on FridayHere is a sneak peak of our newest DCL experienceCreators, studios & charities, we can get you into the metaverse, all you need is an idea.This just one our turnkey spaces we have available!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "October 08, 2022, 10:44:39 PM",
      "body": "Septembers' P2E promotional pool distribution to creators & fans was 460.83945712066475 FTXXX TokensBy taking part in our ecosystem you earn rewards that are redistributed as our native token FTXXXLearn more here https://www.fantasydigital.co/fantasy-rewards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "October 10, 2022, 06:20:03 PM",
      "body": "Hey #FantasyFanaticsHelp support Fantasy Digital by voting for our project on Coinsniper.net https://coinsniper.net/coin/40410",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "October 28, 2022, 04:50:14 PM",
      "body": "The team has begin the development of our Social Discovery ecosystem features for creators & brands.Our first roll out for these features is industry news listings with connections to Creators/Brands within the ecosystem.Our first listed PR is Jenna Starr Gains Playmate Status From Playboy SwedenWe will be following this with a new public/follower/subscriber creator story feed.Finally we will complete the Ad network for creators/brands to create their own personal ad network within the ecosystem.All transactions within the ecosystem will utilize our native token FTXXX which will increase token utility.Once again, Thank you everyone for being part of this processCheers, Fantasy Digital Team",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "October 31, 2022, 09:02:00 PM",
      "body": "We currently have arrangements with three adult industry PR firms to publish the latest creator articles on Fantasy Digital which is the beginning of our move to add more social discovery on our website.You can preview the latest adult news here https://www.fantasydigital.co/industry-news",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "November 01, 2022, 06:31:43 PM",
      "body": "New issue of Xbiz Magazine is available onlineCheck out the exclusive Fantasy Digital feature by our co-founder on page 76https://www.xbiz.com/pub/xbizworld/2022-11/index.html?page=76",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "November 04, 2022, 10:29:34 PM",
      "body": "Fantasy Rewards will be issued this weekend to all Creators & Fans that earned points for the month of Oct.Need Fantasy Rewards? Check out our Participate to Earn Information Pagehttps://www.fantasydigital.co/fantasy-rewards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasyDigital",
      "created_time": "November 06, 2022, 04:35:46 PM",
      "body": "FTXXX Business Wallet Transaction Update1500 Matic & 3,746,777.1067 FTXXX was added to the Liquidity Pool Yesterdayhttps://polygonscan.com/tx/0x6b577f483398f3365528712c446088d31efa065e4811b89294cb95c7d22f71c2FTXXX Pool Details  - https://info.uniswap.org/#/polygon/pools/0x8e019016e932a356b964e57a16f8b42f9b664b93",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}