{
  "id": "topic_5403998",
  "title": "Yawa2020",
  "author": "Yawa2020",
  "created_time": "June 25, 2022, 08:37:54 AM",
  "content": "For over two weeks now, I have been seeing several posts on meta force forsage that'll be launched ending of this month (28th to be precise). According to the posts, the project is massive and will make lots of people millionaire depending on your efforts directly or indirectly by referring more people to join. At this point, I'm totally in a stage of pandemonium and wondering how referring people to join a project will make someone to become rich. I understand the fact that perhaps is because I'm new to crypto space. Hence, I will like to hear your views and experience in FORSAGE and how it works.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403998",
  "comments": [
    {
      "author": "Mr. Magkaisa",
      "created_time": "June 25, 2022, 09:54:14 AM",
      "body": "Quote from: Yawa2020 on June 25, 2022, 08:37:54 AMFor over two weeks now, I have been seeing several posts on meta force forsage that'll be launched ending of this month (28th to be precise). According to the posts, the project is massive and will make lots of people millionaire depending on your efforts directly or indirectly by referring more people to join. At this point, I'm totally in a stage of pandemonium and wondering how referring people to join a project will make someone to become rich. I understand the fact that perhaps is because I'm new to crypto space. Hence, I will like to hear your views and experience in FORSAGE and how it works. If you are new into crypto business, my advise to you is be careful in terms of investing here in the crypto world. By the way, just wanna give you a few reminders and warning, don't you get easily hype with those sweet words coming from them. Because 2 years ago there was a Forsage also flagged as one of the scam, they may have a different name, but the people behind could be the same as 2 years ago something like that here check this link https://coingeek.com/forsage-ponzi-scheme-ordered-to-cease-and-desist-in-philippines/.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 25, 2022, 03:46:01 PM",
      "body": "Quote from: Yawa2020 on June 25, 2022, 08:37:54 AMFor over two weeks now, I have been seeing several posts on meta force forsage that'll be launched ending of this month (28th to be precise). According to the posts, the project is massive and will make lots of people millionaire depending on your efforts directly or indirectly by referring more people to join. At this point, I'm totally in a stage of pandemonium and wondering how referring people to join a project will make someone to become rich. I understand the fact that perhaps is because I'm new to crypto space. Hence, I will like to hear your views and experience in FORSAGE and how it works. If you see the word will Quotemake a lot of money and QuoteForsage that's a sign that you should be very careful investing in this kind of project or do not invest at all, Forsage was a notorious pyramid Ponzi scheme that was so popular several years ago, I don't know whey is using the name again, but the authorities have issued warnings to be careful investing in this project years ago, it's a Ponzi scheme and referral-based project that was based on Ethereum contract.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 25, 2022, 04:01:11 PM",
      "body": "Beware of riding on the waves of noise, investing in projects without prior evaluation is like a blind man trying to cross a high wall that does not care about the consequences. If you are confident that you are in the right place and the project is promising and has advantages that make it achieve profitable goals, you can join it.I don't think the time is right to invest, you know that the market is in a tight phase. That is why it is preferable to take a break and try to explore what is happening in the market and choose the most promising projects above all!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "June 25, 2022, 04:40:37 PM",
      "body": "I really appreciate you all for the opinions and views provided here so far. But I will appreciate more if you guys can recommend any alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoababe",
      "created_time": "June 26, 2022, 09:54:47 AM",
      "body": "Quote from: Yawa2020 on June 25, 2022, 04:40:37 PMI really appreciate you all for the opinions and views provided here so far. But I will appreciate more if you guys can recommend any alternative. The best thing to do to be safe is to buy and hold. Apart from this, you can find a reliable place to stake your coins or tokens. Or participate in liquidity mining with a safe project.It's not as profitable as ponzi like a forage but it's safer and more reliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}