{
  "id": "topic_5423216",
  "title": "Pillsike",
  "author": "Pillsike",
  "created_time": "November 26, 2022, 06:09:05 AM",
  "content": "Thailand's largest digital asset exchange Bitkub considers going public by 2024. The CEO, jirayut srupsrisopa is considering Hong Kong over New York and other jurisdictions to go public. He also noted that a large amount of Bitkub's customers is based in southeast Asia that's what likely influenced the firms decision to choose Hong Kong over other jurisdictions.      The firm is no stranger to chaos, they've had their own share of difficult conditions. They are currently recovering from the collapse of FTX on 11 November.  For the firm to bring this to the public it shows they've recovered most of their lost assets during the collapse, the release of Bitkub will have a huge effect in the crypto market both positively and negatively.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423216",
  "comments": [
    {
      "author": "Majestic-milf",
      "created_time": "November 26, 2022, 09:10:27 AM",
      "body": "It would be appreciated if you can at least pair your post with a link where someone can be able to get more information on what you dropped, op. This is quite welcome for the Bangkok based crypto exchange but I think there's a little to be wary of about them. It seems that Thailand's regulators have set their sights on the platform since there has been allegations of inaccurate reportings and wash trading on it's platform where agents of Bitkub tended to inflate trading interests of matching buying and selling orders. This practice of wash trading has been prohibited.  Coupled with other miscrepancies that they have experienced, I'd  sure think twice before I keep my assets on them. Wouldn't want another repeat of an FTX saga. Here's the link BTW. https://financefeeds.com/thailands-crypto-exchange-bitkub-to-go-public-in-hong-kong/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 26, 2022, 11:59:40 AM",
      "body": "I don't know the way Thailand's regulations work, but does anyone know / have a link to how extensive are the financial / operations checks when you are going public?Here in the US it's actually pretty lax, once you are public you do have more scrutiny but that also depends on a lot of other factors such as where it's being traded. Pink sheets / OTC don't require nearly as much as other things: https://www.investopedia.com/terms/p/pinksheets.aspGetting listed in a highly regulated environment does allow them to say 'we are somewhat legit'. But, considering the number of legit places that have imploded due to fraud over the years it does not mean as much as it used to.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "November 26, 2022, 11:10:20 PM",
      "body": "I assume there'll be an emergence of quite a few exchanges trying to take over from ftx. It'd probably be better if bitmex find a way to move their platforms and make them non kyc in other places (such as by using isolated companies like ftx did) as I think ftx took a lot of their customers when they implemented it.It does seem weird they'd find a way to launch it out of Hong Kong though as they're not portrayed by the media as a safe place for stating a business (unless China keeps it an autonomous zone or at least a bit separate from them so it can continue functioning as the capitalist dystopia it's been made to be). Going public in Thailand/Bangladesh or Singapore would open up a much bigger international market imo (though there are a lot of asset management firms run from Hong Kong so I might be wrong).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}