{
  "id": "topic_5421877",
  "title": "LucaC",
  "author": "LucaC",
  "created_time": "November 17, 2022, 02:16:29 PM",
  "content": "What are some of the largest mining facilities in the world?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421877",
  "comments": [
    {
      "author": "Zionodes",
      "created_time": "November 18, 2022, 06:03:49 AM",
      "body": "Canada, the United States, Iceland, Georgia, and Switzerland have some of the largest Bitcoin mining facilities. Visit https://www.zionodes.com/blog/mining-facilities-landscape-overview to learn more about why these locations are so popular.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "November 18, 2022, 11:56:45 PM",
      "body": "How are you gonna know?It isn't like a dozen folks are going to announce that they are the largest mining facility, let alone make it so easy to grade and determine who's the biggest But if you are interested in some data in general, maybe check out sites like;- https://www.statista.com/statistics/1200477/bitcoin-mining-by-country- https://www.sunbirddcim.com/infographic/largest-bitcoin-mining-farms-world",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "November 19, 2022, 05:03:26 AM",
      "body": "Before the last raid on crypto miners in China 🇨🇳  this country has the largest mining farms compare to some other countries, almost all adults in the country are into crypto mining, I am sure this country will be in the top 3 or 5 .Sadly, the government ruined so many asic miners that was mining illegally and banned any crypto-mining activities in the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 19, 2022, 08:26:51 AM",
      "body": "Saw one a few years ago in China using hydroelectric energy and other renewable energy where the climate is ideal to mine bitcoin. It's like a factory or warehouse where they've been doing all the operations. It's even catered to by one employee of the company for which he is maintaining all the hardware and does all repairs and replacements. I also saw a mining farm in Iceland for we know how the climate is there and IIRC, that's Genesis mining. It was even featured and reported on Vice News.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "November 19, 2022, 08:01:41 PM",
      "body": "Bitcoin mining companies have seen their valuations fall as the price of bitcoin (BTC) is in the midst of a bear market, depressing the profit margins of those who create it. The performance of the exchange traded fund (ETF) Valkyrie Bitcoin Miners (WGMI) shows the extent to which the value of the crypto mining business was affected. As of 11 November, the fund was trading over 70% below its launch price in February 2022.What are the largest public bitcoin mining companies and how are they weathering the storm? Here we take a look at the biggest mining stocks by market capitalisation.What is bitcoin mining?Bitcoin mining involves solving mathematical puzzles to process the transactions of the bitcoin blockchain and earn rewards. By performing this task, new BTC tokens are created and miners are compensated for their efforts, equipment and electricity bills. Some sophisticated hardware is needed to mine bitcoin profitably as the difficulty of the puzzles increases to reduce the speed at which the asset’s supply expands. The largest bitcoin mining companies own thousands of devices that solve the problems faster than a human can. The total value of the BTC tokens they receive in return is considered the company’s revenue.The cost of running large bitcoin mining companies includes the electricity needed to power the devices, maintenance for the mining farms’ expensive cooling systems, personnel and other operating costs typical to any business.In 2022, the bitcoin mining sector entered one of its worst bear markets since the digital asset made its appearance in 2009 as a deterioration in macroeconomic conditions across the world has pushed the value of BTC to its lowest level in 20 months, as of early November.Meanwhile, industry-specific developments such as the collapse of the Terra ecosystem and the Celsius Network, along with the FTX liquidity crunch hurt the price of BTC, sending shockwaves through cryptocurrency markets. Largest public bitcoin mining companiesSo what are the largest public bitcoin mining companies? Below is the list of the biggest miners by market capitalisation according to CompaniesMarketCap data as of 11 November.Marathon Digital Holdings (MARA)Marathon Digital (MARA) is the first stock on the list of bitcoin mining companies. The firm is a former uranium and vanadium exploration business turned to bitcoin mining after the firm merged with Global Bit Ventures back in 2017. By the end of 2021, the company reportedly accounted for 2.1% of the global bitcoin hash rate.Marathon has facilities in South Dakota, Nebraska, Montana and Texas. The company aims to power its bitcoin mining facilities with renewable sources of energy by the end of the 2022 fiscal year.By the end of 2021, Marathon had reserves of 8,115 BTC, including 4,794 it held in an investment fund. These holdings were valued at approximately $346m at that point, but are possibly worth much less now as the value of BTC has declined sharply in 2022. During this same period, the firm generated total revenues of $150.46m, but incurred a loss of $85.09m. In addition, Marathon had long-term debt of $728.40m on total assets of $760.09m, including $268.52m in cash and equivalents. This appeared to be the most indebted crypto mining company on the list.Riot Blockchain (RIOT)Riot Blockchain (RIOT) is another stock on the biggest public bitcoin mining companies list. The firm also offers its facilities to other large-scale mining businesses so they can establish their own farms by taking advantage of the firm’s proprietary infrastructure.Riot’s primary mining location is in Rockdale, Texas. The firm operated 30,907 mining rigs by the end of 2021, and had 4,884 BTC tokens in reserve that were valued at $159.54m at the time.By the end of this year, the company produced $213.24m in revenue, most of which came from its proprietary mining operation. It also booked a net loss of $7.93m, had no long-term debt, and boasted $312.32m in cash and equivalents. Canaan (CAN)Canaan (CAN) is a Chinese company that has established a subsidiary in the Cayman Islands to be able to offer its common shares to US-based investors via American Depositary Shares (ADS). The firm has manufactured crypto mining rigs since 2013 for bitcoin mining companies under the Avalon brand.So far the company has developed nine mining rigs, including the first generation of its A1246 units, which was released in 2020. The miner also produces AI-powered applications.By the end of 2021, Canaan had 346 employees, produced revenue of $1.42bn – most of which came from the sale of its flagship mining rigs – and booked a net loss of $1.02bn. The company also reported no long-term debt and had cash and equivalents of $421.23m. Hut 8 Mining (HUT)Founded in 2017, Hut 8 (HUT) is one of North America’s oldest bitcoin mining companies. The firm is headquartered in British Columbia, Canada, and, apart from its main mining operation, also offers processing services to institutions.According to its website as of 11 November, the firm had three digital asset data mining facilities, five multi-tier data centers for high-performance computing, more than 400 customers for its advanced computing solutions, and 7,078 BTC tokens in reserve as of 31 May 2022.By the end of 2021, Hut 8 generated revenues of $173.77m and net losses of $72.71m. In addition, the firm had long-term debt of $24.2m and cash and equivalents of $140.13m.Cipher Mining (CIFR)Cipher (CIFR) is the last on our list of the five largest bitcoin mining companies. Cipher is a fast-growing industrial-scale firm with operations in the US. In February 2022, the firm started running its first facility in the country and had plans to activate another two to four sites that could be fully powered by renewable energy.Cipher is a pre-revenue company. In 2021 full-year, the firm booked net losses of $72.15m, had no long-term debt, and reported cash and equivalents of $209.84m. The company went public in August 2021 via a merger with a special purpose acquisition company (SPAC) called Good Works. In August 2021, it signed agreements with Bitmain Technologies and SuperAcme Technologies to acquire 27,000 and 60,000 miners respectively. A portion of this equipment should be up-and-running in 2022. However, the company’s latest quarterly reports do not yet show any revenues. Cipher’s mining operations will be based in Alborz, Texas, where its first facility has been built.The bottom lineNote that the current list of the largest bitcoin miners is subject to change as the prices of individual shares fluctuate. Hence, this data shouldn’t be used as a substitute for your own research. Always conduct your own due diligence, studying the company’s fundamentals and technicals in detail, looking at the latest news and a wide range of analyst commentary. Remember, past performance does not guarantee future return. And never trade money you cannot afford to lose. https://capital.com/amp/biggest-global-crypto-bitcoin-mining-companies-ranking-btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Laurendaldin",
      "created_time": "November 23, 2022, 03:17:12 PM",
      "body": "Quote from: DeathAngel on November 19, 2022, 08:01:41 PMThe performance of the exchange traded fund (ETF) Valkyrie Bitcoin Miners (WGMI) shows the extent to which the value of the crypto mining business was affected. As of 11 November, the fund was trading over 70% below its launch price in February 2022.Oh, we can only hope that the cryptomarket will survive all the shocks of this year. Although after the fall of the FTX exchange, we can no longer be sure of anything. The saddest thing is that if the cryptocurrency finally collapses, such a wonderful tool of decentralization and getting out of total control will most likely no longer be taken seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}