{
  "id": "topic_5476452",
  "title": "Black Mbaye",
  "author": "Black Mbaye",
  "created_time": "December 04, 2023, 07:20:51 AM",
  "content": "Aylık enflasyon %3.28 artış yaşarken, yıllık enflasyon %61.98 olmuş. Kasım ayında yaşanan bu enflasyon olaylarından sonra Ocak ayında açıklanacak aralık ayı enflasyonunun daha düşük çıkartılacağını düşünüyorum.Kaynak : https://www.tcmb.gov.tr/wps/wcm/connect/TR/TCMB+TR/Main+Menu/Istatistikler/Enflasyon+Verileri/Tuketici+Fiyatlari",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476452",
  "comments": [
    {
      "author": "Hvdv",
      "created_time": "December 04, 2023, 08:43:19 AM",
      "body": "Kasımdan sonra Aralık ayındaki enflasyon memur ve emeklileri ilgilendiriyor. Dolaylı yoldan asgari ücretliyi de etkiliyor çünkü asgari ücretliyi enflasyona ezdirmeyeceğiz sözü var. Eğer bu söz doğruysa şimdiden %40 zam almaları ve asgari ücretin minimum 15 bin olması gerekiyor. Yoksulluk ve açlık sınırlarını ve senede artış olmayacağını da hesaba katarsak asgari ücretin 17-18 bin bandına çekilmesi gerekiyor bence bu enflasyon oranları bunu bize gösteriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "December 04, 2023, 09:31:09 AM",
      "body": "Çeşitli kuruluşların Kasım ayı için verdiği enflasyon oranları şöyle:TÜİK: %61,98İTO: %73,89ENAG: %129,27 Devlet ücret artışlarını konuşurken TÜİK verisini baz alacak. Yüksek zam bekleyenler boşuna umutlanmasın. Enflasyon düşük diye sevinçle açıklama bile yapabilirler.Ufak bir anket yapılmış hangi enflasyon oranı size gerçeğe daha yakın geliyor diye, sonuçlar ortada. Daha düşük hisseden olduğunu sanmıyorum aldığımız belli verdiğimiz belli geriye kalan belli sonuçta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "December 04, 2023, 10:25:02 AM",
      "body": "Quote from: LGD2Business on December 04, 2023, 09:31:09 AMÇeşitli kuruluşların Kasım ayı için verdiği enflasyon oranları şöyle:TÜİK: %61,98İTO: %73,89ENAG: %129,27 Devlet ücret artışlarını konuşurken TÜİK verisini baz alacak. Yüksek zam bekleyenler boşuna umutlanmasın. Enflasyon düşük diye sevinçle açıklama bile yapabilirler.Ufak bir anket yapılmış hangi enflasyon oranı size gerçeğe daha yakın geliyor diye, sonuçlar ortada. Daha düşük hisseden olduğunu sanmıyorum aldığımız belli verdiğimiz belli geriye kalan belli sonuçta.Enag oranı bence de daha gerçekçi olan oran, fiyatlar çok yükseldi ve markete girince enflasyon kendisini fazlasıyla hissettirdi, 200 ml pınar sütler 11 liraya çıktı, 1/5 litre süt 11 lira, 1 litre olan 40 lira civarında seyrediyor, zeytinyağı, Çiçekyağı ise daha yüksek fiyatlara çıkıyor artık,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "December 04, 2023, 12:18:20 PM",
      "body": "Bencede en gerçekçi ENAG görünüyor yani gerçeğe en yakını diyelim belki o bile az kalıyordur. Enflasyonun nasıl hesaplandığını ve hangi ürünlerin olduğunuda açıklasalar keşke ama o kadar şeffaf olacaklarını beklemiyorum. Maaş artışlarına göre açıklanacak oran zaten aylar öncesinden belliydi zamanı geldikçe açıklaması yapılıyor sadece ben hesaplama falan yapıldığını kesinlikle düşünmüyorum. Sabah radyoda % 3 ile 4 arası bir enflasyon beklentisi olduğu konuşuluyordu yani ne açıklanacağı belliydi aslında.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "December 04, 2023, 02:04:56 PM",
      "body": "Quote from: ZekiBeyy on December 04, 2023, 12:18:20 PMBencede en gerçekçi ENAG görünüyor yani gerçeğe en yakını diyelim belki o bile az kalıyordur. Enflasyonun nasıl hesaplandığını ve hangi ürünlerin olduğunuda açıklasalar keşke ama o kadar şeffaf olacaklarını beklemiyorum. Maaş artışlarına göre açıklanacak oran zaten aylar öncesinden belliydi zamanı geldikçe açıklaması yapılıyor sadece ben hesaplama falan yapıldığını kesinlikle düşünmüyorum. Sabah radyoda % 3 ile 4 arası bir enflasyon beklentisi olduğu konuşuluyordu yani ne açıklanacağı belliydi aslında.Gelecek ay beklenti de herhalde 3 civarında olacak. Seçim ayının gelmesi dolayısıyla belki zammı %50’ye tamamlarlar. Zamların bir anlamı yok. Çünkü ENAG’ın açıkladığı verilere göre hareket edilip %200 zam verilmediği için alım gücü günden güne kaybediliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "December 05, 2023, 08:11:00 AM",
      "body": "Quote from: Hvdv on December 04, 2023, 08:43:19 AMKasımdan sonra Aralık ayındaki enflasyon memur ve emeklileri ilgilendiriyor. Dolaylı yoldan asgari ücretliyi de etkiliyor çünkü asgari ücretliyi enflasyona ezdirmeyeceğiz sözü var. Eğer bu söz doğruysa şimdiden %40 zam almaları ve asgari ücretin minimum 15 bin olması gerekiyor. Yoksulluk ve açlık sınırlarını ve senede artış olmayacağını da hesaba katarsak asgari ücretin 17-18 bin bandına çekilmesi gerekiyor bence bu enflasyon oranları bunu bize gösteriyor.Hocam asgari ücretliyi enflasyona ezdirmeyeceğiz yalanı yıllardır var, çözüme kavuştuğunu görev var mı sorunun, yok. Hatta bizzat kendi elleriyle bu hale getirdiler memleketi, orta direk birkaç sene içinde neredeyse bitti, fakir kesim kendi içinde sınıflanmaya başladı. Şimdi asgari ücreti 20k yapsalar, adamın ev sahibi de kirayı ona göre yapacak, marketteki fiyatlar yeniden revize olacak, kısaca hayatın her alanına yansıyacak bu artış, ee sonuç, 11500 ile alabildiğini 16000 ile alamayacak mesela asgari ücretli. son 3 yıldır kısır döngünün kralına girdi memleket ve hala aynı yöntemlerle çözüme ulaşılacağını sananları gördükçe ülkeden de ümidimi kesiyorum ne yazık kı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "December 05, 2023, 01:28:46 PM",
      "body": "Quote from: totti67 on December 05, 2023, 08:11:00 AMQuote from: Hvdv on December 04, 2023, 08:43:19 AMKasımdan sonra Aralık ayındaki enflasyon memur ve emeklileri ilgilendiriyor. Dolaylı yoldan asgari ücretliyi de etkiliyor çünkü asgari ücretliyi enflasyona ezdirmeyeceğiz sözü var. Eğer bu söz doğruysa şimdiden %40 zam almaları ve asgari ücretin minimum 15 bin olması gerekiyor. Yoksulluk ve açlık sınırlarını ve senede artış olmayacağını da hesaba katarsak asgari ücretin 17-18 bin bandına çekilmesi gerekiyor bence bu enflasyon oranları bunu bize gösteriyor.Hocam asgari ücretliyi enflasyona ezdirmeyeceğiz yalanı yıllardır var, çözüme kavuştuğunu görev var mı sorunun, yok. Hatta bizzat kendi elleriyle bu hale getirdiler memleketi, orta direk birkaç sene içinde neredeyse bitti, fakir kesim kendi içinde sınıflanmaya başladı. Şimdi asgari ücreti 20k yapsalar, adamın ev sahibi de kirayı ona göre yapacak, marketteki fiyatlar yeniden revize olacak, kısaca hayatın her alanına yansıyacak bu artış, ee sonuç, 11500 ile alabildiğini 16000 ile alamayacak mesela asgari ücretli. son 3 yıldır kısır döngünün kralına girdi memleket ve hala aynı yöntemlerle çözüme ulaşılacağını sananları gördükçe ülkeden de ümidimi kesiyorum ne yazık kı. Yıllardır vaat edilen bu, bakalım bu dönemde zam nasıl olacak? Geçen sene dolar bazında maaşı biraz ikinci zamla iyileştirmeye çalıştılar ama personel zamları yüzünden garip bir şekilde fiyatlar da artış gösterdi, geçen gün bir gofreti 6 liraya üç harfli marketlerden birinden aldım, yıllarca 50 kuruş, 1 liraya aldığımız gofret 6 lira olmuş,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "December 05, 2023, 03:20:35 PM",
      "body": "Quote from: LGD2Business on December 04, 2023, 09:31:09 AMÇeşitli kuruluşların Kasım ayı için verdiği enflasyon oranları şöyle:TÜİK: %61,98İTO: %73,89ENAG: %129,27 Devlet ücret artışlarını konuşurken TÜİK verisini baz alacak. Yüksek zam bekleyenler boşuna umutlanmasın. Enflasyon düşük diye sevinçle açıklama bile yapabilirler.Ufak bir anket yapılmış hangi enflasyon oranı size gerçeğe daha yakın geliyor diye, sonuçlar ortada. Daha düşük hisseden olduğunu sanmıyorum aldığımız belli verdiğimiz belli geriye kalan belli sonuçta.Çok uzun zamandır TUIK tarafından açıklanan hiçbir veriyi dikkate almıyor ve inanmıyordum çünkü enflasyon oranı gibi biz bireylerin çok kolay bir şekilde gözlemleyebileceği veriler maalesef hiç gerçeği yansıtmıyor. Özellikle son zamanlarda TUIK biraz daha mantıklı veriler açıklamaya başlamış olsa da Kasım ayı için açıklanan oranı da açıkçası pek dikkate almak istemiyorum çünkü ENAG verileri güncel koşullarda çok daha gerçekçi durmaktadır.Tabii ki, söz konusu asgari ücret ve maaşlar için gerçekleşecek zam olduğu zaman devletin dikkat edeceği oran Türk halkının inandığı ve daha gerçekçi açıklamada bulunan ENAG değil TUIK olacağından ötürü çok ciddi bir artışın meydana geleceğini düşünmüyorum. Hatta, senin de belirttiğin gibi yılsonu daha düşük bir enflasyon oranının açıklanması ihtimali de olası maaş ve asgari ücret artışlarının kısılması adına yapılma potansiyeli bulunan bir durumdur. Hadi, tüm bunlar bir kenara, tıpkı her asgari ücret ve maaş artışı dönemlerinde olduğu gibi daha yeni ücreti alamadan önce birçok ürünün bu artışın üzerinde fiyatının arttığını da göreceğimizden emin bir şekilde buraya yazıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "December 05, 2023, 05:25:31 PM",
      "body": "memura sene başında verilecek olan zam+enflasyon farkı ile sanırım maaşlarındaki artış %50'yi göremeyecek. bir yandan memur maaşlarının özel sektöre oranla yüksek olmasını istemiyorum. bunun içinde alınan zam oranları da var. sebebi ise okuldan yeni mezun olan herkesin kurtuluş yolu olarak kamuyu hedeflemesi. herkes memur olmamalı ve herkes okumamalı arkadaş. bu sorunu bir çözsek inanın rahatlayacağız. bir de 20 milyon kaçkını göndersek uzay çağına ulaşacağız:)neyse memurlara verilecek maaşın düşük de olmasını istemiyorum:- hayat şartları gerçekten çok zor. memurun ek iş imkanı da olmadığı için özellikle büyük şehirdeki bekar memurlar için hayat zor.- ne olursa rüşvet tarzı saçmalıkların artmasına neden olabilir. adam milyon dolarlık işleri inceliyor ama aldığı maaş 30-40 bin lira. devletin bu insanları koruması gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "December 05, 2023, 07:08:04 PM",
      "body": "Quote from: gospodin on December 05, 2023, 05:25:31 PMmemura sene başında verilecek olan zam+enflasyon farkı ile sanırım maaşlarındaki artış %50'yi göremeyecek. bir yandan memur maaşlarının özel sektöre oranla yüksek olmasını istemiyorum. bunun içinde alınan zam oranları da var. sebebi ise okuldan yeni mezun olan herkesin kurtuluş yolu olarak kamuyu hedeflemesi. herkes memur olmamalı ve herkes okumamalı arkadaş. bu sorunu bir çözsek inanın rahatlayacağız. bir de 20 milyon kaçkını göndersek uzay çağına ulaşacağız:)neyse memurlara verilecek maaşın düşük de olmasını istemiyorum:- hayat şartları gerçekten çok zor. memurun ek iş imkanı da olmadığı için özellikle büyük şehirdeki bekar memurlar için hayat zor.- ne olursa rüşvet tarzı saçmalıkların artmasına neden olabilir. adam milyon dolarlık işleri inceliyor ama aldığı maaş 30-40 bin lira. devletin bu insanları koruması gerekiyor.Özellikle 2. madde çok doğru. İhalelerle ilgilenen, mali konular üzerinde durulan devlet kurumlarında sistem çok daha farklı olmalı. Buralarda çalışan ya da inceleme yapılan memurların büyük çoğunluğu devletin gözünde fakir, sadece memur maaşı alıyor. Ama kuzeninden halasına teyzesinden komşusuna birçoğunun üstünde sürüyle mal var. Asgari ücret alan adamlar Mercedeslerden BMWlerden aşağı inmiyor, yazın en kral otellerde kalıyor sahilden ev alıyor.Devlet bunu gördüğü halde hiçbir şey yapmıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "December 05, 2023, 08:20:06 PM",
      "body": "Hayat şartları ben bildim bileli kötü gidiyor bu kötü gidişat pandemi ile beraber öyle bir ivme kazandı ki anlatamam. Artan hayat pahalılığına rağmen açıklanan rakamlara çocuklar bile inanmaz şuan 2019 a göre en az 10 kat artış var. Her ay açıklanacak enflasyon rakamları aslında belli sadece zamanı gelince açıklaması yapılıyor gerçekle bir alakası olduğunu sanmıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "December 07, 2023, 06:39:29 AM",
      "body": "Quote from: LGD2Business on December 04, 2023, 09:31:09 AMÇeşitli kuruluşların Kasım ayı için verdiği enflasyon oranları şöyle:TÜİK: %61,98İTO: %73,89ENAG: %129,27 Devlet ücret artışlarını konuşurken TÜİK verisini baz alacak. Yüksek zam bekleyenler boşuna umutlanmasın. Enflasyon düşük diye sevinçle açıklama bile yapabilirler.Ufak bir anket yapılmış hangi enflasyon oranı size gerçeğe daha yakın geliyor diye, sonuçlar ortada. Daha düşük hisseden olduğunu sanmıyorum aldığımız belli verdiğimiz belli geriye kalan belli sonuçta.Hocam bu gerçekçilik durumunu TUİK teki ilgili arkadaşlara sorsak, eminim onlar da ENAG ın verilerinin daha gerçekçi olduğunu düşünürler Yahu bu iki kurum arasındaki hesaplamalarda oluşan iki katından fazla farkı izah edebilecek herhangi bir bilimsel model yok, hadi ENAG biraz şişirmiş diyelim, eee TÜİK de mutlaka biryerlerden kırpmıştır, yani yine her halükarda TÜİK için bu verilerin pek sağlıklı bir şekilde bulun-durul-madığı ortaya çıkıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "December 07, 2023, 07:25:36 AM",
      "body": "Tüik yazın evlere verilen ücretsin doğalgazın maliyetini 0 olarak girip enflasyon değerini aşşağı çekti ise kasım ayı enflasyonu içinde bir çözüm bulmuştur. Bu bulunan çözüme bir türlü biz fanilerin aklı yetmiyor. İşin içine şeytanlığı kattığın zaman olmayacak değer yok. Bunlar halkın rahatı için çalışıyorlar ( halk rahat rahat ölsün diye  ) şimdi karşınıza düşük enflasyon çıkıyor diğer dertleri bırakıp bunun sebebini araştırıyorsunuz. Eğer yüksek çıkmış olsa bu seferde hangisi yükseltti diye uğraşacaksınız. Bırakında tüik işini yapsın. Çok kurcalamayın. Tüik bu. Daha bu değerleri birde siz maaş hesaplarken görün. Ozaman ne kadar düşük olduğunu göreceksiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "December 16, 2023, 10:43:04 PM",
      "body": "Merkez Bankası Başkanı Hafize Gaye Erkan ilginç açıklamalarda bulunmuş.Bunlardan birisi \"Bir insanın 10 evi olmamalı, 10 insanın bir evi olmalı.\" sözü. İnsan merak ediyor nereden aklına geldi böyle bir açıklama yaptın diye. Çeşitli komplo teorileri üretenler var ama ben oraya hiç girmeyeceğim. İstanbul'da ev bulamadığı için annesinde kalıyormuş yazık valla üzüldüm.Açıklamanın başka bir kısmı ise enflasyon üzerine. Kapıcı Sadık abisine enflasyon düştü fiyatlar indi diyormuş Sadık abi de inmedi git soğan fiyatına bak diyormuş. Ne kadar şirin ya iyi ki varsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "December 17, 2023, 09:17:49 AM",
      "body": "Quote from: LGD2Business on December 16, 2023, 10:43:04 PMMerkez Bankası Başkanı Hafize Gaye Erkan ilginç açıklamalarda bulunmuş.Bunlardan birisi \"Bir insanın 10 evi olmamalı, 10 insanın bir evi olmalı.\" sözü. İnsan merak ediyor nereden aklına geldi böyle bir açıklama yaptın diye. Çeşitli komplo teorileri üretenler var ama ben oraya hiç girmeyeceğim. İstanbul'da ev bulamadığı için annesinde kalıyormuş yazık valla üzüldüm.Açıklamanın başka bir kısmı ise enflasyon üzerine. Kapıcı Sadık abisine enflasyon düştü fiyatlar indi diyormuş Sadık abi de inmedi git soğan fiyatına bak diyormuş. Ne kadar şirin ya iyi ki varsınız.@LGD2Business hocam yazdıklarını okuyunca eski ramazanlar aklıma geldi. Hani eski diyince 5 10 yıl önceki değil de taaaa eski Türkiyedeki ramazanlar aklıma geldi. Hani akşamları olan orta oyunları meddahlar karagöz ve hacivatlar. Bak şimdi bunlar gitmiş sahnede başka yüzler var. Merkez bankası başkanı, bina kapıcısı, bakkal amca, falan filan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "December 17, 2023, 10:54:31 PM",
      "body": "Quote from: LGD2Business on December 16, 2023, 10:43:04 PMMerkez Bankası Başkanı Hafize Gaye Erkan ilginç açıklamalarda bulunmuş.Bunlardan birisi \"Bir insanın 10 evi olmamalı, 10 insanın bir evi olmalı.\" sözü. İnsan merak ediyor nereden aklına geldi böyle bir açıklama yaptın diye. Çeşitli komplo teorileri üretenler var ama ben oraya hiç girmeyeceğim. İstanbul'da ev bulamadığı için annesinde kalıyormuş yazık valla üzüldüm.Açıklamanın başka bir kısmı ise enflasyon üzerine. Kapıcı Sadık abisine enflasyon düştü fiyatlar indi diyormuş Sadık abi de inmedi git soğan fiyatına bak diyormuş. Ne kadar şirin ya iyi ki varsınız.Açıklamalar biraz halkın içine inip bakıyorum havası yaratmak için yapılmış sanki nedense. Bunun haricinde paranın kraliçesi böyle açıklamalar ile nereye varıyor anlamıyorum. Markete inmesine de gerek yok. İndirirsin bir yemek uygulaması ile birlikte market uygulaması, tüm fiyatları filtreler bakarsın. 1 ekmek 10 lira olmuş kapıcı sadık abiye sormasına gerek yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "December 18, 2023, 03:48:47 AM",
      "body": "Kaldı Aralık ayı enflasyon oranları. O da açıklandıktan sonra her şey netliğe kavuşacak. Dün veya önceki gün cumhurbaşkanı yardımcısı zam ile ilgili memur ve emeklisine %50 civarında zam yapılacağını bir nevi ilan etti. Asgari ücrete pazarlıklarda bugün ikinci toplantı da yapılacak.  Artık aralık enflasyonu ile her şey gün yüzüne çıkacak. Hadi hayırlısı olsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "December 18, 2023, 11:05:02 AM",
      "body": "Merkez Bankası başkanının milyon dolarları olduğu söylenirken böyle açıklamalarda bulunuyor olması cidden çok ilginç. Ayrıca şu anki maaşı da 160 bin lira. Sadece bu maaş ile bile İstanbul'da her türlü rahat geçinebilirsin hatta kenara para da atarsın. Tabi nasıl bir evde oturacağına göre değişir yani tutup da konumu çok iyi yerde villada falan oturursan onun kirası bambaşka olur.Özetle hem bu kadar birikimi ve geliri olup hem de böyle bir açıklamada bulunmasını tuhaf buldum. Siz böyle açıklama yaparsanız dar gelirli ne desin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "December 18, 2023, 12:40:01 PM",
      "body": "Bu kapıcı Sadık abiyi bizim tüik te işe alsalar acaba aylık enflasyon oranları sadığın dediği gibi olabilir mi. Yoksa sakı da parayı görüp hülyaya dalıp aman halka ne olacak gi verin coşkuyu indirin enflasyonu dermi. Bak maaşı yüksek olanlar gidip çarşıya pazara bile bakmıyorlar. Bakan birini bulup ona soruyorlar. Sorulacak son kişiye. Senin elinin altındaki başkanlıklarda çalıştırdığın bir sürü uzman var. Utanmadan bu cümleyi kurmak bile baya bir marifet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}