{
  "id": "topic_5463062",
  "title": "MainIbem",
  "author": "MainIbem",
  "created_time": "August 12, 2023, 09:00:47 PM",
  "content": "As you can see from the screenshot today I checked my app and I noticed I was gift a free NFTs which is showing right inside my wallet. Actually within myself I had two things; this could be either is spam NFTs or a trap that whenever I try to connect my wallet in an opensea I may quickly get sweep off with my real money. But to my notice does NFTs got release in such manner without one buying them or possibly got associated with their airdrop?If this is scam nfts please be very mindful if you come across something like this. I just shared this so that those who are desperate of airdrop won't rush to swap in other to receive 1.5 ETH on the picture above as I believe is another smart way to get airdrop participate or users got trapped.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463062",
  "comments": [
    {
      "author": "TravelMug",
      "created_time": "August 12, 2023, 09:05:04 PM",
      "body": "I would say give it a benefit of the doubt for now. For me there's no such thing as free NFT's, everything here has a price.And thanks for your warning, we have heard horror stories of this kind of scam attempts. That once they connected their wallet, there is a sweeper bot that will take all your crypto without you knowing. It is so fast that you can't do anything to stop it even if you are watching it at real time.So this is just a heads-up for anyone out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "August 12, 2023, 09:05:54 PM",
      "body": "Obviously a scam one or a dummy NFT, imagine 1.5ETH for a free NFT its too good to be true.This could be like the fake tokens on your wallet that once you make a transactions with them, they can hack your wallet now so better to ignore it and have a new wallet because your existing one is already exposed to hackers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "August 12, 2023, 09:22:24 PM",
      "body": "Quote from: MainIbem on August 12, 2023, 09:00:47 PMIf this is scam nfts please be very mindful if you come across something like this. I just shared this so that those who are desperate of airdrop won't rush to swap in other to receive 1.5 ETH on the picture above as I believe is another smart way to get airdrop participate or users got trapped.1.5 eth for a free nft. It would be very strange if anyone still believed in something like this.But there are bound to be some naive or new people who think this is possible and it's our job to discourage the rashness of new people who think luck is coming their way when it's a trap set for them.Keep in mind that there is no such thing as free so when you encounter something like this again I think it is better to ignore it than to make some actions that are detrimental to yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 12, 2023, 09:22:53 PM",
      "body": "It's just the same (dusting-coin) scam.The different is on (NFTs), there is nothing we can do. Each time you are transaction on the chain, you will get these dusting-NFTs scam based of the smart-contract scammer (because they're reacting with the transaction chain).Just ignore, as always no need to visit the link on that picture NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "August 12, 2023, 10:10:20 PM",
      "body": "Quote from: Furious 7 on August 12, 2023, 09:22:24 PMQuote from: MainIbem on August 12, 2023, 09:00:47 PMIf this is scam nfts please be very mindful if you come across something like this. I just shared this so that those who are desperate of airdrop won't rush to swap in other to receive 1.5 ETH on the picture above as I believe is another smart way to get airdrop participate or users got trapped.1.5 eth for a free nft. It would be very strange if anyone still believed in something like this.But there are bound to be some naive or new people who think this is possible and it's our job to discourage the rashness of new people who think luck is coming their way when it's a trap set for them.Keep in mind that there is no such thing as free so when you encounter something like this again I think it is better to ignore it than to make some actions that are detrimental to yourself.This was the reason I shared here for you guys to have a look at it and be at alert of something like this if it happens you comes across it. Usually I would had desperately go to swap it but due to my experience over the years I wasn't moved and I know such is too good to be real.However I don't know if here is the appropriate place to post this is I should post at the scam section?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 12, 2023, 10:19:35 PM",
      "body": "Quote from: MainIbem on August 12, 2023, 09:00:47 PMAs you can see from the screenshot today I checked my app and I noticed I was gift a free NFTs which is showing right inside my wallet. Actually within myself I had two things; this could be either is spam NFTs or a trap that whenever I try to connect my wallet in an opensea I may quickly get sweep off with my real money. But to my notice does NFTs got release in such manner without one buying them or possibly got associated with their airdrop?If this is scam nfts please be very mindful if you come across something like this. I just shared this so that those who are desperate of airdrop won't rush to swap in other to receive 1.5 ETH on the picture above as I believe is another smart way to get airdrop participate or users got trapped.It's a spammy advertisement. They used to do this with erc20 and bep20 tokens. I mean thet airdropped tokens that have url in their name just to get attention to urls. Now they are going it with nfts as you can use pics with those ads. Just ignore every free nft you get, i got several of them. Url has a web page where you can \"claim\" something, but in reality it just empties your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "August 12, 2023, 10:24:58 PM",
      "body": "Quote from: MainIbem on August 12, 2023, 10:10:20 PMQuote from: Furious 7 on August 12, 2023, 09:22:24 PMQuote from: MainIbem on August 12, 2023, 09:00:47 PMIf this is scam nfts please be very mindful if you come across something like this. I just shared this so that those who are desperate of airdrop won't rush to swap in other to receive 1.5 ETH on the picture above as I believe is another smart way to get airdrop participate or users got trapped.1.5 eth for a free nft. It would be very strange if anyone still believed in something like this.But there are bound to be some naive or new people who think this is possible and it's our job to discourage the rashness of new people who think luck is coming their way when it's a trap set for them.Keep in mind that there is no such thing as free so when you encounter something like this again I think it is better to ignore it than to make some actions that are detrimental to yourself.This was the reason I shared here for you guys to have a look at it and be at alert of something like this if it happens you comes across it. Usually I would had desperately go to swap it but due to my experience over the years I wasn't moved and I know such is too good to be real.However I don't know if here is the appropriate place to post this is I should post at the scam section?if it is too-good-to-be-true, then doubt the legitimacy of the nft giveaway. remember, these people won't just give free money for nothing. they have their hidden agenda why they resort to this tactic, because there are still some naive users who will follow the instructions embedded with it, and it will be too late before they realised it is a trap and their funds are already compromised. do your own homework, search for the project and check the official accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "August 12, 2023, 11:27:23 PM",
      "body": "if you think its too good to be true then its pure scam.nobody is giving that much money for free, so i'm sure its just scam, of course there are actually many NFT being released nowadays for the sake of eligibility of airdrops in the futurelike those new emerging blockchain that gives voyage NFT and being used for future purpose of airdrop qualification, but the thing is that in getting those NFT you are the ones that claims the NFT not just gettingsent some random NFT like this, moreover giving 1.5 ETH for free, no airdrop is giving away ethereum, at best its their token, so the conclusion is that its just blatant attempt of scamming just ignore it since there's nothing you can do about it anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "August 13, 2023, 12:53:00 AM",
      "body": "A .US domain can be bought for as low as $0.99. Scammers love to use cheap domains because they can just move their site easily whenever one of their scam domains gets suspended. Whoever is running this site didn't bother using a WHOIS protection service so we can see what information was used to register this domain. Although they might have used fake information there might still be enough clues to figure out who is behind this scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Warkop",
      "created_time": "August 13, 2023, 06:17:43 AM",
      "body": "If you look at the time when everyone wanted to hunt for NFT, it might be expensive, but if you get NFT in recent years, it seems very difficult that the NFT you have will have a large price, because there are lots of NFTs now, there are lots of scams. there are even several other fraudulent coins that are distributed free of charge, it's different if you get the NFT from several trusted sources, it's likely that it will get a bigger selling point and be profitable for you, but unfortunately you get it from a source that's not so clear, and there are it's good for you to share your experience with everyone..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 13, 2023, 06:24:07 AM",
      "body": "Why every bounty hunter always believe about free money? I just can't understand, it's lack of literacy or what?I always receive a message about giveaway or free money in fiat, crypto or anything that has a value, but I always refuse to respond and get away from it. Free money and joining a bounty are different, you're actually working by completing task, posting, create video etc in bounties, it's never been a free money in bounties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 13, 2023, 07:09:13 AM",
      "body": "I am sure that it is a fraud, but if you are greedy or want to remove the doubt, then withdraw your wallet from any additional balance, and then leave a small fee for gas and try to sell it, either you will not be able to sell it, or at least not at the price of 1.5 ETH, or all the balance in your wallet will be withdrawn, and then you will save the gas fee Which will be less than two dollars.But it's too good to be true (a scam.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "August 13, 2023, 07:46:41 AM",
      "body": "Quote from: MainIbem on August 12, 2023, 09:00:47 PM~Probably just a spam nft, maybe in hopes that you'd click an associated link or something similar to let them install malware or just spam. Quite literally spam. Idk if it happens in other countries but my mobile number often has these spam casino messages that often message me, asking me to click the link they sent or visit whatever site they indicated. Considering how NFT can be easily made and if timed right, fees being close to zero, I guess the marketing team or whoever decided to spread said NFTs that way. Just don't open it, I don't open anything I didn't sign up for, that's for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fat buddah",
      "created_time": "August 13, 2023, 07:49:12 AM",
      "body": "That's a 100% scam. If it seems too good to be true it's definitely a scam. Also just by the look at the design, it's pretty obvious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "August 13, 2023, 07:57:28 AM",
      "body": "Most of them are obviously fake but still you can give it a try as you never know which of them may turn out to be a real one and there is no harm in giving it a try out, though I have bunch of them pending in my trust wallet address which is of no use still we can give a chance rather than regretting, consider it as same shit coins or meme coins which has possibility to go ATH during bullrun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandji02",
      "created_time": "August 13, 2023, 08:18:52 AM",
      "body": "Quote from: kentrolla on August 13, 2023, 07:57:28 AMMost of them are obviously fake but still you can give it a try as you never know which of them may turn out to be a real one and there is no harm in giving it a try out, though I have bunch of them pending in my trust wallet address which is of no use still we can give a chance rather than regretting, consider it as same shit coins or meme coins which has possibility to go ATH during bullrun.Funny that you say that there is no harm. You can get a bot or something that will leak your data and will make you lose all your coins. If you see something suspicious it's better not to touch it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 13, 2023, 09:20:56 AM",
      "body": "What you need to remember is that on most chains other than Ethereum, issuing NFTs is basically free. So getting an NFT in your wallet doesn’t mean someone sent you a lot of value. It’s best to ignore them 99% of the time. It can even be dangerous to interact with them sometimes. Be careful and stick to messing with NFTs that you actually buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "August 13, 2023, 10:34:30 AM",
      "body": "If you are not buying any of this NFT or joining an airdrop, I conclude that it was a scam. You can never sell them but probably it directs you to another site in order to claim the said token. If we are too careless and if we thought it was money already, not a surprise that we get scammed. Ignoring is the best thing to do and besides, NFTs are useless, nobody is buying them now. So how it makes sense to someone to have them as only stuck in our wallet? Indeed, we have to be more cautious and must have to think and analyze the situation before making a decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 13, 2023, 11:10:46 AM",
      "body": "There are legitimate \"free\" NFTs through platforms like Solana's Drip.Haus. This on the other hand, is 99% likely to be a scam.^Also take note that anyone can make their own NFTs, but it doesn't necessarily mean that it will end up being worth anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}