{
  "id": "topic_5499830",
  "title": "criptoonlinebr",
  "author": "criptoonlinebr",
  "created_time": "June 13, 2024, 08:47:02 PM",
  "content": "Hello my friends,I'm from Brazil, and I'm in love with this technology called Bitcoin.I'm studying a lot about this subject....I still have $100 in BTC lolBut one day I will become a millionaire...Welcome me?!thanks my brothers, thanks Satoshi",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5499830",
  "comments": [
    {
      "author": "SatoPrincess",
      "created_time": "June 13, 2024, 09:10:22 PMLast edit: June 14, 2024, 06:33:29 AM by SatoPrincess",
      "body": "Welcome to the forum! Newbies usually make their introductory post in the Beginners & Help section though it’s not compulsory. Here are some threads to help you get started on your bitcointalk journey if you choose to stay here.Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQ Newbies - Read before postingIf I were you I would be very careful about the information I share on the internet. Your bitcoin hodlings is your private business and shouldn’t be made public unless if necessary. Doing so will only attract scammers to your dm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoonlinebr",
      "created_time": "June 13, 2024, 09:22:17 PM",
      "body": "Oops sorry for breaking the Forum rules... I'm going to take a few days to read the rules and I'm very excited about this Journey!And sorry for my basic English Thank you Princess Sato!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 13, 2024, 09:23:35 PM",
      "body": "Op for you to do well in the forum, you have to read more than posting so you can learn more from the reading and in the process of reading if see any interesting topic and your make a comment base on the topic or the content then you can make comments and that is where your can even contribute meaningful. Read other people threads, again devote yourself to read threads and navigate the forum then you will learn a lot. SatoPrincess has provided some of the links that contain the forum rules and other activities to you and you are have to read them so you won go astray. Ask questions here whenever you don't know a particular thing instead in bitcoin  because we have human resources that will give answers beyond AI. Human knowledge is always superior to Machine. Feel free to participate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoonlinebr",
      "created_time": "June 13, 2024, 09:28:32 PM",
      "body": "Thanks for the instructionsMate2237Soon I'll learn how to use the forum.... Sorry... I ask for a little patience! Thank you very much for the welcome!PS: What link do I use to reply to a specific message from a member?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cityhunter34",
      "created_time": "June 13, 2024, 09:35:12 PM",
      "body": "You are welcome to Bitcointalk forum mate I can see that you have already being given some useful Links that'll halp you to navigate the forum just try as much as possible to go through those Links because doing that will really help you to know the rules and regulations of the forum, and also remember to ask questions on anything you are not familiar with. because as long as this forum is concerned spamming or plagiarism is highly prohibited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "June 13, 2024, 09:37:48 PM",
      "body": "No one is late with bitcoin. You’re just on the right time. Now, let me welcome you here in bitcointalk. As much as majority here have learned a lot and enjoy their stay here every now and then, I hope same with you as well. Just don’t pressure yourself to be in profits quickly but focus more on learning acquisition because that will be your guide and foundation all throughout your journey here in the forum. Be familiar with the rules first, so that you will know what to do and what’s not to do as a bitcointalk member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "June 13, 2024, 09:39:06 PM",
      "body": "I don't know if you are new in Bitcoin or you are new into this platform, if you are new in Bitcoin you have to make a different research on your own to be able to understand the advantages and the disadvantages of cryptocurrency investment and also Bitcoin particularly, because it is this that will give you the clear understanding of what you are about to embark on, because if you don't make your own research towards a Bitcoin I think it you will find it very difficult with this platform or this community what it does is to embark the knowledge of cryptocurrency to anyone who come across this place",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 13, 2024, 09:46:06 PM",
      "body": "There are plenty of people who have thought they were too late to the party. There’s a screenshot of a tween from 2010 where someone is complaining that they sold their Bitcoin at $0.07 and now they regret it because BTC is at $0.30 and it’s too late to get in now. A tale as old as time. If you believe in it, get some. That’s my advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoonlinebr",
      "created_time": "June 13, 2024, 09:46:22 PM",
      "body": "I'm very happy with the messages my friends...It had already been said that the Bitcoin Community was very united and welcoming!Hug to everyone!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "June 13, 2024, 09:51:54 PM",
      "body": "Quote from: criptoonlinebr on June 13, 2024, 09:28:32 PMPS: What link do I use to reply to a specific message from a member?Look at the upper right hand side of  your phone you will see a space with quote them click on the quote you will have the opportunity of replying to the person when you want to reply to but remember to give a little space at the back of the user's comment before replying to them. Do not be in a hurry to respond to every comment rather I will advise you read the comments of members so you will learn from what they have to say while you listen and read more. The forum is very easy to navigate just give yourself time to stay online here and learn from lots of links that will be provided for you where you can study and become more knowledgeable than you are on arriving here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 13, 2024, 09:52:31 PM",
      "body": "Quote from: criptoonlinebr on June 13, 2024, 09:28:32 PMPS: What link do I use to reply to a specific message from a member? If you are referring to a personal message {pm} then clicked on the link \"MY MESSAGES\" at the top of your profile, then scroll down to the message you want to reply and open the message then click reply. Then type and send. I think that what you are asking for. Any other questions again. Read more so you can learn faster. You can make some research on google and get some information so you will have enough information to contribute.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teamsherry",
      "created_time": "June 13, 2024, 09:55:30 PM",
      "body": "Welcome mate to the bitcointalk forum, you are in the right place to learn a lot about bitcoin and in the mist of the right individuals to tell you about it.It would be best you make more topic in the beginners and help section and read topics there to, many basics about bitcoin is shared there and you would learn a lot about the forum rules too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 13, 2024, 09:55:55 PM",
      "body": "Quote from: criptoonlinebr on June 13, 2024, 09:22:17 PMOops sorry for breaking the Forum rules... I'm going to take a few days to read the rules and I'm very excited about this Journey!And sorry for my basic English Thank you Princess Sato!You didn’t break the forum rules by posting here. I only advised you do not share personal information on a public forum especially info about your finances.As for your topic title… don’t think too much about being late to bitcoin, many newbies feel this way because they missed out on buying Bitcoin on the cheap in the early days. But what they do not consider is that not everyone who bought bitcoin in the early hodl their coins long enough to make them millionaires. It is never too late to start buying bitcoins. With DCA, you can accumulate more bitcoins and reach your goals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "June 13, 2024, 09:59:43 PM",
      "body": "Quote from: Mate2237 on June 13, 2024, 09:52:31 PMQuote from: criptoonlinebr on June 13, 2024, 09:28:32 PMPS: What link do I use to reply to a specific message from a member? If you are referring to a personal message {pm} then clicked on the link \"MY MESSAGES\" at the top of your profile, then scroll down to the message you want to reply and open the message then click reply. Then type and send. I think that what you are asking for. Considering the OP's level of knowledge about bitcoins which is obviously very low, I will not advice that the OP should pay attention or reply any personal message from any forum user who wants to offer personal help in investing in bitcoins. @OP,  if you have any questions, ask publicly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 13, 2024, 10:04:29 PM",
      "body": "Welcome.  I am only replying for the last part of the title where you say you are a little bit late.  No body is late, even today.  In my opinion, there is still a lot of time for people to join Bitcoin and find out what it is all about before it is truly 'late' for them.Imagine Bitcoin turns to 250 thousand Dollars per piece.  Would you think you have been late to the party?  There sure is a difference between 100 Dollars and 250 THOUSAND, but the reason most of us are not exorbitantly rich is that while you can expect Bitcoin to be more valuable in the future, you just never know where the stop is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "June 13, 2024, 10:26:02 PM",
      "body": "Well, it has been said numerous times that you are not late when it comes to bitcoin. Well, because you can still invest in bitcoin even though it has its high price now, you can still do DCA, or dollar cost average, wherein you can buy a fraction of bitcoin so even just $100 you can own a bitcoin or satoshi. But I think you already know that. But if you are truly new to bitcoin, then I would suggest that you widen your understanding of bitcoin and start gathering more knowledge and tips about bitcoin because it is not an easy thing. If your goal is to become a millionaire, then it will not be an easy goal and can be impossible, but there's no impossible if you are determined to do so. Just don't expect too much, because too much expectation means the damage and hurt will also be great. Take it easy, and you will make it possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "June 13, 2024, 10:27:27 PM",
      "body": "For me, no one is late to the Bitcoin party as long as you know what you are doing. Your dream of being a millionaire through the acquisition and (maybe trading) of Bitcoin can be a reality if you understand that Bitcoin is a volatile asset and as such try investing with an amount you can easily part with, then you are good to go. Some people have entered into investment of Bitcoin with the mindset that it will multiply the amount that was used immediately they put it but often get disappointed when it doesn't go as planned. Welcome to the forum and try to read the guidelines that has been provided by the others. I believe in the course of your Bitcoin journey you'd have questions and since this is a space where we do our best to help those who are new like you in the world of crypto, it is also important to also make your research so it can help you catch up quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "June 13, 2024, 10:31:29 PM",
      "body": "Quote from: PrivacyG on June 13, 2024, 10:04:29 PMWelcome.  I am only replying for the last part of the title where you say you are a little bit late.  No body is late, even today.  In my opinion, there is still a lot of time for people to join Bitcoin and find out what it is all about before it is truly 'late' for them.Imagine Bitcoin turns to 250 thousand Dollars per piece.  Would you think you have been late to the party?  There sure is a difference between 100 Dollars and 250 THOUSAND, but the reason most of us are not exorbitantly rich is that while you can expect Bitcoin to be more valuable in the future, you just never know where the stop is.I think the statement about being late is a perspective thing . Someone who saw Bitcoin at sub $1K and didn't buy then had to join the bandwagon later on above $3K would definitely think they're late. It's the same with anyone buying now or anyone buying above $100K or even $250K like you mentioned. I agree that buying now would still be a good bargain as long as the individual buying has a concrete plan to scale up and in should the price not go up immediately as expected. Maybe a good DCA strategy and steady accumulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "June 13, 2024, 10:45:24 PM",
      "body": "OP for you to have $100 is a step up and you don't have to feel ashamed of the little you have to start your investment, some have been saying they'd like to start up an investment since they have learnt or have some knowledge about Bitcoin but up till now no effort has been made so in your own part I think something must have motivated you to come up with a $100 so continue with what you have with time you'll get there, remember time waits for no one and you started at the right time. Ask questions before starting something you have no idea of in the Forum, Welcome to Bitcointalk OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}