{
  "id": "topic_5457236",
  "title": "crypto_hunterrr",
  "author": "crypto_hunterrr",
  "created_time": "June 22, 2023, 06:17:23 PM",
  "content": "Please tell me where I can do anonymous swaps. Like SwapSpace or Swapzona. Maybe you know something better?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457236",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "June 22, 2023, 06:21:36 PM",
      "body": "Take a look at these two lists[1][2].For the second one, although most services listed there don't require KYC to trade, they might ask you to verify your identity if they ever detect a \"suspicious activity\".[1] https://kycnot.me/[2] https://bitcointalk.org/index.php?topic=5218464.40",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Volgastallion",
      "created_time": "June 22, 2023, 06:23:54 PM",
      "body": "Mmmmm new account and you come to know where you can do something.... seems like pishing because all the people in the crypto world know better SUSHISWAP BABYSWAP and a ton  more names before the ones you mention.... quite suspicious, please everybody proceed with caution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 22, 2023, 06:28:21 PM",
      "body": "What are you trying to swap Bitcoin or some other altcoins.. you should be specific so that one can know what it's to be suggested for you. If it's Bitcoin then their is no swap for it which am aware of, you can just use any mixing service to mix your coin and increase your privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "June 22, 2023, 06:47:44 PM",
      "body": "Quote from: Volgastallion on June 22, 2023, 06:23:54 PMquite suspicious, please everybody proceed with caution.That's also what I am feeling in here. A new account made and then will ask and put it into discussion if someone can suggest him other than the mentioned websites/platforms that he's mentioned.Well, @OP there's no other better list that Omega has shared.That's all you need to do but even you are able to swap there anonymously, I wouldn't do huge amount of transactions in any of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "June 22, 2023, 07:34:51 PM",
      "body": "Quote from: crypto_hunterrr on June 22, 2023, 06:17:23 PMPlease tell me where I can do anonymous swaps. Like SwapSpace or Swapzona. Maybe you know something better?If it's about Bitcoin then you can't swap it but I think you mentioned about crypto swapping in your title. So this topic doesn't belong here. This board is for only about Bitcoin Discussion. And low quality post's don't belong here.There are also separate boards to discuss about it. You can move it in Trading Discussion board.Also Beginners & Help board is much appropriate for this topic, so move it to there.And already OmegaStarScream shared some best platforms. You can try one of them. And if you want to know about the best platform then you have to share with us about which crypto you are going to swap and in which pair. So try to post with proper detailed information. This types of one line posts are really embarrassing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 23, 2023, 11:16:54 AM",
      "body": "I doubt if OP will even come around to read what members have suggested. These are the kind of members I don't like. He asked a similar question in January this year, and members gave him very excellent suggestions. Had he read through that thread, he wouldn't have been asking about this today. Maybe he's just trying to shill his exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 24, 2023, 08:14:13 AM",
      "body": "Quote from: crypto_hunterrr on June 22, 2023, 06:17:23 PMPlease tell me where I can do anonymous swaps. Like SwapSpace or Swapzona. Maybe you know something better?I think any dex is considered an anonymous swap isnt it? Cause you are using a decentralized platform. Unless you inform the public of the address you are using on that dex. Im not sure on bitcoin cause Im using cex to swap it to other coins. For altcoins then theres plenty of choices. You can literally check on coingecko the top dex like uniswao, 1inch and many more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}