{
  "id": "topic_5437953",
  "title": "Question:",
  "author": "OgNasty",
  "created_time": "February 03, 2023, 05:43:32 PM",
  "content": "[POLL] Is Biden responsible for the current high inflation?With Joe Biden now claiming that inflation was already high when he took office (it was 1.4%) and trying to blame Donald Trump for the reason why inflation got out of control, I wonder how many people actually believe this.  I could go on and on about all the Federal Reserve officials who quit their jobs when the Biden administration wouldn't follow their advice about how to avoid an inflationary mess.  It doesn't matter what the facts are though.  It matters what the people believe.  So, what do you believe?  Is their misinformation campaign working?  Vote with your belief and let's see.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437953",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "February 03, 2023, 07:49:15 PM",
      "body": "I have read about inflation rise there in the United States, but I have not taken enough time to check on the evolution of it during the whole administration of Biden, I have got the impression there was indeed an important increase. However, I am not sure to what extend it is a result of Biden's policies, he seemed to indeed encourage expending but at the same time during his presidency the FED had increased the interest rates.So, I would need to inform myself further, but I must admit that he approving an ACT called \"Inflation reduction\" sounds a bit strange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "February 03, 2023, 08:13:25 PM",
      "body": "https://fred.stlouisfed.org/series/WALCLReally it was Trump's fault and Biden's fault. But the responsibility is not equally split.Trump was President during COVID lockdowns and it was his administration that recommended restrictions under advisement of the great Dr. Fauci. Trump would also criticize Sweden for not locking down as justification for his poor decision making and inability to surround himself with competent advisers. Though that's a separate issue. Point being, he bears responsibility for lockdowns. The predictable result of paying people to stay home and printing money to stimulate the economy was obviously not unforeseen. Trump owns all of that. To his defense, he aimed to reopen the economy sooner than democrats did who would have preferred to create concentration camps for the infected, unvaxxed or unmasked.Biden comes into office and makes matters much worse. He extends COVID-19 restrictions on the federal level and invokes trillions of dollars of new spending (build back better, inflation reduction act, etc.). He is senile so its mostly his party to blame. Trump usually makes his own decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cnut237",
      "created_time": "February 04, 2023, 09:24:55 AM",
      "body": "Inflation is high everywhere. Politicians will always try to blame each other, but the underlying cause is Covid+Ukraine, not Biden or Trump.https://www.ft.com/content/088d3368-bb8b-4ff3-9df7-a7680d4d81b2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 04, 2023, 12:29:26 PM",
      "body": "Inflation comes from increases in money, cash or its equivalent.With the creation of new money that is going into Ukraine (like over $100 billion), since it is US money, it will filter back into the US in the form of inflation.Whoever is causing money to be sent to Ukraine is causing the extra high inflation. It isn't all Biden's fault, but he is in there, right along with the rest of the supporters of Ukraine.The point is that there are reasons why US money can fail. If it does, it will fail fast. Inflation from the war isn't helping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}