{
  "id": "topic_5461663",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "August 01, 2023, 09:20:00 AM",
  "content": "People who argue that bitcoin mining destroys the environment have to check their motives for saying so. I have yet to see any evidence that bitcoin mining destroys the environment; rather, what I am seeing is that bitcoin mining is, in fact, saving the environment. Below are three pieces of picture evidence of bitcoin mines actually helping to sustain our environment instead of destroying it1) Bitcoin mining farm powered by solar energy.The picture below is an immersion-cooled bitcoin mining farm powered by solar energy located in Norcross, Georgia.2) Bitcoin mining farm powered by cooking oilIn a Guatemala lake town, cooking oil from restaurants which is usually thrown into the lake and causes pollution is now being used to power bitcoin mining ASICs. According to the article “This cooking oil would either be thrown out into the street or find its way to the landfill which sits several hundred feet above Lake Atitlán,” Melder explained. “Either way, it would find its way into the watershed and into the lake.”      3) Bitcoin mining farm powered by methane gasWith all the gas being flared, a bitcoin mining company in North Dakota is taking the excess which is methane gas and using it to power their mining farm. It methane gas is one that has naturally been destroying the environment but bitcoin mining solving this problem. I will summarise by quoting this Forbes article titled, Everything You Need To Know About Bitcoin And The Environment. It says that Bitcoin's unique ability to harness stranded energy resources and mitigate potent greenhouse gas emissions positions it as a potential ally in our fight against climate change. There are simply a thousand and one pieces of evidence to show that bitcoin mining, if done the right way, doesn't destroy our environment.Please share your thoughts.Source:- https://twitter.com/CleanSpark_Inc/status/1663948094164041738- https://twitter.com/DocumentingBTC/status/1679300474170638337- https://bitcoinmagazine.com/culture/guatemala-town-mining-bitcoin-with-used-oil- https://twitter.com/promise_cr8774/status/1686234946933760000- https://www.forbes.com/sites/digital-assets/2023/07/07/everything-you-need-to-know-about-bitcoin-and-the-environment/?sh=24acb1ac46fc",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461663",
  "comments": [
    {
      "author": "EL MOHA",
      "created_time": "August 01, 2023, 10:11:38 AM",
      "body": "You forgot to add that even energy or electricity produced by hydropower plants are excess for some countries mostly during the summer period, this doesn’t only wastes the energy but also the funds. Since the bitcoin mining inception many of these wasted energy or electricity have been used for mining saving it from wasting. Right now countries have started to build crypto mining farms near this plants. The country Kyrgyzstan is also looking towards that too,  https://cryptopotato.com/kyrgyzstan-to-spend-20-million-to-build-a-hydropowered-crypto-mine-report/Just like I have read on many threads on the forum. I have just come my own conclusion that the news that bitcoin or crypto mining was actually going to destroy the environment was just a false statement spread by government or media houses just to paint bitcoin bad and probably aid in there quest to stop bitcoin. Nothing more than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 01, 2023, 11:15:52 AM",
      "body": "I agree that Bitcoin mining industry is green and environmental friendly enough, more than many industries and many national energy consumption.I disagree if you say Bitcoin mining is a potential ally to fight against Climate change. It is not true as Bitcoin mining does not use 100% renewable energy so it causes green house gases that contribute to climate change and global warming.The Bitcoin Mining industry consumes very small energy compares to other industries, nations and the whole world so to fight against Climate change, it must be done with many massive initiatives globally. Bitcoin mining industry is only one small contributor to the fight.Bitcoin Mining Council Q4 2022 report and Its briefing video with more information.Climate impacts of Bitcoin mining in the United States from MIT Center for Energy and Environmental Policy Research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "August 01, 2023, 11:33:08 AM",
      "body": "Bitcoin mining has gone far with the use of renewable energy source and there's less dependency on electrical power supply unlike before, there's more to see on the aspects of this same bitcoin mining being environmentally friendly, we can make this our own way of understanding the real idea on the use of bitcoin energy used for mining as an environmental friendly and cause no harm on the climate like the other source of mining do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "August 01, 2023, 11:43:32 AMLast edit: August 01, 2023, 03:59:51 PM by komisariatku",
      "body": "If I'm being honest, I think bitcoin mining uses more electrical energy from coal, and fossil fuels. Admit it or not, several years ago bitcoin miners were still using energy from energy sources that were damaging to the environment. Besides that, the need for electricity to mine bitcoin is very large, in 2020 it is estimated that the need for electricity for mining around the world is equivalent to the electricity needs of Argentina.But, like the industry at large, things are moving toward improvement. Today, many bitcoin miners are starting to switch to renewable energy sources, and that is good news. Although not all of them, bitcoin miners are slowly supporting the use of environmentally friendly energy sources. In my opinion, currently the industrial world globally is moving towards renewable energy sources, and that requires process and time. Including bitcoin miners are also heading in that direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "August 01, 2023, 03:56:50 PM",
      "body": "All of them are invalid arguments. That being said, most of the proponents of Bitcoin mining as being \"green\" is sprouting nonsense as well. For starters, there is a difference between renewable energy and truly green energy. True green energy are carbon neutral and does no damage to the environment. Your solar panels contributes to environmental pollution, so does your dam which destroys habitats, your wind turbines which endangers wildlife, etc. People want you to believe that they are good for the environment, because they appear to be somewhat carbon neutral if you ignore the implicit costs. This is a typical type of greenwashing that everyone is falling victim to.If you're talking about extra energy that is difficult to store, that argument is invalid as well. High voltage electrical transmission, whilst introducing high energy loss, is still a viable option for most. The fact that Bitcoin mining is consuming energy already means that opportunity costs are being incurred by them having to use that energy for mining instead for domestic purposes. That is not withstanding the environmental pollution that comes from e-waste as well as silicon mining. Anyone that attempts to argue that Bitcoin is beneficial or otherwise carbon neutral is straight up lying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "August 01, 2023, 11:45:48 PM",
      "body": "Quote from: hd49728 on August 01, 2023, 11:15:52 AMClimate impacts of Bitcoin mining in the United States from MIT Center for Energy and Environmental Policy Research.The paper that you linkedQuote from: hd49728 on August 01, 2023, 11:15:52 AMI agree that Bitcoin mining industry is green and environmental friendly enough, more than many industries and many national energy consumption.states that Bitcoin is not green, because the emissions of energy sources that it's uses are equal to the average of the electric gridThat paper also states that the supposed environmental benefits of Bitcoin mining remain theoretical, and there's no noticeable effects of Bitcoin on stimulating renewables yet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "August 02, 2023, 05:59:14 AM",
      "body": "You can't stop the Bitcoin haters with such examples. They will always find other reasons to critique Bitcoin/crypto mining.1.The production of solar panels is dirty and it pollutes the environment. The wind turbines are killing birds...2.Bitcoin mining is wasting energy. It doesn't matter if it's green energy or not-so-green energy. The electricity used for crypto mining could have been used for something more productive in the traditional brick \"and mortar\" industries.3.Bitcoin/crypto miners produce excessive heat, which warms up the planet.  This is obviously a joke, but I can see a BTC hater using it as an argument.Haters gonna hate, no matter what...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "August 02, 2023, 06:32:25 AM",
      "body": "Compared to other industries, Bitcoin actually doesn't have that much of an impact on global warming, in fact this is an industry that is far more friendly and open to green and renewable energy. It's just that because the government and some institutions don't want Bitcoin to grow, they support campaigns that say Bitcoin is not friendly to the environment. They frame and label that the Bitcoin mining industry should be stopped in order to save the environment. It's like they are turning a blind eye to industries that still use fossils and coal such as garments, etc., even though these are industries that contribute the most to global warming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "August 02, 2023, 07:59:22 AM",
      "body": "Its crucial to remember that, globally, a significant proportion of Bitcoin mining still relies heavily on non-renewable energy sources, primarily coal. The carbon footprint of the Bitcoin network is reportedly similar to that of some countries! As a matter of fact, Cambridge Centre for Alternative Finance estimates that Bitcoin uses more electricity per year than the entire country of Argentina.While I appreciate your argument and the instances you've presented, they are perhaps not representative of the industry as a whole. That being said, these examples serve as an excellent reminder that the sector could and should make more efforts towards sustainable mining practices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "August 02, 2023, 08:23:39 AM",
      "body": "Quote from: hatshepsut93 on August 01, 2023, 11:45:48 PMThat paper also states that the supposed environmental benefits of Bitcoin mining remain theoretical, and there's no noticeable effects of Bitcoin on stimulating renewables yetHi, just wanted to know what you think about this. How does the paper claim that the benefits of bitcoin mining remain theoretical despite the stark practical evidences from several quarters of it benefits to the environment?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Youngkhngdiddy",
      "created_time": "August 02, 2023, 09:49:22 AM",
      "body": "Quote from: ranochigo on August 01, 2023, 03:56:50 PMAll of them are invalid arguments. That being said, most of the proponents of Bitcoin mining as being \"green\" is sprouting nonsense as well. For starters, there is a difference between renewable energy and truly green energy. True green energy are carbon neutral and does no damage to the environment. Your solar panels contributes to environmental pollution, so does your dam which destroys habitats, your wind turbines which endangers wildlife, etc. People want you to believe that they are good for the environment, because they appear to be somewhat carbon neutral if you ignore the implicit costs. This is a typical type of greenwashing that everyone is falling victim to. You're right because the OP only stated the beneficial aspect of different methods of mining that he feels causes little effect on climate change without listing some other methods that are hazardous, Bitcoin mining can't be totally safe to our environment it has it disadvantages too, you forgot to include the use of coal and natural gases that emmits greenwares when burnt and causes alot of heat that affect the climate change in the environment. According to research such method of bitcoin mining is responsible for a good percentage of greenhouse gas discharges around the world, also let's not leave out the high level of energy consumptions and resources for the production of solar panels that can also cause environmental pollutio, it is also stated according to research that the mining of bitcoin has emmited millions of tonnes of  CO2 around the world in it's short period of existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 02, 2023, 10:36:02 AM",
      "body": "Quote from: ranochigo on August 01, 2023, 03:56:50 PMAll of them are invalid arguments. That being said, most of the proponents of Bitcoin mining as being \"green\" is sprouting nonsense as well. For starters, there is a difference between renewable energy and truly green energy. True green energy are carbon neutral and does no damage to the environment. Your solar panels contributes to environmental pollution, so does your dam which destroys habitats, your wind turbines which endangers wildlife, etc. People want you to believe that they are good for the environment, because they appear to be somewhat carbon neutral if you ignore the implicit costs. This is a typical type of greenwashing that everyone is falling victim to.If you're talking about extra energy that is difficult to store, that argument is invalid as well. High voltage electrical transmission, whilst introducing high energy loss, is still a viable option for most. The fact that Bitcoin mining is consuming energy already means that opportunity costs are being incurred by them having to use that energy for mining instead for domestic purposes. That is not withstanding the environmental pollution that comes from e-waste as well as silicon mining. Anyone that attempts to argue that Bitcoin is beneficial or otherwise carbon neutral is straight up lying.current hydro dams do not cause new environment/habitat destruction. most were built upto the 1990'salso when they were built they were not built to the capacity of the 1990's population estimates but the 2050 population estimates. so right now there is in a region using hydro. excess energy that can be produced, but not enough populous in that region to use it, so they dont have all turbines switched on,by having miners enter the region and use the excess. it gives funds to the power company to pay off the build costs of the 1950's-1990's sooner. meaning it makes the average cost per kw less per other domestic user. EG (using smal numbers)if there was a daily production cost of $1000 for a potential 1000 customers in region. but only 800 live in that region. thats a min cost per user of $1.25 a day. however if miners use up the remaining unused 200 capacity. then it bring the average down to $1 per useralso if you look at bitcoins hashrate method. asic farms in one warehouse located at a hydro dam is alot more efficient use of electric compared to some crapcoins 'solo mining' in some hobby miners basement.. because household solo mining is more wide ranging of their power source and not really choosing to use hydro.. (residents dont move home specifically to live in hydro area)so comparing bitcoin to a crapcoin like doge. bitcoin is a higher % renewable rather than doge, which doge is a bad mess of a bad mix of power sources due to predominantly being random home users mining doge in areas the residents dont get to choose their source nor have planned decisions on where to live being a electric source decisionbitcoin miners choose to build asic farms in renewable electric regions. so bitcoin is more renewable % mix by default",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "August 02, 2023, 10:56:12 AM",
      "body": "Quote from: franky1 on August 02, 2023, 10:36:02 AMcurrent hydro dams do not cause new environment/habitat destruction. most were built upto the 1990'salso when they were built they were not built to the capacity of the 1990's population estimates but the 2050 population estimates. so right now there is in a region using hydro. excess energy that can be produced, but not enough populous in that region to use it, so they dont have all turbines switched on,by having miners enter the region and use the excess. it gives funds to the power company to pay off the build costs of the 1950's-1990's sooner. meaning it makes the average cost per kw less per other domestic user. Most of the dams are built to support the communities near the dam, and in anticipation of the industrialization of the surrounding regions. Not so much to cater for the population but rather for economic growth from the on-start. They still cause ongoing environmental destruction, from the disruption or redirection of water flow and these are usually consistent rather than a one-time. The cons of having miners enter the region basically means that they don't have to prioritize any efforts to deliver long distance power to the surrounding regions. That isn't desirable and besides, for the utility that Bitcoin provides, it doesn't do anything other than to simulate short term economic growth.Key factor is also the salient environmental costs that is a direct result of mining, e-waste, etc.Quote from: franky1 on August 02, 2023, 10:36:02 AMalso if you look at bitcoins hashrate method. asic farms in one warehouse located at a hydro dam is alot more efficient use of electric compared to some crapcoins 'solo mining' in some hobby miners basement because household solo mining is more wide ranging of their power source and not really choosing to use hydro.. (residents dont move home specifically to live in hydro area)so comparing bitcoin to a crapcoin like doge. bitcoin is a higher % renewable rather than doge which is a eclectic mess of a bad mix of power sources due to predominantly being random home users mining doge in areas the residents dont get to choose thir source nor have planned on where to live being a electric source decisionbitcoin miners choose to build asic farms in renewable electric regions. so bitcoin is more renewable % mix by defaultJust comparing mining in general, not just Bitcoin. If you're just comparing Bitcoin specifically, you're going to have 2.88 megatonnes of carbon dioxide emitted, assuming 100% hydropower. Sure, not that significant but if you're comparing to the renewal rates of Bitcoin ASICs and the utility that Bitcoin actually provides, it just doesn't seem that worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 02, 2023, 11:03:37 AM",
      "body": "Quote from: ranochigo on August 02, 2023, 10:56:12 AMQuote from: franky1 on August 02, 2023, 10:36:02 AMcurrent hydro dams do not cause new environment/habitat destruction. most were built upto the 1990'salso when they were built they were not built to the capacity of the 1990's population estimates but the 2050 population estimates. so right now there is in a region using hydro. excess energy that can be produced, but not enough populous in that region to use it, so they dont have all turbines switched on,by having miners enter the region and use the excess. it gives funds to the power company to pay off the build costs of the 1950's-1990's sooner. meaning it makes the average cost per kw less per other domestic user. Most of the dams are built to support the communities near the dam, and in anticipation of the industrialization of the surrounding regions. Not so much to cater for the population but rather for economic growth from the on-start. They still cause ongoing environmental destruction, from the disruption or redirection of water flow and these are usually consistent rather than a one-time. The cons of having miners enter the region basically means that they don't have to prioritize any efforts to deliver long distance power to the surrounding regions. That isn't desirable and besides, for the utility that Bitcoin provides, it doesn't do anything other than to simulate short term economic growth.read your own response once more.. \"Most of the dams are built to support the communities near the dam, and in anticipation of the industrialization of the surrounding regions. Not so much to cater for the population but rather for economic growth from the on-start.\"ill emphasise it \"and in anticipation of the industrialization of the surrounding regions.\"asic mining fills that anticipated demand.. yep mining is an industry tooQuote from: ranochigo on August 02, 2023, 10:56:12 AMKey factor is also the salient environmental costs that is a direct result of mining, e-waste, etc.Quote from: franky1 on August 02, 2023, 10:36:02 AMalso if you look at bitcoins hashrate method. asic farms in one warehouse located at a hydro dam is alot more efficient use of electric compared to some crapcoins 'solo mining' in some hobby miners basement because household solo mining is more wide ranging of their power source and not really choosing to use hydro.. (residents dont move home specifically to live in hydro area)so comparing bitcoin to a crapcoin like doge. bitcoin is a higher % renewable rather than doge which is a eclectic mess of a bad mix of power sources due to predominantly being random home users mining doge in areas the residents dont get to choose thir source nor have planned on where to live being a electric source decisionbitcoin miners choose to build asic farms in renewable electric regions. so bitcoin is more renewable % mix by defaultJust comparing mining in general, not just Bitcoin. If you're just comparing Bitcoin specifically, you're going to have 2.88 megatonnes of carbon dioxide emitted, assuming 100% hydropower. Sure, not that significant but if you're comparing to the renewal rates of Bitcoin ASICs and the utility that Bitcoin actually provides, it just doesn't seem that worth it.hashrate per piece of silicon/metal. shows that having a GPU rack of many systems compared to 1 asic. shows again bitcoin is the most efficient use of electric and materialthere are under 2m asics on the planet currently running. compare that to how many motherboards and GPU cards ar running to power a crap coinif you want to cry about the 2m asic material cost.. then look at other industries too and compare. its funny how media complain that its bitcoin mining using up all the silicon supply. but when you work out the 400exa hash for 200thash asics is only 2million devices.. you soon learn its not the 2billion devices using GPU chips and cpu chips and cmos and other chips found on a huge variety of other devices",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "August 02, 2023, 11:04:15 AM",
      "body": "Quote from: ranochigo on August 01, 2023, 03:56:50 PMAll of them are invalid arguments. That being said, most of the proponents of Bitcoin mining as being \"green\" is sprouting nonsense as well. For starters, there is a difference between renewable energy and truly green energy. True green energy are carbon neutral and does no damage to the environment. Your solar panels contributes to environmental pollution, so does your dam which destroys habitats, your wind turbines which endangers wildlife, etc. People want you to believe that they are good for the environment, because they appear to be somewhat carbon neutral if you ignore the implicit costs. This is a typical type of greenwashing that everyone is falling victim to.Nope, true green energy should be carbon negative. I think dismissing them as not green at all is one dimensional. Green energy is only given to something if it's output is lower than it's impact to the environment or it's effort to offset what it emits. Let me ask you this then, if solar, hydro and wind doesn't make you happy then what type of energy source are you proposing that's carbon neutral? Those that you've mentioned are really good for the environment I think that there's a lot of independent studies that can support that.Quote from: ranochigo on August 01, 2023, 03:56:50 PMIf you're talking about extra energy that is difficult to store, that argument is invalid as well. High voltage electrical transmission, whilst introducing high energy loss, is still a viable option for most. The fact that Bitcoin mining is consuming energy already means that opportunity costs are being incurred by them having to use that energy for mining instead for domestic purposes. That is not withstanding the environmental pollution that comes from e-waste as well as silicon mining. Anyone that attempts to argue that Bitcoin is beneficial or otherwise carbon neutral is straight up lying.If it's a viable option for many, then how come people are still innovating on stuff that reduces the wasted energy? If it ain't broke don't fix it right? How are they lying when they argue that bitcoin is beneficial though? I don't get how you can lie when it's an opinion based on the facts that were given to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "August 02, 2023, 11:21:04 AM",
      "body": "Quote from: franky1 on August 02, 2023, 11:03:37 AMread your own response once more.. \"Most of the dams are built to support the communities near the dam, and in anticipation of the industrialization of the surrounding regions. Not so much to cater for the population but rather for economic growth from the on-start.\"ill emphasise it \"and in anticipation of the industrialization of the surrounding regions.\"asic mining fills that anticipated demand.. yep mining is an industry tooIndustralization with how much utility to the community? Does it provide jobs or improve the standards of living for those surrounding it? Does it provide significant and tangible utility to the rest of the world?Quote from: franky1 on August 02, 2023, 11:03:37 AMhashrate per piece of silicon/metal. shows that having a GPU rack of many systems compared to 1 asic. shows again bitcoin is the most efficient use of electric and and materialthere are under 2m asics on the planet currently running. compare that to how many motherboards and GPU cards ar running to power a crap coinif you want to cry about the 2m asic material cost.. then look at other industries too and compare. ASICs can't be repurposed. Once S17 came out, most of the S9s were scrapped. Most ASICs were notorious for being terribly unreliable and plagued with high failure rate. Besides, remember that a single ASIC has tons of chips and silicon. Circuit boards are difficult to recycle as well. Again, my argument isn't geared towards Bitcoin vs Shitcoin. Comparing Bitcoin mining to my GPUs running ML simulation, one has better utility to the society and can be repurposed.Quote from: blckhawk on August 02, 2023, 11:04:15 AMNope, true green energy should be carbon negative. I think dismissing them as not green at all is one dimensional. Green energy is only given to something if it's output is lower than it's impact to the environment or it's effort to offset what it emits. Let me ask you this then, if solar, hydro and wind doesn't make you happy then what type of energy source are you proposing that's carbon neutral? Those that you've mentioned are really good for the environment I think that there's a lot of independent studies that can support that.None. Energy production can never be truly carbon zero, but they an be carbon neutral. My point about it is when people are parroting it as being superior, \"Bitcoin helps to combat climate change\", \"Bitcoin is the new green currency\". They are all false. Bitcoin cannot fight climate change because it is a contributor to it. In fact, you are depriving someone of their ability to use clean energy because you are using it yourself.Good for the environment is a misnomer. We would be much better off without any of those and it is very much a trade off and choices that we have made.Quote from: blckhawk on August 02, 2023, 11:04:15 AMIf it's a viable option for many, then how come people are still innovating on stuff that reduces the wasted energy? If it ain't broke don't fix it right? How are they lying when they argue that bitcoin is beneficial though? I don't get how you can lie when it's an opinion based on the facts that were given to you.Money and politics. I have been through numerous papers and none of them explicitly mentions that Bitcoin Mining is good for the environment. Any news articles that postulates this often wraps the logic around their fallacy and blatant disregard for the numerous factors that are immediately obvious. Long distance UHV transmission has been achieved in numerous countries and instances, up to 3000KM long. The problem is the costs and time. Governments want to take the easy way out; they will build dams, solar arrays everywhere possible even if there is no use for it. They don't care about the environmental impact and Bitcoin Mining is a convenient way for them to make some GDP growth, if it is even half viable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 02, 2023, 11:40:33 AM",
      "body": "Quote from: ranochigo on August 02, 2023, 11:21:04 AMQuote from: franky1 on August 02, 2023, 11:03:37 AMhashrate per piece of silicon/metal. shows that having a GPU rack of many systems compared to 1 asic. shows again bitcoin is the most efficient use of electric and and materialthere are under 2m asics on the planet currently running. compare that to how many motherboards and GPU cards ar running to power a crap coinif you want to cry about the 2m asic material cost.. then look at other industries too and compare. ASICs can't be repurposed. Once S17 came out, most of the S9s were scrapped. Most ASICs were notorious for being terribly unreliable and plagued with high failure rate. Besides, remember that a single ASIC has tons of chips and silicon. Circuit boards are difficult to recycle as well. Again, my argument isn't geared towards Bitcoin vs Shitcoin. Comparing Bitcoin mining to my GPUs running ML simulation, one has better utility to the society and can be repurposed.here is one examples19 bitcoin asic has 342 chips with 2m devicesan EV car has 3000 chips with 16m EV cars on the road. 684,000,000 chips for the 2m asics48,000,000,000 chips for 16m carsa car only transports 1-4 people on averagebitcoin(registered CEX and utxo) transports 200m+ users activityplus bitcoin doesnt leave car tyre rubber (microplastics) on the roadyep EV cars put alot more particulates into the environment than bitcoin by any and all measuresbut then compare that to the hundreds of millions of combustion engine cars.. and you then see EV are better then combustion and bitcoin is better then EV when you look at the carbon/metal/silicon per user bases",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "August 02, 2023, 01:44:27 PM",
      "body": "Quote from: franky1 on August 02, 2023, 11:40:33 AMhere is one examples19 bitcoin asic has 342 chips with 2m devicesan EV car has 3000 chips with 16m EV cars on the road. 684,000,000 chips for the 2m asics48,000,000,000 chips for 16m carsa car only transports 1-4 people on averagebitcoin(registered CEX and utxo) transports 200m+ users activityplus bitcoin doesnt leave car tyre rubber (microplastics) on the roadyep EV cars put alot more particulates into the environment than bitcoin by any and all measuresbut then compare that to the hundreds of millions of combustion engine cars.. and you then see EV are better then combustion and bitcoin is better then EV when you look at the carbon/metal/silicon per user basesTurnover rates for cars and any household appliances are far lower, they can be repurposed, sold, etc independent of a lot of factors. If a new and faster car comes out, not everyone would buy it immediately unless their car has broken down. However, if a newer and faster ASIC arrived on the market, chances are, ASICs would be replaced by them in batches and thrown into the landfill. They cannot be repurposed for any purposes. Billions of transactions were processed for MasterCard, VISA, etc. Are they the better alternative? Maybe, or maybe not. The only infalliable argument is that their throughput are much higher, with a larger relative utility as compared to crypto.Most chips have various applications, but the chips in your mining ASICs would be thrown to the landfill with no way of repurposing them once they are obsolete. Obsolescence is one of the key contributors to e-waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 02, 2023, 01:59:18 PM",
      "body": "Op, there are all nice examples, but it's important to understand that only massive research that accounts for a huge chunk of global mining or, preferably, representative of global mining, can assess the harm and benefits to the environment from Bitcoin mining. There are obviously miners who simply use electricity that's cheapest or most readily available to them, and it's often sourced in a very harmful way, such as burning coal. But it's also true that Bitcoin mining can form a demand for clean energy by becoming a major buyer, it can use excess energy that would have otherwise gone to waste, and stuff like that.So far, the most comprehensible research I've seen was conducted by the MIT (it was discussed in this thread), but it accounts just for a quarter of global mining and is also inconclusive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}