{
  "id": "topic_5411179",
  "title": "Jiovanni",
  "author": "Jiovanni",
  "created_time": "August 25, 2022, 02:41:00 PM",
  "content": "Every link I copy to reference my source keeps getting blocked; stating that it's a suspicious link... Please, how do I get this fixed?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411179",
  "comments": [
    {
      "author": "LoyceMobile",
      "created_time": "August 25, 2022, 02:45:10 PM",
      "body": "It's a Newbie anti spam measure, it won't happen anymore once your account is more mature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 25, 2022, 03:01:00 PM",
      "body": "Quote from: LoyceMobile on August 25, 2022, 02:45:10 PMIt's a Newbie anti spam measure, it won't happen anymore once your account is more mature.I referenced countless numbers of times when I was a newbie, nothing like that happened to me. If it is antispam, I ought to have seen it too, but I do not often post many links, maybe the reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 25, 2022, 03:06:41 PM",
      "body": "Quote from: LoyceMobile on August 25, 2022, 02:45:10 PMIt's a Newbie anti spam measure, it won't happen anymore once your account is more mature.I never heard if suspicious link removed is only for newbie rank members only, thanks for the information. I'm not really remember exactly, but does it's possible links from higher ranks got removed? because not all high rank members do share legit source, since it can be a bought account and got negative feedback. Another thing if he's using hyperlink, does this forum can still remove the link?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "August 25, 2022, 03:18:25 PM",
      "body": "Quote from: _act_ on August 25, 2022, 03:01:00 PMQuote from: LoyceMobile on August 25, 2022, 02:45:10 PMIt's a Newbie anti spam measure, it won't happen anymore once your account is more mature.I referenced countless numbers of times when I was a newbie, nothing like that happened to me.It doesn't happen on all links, I don't know the list of links acceptable from Newbies. I'm pretty sure OP could link for instance google.com.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "August 25, 2022, 05:47:30 PM",
      "body": "What was the link you were trying to øst OP? Can you post it here and replace the dots with spaces?Quote from: Apocollapse on August 25, 2022, 03:06:41 PMQuote from: LoyceMobile on August 25, 2022, 02:45:10 PMIt's a Newbie anti spam measure, it won't happen anymore once your account is more mature.I never heard if suspicious link removed is only for newbie rank members only, thanks for the information. I'm not really remember exactly, but does it's possible links from higher ranks got removed? because not all high rank members do share legit source, since it can be a bought account and got negative feedback. It's mostly targeted at newbies afaik but will also impact those with poor reputation and some other users (depending on how unknown the link is to the forum and probably if it's phishing too - like using specific characters). I've seen it for higher ranked users before but it's mostly for newbies posting lesser seen/unique links. Quote from: Apocollapse on August 25, 2022, 03:06:41 PMAnother thing if he's using hyperlink, does this forum can still remove the link?Yes, it's just a I referenced countless numbers of times when I was a newbie, nothing like that happened to me. If it is antispam, I ought to have seen it too, but I do not often post many links, maybe the reason.[/quote]Links will be whitelisted after a while so they're not considered suspicious to the automated software under certain criteria or may be spotted based off other criteria (perhaps ranking highly in search engines). I don't know if the criteria is known as there's a chance mods could train an automated part of it by filing reports and it is done automatically afaik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 25, 2022, 11:59:05 PM",
      "body": "Quote from: LoyceMobile on August 25, 2022, 02:45:10 PMIt's a Newbie anti spam measure, it won't happen anymore once your account is more mature.This one is new to me,  I never knew the forum had such a feature in place, probably because I didn't post alot of links when I was a newbie,  can't even remember posting links at all  .All I remember was that login in to the forum was hell when my account was pretty new,  I had to always type in/pass a captcha verification, in other words,  anti-bot verification before I could login to the forum,  i don't know if that feature is still in place right now, it was one I hated with passion  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}