{
  "id": "topic_5455070",
  "title": "Agbe",
  "author": "Agbe",
  "created_time": "June 04, 2023, 04:57:10 PM",
  "content": "I drop it here because it is for general discussion.I was reading some posts and I clicked on the link provided by a senior forum user which linked me to www.bitcoin.org and I clicked on the buy and I saw QuoteBuy Crypto with Nigerian Naira via Local Bank Transfer then I was like wow!! I was surprised of seen Nigeria Local Currency in the Bitcoin Core site. But what confused me is the statement underneath. QuoteThe above widget is provided by a third party provider (MoonPay) and is not associated with bitcoin.org.. Is it that the Buy link is an ads? But it doesn't look like an ads.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455070",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 04, 2023, 05:04:06 PM",
      "body": "I do not know the agreement between Bitcoin.org and Moonpay, but that is not what is called an ad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "June 04, 2023, 09:58:43 PMLast edit: June 04, 2023, 10:09:45 PM by Potato Chips",
      "body": "Quote from: Agbe on June 04, 2023, 04:57:10 PM... then I was like wow!! I was surprised of seen Nigeria Local Currency in the Bitcoin Core site. But what confused me is the statement underneath. QuoteThe above widget is provided by a third party provider (MoonPay) and is not associated with bitcoin.org.. Is it that the Buy link is an ads? But it doesn't look like an ads. As stated, the service is not provided by bitcoin.org so if anything goes wrong, their stance would be: they can't help you.From what I've seen, widgets like this are typically part of an exchange's affiliate program where you place it on your website and everytime someone uses it to exchange, you get a commission. But since bitcoin.org has a big presence there's probably a private deal between them. Whatever the case, bitcoin.org had it done to get extra bucks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 04, 2023, 11:16:29 PM",
      "body": "Quote from: Agbe on June 04, 2023, 04:57:10 PMIs it that the Buy link is an ads? But it doesn't look like an ads. This is just something normal for most of the crypto-selling websites; in order for them to reach out to a particular country's citizens, they will always want to use their most recognized and best option for people to use.And this statement is just like when crypto was not yet In Nigeria, most exchanges make use of Flutterwave, which Nigerians can use to buy and use Bitcoin. Those exchanges don't own Flutterwave, but they are just in partnership with them. As a buyer, you pay to Flutterwave, and they confirm the transaction and then send notifications over to any exchange you use them for. That's the same thing that's happening between MoonPay and Bitcoin.org, so any debited or declined transaction should be reported directly to MoonPay and not Bitcoin.org, for they know little to nothing regarding the transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "June 04, 2023, 11:53:15 PM",
      "body": "Quote from: Potato Chips on June 04, 2023, 09:58:43 PMQuote from: Agbe on June 04, 2023, 04:57:10 PM... then I was like wow!! I was surprised of seen Nigeria Local Currency in the Bitcoin Core site. But what confused me is the statement underneath. QuoteThe above widget is provided by a third party provider (MoonPay) and is not associated with bitcoin.org.. Is it that the Buy link is an ads? But it doesn't look like an ads. As stated, the service is not provided by bitcoin.org so if anything goes wrong, their stance would be: they can't help you.Providing this service to Nigerians confirms the importance of the Nigerian market and the extent to which this can help them, since most of Nigerians exchanges are done on peer-to-peer platforms. And expect other platforms to try to enter this market.In principle, there is nothing to fear from this service or the partnership between moonpay and the platform, since both have a good reputation in the market. The Nigerian market is not open to all platforms, and the best way is to use the services of a third party to secure transactions, and this is what bitcoin.org did, which seems to be a smart and profitable move for all parties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 05, 2023, 01:04:41 PM",
      "body": "Quote from: Agbe on June 04, 2023, 04:57:10 PM Is it that the Buy link is an ads? But it doesn't look like an ads. I'm really surprised you don't know how these things work.There are hundred of websites around the internet that offer you to buy or sell cryptos via their platforms but when you go one step further you will see the exchange is provided by another service. Some use white-label websites which are basically a copy of the exchange but hosted on their domain and they get % of the fees.https://support.moonpay.com/hc/en-gb/articles/4406209996049-How-do-affiliate-payouts-work-QuoteOnce a partner has completed KYB (Know your business) with MoonPay, we can enable them to charge an additional affiliate fee on top of the MoonPay fees - if they so wish. Typically, the added fee ranges from 0.5-1.25% and if at any time a partner wants to adjust this or the payout address they need to inform MoonPay's Partner Success team. Once you have generated at least $1,000/equiv. USD of commissions, we will automatically send the funds to the payout method of your choice (see list below). But at a 4.5% min. €3.99/£3.99/$3.99  fee for cards I think there are better options out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 06, 2023, 01:07:11 PMLast edit: June 07, 2023, 12:11:07 PM by Agbe",
      "body": "Quote from: stompix on June 05, 2023, 01:04:41 PMI'm really surprised you don't know how these things work.  That is why I am here to know. The basic aspect of learning is from unknown to known and also from known to unknown. And also I don't really know why only buy is showing there. Why there is no SELL option? People SELL bitcoin more than the selling, because most of them get their bitcoin through trading and not in investment. So if there was SELLING option, they would have gotten enough customers.Quote from: stompix on June 05, 2023, 01:04:41 PMThere are hundred of websites around the internet that offer you to buy or sell cryptos via their platforms but when you go one step further you will see the exchange is provided by another service. Some use white-label websites which are basically a copy of the exchange but hosted on their domain and they get % of the fees.  That is partnership or affiliated service, from my small knowledge in marketing, small business owners attached themselves to big companies to market their goods and services and probably this is what Moonpay is doingQuote from: stompix on June 05, 2023, 01:04:41 PM...we can enable them to charge an additional affiliate fee on top of the MoonPay fees - if they so wish. Typically, the added fee ranges from 0.5-1.25% and if at any time a partner wants to adjust this or the payout address they need to inform MoonPay's Partner Success team. Once you have generated at least $1,000/equiv. USD of commissions, we will automatically send the funds to the payout method of your choice (see list below). But at a 4.5% min. €3.99/£3.99/$3.99  fee for cards I think there are better options out there. We? Please I don't really get that uses of the third person plural pronoun. Is it that you are are part of them? Yes I know that when a company affiliated with another one definitely they will pay for the advertisement service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "June 06, 2023, 01:20:35 PM",
      "body": "Looking at that buy feature, it's almost for all currencies that's available to that provider, Moonpay.Quote from: Potato Chips on June 04, 2023, 09:58:43 PMBut since bitcoin.org has a big presence there's probably a private deal between them. Whatever the case, bitcoin.org had it done to get extra bucks.Yeah, it's like a pretty convenient deal for them that they're allowed to be on that domain of bitcoin.org/en/buy and there's a note of reminder that they're not associated with bitcoin.org.Quote from: https://bitcoin.org/en/buyThe above widget is provided by a third party provider (MoonPay) and is not associated with bitcoin.org.Maybe the deal is like through every sale commission or just the duration that they'll be displayed on that domain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 06, 2023, 01:30:57 PM",
      "body": "Quote from: Agbe on June 06, 2023, 01:07:11 PM That is why I am here to know. The basic aspect of learning is from unknown to known and also from known to unknown. And also I don't really know why only buy is showing there. Why there is no SELL option? People SELL bitcoin more than the selling, because most of them get their bitcoin through trading and not in investment. First thing, this is bitcoin.org, not fiat.org so it makes no sense advertising people how to exchange from bitcoin to $, isn't it?  Second is that accepting fiat for Bitcoins is not a problem, sending fiat to a customer is different, that's why there are a ton of one way bitcoin ATMs and just a bunch that offer both sell and buy, furthermore, even on Moonpay website, you have no option of selecting Nigeria when you want to sell, and the cherry on the cake is that to sell Bitcoins you need full KYC, I just tested it now, you need a copy of ID and all that crap, no wonder Bitcoin.org doesn't want to show this side to its visitors.Quote from: Agbe on June 06, 2023, 01:07:11 PM We? Please I don't really get that uses of the third person plural pronoun. Is it that you are are part of them? I just copied in the quote the text from their affiliate page, https://support.moonpay.com/hc/en-gb/articles/4406209996049-How-do-affiliate-payouts-work-\"we\" is always used when a company refers to itself, not it or I, so that's how they phrased it, I didn't even know of their existence till yesterday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 06, 2023, 02:35:32 PM",
      "body": "Quote from: Agbe on June 04, 2023, 04:57:10 PMBut what confused me is the statement underneath. QuoteThe above widget is provided by a third party provider (MoonPay) and is not associated with bitcoin.org.. Is it that the Buy link is an ads? But it doesn't look like an ads. The buy link is an ad for sure mate, but not like the normal google ad we see flying around on different site, this one is like a partnership, that is affiliate partnership MoonPay has with Bitcoin.org, so you know that when buying bitcoin from bitcoin.org, know it that you are actually buying from MoonPay, bitcoin.org has only provided an interface which is connected to MoonPay.It's like the \"Buy\" button we find under bitcoin and some other major coins on coinmarketcap, when you click the button, you will discover that the Buy button are linked to some exchanges, like in the shot below, you are not buying from coinmarketcap, but from either binance or by bybit, depending one which option you select..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 07, 2023, 12:35:31 PM",
      "body": "Then o know thing I will like to know is that why bitcoin.org did not put sell option link and only the buy option link? I have asked this question before but it seen no answer yet and that is why I am repeating it again. I like the selling option as well as the buying option. For now I am patronizing Binance but if bitcoin.org has the option of sell and buy then I will use it as my exchange platform for all my dealings and transactions. Though the issue is not from bitcoin.org but from the exchange platform. If they have sell link in their website I would have seen in but they only have buy option in the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}