{
  "id": "topic_5427504",
  "title": "X-Metaverse",
  "author": "X-Metaverse",
  "created_time": "December 09, 2022, 09:42:22 AM",
  "content": "Many gaming altcoins are doing this",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427504",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "December 09, 2022, 10:43:35 AM",
      "body": "I would not be happy staking anything in the crypto markets right now. Have we learnt nothing from the likes of Celsius & FTX? It’s not a great time in crypto so handing over ownership of your keys/NFT’s etc is not a great idea. The amount of money you earn staking is not worth the risk involved in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 09, 2022, 10:53:01 AM",
      "body": "It's not appropriate to do it at these times. The bear market tackles every coin in the market even if they're quite higher in value these days, staking with the use of NFT, they're the most volatile assets currently.With values dropping that much for NFTs, it's too risky if there's one that you want to stake. But if you think that it's manageable and profitable soon, you can do it as you wish.These projects are giving good and high APYs and that's because only a few of them does it and its value ain't that much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "December 09, 2022, 12:17:05 PM",
      "body": "No, no, and big no.For what, did you see the value of NFTs right now? the bad things about NFTs for investors it's the book order always empty and people cannot sell their assets instantly since there is no liquidity. Imagine, you have potential to losing some value but also have the hard situation sold the asset too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexandr1115",
      "created_time": "December 09, 2022, 12:20:38 PM",
      "body": "Quote from: X-Metaverse on December 09, 2022, 09:42:22 AMMany gaming altcoins are doing thisI don't really understand all this hype and interest around NFT at all! But, most likely, all this is done for speculation to buy one NFT and sell it for more!! But other than that, I really don't understand what value they carry?? Of course, there may be some interest in this for individual works that have a lot of fans, and therefore these NFTs may have some popularity!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 09, 2022, 12:23:09 PM",
      "body": "Staking is a good way to get a passive income, but the problem here is what happens if the Token crash while you hold it. Then The staking will make you earn just cents. That's why staking with tokes is a huge risk and isn't recommended at all. Maybe it works fine for the short period, but in the long run, you will end loosing more than what you earned from staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 09, 2022, 12:50:11 PM",
      "body": "If you bought it at a high price and you're determined to recover your paper losses then you can just stake it while waiting for the next bullrun hehe. Some have already expressed their concerns about staking but I don't see any problem with your case. It doesn't matter whether you withdraw them to your non-custodial wallet or stake it since the success of the token solely depends on the success of the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "December 09, 2022, 01:17:27 PM",
      "body": "It may be profitable long-term but let's be real, how many investors now either in gaming or other projects do believe in long-term holding which is the staking process? Most beliefs are rush income, fast money, and impatient investment so I don't think it will work out right. IMO, it's still better to be paid directly with whatever the rewards are rather than sit around and have no assurance on what the future of staking will bring. Forgive my honesty but that's how the market evolves now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 09, 2022, 03:11:53 PM",
      "body": "Quote from: X-Metaverse on December 09, 2022, 09:42:22 AMMany gaming altcoins are doing thisThis is the trend before. But honestly there are so much losses incurred on those nft staking. But it due to market condition actually. Since the p2e era, the staking on nft arent become profitable now so Im not sure if this kind of field will recovery in due time but if the market able to catch up it will come back I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "December 09, 2022, 03:48:17 PM",
      "body": "Yep, There are GameFi projects who are doing this. I tried it one time at Star atlas where I can gain tokens by staking my NFT's to them. The reward is not that much but atleast you are earning something using your NFT which gave your NFT a temporary utility. It's just better than nothing if you have an existing NFT. Though If your target is to buy NFT just to stake, I think it's not worth it given that the reward is not that lucrative and has it's own risks on it's own like a possibility of deflating the NFT value in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 09, 2022, 09:45:34 PM",
      "body": "Well, when there is a game involved, there shouldn't be any staking at all. There should be a pool of tokens where people would play the game and earn and when that is over it is over that’s it, there shouldn't be anything more. Then how could it move further?Simply just improve the game, if you improve the game then there wouldn't be a need for more tokens because people could play and earn from each other and build an entire economy in there, as long as you play you would earn it, even newbies would do manual labour of sorts in a boring but long hour way and earn it. Otherwise, staking is just giving away free money to people and unacceptable in a game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "December 09, 2022, 11:27:10 PM",
      "body": "I am uncomfortable dealing with NFT.  Sure it has its advantage just like in Rollbit were holding an NFT and staking it gives players a monthly bonus, monthly reward, and a boost on Rakeback. Aside from that considering the current market and events that happens in NFT, I feel that it is a huge gamble.  Only few NFT has high demand, I think staking token is far better than NFT because token has much wider market pairs.Quote from: cryptoaddictchie on December 09, 2022, 03:11:53 PMQuote from: X-Metaverse on December 09, 2022, 09:42:22 AMMany gaming altcoins are doing thisThis is the trend before. But honestly there are so much losses incurred on those nft staking. But it due to market condition actually. Since the p2e era, the staking on nft arent become profitable now so Im not sure if this kind of field will recovery in due time but if the market able to catch up it will come back I guess.I am one of those that have huge profits and huge losses at the same time dealing with NFT games and stuff.  I earn around $6k  with an investment of $50 in just one week engaging in NFT gamings and lost half of the $5k  I invested in another game.  We all know that this kind of staking system is not sustainable and will fall apart after some time.  So as I stated, I am not comfortable with NFT staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "janggernaut",
      "created_time": "December 09, 2022, 11:32:39 PM",
      "body": "Sooner that coin which we earn from staking will be worthless. We were familar with staking especially during Defi hype, lot of people bought Defi coins and staked them on their protocol to hope they can earn passive income, but it was only for a while, you won't get any \"free money\" just by staking your coins, because when your staked coin price drop, all of your earnings through staking will be worthless (can't compensate your staked coin price). Same goes what will happen with NFTs staking, soon or later, all NFT price will fall and your earnings staking can't compensate it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "December 09, 2022, 11:53:40 PM",
      "body": "Quote from: ryzaadit on December 09, 2022, 12:17:05 PMNo, no, and big no.For what, did you see the value of NFTs right now? the bad things about NFTs for investors it's the book order always empty and people cannot sell their assets instantly since there is no liquidity. Imagine, you have potential to losing some value but also have the hard situation sold the asset too.because NFT is a different market compared to altcoins/tokens.They are the digital version of those real life collectibles - \"eg\" pokemon cards, MTG, sports cards, and etc. - there is no easy liquidity because you need to find the right buyer to sell your asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 09, 2022, 11:57:46 PM",
      "body": "Not really a fan of staking, although I admit that I have utilized this feature once on AXS. Made some money off of it but not really that big to be happy at all. Also, after I unstaked my AXS there's not much to do. I realized that eventually everyone will stake and the value of the token will be worthless. Most especially that people are looking to increase their holdings and see that they can easily do this, I wouldn't risk holding it for too long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "December 09, 2022, 11:58:48 PMLast edit: December 10, 2022, 12:09:42 AM by AmoreJaz",
      "body": "Quote from: dothebeats on December 09, 2022, 11:57:46 PMNot really a fan of staking, although I admit that I have utilized this feature once on AXS. Made some money off of it but not really that big to be happy at all. Also, after I unstaked my AXS there's not much to do. I realized that eventually everyone will stake and the value of the token will be worthless. Most especially that people are looking to increase their holdings and see that they can easily do this, I wouldn't risk holding it for too long. these days, this venture in crypto is somewhat very risky. high chance of not getting back your initial investments. high likely that you will lose on this venture. better not to get involve in this earning activity right now. some are trying to take a dip but if you will wait too long, i don't think you can recover your initial funds.if you want to stake or earn a lil bit of interest, much better if you can just put your btc in flexible or fixed savings like in binance. but NFT staking, not really sure about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}