{
  "id": "topic_5445859",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "March 21, 2023, 10:28:40 PM",
  "content": "$14 Trillion Earthquake: Fidelity And BlackRock Are Quietly Laying The Groundwork For The Next Bitcoin, Ethereum And Crypto Price Bull Runhttps://www.forbes.com/sites/digital-assets/2023/03/21/14-trillion-earthquake-fidelity-and-blackrock-are-quietly-laying-the-groundwork-for-the-next-bitcoin-ethereum-and-crypto-price-bull-run/?sh=540efc356759QuoteThe bitcoin price has added around 70% since the beginning of the year as traders brace for a potential Federal Reserve u-turn, helping the ethereum price rally.Amid the brutal crypto winter that's erased almost $2 trillion of value from the market, two of the world's largest financial institutions with a combined $14 trillion in assets under management—Fidelity and BlackRock—are quietly expanding into the world of bitcoin, ethereum and cryptocurrency.(...)Last year, Fink predicted crypto's blockchain technology will usher in \"the next generation for markets\" after signing a major deal with bitcoin and crypto exchange Coinbase.Meanwhile, Fidelity Investments has now opened up its crypto trading platform to its 37 million users to buy and sell bitcoin and ethereum commission-free, it was first reported by The Block.To be fair, I don't recall ever hearing about Fidelity Investments before, but if that's true that they introduced Bitcoin and crypto to their 37 million user base at the beginning of March, that could've surely added some fuel to the recent mini-pump.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445859",
  "comments": [
    {
      "author": "Kakmakr",
      "created_time": "March 22, 2023, 06:27:03 AM",
      "body": "Well, this explains why BlackRock was so quick to predict a global Banking crisis in their previous media statement ...after the Silicon Valley Bank problems. I hope the Fidelity Investments thing is true, because that will be an enormous boost for Bitcoin, if 37 million users can be exposed to this technology. The problem is.... how will the governments react to this and will they allow it, seeing that most governments are focusing on over regulating Bitcoin now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "March 23, 2023, 01:02:31 AM",
      "body": "Huge catalyst event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 23, 2023, 03:14:15 PM",
      "body": "Quote from: pawel7777 on March 21, 2023, 10:28:40 PMTo be fair, I don't recall ever hearing about Fidelity Investments before, but if that's true that they introduced Bitcoin and crypto to their 37 million user base at the beginning of March, that could've surely added some fuel to the recent mini-pump. Never heard of them? Well, it's not like we didn't mention them on the forum in the context of Bitcoin, and even last year you could read the following: https://www.investopedia.com/fidelity-offers-bitcoin-as-401k-investment-option-5267984However, I agree that 23 000 employees and 37 million users are not the same, but the question is whether the users will just suddenly decide to invest in Bitcoin for the reason that it was made possible for them by the company whose clients they are? Offer available in the US only.In addition, for those who do not like to read small letters :Quote from: https://www.fidelity.com/crypto/trading Investing involves risk, including risk of loss. Crypto is highly volatile, can become illiquid at any time, and is for investors with a high-risk tolerance. Investors in crypto could lose the entire value of their investment.ETFs are subject to market fluctuation and the risks of their underlying investments. ETFs are subject to management fees and other expenses.Custody and trading of crypto are provided by Fidelity Digital Asset Services, LLC, a New York State-chartered limited liability trust company (NMLS ID 1773897). Crypto is not insured by the Federal Deposit Insurance Corporation or the Securities Investor Protection Corporation (\"SIPC\").",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "March 23, 2023, 05:45:13 PM",
      "body": "Bitcoin is very liquid, unlike most cryptos/alts (small market cap).That's legal mumbo jumbo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "March 24, 2023, 11:08:35 PM",
      "body": "It appears to involve another step.  When I check, it says:\"You don't have a crypto accountStart trading with Fidelity Crypto℠ today.\"Then you can open an account.  I don't need one since I wouldn't trust a third party with my coins and it appears it is only trading and custody without any way to take the coins out of Fidelity.It is certainly better than nothing, but I don't see a \"withdraw\" or \"send bitcoin to address\" option in the information and without that, it is really hobbled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "March 25, 2023, 12:17:28 AM",
      "body": "Quote from: cr1776 on March 24, 2023, 11:08:35 PMIt appears to involve another step.  When I check, it says:\"You don't have a crypto accountStart trading with Fidelity Crypto℠ today.\"Then you can open an account.  I don't need one since I wouldn't trust a third party with my coins and it appears it is only trading and custody without any way to take the coins out of Fidelity.It is certainly better than nothing, but I don't see a \"withdraw\" or \"send bitcoin to address\" option in the information and without that, it is really hobbled.Sounds like Revolut (they never added an option to deposit/withdraw crypto).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 25, 2023, 11:02:37 AM",
      "body": "Quote from: cryptosize on March 25, 2023, 12:17:28 AMSounds like Revolut (they never added an option to deposit/withdraw crypto).Please stop shitposting, the option for BTC withdraw on that service has existed since 2021, although only as a premium option. I don't know what the situation is today, but most of the people who use that service are not too interested in non-custodial service.Besides, it makes no sense to compare these two companies, one is a giant and the other is just a small dwarf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "March 25, 2023, 11:37:36 AM",
      "body": "Quote from: Lucius on March 25, 2023, 11:02:37 AMQuote from: cryptosize on March 25, 2023, 12:17:28 AMSounds like Revolut (they never added an option to deposit/withdraw crypto).Please stop shitposting, the option for BTC withdraw on that service has existed since 2021, although only as a premium option. I don't know what the situation is today, but most of the people who use that service are not too interested in non-custodial service.Besides, it makes no sense to compare these two companies, one is a giant and the other is just a small dwarf.You are shitposting.There is no option to withdraw cryptos currently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 26, 2023, 10:57:50 AM",
      "body": "Quote from: cryptosize on March 25, 2023, 11:37:36 AMThere is no option to withdraw cryptos currently.They may have removed that option, but it was there for those who used the Metal paid plan. You claim that this option never existed.https://blog.revolut.com/bitcoin-withdrawals-have-landed/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "March 26, 2023, 11:23:11 PMLast edit: March 26, 2023, 11:43:13 PM by cryptosize",
      "body": "Quote from: Lucius on March 26, 2023, 10:57:50 AMQuote from: cryptosize on March 25, 2023, 11:37:36 AMThere is no option to withdraw cryptos currently.They may have removed that option, but it was there for those who used the Metal paid plan. You claim that this option never existed.https://blog.revolut.com/bitcoin-withdrawals-have-landed/It was a limited beta run in the UK only.Don't give me outdated links from 2021... I've been a Revolut customer since 2016.There is no reason to defend Revolut for anti-consumer practices.The company size has nothing to do with it either. Many exchanges are smaller than Fidelity and yet, they offer withdrawals for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "March 27, 2023, 08:48:24 PM",
      "body": "Quote from: Lucius on March 25, 2023, 11:02:37 AMQuote from: cryptosize on March 25, 2023, 12:17:28 AMSounds like Revolut (they never added an option to deposit/withdraw crypto).Please stop shitposting, the option for BTC withdraw on that service has existed since 2021, although only as a premium option. I don't know what the situation is today, but most of the people who use that service are not too interested in non-custodial service.Besides, it makes no sense to compare these two companies, one is a giant and the other is just a small dwarf.Just to be clear, I didn't go the next step to open an account so I don't know if they have a withdrawal option.  I just didn't see it discussed on their site.  Likewise I tried it from a HSA account so it could be different from a regular brokerage account.Any adoption is good, some is obviously better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pity Token",
      "created_time": "May 10, 2023, 05:30:48 PM",
      "body": "They have the worlds best traders and they all know that you should accumulate when the market is down. After a 1.5 year bear market they are probably done accumulating and will start to pump the markets soon. Better to be in already and just wait it out, these guys are market movers so a bit more patience is all we need",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}