{
  "id": "topic_5410387",
  "title": "Braidy BM",
  "author": "Braidy BM",
  "created_time": "August 18, 2022, 03:31:01 PM",
  "content": "I'am the new bounty manager. If you want promote your project than Contact @braidy_BM for;- Bounty Campaigns,- Project Logo, Banner, Designing.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410387",
  "comments": [
    {
      "author": "asriloni",
      "created_time": "August 19, 2022, 03:34:03 AM",
      "body": "If you wanna offering your service and it's better if you are creating your own service in the correct section like service or service altcoins. You can also create on both of sections. Mostly of project owners were actively looking for the new manager on that section. I think that will help you a lot to give advertisement for your service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Braidy BM",
      "created_time": "August 19, 2022, 06:53:53 AM",
      "body": "Thanks for your feedback. Please pray for us",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "August 19, 2022, 02:02:17 PM",
      "body": "Quote from: Braidy BM on August 18, 2022, 03:31:01 PM- Project Logo, Banner, Designing.Since you have also mentioned these services, it's best for you to post some of the samples that you've made. It will make your potential clients an idea of how you make these designs and logos. Your rank is still a newbie so your pictures won't appear unless you gain 1 merit and rank up as a jr member with a corresponding activity requirement or you can purchase a Copper membership so, your designs are visible on your thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Almasani",
      "created_time": "September 19, 2022, 07:38:19 PM",
      "body": "You can add another option in the form of the number of participants in the group you have, this will give the project owner a better offer.I've checked some of the projects you're managing. But only social media campaigns. How about a signature campaign, can you make it more attractive compared to other managers? Since you are a new manager, of course you should be able to offer something different and more interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jeger.Kiting",
      "created_time": "September 23, 2022, 09:08:57 AM",
      "body": "With your intention to be the new bounty manager in a project I don't think that's a problem but you misplaced this thread you created you should create a thread in the Marketplace section and then you into the services section, because there are a lot of people will respond to threads that You created to tell you about What you want. Success is always mate, and if you have good intentions, there will be many ways to achieve what you want to be a BM.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}