{
  "id": "topic_5414197",
  "title": "WikibitJapan",
  "author": "WikibitJapan",
  "created_time": "September 20, 2022, 06:03:55 AM",
  "content": "英国の金融規制当局である金融行動監視機構（the Financial Conduct Authority：FCA）は9月16日、暗号通貨取引所FTXの英国内における無許可での営業に対して警告した（https://www.fca.org.uk/news/warnings/ftx）。FCAは「英国内で金融サービスや商品を提供、宣伝、販売する企業や個人は全て、FCAの認可を得るまたは登録しなければならない」と説明した。さらに、「FTXは許可無く英国の投資家にサービスを提供しているが、投資家は金融オンブズマンサービスや金融サービス補償制度（the Financial Services Compensation Scheme：FSCS）の保護を受けられないため、万が一の場合にお金が戻ってくる可能性は低い」と警告文で消費者に注意を呼びかけた。FTXは2022年3月7日にFTXヨーロッパ（FTX Europe）を設立し、https://ftx.com/euのドメインでキプロス証券取引委員会（the Cyprus Securities and Exchange Commission：CySEC）の認可を取得したと発表した。同社は欧州経済領域内で営業可能なライセンスを取得し、欧州の顧客にFTXの商品とサービスを提供する予定である。FTXヨーロッパは現在、スイスに本社を置き、キプロスに地域本部を新たに設置している。一方、英国で特定の暗号資産サービスを提供する企業は、マネーロンダリング、テロ資金調達、資金移動規則を遵守するものとし、FCAに登録しなければならない。2022年5月、英国政府は暗号通貨の導入支援計画を発表した。計画の中にはステーブルコインの規制も盛り込まれている。「英国を暗号資産テクノロジーの世界的なハブにする。暗号通貨関連企業を起業して成長させるのに世界で最も適した場所にする」と前財務大臣リシ・スナック（Rishi Sunak）氏は4月に述べた。しかし、スナック氏は7月に前首相のジョンソン政権を辞任した。新首相のリズ・トラス（Liz Truss）氏は暗号資産について2018年1月の「暗号通貨の可能性を制約しない形で歓迎すべきだ」という発言以来、まだ発言はない。英国は現在厳しいエネルギー問題に直面しているため、エネルギーの供給計画を迅速に打ち出さなければならない。トラス首相は、「この厳しい時代を乗り越え、経済を成長させ、英国の潜在能力を引き出すために大胆な行動を取るつもりだ」とツイートした。暗号資産に関する政策は今後変わる可能性もある。WikiBitでのFTXの安全性評価は6.74である。WikibitのFTXの画像を入れてください。https://www.wikibit.com/ja/dr/1234581200962.html免責事項暗号通貨は価格変動が激しく、トレードの際は自身の投資経験、目標、財務状況、リスクを取る能力等について十分検討する必要があります。本記事はあくまでも情報提供を目的としており、投資を推奨するものではありません。また、本記事を参考して投資した結果被った損失について、弊社は一切の責任を負いかねます。WikiBitとは？弊社が提供しているWikiBitは、暗号通貨取引所・トークンの信頼性に関する情報を収集・公開している第三者プラットフォームです。登録されている暗号通貨取引所・トークンの数は、全世界で１万件を超えています。「真相公開」のページでは、実際に詐欺に遭ってしまったトレーダーからの被害報告が日々投稿されています。また、WikiBitでは暗号通貨に関連するニュースや、相場情報までトレードに役立つ有益な情報を日々発信しています。初めて暗号通貨（仮想通貨）取引所を利用する際は、入金前にWikiBitのアプリで、取引所の安全性や評判を確認することを強く推奨しています。https://www.wikibit.com/jp_ja/download.htmlコンテンツは全て無料で閲覧できます。ぜひ上記のリンクからWikibitアプリをダウンロードして、取引所の情報をチェックしてみてください。",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414197",
  "comments": [
    {
      "author": "annarr",
      "created_time": "April 12, 2023, 06:14:50 AM",
      "body": "家でできる副業1日1万5000円の収入があります。1.操作が簡単で収入が安定します3.毎日決済し、いつでも引き出しが可能です。4.安全で合法的です私に連絡して新しいお金の稼ぎ方を始めますLINE:love335518https://line.me/ti/p/He-hCoG-R0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}