{
  "id": "topic_5455766",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "June 08, 2023, 03:32:29 PM",
  "content": "On June 5th, Apple released Apple Vision Pro, calling it their first spatial computer. It is an amazing piece of technology and innovation. They continuously push the boundaries of what is possible. I watched the introduction on YouTube, and it was terrific. Check out an expert's opinion on their website.1QuoteApple today unveiled Apple Vision Pro, a revolutionary spatial computer that seamlessly blends digital content with the physical world, while allowing users to stay present and connected to others. Vision Pro creates an infinite canvas for apps that scales beyond the boundaries of a traditional display and introduces a fully three-dimensional user interface controlled by the most natural and intuitive inputs possible — a user’s eyes, hands, and voice. Featuring visionOS, the world’s first spatial operating system, Vision Pro lets users interact with digital content in a way that feels like it is physically present in their space. The breakthrough design of Vision Pro features an ultra-high-resolution display system that packs 23 million pixels across two displays, and custom Apple silicon in a unique dual-chip design to ensure every experience feels like it’s taking place in front of the user’s eyes in real time.I wonder what this means for the gambling industry, the gambling experience, and gambling addiction. I would like us to discuss this topic. Gambling with this device would make it feel like you are in a casino. I am pretty sure the experience would be out of this world - the visuals, the sounds, the overall feel. On the other hand, it seems that it could be easy for a gambler to lose track of time while using the device because the immersive experience might make it difficult to see or be aware of the time, leading to a potential increase in gambling addiction. The odds against the player won't change, only the experience. Please share your thoughts on this matter.1. https://www.apple.com/newsroom/2023/06/introducing-apple-vision-pro/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455766",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "June 08, 2023, 03:47:36 PM",
      "body": "According to two YouTube videos that I watched after the Apple Vision Pro was released, they said people should take note that it can only last two hours after it is fully charged. Some people may want to track their gambling activities like in sport betting, this can not much be of any help. But it would be of good experience for casino users.With what I learn about it too, only apple apps are still there for now. With time developers will have app there too. Likely it is using a different OS that is not iOS and macOS. But for gambling sites to have apps for it, it will take time. But if there is web browser, it can be used to access gambling site on it easily. Another thing is that wearing this for long may not be that comfortable at all.Also isolating yourself to do things on this thing may be kind of weird for people around you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "June 08, 2023, 03:53:01 PM",
      "body": "Quote from: Oshosondy on June 08, 2023, 03:47:36 PMAccording to two YouTube videos that I watched after the Apple Vision Pro was released, they said people should take note that it can only last two hours after it is fully charged. Some people may want to track their gambling activities like in sport betting, this can not much be of any help. But it would be good much for casinos.I think is just a waste to use on sportsbetting. This is suitable for slot games and most likely on live casino games which probably the main market of this gadget if implemented on gambling. The experience on using this on live games like blackjack and game shows will be ecstatic because it’s already close to playing in real casino. Bitcasino have a metaverse for their live casino. I think this gadget will be perfect to partner with their metaverse since it can create a better VR on gambling. Is this better on Oculus VR?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 08, 2023, 04:04:54 PM",
      "body": "Quote from: Beparanf on June 08, 2023, 03:53:01 PMIs this better on Oculus VR?Did you mean better than? I will say so, but also very expensive. Apple Vision Pro cost $3500 which is more than expensive. But it is the best that I have seen. According to the review I have watched before it is eyes sensitive. If you look at apps on the vision pro, the app will detect that as it increases in size, and if you want to click on the app, only what you need to do is to touch your thumb with your fore finger and it will click. Apps and everything is controlled by your eyes and your fingers. It would be of nice experience, but the battery is not strong and it is too expensive. Some VR devices are requires you to connect to PC or console though, while Oculus VR like Quest or Meta Quest 2 last 2 to 3 hours after fully charged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "June 08, 2023, 05:17:04 PM",
      "body": "I do think that the fact that you can converge two (2) different realities at the same time is just groundbreaking and technological complex. However, if I have that kind of technology, I would probably use it on a different platform like streaming movies or work. The limited battery hinders me from doing other stuff without having to plug it while using.Though this may be the case, this could actually be the start of a technological revolution and innovation. The fact that Apple had already started this movement means that there will be applications that will be created exclusively for the use of VRs and ARs.Still, however, online gambling in different platforms is still the key in this day and age. Maybe the days of visiting a physical casino may soon be obsolete, but I do think that this is far from happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 08, 2023, 05:39:24 PM",
      "body": "Quote from: Davidvictorson on June 08, 2023, 03:32:29 PMI wonder what this means for the gambling industry, the gambling experience, and gambling addiction. I would like us to discuss this topic. This is a stupidly overpriced product. But it may sell well due to Apple's branding. But I don't see any impact on the gambling industry unless someone wants to experience casino in metaverse. Usually seasoned gamblers will not want to experience this, rather they would like to focus on the game to make money. For some newbie gamblers, who had never experienced casino, they might want to try this just to experience it. At the end of the day, entire metaverse concept is rubbish and it will eventually die down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "June 08, 2023, 05:49:22 PM",
      "body": "The Apple Vision Pro has the ability to improve gambling experience and turn some people into gambling addicts, but it is still the people who are susceptible to becoming addicts. The gambling experience will improve, but it will affect those more who are unable to control themselves. For any gambler who is strong willed and disciplined in their gambling, the Apple vision Pro will not be successful in turning them into addict's by making them go against their normal gambling habits and principles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "June 08, 2023, 05:49:42 PM",
      "body": "Quote from: avikz on June 08, 2023, 05:39:24 PMQuote from: Davidvictorson on June 08, 2023, 03:32:29 PMI wonder what this means for the gambling industry, the gambling experience, and gambling addiction. I would like us to discuss this topic. This is a stupidly overpriced product. But it may sell well due to Apple's branding. But I don't see any impact on the gambling industry unless someone wants to experience casino in metaverse. Usually seasoned gamblers will not want to experience this, rather they would like to focus on the game to make money. For some newbie gamblers, who had never experienced casino, they might want to try this just to experience it. At the end of the day, entire metaverse concept is rubbish and it will eventually die down. The Metaverse Casino is pretty interesting, but some of the Metaverse projects aren't just Apple Vision. Even before Apple Vision came out, there were a lot of cheaper VR products out there. Apple Vision is priced at $ 3500 and this is certainly quite expensive.For those who want to experience the Metaverse presented by Apple, maybe price won't be a problem. But for some people spending that much money just for a device that is not very useful, they certainly won't do it. Of course there will be many similar devices that are cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 08, 2023, 05:54:16 PM",
      "body": "Quote from: avikz on June 08, 2023, 05:39:24 PMQuote from: Davidvictorson on June 08, 2023, 03:32:29 PMI wonder what this means for the gambling industry, the gambling experience, and gambling addiction. I would like us to discuss this topic. This is a stupidly overpriced product. But it may sell well due to Apple's branding. But I don't see any impact on the gambling industry unless someone wants to experience casino in metaverse. Usually seasoned gamblers will not want to experience this, rather they would like to focus on the game to make money. For some newbie gamblers, who had never experienced casino, they might want to try this just to experience it. At the end of the day, entire metaverse concept is rubbish and it will eventually die down. Apple has the habit to make old version unusable like the old apple phones that we can't install apps anymore because its unsupported by their istore. Yes many will still buy this but I may not. I probably will wait for what Samnsung will release as their version.For gambling, yes this could be useful especially in card games. You wanna see what the card dealer and players in poker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "June 08, 2023, 06:00:55 PM",
      "body": "Quote from: kamvreto on June 08, 2023, 05:49:42 PMQuote from: avikz on June 08, 2023, 05:39:24 PMQuote from: Davidvictorson on June 08, 2023, 03:32:29 PMI wonder what this means for the gambling industry, the gambling experience, and gambling addiction. I would like us to discuss this topic. This is a stupidly overpriced product. But it may sell well due to Apple's branding. But I don't see any impact on the gambling industry unless someone wants to experience casino in metaverse. Usually seasoned gamblers will not want to experience this, rather they would like to focus on the game to make money. For some newbie gamblers, who had never experienced casino, they might want to try this just to experience it. At the end of the day, entire metaverse concept is rubbish and it will eventually die down. The Metaverse Casino is pretty interesting, but some of the Metaverse projects aren't just Apple Vision. Even before Apple Vision came out, there were a lot of cheaper VR products out there. Apple Vision is priced at $ 3500 and this is certainly quite expensive.For those who want to experience the Metaverse presented by Apple, maybe price won't be a problem. But for some people spending that much money just for a device that is not very useful, they certainly won't do it. Of course there will be many similar devices that are cheaper.That's what I was thinking when I checked the price of this gadget, not everyone can afford to buy one. But that is true, with the launch of this Apple product, definitely, there will be similar products from other brands that will emerge fast. So yes, once the public can afford this type of gadget, a lot will be hooked into this and gambling industry is no exception. A lot of younger ones are already into the gaming industry today, so gambling industry is quite reachable by this generation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "June 08, 2023, 06:06:22 PM",
      "body": "I think that there won't be any great implication, because Apple Vision Pro is a stupid product with a really stupid price. It is scandalous to pay 3500$ for a Vision pro.In my opinion the first revolution will start when a cheap product with great technology will come out, and technology at the moment is \"unripe\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "June 08, 2023, 06:06:33 PM",
      "body": "Quote from: Davidvictorson on June 08, 2023, 03:32:29 PMI wonder what this means for the gambling industry, the gambling experience, and gambling addiction. I would like us to discuss this topic. Gambling with this device would make it feel like you are in a casino. I am pretty sure the experience would be out of this world - the visuals, the sounds, the overall feel. On the other hand, it seems that it could be easy for a gambler to lose track of time while using the device because the immersive experience might make it difficult to see or be aware of the time, leading to a potential increase in gambling addiction. The odds against the player won't change, only the experience. Please share your thoughts on this matter.A gambling addict doesn't need a casino environment and can be satisfied with online gambling but i wouldn't say the same for newcomers to gambling. Gambling at the casino is a very attractive environment for beginners. If you feel like a king there and the more you earn, the more likely you are to lose money. The fact that VR and AR technologies keep the casino environment alive will of course start gambling for those who are new to gambling and those who are hesitant to go to the casino. Vision Pro will be ideal, especially for those who want to gamble at the casino and hesitate to go there. Vision pro has the potential to conquer not only the gambling industry but also many experience based industries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "June 08, 2023, 08:36:54 PM",
      "body": "It could encourage third party providers to make VR or AR games in the future, but I agree with the others this shouldn't have that much impact in the gambling space since they're not necessary as most of the casino games can be played without it. IMO they're more suitable for physical casinos than online so most gamblers won't have to spend so much money just to experience a different gameplay. I doubt it'll increase the case of gambling addictions when there's barely any need to get the new Apple device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "June 08, 2023, 08:41:40 PM",
      "body": "Quote from: Oshosondy on June 08, 2023, 03:47:36 PMAccording to two YouTube videos that I watched after the Apple Vision Pro was released, they said people should take note that it can only last two hours after it is fully charged. Some people may want to track their gambling activities like in sport betting, this can not much be of any help. But it would be of good experience for casino users.With what I learn about it too, only apple apps are still there for now. With time developers will have app there too. Likely it is using a different OS that is not iOS and macOS. But for gambling sites to have apps for it, it will take time. But if there is web browser, it can be used to access gambling site on it easily. Another thing is that wearing this for long may not be that comfortable at all.Also isolating yourself to do things on this thing may be kind of weird for people around you.I havent watched it yet but this one turns out to be that just like on putting up your mobile phone into a VR googles or headsethttps://www.cbc.ca/news/science/virtual-reality-1.3455804It might be different but it would really be just a similar concept on which i dont see any difference at all. Adding up that addiction? I dont think so.Gamblers would really be much preferring on using up those casual engagement on which they arent really that wearing up something.Although with this tech existing then it wont really be thatsurprising that there would be those people who would really be loving to test it out and would really tend to see that it is something that giving that different vibeor experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 08, 2023, 08:51:49 PM",
      "body": "Quote from: Gianluca95 on June 08, 2023, 06:06:22 PMI think that there won't be any great implication, because Apple Vision Pro is a stupid product with a really stupid price. It is scandalous to pay 3500$ for a Vision pro.In my opinion the first revolution will start when a cheap product with great technology will come out, and technology at the moment is \"unripe\".Exactly, who will spend that much for a product like this, and I’m sure other brand will have a better version of this one who will offer it at a cheaper price. If this is Metaverse then they should make it cheaper so that many can afford and the trend will continue. I assume this product will not get much of a buyer, the price is too much for a less feature of this product, better to wait for more years and we will see this trend to be more cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "June 08, 2023, 08:59:52 PM",
      "body": "I don't think that this device can increase the gambling satisfaction a person experienced in gambling without integrating metaverse.  Since this gadget works as a mobile phone set into a VR googles then there is nothing new experience it gives but a bragging right that they had an expensive VR gadget.Quote from: ralle14 on June 08, 2023, 08:36:54 PMIt could encourage third party providers to make VR or AR games in the future, but I agree with the others this shouldn't have that much impact in the gambling space since they're not necessary as most of the casino games can be played without it. IMO they're more suitable for physical casinos than online so most gamblers won't have to spend so much money just to experience a different gameplay. I doubt it'll increase the case of gambling addictions when there's barely any need to get the new Apple device.I think it will heighten the entertainment if metaverse is integrated on the apps that will run on the device.  Else it will be just a normal experience which I also don't think will affect the gambling experience of a person that much.  Thus, I also think that it won't have that much impact on the gambling addiction of a person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 08, 2023, 09:02:11 PM",
      "body": "They say that Apple gets every product right and I guess they got the Vision Pro right as a product but I doubt all gamblers would love that.Sure most of us of the generation that have been born in 1990 and up will love that as we grew up with video games like Nintendo,Sega and Sony as kids and then moved to other games,mostly to casino providers where we are now   and personally I would love to be immersed in the world of slot machines,their medieval themes would look so real and the level of adrenaline and emotions will be insane when we play slot machines with this new technology.However there are about 80% of gamblers who do not give a damn about this technology as they are happy with how things are now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 08, 2023, 09:12:20 PMLast edit: June 11, 2023, 05:32:55 PM by Silberman",
      "body": "Quote from: Davidvictorson on June 08, 2023, 03:32:29 PMOn June 5th, Apple released Apple Vision Pro, calling it their first spatial computer. It is an amazing piece of technology and innovation. They continuously push the boundaries of what is possible. I watched the introduction on YouTube, and it was terrific. Check out an expert's opinion on their website.1QuoteApple today unveiled Apple Vision Pro, a revolutionary spatial computer that seamlessly blends digital content with the physical world, while allowing users to stay present and connected to others. Vision Pro creates an infinite canvas for apps that scales beyond the boundaries of a traditional display and introduces a fully three-dimensional user interface controlled by the most natural and intuitive inputs possible — a user’s eyes, hands, and voice. Featuring visionOS, the world’s first spatial operating system, Vision Pro lets users interact with digital content in a way that feels like it is physically present in their space. The breakthrough design of Vision Pro features an ultra-high-resolution display system that packs 23 million pixels across two displays, and custom Apple silicon in a unique dual-chip design to ensure every experience feels like it’s taking place in front of the user’s eyes in real time.I wonder what this means for the gambling industry, the gambling experience, and gambling addiction. I would like us to discuss this topic. Gambling with this device would make it feel like you are in a casino. I am pretty sure the experience would be out of this world - the visuals, the sounds, the overall feel. On the other hand, it seems that it could be easy for a gambler to lose track of time while using the device because the immersive experience might make it difficult to see or be aware of the time, leading to a potential increase in gambling addiction. The odds against the player won't change, only the experience. Please share your thoughts on this matter.1. https://www.apple.com/newsroom/2023/06/introducing-apple-vision-pro/I think that since the metaverse became a thing people have been thinking about the possibility of online gambling taking yet another step and becoming way more realistic than what we have right now, and I think this is inevitable, it will not happen tomorrow as I think the price of those devices is going to be too high for the majority of the population, but give it a few decades and they will be everywhere, so it is important that casinos begin to explore those new possibilities, since the first casino which creates an attractive experience you can go through in conjunction with VR equipment will become the leader of that new market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Volgastallion",
      "created_time": "June 08, 2023, 09:14:39 PM",
      "body": "It can change the interfase for the client/player, and you can be more \"immersive\" but in the end its gonna be the same as always, you are gonna spend the same mone you spend today and make the same plays you make today.In the first days maybe a company gains a little momentum with the early adoption but not so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 08, 2023, 09:49:07 PM",
      "body": "Quote from: Volgastallion on June 08, 2023, 09:14:39 PMIt can change the interfase for the client/player, and you can be more \"immersive\" but in the end its gonna be the same as always, you are gonna spend the same mone you spend today and make the same plays you make today.In the first days maybe a company gains a little momentum with the early adoption but not so much.You can just use that money as your capital instead of spending that much on an item that can’t totally affect your gambling experience. Well, rich people will always want to follow the trend so I expect many will still buy and since this is not just about gambling, many are curious about this thing and how it can change the experience of many. Let’s just see if Apple will allow us to experience it without buying it, because I’m curious too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}