{
  "id": "topic_5450905",
  "title": "Lavey666",
  "author": "Lavey666",
  "created_time": "May 02, 2023, 01:26:47 AM",
  "content": "Saludos Comunidad, me gustaria saber si alguien me puedo ayudar tenia algunos ethers en mi ledger live pero debido a un accidente se quemo el dispositivo junto con el lugar donde tenia escrito las 24 palabras semillas. por ahora solo tengo al aplicacion de escritorio y un respaldo de la cuentas y todas las transacciones pero al intentar enviar las cryptos logicamente me pide el disositivo,Mi pregunta es Puedo recuperar alguna clave privada a partir de los archivos de respaldo o las semillas a partir de estos archivos o definitivamente ya perdi los ethers, ayuda por favor",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450905",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 02, 2023, 03:28:41 AM",
      "body": "Siento decirte que si se te quemaron las semillas también, no. Con una de las dos cosas podrías hacer algo, o bien el Ledger o bien las 24 palabras, pero si se te quemaron las dos,  lo has perdido. El sistema es una forma de asegurarse de que un ladrón o hacker no te pueda robar lo que tienes si no tiene el Ledger o las palabras.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 02, 2023, 10:31:34 AM",
      "body": "De verdad que lo siento Lavey666.Como dice Don Pedro Dinero, si se te quemaron las semillas y el dispositivo está inutilizable, no hay forma de recuperar tus ethers. Son como la contraseña de tu dirección de email: aunque tengas copias de todos tus correos, sin esa contraseña no puedes acceder a tu cuenta. Y a diferencia de la mayoría de clientes de correo, aquí no hay un sitio centralizado donde poder reclamar o solicitar una nueva contraseña.Espero que la pérdida no haya sido muy grande y que puedas recuperarte. En el mejor de los casos, quizá esto haya servido de lección para alguien que lo lea, o para ti mismo en el futuro. Aunque en caso de incendio poco se puede hacer. Un dispositivo metálico para guardado de claves te habría venido bien, pero son incómodos de usar y no es por lo que nos inclinamos la inmensa mayoría, así que no te culpes y ¡ánimo!Hoy puede ser el día en el que perdiste, pero también el día en el que te caiste y levantándote empezaste a ganar. Depende de ti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lavey666",
      "created_time": "May 02, 2023, 02:27:36 PM",
      "body": "Bueno graxias a todos por las respuestas, si fue 1 cuarto de ethereum que se perdio, pero quedara de leccion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 02, 2023, 03:49:56 PM",
      "body": "Quote from: Lavey666 on May 02, 2023, 01:26:47 AM<…>No sé si la semilla con las 24 palabras quemada estaba en un dispositivo físico o en papel, pero en este segundo caso, en la remota posibilidad de que se hubiese quemado parcialmente (es decir, que veas algunas palabras de la semilla pero no todas), se podría recurrir a herramientas como la descrita en este hilo. Técnicamente, va bien tener una copia de la semilla, o un Ledger clonado (o afín), fuera en un entorno distinto como contingencia para estos casos, aunque abre otras derivadas a cuidar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "May 20, 2023, 06:36:31 PM",
      "body": "Y por eso siempre, siempre se le dice a la gente que al escribir las frases semilla a mano en un papel, hacer otra copia a mano en otro papel y guardarla en un lugar físicamente distinto, precisamente por esto. Que sirva de aprendizaje para los demás, las frase semilla es lo mas valioso, lo demás se puede perder no importa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 22, 2023, 10:25:47 AM",
      "body": "Quote from: Lavey666 on May 02, 2023, 02:27:36 PMBueno graxias a todos por las respuestas, si fue 1 cuarto de ethereum que se perdio, pero quedara de leccionLamento la pérdida Lavey666, para muchas economías 500 dólares o euros que es el contravalor de un cuarto de ethereum ahora mismo no es algo que uno se pueda permitir perder a la ligera. Reitero lo dicho en mi antiguo post: ¡Ánimo y a sobreponerse! Aprovecha la ocasión y siempre que quieras consultar alguna que otra duda o desahogarte, aquí serás bienvenido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}