{
  "id": "topic_5466256",
  "title": "Magic-Maker-40",
  "author": "Magic-Maker-40",
  "created_time": "September 09, 2023, 07:57:10 PMLast edit: September 09, 2023, 10:47:23 PM by Magic-Maker-40",
  "content": "First of all welcome to all of you on this platform. that is an excellent platform to learn about cryptocurrency (digital Market). on that platform, You get a lot of experience when you are active on this platform. and also gain knowledge about the crypto and start earning after some time There are a lot of people( seniors) here to guide you and provide you solutions to almost every problem lot of people are earning from there you can also do that. you can earn money by different ways:Bounty project  Signaure compains  Project Management Bounty Project:In bounty projects, you just need a wallet and social media accounts according to the requirements of followers if you want to join signature campaigns because most of bounty projects also have signature complaints. the pool will be in USDT or in Altcoins. you will receive your reward in your wallet according to your stakes. the stakes are specified with followers for example if you have 500 followers then you get one stake if you have 1,500 followers then you get 3 or 5 stakes. and each stake has a specific point that decides how much reward you earn. there are different types of wallets:Etherium base   Also known as ERC 20 Wallet Binance smart chain   Also known as BSC or BSC 20 WalletTron   Also known as TRC 20 WalletPolygon    it known as polygon 20 WalletHere is Link: https://bitcointalk.org/index.php?board=238.0Signature campains:in the signature compains you need a wallet to receive your payment but in that, you need merits  to participate to join campaigns which are difficult to earn and sometimes you get them easily that depending on your post quality in signature you need full member rank at least to start work the payment receive weekly and depends on your rank in this the payment is specified on per post according to the rank for example if you are full member the payment on per post is 1.5$ and if you are sr. member  2$  per post and so on .... you have to do your task according to the requirement most campaigns want 25 posts per week and some want 30 or 50 that depend on them.Project Management:In Project management, you need to be loyal If you want more projects you need to build trust then people will join your project for that one you need merit to show your project thoughts and other things and convince the project owner there are lot of people managing lot of project the project manager charge some fee in the form of  USDT or BTC or the Project coin you have to manage weeks reporting and also have to manage sheet and make it up to date. if your project is successful then it makes a good impression on your profile and you also get more projects to manage earn more. and people like to join projects that are managed by high-profile. like sr. member hero member and legendary member. Note: Please do not post with Plagiarism otherwise your account will be banned in the future never try to scam and one more thing do not behave rudely with the seniors   Give respect take respect[/list]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466256",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "September 09, 2023, 08:00:45 PM",
      "body": "As a newbie, you already know a lot of things. With a quick preview of your topic, how about moving it to beginners and helping them?Since you want to educate your fellow newbies, it will be well received by them. Check the left lower part of the thread you will see the move option…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "September 09, 2023, 08:36:12 PM",
      "body": "I don’t know but,I’ll like to know what’s the idea or motive that backs your creating of this subject on meta?If your this good, you would as well have known that meta is meant for important discussions that relates the forum, some report cases, appeal, forum related upgrades, time outs and things of that sort not this!Don’t be too focused on teaching without learning. Learn to appropriate threads to where they belong as well.The beginners and help board would suit your thread just fine. You wouldn’t be expecting a newbie or beginners to come twerking here. Kindly move your thread to the beginners and help board. It would be more appreciated there and possibly serve its purpose more.Nice time you’ve put in creating your thread, don’t waste it on meta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 09, 2023, 08:40:17 PM",
      "body": "Quote from: Smartvirus on September 09, 2023, 08:36:12 PMI don’t know but,I’ll like to know what’s the idea or motive that backs your creating of this subject on meta?Merit, what else? He failed to get merit in WO thread so he thought to give it a chance here.@OP better luck next time buddy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 09, 2023, 09:37:52 PM",
      "body": "Another thread of teaching people what to do while they are not practicing it..You have less than 15 post at the time of making replying to this topic, and you have come to understand how the system works and yet you still never gained any merits to prove how good you are with this platform. This is to show that your real motives was to only gain merits and join signature campaign to receive money, yes nothing is wrong with this but to me i will say it's too early for you to focus about campaign and merits i think develop yourself on how to be creating quality contents and while doing that do not make it to be too obvious that either you are sourcing for merits or trying to put efforts on a paid campaign. While doing that this platform could be too tough for you to scale through since you are only focusing on the profits aspect of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "September 09, 2023, 09:46:10 PM",
      "body": "Even though there are newbies whose intention of joining the forum is motivated by bounties & signature campaigns, there are newcomers who genuinely see this forum as a place where they can learn and interact with bitcoin OGs about whatever questions they may have. I’m surprised OP’s writing is this good considered the typos he made in the title of the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "September 09, 2023, 10:04:46 PM",
      "body": "You write a good post, OP, but it appears you have limited knowledge of this particular forum; everything you say about it is true, but there is more to it; the forum's primary goals are learning about bitcoin and sharing ideas, while signature and bounty campaigns were added to encourage current forum members to continue offering helpful feedback whenever it is requested.That is why beginners are expected to go around the forum, observe it, and learn enough knowledge about the forum rules and the various sections in the forum so that they can know the right place for the information or knowledge they want in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 09, 2023, 10:46:44 PM",
      "body": "Quote from: SatoPrincess on September 09, 2023, 09:46:10 PMEven though there are newbies whose intention of joining the forum is motivated by bounties & signature campaigns, there are newcomers who genuinely see this forum as a place where they can learn and interact with bitcoin OGs about whatever questions they may have. I’m surprised OP’s writing is this good considered the typos he made in the title of the thread. Even I was shocked... Haha, Well we learn from mistakes still this is Insane.Op I would like to suggest you use some grammar tools to avoid such mistakes, as I'm a regular poster and I Know that typing mistakes are highly possible so, better to avoid them using some free grammar tools, I have a recommendation of using the Grammarly, it works fine at least for me in removing the typo mistakes. Some other punctuation mistakes feature as well but to go in-depth you need to pay for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "September 09, 2023, 10:54:22 PM",
      "body": "Quote from: Magic-Maker-40 on September 09, 2023, 07:57:10 PMTips for beginnersSuch great tips for beginners. I am not a beginner, I wanted to skip the post but on a second thought I decided to check the rank of the creator of the topic. Lo! It happens to be another newbie teaching newbies thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magic-Maker-40",
      "created_time": "September 09, 2023, 11:03:12 PM",
      "body": "Quote from: uchegod-21 on September 09, 2023, 10:54:22 PMSuch great tips for beginners. I am not a beginner, I wanted to skip the post but on a second thought I decided to check the rank of the creator of the topic. Lo! It happens to be another newbie teaching newbies thread.I am also a newbie but I think my points are valid am I right",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 09, 2023, 11:09:03 PM",
      "body": "I'd like to ask OP if and have you done all and if have you been there, A topic from the signature, bounty campaign, and bounty management should come from veteran and ranking members with extensive experience in being into bounties, signature campaigns, and bounty management because they have first hand experience not just being an observant.When writing or giving tips the authority of the one giving it should not be questionable, OP you can write any subject but never about bounty, signature, and bounty management if you do not have the experience to be what it's like and how to manage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "September 09, 2023, 11:20:08 PM",
      "body": "Quote from: Magic-Maker-40 on September 09, 2023, 11:03:12 PMQuote from: uchegod-21 on September 09, 2023, 10:54:22 PMSuch great tips for beginners. I am not a beginner, I wanted to skip the post but on a second thought I decided to check the rank of the creator of the topic. Lo! It happens to be another newbie teaching newbies thread.I am also a newbie but I think my points are valid am I right Your points are not valid to the targeted rank; newbie. A newbie don't need to read about joining signature in the forum and methods of receiving funds. What I expected from the topic, was a thread that leads to helpful and knowledgeable bitcoin or crypto resources, that'll help teach them more about bitcoin. If they do not understand or learn about cryptocurrency, the points you stated here may not be useful to them. Unless for the bounty campaign, which will also end up being detrimental to their stay in the forum. And you didn't add the effects of bounty campaign to a newbie, how it can affect the learning process of a newbie. When reaching out to newbies, it's always great to provide a way to solve a problem for newbies. It'll go a long way to teach other newbies, who will join the forum tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tamaperdana",
      "created_time": "September 10, 2023, 03:21:57 AM",
      "body": "Very useful tips. Even though you are still a beginner, you already have quite extensive knowledge about this forum. It seems that you have studied the contents of this forum well, because the discussion you provide is very neat and very good.Maybe this topic will be a motivation and encouragement for beginners like me. But, to achieve all that is certainly still very far away. But it's not a big problem, because my intention in joining this forum was to increase my knowledge about cryptocurrencies and bitcoin. So regarding bounties or signatures, this might just be a boost to your enthusiasm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 10, 2023, 04:05:43 AM",
      "body": "Quote from: Magic-Maker-40 on September 09, 2023, 11:03:12 PMI am also a newbie but I think my points are valid am I right Refocus from signature campaigns and how to earn from the forum and just learn about Bitcoin. You do not need expert knowledge, just get enough of the basics and then keep learning from there, that is enough to discuss here without it looking forced or like you're fishing for merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 10, 2023, 04:08:40 AM",
      "body": "Tbh, when I saw the title of the thread and also the rank of the Op I thought in my mind that this was going to be another lecture about “how to get merits” from a newbie account but I was quite surprised to see that it was more about earning from the forum than contributing to the forum. Op, it would have been better if you had created a tips on how newbies can gain information that will help them grow here in the forum, because from what I can tell it’s not advisable to participate in limited as you’ll get little to nothing from participating there and you’ll also be stuck as a newbie forever because most bounty hunter ever visit other boards to learn about crypto all they do is to dump their social media links on their bounty threads and move on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "September 10, 2023, 05:31:57 AM",
      "body": "Quote from: Magic-Maker-40 on September 09, 2023, 07:57:10 PMThere are a lot of people( seniors) here to guide you and provide you solutions to almost every problem lot of people are earning from there you can also do that. Op, you have excluded yourself from the \"guide\" you mentioned above? and as a newbie, you need to be guided in this forum so that you will know how to do things properly. Also, as a newbie leave the aspect of teaching even though you have a great knowledge of cryptocurrency. Learn about how things are being done here and the rest will follow with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "September 10, 2023, 06:31:02 AM",
      "body": "Quote from: uchegod-21 on September 09, 2023, 10:54:22 PMQuote from: Magic-Maker-40 on September 09, 2023, 07:57:10 PMTips for beginnersSuch great tips for beginners. I am not a beginner, I wanted to skip the post but on a second thought I decided to check the rank of the creator of the topic. Lo! It happens to be another newbie teaching newbies thread.LoL… we keep seeing many cases of newbies trying to teach their fellow newbies how things are done instead of them to focus on learning and achieving their goals of joining the forum. It is obvious this is also the main reason OP joined the forum, he is only interested in making money here that’s why he knows so much about bounties and signatures with just 15 activities on his profile. If you have try to learn as you should you would be aware this board is not the right board for this post. Clearly this thread proves you are only trying to earn merit so you can move up the ranks in order to participate in signature campaigns but it won’t help you so just focus on learning first and not teaching other newbies in order to earn merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "September 10, 2023, 08:16:52 AM",
      "body": "Quote from: Magic-Maker-40 on September 09, 2023, 07:57:10 PM-snip-Note: Please do not post with Plagiarism otherwise your account will be banned in the future never try to scam and one more thing do not behave rudely with the seniors   Give respect take respectWe wish you luck with all the targets you want in the forum. It's not just plagiarism that needs to be considered, but everything that could damage your reputation must be considered.You have potential, but it seems like you're having a bit of trouble with the way you're doing it.It's better to motivate yourself regarding the skills you should develop so that other people can benefit. Trust me. If you do this, it won't make you lose.Make several members from your country who have good knowledge and are willing to contribute to the forum as your motivation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 10, 2023, 09:34:27 AM",
      "body": "A good attempt to get merits, but unfortunately if the beginner has access to this topic, he will most likely know how to search for topics and then he will learn all these things.Try to help the people in your local board, and after a while  collect all your distinguished contributions and I will rate them for you. If you speak English, try to share new information away from signature campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 10, 2023, 12:54:39 PM",
      "body": "It's funny to see a newbie giving advice about plagiarism and it's consequences of doing it while at the same time giving tips about bounties when it's not always on the positive side when you join one. I am sure you have known already that there are lots of scam bounties whereas the legit bounties are not easy to find. Honestly, I was expecting something good when I read the title \"TIPS\" but rather read about tips about bounties and wallets needed for receiving rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}