{
  "id": "topic_5398078",
  "title": "325btc",
  "author": "325btc",
  "created_time": "May 10, 2022, 07:39:51 PM",
  "content": "Just based on instutional data aka wall street and financial instutions.Just based on that we can assoome that bulls and big economic boom and prosperity.What else we can assoome is that war situation will be over quite soon if we look at the instutional data.Its just based on instutional data such us cmegroup and other wall streeters. By looking the data of instutions we can assoome that even fed will say sorry but no more rate hikes and markets need to be saved We can assoome that bad times will be over soon no more covid no more putin and war only good news and markets will be bullish off course not today not tommorow but this year when its not even important anyways just buy and get ready for bull run.Once markets ready for bull run then im sure all the wars and negative things will be put on pause for sure.Its all prediction just based on instution data learn how to read that and you will know the whole economy and markets bulls and bears.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398078",
  "comments": [
    {
      "author": "Zilon",
      "created_time": "May 10, 2022, 08:18:01 PM",
      "body": "Quote from: 325btc on May 10, 2022, 07:39:51 PMOnce markets ready for bull run then im sure all the wars and negative things will be put on pause for sure.Its all prediction just based on instution data learn how to read that and you will know the whole economy and markets bulls and bears. Are you saying the market bull run will stop the war? If you meant economic stability then it might be a partial truth still. The economy can be stable and bitcoin still suffer even more dip. Bitcoin is still a threat to financial institutions and as such it's bullish trend is more dependent on the investors than the economy. Fundamental news this days are misleading and many FUD hype are sponsored. Research this days are better done technically than running with every win of news",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ololajulo",
      "created_time": "May 10, 2022, 08:22:54 PM",
      "body": "Quote from: Zilon on May 10, 2022, 08:18:01 PMQuote from: 325btc on May 10, 2022, 07:39:51 PMOnce markets ready for bull run then im sure all the wars and negative things will be put on pause for sure.Its all prediction just based on instution data learn how to read that and you will know the whole economy and markets bulls and bears. Are you saying the market bull run will stop the war? If you meant economic stability then it might be a partial truth still. The economy can be stable and bitcoin still suffer even more dip. Bitcoin is still a threat to financial institutions and as such it's bullish trend is more dependent on the investors than the economy. Fundamental news this days are misleading and many FUD hype are sponsored. Research this days are better done technically than running with every win of newsIt wont stop the war but will benefit from it. Everyone is looking for a safe place to hide their money in war and I think digital coin is the safest while you think about running elsewhere safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "325btc",
      "created_time": "May 10, 2022, 08:36:50 PM",
      "body": "Quote from: ololajulo on May 10, 2022, 08:22:54 PMQuote from: Zilon on May 10, 2022, 08:18:01 PMQuote from: 325btc on May 10, 2022, 07:39:51 PMOnce markets ready for bull run then im sure all the wars and negative things will be put on pause for sure.Its all prediction just based on instution data learn how to read that and you will know the whole economy and markets bulls and bears. Are you saying the market bull run will stop the war? If you meant economic stability then it might be a partial truth still. The economy can be stable and bitcoin still suffer even more dip. Bitcoin is still a threat to financial institutions and as such it's bullish trend is more dependent on the investors than the economy. Fundamental news this days are misleading and many FUD hype are sponsored. Research this days are better done technically than running with every win of newsIt wont stop the war but will benefit from it. Everyone is looking for a safe place to hide their money in war and I think digital coin is the safest while you think about running elsewhere safe.Sure but most likely when bull run then usually good situation all over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "May 10, 2022, 09:34:29 PM",
      "body": "I know you're talking data, but where's the data? give me a little picture of the calculation of it all. Data and data but none of the calculations you are trying to illustrate here. The market is relatively corrected not only because of the war, but the US has also planned from the beginning to increase interest rates and withdraw all circulation of the dollar. The war has been running for almost 3 months and they don't care how volatile fiat or crypto money is as an alternative. The US withdrew from aid because it had run out of aid stocks. They are busy fixing inflation in their country.War will only cloud the market atmosphere. But regarding Bitcoin's bull run relationship with war, it only has 1% of its impact on the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "May 10, 2022, 09:38:34 PM",
      "body": "Quote from: ololajulo on May 10, 2022, 08:22:54 PMQuote from: Zilon on May 10, 2022, 08:18:01 PMQuote from: 325btc on May 10, 2022, 07:39:51 PMOnce markets ready for bull run then im sure all the wars and negative things will be put on pause for sure.Its all prediction just based on instution data learn how to read that and you will know the whole economy and markets bulls and bears. Are you saying the market bull run will stop the war? If you meant economic stability then it might be a partial truth still. The economy can be stable and bitcoin still suffer even more dip. Bitcoin is still a threat to financial institutions and as such it's bullish trend is more dependent on the investors than the economy. Fundamental news this days are misleading and many FUD hype are sponsored. Research this days are better done technically than running with every win of newsIt wont stop the war but will benefit from it. Everyone is looking for a safe place to hide their money in war and I think digital coin is the safest while you think about running elsewhere safe.But unfortunately for seeing digital assets is also bleeding people may think that this is also not a good option since this is more volatile than their current position or they might go to adopt gold since physical assets is more convenient to those rich people globally. Hopefully we can see more clearer picture about when this crisis ends because this is already hurt the humanity badly since crisis starting to build up on other countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "May 10, 2022, 10:08:00 PM",
      "body": "Quote from: Sterbens on May 10, 2022, 09:34:29 PMI know you're talking data, but where's the data? give me a little picture of the calculation of it all. Data and data but none of the calculations you are trying to illustrate here. The market is relatively corrected not only because of the war, but the US has also planned from the beginning to increase interest rates and withdraw all circulation of the dollar. The war has been running for almost 3 months and they don't care how volatile fiat or crypto money is as an alternative. The US withdrew from aid because it had run out of aid stocks. They are busy fixing inflation in their country.War will only cloud the market atmosphere. But regarding Bitcoin's bull run relationship with war, it only has 1% of its impact on the market.Why people do really love on tagging things up in regarding with bitcoins price together with these fundamentals around? Somehow we cant really say that it has zero impact but we know since from the beginningthat crypto market isnt really that highly reactive on what are the problems around its space whether its an economic one or not.We've been through lots of events or situations like this but market could still move in a very random way but as a trader/investor then it isnt really a bad idea to have these considerations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}