{
  "id": "topic_5446168",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "March 24, 2023, 01:42:38 PM",
  "content": "A ligação notável entre o ciclo de Benner e o ciclo de halving do BitcoinOntem encontrei uma imagem, do ciclo de Benner e gostaria de compartilhar alguns insights sobre essa profecia e os ciclos do Bitcoin. Samuel T. Benner foi um agricultor que, após enfrentar perdas financeiras significativas, procurou entender os padrões econômicos. Ele descobriu um ciclo recorrente de altos e baixos nos preços das commodities e na atividade econômica, que chamou de Ciclo de Benner. A profecia de Benner foi baseada na ideia de que as flutuações econômicas seguem um padrão consistente, com um ciclo de 16 a 18 anos para imóveis e um ciclo de 8 a 10 anos para commodities.Se Benner estivesse vivo, ele sem dúvida notaria o padrão Bitcoin de 4 anos do Bitcoin.Ao que me parece, o halving do Bitcoin está alinhado com o ciclo de commodities de 8 a 10 anos Primeiro halving: novembro de 2012Segundo halving: julho de 2016Terceiro halving: maio de 2020Próxima halving: março-abril de 2024Historicamente, um ano antes do Halving, entramos no pós-crash ou período de acumulação e os preços param de cair, preparando o terreno para o início da corrida de touros. Coincidência que o preço comece a subir este mês? Considerando os ciclos de Benner, os tempos de entrada e saída do Bitcoin2023: ''Anos difíceis, preços baixos e um bom momento para comprar''2026: ''Anos de bons tempos, preços altos e tempo para vender''Sabem aquele meme da cabeça explodindo? To sentindo isso hoje. Acho que super desvalorizamos as coisas do dia a dia, tipo sol, estações. E sobrevalorizamos o que é menos importante.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446168",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "March 24, 2023, 03:40:32 PM",
      "body": "São tantos ciclos econômicos.Ciclos de juros, ciclos de crises bancárias, ciclos não faltam!https://investnews.com.br/economia/selic-passa-por-7o-ciclo-de-alta-desde-a-criacao-das-metas-de-inflacao-relembre/Esse é aí por exemplo esta desatualizado com a última alta mas mostra o tamanho dos ciclos.A bolsa acaba seguindo o caminho oposto.Mas acho q os having terão impacto cada vez relativamente menores com o tempo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 24, 2023, 07:21:04 PM",
      "body": "Disruptivas só fiquei com uma duvida: se o Benner desenho esses ciclos em 1875, porque é que a imagem só começa em 1924!?De resto, é interessante como realmente estas coisas são cíclicas. Mas acho que isso é fruto de dois coisas:- Sistema que não sofre grandes alterações desde que foi implementado.- Os humanos tem a tendência de repetirem sempre os mesmos erros - tem memoria curta da sua historia. Normalmente temos uma geração que comete grandes erros, a geração seguinte corrige a situação e faz tudo para não voltar acontecer, a 3ª geração \"esquece\" o que aconteceu e começa a cometer os mesmos erros.Quote from: bitmover on March 24, 2023, 03:40:32 PMMas acho q os having terão impacto cada vez relativamente menores com o tempo.Também acredito nisso. Acho que o próximo having seja o que ainda terá alguma relevância. Depois a partir dai terá menos impacto no mercado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "March 24, 2023, 07:49:59 PM",
      "body": "Profecias eu só acredito nas do Nostradamus. E também tem uma do Leonardo da Vinci que dizia que surgiria um dinheiro digital(Bitcoin). No restante sou cético.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 25, 2023, 01:56:40 PM",
      "body": "Quote from: joker_josue on March 24, 2023, 07:21:04 PMDisruptivas só fiquei com uma duvida: se o Benner desenho esses ciclos em 1875, porque é que a imagem só começa em 1924!?- Os humanos tem a tendência de repetirem sempre os mesmos erros - tem memoria curta da sua historia. Normalmente temos uma geração que comete grandes erros, a geração seguinte corrige a situação e faz tudo para não voltar acontecer, a 3ª geração \"esquece\" o que aconteceu e começa a cometer os mesmos erros.Quote from: bitmover on March 24, 2023, 03:40:32 PMMas acho q os having terão impacto cada vez relativamente menores com o tempo.Também acredito nisso. Acho que o próximo having seja o que ainda terá alguma relevância. Depois a partir dai terá menos impacto no mercado.Não sei dizer sobre a questão das datas. Primeiro pensamento que tive foi que seria para se proteger. Mas deve ser outra coisa. Realmente não sei e não tinha me atentado. Eu não sei, não acho que seja pela questão da memoria ou esquecimento. Acho que o mundo é regido por muitas regras que ignoramos. Todos os planetas tem ciclos. Mulheres tem seus ciclos especificos de fertilidade. Todos temos ciclos hormonais. Pra mim faz sentido que existam muitas regras que simplesmente não identificamos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}