{
  "id": "topic_5474225",
  "title": "totti67",
  "author": "totti67",
  "created_time": "November 15, 2023, 06:37:57 PM",
  "content": "Ülkemizin 5 yıllık kredi risk priminin dün 364,64 baz puana inmesiyle son 2,5 yılın en düşük seviyesini gördüğü ile ilgili bir haber okudum bugün. Konu ile ilgili Bakan Şimşek, \"Uyguladığımız ekonomik programın sonuçları 2024'ün ikinci yarısından itibaren net şekilde görülecek, böylece yatırımcı güveni daha da pekişecek ve ülkemize küresel fon akışı hız kazanacaktır. Bu da dezenflasyon programının kısa vadeli büyüme görünümü üzerindeki aşağı yönlü riskleri sınırlayacaktır.\" değerlendirmesini yapmış.Yeni ekonomi yönetiminin uyguladığı evrensel gerçekliği ve geçerliliği olan yöntemler sayesinde umarım tunelin ucundaki ışık azıcık da olsa görülmüştür. Enflasyonu dizginlemede henüz elle tutulur bir durum olmasa da devam eden süreçte daha hissedilir iyileşmeler olması muhtemel. Yeter ki abuk subuk müdahalelerle süreç baltalanmasin. https://www.aa.com.tr/tr/ekonomi/turkiyenin-5-yillik-kredi-risk-primi-son-2-5-yilin-en-dusuk-seviyesine-indi/3054003https://www.aa.com.tr/tr/ekonomi/hazine-ve-maliye-bakani-simsek-2024un-ikinci-yarisindan-itibaren-ulkemize-kuresel-fon-akisi-hiz-kazanacaktir/3054093",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474225",
  "comments": [
    {
      "author": "Vispilio",
      "created_time": "November 15, 2023, 06:55:16 PM",
      "body": "Çok çeşitli savaşların çıktığı ortamda, ordusu ve savunma sanayii güçlü olan devletlere güven doğal olarak artar, ekonomik iyileşmeden ziyade askeri güvenlik yönünden okumak gerekir bence bu CDS'teki düşüşü...Zaten savaş çıkan bölgelerin insanlarına dikkat edin, en popüler göç mekanlarından biri Türkiye oluyor, bunun da 2 sebebi var, 1) Bütün yönetimsel sorunlara rağmen harika bir coğrafya olması 2) Türkiye'nin askeri gücü dolayısıyla güvenli topraklar kabul edilmesi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "November 15, 2023, 07:19:16 PM",
      "body": "Ben de askeri gücümüzün bu düşüşte önemli bir payı olduğunu düşünüyorum. Çünkü açıkçası henüz ekonomide doğru düzgün bir düzelme ibaresi göremedik. Aksine zamlar gelmeye ve enflasyon daha da kötü gitmeye devam ediyor. Mehmet Şimşek 1-2 yıl sonrası için ekonomide gerçek anlamda rahatlamaların başlayacağına işaret etmişti. Ona daha yolumuz var o yüzden. Yine de tabi risk primimizin biraz gerilediğini görmek güzel. Son birkaç yıl içerisinde o kadar tepetaklak olduk ki iyi haberlere duacıyız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 15, 2023, 07:42:05 PM",
      "body": "Önümüzdeki seçim geçtikten sonra yapılmaya çalışılan düzenlemeler inşallah yarıda kesilmez. Eğer  bu yönde bir adım atılmadan şu sıralar milletin çektiği reillik azalacaktır. Maaşlar önümüzdeki yıl enfşasyonda gerileme olması için muhtemelen düşük tutulacak. Bu veriler olumlu olarak enflasyona yansır ise ülke cds pirimide düşmeye devam edecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "November 15, 2023, 07:53:17 PM",
      "body": "Ekonomik olarak yönetimin sıkı politikası ile birlikte bu adımlar pozitif gelişme olarak sevindirici sayılır. Risk priminde düşüş olması harika ancak enflasyon denilen bir meret var ve buna çare bulunmazsa tek başına risk primi düşüşü de etkileyemeyecek bizi. Yine de Mehmet Şimşek’in çabası Nebati’nin yıkımını kurtarma yönünde çok iyi sayılır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "November 15, 2023, 09:14:46 PM",
      "body": "Quote from: totti67 on November 15, 2023, 06:37:57 PMÜlkemizin 5 yıllık kredi risk priminin dün 364,64 baz puana inmesiyle son 2,5 yılın en düşük seviyesini gördüğü ile ilgili bir haber okudum bugün. Konu ile ilgili Bakan Şimşek, \"Uyguladığımız ekonomik programın sonuçları 2024'ün ikinci yarısından itibaren net şekilde görülecek, böylece yatırımcı güveni daha da pekişecek ve ülkemize küresel fon akışı hız kazanacaktır. Bu da dezenflasyon programının kısa vadeli büyüme görünümü üzerindeki aşağı yönlü riskleri sınırlayacaktır.\" değerlendirmesini yapmış.Yeni ekonomi yönetiminin uyguladığı evrensel gerçekliği ve geçerliliği olan yöntemler sayesinde umarım tunelin ucundaki ışık azıcık da olsa görülmüştür. Enflasyonu dizginlemede henüz elle tutulur bir durum olmasa da devam eden süreçte daha hissedilir iyileşmeler olması muhtemel. Yeter ki abuk subuk müdahalelerle süreç baltalanmasin. https://www.aa.com.tr/tr/ekonomi/turkiyenin-5-yillik-kredi-risk-primi-son-2-5-yilin-en-dusuk-seviyesine-indi/3054003https://www.aa.com.tr/tr/ekonomi/hazine-ve-maliye-bakani-simsek-2024un-ikinci-yarisindan-itibaren-ulkemize-kuresel-fon-akisi-hiz-kazanacaktir/3054093Hem çevredeki savaşlardan dolayı Türkiye'ye güvenli bir bölge olarak bakılması hem de atılan adımların şu ana kadar kararlı şekilde devam ettirilmesinin sonucu olarak görüyorum. Bakan Şimşek'in değerlendirmesi hedeflenen şekilde devam edileceğinin sinyallerini veriyor. Yatırımcının gelmesine engel olan birçok etken piyasada güven ortamının oluşmasını zorlaştırırken her açıklamasında hedefe yönelik kararlılıktan bahsetmesi bence iyi bir durum. Bu şekilde devam edildiğinde ekonomimiz hedeflendiği gibi olursa hepimiz seviniriz.Farklı senaryolar da çiziliyor ama her zaman her türlü senaryolar konuşulur. Aldıkları ekonomi çok kötüydü ve toparlamak da bir o kadar zor. Umarım yapmış olduğu değerlendirmedeki şeyleri başarırlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "November 16, 2023, 03:37:12 PM",
      "body": "Quote from: Vispilio on November 15, 2023, 06:55:16 PMÇok çeşitli savaşların çıktığı ortamda, ordusu ve savunma sanayii güçlü olan devletlere güven doğal olarak artar, ekonomik iyileşmeden ziyade askeri güvenlik yönünden okumak gerekir bence bu CDS'teki düşüşü...Zaten savaş çıkan bölgelerin insanlarına dikkat edin, en popüler göç mekanlarından biri Türkiye oluyor, bunun da 2 sebebi var, 1) Bütün yönetimsel sorunlara rağmen harika bir coğrafya olması 2) Türkiye'nin askeri gücü dolayısıyla güvenli topraklar kabul edilmesiSavaş dolayısıyla ülkemizin güvenli alan olarak görünmesi tabii ki  geçerli bir neden ama bence daha geçerli neden olarak global para birimlerinin ülkemizdeki değeri dolayısıyla çok fazla şeye sahip olabilmeyi kolaylaştırmasini söyleyebilirim.Ekonomi yönetimi ile ilgili en büyük korkum önümüzde seçim, uygulanan disiplin sekteye uğrarsa bir çuval incirin çöpe atılması gerekebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "November 16, 2023, 08:34:41 PM",
      "body": "Merak etmeyin düştüğü gibi çıkar yeniden. Ülkede hukuk rafa kaldırılmışken riskin azaldığını iddia etmek komik. Anayasa Mahkemesi kararlarının uygulanmadığı bir ülkede işini yapan gazeteciler içerideyken toplumsal infial yaratma amacıyla planlı cinayet işleyen katil bugün serbest bırakıldı. Siyasi rakip olarak görüldüğü için hukuksuz şekilde yıllarca tutuklu duran suçsuz insanlar içeride, ülkenin değerli insanlarını öldüren katiller ve azmettiricileri mafya bozuntuları dışarıda. Böyle bir yere yatırım gelmez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "November 17, 2023, 04:56:44 AM",
      "body": "Quote from: LGD2Business on November 16, 2023, 08:34:41 PMMerak etmeyin düştüğü gibi çıkar yeniden. Ülkede hukuk rafa kaldırılmışken riskin azaldığını iddia etmek komik. Anayasa Mahkemesi kararlarının uygulanmadığı bir ülkede işini yapan gazeteciler içerideyken toplumsal infial yaratma amacıyla planlı cinayet işleyen katil bugün serbest bırakıldı. Siyasi rakip olarak görüldüğü için hukuksuz şekilde yıllarca tutuklu duran suçsuz insanlar içeride, ülkenin değerli insanlarını öldüren katiller ve azmettiricileri mafya bozuntuları dışarıda. Böyle bir yere yatırım gelmez.Hocam benim de en çok kafama takilan konular bunlardi, kabul etmeliyiz ki mevcut yönetim iç siyasette gündem belirleme ve degistirmede artık uzmanlasmis durumda. Memleketin ekonomik sorunlarının üzerini mutlaka bir şekilde kapatıyorlar, yüksek yargı birbirine girdi, tam o sirada Hrant Dink'in katili salındı, arada zenginliklerinin kaynağı belli olmayanlar bir bir içeri alınıyor, dışarıda olması gerekenler salınmiyor vs vs. Bu kadar modern çağda sorun teşkil edecek olaya rağmen bu düzelme bana garip geldi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}