{
  "id": "topic_5397841",
  "title": "Apocollapse",
  "author": "Apocollapse",
  "created_time": "May 09, 2022, 06:06:16 AM",
  "content": "This forum intended for Bitcoin related discussion and you can learn about Bitcoin especially from many high ranked reputable users. However beside learning Bitcoin, you can actually earn some money by offering your service, sell goods, signature campaign and bounties. It's not wrong to learn about Bitcoin and discuss with other users, also at the same time you can earn money too. But, many brand new users doesn't want to learn about Bitcoin and their sole purpose is to earn money. This wrong approach have been done by many new users, become a bounty hunter is wasting time and no have any journey.Take a look with this user Smking1212 he's a bounty hunter maximalist where almost of his posts posted on Bounties section (1296 from 1308 posts or 99%). Currently he already have 518 activity which is enough to become a Hero Member, but he never earn any single merit even he's an active user, that make he's still a newbie rank. It's pitiful to see many users didn't care anything with the forum and just doing what does he wanted in this forum.To be honest bounties is really wasting time, worthless and no have any positive impact for doing that. Bounty is wasting time because you need to spend your times to complete the bounty task, especially you're joining many campaigns. Bounty is worthless because the distributions isn't same as their beginning promise. They're promising the total pool is 1,000,000 tokens and it's will be worth $1/token, so we will think the pool is $1,000,000. But after few weeks the bounty ran, the team reduced the pool from 1,000,000 tokens to 500,000 tokens. Bounty hunters can't do anything since the team reserve the right to change anything about the campaign. Then after the bounty ended and the pool already distributed, the token price doesn't worth $1/token as their promise, now it's $0.00001/token.Bounty no have any positive impact because you're work like a robot by retweet, like, share, one liner comment, post the link etc. You're not learn anything and you don't have any knowledge about Bitcoin.Let me give you an example of the recent bounty that has been finished.🔥🔥 [Bounty][CAESAR]153,617.49% APY! CAESAR FINANCE [AVAX C-Chain] $CAESAR🔥🔥 this bounty is managed by reputable campaign manager.The bounty reward they promised is 100,000,000 tokens worth $150,000 or $0.0015/token. But based on coinmarketcap the price right now is $0.00007859/token. The difference is $0.00142141/token it's really huge and yet any complaint from the hunters wouldn't change the token price. Based on the spreadsheet the average hunters get 25,000 tokens or $1.96475 after working for 4 weeks. The signature campaign participants got the highest share of 1914893 tokens or $150, but don't forget this token only listed on single unknown exchange named TraderJoe. Most of unknown exchanges will charge ridiculous fees even though the fees for the miners is cheap. On my experience I did using Hotbit for sell my shitcoins to Bitcoin and they ask 0.001 BTC/33 USD for the fees while the actual fee I paid for the miners is just $5.Don't forget bounties managed by reputable manager doesn't always guaranteed the project wouldn't scam, below there are some bounties the project turned become scam:scam🚧 [SCAM] Protocol X _______________________________ [ 1,000,000 BOUNTY POOL ] NeedforTurbo Bounty(SCAM TEAM)No one can stop scam bounties and the forum didn't moderated scam too, so we're better off to avoid all bounties and we wouldn't get scammed.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397841",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 09, 2022, 06:13:31 AM",
      "body": "Unpopular opinion for some reason: you don't need to get all your income from Bitcointalk, or the cryptocurrency industry in general. The world wide web is so vast and limitless that I really don't know why most people here think that this is their only option. I'd rather become a virtual assistant than just spam social media with crypto links.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 09, 2022, 06:37:52 AM",
      "body": "Thats depend on you how to become active here and used your time. Yes there are bounty hunters whom wasted time on posting just for sake to earn money but not all hunters are like that. There are some whose still remains as human and talk like one and were able to continue a good standing here. It does not mean that if you are bounty hunter your only purpose is to interact due to monetization alone but become an active member too contributing to this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "May 09, 2022, 06:45:45 AM",
      "body": "99% of all bounties are wasting a time for both sides, hunters and owners. About bounty worthless, I would rather say that it is due to the poor quality of the project itself. on top of all that the whole project starts without start-up capital or with a very small amount, no wonder the prizes are worthless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "May 09, 2022, 06:52:11 AM",
      "body": "Quote from: mk4 on May 09, 2022, 06:13:31 AMThe world wide web is so vast and limitless that I really don't know why most people here think that this is their only option. I'd rather become a virtual assistant than just spam social media with crypto links.The answer is simple: to spam social media links you don''t have to have any skills and involves so little effort that one person can manage more than a dozen of alt accounts. And since we know that majority of people will chose the easy way even though it will give them way less money, no wonder that bounty campaigns are so popular. The bigger question here is why those projects even do bounty campaigns?Quote from: cryptoaddictchie on May 09, 2022, 06:37:52 AMIt does not mean that if you are bounty hunter your only purpose is to interact due to monetization alone but become an active member too contributing to this forum. True, but let's be honest here, how many bounty hunters are like that? As I said few days ago in another thread, it simply doesn't pay off to be a legit bounty hunter because there are so many of those with bunch of newbie alt accounts that are diluting the bounty pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "May 09, 2022, 06:57:33 AM",
      "body": "This is the risk of participating the campaign. Of course the team will value there token in ICO price since the amount is undetermined unless it was listed on the exchange. You should edit the title and include bounty campaign with mediocre project since not all campaigns results the same way. Some are performing better after the ICO but I agree that only few nowadays has good profit after the campaign duration. Anyway not much effort and work done here since you are just sharing and reacting on social media. I've done this task before and this is too easy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "May 09, 2022, 07:05:32 AM",
      "body": "it was worth it back in 2017 but today is just not going to make you money anymore. the teams making these tokens will have to spend a lot of money probably more than they could get from the funds they get to enlist the token to an exchange. while you will have a ton of tokens rewarded to you, you may not be able to trade them.  it's time to ask the teams for BTC as payment, not thier tokens. time to demand BTC from them or no exposure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 09, 2022, 07:24:39 AM",
      "body": "Quote from: Rikafip on May 09, 2022, 06:52:11 AMTrue, but let's be honest here, how many bounty hunters are like that? As I said few days ago in another thread, it simply doesn't pay off to be a legit bounty hunter because there are so many of those with bunch of newbie alt accounts that are diluting the bounty pool.Many. Im not sure but being in signature campaign, regardless in payment of tokens or usdt or btc, does it all count to be bounty as long as we incentivize it and monetize the reward? Or just because we are paid in btc werent considered as those joining in altcoin campaign who also wear signature but paid in tokens? Probably those newbie account farming social bounties, but it is the same in a sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "May 09, 2022, 07:44:29 AM",
      "body": "Quote from: cryptoaddictchie on May 09, 2022, 07:24:39 AMMany. Im not sure but being in signature campaign, regardless in payment of tokens or usdt or btc, does it all count to be bounty as long as we incentivize it and monetize the reward? Or just because we are paid in btc werent considered as those joining in altcoin campaign who also wear signature but paid in tokens? You can still be a shitposter whole sole purpose is to leech of this forum even if you are in BTC signature campaign, no questions about it. Currently there are more spots in BTC signature campaigns than there are quality members which makes it easy for such members to earn decent amount of bitcoin.Regarding altcoin campaigns, those who are doing signature part make a small portion of altcoin bounty campaign while majority consists of newbie accounts that spam social media part of the bounty and that's where the biggest abuse happens due \"newbies allowed\" rule and where it doesn't make any sense (unfortunately) to do it legit way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Israelgogo",
      "created_time": "May 09, 2022, 07:55:39 AM",
      "body": "The probability of begginners been scammed and hacked is high ,so many online platforms claim to be giving bonuses ,bounties, spin and win claiming you have won millions ,it only takes a reasonable person who is very careful and do not money oriented driving mindset to decode this and avoid been hacked,looking for free money you did not work for might make you loose all your money ,it is always good to learn to overlook this bonuses tho few just are genuine but likely ,the more reason why i donnot expect freebies.Well knowing that the high rate of scam online is on the high side ,one need to be very cautious of which link you click or where you visit online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 09, 2022, 08:48:17 AM",
      "body": "Quote from: Apocollapse on May 09, 2022, 06:06:16 AMTake a look with this user Smking1212 he's a bounty hunter maximalist where almost of his posts posted on Bounties section (1296 from 1308 posts or 99%). Currently he already have 518 activity which is enough to become a Hero Member, but he never earn any single merit even he's an active user, that make he's still a newbie rank. This is one area that the merit system has been very productive. Though subjective, it has helped to discourage spamming. No matter how anyone wants to help that user, they're likely going to find it difficult what post to merit. It's that bad. There were occasions in the past that I took it upon myself to look for users who had zero merit but enough activities to senior rank so I could merit them. Sadly, most of those I found were users whose posts were basically bounty reports.OP, all you said about bounty not worth it is true. Bounty this day is like faucet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bhig Daddy",
      "created_time": "May 09, 2022, 09:03:32 AM",
      "body": "To me most people join bitcoin not because they want to learn but because they see their friends earning in bounties. To be honest most people don't even know what bitcointalk is about, because when their friends introduced them to bitcointalk they only teaches them about bounty. So most people are ignorance about the forum. Sone don't even know about the beginner and help forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 09, 2022, 09:03:40 AM",
      "body": "Quote from: Rikafip on May 09, 2022, 07:44:29 AMYou can still be a shitposter whole sole purpose is to leech of this forum even if you are in BTC signature campaign, no questions about it. Currently there are more spots in BTC signature campaigns than there are quality members which makes it easy for such members to earn decent amount of bitcoin.Yes I agreed. But my point is whether we are on bitcoin paid or any altcoin campaign, thus posting in signature campaign whether its a super quality post. We are still considered in a form of bounty.  A perfect means to invalidate OPs statement below. Quote from: Apocollapse on May 09, 2022, 06:06:16 AMTo be honest bounties is really wasting time, worthless and no have any positive impact for doing that. So I cant say that being in a btc paid campaign, is a waste of time especially when your campaign is a competitive one that rejects spamming. Like yours, @rikaflip. Also were being incentivized in posting, the only difference in altcoins is that majority there are no doubt shitposter. But completely the same falls in a form of bounty campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "May 09, 2022, 09:29:23 AM",
      "body": "Quote from: electronicash on May 09, 2022, 07:05:32 AMit's time to ask the teams for BTC as payment, not thier tokens. time to demand BTC from them or no exposure.   Good luck! Let us know how that turns out.  Since many bounty campaigns are scams anyway, it's easy to change the payment method. Instead of paying you nothing in altcoins and worthless tokens, they can just pay you nothing in Bitcoin.I don't understand those participating in social media bounties these days. I really don't. The number of participants is so big that they consider themselves happy when they get a peanut after all the stakes are divided, but they still do it. it's a bit different if you create your own artworks, write blog posts, or do proper translations. Participating in bounties is one way to get some experience and create a portfolio before you start doing some more serious work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 09, 2022, 09:41:16 AM",
      "body": "Quote from: cryptoaddictchie on May 09, 2022, 09:03:40 AMthe only difference in altcoins is that majority there are no doubt shitposter.I think a good number of posters in bounty adopt the, \"if you want to catch a monkey, you behave like a monkey\" approach. That explains the laxity in constructive posting. Those who post there may believe no one is strict in checking what they post and so any type of post goes for them. The idea could be that they begin to think that since they aren't well compensated, why should they over burden themselves with meaningful posts then. I think spam posting in bounties is dependent on both the bounty teams and the bounty managers. If these two are serious to play their paths well, they should be mindful who they enrol and also do a followup with post checks. Anything outside that, bounty will continue to be populated with shitposters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ANSEL_2.0",
      "created_time": "May 09, 2022, 10:34:11 AM",
      "body": "@Apocallapse the user you used as an example is a shit poster, this days few bounty managers will fail to give you stake for the week unless you post high quality posts only, I am talking about someone like brain boss, joining bounties shouldn't stop anyone from ranking up, if you aren't earning merits you are a shit poster.CEASER and other high APY projects in bounty section are scams The need for turbo pissed me off the first time I went through the website.The thing is many bounty hunters are rushing projects as if its the ICO era once again, no one cares about doing research before promoting projects, so the consequences of doing this is getting almost zero rewards or making nothing at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 09, 2022, 10:48:56 AM",
      "body": "Quote from: Apocollapse on May 09, 2022, 06:06:16 AMBased on the spreadsheet the average hunters get 25,000 tokens or $1.96475 after working for 4 weeks. The signature campaign participants got the highest share of 1914893 tokens or $150And this is actually the worst thing that can ever happen to someone after working tirelessly for several weeks or months on a particular bounty campaign, and after distribution, you just have to wait some months for the token to be listed on an exchange where it could be swapped to a tradable coin such as Bitcoin or USDT.I will rather advise Newbies to stop wasting time on bounties, and strive to grow on this forum, because what an ordinary \"Member\" earn a week from signature campaign is more than what a Newbie earn a year from a shitcoin bounty hunt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 09, 2022, 11:18:26 AM",
      "body": "I agree. Such trust in bounty projects only means that the people who participate in them have too much free time. Because working people are unlikely to spend their time on something that does not bring profit.It is a pity that people do not understand that if you set aside some time for training, you can get much more, not only in material terms but by acquiring new abilities.As for the OP's account you gave as an example, I wouldn't be surprised if he has more alternatives that he hopes to increase his bounty profits with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 09, 2022, 01:56:00 PM",
      "body": "Quote from: Apocollapse on May 09, 2022, 06:06:16 AMTake a look with this user Smking1212 he's a bounty hunter maximalist where almost of his posts posted on Bounties section (1296 from 1308 posts or 99%). Currently he already have 518 activity which is enough to become a Hero Member, but he never earn any single merit even he's an active user, that make he's still a newbie rank. It's pitiful to see many users didn't care anything with the forum and just doing what does he wanted in this forum.A good example, though not the best if you're looking for those extreme cases that are uncrowned bounty kings. What do you say to 5025 posts&1330 activity or 4209 post&1540 activity? Credits to @TheBeardedBaby for found them.Quote from: Apocollapse on May 09, 2022, 06:06:16 AMDon't forget bounties managed by reputable manager doesn't always guaranteed the project wouldn't scam, below there are some bounties the project turned become scam:...No one can stop scam bounties and the forum didn't moderated scam too, so we're better off to avoid all bounties and we wouldn't get scammed.What is the responsibility of those managers who agree to do the job at all, even though they know that most of these projects are doomed in advance? Of course, the problem is that people agree to work for a couple of dollars a month, but a much bigger problem is that this forum provides logistical support for all these projects. As long as there is an option for people to do such things they will do them, so we blame not only bounty hunters but all those who allow them to generate thousands of spam posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "death69",
      "created_time": "May 09, 2022, 02:52:47 PM",
      "body": "Quote from: mk4 on May 09, 2022, 06:13:31 AMUnpopular opinion for some reason: you don't need to get all your income from Bitcointalk, or the cryptocurrency industry in general. The world wide web is so vast and limitless that I really don't know why most people here think that this is their only option. I'd rather become a virtual assistant than just spam social media with crypto links.Well, not many members have the proper English skills to become a virtual assistant. So they choose an activity that requires a low level of English and a high level of automaticity. They are the same as workers from the third world countries who are concerned about cheap-labor workforce And, being a spammer is paid higher than working in a workshop because of the cryptocurrency hype although sometimes you may get scammed. People say that education is the way to escape poverty or somewhat like that. But when poor people find fishing rods with the potential to bring them a lot of money than they ever imagine, they will not think about upgrading themselves or gaining more knowledge. No offense but can you show me where to find a virtual assistant job without much competition? Honestly, I've been around Freelancer.com for a while but still can find such a job. Too much spammer which makes me exhausted from competing for a position",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}