{
  "id": "topic_5453825",
  "title": "FiveG",
  "author": "FiveG",
  "created_time": "May 24, 2023, 04:09:20 AM",
  "content": "My wallet, I don't open it often yesterday I just said let me check but account refuses to open, after much trying I was to create a new password which I try to but the number I usually received OTP is not with me again and is sent directly to the number instead of email. What do I do to recover my account from bitcoinwallet.com ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453825",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 24, 2023, 07:03:24 AM",
      "body": "I do not think I have heard of this wallet before, so I do not know how reputable it is.I created an email just not quite long and used it to register. It was successful. I clicked on reset password, to reset my password and only email is required to do that. Maybe mobile number is optional but I did not see anything like that and I did not bother to check when email password recovery is possible.No seed phrase generated which makes it a custodial wallet. To have full control over your coins, use wallets like Electrum which is open source and noncustodial. Backup your seed phrase in two or three locations because losing it means losing your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "May 24, 2023, 07:14:07 AM",
      "body": "trustpilot doesn't paint a very nice picture about the service:https://www.trustpilot.com/review/bitcoinwallet.comNow, you should take those reviews with a grain of salt, since both positive and negative reviews get sold quite often (either to boast about one's own service or to destroy a competitor's reputation).This being said, in case they're not a scam: only their support department can help you, since this is an online custodial wallet (or so, it appears to be, i will not sign up to test them out).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "May 24, 2023, 07:33:56 AM",
      "body": "Hopefully you do not have a substantial amount of funds on the wallet since you do not open it often and do not have any backups for it, it being a custodian wallet. There is almost no information about the wallet or its reputation and no idea how responsive their customer support system is, but they are the best option to recover the funds which are held by them on your behalf.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 24, 2023, 09:13:04 AMLast edit: May 24, 2023, 09:46:51 AM by LoyceV",
      "body": "Is this some sort of advertising?OP has created 9 topics so far, and only once responded in one of them again. Ten minutes before he created the current topic, he created this one, and 10 minutes after he posted this, and instantly left. I don't believe OP really lost access to his Bitcoin.The website posted by OP is not a wallet, it's a website. Sending funds to a website has different risks than sending funds to a wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 24, 2023, 09:39:47 AM",
      "body": "This wallet is a scam and they do some contradictory things for example from /faq page I quote:Quotehow does bitcoinwallet.com store funds?short term funds required to satisfy customer payments are stored in a hot wallet that is accessible by the system.But when the question came to how to recover the wallet when you lose the email.QuoteI lost my email account and cannot receive emails anymore.you need to know the email address associated with your account and you need to be able to read emails sent to the email address. if you cannot log in because you aren''''''''t able to receive emails, we cannot help.They also have a new scam, which is that if you do not use your wallet within a certain time (inactive account,) a certain amount will be deducted every month as a tax for your use of the wallet, which means that they can access your private key.The same applies to the possibility of sending transactions between accounts within the wallet, which are free and instant.Quote from: LoyceV on May 24, 2023, 09:13:04 AMIs this some sort of advertising?It's just a troll, I searched for the name of the wallet in the forum and there is no other account that promoted it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 26, 2023, 02:17:10 AM",
      "body": "Quote from: Yamane_Keto on May 24, 2023, 09:39:47 AMThey also have a new scam, which is that if you do not use your wallet within a certain time (inactive account,) a certain amount will be deducted every month as a tax for your use of the wallet, which means that they can access your private key.I don't know anything about this wallet, but we can't call it fraud, there are many popular platforms that take a tax if your account is inactive for a period of time, they open the service mainly to earn money and if the account is inactive they can't earn anything.As for this wallet, it is a web wallet and not a noncustodial wallet, which means that they actually own the private key of the wallet, and the user does not have his private key at all, so he can deduct a commission from the user’s account. For all these reasons, it is better not to use a web wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "May 26, 2023, 02:39:46 AM",
      "body": "Quote from: FiveG on May 24, 2023, 04:09:20 AMWhat do I do to recover my account from bitcoinwallet.com ?If no balance in it, forget it and immediately migrate to the recommended wallets below you.Friendly suggestion to the OP:You can't learn everything at once especially in the technical realm of bitcoin so it won't leave you with random questions. Had a bit of a laugh reading your topic of the question of running a bitcoin node, while you're here asking wallet recovery which shouldn't be an option.You just need to slowly learn every aspect of bitcoin, and do more reading than creating topics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "May 26, 2023, 09:37:50 AM",
      "body": "Quote from: FiveG on May 24, 2023, 04:09:20 AMMy wallet, I don't open it often yesterday I just said let me check but account refuses to open, after much trying I was to create a new password which I try to but the number I usually received OTP is not with me again and is sent directly to the number instead of email. What do I do to recover my account from bitcoinwallet.com ?That is a risk that must be accepted by people who store assets and deposit money into a website that does not have a good rating and trust.In choosing a wallet, don't just choose.In the case of those of you who want a solution on how to recover passwords, usually every wallet has a support contact that can be contacted, but at bitcoinwallet.com this looks just not that convincing.Of course because this is the first time I made the site.Quote from: rat03gopoh on May 26, 2023, 02:39:46 AMIf no balance in it, forget it and immediately migrate to the recommended wallets below you.That's right. Just ignore it if there aren't many OP assets stored there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 26, 2023, 11:24:23 AM",
      "body": "Quote from: yhiaali3 on May 26, 2023, 02:17:10 AMI don't know anything about this wallet, but we can't call it fraud, there are many popular platforms that take a tax if your account is inactive for a period of time, they open the service mainly to earn money and if the account is inactive they can't earn anything.The description of a wallet is usually called that software that gives you access to your private key, if there is another party that manages that private key so that you cannot access it, then it is not a wallet.Any service that offers such fees is scam because in the end all the costs are in how to manage the trading lists, and therefore the fact that the account is inactive does not cost them any additional fees, so all the fees are in the trading and withdrawal.https://en.bitcoin.it/wiki/WalletQuoteA Bitcoin wallet is a collection of private keys but may also refer to client software used to manage those keys and to make transactions on the Bitcoin network.This page covers various wallet formats in use.Quote from: yhiaali3 on May 26, 2023, 02:17:10 AMAs for this wallet, it is a web wallet and not a noncustodial wallet, which means that they actually own the private key of the wallet, and the user does not have his private key at all, so he can deduct a commission from the user’s account. For all these reasons, it is better not to use a web wallet.The web wallet is a wallet, but it is managed online and does not need to be downloaded on any OS.If another party knows the private key, it is a custodial wallet, and if you does not know the private key, it is not a wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "May 26, 2023, 04:01:26 PM",
      "body": "Quote from: rat03gopoh on May 26, 2023, 02:39:46 AMQuote from: FiveG on May 24, 2023, 04:09:20 AMWhat do I do to recover my account from bitcoinwallet.com ?If no balance in it, forget it and immediately migrate to the recommended wallets below you.Friendly suggestion to the OP:You can't learn everything at once especially in the technical realm of bitcoin so it won't leave you with random questions. Had a bit of a laugh reading your topic of the question of running a bitcoin node, while you're here asking wallet recovery which shouldn't be an option.You just need to slowly learn every aspect of bitcoin, and do more reading than creating topics.If he does not have any balance on that wallet, there is no need to recover it at all. None of the commenters on this thread have heard of this wallet before and can't imagine how Op was able to find it. And it seems that he is actually publishing this topic to promote the site (it is not a wallet after all).In general, this is an opportunity to remind that online wallets cannot be considered wallets and that there are many other options that can be adopted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 26, 2023, 04:24:53 PMLast edit: May 27, 2023, 01:54:54 AM by yhiaali3",
      "body": "Quote from: Yamane_Keto on May 26, 2023, 11:24:23 AMThe description of a wallet is usually called that software that gives you access to your private key, if there is another party that manages that private key so that you cannot access it, then it is not a wallet.Any service that offers such fees is scam because in the end all the costs are in how to manage the trading lists, and therefore the fact that the account is inactive does not cost them any additional fees, so all the fees are in the trading and withdrawal.You have to correct your information. There are two types of wallets: custodial wallets and non-custodial wallets. For a custodian wallet, a third party takes custody of the private key rather than the owner of the cryptocurrency like exchanges or web wallets.As for the \"non-custodial\" wallets, they are the ones that have your private keys, such as the Electrium wallet or others.You can read this topic to understand the difference between the two types with a full comparison of the advantages and disadvantages:https://crypto.com/university/custodial-vs-non-custodial-wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "May 26, 2023, 08:05:47 PM",
      "body": "Quote from: yhiaali3 on May 26, 2023, 04:24:53 PMAs for the custodial wallets, they are the ones that have your private keys, such as the Electrium wallet or others.You meant as for the \"non-custodial\" wallets such as Electrum. They do not hold your private key on any of their servers, it is protected by an encryption and only you can access (decrypt) it to sign a transaction using your password.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 27, 2023, 01:53:55 AM",
      "body": "Quote from: un_rank on May 26, 2023, 08:05:47 PMQuote from: yhiaali3 on May 26, 2023, 04:24:53 PMAs for the custodial wallets, they are the ones that have your private keys, such as the Electrium wallet or others.You meant as for the \"non-custodial\" wallets such as Electrum. They do not hold your private key on any of their servers, it is protected by an encryption and only you can access (decrypt) it to sign a transaction using your password.- Jay -Yes, that's right. Thank you for the correction. This is a typo. Maybe because of the speed, I wrote \"custodial\" instead of \"non-custodial\" and I didn't notice that.Thanks for correcting me, I will edit the comment now to avoid any misunderstanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 27, 2023, 05:38:08 AM",
      "body": "Quote from: yhiaali3 on May 26, 2023, 04:24:53 PMYou can read this topic to understand the difference between the two types with a full comparison of the advantages and disadvantages:https://crypto.com/university/custodial-vs-non-custodial-walletsFirst, it is better to stay away from these articles as sources of learning, most of which are full of misleading information that has become circulated as facts.I mean Cointelegraph, binance academy, crypto.comAnd let's not forget that some of these articles are biased, as were some articles on Bitcoin.coma wallet is that software that manages your private keys, if you do not have access to the private key, then you are not using a wallet.Therefore, the word custodial wallets and non-custodial wallets has no meaning, because if you do not have the private key, then they are not not using a wallet. I can understand it in the formulation of whether you are the only one who can access that private key, or is a third party able to access it.To make it simple:If you do not have a private key, this service is not a wallet.You can manage the wallet from a browser. It is a web wallet.Otherwise, the divisions are not technical, but rather come from these poorly worded articles.https://github.com/bitcoin/bips/blob/master/bip-0032.mediawiki",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 27, 2023, 08:22:52 AM",
      "body": "Quote from: Yamane_Keto on May 27, 2023, 05:38:08 AMFirst, it is better to stay away from these articles as sources of learning, most of which are full of misleading information that has become circulated as facts.I mean Cointelegraph, binance academy, crypto.comAnd let's not forget that some of these articles are biased, as were some articles on Bitcoin.coma wallet is that software that manages your private keys, if you do not have access to the private key, then you are not using a wallet.Therefore, the word custodial wallets and non-custodial wallets has no meaning, because if you do not have the private key, then they are not not using a wallet. I can understand it in the formulation of whether you are the only one who can access that private key, or is a third party able to access it.To make it simple:If you do not have a private key, this service is not a wallet.You can manage the wallet from a browser. It is a web wallet.Otherwise, the divisions are not technical, but rather come from these poorly worded articles.https://github.com/bitcoin/bips/blob/master/bip-0032.mediawikiWell as you wish sir, you are right. We will not disagree.This is a disagreement over terminology only, and nothing more. Do all people, in your opinion, have the same academic knowledge as you? of course not.It is certain that the one who stores his coins on the Internet (or what some call a web wallet) is a beginner, because if he had enough knowledge, he would simply know that (it is not your key, not your coins) and he would not have stored his coins there, so how can you convince such This person that this service on the website (is not a wallet).I'm just using common terms that all people (beginners and experts) understand and haven't created anything new.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "May 27, 2023, 11:51:34 PM",
      "body": "Quote from: Charles-Tim on May 24, 2023, 07:03:24 AMI do not think I have heard of this wallet before, so I do not know how reputable it is.Neither do I but checking on WHOSIS the domain was registered back in 2010 https://www.whois.com/whois/bitcoinwallet.comQuoteDomain:bitcoinwallet.comRegistrar:GoDaddy.com, LLCRegistered On:2010-07-13Expires On:2026-07-13Updated On:2022-09-15I doubt if they are the real owner of the domain the domain was updated 2022-09-15 so there could be a change of hands on this domain.It's part of the scheme of scammers they buy old domains and uses the trustworthiness of the domain to scam people but with a lot of bad feedback they are off limit here, we may see accusations about this platform in the future if these complainants are serious on going further with their complaints and they create posts for awareness here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 28, 2023, 08:46:05 PM",
      "body": "Quote from: yhiaali3 on May 27, 2023, 08:22:52 AM.. No need to over-complicate things, guys.A custodial wallet is the wallet for which the service provider (usually the wallet dev), be it a web, software or hardware wallet, is the only one who knows the private keys.A non-custodial wallet is the one for which the customer is the only one who knows/owns the private keys.What is worth discussing and arguing about are wallets for which both the service provider and the customer know/own the private keys!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}