{
  "id": "topic_5436232",
  "title": "SME211",
  "author": "SME211",
  "created_time": "January 21, 2023, 10:50:45 AM",
  "content": "Below is a text version of a screenshot of a supposed Electrum transaction that was sent to me.  As there are missing numbers and letters from the middle of the transaction ID, I am thinking that this is fake.  Can someone confirm if this looks like a transaction or not. I am sure that the Electrum window would show the entire transaction ID without any missing letters and numbers in the middle.  Thanks.Transaction ID: Pending Reflection IDStatus: PendingAmount sent: 12.427041 BTC (No Data)Size: 230 bytesFee: 0.0125674 BTC (No Data) ( 2.1 sat/byte )LockTime: Pending1c9c129d40e7b988017efa9clcd..........b4ecf5c59af684515110508ff6:10.0002493711e75ed219908f3150e006659..........e556f7aae46cdc2290fad5c8c8:112.426792Outputs (2)12.4267920.000249",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436232",
  "comments": [
    {
      "author": "ABCbits",
      "created_time": "January 21, 2023, 11:02:06 AM",
      "body": "Quote from: SME211 on January 21, 2023, 10:50:45 AMTransaction ID: Pending Reflection IDStatus: PendingDefinitely fake, there's no thing such as \"Pending Reflection ID\". It should show text \"Unknown\" instead for unsigned transaction and TXID for signed transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 21, 2023, 11:10:15 AM",
      "body": "Quote from: SME211 on January 21, 2023, 10:50:45 AMSize: 230 bytesFee: 0.0125674 BTC (No Data) ( 2.1 sat/byte )I see no way to multiply 2.1 with 230 and get 1256740.Even more, you can easily check your address on any block explorer and see if there are any incoming transactions, even if not confirmed.And, at the end, you can filter transactions with this tool. The more details you'll add you'll sooner or later end up with no transactions meeting the criteria.You still hope you'll get 12 BTC and it's not a scam, heh?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "January 21, 2023, 11:18:12 AM",
      "body": "Quote from: SME211 on January 21, 2023, 10:50:45 AMBelow is a text version of a screenshot of a supposed Electrum transaction that was sent to me.  As there are missing numbers and letters from the middle of the transaction ID, I am thinking that this is fake.  Can someone confirm if this looks like a transaction or not. I am sure that the Electrum window would show the entire transaction ID without any missing letters and numbers in the middle.  Thanks.Bitcoin transactions when broadcasted will be relayed to your node/server as soon as the sender press \"Send\" or \"Broadcast\".Screenshots prove nothing until you've seen it in your own wallet.Just do not rely on screenshots plus wait for at least 1~6 confirmations and you're good to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "January 21, 2023, 02:46:34 PM",
      "body": "There is no such transaction in the mempool.Further, I am unable to find an output of 12.426792 BTC anywhere in the blockchain. This means this isn't just a mistake on the part of whoever sent you the screenshot. They can't just say \"Oops, forgot to hit broadcast, silly me!\" This is categorically a scam, since the outputs they are supposedly sending you do not exist.Quote from: SME211 on January 21, 2023, 10:50:45 AM1c9c129d40e7b988017efa9clcd..........b4ecf5c59af684515110508ff6:1Also looks like the scammer accidentally included an invalid character in his fake hash. \"L\" is not in the hex character set. Lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "January 21, 2023, 04:07:52 PM",
      "body": "OP, everyone have been telling you this is a scam for several weeks in various threads you've started. Why do you still insist on engaging with these scammers?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SME211",
      "created_time": "January 21, 2023, 06:37:27 PM",
      "body": "Thank you everyone.  This is the final confirmation that I needed in order to be convinced that this transaction is a fake.  As there was a large amount of money at stake I needed to be sure.  Unfortunately I have lost a significant amount of money to these individuals who claimed they could recover my funds from a fraudulent online trading platform.  I have learned a hard lesson from all of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "January 22, 2023, 04:19:19 AM",
      "body": "Quote from: SME211 on January 21, 2023, 06:37:27 PM-snip- Unfortunately I have lost a significant amount of money to these individuals who claimed they could recover my funds from a fraudulent online trading platform.  I have learned a hard lesson from all of this.Ah, this is what all of those threads are about.Such service couldn't exist, anyone who claimed that they can recover from scam are also scams.(so next time, there's no point in asking if it's another scam)Rule of thumb is: Confirmed Bitcoin transactions are permanent, there's no way to recover it from the recipient without gaining access to their wallet/private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "January 29, 2023, 09:15:33 AM",
      "body": "Quote from: SME211 on January 21, 2023, 06:37:27 PMUnfortunately I have lost a significant amount of money to these individuals who claimed they could recover my funds from a fraudulent online trading platform.  I have learned a hard lesson from all of this. One of Bitcoin's features is irreversibility of transactions. That means that once the transaction is confirmed and a few blocks deep, I can't recover it. You can't recover it either. Bitcoin developers can't help you nor could the President of the USA together with his staff. Additionally, any service that claims to recover wrongly sent, stolen, or hacked coins, can't do anything to help either. Unfortunately, they saw a person who isn't knowledgeable enough about Bitcoin and has some money to spend. So they took you for a ride and once again you were scammed. Too bad that you didn't know about this forum before the second scam. People do more research when bad things happen instead of doing it before they do things they will regret. That's just the way it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}