{
  "id": "topic_5462093",
  "title": "execijutiere",
  "author": "execijutiere",
  "created_time": "August 04, 2023, 04:57:35 PM",
  "content": "NwayPlay tarafından geliştirilen (daha önce @mandown hocam konusunu açmıştı) ve Animoca Brands,Yuga Labs ve Apecoin tarafından desteklenen oyun Dövüş, rekabet ve espor oyunlarını harmanlayan benzersiz bir Web3/Web2 deneyimi sunmayı hedefliyor. Oyun, farklı Web3 karakterlerini içeren bir PVP dövüş oyunu. Oyun içindeki dövüşçülerin her biri NFT olacak.Bu NFT'ler 10 Mech parçası adı altında birleşecek.Karakterlerini değiştirmek isteyenler ise kendi dövüşçülerini mech parçaları alarak değiştirip kişiselleştirebilecek.Karakterleri oluşturan bu mech parçaları kutular ile beraber mint edilme sürecine tabii tutulacak ve mint edildikten sonra marketplace üzerinden alınıp satılabilinecek.BAYC, MAYC, BAKC ve Koda sahipleri ücretsiz bir şekilde “Founders Mech” sahibi olabilecek.Oyunun ücretsiz bir Web2 sürümü de piyasaya sürülecek ve bu sürümde oyunu oynamak için NFT gerekmeyecek.Projeden allowlist sahibi olmak için sitesine gidip KYC yapmak gerekiyor. Adrese gidip başvuru yapabilirsiniz. https://allowlist.wreckleague.xyz/Merak ettiklerinizle ilgili geri kalan gerekli bilgiler için : https://medium.com/wreck-league/what-is-wreck-league-b6deb51ab061Oyunla ilgili bir video kesit : https://twitter.com/WreckLeagueHQ/status/1687131328351813632Twitter üzerindeki bir kullanıcının oyun ile ilgili bir floodunu buldum. https://twitter.com/Carl_m101/status/1687140158972338184",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462093",
  "comments": [
    {
      "author": "execijutiere",
      "created_time": "August 13, 2023, 01:51:30 PM",
      "body": "Mint detayları belli olmaya başladı.25,000 Majestic Boxes,5,000 Booster Boxes şeklinde olacak ve 17 Ağustosta olacak mint.24 saat açık olacak demişler ama KYC yapanların hepsi katılırsa hızlıca biter.KYC yapan sayısı 250K civarı sanırsam.FCFS usulü olacaktır 30K kutu için.Bu boxların minti sonrası bayc, mayc, koda holderlerı için toplam 50k box free dağıtılacak.Bunlar ise Founders Box adı altında olacak.İlgili açıklamalar : https://twitter.com/WreckLeagueHQ/status/1690040429851672576                           https://twitter.com/WreckLeagueHQ/status/1690087015554121728                           https://twitter.com/WreckLeagueHQ/status/1690390140085207040",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}