{
  "id": "topic_5440123",
  "title": "Quickfant",
  "author": "Quickfant",
  "created_time": "February 17, 2023, 12:10:15 AM",
  "content": "I opted to not have a backlit keyboard on my laptop........HUGE mistake. I do a lot of work at night and the $100 I saved not having a keyboard with a back light is not worth the saving. What can I do to try and emulate a backlit keyboard?I bought some glow in the dark stickers and they work but they rub off too quickly. After 1 week I have already taken 2 keys off so I need a more permanent solution. I will not be replacing it with a new keyboard with backlight though I do not want to risk breaking my new laptop.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440123",
  "comments": [
    {
      "author": "odolvlobo",
      "created_time": "February 17, 2023, 04:53:36 AM",
      "body": "Buy a USB light. Plug it into the laptop. Shine it on the keyboard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pezroly",
      "created_time": "March 22, 2023, 02:03:02 AM",
      "body": "Just buy new backlit keyboard for your laptop and replace. Computer service companies do this, they order from China and replace. Or buy from China and replace in computer service company - will be cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "March 25, 2023, 12:59:19 PM",
      "body": "The real solution is learning to type  If you don't look at the keyboard you don't need lights.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "March 25, 2023, 08:51:51 PM",
      "body": "Quote from: LoyceV on March 25, 2023, 12:59:19 PMThe real solution is learning to type  If you don't look at the keyboard you don't need lights.That is so true. I have friends with blank keyboards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}