{
  "id": "topic_5409219",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "August 09, 2022, 08:34:44 AM",
  "content": "Growing up I have always love privacy, I have always done well through privacy more than flowing with the crowd and this have drive my passion to both bitcoin and bitcointalk, since they're both allow me to learn and invest all by myself. With this forum being an anonymous platform I don't need to know anyone or work with a group before getting whatever guidance and correction I need to guide my decision, And Bitcoin on the other hand made my financial life highly anonymous to the core. Thanks Satoshi Nakamoto for this development and for giving us a platform to thrive upon away from the conversational financial system filled with corruption and control.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409219",
  "comments": [
    {
      "author": "notocactus",
      "created_time": "August 09, 2022, 09:42:04 AM",
      "body": "Quote from: Ojima-ojo on August 09, 2022, 08:34:44 AMWith this forum being an anonymous platform I don't need to know anyone or work with a group before getting whatever guidance and correction I need to guide my decision, And Bitcoin on the other hand made my financial life highly anonymous to the core.Anonymous platform, are you sure about that?The forum does not require members to do KYC but it is not an anonymous platform. There are Retention/ Privacy info. Read details.However, it is not completely private or anonymous. Your account has many factors such as email address, username, password, IP address and more. It starts from an email you use for registration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "August 09, 2022, 10:01:46 AM",
      "body": "As with any other forum, and website it's up to you how private you want to be, i.e the platforms will collect data as pointed out above, but you can provide fake data if you want. Fake/temporary email address, VPN for disguising your IP. So, Bitcointalk doesn't require your actual information, but it does collect information to basically make administration work a little easier. Most of the internet can be used somewhat anonymously. Obviously, escaping the bigger dogs like Google is a little more difficult, but independent websites are much easier to keep yourself anonymous from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "August 09, 2022, 10:47:27 AM",
      "body": "in my opinion, you can still be anonymous in this forum started by using an email that a privacy focus like protonmail and then using a privacy browser like Tor and by using a VPN provider and surfing in bitcointalkso pretty much complicated but I think it stay make you anon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 09, 2022, 01:23:13 PM",
      "body": "Quote from: dansus021 on August 09, 2022, 10:47:27 AMin my opinion, you can still be anonymous in this forum started by using an email that a privacy focus like protonmail and then using a privacy browser like Tor and by using a VPN provider and surfing in bitcointalkso pretty much complicated but I think it stay make you anonIn theory you're correct, but in realization you're wrong.When you're want to register a new account by using protonmail, you wouldn't have a problem. But when you want to use Tor network, you can't create an account since you'll have a trouble when completing the captcha. You can use a secret code only after register your account, not before you want to create account.Your data will be stored for around 6 months for the full IP and it will deleted after 6 years so if you want become fully anonymous, you need to wait for around 6 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "August 09, 2022, 02:12:20 PM",
      "body": "I agree with OP, since I have been active on this forum, I love been alone most of the time. This enables you to stay focus to learn,practice and teach in the forum,if not you will not bring out the best in you.  To be anonymous depends on the individual based on your personal reason and mindscept. You can choose to be real or fake,its your choice",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 09, 2022, 02:42:22 PM",
      "body": "Quote from: Ojima-ojo on August 09, 2022, 08:34:44 AM I don't need to know anyone or work with a group before getting whatever guidance and correction I need to guide my decision,Just like any other forum you come across, it is basically an environment with free flow of knowledge where users exchange ideas, views and perspective on topics without concern about the identity of other people there and no need to have a personal relationship with someone before you can benefit from their knowledge. Bitcointalk happens to be one of such forums that centers majorly on bitcoin first before other discussions. You also have to be careful of users opinions here that you consider to shape your personal decisions, because still though it is a forum, not all the advice/opinions you get here is correct, you also owe it to yourself to DYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "August 09, 2022, 03:55:53 PM",
      "body": "Quote from: Frankolala on August 09, 2022, 02:12:20 PM~There is no anonymity. It is being pseudonymous just to correct you there regardless of what social media you register on.Though if I can recall correctly, there were anonymous posts here wherein users are either deleted or requested to be anonymous for some reason. That was back in the days though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 09, 2022, 04:40:55 PM",
      "body": "Bitcoin is decentralized, not anonymous actually. All of your public data is available in the blockchain. Yea, you can hide your identity if you want through Tor or mixer, but your address shouldn't share anywhere then. You can hide your IP during the transaction if you like. The same goes for the forum. It's traceable unless you use a privacy browser like Tor. Your privacy depends on you how will you handle it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 09, 2022, 05:33:46 PM",
      "body": "Quote from: Frankolala on August 09, 2022, 02:12:20 PM  I agree with OP, since I have been active on this forum, I love been alone most of the time. This enables you to stay focus to learn,practice and teach in the forum,if not you will not bring out the best in you.Uh...bruh that is not what anonymity or pseudonimity is about, and this is a discussion forum so i don't know how it has made you want to avoid company, you don't need the forum to know you need your quiet time sometimes, or to stay focused and learn. What you learn here is about bitcoin and how to keep your data away from bad people that will sell it darknet market, that is pseudonymity and privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 09, 2022, 06:07:15 PM",
      "body": "Quote from: isaac_clarke22 on August 09, 2022, 03:55:53 PMQuote from: Frankolala on August 09, 2022, 02:12:20 PM~There is no anonymity. It is being pseudonymous just to correct you there regardless of what social media you register on.Though if I can recall correctly, there were anonymous posts here wherein users are either deleted or requested to be anonymous for some reason. That was back in the days though.I agree. A browser and an IP address are not enough to be anonymous. Are all those hackers who break banks and steal large amounts only hiding behind an anonymous browser, Tor, which must be properly configured?Alas, experienced people know how to do everything carefully, and there is a completely different science.So if a department is interested in someone, they don't have to look far when people think they're protected by just two changes.Most likely, this is a pill for your peace of mind, and nothing more.https://www.cactusvpn.com/vpn/is-tor-safe/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "August 09, 2022, 07:19:01 PM",
      "body": "Quote from: lovesmayfamilis on August 09, 2022, 06:07:15 PMMost likely, this is a pill for your peace of mind, and nothing more.https://www.cactusvpn.com/vpn/is-tor-safe/Always funny to read a ''TOR shaming'' article wrote by a VPN reseller.People who really need to be anonymous on TOR network, perfectly know how to setup it, and how to use it efficiently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "August 10, 2022, 07:01:20 PM",
      "body": "Quote from: Ojima-ojo on August 09, 2022, 08:34:44 AMGrowing up I have always love privacy, I have always done well through privacy more than flowing with the crowd and this have drive my passion to both bitcoin and bitcointalk, since they're both allow me to learn and invest all by myself. With this forum being an anonymous platform I don't need to know anyone or work with a group before getting whatever guidance and correction I need to guide my decision, And Bitcoin on the other hand made my financial life highly anonymous to the core. Thanks Satoshi Nakamoto for this development and for giving us a platform to thrive upon away from the conversational financial system filled with corruption and control.Unfortunately, not many countries recognize the existence of Bitcoin legally used as a transaction. Even China has banned all crypto-related transactions. This is because they are incapable of controlling and are considered a threat to their country's currency.  Although I am sure that adoption will continue and bitcoin will continue to grow. As for making you secret, it's actually not entirely true. All transactions can be viewed. If traced then your identity can be found even though it is quite difficult.  You need crypto exchanges and they need your identity, simple as that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "August 10, 2022, 09:52:07 PM",
      "body": "Quote from: Frankolala on August 09, 2022, 02:12:20 PM  I agree with OP, since I have been active on this forum, I love been alone most of the time. This enables you to stay focus to learn,practice and teach in the forum,if not you will not bring out the best in you.  To be anonymous depends on the individual based on your personal reason and mindset. You can choose to be real or fake, it's your choiceEven though the topic is not about the forum, it also relates to it. To be frank with you every member here have experienced the same thing because to stay concentrated and contribute effectively one need to pay full attention and read a lot of comments on the forum and since the forum is also crypt of related mingling with other too much may shift your attention from the forum and thereby lower the quality of your contribution and content on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cytpoway121",
      "created_time": "August 11, 2022, 08:50:57 AM",
      "body": "Quote from: Ojima-ojo on August 09, 2022, 08:34:44 AMGrowing up I have always love privacy, I have always done well through privacy more than flowing with the crowd and this have drive my passion to both bitcoin and bitcointalk, since they're both allow me to learn and invest all by myself. With this forum being an anonymous platform I don't need to know anyone or work with a group before getting whatever guidance and correction I need to guide my decision, And Bitcoin on the other hand made my financial life highly anonymous to the core. Thanks Satoshi Nakamoto for this development and for giving us a platform to thrive upon away from the conversational financial system filled with corruption and control.I always have held the position that anonymity does not exist on any platform in the world, be it crypto currency or banking or any aspect of the world. These is a core reason why theres high demand for vpn; mind you vpn does not hide you either, it simply change your IP locality to an entire world to hide your main location. When you say btc, every bitcoin transaction can be tracked down, did you see usa recent crack down on tornado cash? You can see more opinions about the usa ban on tornado cash and what it means for our privacy in cryptocurrency.The big question now is that, with government trying every means and their possible best to tax crypto currency activities, whats the solution?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maybukaspa",
      "created_time": "August 11, 2022, 09:46:01 AM",
      "body": "Hello, id to learn more about bitcoin talk cause i know i can get more knowledge in this forum. I wanna know how does campaign works, Like how you join campains. Aside from that i can see there's a lot of topic and all of them are quite awesome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 11, 2022, 09:55:04 AM",
      "body": "Quote from: tranthidung on August 09, 2022, 09:42:04 AMAnonymous platform, are you sure about that?The forum does not require members to do KYC but it is not an anonymous platform. There are Retention/ Privacy info. Read details.However, it is not completely private or anonymous. Your account has many factors such as email address, username, password, IP address and more. It starts from an email you use for registration.At the very least you can make it as anonymous as possible if you know what you're doing, using no-KYC and privacy-friendly email services and using Tor. Most modern platforms don't even work when used with Tor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "August 11, 2022, 11:54:24 AM",
      "body": "Quote from: mk4 on August 11, 2022, 09:55:04 AMQuote from: tranthidung on August 09, 2022, 09:42:04 AM...However, it is not completely private or anonymous. Your account has many factors such as email address, username, password, IP address and more. It starts from an email you use for registration.At the very least you can make it as anonymous as possible if you know what you're doing, using no-KYC and privacy-friendly email services and using Tor. Most modern platforms don't even work when used with Tor.Just to add, you can even obfuscate your privacy respecting email by using aliases to create your bitcointalk account or even in any other online services. Email forwarding services like AnonAddy or Simplelogin will do the trick by allowing you to create aliases using their public/premium domain or your own custom domain from Namecheap for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "August 11, 2022, 02:52:35 PM",
      "body": "Quote from: ETFbitcoin on August 11, 2022, 11:40:52 AMQuote from: Ojima-ojo on August 09, 2022, 08:34:44 AMWith this forum being an anonymous platformI'm surprised nobody mentioned Bitcointalk use Cloudflare which act as MITM.no platform is completely anonymous.and I've checked bitcointalk.org about using Cloudflare's DNS name server which is indicated as a MITM attackhttps://pulsedive.com/indicator/?ioc=Yml0Y29pbnRhbGsub3JnAdd an option to block corporated MiTM attack such as Cloudflare",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 11, 2022, 03:05:43 PM",
      "body": "Quote from: Ojima-ojo on August 09, 2022, 08:34:44 AMGrowing up I have always love privacy, I have always done well through privacy more than flowing with the crowd and this have drive my passion to both bitcoin and bitcointalk, since they're both allow me to learn and invest all by myself. With this forum being an anonymous platform I don't need to know anyone or work with a group before getting whatever guidance and correction I need to guide my decision, And Bitcoin on the other hand made my financial life highly anonymous to the core. Thanks Satoshi Nakamoto for this development and for giving us a platform to thrive upon away from the conversational financial system filled with corruption and control.Still bitcointalk has its rules and also staffs who are moderating the contents which doesn't kill the freedom of speech but we can't say the platform is out of control since it has admins and founder. Apart from this you said what are the facts bitcointalk is not only place for Bitcoin but given enough space for all the cryptocurrencies and upcoming projects, market place,etc and importantly it gives access to everyone even who don't write in English can discuss in any language they can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}