{
  "id": "topic_5468990",
  "title": "patrickus",
  "author": "patrickus",
  "created_time": "October 03, 2023, 06:53:18 AM",
  "content": "QuoteUne étude américaine déclare que 95% des NFT n'ont plus aucune valeur. Il y a peine deux ans, ces NFT, rattachés principalement à des œuvres d'art numériques, défrayaient la chronique dans une hystérie collective. Une étude a été réalisée par Dapp Gambl, un collectif composé d'experts en cryptomonnaies.https://www.lesnumeriques.com/cryptomonnaie/la-bulle-des-nft-a-eclate-ils-ne-valent-plus-rien-n213482.htmlhttps://www.radiofrance.fr/franceculture/podcasts/un-monde-connecte/la-plupart-des-nft-ne-valent-plus-rien-3493314La bulle a explosé.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468990",
  "comments": [
    {
      "author": "kopi72",
      "created_time": "October 03, 2023, 09:00:31 AM",
      "body": "Quote from: patrickus on October 03, 2023, 06:53:18 AMQuoteUne étude américaine déclare que 95% des NFT n'ont plus aucune valeur. Il y a peine deux ans, ces NFT, rattachés principalement à des œuvres d'art numériques, défrayaient la chronique dans une hystérie collective. Une étude a été réalisée par Dapp Gambl, un collectif composé d'experts en cryptomonnaies.La bulle a explosé.fallait s'y attendre là ou bitcoin répond à un vrai besoin d'échange monétaire, les NFT n'ont pas de véritable utilité et leurs valeur repose que sur de la pûr spéculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Girlinthehood",
      "created_time": "October 09, 2023, 05:41:55 AM",
      "body": "Cette étude soulève des questions pertinentes concernant la durabilité et la valeur intrinsèque des NFT. Cependant, il est crucial de distinguer les différents types de NFT et les projets qui les sous-tendent. Bien que de nombreux NFT puissent effectivement perdre de leur valeur, surtout s'ils sont achetés dans un contexte de spéculation ou de 'hype', certains projets NFT sont ancrés dans des initiatives concrètes et offrent une valeur tangible au-delà de l'actif numérique lui-même.Par exemple, certains NFT sont adossés à des projets dans le monde réel, tels que l'immobilier, l'art physique, ou même des expériences exclusives. Ces NFT sont non seulement une représentation ou une propriété numérique, mais aussi un moyen d'accéder ou de vérifier la propriété ou l'implication dans un projet ou un objet physique dans le monde réel. Ainsi, ils sont susceptibles de conserver une valeur intrinsèque liée à l'actif ou à l'expérience sous-jacente.En outre, certains NFT sont créés par des artistes ou des projets dans lesquels les investisseurs ont une croyance ou une confiance profonde, non seulement en tant qu'investissement financier, mais aussi en tant que soutien à un artiste ou à une cause. En investissant dans ces NFT, ils peuvent choisir de soutenir activement l'individu ou le projet, même si l'actif numérique lui-même peut ne pas maintenir sa valeur financière à long terme.Il est crucial de souligner l'importance d'effectuer des recherches approfondies et d'investir de manière consciente. Les NFT, comme tout investissement, devraient être abordés avec une compréhension claire des risques et des avantages potentiels, en évitant d'investir aveuglément dans des projets sans but ni sens clairement définis.Il est essentiel que les investisseurs potentiels considèrent les NFT non pas simplement comme des actifs spéculatifs, mais comprennent pleinement le projet, l'artiste ou la plateforme derrière eux, afin de faire des choix d'investissement éclairés et réfléchis, en tenant compte à la fois de la valeur financière et de la pertinence ou du soutien au projet ou à l'artiste en question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "October 19, 2023, 09:44:01 PM",
      "body": "Ca a malheureusement été un scam de plus dans l'univers crypto au final.  Avec toujours le même principe de gonfler artificiellement les prix pour créer de la hype, du greed, du FOMO. Sauf qu'avec les NFTs ca a été encore plus simple qu'avec les \"tokens\" des ICO. Les tokens nécessitaient des fonds important pour pouvoir amorcer des mouvements de pump sur le marché (à moins d'avoir des exchanges complices). Mais les NFTs étant uniques il suffisait simplement d'un complice(ou d'un 2eme compte) pour simuler une grosse vente à $100 000 pour ensuite pouvoir prétendre que le NFT valait cette somme là. C'est ce qui se passe souvent pour les oeuvres d'art et les objets de collection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "October 19, 2023, 10:11:02 PM",
      "body": "Quote from: Saint-loup on October 19, 2023, 09:44:01 PMCa a malheureusement été un scam de plus dans l'univers crypto au final.  Avec toujours le même principe de gonfler artificiellement les prix pour créer de la hype, du greed, du FOMO. Sauf qu'avec les NFTs ca a été encore plus simple qu'avec les \"tokens\" des ICO. Les tokens nécessitaient des fonds important pour pouvoir amorcer des mouvements de pump sur le marché (à moins d'avoir des exchanges complices). Mais les NFTs étant uniques il suffisait simplement d'un complice(ou d'un 2eme compte) pour simuler une grosse vente à $100 000 pour ensuite pouvoir prétendre que le NFT valait cette somme là. C'est ce qui se passe souvent pour les oeuvres d'art et les objets de collection.Oui, mais pas que, il n'y a quand même pas tout à jeter.  C'est clair qu'il y a eu une majorité d'abus, mais on peut parier que les NFT vont encore être là pour au moins un petit bout de temps.  Ça me fait penser à un post de GrosWesh :Quote from: GrosWesh on September 02, 2023, 10:33:40 PM2 - Defi et collateralisation à partir de biens réels : jetez un oeil à ça, c'est dingue ça aussi (même s'il ne s'agit pas d'une première) :   https://twitter.com/CirrusNFT/status/1697692568778424417/photo/1   Traduction du tweet :  \"Quelqu'un vient de contracter un prêt en chaîne de 1 100 000 $ en utilisant un NFT représentant la propriété d'un ensemble complet de      t-shirts avec le logo Supreme Box comme garantie.   L'ensemble de plus de 1 000 livres a été envoyé à une société de dépôt qui a ensuite renvoyé des NFT représentant la propriété des Tshirts.   L'emprunteur a ensuite utilisé le NFT pour exploiter la liquidité. S'ils font défaut ? Le prêteur peut utiliser le NFT pour racheter les tshirts   Sotheby's a évalué la collection de 291 tshirts à environ 2,5 millions de dollars il y a quelques années.   Assez fou de voir le propriétaire d'une collection streetwear du Graal venir on-chain et utiliser la preuve de propriété fournie par les NFTs \"   C'est peu être un coup de pub pour Arcade_xyz, qui permet ce genre de choses, mais je trouve que là aussi on s'approche de cas réels      d'utilisation (et ça confirme par ailleurs que les nfts sont eux aussi là pour perdurer, étant bien plus que de simples images de singes haha).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "October 20, 2023, 04:31:08 PM",
      "body": "oui je pense aussi que le principe des nft est là pour rester. Par contre Stloup n'a pas tort non plus de dire qu'une énorme partie de ces nfts a été des arnaques. Mais bon... c'est l'humain hein   Un brèche s'ouvre et ... on connait la suite.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aesma",
      "created_time": "January 12, 2024, 06:37:38 PM",
      "body": "Quote from: paid2 on October 19, 2023, 10:11:02 PMQuote from: Saint-loup on October 19, 2023, 09:44:01 PMCa a malheureusement été un scam de plus dans l'univers crypto au final.  Avec toujours le même principe de gonfler artificiellement les prix pour créer de la hype, du greed, du FOMO. Sauf qu'avec les NFTs ca a été encore plus simple qu'avec les \"tokens\" des ICO. Les tokens nécessitaient des fonds important pour pouvoir amorcer des mouvements de pump sur le marché (à moins d'avoir des exchanges complices). Mais les NFTs étant uniques il suffisait simplement d'un complice(ou d'un 2eme compte) pour simuler une grosse vente à $100 000 pour ensuite pouvoir prétendre que le NFT valait cette somme là. C'est ce qui se passe souvent pour les oeuvres d'art et les objets de collection.Oui, mais pas que, il n'y a quand même pas tout à jeter.  C'est clair qu'il y a eu une majorité d'abus, mais on peut parier que les NFT vont encore être là pour au moins un petit bout de temps.  Ça me fait penser à un post de GrosWesh :Quote from: GrosWesh on September 02, 2023, 10:33:40 PM2 - Defi et collateralisation à partir de biens réels : jetez un oeil à ça, c'est dingue ça aussi (même s'il ne s'agit pas d'une première) :   https://twitter.com/CirrusNFT/status/1697692568778424417/photo/1   Traduction du tweet :  \"Quelqu'un vient de contracter un prêt en chaîne de 1 100 000 $ en utilisant un NFT représentant la propriété d'un ensemble complet de      t-shirts avec le logo Supreme Box comme garantie.   L'ensemble de plus de 1 000 livres a été envoyé à une société de dépôt qui a ensuite renvoyé des NFT représentant la propriété des Tshirts.   L'emprunteur a ensuite utilisé le NFT pour exploiter la liquidité. S'ils font défaut ? Le prêteur peut utiliser le NFT pour racheter les tshirts   Sotheby's a évalué la collection de 291 tshirts à environ 2,5 millions de dollars il y a quelques années.   Assez fou de voir le propriétaire d'une collection streetwear du Graal venir on-chain et utiliser la preuve de propriété fournie par les NFTs \"   C'est peu être un coup de pub pour Arcade_xyz, qui permet ce genre de choses, mais je trouve que là aussi on s'approche de cas réels      d'utilisation (et ça confirme par ailleurs que les nfts sont eux aussi là pour perdurer, étant bien plus que de simples images de singes haha).Dans ce cas le NFT remplace des choses qui existent déjà, c'est un prêt sur gage. L'intérêt est de pouvoir facilement en transférer la propriété. Enfin facilement, je suis sûr que dans certains pays le fisc aurait son mot à dire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "As03",
      "created_time": "January 18, 2024, 06:34:09 AM",
      "body": "Le problème est ce qu'on en fait, des pixels ça sert à rien, par contre pour en faire des tickets inviolables ou des preuves de propriété c'est très intéressant je trouve !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "matt4054",
      "created_time": "January 24, 2024, 12:15:33 PM",
      "body": "Bon débarras !Les NFT c'étaient juste la version crypto d'une monnaie de singes... qui s'ennuient",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oscar2000",
      "created_time": "March 05, 2024, 08:50:00 AM",
      "body": "Quote from: As03 on January 18, 2024, 06:34:09 AMLe problème est ce qu'on en fait, des pixels ça sert à rien, par contre pour en faire des tickets inviolables ou des preuves de propriété c'est très intéressant je trouve !preuve de propriété...qu'est ce qui fait que cette preuve de propriété vaut 1 000 euros ou 100 euros ? ou 0,01 euro ?quand je veux une preuve de propriété sur un bien immobilier, je téléphone au service du cadastre de ma ville et le lendemain, je vais chercher le papier. que la propriété soit un garage, un hôtel particulier, 15 hectares de forêt ou tout autre chose, le papier, la preuve de propriété n'a pas sa valeur indexée sur la valeur du bien immobilier, le papier m'est donné gratuitement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "March 05, 2024, 04:56:22 PM",
      "body": "Quote from: oscar2000 on March 05, 2024, 08:50:00 AMQuote from: As03 on January 18, 2024, 06:34:09 AMLe problème est ce qu'on en fait, des pixels ça sert à rien, par contre pour en faire des tickets inviolables ou des preuves de propriété c'est très intéressant je trouve !preuve de propriété...qu'est ce qui fait que cette preuve de propriété vaut 1 000 euros ou 100 euros ? ou 0,01 euro ?quand je veux une preuve de propriété sur un bien immobilier, je téléphone au service du cadastre de ma ville et le lendemain, je vais chercher le papier. que la propriété soit un garage, un hôtel particulier, 15 hectares de forêt ou tout autre chose, le papier, la preuve de propriété n'a pas sa valeur indexée sur la valeur du bien immobilier, le papier m'est donné gratuitement. Sauf que tu pourrais toujours te faire usurper... que ton bien passe à la vente par un ou des usurpateurs !  Ou encore que le registre du cadastre soit détruit dans les flames !Là ta preuve ainsi que le total contrôle est entre tes mains dans ta poche.. nulle part ailleurs !Quote from: As03 on January 18, 2024, 06:34:09 AMLe problème est ce qu'on en fait, des pixels ça sert à rien, par contre pour en faire des tickets inviolables ou des preuves de propriété c'est très intéressant je trouve !Ou de clés de contrôle encore.. l'avantage avec un NFT c'est l'option d'échange/transfert sans avoir à transférer la clé elle même !  Imaginez une application/programme en cloud totalement chiffré et que et qui ne serait opérable qu'à l'aide du contrôle NFT par exemple !Eh oui les pixels ça sert à rien, c'était très prévisible et même évident que ça allait foirer !  Par contre pour quelques formes d'art éphémère par exemple je pense au (stone balancing) - équilibre de pierres. notamment .. ce serait tellement intéressant d'immortaliser l'œuvre, à l'aide dune ou plusieurs cameras en NFT  !     oui oui, tu m'oublieras pas toi qui feras ça! 0x11A84722958727877A8C84fB4d38F61548bDbEcA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oscar2000",
      "created_time": "March 05, 2024, 08:01:44 PM",
      "body": "Quote from: Danydee on March 05, 2024, 04:56:22 PMQuote from: oscar2000 on March 05, 2024, 08:50:00 AMpreuve de propriété...qu'est ce qui fait que cette preuve de propriété vaut 1 000 euros ou 100 euros ? ou 0,01 euro ?quand je veux une preuve de propriété sur un bien immobilier, je téléphone au service du cadastre de ma ville et le lendemain, je vais chercher le papier. que la propriété soit un garage, un hôtel particulier, 15 hectares de forêt ou tout autre chose, le papier, la preuve de propriété n'a pas sa valeur indexée sur la valeur du bien immobilier, le papier m'est donné gratuitement.Sauf que tu pourrais toujours te faire usurper... que ton bien passe à la vente par un ou des usurpateurs !  Ou encore que le registre du cadastre soit détruit dans les flames !Là ta preuve ainsi que le total contrôle est entre tes mains dans ta poche.. nulle part ailleurs !non, car sur le papier, il est écrit \"monsieur oscar2000 est propriétaire de ...\", il n'est pas écrit \"le porteur de ce papier est propriétaire de ...\"pour la destruction par le feu, il serait étonnant que le cadastre de ma ville, l'hôtel des impôts, le 2ème bureau des hypothèques et l'étude de notaire brûlent en même temps, sans compter que l'assurance de l'immeuble et la société des eaux peuvent aussi témoigner en cas de besoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "March 05, 2024, 08:17:54 PM",
      "body": "Quotepour la destruction par le feu, il serait étonnant que le cadastre de ma ville, l'hôtel des impôts, le 2ème bureau des hypothèques et l'étude de notaire brûlent en même temps, sans compter que l'assurance de l'immeuble et la société des eaux peuvent aussi témoigner en cas de besoin.Ça dans ton cas précis peut-être..*ou par décret de l'état.. qu'est tu ferais si l'état en décretait que c'était plus a toi ! ?? Quote from: oscar2000 on March 05, 2024, 08:01:44 PMnon, car sur le papier, il est écrit \"monsieur oscar2000 est propriétaire de ...\", il n'est pas écrit \"le porteur de ce papier est propriétaire de ...\"Alors ou tu m'as pas compri ou je me suis mal fait comprendre !Un monsieur se présente avec une pièce d'identité disant que c'est Oscar2000 et poursuit les procédures et arrive à vendre ton bien.. !  tu vois!?*Alors qu'avec un NFT le contrôle de la preuve ne dépend que de toi!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "matt4054",
      "created_time": "March 05, 2024, 11:16:18 PM",
      "body": "Quote from: Danydee on March 05, 2024, 08:17:54 PMqu'est tu ferais si l'état en décretait que c'était plus a toi ! ?? Je ne crois pas que ça change grand chose dans cet exemple. Si les forces de l'ordre se présentent à la porte pour l'expulser de sa propriété, en tant que représentantes de l'état, vont-elles vraiment repartir la queue entre les jambes après consultation d'une blockchain ?Qu'on se comprenne bien, je vois bien l'intérêt conceptuel et technologique de la notarisation par blockchain, mais il faut pas se tromper dans l'objectif et la portée...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "patrickus",
      "created_time": "October 01, 2024, 10:25:15 AM",
      "body": "Les NFT ne sont plus à la mode.QuoteNFT transactions dropped 32% from 7.3 million in August to 4.9 million in September.https://cointelegraph.com/news/nfts-lowest-monthly-volume-since-2021-cryptoslam?utm_source=newsletter&utm_medium=email&utm_campaign=collect%20campaign",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "October 01, 2024, 01:49:18 PM",
      "body": "Il en serait pas ainsi si dès les départ on était partis sur des modèles de NFT (fonctionnels) plutôt que ces plaisanteries de billets d'entrée, Minnie, Mickey ou les premiers mots de Satoshi !Encore des billets ou des timbres c'est pas si mal, un peu à la façon du collectionnisme traditionnel !Pour ce qui est de l'art, un bon usage serait à l'immortalisation des œuvres \"d'arts éphémères\" !J'étais tombé sur une artiste française, qui faisait de la \"peinture\" mais en utilisant du matériel de réalité virtuelle ... voilà un bon usage / exemple mais hélas ce n'est ce qui fait la majorité ..Encore un indice de la (manipulation dangereuse) au sein du monde de la crypto visant à rabaisser l'innovation en vue de promouvoir et bénéficier aux gangs derrière les Pump and dumps et Cie !..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}