{
  "id": "topic_5408932",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "August 06, 2022, 03:13:01 PMLast edit: November 28, 2022, 03:33:56 PM by GxSTxV",
  "content": "السلام عليكم ورحمة الله وبركاتهتحدثت في العديد من المرات عن استخداماتي لبطاقة pyypl الافتراضية التي تدعم العملات الرقمية عن طريق منصة بيننص او trustwallet واليوم اريد فقط ان اعرفكم عن بعض معلومات البطاقة و تجربتي الشخصية لها، لكن لا انصح اي احد باستخدامها او عدم استخدامها للكل حريته الشخصية.موقعها الرسمي  pyypl.comاولا مركز او مكان تواجد هذه البطاقة هو في ابو ظبي وبالتحديد 34th Floor, Al Maqam Tower, Abu Dhabi. وحسب موقعها الرسمي فتم انشائها عام 2017ثانيا كيف يمكن استخدام والحصول على البطاقة يتوجب عليك فقط استخدام نظام اندرويد او ios فتجد تطبيق البطاقة باسم pyypl على المتجر. تحصل على البطاقة مجانا بعد التحقق من هويتك وحسب تجربتي انا عن طريق بطاقة الهوية وعمل سلفي مع البطاقة عن طريق التطبيق مباشرة ولم يتعدى  من الوقت نصف ساعة تم تفعيل حسابي والحصول على البطاقةثالثا كيف يمكنك شحن هذه البطاقة؟ وهناك عدة طرقعن طريق تحويل بنكي الى بنك دبي commercial bank of dubai بعملة الدولاراو عن طريق بطاقة الائتمان لكن بسقف 1000 دولار يومياوما يهمنا نحن هو امكانية شحن البطاقة عن طريق منصة بيننص مباشرة وعن طريق اي عملة تملكها في حسابك بيننص ما يقابلها من الدولار وايضا عن طريق محفظة الكريبتو الالكترونية التي تدعم smart gate. وعن طريق عملة binance smart chainرابعا عمولة و تكاليف البطاقة الافتراضية الحصول عليها مجانا وبدون تكاليف والتحويلات بين مستخدمي البطاقة 0.3$ لاي عملية تحويلالشراء عن طريق البطاقة 2% عمولة شحن بالبطاقة عن طريق بيننص والعملات الرقمية هي 1%وعن تجربتي الشخصية قمت بالحصول على البطاقة منذ حوالي عام وشحنتها عدة مرات عن طريق منصة بيننص و قمت بشراء منتجات من مواقع كثيرة وبدون مشاكل لحد الانلكن كنصيحة لا اترك اي رصيد في البطاقة واقوم فقط بشحنها عندما اريد شراء منتج او استخدامهاوأرجو من لديه معلومات اكثر ان يضيفها او يشاركنا بطاقات افتراضية افضل",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408932",
  "comments": [
    {
      "author": "Kavelj22",
      "created_time": "August 06, 2022, 05:41:59 PM",
      "body": "Quote from: GxSTxV on August 06, 2022, 03:13:01 PMوعن تجربتي الشخصية قمت بالحصول على البطاقة منذ حوالي عام وشحنتها عدة مرات عن طريق منصة بيننص و قمت بشراء منتجات من مواقع كثيرة وبدون مشاكل لحد الانلكن كنصيحة لا اترك اي رصيد في البطاقة واقوم فقط بشحنها عندما اريد شراء منتج او استخدامهاشكرا على نشر المعلومة. تبدو فعلا بطاقة مفيدة جدا. بقي فقط أن تذكر لنا المواقع التي نجحت في الاقتناء منها باستدام هذه البطاقة. حسب الموقع فان جميع المتاجر التي تقبل Mastecard بامكانها قبول المدفوعات باستخدام هذه البطاقة. نحن فقط بحاجة لتأكيدات.https://www.pyypl.com/help/pyypl-get-your-virtual-debit-card-in-2-minutesلقد قمت بتحميل التطبيق و تم التثبت من رقم هاتفي و  قمت بارسال صورة لبطاقة الهوية لكنني أنتظر منذ أكثر من ربع ساعة أمام شاشة صامتة على أساس أنه يتم التثبت. هل من المفترض أن يستمر هذا طويلا؟ سوف اقوم بالتحديث هنا حين ينتهي الاجراء.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 06, 2022, 05:50:23 PM",
      "body": "Quote from: Kavelj22 on August 06, 2022, 05:41:59 PMQuote from: GxSTxV on August 06, 2022, 03:13:01 PMوعن تجربتي الشخصية قمت بالحصول على البطاقة منذ حوالي عام وشحنتها عدة مرات عن طريق منصة بيننص و قمت بشراء منتجات من مواقع كثيرة وبدون مشاكل لحد الانلكن كنصيحة لا اترك اي رصيد في البطاقة واقوم فقط بشحنها عندما اريد شراء منتج او استخدامهاشكرا على نشر المعلومة. تبدو فعلا بطاقة مفيدة جدا. بقي فقط أن تذكر لنا المواقع التي نجحت في الاقتناء منها باستدام هذه البطاقة. حسب الموقع فان جميع المتاجر التي تقبل Mastecard بامكانها قبول المدفوعات باستخدام هذه البطاقة. نحن فقط بحاجة لتأكيدات.لقد قمت بتحميل التطبيق و تم التثبت من رقم هاتفي و  قمت بارسال صورة لبطاقة الهوية لكنني أنتظر منذ أكثر من ربع ساعة أمام شاشة صامتة على أساس أنه يتم التثبت. هل من المفترض أن يستمر هذا طويلا؟ سوف اقوم بالتحديث هنا حين ينتهي الاجراء.لقد قمت بالشراء من موقع aliexprrss, amazon, ebay, للسلع الالكترونية... كما اني قمت بربط البطاقة بحسابي على جوجل بلاي وقمت بشحن العاب ودفع اشتراكات. حتى اني دفعت تكاليف دراسة في جامعة كندية عن طريقها .وبخصوص التفعيل اذا قمت برفع بطاقتك و اخذ صورة بشكل صحيح فقط انتظر. حسب ما قمت به انا اخذ الامر حوالي 20 دقيقة لتفعيل الحساب",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 06, 2022, 10:42:51 PM",
      "body": "Quote from: GxSTxV on August 06, 2022, 05:50:23 PMQuote from: Kavelj22 on August 06, 2022, 05:41:59 PMQuote from: GxSTxV on August 06, 2022, 03:13:01 PMوعن تجربتي الشخصية قمت بالحصول على البطاقة منذ حوالي عام وشحنتها عدة مرات عن طريق منصة بيننص و قمت بشراء منتجات من مواقع كثيرة وبدون مشاكل لحد الانلكن كنصيحة لا اترك اي رصيد في البطاقة واقوم فقط بشحنها عندما اريد شراء منتج او استخدامهاشكرا على نشر المعلومة. تبدو فعلا بطاقة مفيدة جدا. بقي فقط أن تذكر لنا المواقع التي نجحت في الاقتناء منها باستدام هذه البطاقة. حسب الموقع فان جميع المتاجر التي تقبل Mastecard بامكانها قبول المدفوعات باستخدام هذه البطاقة. نحن فقط بحاجة لتأكيدات.لقد قمت بتحميل التطبيق و تم التثبت من رقم هاتفي و  قمت بارسال صورة لبطاقة الهوية لكنني أنتظر منذ أكثر من ربع ساعة أمام شاشة صامتة على أساس أنه يتم التثبت. هل من المفترض أن يستمر هذا طويلا؟ سوف اقوم بالتحديث هنا حين ينتهي الاجراء.لقد قمت بالشراء من موقع aliexprrss, amazon, ebay, للسلع الالكترونية... كما اني قمت بربط البطاقة بحسابي على جوجل بلاي وقمت بشحن العاب ودفع اشتراكات. حتى اني دفعت تكاليف دراسة في جامعة كندية عن طريقها .وبخصوص التفعيل اذا قمت برفع بطاقتك و اخذ صورة بشكل صحيح فقط انتظر. حسب ما قمت به انا اخذ الامر حوالي 20 دقيقة لتفعيل الحسابمضت ساعات الى حد الان و لم يتغير شيء. سؤال: هل قمت بارسال صورة لبطاقة الهوية الوطنية و جواز السفر أم يمكنك اختيار أحدهما. لا أعرف ربما حسب الدولة يتم طلب الوثائق. كما أخبرتك لقد تم قبول رقم الهاتف و أكدته من خلال كود رسالة قصيرة.ان كانت هذه البطاقة تعمل على هذه المواقع فهي بالتأكيد ستغير حياتي الى الأبد.سؤال أخير: هل يمكن اعتماد البطاقة لقبول مدفوعات؟ أقصد قبول تحويلات من أي شخص اخر يملك نفس نوع البطاقة أو بطاقات اخرى؟ و ان كان هذا ممكنا فماهي حدود ذلك؟شكرا مرة أخرى على مشاركة كل المعلومات.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 06, 2022, 11:42:35 PM",
      "body": "شكرا على الشرح المفصل و مشاركة تجربتك مع هذه البطاقة هنا.عمولة الشراء و شحن البطاقة عن طريق بينانص تعتبر مرتفعة بعض الشيئ لكن يبقى مقبولا خاصة في ظل عدم وجود بديل افضل و إمكانية استعمالها في أكبر المتاجر.فقط أردت أن استفسر ان كان هناك سقف للمبلغ الذي يمكنك شحن البطاقة به من بينانص؟هناك دول لازالت لا تسمح لمواطني ها بامتلاك بطاقات دفع دولية او تضع سقف للمبلغ التي يمكنك تحويلها للخارج و هذه البطاقة يمكن أن تكون حلا لمستعملي الكريبتو في تلك الدول.ساقوم بطلب بطاقة و تجربتها و أضع هنا اي استفسار او ملاحظة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 07, 2022, 12:04:25 AM",
      "body": "Quote from: Kavelj22 on August 06, 2022, 10:42:51 PMمضت ساعات الى حد الان و لم يتغير شيء. سؤال: هل قمت بارسال صورة لبطاقة الهوية الوطنية و جواز السفر أم يمكنك اختيار أحدهما. لا أعرف ربما حسب الدولة يتم طلب الوثائق. كما أخبرتك لقد تم قبول رقم الهاتف و أكدته من خلال كود رسالة قصيرة.ان كانت هذه البطاقة تعمل على هذه المواقع فهي بالتأكيد ستغير حياتي الى الأبد.سؤال أخير: هل يمكن اعتماد البطاقة لقبول مدفوعات؟ أقصد قبول تحويلات من أي شخص اخر يملك نفس نوع البطاقة أو بطاقات اخرى؟ و ان كان هذا ممكنا فماهي حدود ذلك؟شكرا مرة أخرى على مشاركة كل المعلومات.ربما التاخر بسبب عطلة الاسبوع لديهم او كثرة الطلب على البطاقة. يمكنك الاختيار بين بطاقة الهوية او رخصة السياقة وحتى جواز السفر حسب تجربتي ولكن ربما يوجد تعديل او حسب الدولة كما قلتنعم كما قلت لك يمكنك الاستقبال عن طريق شخص اخر يملك نفس البطاقة بدون سقف اما اذا كانت بطاقة اخرى ائتمانية يجب الشحن عن طريقها اي يجب ان يكون لديك معلومات البطاقة و سقفها 1000$ لليوم الواحد اي يجب عليك الانتظار لمدة 24 ساعة لكي تعيد العملية",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 07, 2022, 12:12:39 AM",
      "body": "Quote from: khaled0111 on August 06, 2022, 11:42:35 PMشكرا على الشرح المفصل و مشاركة تجربتك مع هذه البطاقة هنا.عمولة الشراء و شحن البطاقة عن طريق بينانص تعتبر مرتفعة بعض الشيئ لكن يبقى مقبولا خاصة في ظل عدم وجود بديل افضل و إمكانية استعمالها في أكبر المتاجر.فقط أردت أن استفسر ان كان هناك سقف للمبلغ الذي يمكنك شحن البطاقة به من بينانص؟هناك دول لازالت لا تسمح لمواطني ها بامتلاك بطاقات دفع دولية او تضع سقف للمبلغ التي يمكنك تحويلها للخارج و هذه البطاقة يمكن أن تكون حلا لمستعملي الكريبتو في تلك الدول.ساقوم بطلب بطاقة و تجربتها و أضع هنا اي استفسار او ملاحظة. صحيح ان العمولة مرتفعة نوعا ما خاصة في حالة شحن مبلغ كبير لكن حتى الان هي اول بطاقة تدعم جميع دول العالم خاصة العربية وكما انها سوف تضيف بطاقات بلاستيكية قريبا كما تم الاعلان في التطبيقو بخصوص حدود شحن البطاقة فلا يوجد اي سقف حاليا لكن سوف استفسر للتاكد وقطع الشك في الموضوع كما يمكن لاي شخص التواصل مع دعم الموقع مباشرة للاستفسارونتمنى من كل من يستخدم البطاقة في المنتدى بمشاركتنا لتجربته وتقديم نصائح اكثر او حتى بدائل  pyypl.com/contact/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 07, 2022, 11:29:02 AM",
      "body": "Quote from: GxSTxV on August 07, 2022, 12:04:25 AMQuote from: Kavelj22 on August 06, 2022, 10:42:51 PMمضت ساعات الى حد الان و لم يتغير شيء. سؤال: هل قمت بارسال صورة لبطاقة الهوية الوطنية و جواز السفر أم يمكنك اختيار أحدهما. لا أعرف ربما حسب الدولة يتم طلب الوثائق. كما أخبرتك لقد تم قبول رقم الهاتف و أكدته من خلال كود رسالة قصيرة.ان كانت هذه البطاقة تعمل على هذه المواقع فهي بالتأكيد ستغير حياتي الى الأبد.سؤال أخير: هل يمكن اعتماد البطاقة لقبول مدفوعات؟ أقصد قبول تحويلات من أي شخص اخر يملك نفس نوع البطاقة أو بطاقات اخرى؟ و ان كان هذا ممكنا فماهي حدود ذلك؟شكرا مرة أخرى على مشاركة كل المعلومات.ربما التاخر بسبب عطلة الاسبوع لديهم او كثرة الطلب على البطاقة. يمكنك الاختيار بين بطاقة الهوية او رخصة السياقة وحتى جواز السفر حسب تجربتي ولكن ربما يوجد تعديل او حسب الدولة كما قلتنعم كما قلت لك يمكنك الاستقبال عن طريق شخص اخر يملك نفس البطاقة بدون سقف اما اذا كانت بطاقة اخرى ائتمانية يجب الشحن عن طريقها اي يجب ان يكون لديك معلومات البطاقة و سقفها 1000$ لليوم الواحد اي يجب عليك الانتظار لمدة 24 ساعة لكي تعيد العمليةبالنسبة للخيارات التي ظهرت لي فلم يكن من بينها رخصة القيادة. فقط بطاقة الهوية و جواز السفر.مضت أكثر من 24 ساعة على وقت ارسال صورة البطاقة و قد اضطررت منذ قليل الى اقفال الجهاز و اعادة تشغيله و بمجرد الدخول الى التطبيق مجددا وجدت أنه يتعين عليا اعادة نفس المراحل من التثبت من رقم الهاتف و ارسال صورة الهوية مجددا.أنا عمليا لم أقم بالتسجيل بعد لذلك لا يمكنني الاتصال بالدعم بما أن معلوماتي ليست مسجلة لديهم بعد. بالرغم من هذا فقد حاولت الاتصال بالدعم لكني اعترضني أمر غريب: هناك خانة الدولة يجب تحديدها من جملة الاختيارات و هي اجبارية. الدول الموجودة هي فقط الامارات العربية المتحدة، البحرين، كازخستان، كينيا، موزمبيق، سير اليون، الأردن، نيجيريا، الكويت، العربية السعودية، نميبيا، و افريقيا الجنوبية. هذا يعني أنه لا يمكن التواصل مع الدعم.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 07, 2022, 05:03:41 PM",
      "body": "Quote from: Kavelj22 on August 07, 2022, 11:29:02 AMبالنسبة للخيارات التي ظهرت لي فلم يكن من بينها رخصة القيادة. فقط بطاقة الهوية و جواز السفر.مضت أكثر من 24 ساعة على وقت ارسال صورة البطاقة و قد اضطررت منذ قليل الى اقفال الجهاز و اعادة تشغيله و بمجرد الدخول الى التطبيق مجددا وجدت أنه يتعين عليا اعادة نفس المراحل من التثبت من رقم الهاتف و ارسال صورة الهوية مجددا.أنا عمليا لم أقم بالتسجيل بعد لذلك لا يمكنني الاتصال بالدعم بما أن معلوماتي ليست مسجلة لديهم بعد. بالرغم من هذا فقد حاولت الاتصال بالدعم لكني اعترضني أمر غريب: هناك خانة الدولة يجب تحديدها من جملة الاختيارات و هي اجبارية. الدول الموجودة هي فقط الامارات العربية المتحدة، البحرين، كازخستان، كينيا، موزمبيق، سير اليون، الأردن، نيجيريا، الكويت، العربية السعودية، نميبيا، و افريقيا الجنوبية. هذا يعني أنه لا يمكن التواصل مع الدعم.نعم اظن ان التطبيق حاليا في حالة ضغط بسبب الاقبال الكثير من المستخدمين عليه، سبق ان تواصلت مع الدعم للاستفسار حول بعض الامور من قبل ولم ياخذ الوقت الا القليل للرد لكن حاليا منذ ساعات لم اتوصل باي رد من الدعم داخل التطبيق حول استفسار محدودية شحن البطاقة للتاكدو مع الاسف ايضا الدعم داخل الموقع لا يدعم جميع الدول ولا يوجد سبب مقنع او عقلاني لذلك سوف انشر رد الدعم على اية حال عندما اتلقى الرد وارجوا منك ايضا اخباري اذا تم تفعيل حسابك",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "August 09, 2022, 07:44:27 AM",
      "body": "Quote from: GxSTxV on August 07, 2022, 12:12:39 AMصحيح ان العمولة مرتفعة نوعا ما خاصة في حالة شحن مبلغ كبير لكن حتى الان هي اول بطاقة تدعم جميع دول العالم خاصة العربية وكما انها سوف تضيف بطاقات بلاستيكية قريبا كما تم الاعلان في التطبيقو بخصوص حدود شحن البطاقة فلا يوجد اي سقف حاليا لكن سوف استفسر للتاكد وقطع الشك في الموضوع كما يمكن لاي شخص التواصل مع دعم الموقع مباشرة للاستفسارونتمنى من كل من يستخدم البطاقة في المنتدى بمشاركتنا لتجربته وتقديم نصائح اكثر او حتى بدائل  pyypl.com/contact/هل أنت متأكد أن البطاقات متوفرة في جميع الدول العربية؟ أنا لم أقم بتجربة التطبيق لكن على حسب ما هو مذكور في الموقع  الرسمي، البطاقات متوفرة في الامارات و البحرين فقط. أما بالنسبة للدول الأخرى، فهي قيد التحضير؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 09, 2022, 09:20:56 AM",
      "body": "Quote from: OmegaStarScream on August 09, 2022, 07:44:27 AMQuote from: GxSTxV on August 07, 2022, 12:12:39 AMصحيح ان العمولة مرتفعة نوعا ما خاصة في حالة شحن مبلغ كبير لكن حتى الان هي اول بطاقة تدعم جميع دول العالم خاصة العربية وكما انها سوف تضيف بطاقات بلاستيكية قريبا كما تم الاعلان في التطبيقو بخصوص حدود شحن البطاقة فلا يوجد اي سقف حاليا لكن سوف استفسر للتاكد وقطع الشك في الموضوع كما يمكن لاي شخص التواصل مع دعم الموقع مباشرة للاستفسارونتمنى من كل من يستخدم البطاقة في المنتدى بمشاركتنا لتجربته وتقديم نصائح اكثر او حتى بدائل  pyypl.com/contact/هل أنت متأكد أن البطاقات متوفرة في جميع الدول العربية؟ أنا لم أقم بتجربة التطبيق لكن على حسب ما هو مذكور في الموقع  الرسمي، البطاقات متوفرة في الامارات و البحرين فقط. أما بالنسبة للدول الأخرى، فهي قيد التحضير؟يقصدون البطاقات البلاستيكية. انا اتحدث عن البطاقة الافتراضية التي بمجرد فتح الحساب وتفعيله تحصل عليها وتستعملها بشكل عادي.. وتوجد البطاقة البلاستيكية التي حتى الان في منطقتي غير متوفر",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 10, 2022, 04:20:40 PM",
      "body": "Quote from: GxSTxV on August 07, 2022, 05:03:41 PMQuote from: Kavelj22 on August 07, 2022, 11:29:02 AMبالنسبة للخيارات التي ظهرت لي فلم يكن من بينها رخصة القيادة. فقط بطاقة الهوية و جواز السفر.مضت أكثر من 24 ساعة على وقت ارسال صورة البطاقة و قد اضطررت منذ قليل الى اقفال الجهاز و اعادة تشغيله و بمجرد الدخول الى التطبيق مجددا وجدت أنه يتعين عليا اعادة نفس المراحل من التثبت من رقم الهاتف و ارسال صورة الهوية مجددا.أنا عمليا لم أقم بالتسجيل بعد لذلك لا يمكنني الاتصال بالدعم بما أن معلوماتي ليست مسجلة لديهم بعد. بالرغم من هذا فقد حاولت الاتصال بالدعم لكني اعترضني أمر غريب: هناك خانة الدولة يجب تحديدها من جملة الاختيارات و هي اجبارية. الدول الموجودة هي فقط الامارات العربية المتحدة، البحرين، كازخستان، كينيا، موزمبيق، سير اليون، الأردن، نيجيريا، الكويت، العربية السعودية، نميبيا، و افريقيا الجنوبية. هذا يعني أنه لا يمكن التواصل مع الدعم.نعم اظن ان التطبيق حاليا في حالة ضغط بسبب الاقبال الكثير من المستخدمين عليه، سبق ان تواصلت مع الدعم للاستفسار حول بعض الامور من قبل ولم ياخذ الوقت الا القليل للرد لكن حاليا منذ ساعات لم اتوصل باي رد من الدعم داخل التطبيق حول استفسار محدودية شحن البطاقة للتاكدو مع الاسف ايضا الدعم داخل الموقع لا يدعم جميع الدول ولا يوجد سبب مقنع او عقلاني لذلك سوف انشر رد الدعم على اية حال عندما اتلقى الرد وارجوا منك ايضا اخباري اذا تم تفعيل حسابكلم يتغير شيء منذ يومين. رقم الهاتف يتم قبوله فأستقبل رسالة نصية و أجد دولتي مدعومة من التطبيق و بعد المرور الى اجراء التثبت من الهوية يبقى التطبيق في حالة انتظار للتفعيل دون أن يحصل شيء. أصبح مؤكدا أن التطبيق لا يدعم جميع الدول و خصوصا الدول العربية و أظن هذا متعلقا بالحصول على تراخيص أو نتيجة السياسات الالمالية الداخلية لكل دولةأرجوك أن تسال الدعم عن الدول التي تدعمها الخدمة لنوضح الأمر للبقية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 10, 2022, 09:10:59 PM",
      "body": "Quote from: Kavelj22 on August 10, 2022, 04:20:40 PMQuote from: GxSTxV on August 07, 2022, 05:03:41 PMQuote from: Kavelj22 on August 07, 2022, 11:29:02 AMبالنسبة للخيارات التي ظهرت لي فلم يكن من بينها رخصة القيادة. فقط بطاقة الهوية و جواز السفر.مضت أكثر من 24 ساعة على وقت ارسال صورة البطاقة و قد اضطررت منذ قليل الى اقفال الجهاز و اعادة تشغيله و بمجرد الدخول الى التطبيق مجددا وجدت أنه يتعين عليا اعادة نفس المراحل من التثبت من رقم الهاتف و ارسال صورة الهوية مجددا.أنا عمليا لم أقم بالتسجيل بعد لذلك لا يمكنني الاتصال بالدعم بما أن معلوماتي ليست مسجلة لديهم بعد. بالرغم من هذا فقد حاولت الاتصال بالدعم لكني اعترضني أمر غريب: هناك خانة الدولة يجب تحديدها من جملة الاختيارات و هي اجبارية. الدول الموجودة هي فقط الامارات العربية المتحدة، البحرين، كازخستان، كينيا، موزمبيق، سير اليون، الأردن، نيجيريا، الكويت، العربية السعودية، نميبيا، و افريقيا الجنوبية. هذا يعني أنه لا يمكن التواصل مع الدعم.نعم اظن ان التطبيق حاليا في حالة ضغط بسبب الاقبال الكثير من المستخدمين عليه، سبق ان تواصلت مع الدعم للاستفسار حول بعض الامور من قبل ولم ياخذ الوقت الا القليل للرد لكن حاليا منذ ساعات لم اتوصل باي رد من الدعم داخل التطبيق حول استفسار محدودية شحن البطاقة للتاكدو مع الاسف ايضا الدعم داخل الموقع لا يدعم جميع الدول ولا يوجد سبب مقنع او عقلاني لذلك سوف انشر رد الدعم على اية حال عندما اتلقى الرد وارجوا منك ايضا اخباري اذا تم تفعيل حسابكلم يتغير شيء منذ يومين. رقم الهاتف يتم قبوله فأستقبل رسالة نصية و أجد دولتي مدعومة من التطبيق و بعد المرور الى اجراء التثبت من الهوية يبقى التطبيق في حالة انتظار للتفعيل دون أن يحصل شيء. أصبح مؤكدا أن التطبيق لا يدعم جميع الدول و خصوصا الدول العربية و أظن هذا متعلقا بالحصول على تراخيص أو نتيجة السياسات الالمالية الداخلية لكل دولةأرجوك أن تسال الدعم عن الدول التي تدعمها الخدمة لنوضح الأمر للبقية. لا اعرف ما المشكل بالتحديد لان صديقي ايضا من الجزائر قام بتحميل التطبيق هذا الاسبوع وقام بتفعيل حسابه والحصول على البطاقة الافتراضيةقمت بالتواصل مع الدعم الفني داخل التطبيق لكن لم يتم الرد وهذا امر لم اتعود عليه لكن اذا تم الرد علي سوف اعلمكم",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 10, 2022, 11:24:03 PM",
      "body": "Quote from: Kavelj22 on August 10, 2022, 04:20:40 PMلم يتغير شيء منذ يومين. رقم الهاتف يتم قبوله فأستقبل رسالة نصية و أجد دولتي مدعومة من التطبيق و بعد المرور الى اجراء التثبت من الهوية يبقى التطبيق في حالة انتظار للتفعيل دون أن يحصل شيء. الان فقط سنحت لي الفرصة لتحميل التطبيق و تجربته. اعتقد انك محظوظ لتمكنك من نسخ بطاقة الهوية. بالنسبة لي حاولت عديد المرات لكن لم أنجح. عند نسخ البطاقة، التطبيق لا يستطيع تمييز تاريخ الولادة و الاسم الذي يتم إدخاله خاطئ تماما. لا أعرف لماذا يعتمدون على هذه الطريقة المعقدة بدل الطرق المتعارف عليها!أيضا استغربت من حجم التطبيق الذي يعتبر كبير نسبيا و عند الاطلاع على التقييمات في متجر قوقل لاحظت ان اغلبها سلبية خاصة بسبب سوء خدمة العملاء و عدم استجابتهم للتشكيات.على العموم ساحاول مجددا فمازلت مهتم باستعمال هذه البطاقة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "August 11, 2022, 04:39:16 PM",
      "body": "Quote from: khaled0111 on August 10, 2022, 11:24:03 PMالان فقط سنحت لي الفرصة لتحميل التطبيق و تجربته. اعتقد انك محظوظ لتمكنك من نسخ بطاقة الهوية. بالنسبة لي حاولت عديد المرات لكن لم أنجح. عند نسخ البطاقة، التطبيق لا يستطيع تمييز تاريخ الولادة و الاسم الذي يتم إدخاله خاطئ تماما. لا أعرف لماذا يعتمدون على هذه الطريقة المعقدة بدل الطرق المتعارف عليها!ربما بطاقة تعريف بلدك غير مدعومة من طرف المكتبة المستخدمة لقراءة البيانات من البطاقات (يعني لا تشبه بطاقات البلدان الأخرى؟) قد أكون مخطأ (لأني لم أقم بالتجربة بعد) لكن أعتقد أنك لن تواجه المشكل في حال استخدامك لجواز السفر (البيومتري)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 11, 2022, 10:37:49 PM",
      "body": "Quote from: OmegaStarScream on August 11, 2022, 04:39:16 PMربما بطاقة تعريف بلدك غير مدعومة من طرف المكتبة المستخدمة لقراءة البيانات من البطاقات (يعني لا تشبه بطاقات البلدان الأخرى؟) قد أكون مخطأ (لأني لم أقم بالتجربة بعد) لكن أعتقد أنك لن تواجه المشكل في حال استخدامك لجواز السفر (البيومتري)لا أعتقد أن السبب هو عدم دعم بطاقة التعريف او الهوية لان هناك من هو من بلدي و تمكن من نسخ البطاقة بدون أشكال. التطبيق يتمكن من قراءة بعض البيانات مثل الاسم و اللقب لكن لا يستطيع قزاءة تاريخ الولادة. ربما تكون المشكلة في دقة كاميرا الهاتف!ما أجده غريبا هو اذا كان التطبيق او الشركة تعتمد على هذه الطريقة الاوتوماتيكية لقراءة البيانات فلماذا تستغرق عملية التحقق فترة طويلة مثل ما هو الحال في حالة الأخ kavelj؟بالنسبة لجواز السفر فجوازي منتهي الصلاحية إضافة إلى أن الجوازات البيوميترية لم يبدأ العمل بها بعد هنا. لكن يبقى حل افضل من بطاقة الهوية بما انه يحتوي على البيانات بالحروف اللاتينية مما يسهل عملية النسخ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 12, 2022, 02:11:15 PM",
      "body": "Quote from: khaled0111 on August 11, 2022, 10:37:49 PMQuote from: OmegaStarScream on August 11, 2022, 04:39:16 PMربما بطاقة تعريف بلدك غير مدعومة من طرف المكتبة المستخدمة لقراءة البيانات من البطاقات (يعني لا تشبه بطاقات البلدان الأخرى؟) قد أكون مخطأ (لأني لم أقم بالتجربة بعد) لكن أعتقد أنك لن تواجه المشكل في حال استخدامك لجواز السفر (البيومتري)لا أعتقد أن السبب هو عدم دعم بطاقة التعريف او الهوية لان هناك من هو من بلدي و تمكن من نسخ البطاقة بدون أشكال. التطبيق يتمكن من قراءة بعض البيانات مثل الاسم و اللقب لكن لا يستطيع قزاءة تاريخ الولادة. ربما تكون المشكلة في دقة كاميرا الهاتف!ما أجده غريبا هو اذا كان التطبيق او الشركة تعتمد على هذه الطريقة الاوتوماتيكية لقراءة البيانات فلماذا تستغرق عملية التحقق فترة طويلة مثل ما هو الحال في حالة الأخ kavelj؟بالنسبة لجواز السفر فجوازي منتهي الصلاحية إضافة إلى أن الجوازات البيوميترية لم يبدأ العمل بها بعد هنا. لكن يبقى حل افضل من بطاقة الهوية بما انه يحتوي على البيانات بالحروف اللاتينية مما يسهل عملية النسخ. هناك مسألة أخرى غريبة. حين القيام بتصوير بطاقة الهوية يطلب منك التطبيق ان تقلب البطاقة ليأخذ صورة للجهة الخلفية للبطاقة و هذا مفهوم. لكنه يطلب نفس الأمر حين حاولت تصوير جواز السفر. يصح هذا مع جواز السفر البيومتري (لا أملك واحدا) لكن كيف تعرف التطبيق على صفحة جواز السفر العادي التي تحتوي بياناتي؟ حسب رأيي فان الخدمة لاتزال في بدايتها و لازالت تستحق المزيد من العمل على التطوير.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "November 28, 2022, 03:49:53 PM",
      "body": "اليوم اردت استخدام البطاقة التي كانت لدي فالفعل من قبل ولديها الكثير من الوقت عندي تفاجأت بتحديث جديد للتطبيق لهذا قمت بتحديثه وتمكنت من شحن البطاقة عن طريق باينصص كما العادة وبالطاقة لاتزال تعمل وقد قمت بشراء عن طريقها اشتراك تطبيق تلغرام بدون اي مشاكل او عمولة كبيرةوقررت ايضا فتح حساب جديد اخر على جهازي الاخر في سبيل التجربة وحملت التطبيق على سوق ابل ستور     هذه الخطوات التي قمت باجرائها وتمكنت من تفعيل الحساب بشكل الي وفوري بدون انتظار لكن الان الفرق انك لن تستطيع الحصول على البطاقة الافتراضية الى بعد شحن الحساب حتى لو ب واحد دولار وهو الحد الادنى على بايننص أو المحافظ التي تدعم Dapp مثل trustwalletاتمنى ان تجربوا فتح حساب للاشخاص الذين لم يتمكنوا من الحصول على حساب من قبل لاني فعلا البطاقة توفر لنا عناءا كثيرا",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 30, 2023, 06:09:29 PM",
      "body": "Quote from: khaled0111 on August 11, 2022, 10:37:49 PMQuote from: OmegaStarScream on August 11, 2022, 04:39:16 PMربما بطاقة تعريف بلدك غير مدعومة من طرف المكتبة المستخدمة لقراءة البيانات من البطاقات (يعني لا تشبه بطاقات البلدان الأخرى؟) قد أكون مخطأ (لأني لم أقم بالتجربة بعد) لكن أعتقد أنك لن تواجه المشكل في حال استخدامك لجواز السفر (البيومتري)لا أعتقد أن السبب هو عدم دعم بطاقة التعريف او الهوية لان هناك من هو من بلدي و تمكن من نسخ البطاقة بدون أشكال. التطبيق يتمكن من قراءة بعض البيانات مثل الاسم و اللقب لكن لا يستطيع قزاءة تاريخ الولادة. ربما تكون المشكلة في دقة كاميرا الهاتف!ما أجده غريبا هو اذا كان التطبيق او الشركة تعتمد على هذه الطريقة الاوتوماتيكية لقراءة البيانات فلماذا تستغرق عملية التحقق فترة طويلة مثل ما هو الحال في حالة الأخ kavelj؟بالنسبة لجواز السفر فجوازي منتهي الصلاحية إضافة إلى أن الجوازات البيوميترية لم يبدأ العمل بها بعد هنا. لكن يبقى حل افضل من بطاقة الهوية بما انه يحتوي على البيانات بالحروف اللاتينية مما يسهل عملية النسخ. بعد ان لفت انتباهي مؤخرا وجود عديد الخدمات التي تقبل الدفع ببطاقة PYYPL أود أن أعرف ان كنت قد تمكنت من توثيق حسابك و الحصول فعلا على بطاقة.لقد كررت البحث في المنتديات و القروبات و لاحظت ان البطاقة متداولة فعلا في المنطقة العربية و هناك من يقدم خدمات الشحن بالنسبة للذين يقيمون في دول لا تسمح لهم بشحن البطاقة و هي الدول التي لا تدعمها البطاقة اصلا. يعني لو تمكنت من توثيق حسابك من اي دولة فان عملية شحن الرصيد ممكنة حسب ما فهمت خصوصا ان عمليات الايداع يمكن ان تتم بالدولار عبر اي من البنوك الاماراتية.لاحظت ايضا انه حسب الحوارات في المنتديات فانه يمكن شحن البطاقة عبر Paysera و لكن يجب ان لا يقترن هذا مع شراء او بيع للعملات المشفرة لان Paysera متشددة للغاية في ما يتعلق بالعملات المشفرة و لا تدعمها بشكل قطعي.كما و اعدت مراجعة موقع الخدمة و لم اجد انه وقع اي تحيين في البلدان المدعومة او المحضورة و انه لم يحصل اي تطور في هذا المجال بعد.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 30, 2023, 10:31:28 PM",
      "body": "Quote from: Kavelj22 on May 30, 2023, 06:09:29 PM... شكرا لتحديث الموضوع نظرا لأهميته.بصراحة لم اقم بإعادة المحاولة منذ فترة كوني اعرف ان النتيجة ستكون هي نفسها. توثيق الحساب عن طريق بطلقة الهوية في بلدي شيئ شبه مستحيل و السبب ليس حضر البلد بل بكيفية تصميم البطاقة.ساحاول بعد فترة ان اقوم بتثبيت الهوية عن طريق جواز السفر (يجب أن انتظر إلى أن يتم تجديده) او انتظر إلى أن يتم اصدار بطاقات التعريف البيومترية، التي من المفترض أن تحل كل هذه المشاكل.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}