{
  "id": "topic_5431269",
  "title": "georgest",
  "author": "georgest",
  "created_time": "December 24, 2022, 06:04:17 PM",
  "content": "🚨ETH/Bitcoin Trading bot for both Binance/Bitmex.🚨+6 Month proven Live Trading Results no bullshit real profits everythinig recorded logs. 🚨NO DCA,Martingale Risky Strategies.🚨Dynamic Strategy Based on exclusive OrderBook&VSA.🚨Capital preservation hard stop loss protection.🚨High ROI +50% weekly depends on Volatility.▶️ Trading Bot:Our main investment tool is a proprietary trading Market Maker bot. This unique bot is dynamic and does short/long trades with XBTUSD  ETH/USD currently.  It utilizes VSA and the order book to enter/exit trades with high accuracy.You provide only  API key access to make trading. Money transfer is disabled by binance and bitmex, (there is a option when creating API key)  and only investor can do such operations !🚨   How to Join our Bot:   ( Managed Accounts )Solo investment: ( Min 1 BTC )Group Investment + 10 BTC ( upon request + 6 Month Trading report available )1  ⚡️  Start your own Bitmex or binance account.2  ⚡️  Deposit your funds on your account  4  ⚡️  Provide API keys (only trading enabled, withdrawals off)4  ⚡️ Profit Sharing 50/50 in between from net profit. once each week (Sunday)5 ⚡️ +10  BTC account management fee's negotiable and will be lower.❗️Be aware of scammers we will never DM you firstIf you are interested  just reply this massage I will DM our contacts and show live trading results as a prove.Leave positive reviews here once you make profits.RISK DISCLOSURE:Trading Bitcoin/Cryptos on margin carries a high level of risk,All investments involve risk NO REPRESENTATION IS BEING MADE THAT ANY ACCOUNT WILL OR IS LIKELY TO ACHIEVE PROFITS OR LOSSES SIMILAR TO THESE BEING SHOWN.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431269",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "December 24, 2022, 09:53:38 PM",
      "body": "Quote from: georgest on December 24, 2022, 06:04:17 PM🚨ETH/Bitcoin Trading bot for both Binance/Bitmex.🚨+6 Month proven Live Trading Results no bullshit real profits everythinig recorded logs. Words mean nothing here, prove!Quote🚨High ROI +50% weekly depends on Volatility.Again prove that it's not just a scamQuote from: georgest on December 24, 2022, 06:04:17 PMYou provide only  API key access to make trading. Money transfer is disabled by binance and bitmex, (there is an option when creating API key)  and only investor can do such operations !Nobody should trust you with their API key, people have been scammed through this even if moving funds was disabled. Once the malicious actors accessed API keys, they would sell of their shitcoins on spot market onto the victims in exchange for their valuable BTC or Ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "georgest",
      "created_time": "December 25, 2022, 08:04:53 AM",
      "body": "You are skeptical have you been scammed many times?API key is generated by binance not by you or by me.  for education you read this well next time  https://www.binance.com/en/support/faq/how-to-create-api-360002502072Its 100% safe and secure.  you can uncheck withdrawal and allow only trading.  There is no singel recorded cases someone managed to withdraw funds with binance API key if withdrawal is off. its binance live trading statments upon request you need to dm me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 25, 2022, 08:39:53 AM",
      "body": "The signs that shows you are scammer or pointing out scammers are, at first they always go with high amount without even considering they are newbies. How do you think someone would release 10 btc @ ~$16,836.23 x 10, you know what that means?not just that, also paying 10 btc as account mgn fee do you think having btc is just like taking a cup of tea or something else?.I strongly believe all of this are fiction. Warning be mindful while dealing with newbie!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "georgest",
      "created_time": "December 25, 2022, 10:38:50 AMLast edit: December 25, 2022, 11:10:05 AM by georgest",
      "body": "Quote from: Adbitco on December 25, 2022, 08:39:53 AMThe signs that shows you are scammer or pointing out scammers are, at first they always go with high amount without even considering they are newbies. How do you think someone would release 10 btc @ ~$16,836.23 x 10, you know what that means?not just that, also paying 10 btc as account mgn fee do you think having btc is just like taking a cup of tea or something else?.I strongly believe all of this are fiction. Warning be mindful while dealing with newbie!Thank you for input, you are not welcomed here. find someone for your toxicity. unsuccesful people act like you.Who said it straight 10 BTC and where did you read 10 BTC managment fee?  Our asset managment can be done starting with 1 BTC accounts as it is written and profit sharing based on high water mark model 50/50/ if we do not make profits we do not get anything. and no one is realesing anything to us.How it is scam? investor not sending anything to us. but giving access to trading account binance using API key, where withdrawals are off (guaranteed by binance). just trading operastions.  It's general practise asset managment and we act as a fund manager we are not inventing anything new. from your comments, it seems you have leak of knowladge how financial markets trading, asset wealth managment working.  and we are not trading shitcoins, but futures trading ETH and BTC only.go somewhere else and find ponzi scams.  you misslead people here.  so in order to qualify scam we need to steal take investors money right?  read above what I wrote.   once profits are made we will provide BTC/ETH wallet and investor will send 50% profits. only he can do that, we do not ask login details of account, we have no rights/ability to withdraw anything from binance/bitmex account.  if investor will not pay we will stop bot. so more likely only scammer who might be is investor here.for real investors to backup our saying we can show 6 month live trading statments straight from CEX.  as a main prove,  no demo trading no short term reports.  full live trading logs Tell me in crypto asset manager with 6 month sustained trading reports I will invest it too )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "georgest",
      "created_time": "December 27, 2022, 09:51:45 AM",
      "body": "real investors are many here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "December 27, 2022, 02:07:51 PMLast edit: December 27, 2022, 02:21:32 PM by Danydee72",
      "body": "QuoteHow it is scam? investor not sending anything to us. but giving access to trading account binance using API key, where withdrawals are off (guaranteed by binance)Withdrawal is not needed to get scammed. People may use given api keys to swap anything in their favour. It's not a reliable indication if the consumer of an api key does not know about it's security issues.Quotereal investors are many here SmileyQuoteLeave positive reviews here once you make profits.I doubt there will be such reviews ... are there already some?QuoteThank you for input, you are not welcomed here. find someone for your toxicity. unsuccesful people act like you.Unqualified answer. People read this. If you like to be trusted, there are ways. If you like to be mistrusted, there are some too.    You choose.QuoteSolo investment: ( Min 1 BTC )1 BTC? No Joke? Why not start with 10$?I like the idea of a working bot and I wouldn't say it's impossible you really created one. But: If it's working, why you like to sell/rent it to people? Just use it for yourself and be happy with it's earnings. If you really need that extra money, presumably it doesn't work. Otherwise you wouldn't need to sell it. Ultimately, if not for the other reasons, that's why it's clear it must be scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "December 28, 2022, 10:34:59 AM",
      "body": "LOL snapping at every criticism you get only puts you in a bad light op.Quote from: georgest on December 25, 2022, 08:04:53 AMAPI key is generated by binance not by you or by me.  for education you read this well next time  https://www.binance.com/en/support/faq/how-to-create-api-360002502072Its 100% safe and secure.  you can uncheck withdrawal and allow only trading.  There is no singel recorded cases someone managed to withdraw funds with binance API key if withdrawal is off. its binance and read his post, he didn't say anything about the withdrawal being the problem. Perpetrators have been using trade-only API keys to pump illiquid coins and dump them to their victims. Unauthorized trades can happen and people shouldn't be laid back about this.Some past incidents to read:1. https://3commas.io/blog/october-19-phishing-attack-post-mortem2. https://hackernoon.com/alleged-hack-of-binance-linked-to-viacoin-pump-bb9066bf96bf3. https://www.reddit.com/r/binance/comments/p597t5/how_i_got_hacked_and_lost_80k_usd_in_a_few_hours/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 29, 2022, 06:38:32 PM",
      "body": "If I am capable of making 50% profits on weekly basis then I would have been trying to compete to get listed on forbes. In a rough calculation, an initial capital of $100 is enough to reach $1 million mark in just 25 weeks with average of 50% returns weekly. But, you are taking about 10 BTC of investments here and I could not imagine about the returns on the same 25 weeks of time period.In my vast experiences across different trading markets, no trader will consistently work on other's capital. There could be one or two who may work on profit sharing and they also will switch over to self-trading once they gather enough capital for not depending on any investor.Trading is a skilful work which means no one would be ready to break their head to fetch profits for us; it is a fact hence not getting deceived on high ROI is wise decision for anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 30, 2022, 05:17:29 AM",
      "body": "This seems very similar to the 3commas. Basically they also had withdraws off and people assumed it was safe. However the api got leaked and they basically used peoples funds to buy low cap coins such as YFIDAI and caused a 6000% gain. And later shorted it down with another account.This service seems no different. Just because withdraws are locked doesn’t mean you can’t lose all your funds. Hopefully people learn from the 3Commas mess that happened in the past month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}