{
  "id": "topic_5455572",
  "title": "CypherMonk",
  "author": "CypherMonk",
  "created_time": "June 07, 2023, 07:10:50 AM",
  "content": "Does anyone here still stores their crypto in exchanges? I think the best choice would be to move a higher value of funds to a hardware wallet while leaving a small amount that's less than 5K in an exchange.Exchanges have proven time and time again that they can disappoint their users at any time. Let's not talk about the FTX issue. but for instance, Atomic Wallet just let its users' funds vanish into thin air a few days ago with no reasonable explanation.So, why would anyone in their right mind take the risk of storing your crypto on exchange? When it usually means that the exchange retains control (or 'custody') of your assets without giving you access to the private keys. Also, they can disappoint you at any time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455572",
  "comments": [
    {
      "author": "Rockstarguy",
      "created_time": "June 07, 2023, 07:31:02 AM",
      "body": "I see no reason why anyone would prefer to choose exchange wallet to invest bitcoin with several ugly situation we have experienced sometimes ago. Exchange should only be consider to be a place for instant trade and not where to invest bitcoin  because it is risky and anything can happen to exchange. centralised wallet where bitcoin is stored it means the bitcoin also belongs to the exchange, in a case where it is not your key it is also not your coin. How people feel so   comfortable investing bitcoin with exchange needs to be look into and make the right decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Venik",
      "created_time": "June 07, 2023, 07:33:53 AM",
      "body": "I never did. I was always using OWNR wallet. I think that if people didn't think about using something else besides exchanges after the FTX crash then nothing will help them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lucifur",
      "created_time": "June 07, 2023, 07:39:31 AM",
      "body": "As someone who doesn't really have a lot of crypto, I admit that I have been using and will continuously use exchange wallet. I find it convinient since I mostly transfer it and trade it. If I were to have a crypto worth $500 more tho, I wouldn't trust holding it in exchange.I am fairly new to crypto and I don't really have the time to delve more in to it but it's a common sense not to trust an online wallet to hold your money, be it in crypto or fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "June 07, 2023, 07:43:44 AM",
      "body": "Permit me to establish a point here. It might have been said that non-custodial wallets are the best...blah blah...which I do not doubt for safekeeping. However, many of you are disregarding the context of making more money with your coin, and by virtue of this neglecting the styles, goals and investment plans which must vary. Personally, my goal is to make money with Bitcoin and I plan to make it in both risky and less risky ways.I hold my coins which are of the less-risky class and are stored in my non-custodial wallet. While the ones I trade and invest regularly are stored with three exchanges.There is no way a non-custodial wallet can help me trade and invest in spots and futures. Also, there are coins that I only alternate between BTC and USDT without spot/future trading them to save the value from the bearish moments. This is basically about your plan and how best it works for you to maximize your income. Even if one exchange goes insolvent, the others are still there for me as they help me make more than what HODLing would have made possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CypherMonk",
      "created_time": "June 07, 2023, 07:56:14 AM",
      "body": "Quote from: Rockstarguy on June 07, 2023, 07:31:02 AMI see no reason why anyone would prefer to choose exchange wallet to invest bitcoin with several ugly situation we have experienced sometimes ago. Exchange should only be consider to be a place for instant trade and not where to invest bitcoin  because it is risky and anything can happen to exchange. centralised wallet where bitcoin is stored it means the bitcoin also belongs to the exchange, in a case where it is not your key it is also not your coin. How people feel so   comfortable investing bitcoin with exchange needs to be look into and make the right decision. Quote from: Rockstarguy on June 07, 2023, 07:31:02 AMI see no reason why anyone would prefer to choose exchange wallet to invest bitcoin with several ugly situation we have experienced sometimes ago. Exchange should only be consider to be a place for instant trade and not where to invest bitcoin  because it is risky and anything can happen to exchange. centralised wallet where bitcoin is stored it means the bitcoin also belongs to the exchange, in a case where it is not your key it is also not your coin. How people feel so   comfortable investing bitcoin with exchange needs to be look into and make the right decision. Quote from: EarnOnVictor on June 07, 2023, 07:43:44 AMPermit me to establish a point here. It might have been said that non-custodial wallets are the best...blah blah...which I do not doubt for safekeeping. However, many of you are disregarding the context of making more money with your coin, and by virtue of this neglecting the styles, goals and investment plans which must vary. Personally, my goal is to make money with Bitcoin and I plan to make it in both risky and less risky ways.I hold my coins which are of the less-risky class and are stored in my non-custodial wallet. While the ones I trade and invest regularly are stored with three exchanges.There is no way a non-custodial wallet can help me trade and invest in spots and futures. Also, there are coins that I only alternate between BTC and USDT without spot/future trading them to save the value from the bearish moments. This is basically about your plan and how best it works for you to maximize your income. Even if one exchange goes insolvent, the others are still there for me as they help me make more than what HODLing would have made possible.I think we all are saying the same thing and that means keeping high-value coins that we don't use often in a non-custodial wallet is excellent. For us who use a small portion of our coins for trading, investment, or paying for services, we can keep that in exchange for quick access.This will help people maximize keeping what they can lose in exchange. Sadly, even when some people know the risk, they will still go ahead to keep millions of dollars in exchange and cry when it gets blown away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Not your key not your BTC",
      "created_time": "June 07, 2023, 08:04:40 AM",
      "body": "Quote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges?Why you care? it's their money, let manage it themselves, even if lost they do not ask you to refund.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 07, 2023, 08:20:54 AM",
      "body": "Quote from: Not your key not your BTC on June 07, 2023, 08:04:40 AMQuote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges?Why you care? it's their money, let manage it themselves, even if lost they do not ask you to refund. Other than that, the news about the Atomic wallet hack has appeared on the forum a few times, but users, in one sense or another, pop this topic whenever drama can be created. Everyone has long known that keeping your assets on the stock exchange is not safe. How much we will discuss these topics, one can only guess, since the FTX echo still appears in various places.I agree with you, too, and I doubt the OP is really concerned that anyone is still holding their funds on exchanges. You can answer yes; there are many such people, and many understand all the risks for which they themselves will be responsible. Dodn't worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "June 07, 2023, 08:31:49 AM",
      "body": "Less than 5k is still a lot of money, if that's small to you then you are talking for yourself, I will never leave anything like 200$ on any crypto exchange because that's a lot of money to me and it's more than the minimum salary paid in my country, that's like four months of salaries combined. I don't leave my assess on any centralized exchanges but many people are still doing so, I am sure you are aware that SEC sued Binance and Coinbase, do you know that millions of funds have been moved out of these two exchanges since the past hours now? The update I got said that it's over 1bn now, though this is not verified yet.This showed that so many people still leave their funds on these centralized exchanges and I can't tell them not to because they understand the risk involved, everyone is aware of the FTX collapse,  that should have been the time that every investors rejects all CEX.so it's either people just trust CEX more than their wallets which makes them the stupid types or they believe that nothing can go wrong with Binance and Coinbase because they are the giant CEX in this crypto space, which is still stupid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "June 07, 2023, 08:33:26 AM",
      "body": "There will always be people who will use exchanges as a means of storage. Best we can do is lessen the numbers by spreading the word AKA education.My guess is some people don't know the weight of such action:1. Perhaps some of these people aren't informed enough; or2. They feel detached to horror stories because \"well, it didn't happen to me so-\"; or3. They forget easily - once things start to get comfortable again, they'll be lax again.Another thing worth mentioning is that there's always a good chance something will go wrong with your exchange while you're actively trading. The reality is it's all about mitigating risk with CEx and depending on what kind of trading you're aiming for, you may be stuck with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 07, 2023, 08:42:34 AM",
      "body": "Quote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges?There are people who are doing this. Because if nobody does this, all centralized exchanges would close their services.QuoteI think the best choice would be to move a higher value of funds to a hardware wallet while leaving a small amount that's less than 5K in an exchange.If you have $100,000, it is good and safe enough to store $5,000 on exchanges for trading.If you only have $5,000 and store it all on exchanges, it's bad and risky.The capital you can store on exchanges will depend on your total capital, your risky taste and your management on your capital safety. If we trade on centralized exchanges, we must have money there, big or small capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "June 07, 2023, 09:01:41 AM",
      "body": "Quote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges? I think the best choice would be to move a higher value of funds to a hardware wallet while leaving a small amount that's less than 5K in an exchange.Exchanges have proven time and time again that they can disappoint their users at any time. Let's not talk about the FTX issue. but for instance, Atomic Wallet just let its users' funds vanish into thin air a few days ago with no reasonable explanation.So, why would anyone in their right mind take the risk of storing your crypto on exchange? When it usually means that the exchange retains control (or 'custody') of your assets without giving you access to the private keys. Also, they can disappoint you at any time.Well simply because there are still traders out there, maybe day to day and that's why most of the time they still store their crypto in a central exchange. For sure they know the caveat of having it in a exchanges, and maybe doing everything in their power to secure their accounts. So there is risk involved and I understand what you are talking about.As in my case though, I used exchanges for my P2P trading, so the most money I left in an exchange is like $100. But then again a couple of days, I will have to trade it to get it the money in my local fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 07, 2023, 09:28:02 AM",
      "body": "Quote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges? I think the best choice would be to move a higher value of funds to a hardware wallet while leaving a small amount that's less than 5K in an exchange.Just a little amount of money one can afford to loose should be left on centralized exchanges, if you're conversant with what's going on with some of the reputable cryptocurrency exchanges like Binance and one other exchange suffering big issues with the government due to regulation policies, many of their investors were already taking their asset off them into a personal decentralized wallet.Quote from: CypherMonk on June 07, 2023, 07:10:50 AMExchanges have proven time and time again that they can disappoint their users at any time. Let's not talk about the FTX issue. but for instance, Atomic Wallet just let its users' funds vanish into thin air a few days ago with no reasonable explanation.All of them are thesame birds in different shades of colours, it's only their names that makes their difference, centralized exchanges will always have thesame rate of risk of loosing one's asset with them either through hacking, scam, or them releasing your private informations to get you tracked down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 07, 2023, 09:44:41 AM",
      "body": "Quote from: Not your key not your BTC on June 07, 2023, 08:04:40 AMQuote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges?Why you care? it's their money, let manage it themselves, even if lost they do not ask you to refund. You also forget one thing, it's a going to be an expensive lessons for them. They just really don't learn from the past, just like in this example:https://nypost.com/2021/12/20/mystery-of-crypto-ceo-who-died-taking-250-million-with-him/QuoteWhen the 30-year-old died — unexpectedly and mysteriously — in 2018, some $250 million worth of Canadian cash and cryptocurrency also went missing. Around 75,000 customers of Cotten’s QuadrigaCX crypto exchange suddenly lost fortunes they had earmarked for everything from tuition to retirement funds, life savings and mortgages.So that's it, gone are the money that they have work hard in their life in a sudden death of the owner of the crypto exchanges. And there are thousands of horror stories too, like the FTX collapse or exchanges doing rug pull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 07, 2023, 11:00:11 AM",
      "body": "Quote from: lucifur on June 07, 2023, 07:39:31 AMAs someone who doesn't really have a lot of crypto, I admit that I have been using and will continuously use exchange wallet. I find it convinient since I mostly transfer it and trade it. If I were to have a crypto worth $500 more tho, I wouldn't trust holding it in exchange.No body is actually saying that Exchanges should be avoided even the centralized ones. Because they somehow are the easiest of place people could trade there coins to fiat on, mostly people from the countries that cryptocurrency is not popular in or countries that it is banned to use in. The key thing avoid the ones that actually requires KYC because it defeats the privacy idea brought by cryptocurrency. The second thing which is the most important thing is not to leave off your funds on them except you are comfortable to loss that amount. As for a traders, mainly daily traders, it will be hard to take your coins off everyday to the wallet after trading as it will just be an unnecessary waste of transaction fee. But you leave some off it and maybe weekly take them off it. Or better still use multiple exchanges for your trade as such you have divided your funds into multiple exchanges and that could easily minimize the chances of losing them all if an exchanges got compromised or some sort of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "June 07, 2023, 11:14:19 AM",
      "body": "Quote from: Not your key not your BTC on June 07, 2023, 08:04:40 AMQuote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges?Why you care? it's their money, let manage it themselves, even if lost they do not ask you to refund. Exchange is just the same thing as investing in meme coins, they are both risky  but you can stop people from making use of them. If people are hodling their bitcoin in Exchange it is their risk and if anything happens they will bear the consequences by themselves. If an exchange get crashed now it won't stop everyone from making use of exchange.  Past experience should be enough to teach people on what to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "June 07, 2023, 11:18:33 AM",
      "body": "Quote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges? I think the best choice would be to move a higher value of funds to a hardware wallet while leaving a small amount that's less than 5K in an exchange.Well here in my country we have some web wallet app that can be also used as an exchange (Coins PH). While I did not encounter any scary issue, the recent wallet update made almost made my jaw drop as my funds in the original wallet suddenly all went to zero then I realized they're going to do a wallet upgrade like the usual improvement and stuff. Nothing was lost, but you get the idea and what I felt during that real life experience. We all know the usual \"not your keys, not your crypto\" sayings. You'll never know the feeling of it until you really experienced it, lmao.The caveat is just use these services when you're using what they offer like trading, paying bills (for the app I used, not sure if other exchanges do that lol), and the usual day-to-day transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "June 07, 2023, 11:20:21 AM",
      "body": "Quote from: CypherMonk on June 07, 2023, 07:10:50 AMDoes anyone here still stores their crypto in exchanges? I think the best choice would be to move a higher value of funds to a hardware wallet while leaving a small amount that's less than 5K in an exchange.Leaving a small amount in exchange will make no difference, you don't need to leave any amount in exchange unless you are trading with that amount. Less than 5k is huge if you are a casual trader, day traders usually trade with a higher amount of money and they leave huge amounts in exchanges. They always play with risk and if they are successful with their trades it pays off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 07, 2023, 11:54:53 AM",
      "body": "Quote from: CypherMonk on June 07, 2023, 07:10:50 AMwhile leaving a small amount that's less than 5K in an exchange.$5K is still a big number, a good hardware wallet only cost $100+with additional fee around $20. Atomic wallet isn't an exchange though, it's a non custodial wallet but closed source.There's always someone leave their money on a centralized exchange, there are a lot factors they do it, either they're a trader, ignorance or they just lazy to move to their non custodial wallet because they always think SAFU will protect them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "June 07, 2023, 12:21:21 PM",
      "body": "I have a few altcoins that are stored in some of the exchanges hoping for the price to increase and when it reaches the desired amount that I want, I just quickly sold it. I don't need to worry because mostly they are not gonna earn much from my altcoins if ever they decide to steal it since it's not a big amount of money and considering the trust for the exchanges we have nowadays, it's better not to put everything in there and get your hard wallet as soon as possible because that's the most recommended way to store your cryptocurrencies for safety and also you don't have to worry about exchanges getting hacked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}