{
  "id": "topic_5495214",
  "title": "legiteum",
  "author": "legiteum",
  "created_time": "May 03, 2024, 10:36:02 PM",
  "content": "This came up as a side discussion in another thread, and I thought it would be interesting as a top-level discussion here.The notion is this: although taking over 50% of the Bitcoin hashrate would be a practical impossibility for any private actor or even a small country, China, as a country, has at times hosted over 50% of Bitcoin's hashrate, and it's thus plausible they could make this happen again if they wanted to. And whomever controls over 50% of the hashrate can dictate the software in use, and/or dictate the contents of the blockchain. As the theory goes, if China wanted to wreak havoc on the world economy, or if it wanted to extract a ransom, or if it simply wanted to profit by inserting its own blocks, then... it could. They could do anything. Perhaps China could decide that Satoshi's blocks should be given away to charity. Maybe they change the architecture so that it worked better in China, or conformed to their \"laws\" or something.So this brings up questions:1. Is this technically possible? 2. What would be the technical implications of China doing this?3. What would be the geopolitical implications?4. What would this do the broader cryptocurrency sector?5. Have major governments e.g. the US and NATO countries ever (publicly) announced any contingency planning around this problem? Putting a $1.5T asset at risk is something that could rattle the entire world economy. This seems like something they would at least think through?Looking forward to people's thoughts...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5495214",
  "comments": [
    {
      "author": "legiteum",
      "created_time": "May 04, 2024, 04:20:55 PM",
      "body": "For further discussion, here's an old article talking about this possibility:https://www.investopedia.com/news/bitcoin-wont-win-worldwide-adoption-because-china-controls-it-ripple-ceo/Obviously the hashrate for China has changed, but my thesis here is that it definitely could happen...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 04, 2024, 04:59:30 PM",
      "body": "I wonder why you're even taking China into consideration on this because they will always have the reason to adopt their own CBDC and enforces their citizens to adopt the same as well, then cant raise support for the use of cryptocurrency, because its not what is going to make them regulate the economy as they wanted, while bitcoin is even a decentralized digital currency, i don't think any of these is possible to happen in the future with them because right from the onset, we already know the way they have always been fighting against the use of crypto within their country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 04, 2024, 05:11:26 PM",
      "body": "Quote from: legiteum on May 03, 2024, 10:36:02 PMSo this brings up questions:1. Is this technically possible? 2. What would be the technical implications of China doing this?3. What would be the geopolitical implications?4. What would this do the broader cryptocurrency sector?5. Have major governments e.g. the US and NATO countries ever (publicly) announced any contingency planning around this problem? Putting a $1.5T asset at risk is something that could rattle the entire world economy. This seems like something they would at least think through?1. Yeah, pretty simple if you're willing to spend enough.2. What technical \"implications\" it's a 51% attack, it happened before on a number of coins, we have the precedent3. Zero4. A big dive followed by a migration to the next best coin, and the revelation that the majority is interested in the returns now the coin5. You're overreacting, nobody would really give a damn, 1.5T in market cap doesn't mean 1.5T in wealth for the US, even now at least 70 billion out of those are locked in Satoshi's wallets, more are lost, a shitton is held by other people in other countries including China, as for rattling the world economy, common...Bitcoin lost 3 years ago 1 trillion in market cap and it wasn't the end of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "May 04, 2024, 05:16:37 PM",
      "body": "It’s definitely possible and knowing China, I know they will do everything to get it done especially if it is the way to get something they want (and they want a lot of things). I can see China doing this for political gain, how? That I am not sure but one thing’s for sure if China were to take control of 50% of bitcoin investors might lose some confidence on the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "May 04, 2024, 06:17:40 PM",
      "body": "Quote from: Aanuoluwatofunmi on May 04, 2024, 04:59:30 PMI wonder why you're even taking China into consideration on this because they will always have the reason to adopt their own CBDC and enforces their citizens to adopt the same as well, then cant raise support for the use of cryptocurrency, because its not what is going to make them regulate the economy as they wanted, while bitcoin is even a decentralized digital currency, i don't think any of these is possible to happen in the future with them because right from the onset, we already know the way they have always been fighting against the use of crypto within their country.Bitcoin is worth over one trillion dollars. China is a criminal regime that likes to steal things . They don't have to \"love\" Bitcoin in order to try to steal from it, or hold it hostage, etc.China's current policy with respect to Bitcoin is to forbid their banks from holding it as an asset on their balance sheets. If your plan was to screw around with Bitcoin, that's the... first thing you would do--get your country's banks out of the way of the damage.Quote from: stompix on May 04, 2024, 05:11:26 PM1. Yeah, pretty simple if you're willing to spend enough.2. What technical \"implications\" it's a 51% attack, it happened before on a number of coins, we have the precedent3. Zero4. A big dive followed by a migration to the next best coin, and the revelation that the majority is interested in the returns now the coin5. You're overreacting, nobody would really give a damn, 1.5T in market cap doesn't mean 1.5T in wealth for the US, even now at least 70 billion out of those are locked in Satoshi's wallets, more are lost, a shitton is held by other people in other countries including China, as for rattling the world economy, common...Bitcoin lost 3 years ago 1 trillion in market cap and it wasn't the end of the world.I pretty much agree with all of that. The point about this not being a major geopolitical event is well-taken: that's both a reason China would do this (because they could score a cool $1T in winnings from their crime) and also a reason they would not do this (if the effect would be negligible, then why even do it).So I agree that the actual affect on things wouldn't cause a major disruption, the \"terrorism effect\" could potentially give them some reason to do it (maybe in concert with a bunch of other things as a lead up to invading Taiwan).Quote from: kotajikikox on May 04, 2024, 05:16:37 PMIt’s definitely possible and knowing China, I know they will do everything to get it done especially if it is the way to get something they want (and they want a lot of things). I can see China doing this for political gain, how? That I am not sure but one thing’s for sure if China were to take control of 50% of bitcoin investors might lose some confidence on the coin.I get that, but they would too, and they'd probably have a careful plan about what they'd do in a careful sequence. For starters, they would probably work to hide the fact that they had control of a majority of servers. This wouldn't be very hard to do: they could have control of major US miners right now and we wouldn't necessarily know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 04, 2024, 09:23:42 PM",
      "body": "Quote from: legiteum on May 03, 2024, 10:36:02 PM Putting a $1.5T asset at risk is something that could rattle the entire world economy. This seems like something they would at least think through?The fact that Bitcoin has marketcap over $1T is not making it important to global economy. Was $1T actually invested in it? No, it's just the result of trading at high price multiplied by total supply. Bitcoin could crash to zero tomorrow and it won't affect the global economy because there's like 200-300 million people who own some Bitcoin, and only some percentage of them would be ruined financially if that happens.But don't worry about it, Bitcoin can't be taken over easily, because it's a global network of thousands of computers and mining has proof of work, which makes it very expensive to take over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "May 04, 2024, 09:27:49 PM",
      "body": "Quote from: hatshepsut93 on May 04, 2024, 09:23:42 PMBut don't worry about it, Bitcoin can't be taken over easily, because it's a global network of thousands of computers and mining has proof of work, which makes it very expensive to take over.While I agree that it wouldn't be some kind of global catastrophe, I think that in this thread at least, we've established that China absolutely could take control of Bitcoin if they wanted to...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "May 04, 2024, 09:48:36 PM",
      "body": "Quote from: legiteum on May 04, 2024, 09:27:49 PMQuote from: hatshepsut93 on May 04, 2024, 09:23:42 PMBut don't worry about it, Bitcoin can't be taken over easily, because it's a global network of thousands of computers and mining has proof of work, which makes it very expensive to take over.While I agree that it wouldn't be some kind of global catastrophe, I think that in this thread at least, we've established that China absolutely could take control of Bitcoin if they wanted to...China is more concerned about their money being used by their people. it will be more disastrous for their CBDC.i don't think they can take over Bitcoin, they may however have more than 50% but more countries will do the same if they have plans like this. BlackRock who is somehow investing in mining farms can also do the same. it's just a battle of hashrates. but won't it just end up having their own BTC fork and they will just be the only ones who will be using that forked coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "May 04, 2024, 11:20:14 PM",
      "body": "Quote from: hatshepsut93 on May 04, 2024, 09:23:42 PMBut don't worry about it, Bitcoin can't be taken over easily, because it's a global network of thousands of computers and mining has proof of work, which makes it very expensive to take over.Don't over work yourself because the tasks available are merely simple and easy for everyone to accomplish but most people wouldn't give such setting and always in for the promising projects. Bitcoin can be manipulated based on the price value of the system, secondly followed by whales and top companies. It's never appreciative to always been on the winning side and losing sides comes with different pattern. We're learning everyday and making crucial mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "graphite",
      "created_time": "May 04, 2024, 11:58:48 PM",
      "body": "Quote from: electronicash on May 04, 2024, 09:48:36 PMbut won't it just end up having their own BTC fork and they will just be the only ones who will be using that forked coins?If they are trying to destroy the network they would keep posting empty blocks and if the bitcoin nodes fork the chain then the attacker will redirect the hashing power to the forked chain to continue the attack. So if a 51% attack happens we'd have to wait for the attacker to stop, spin up more hash power or change the proof of work algorithm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "May 05, 2024, 02:26:40 AM",
      "body": "Quote from: graphite on May 04, 2024, 11:58:48 PMIf they are trying to destroy the network they would keep posting empty blocks and if the bitcoin nodes fork the chain then the attacker will redirect the hashing power to the forked chain to continue the attack. So if a 51% attack happens we'd have to wait for the attacker to stop, spin up more hash power or change the proof of work algorithm.How exactly would you know who the \"attacker\" is? Nodes are nodes...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "graphite",
      "created_time": "May 05, 2024, 02:39:06 AM",
      "body": "Quote from: legiteum on May 05, 2024, 02:26:40 AMHow exactly would you know who the \"attacker\" is? Nodes are nodes...In this case the nodes aren't the attacker they are the ones trying to save the network by forking it. The attacker would be who ever is posting empty blocks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "May 05, 2024, 03:23:32 AM",
      "body": "Could China (or similar) take control of Bitcoin? And my answer is Yes everyone can control of bitcoin if they had enough money and enough resources And if you talk about a country it definitely can do that, 51% attack is doable right? And then if you want to do price manipulation you can buy as much as bitcoin and then can be act as a whale. Tho this is just my opinion guys",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "May 05, 2024, 03:24:47 AM",
      "body": "They can't do that even if they go full dictator mode on people that are still using bitcoin in their country, they're also going to hijack a lot of networks to be able to do anything significant and it just so happens that most of them is spread throughout the world and there's no way that China would be able to conquer the world, they're a boy in a man's world when placed together with Russia and USA, they can't even make a decisive move and win against Taiwan. China is also falling apart economically and I don't think that they're going to see any point trying to control bitcoin because they're currently lacking the money and they're currently squeezing too much money from their citizens because their officials are risking having their lavish lifestyle being lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "graphite",
      "created_time": "May 05, 2024, 04:10:10 AM",
      "body": "Quote from: Maus0728 on May 05, 2024, 03:24:47 AMThey can't do that even if they go full dictator mode on people that are still using bitcoin in their country, they're also going to hijack a lot of networks to be able to do anything significant and it just so happens that most of them is spread throughout the world and there's no way that China would be able to conquer the world, they're a boy in a man's world when placed together with Russia and USA, they can't even make a decisive move and win against Taiwan. China is also falling apart economically and I don't think that they're going to see any point trying to control bitcoin because they're currently lacking the money and they're currently squeezing too much money from their citizens because their officials are risking having their lavish lifestyle being lost.It currently cost 32mil USD worth of power per day to 51% attack bitcoin based on the block reward of 200-250k. This is easily doable for china. The other hurdle for a 51% attack would be to get ahold of all the mining hardware needed but china basically has control of bitmain. so china could turn out all the asic miners they need for a cheap price compared to other countries. might only cost 2-3 billion. So yeah china could easily shut down bitcoin. They haven't yet because theres no need to. However if bitcoin was adopted by some NATO allies and NATO sanctions china for invading Taiwan then China would 100% shut down bitcoin in retaliation of NATO sanctions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 05, 2024, 04:59:59 AM",
      "body": "Quote from: legiteum on May 03, 2024, 10:36:02 PMChina, as a country, has at times hosted over 50% of Bitcoin's hashrate,This is not a very accurate statement.There were multiple mining pools that were inside China and a lot of hashrate (many of which was located outside China) connected to those pools. Pretty much the same thing is happening with pools in other countries like the situation that is growing in USA.That is a big distinction to make because in this case China did not and could not \"control\" that hashrate.QuoteAnd whomever controls over 50% of the hashrate can dictate the software in use, and/or dictate the contents of the blockchain.Not quite.With a high percentage of hashrate, one can perform certain attacks but they can not change the consensus rules (if that's what you mean by dictate the software in use). They can pull off 51% attacks to double spend but what would that achieve except kill Bitcoin?They also won't be able to attack Bitcoin for long in my opinion because such a move would bring on a lot of public outrage which could even lead to a hard fork changing the mining algorithm.QuoteAs the theory goes, if China wanted to wreak havoc on the world economy, or if it wanted to extract a ransom,Bitcoin is not big enough to have an impact on the world economy. Not to mention that if China wanted to do that, they would do it without needing something as small as Bitcoin. For example they could dump the US bonds and crash US economy and burn half the world's economy with that. Or simply stop exporting goods to certain countries including US and EU and crash their economy by causing hyperinflation,....Quoteor if it simply wanted to profit by inserting its own blocks,That logic is flawed in this context.If you have hashrate you \"insert\" your blocks and make profit. If you perform an attack, you'd crash the price and doesn't matter if you mine 100% of the blocks, you won't make any profit.QuotePerhaps China could decide that Satoshi's blocks should be given away to charity.That requires a hard fork which means it requires the entire network to accept that change and upgrade to a new software. Otherwise they'd create an altcoin and what they'd sped would not be Satoshi's coins.QuoteMaybe they change the architecture so that it worked better in China, or conformed to their \"laws\" or something.Similarly requires a hard fork.Quote2. What would be the technical implications of China doing this?Any kind of attack on Bitcoin would first crash its price. Depending on the attack it could be significant which means a lot of the goals you listed above would never be reached (like making profit).Quote3. What would be the geopolitical implications?Bitcoin is not big enough and is not weaved into the geopolitics to have such an impact.Quote4. What would this do the broader cryptocurrency sector?It would force developers to get off their fannies to start working on decentralizing mining more. Like introducing a much better protocol for mining pools. Quote5. Have major governments e.g. the US and NATO countries ever (publicly) announced any contingency planning around this problem? Putting a $1.5T asset at risk is something that could rattle the entire world economy. This seems like something they would at least think through?I'm more worried about US performing such attacks on Bitcoin than China doing so.For starters, China doesn't have any significant hashrate ever since they banned mining. And also China is not known for destabilizing global economy like this. In fact China prefers more stability in the world so that they can make more money.US regime on the other hand benefits from chaos, whether it is armed conflict that fills the pockets of the \"Lords of War\" or it is economic chaos where they can pull off their Ponzi scheme commonly known as the dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "May 05, 2024, 07:30:40 AM",
      "body": "Quote from: pooya87 on May 05, 2024, 04:59:59 AMThis is not a very accurate statement.There were multiple mining pools that were inside China and a lot of hashrate (many of which was located outside China) connected to those pools. Pretty much the same thing is happening with pools in other countries like the situation that is growing in USA.That is a big distinction to make because in this case China did not and could not \"control\" that hashrate.China is a dictatorship, and as such they would have central control over whatever hardware physically resides in the country. Of course my scenario also includes other ways China (or some other big country) could achieve this by taking over other servers throughout the world through force or bribery. As for the rest of your points, I think you're missing the fact that current holders of Bitcoin would be held hostage by somebody who took over the network. You say \"people won't accept it\" but people... want their investment back if it is threatened. I think of China (or whomever) did a hard fork, brokers and individuals would be incentivized financially to go along with lest they lose their investment. Don't get me wrong, I'm talking about a hypothetical scenario here, but clearly somebody who tried something like this would probably think through the ways that they would be able to get everybody on their side, even if reluctantly so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 05, 2024, 11:24:49 AM",
      "body": "Quote from: legiteum on May 04, 2024, 06:17:40 PMThe point about this not being a major geopolitical event is well-taken: that's both a reason China would do this (because they could score a cool $1T in winnings from their crime) and also a reason they would not do this (if the effect would be negligible, then why even do it).How would they score 1T, such an attack will only make losses, them having 51% of the mining power doesn't mean they own the coins, at most they can harm the value but there is no financial gain in this unless they double-spend.Quote from: hatshepsut93 on May 04, 2024, 09:23:42 PMThe fact that Bitcoin has marketcap over $1T is not making it important to global economy. Was $1T actually invested in it? No, it's just the result of trading at high price multiplied by total supply. Bitcoin could crash to zero tomorrow and it won't affect the global economy because there's like 200-300 million people who own some Bitcoin, and only some percentage of them would be ruined financially if that happens.I think this is something a lot miss when somebody is buying 100k worth of Btc that money are not really in some bitcoin fund, the actual money is in the pocket of the guy who has sold that BTC to you, and by the time you move your coins in cold storage they could have already been spent on hookers and Lambos, and funny enough, they moved not to the lambo but to the pocket of the guy that sold it, so the money is no longer there, it's just a price tag that somebody else might honor but again, it needs money for it.That is the reason if MS loses its coins you won't see the economy taking a 10 billion hit neither would a fall of NVIDIA cause a global recession on its own. Much of that 1.5t is in unrealized gains, money that was never there in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "May 05, 2024, 11:55:11 AM",
      "body": "I think that the ban on mining means that China doesn't want to take control of Bitcoin and doesn't care about it. Also, any country that tries to directly demonstrate its will and possibility of taking control of Bitcoin, will fail because in such case people will abandon it and move on to a different coin. Ask yourself, there are many cryptocurrencies and why is Bitcoin the most popular? That's because it's the most decentralized, the most adopted and most independent compared to other coins. If any country takes control of Bitcoin, then Bitcoin will lose the main value that makes it the most popular and valuable currency. If Bitcoin loses that value, then people will abandon it and move on to altcoins and the country will be left with control of coins that people don't want to use. That would be a waste of money and resources from any government, so that will never make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}