{
  "id": "topic_5431215",
  "title": "Bitcoin SV",
  "author": "Bitcoin SV",
  "created_time": "December 24, 2022, 11:44:02 AMLast edit: December 24, 2022, 11:56:47 AM by Bitcoin SV",
  "content": "At november 2022 FTX.COM exchange has been scammed but FTT Token of that scamish exchange still active on 57 exchangesCEO of FTX Sam Bankman-Fried admits to fraudhttps://www.youtube.com/watch?v=SCW89n9ooRYConsequently FTX is a scam and FTT is a scamish tokenP.S: It's very strange that scamish FTT token still not delisted on binance while our harmless coin has been delisted from binance. Probably CZ is an accomplice of FTX scam",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431215",
  "comments": [
    {
      "author": "noorman0",
      "created_time": "December 24, 2022, 01:05:42 PM",
      "body": "Quote from: Bitcoin SV on December 24, 2022, 11:44:02 AM-snip-P.S: It's very strange that scamish FTT token still not delisted on binance while our harmless coin has been delisted from binance. Probably CZ is an accomplice of FTX scamBinance removed all margin trading with FTT pairs and it wouldn't be much better to remove them entirely, possibly unavoidable user noise. CZ has promised to help the community as much as they can, you may have heard of CZ's plans to acquire FTX post-collapse. For now, at least people can liquidate whatever remains of their losses in spot trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin SV",
      "created_time": "December 24, 2022, 01:33:32 PM",
      "body": "Quote from: noorman0 on December 24, 2022, 01:05:42 PMBinance removed all margin trading with FTT pairsThis is not enoughWhen will be full delisting? FTT still active on coinmarketcap (CZ is owner of CMC)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "December 24, 2022, 02:53:00 PM",
      "body": "judging by the daily trading volume (let's assume that it is correct), they Binance has 6.4 million reasons not to throw him out. although I don't remember that Binance announced the delisting of FTT tokens from the platform. Only they will get out of holding this token.considering that this is the second topic that you have created on the same topic, not sure what exactly you want to achieve. maybe some kind of pressure on Binance & CMC to delist FTT?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "December 24, 2022, 03:12:15 PM",
      "body": "Everyone should remember that Binance has done the same with the Terra Luna scam where the tokens are still treatable with BUSD. So it’s probably the same as the FTT tokens, and also knowing that Binance has 5% of the total supply of it. OP it’s definitely hurt because bitcoin SV is nowhere near Binance but scam tokens are still listed. Am I right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 24, 2022, 04:28:22 PM",
      "body": "Quote from: Bitcoin SV on December 24, 2022, 11:44:02 AMP.S: It's very strange that scamish FTT token still not delisted on binance while our harmless coin has been delisted from binance. Probably CZ is an accomplice of FTX scamNothing strange about FTT still being listed on Binance because they probably still have bunch of that shitcoin that they have to dump. Not saying that this is the right thing to do, but that's just the way it is. And BSV is far from harmless as it may make newbies think that's the real Bitcoin. Quote from: noorman0 on December 24, 2022, 01:05:42 PMCZ has promised to help the community as much as they can, you may have heard of CZ's plans to acquire FTX post-collapse. For now, at least people can liquidate whatever remains of their losses in spot trading.First time I hear about CZ planning to take over FTX after everything is over, care to share some source? Unless you mean that short period (for like a day) but they soon gave upo when they realized what clusterfuck of situation FTX is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 24, 2022, 05:31:37 PM",
      "body": "Yes, the FTT coin is still listed on the exchange platforms, and Binance has only put a warning message when entering to trade the FTT coin that it is highly volatile and has a great risk so they do not take responsibility, and Binance is not the first platform that still has not delisted the FTT trading pairs, as there are more than 56 other platforms that did not delist FTT coin, and I do not know the real reason why they keep listing this bankrupt currency until now despite the collapse of the FTX platform and the theft of millions of dollars and huge losses for investors. It would have been better to delist FTT on all exchange platforms after all this bad news that happened to its team. Indeed, the central exchanges have incomprehensible and malicious intentions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "janggernaut",
      "created_time": "December 25, 2022, 02:14:20 AM",
      "body": "Quote from: noorman0 on December 24, 2022, 01:05:42 PMQuote from: Bitcoin SV on December 24, 2022, 11:44:02 AM-snip-P.S: It's very strange that scamish FTT token still not delisted on binance while our harmless coin has been delisted from binance. Probably CZ is an accomplice of FTX scamBinance removed all margin trading with FTT pairs and it wouldn't be much better to remove them entirely, possibly unavoidable user noise. CZ has promised to help the community as much as they can, you may have heard of CZ's plans to acquire FTX post-collapse. For now, at least people can liquidate whatever remains of their losses in spot trading.There is only 1 pair of FTT on binance atm, and its FTT/BUSD. Not sure about that, but the trading volume of FTT still huge even after so many cases from SBF. it seems they are trying their luck by buying FTT and hoping it can be rise from below to $22 again. Better to avoid buy this token anymore, as alameda can just dump their FTT token whenever they want",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin SV",
      "created_time": "December 25, 2022, 06:47:10 AM",
      "body": "FTX turned into a scam and has been closedThis FTT token is now not backed by anything. No one is responsible for anything, there is no emission of tokens, all volumes are drawn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "December 25, 2022, 03:26:58 PM",
      "body": "Quote from: Rikafip on December 24, 2022, 04:28:22 PM-snip-care to share some source? Sure, https://www.bloomberg.com/news/articles/2022-11-08/crypto-exchange-binance-to-buy-rival-ftx-com-terms-undisclosedHe also explained some of the chronology from his side in an interview at an event in my country.However, unfortunately the acquisition plan was ultimately cancelled",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 25, 2022, 03:34:29 PM",
      "body": "Quote from: noorman0 on December 25, 2022, 03:26:58 PMSure, https://www.bloomberg.com/news/articles/2022-11-08/crypto-exchange-binance-to-buy-rival-ftx-com-terms-undisclosedThat's an old news, and I mentioned in my previous post \"unless you mean that short period (for like a day) but they gave upon when they realized what clusterfuck of a situation FTX is\" and that's exactly what it was. Quote from: Bitcoin SV on December 25, 2022, 06:47:10 AMNo one is responsible for anything, there is no emission of tokens, all volumes are drawn.You just described like 99.99% of the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "December 26, 2022, 11:42:20 PM",
      "body": "Quote from: Bitcoin SV on December 25, 2022, 06:47:10 AMFTX turned into a scam and has been closedThis FTT token is now not backed by anything. No one is responsible for anything, there is no emission of tokens, all volumes are drawnSame goes with bitcoin SV. Not backed by anything and anyone, scam token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "December 26, 2022, 11:52:01 PM",
      "body": "Exchanges are probably allowing it to be traded so that people are still able to sell it. Once the volume drops enough, it will probably finally be de-listed. I agree that it is not right for the token to be sold though I do think people need an avenue out of the token. Ideally it should only be on decentralized exchanges. Having it listed on exchanges like Binance give it a false element of hope or trust to the new investor, from my perspective anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Riocasino",
      "created_time": "December 27, 2022, 01:34:06 AM",
      "body": "Lol the titlw nade me laugh.ike you revealed new thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "December 27, 2022, 03:57:03 AM",
      "body": "FTT is the same with BSV. Not backed by anything. The only difference is that your coin has been delisted on Binance while FTT doesn't. That hurts BSV holders right that's why you are posting threads like this .LUNA also scammed people, but they didn't get delisted on Binance. Correct me but I think the total trading volume of that coin in Binance also affects the decision whether they will delist it or not regardless of if it scammed people or not (which is kind of funny TBH).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}