{
  "id": "topic_5414966",
  "title": "SecretSociety",
  "author": "SecretSociety",
  "created_time": "September 26, 2022, 01:21:19 PMLast edit: September 26, 2022, 02:08:55 PM by SecretSociety",
  "content": "OG Dev launched the Secret Society coin at 1-2k mcap and promised a vision of a new kind of exchange which could revolutionize the DEX market. Initial liquidity was 100% burned and the Contract renounced + 0% tax.So from a Blockchain point of view, the project was kind of safe and an earlier scam was unlikely. Thus an incredible Community was formed and pushed the project hard. The Token reached 1.5 mm cap in only a few days.. the low liquidity was a reason for it and also a reason for the harsh collpase. Besides a Video where the original Dev was providing some coding which looked like a work for an exchange it looks like he wasnt able to provide more and sustain the high price. Due to the sharp rise the price was already falling, while the original dev most probably deceided to sell.Three independent Wallets sold for a huge amount of coins at a mcap of 300-500k, they bought at the start of the stealth launch, but not as one of the very first wallets who bought cheap. All these wallets had connections to other rugged projects, but no connection to the deployer Wallet. After that and during the night all Socials were deleted at once and the price tanked to 30k mcap. Some malicious community members created a second tg group, most probably for the reason to get a relief bounce and sell their stacks. During this time the Deployer wallet started buy back coins and burn them all i ntotal 7-8% which was about an invest of 1.2 ETH. Strange.. What happend after the bounce was that the price went back close to zero and there was for some time very less activity. But some of the strong community people still believed in the orignal vision and didnt want to let this project just drop. The inital pump and then dump lead to the fact that a lot of guys who bought very early at stealth launch prices left and no big wallet were invested in the coin for a cheap price. Also lot of people who invested at very high mcap just stayed and wont sell their bags for pennies.So in effect this whole pump and dump created by the old dev helped to have a much better distribution of the coins and devided the typical stalth launch hunters aka paper hands from the Diamond hands. The price never went under 15k mcap after the big fall and not colse to launch prices. Thus a community team formed who wanted to revive the coin. Some crypto veterans and also a Dev from the corporate world. The web3 decentralized Team was born and started working on their own vision by building on the old contract with the help of the old community which was still there.The RevivalThe new Team so far is all open for transparency and provide only a high quality of work. They don't promise unrealistic things which are a dream to have but not realizable, like the old Dev promised.During a short time of 2 Weeks they already come up with a new idea and roadmap and also talked about how they are planning to build it technically. The price is now slowly recovering from the 15k mcap local bottom and reached 200k mcap. During the rise there was a lot of additional liquidty provided and the communityfund even locked it for 1 year. The growth is much more organic and stable now compared to the first run.Community Fund added Liq and locked for 1y: https://etherscan.io/tx/0xd70ba0b69cfbc47760b1cdeccd107c0e9c7237befa58a4ae7fc0324b0648cc76800k $ Wallet added liq: https://etherscan.io/tx/0xf876bf6f9a4ec2ca173aabd8925163a0ba46140d544f65f8055935ed7e8d9ae56m $ Wallet bought 2% of the Supply. It rarly buying or selling anything: https://etherscan.io/address/0xd77ec325b2028afba55c1dfb4a8fe08a22c80550Roadmap/Progress Report The Revival of the Secret Society Secret Society will revolutionize DEX trading! For this purpose, a UI is being developed that uses a new form of visualization to easily provide information at a glance to the trader. (MVP)We will build a unique one-stop-shop solution for the DEX trading experience of all the decentralized finance users! Revolutionary new dashboard, guaranteed best prices, limit orders and more to follow!The future of crypto trading is now!Community Fund Wallet created ✅Buyback & Burn ✅   more to comeAdditional Liquidity locked 1y ✅ provide more LP as we grow Dev Video explaining MVP 09/22 Sticker 09/22 Update Dextools 10/22Website Upgrade 10/22 Dev Progress Update Video 10/22 Apply CG/CMC 10/22 or 11/22 Dev Progress Update Video 11/22 MVP launch 12/22 DAO/NFT  Q1/23 - Q2/23Extending MVP Q1/23 -onwardsWe are the Secret Society - Unstoppable. More secrets will be revealed soon. The Secret Society stands by its word. Although we are working in the background, we stand for honesty, clarity and kept promises.We let our actions speak for themselves! Join the Secret Society now!I think this project can make a real come back and even growth furhter. The qaultiy i saw from the Community team so far is amazing and their product idea looks interesting.As far as i know is a Website overwork planned for the next days and the main idea will be presented in a better way.I wish it success and then this whole project would an amazing web3 story, which tells people that the community is always the most important factor and if the community is able to come teogehr and build they even can bring a project back!Links:Societyswap.comSecretSocietyswap.iohttps://www.dextools.io/app/ether/pair-explorer/0x92F46887eE6681d1c7bB11CD2b8d464be4CefCd8https://t.me/SecretSocietyToken",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414966",
  "comments": [
    {
      "author": "Denis_neverDMfirst",
      "created_time": "September 26, 2022, 01:37:16 PM",
      "body": "I just wanted to add that I am the one who gave the idea to the Dex Aggregator. I am working for over 15 years in big corporates and VCs in the area of innovation, analysing startups on a daily basis.I joined the project because I saw the right people coming together to do something mindblowing.The people are willing to learn from each other and grow together. If i see something like this, i know it can work.This project might be small right now, but if the DEXA is working as planned, I believe it will revolutionize the crypto trading world like the first swap exchange in 2018 did it.Typical revivals tend to fail, but this one looks very promising.I hope you guys see this project as what it is: a BIG opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 26, 2022, 01:39:08 PM",
      "body": "Quote from: SecretSociety on September 26, 2022, 01:21:19 PMSo from a Blockchain point of view, the project was kind of safe and an earlier scam was unlikely. Thus an incredible Community was formed and pushed the project hard. The Token reached 1.5 mm cap in only a few days.. the low liquidity was a reason for it and also a reason for the harsh collpase. Is it just me that this sounds like the usual shitcoin pump and dump, to make some extra profit for \"devs\"? Forming a fake \"incredible\" community is not a big deal, just costs some bucks.don't get me wrong, but I don't see anything spectacular here as you claim. the biggest improvement is the development and upgrading of the new site and some dev's videos where they explain about upgrades.I would say that the swap is just an excuse for everything previously bad and now you are entering a new story on an old matter, but without discussing the previous failures. I've seen it several times already, and I don't know that it ever ended with satisfied investors.However, Good luck with this business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SecretSociety",
      "created_time": "September 26, 2022, 01:54:24 PM",
      "body": "The very least what the community is building is a Dex Aggragator based on 0X. This alone is more powerfull then 1inch as example, but its jsut the backend as far as i understand it. The MVP will be the UI and some features which are new to the market. Building a UI is nothing too big so there could be valid reasons to dont disclose the whole idea before its ready..From the quality i can see so far its very nice and thoughtfull. Much better than everything the old dev showed for his PnD. I was part of the fist run aswell and the Dev had an Indian accent (overlayed with some voice cahnging software), while the community people who buidling now are always online in the VC (4-5?) and they have all an european accent. It is always easy to guess without doing proper research and getting part of the community. For the short amount of time there was already a good amount of work provided. I like what i see and will stay to see how this will go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Denis_neverDMfirst",
      "created_time": "September 26, 2022, 02:03:11 PM",
      "body": "Quote from: examplens on September 26, 2022, 01:39:08 PMIs it just me that this sounds like the usual shitcoin pump and dump, to make some extra profit for \"devs\"? Forming a fake \"incredible\" community is not a big deal, just costs some bucks.You mean we are the same community before the scam and trying to doublescam the community? There are really people like this in our world?  Quote from: examplens on September 26, 2022, 01:39:08 PMI would say that the swap is just an excuse for everything previously bad and now you are entering a new story on an old matter, but without discussing the previous failures. We are discussing the previous failures, but they weren't ours - we just took over after the Dev left. I don't see any logic behind your reasoning, can understand though that you had some bad experiences.You can join our TG and talk to us in VC or in chat anytime you wish.We are serious and developing something really disruptive here.https://t.me/SecretSocietyToken",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}