{
  "id": "topic_5456528",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "June 16, 2023, 08:58:44 AM",
  "content": "На всякий случай, напомню, что никто (до сих пор) не хочет пересадить мой (личный) мозг на ваш собственный канал (форум или сайт)? Это так, чисто на всякий случай спрашиваю. В очередной раз хочу напомнить – что я мерзкая продажная и конченная сука, и готов писать свои посты в любом месте, где мне только согласятся адекватно  платить. А вот пока я совершенно бесплатно пишу вот это все прямо тут. Потому что данный форум – Лучшее место для бесплатного творчества. Поверьте мне – я уже перепроверил много мест до сих пор –за последние несколько лет. И осел (пригнездился) прямо тут внезапно, конкретно и окончательно.        Но вот если кто-то вдруг захочет переманить меня (эксклюзивно) на другой ресурс – готов рассмотреть любые предложения. Без обид, если что…        Итак. Как говорится – береги мозг смолоду. А жопу – береги постоянно и непринужденно! Защищай его(ее), предохраняй его(ее) и спасай его(ее) от вредных внешних воздействий! Не позволяй врагам взять, и тут же пересадить свой (мой) собственный мозг во враждебную (мне) почву (или сознание)! Так никак нельзя совсем конкретно поступать! Избегайте же этих действий!   Если вы всеж совершили ошибку, и допустили этот самый фейл, то читайте дальше. Ведь только то, что у Вас есть – это ваш собственный мозг. И только он, и никто больше, хоть  как-то так способен предохранить ваше сознание от окончательного разрушения.   Проблема в том, что уже однажды вдруг пересаженный мозг, уже невозможно будет пересадить назад. И время ни за что не остановит. Но пересадив ваш мозг,  еще идут старинные часы. И «пусть его ничто не остановит» (с) А. Пугачева, давным-давно была такая песня в тему. Незаслуженно забытая тема пересадок (мозга). Тема трансплантологии. Переселения части вашего сознания в новое вместилище. Как-то так. А ведь раньше об этом знали гораздо больше! Или подозревали, и скрывали...    Впрочем, вернемся к теме пересадок мозгов и прочего насущного.        Поверьте мне, что все, что вы хотите возжелать, или, хотя бы, как-то осуществить, определяется только степенью вашего воздействия на текущую сущность вашего пребывания в данной абстрактной концепции. Не более и не менее. Да, придется немного попотеть и разобраться в тенденции вашего бытия. Но  это ведь самое мелкое деяние, которое, вам, в итоге, предстоит осуществить. А потом будет все хорошо, и даже, можно сказать, отлично! Верьте мне, я ведь никогда не вру!         В данном конкретном глобальном случае остается только надеяться, что именно ваш конкретный мозг сможет хоть кого-то заинтересовать. Хотя бы кого-то. Хотя бы мозг. Либо ваш мозг, либо то, что вы сможете обратно предложить мне (нам) взамен. Как-то так, ИМХО!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456528",
  "comments": [
    {
      "author": "bonfire66",
      "created_time": "June 16, 2023, 11:45:53 AM",
      "body": "Все было бы хорошо, но есть тут весьма уважаемые старейшены клуба, которым нравятся мои высеры, и которые наоборот, приветствуют большую часть того, что я пишу. Я предлагаю сначала договориться с ними, и если они (в первую очередь модераторы) проголусуют за то, чтобы меня тут не было - я покину этот форум.А вот если наоборот, то покините данный форум вы. Навсегда. СОГЛАСНЫ?Да, я уже давно задекларировал, что да, бывает, иногда, я тут пишу в крайней стадии алкогольного опъянения. И рекомендую модераторам тут же удалять то, что я написал. Вообще без обид. А если они ЭТО не удаляют - значит, то, что я публикую, ни каким образом не входит в разрез с политикой форума. Но... я всеж продажная скотина. Готов заключить соглашение. За 0.1 биткоина  в месяц я готов НЕ ПОСТИТЬ ни сюда, никуда больше ни к один криптовалютный форум никаких постов. Как только 0.1 биткоина в месяц перестанут поступать на мой кошелек - я сразу тут же начну постить снова. Или Типа как-то так.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "June 16, 2023, 08:54:32 PM",
      "body": "Quote from: bonfire66 on June 16, 2023, 11:45:53 AMГотов заключить соглашение. За 0.1 биткоина  в месяц я готов НЕ ПОСТИТЬ ни сюда, никуда больше ни к один криптовалютный форум никаких постов. Как только 0.1 биткоина в месяц перестанут поступать на мой кошелек - я сразу тут же начну постить снова. Спасибо, посмеялся.Ещё у нас не запрещено новые аккаунты заводить, так что, если моральные принципы позволяют, то ничто не мешают тут зарегистрироваться как голубь, который сожрал мозг bonfire66 и теперь транслирует его мысли дальше.Никому доверять нельзя в общем.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "June 19, 2023, 09:41:34 AM",
      "body": "Мне кажется, что мой стиль изложения весьма узнаваем. И если, допустим, я нарушу договоренность, и буду постить с нового аккаунта - это легко можно будет устрановить и тут же забанить. Но я, естественно, этого делать не буду. Потому что у меня есть такое понятие, как честь  и совесть. В отличии от некоторых с этого форума...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "June 19, 2023, 11:01:28 AM",
      "body": "Я стараюсь как могу. Я уже договорился с модераторами, что при любом подозрении на херню - пусть они удалают мои посты.Ибо часто так бывает, что я пишу тут в измененном состоянии алкогольного опъянения, и не способен контролировать качество моих  высеров. Хотя обычно получается забавно. Иногда - не очень. Но таких случаев - меньшинство.Поэтому, я совершенно не буду ни капельки обижен, если мой какой-то конкретно зашкварный пост будет удален. У меня все сохранено, если что, для памяти потомков и для моего личного музея, который я скоро планирую создать в гараже у себя на даче. Заходите, если что..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borderlander",
      "created_time": "July 12, 2023, 09:53:07 AM",
      "body": "Прочитал, ничего не понял, перечитал и ничего не понял, ерунда мне кажется.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "July 12, 2023, 12:10:46 PM",
      "body": "Да не берите в Голову. Если вы пробовали читать Ницше, Шопенгауера и переписку Троцкого с Каутским, и ничего не поняли - это не порок. Это - нормально!Я тоже ничего не понял. Это был просто стеб. Шутка юмора. Если что - я тут на форуме играю роль местного сумасшедшего. И пока все идет успешно. Народ не врубается. Думает, что так на самом деле все и есть. Алкогольная абстракция постмодернистской абстиненции.Но понять дано не всем..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}