{
  "id": "topic_5418539",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "October 27, 2022, 04:56:13 PMLast edit: October 27, 2022, 05:18:57 PM by Davidvictorson",
  "content": "According to Merriam-Webster, a solopreneur is “one who organizes, manages, and assumes the risks of a business or enterprise without the help of a partner.” While an entrepreneur is one who organizes, manages, and assumes the risks of a business or enterprise without the help of a partner. I would consider most social media influencers on Tik-Tok, Instagram, Twitter etc as solopreneurs. In addition, Solopreneurs often run service-based businesses, like freelancing, consulting or web development. From my observations, we have seen the rise of solopreneurs in especially among Gen Z's in recent times. In fact it has been more satisfying watching these youngsters attain financial freedom earlier and quicker than it used to be. Currently so many countries all over the world are reporting high inflation rates and recession is starting to kick in. As a result, some businesses are closed-down while some other are hanging by the thread. However, we see some of these solopreneurs on the internet gain more followers, become brand ambassadors etc. My question is are solopreneurs especially social media influencers recession-proof?*Edited",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418539",
  "comments": [
    {
      "author": "Doan9269",
      "created_time": "October 27, 2022, 05:16:06 PM",
      "body": "Quote from: Davidvictorson on October 27, 2022, 04:56:13 PMAccording to Merriam-Webster, a solopreneur is “one who organizes, manages, and assumes the risks of a business or enterprise without the help of a partner.” While an entrepreneur is one who organizes, manages, and assumes the risks of a business or enterprise without the help of a partner.First of all i think you gave the same definition for both words here, try recheck pleaseQuote from: Davidvictorson on October 27, 2022, 04:56:13 PMMy question is are solopreneurs especially social media influencers recession-proof?When a recession set in every aspect in affected regardless of the professional fields they belong, come to think of it this way, if a man is hungry, will he be able to afford to pay for live subscription to matches or event ongoing, can he travel as he wishes, can he evennbe able to afford buying anything he feels like not to talk of giving to others in need, whenever there's increade in price then comes in inflation while recession is the advancement of inflation into bankruptcy, what you earn can't afford your living standard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "October 27, 2022, 05:37:17 PM",
      "body": "I was wondering you havee the same definition and discussing one aspect of the post meaning you are referring to Entrepreneurs and Solopreneurs as the same.Quote from: Davidvictorson on October 27, 2022, 04:56:13 PMMy question is are solopreneurs especially social media influencers recession-proof?To your question direct. No they are not recession proof. Do you know the reason they are not? It is simple. They are part of the society. This is number one side of it that they will feel a recession because they buy from the market. If they are having to get followership and not just sell anything to them, recession is very depressing and lack of money is serious with recession, the followers may lose touch following and contributing to their page due to insufficient fund to subscribe data to go online and they may beginning to lose the followership base. If they are getting some bonus from tiktok, YouTube or the others social media for having big followers, the bonus and produce begin to reduce. This is the effect of recession to them. If they selling something like idea, cancelling, consultation or some service rendering, the numbers patronage will also drop because followers not having enough money to feed. Recession will affect everyone like inflation but in different ways depending to how many income source you have. It is good to handle different source of living.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 27, 2022, 06:28:06 PM",
      "body": "Solopreneurs are not only not recession proof, they are more vulnerable to it than the average entrepreneur because of the lack of fundraising rounds.And actually, they are also more vulnerable to burnout than entrepreneurs because they carry all the responsibilities by themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "October 27, 2022, 06:51:20 PM",
      "body": "Quote from: Davidvictorson on October 27, 2022, 04:56:13 PMMy question is are solopreneurs especially social media influencers recession-proof?*EditedWe might assume that the art or occupation of solopreneurship is recession proof because most of them spend less or absolutely nothing to showcase their products or services. And they still receive huge sums from social media platforms, product promotion and endorsement. Some bloggers or comedians don’t need to spend so much money to write a blog or make a video but they still receive handsome rewards.But we must also note that the solopreneurship industry is also part of the nation's economy. During recession period they would have less endorsement or promotion deals because most companies would not be able to afford the cost. People mostly focus on their basic needs during inflation which might make these solopreneurs to have less views. Therefore, they are not recession-proof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "October 27, 2022, 07:26:50 PM",
      "body": "I was going to say we can create all kinds of hype words to describe situations, soloterprise? solopreneur, solocareer, really, didn't think it was important to do that. I'm on Upwork sometimes and other freelancer platforms, aren't all freelancers solopreneurs?Besides the point anyway.Industries can be recession-proof (gaming, I believe, one of them, trading is another), that doesn't protect workers from losing income or clients.I don't have numbers but influencers probably have a high rate of failure. Even McAfee, cryptofluencer kind at one point, ended up struggling to get work once the shitcoin fuzz died. And was apparently fighting bankruptcy because of all that crypto shilling he did -- his tens of millions of followers did not proof him against crypto winter recession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roslinpl",
      "created_time": "October 27, 2022, 08:32:14 PM",
      "body": "Kindly check your post again,you made the Without word for both Entrepreneurs and Soloprebeurs definition.After the corona,many people was fired from their job.So they become an entrepreneur and start to work on own with their investments.Some was gained and some loss everything.Bitcointalk had give them job from the bitcointalk Signature campaign and Bounty Programs.Because many don’t have few dollars to run their family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryu_Ar1",
      "created_time": "October 27, 2022, 08:54:49 PM",
      "body": "Solopreneurs have become crowded in the last few years because until now there have been lots of people who actually do things like this, because apart from the capital which is not too big, it can also be said that it is relatively not more difficult because they do it alone without any team turning their backs like his name.But basically being a solopreneur is actually more difficult in my opinion when compared to an entrepreneur because after all there are some striking differences, for example when an entrepreneur with this difficulty can still find other relationships from clients or people who help but a solopreneur is satisfied just by doing his job.As for the recession, it really depends on the Solopreneur himself, whether he can properly manage what he is doing or not because this is an important factor.Everyone can go through a recession, be it entrepreneurs or solopreneurs as long as they are aware of what they have to do to survive the conditions they will face by planning what they should do when a recession occurs and making tactics so that they don't get too big an impact during a recession occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "October 27, 2022, 10:04:29 PM",
      "body": "Quote from: Davidvictorson on October 27, 2022, 04:56:13 PM My question is are solopreneurs especially social media influencers recession-proof?Since the services rendered by solopreneurs do not require so many other factors that cannot be controlled, they can easily stay profiting even in recessive conditions. For entrepreneurs, it is a constant struggle to stay profiting after you have settled the other factors that contribute for the success of your entrepreneurship. Solopreneurs can do everything alone, hence their profit margin is higher than that of some entrepreneurs. They still feel the effect of the recession, but not in the same manner as entrepreneurs will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 28, 2022, 06:54:46 AM",
      "body": "Quote from: Queentoshi on October 27, 2022, 10:04:29 PMQuote from: Davidvictorson on October 27, 2022, 04:56:13 PM My question is are solopreneurs especially social media influencers recession-proof? Since the services rendered by solopreneurs do not require so many other factors that cannot be controlled, they can easily stay profiting even in recessive conditions.  I beg to differ on that notion of yours. Firstly, it's actually cool working as a soloprenuer cause you alone call the shots but remember, you've got to be your own cheerleader, pushing yourself when the going gets rough.  These social media influencers, since it's the case study here, tend to get hit hard by recession because let's look at it from this standpoint; when there are no brands asking for you to be their ambassador or what not, due to economic crunch and the like. When it comes to raking in the profits, you don't get to worry like the entrepreneur who has workers to pay but then, the bulk of the work is on you: how to remain marketable and sell your services. So I think soloprenuers get hit too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "October 28, 2022, 10:24:05 AM",
      "body": "No one can be recession-proof unless he/she is independent of the system that suffers the recession. It's an interconnected system like a human body. If the body is sick all the body parts suffer it together. However those who planned ahead of time would suffer less from the recession .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 28, 2022, 11:09:04 AM",
      "body": "Those solopreneurs that have started small eventually becomes big and they become entrepreneurs. With all of those collaborations, deals and partnerships, they can't do it all alone.That's why most of the influencers that I've seen, they've got people behind them working for them as it makes them more productive and that's why they won't stay being a solopreneur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 28, 2022, 03:37:52 PM",
      "body": "I doubt most influencers are managing themselves on their own. If you mean micro influencers then it might likely, in addition, the one that does not run behind an agency. A sure thing for an exception is macro influencers, based on my observation most of them are under the direction of management.Quote from: Davidvictorson on October 27, 2022, 04:56:13 PMHowever, we see some of these solopreneurs on the internet gain more followers, become brand ambassadors etc. My question is are solopreneurs especially social media influencers recession-proof?That's a small subset of influencers that we are judging about. We shouldn't judge the outlier among many influencers and do note that influencer only makes money from their followers who are undirectly becoming a key point of a company's marketing goals. If the mainstream purchasing power decreases, it is expected that a brand or company reduce their marketing budget, hence, some influencers are either getting paid less or getting their campaign revenue reduced. So, I don't see they are recession-proof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 28, 2022, 05:00:08 PM",
      "body": "Depends on what type of business you are willing to do. Just like OP said, if you are a tiktok influencer, you do not need a team of people helping you out, certainly not when starting out, but do not \"need\" them later on when you are famous neither, maaaaybe only need it if you are looking to grow exponentially later on.However, I know a friend who started in the 3d printing world and started printing b2b stuff for companies, and eventually he couldn't grow unless he hired some people and he hired 3 people to help him, one with packaging, one with organization of the work place (3d printers have many materials and such) and one with helping what he did exactly which was 3d printing. If you are in a work like that, you may need to become bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Akibzx",
      "created_time": "October 28, 2022, 07:16:31 PM",
      "body": "Quote from: Doan9269 on October 27, 2022, 05:16:06 PMQuote from: Davidvictorson on October 27, 2022, 04:56:13 PMAccording to Merriam-Webster, a solopreneur is “one who organizes, manages, and assumes the risks of a business or enterprise without the help of a partner.” While an entrepreneur is one who organizes, manages, and assumes the risks of a business or enterprise without the help of a partner.First of all i think you gave the same definition for both words here, try recheck pleaseQuote from: Davidvictorson on October 27, 2022, 04:56:13 PMMy question is are solopreneurs especially social media influencers recession-proof?When a recession set in every aspect in affected regardless of the professional fields they belong, come to think of it this way, if a man is hungry, will he be able to afford to pay for live subscription to matches or event ongoing, can he travel as he wishes, can he evennbe able to afford buying anything he feels like not to talk of giving to others in need, whenever there's increade in price then comes in inflation while recession is the advancement of inflation into bankruptcy, what you earn can't afford your living standard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "October 29, 2022, 01:57:47 AM",
      "body": "They can only be recession proof if they will continue to create new content. As the saying goes in the social media world, content is king.So with that, if they keep on showing the same and rehearse things to their followers then they will get tired of it and as a result they might not earn good money in tik-tok or other social medias.But if they keep on reinventing themselves with new stuff then maybe they can continue with it, start a new trend and obviously the money making machine will be on for as long as they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "October 29, 2022, 02:26:56 PM",
      "body": "Most people today are more interested in running a business individually or as a Solopreneur without involving many people but still being able to expand their business network in various ways.Business conducted through the Solopreneur route has many conveniences when the world provides various technological sophistications and this activity is very promising when the world's economic conditions are in trouble.No wonder young people from various countries choose to enter digital-based businesses or what are known as Influencers. They only need creative ideas in developing their business.Indirectly, we are also running Solopreneur activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 29, 2022, 04:22:56 PM",
      "body": "Since we are talking about the people who become famous via social media then its not a successful module, this can be used as a tool to make the own business or market something or partner with someone,etc. Soloprenuer concept is kind of quick hype which only last for a while so in the meantime we have to utilize it to maximum potential then build your career out of it, being as a social media influencer will not last long for most people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "October 29, 2022, 06:55:49 PM",
      "body": "Quote from: aylabadia05 on October 29, 2022, 02:26:56 PMNo wonder young people from various countries choose to enter digital-based businesses or what are known as Influencers. They only need creative ideas in developing their business.Indirectly, we are also running Solopreneur activities.Exactly these days because of the lack of job and the availability of social media, youth have become soloprenuers through their social media accounts. For example you are now seeing the number of YouTube videos increasing on a daily and the owners of such videos always beg for subscribing to their channels and turning on to see more videos. This is exactly an example of soloprenuers. Not only that, they get some benefit and award for having such account because it increases the popularity of the platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "October 30, 2022, 02:20:12 PM",
      "body": "Quote from: palle11 on October 29, 2022, 06:55:49 PMQuote from: aylabadia05 on October 29, 2022, 02:26:56 PMNo wonder young people from various countries choose to enter digital-based businesses or what are known as Influencers. They only need creative ideas in developing their business.Indirectly, we are also running Solopreneur activities.Exactly these days because of the lack of job and the availability of social media, youth have become soloprenuers through their social media accounts. For example you are now seeing the number of YouTube videos increasing on a daily and the owners of such videos always beg for subscribing to their channels and turning on to see more videos. This is exactly an example of soloprenuers. Not only that, they get some benefit and award for having such account because it increases the popularity of the platform.Apart from digital business, there are other examples that can fall into the Solopreneur category such as the Culinary business and many more that we cannot mention one by one here. What we need to understand is that choosing the path of business as a solopreneur and entrepreneur has advantages and disadvantages. There will always be risks along the way.However, in the midst of the country's economic situation being faced with inflation, Solopreneur is better than Entrepreneur to run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}