{
  "id": "topic_5437214",
  "title": "Beparanf",
  "author": "Beparanf",
  "created_time": "January 29, 2023, 01:14:29 PM",
  "content": "There’s a hype recently in our country about our Billiard legend Efren Bata Reyes dominating the One pocket tournament of Derby City. I want to support him but sadly most of the sportsbook that I’m using doesn’t have this kind of bet offer. Do you know where to bet on this sports? Btw anyone here watching this tournament? Efren is already 68 years but he is dominating even young prodigy and still undefeated. Watching him on this level gives me a goosebumps.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437214",
  "comments": [
    {
      "author": "YuginKadoya",
      "created_time": "January 29, 2023, 02:25:17 PM",
      "body": "^ Right now Pool betting is very very limited right now and I really don't know if there is Pool or Billiard betting online on the site this forum has provided, but I have checked on Stake and Sportsbet and there are no available Pool or Billiards bets but there are Snooker in Sportsbet, but not like billiards that all balls are the same colors and no numbers, But I have seen Pool games on 1xbet I think this site is more popular in the Philippines if you know it, they have live betting as well and you can watch the game live in their site aswell, and I think they also have an eSports Pool game that you can bet aswell, if there aren't any live pool or billiard games available,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "January 29, 2023, 03:04:34 PM",
      "body": "i may bet if there is an international tournament for it and Bata and his friends are still around. Bustamante I think is also aged already. there are new generations of billiard players in the country but they are not doing magic as Bata does. you can only be confident when they know they can deliver a winning streak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "January 29, 2023, 03:19:14 PM",
      "body": "Quote from: YuginKadoya on January 29, 2023, 02:25:17 PM^ Right now Pool betting is very very limited right now and I really don't know if there is Pool or Billiard betting online on the site this forum has provided, but I have checked on Stake and Sportsbet and there are no available Pool or Billiards bets but there are Snooker in Sportsbet, but not like billiards that all balls are the same colors and no numbers, But I have seen Pool games on 1xbet I think this site is more popular in the Philippines if you know it, they have live betting as well and you can watch the game live in their site aswell, and I think they also have an eSports Pool game that you can bet aswell, if there aren't any live pool or billiard games available, Casino sites for billiard games are very rare.  And I haven't seen any major casino sites launch betting for it. I am not in favor of having any slots for it on gambling sites as it is not yet a very popular game. But although I have not seen it on gambling sites, I have seen this game played as a bet offline in a few places. If I tell my story I have seen boys playing poll in my town with bets. But I want something on a gambling site where I can play the polls myself and earn real money.  As seen in the poll game to get fake coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "January 29, 2023, 03:34:09 PM",
      "body": "As others have said, billiards may be a rare instance in sports books, I haven't specifically tried looking it up so I'm rather ignorant whether the sportsbook I often use even has it or not. Quote from: Beparanf on January 29, 2023, 01:14:29 PMDo you know where to bet on this sports? Btw anyone here watching this tournament? Efren is already 68 years but he is dominating even young prodigy and still undefeated. Watching him on this level gives me a goosebumps.I've never really watched billiards live, but I have watched a lot of Efren's past matches, and his title of \"The Magician\" is in all honesty well deserved from the matches I watched. I might watch some of his recent tourneys with this reminder though, he's probably still the best Billiards player I've seen (and is probably the most acknowledged on as well).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "January 29, 2023, 04:12:55 PM",
      "body": "Quote from: YuginKadoya on January 29, 2023, 02:25:17 PM^ Right now Pool betting is very very limited right now and I really don't know if there is Pool or Billiard betting online on the site this forum has provided, but I have checked on Stake and Sportsbet and there are no available Pool or Billiards bets but there are Snooker in Sportsbet, but not like billiards that all balls are the same colors and no numbers, But I have seen Pool games on 1xbet I think this site is more popular in the Philippines if you know it, they have live betting as well and you can watch the game live in their site aswell, and I think they also have an eSports Pool game that you can bet aswell, if there aren't any live pool or billiard games available, 1xbet and Pnxbet are popular casino here but both connected to 1xbit which is why I’m avoiding this casino as much as possible. Yeah only snooker all I’m seeing that available on major casino but I’m surprised how billiard is not listed while it was very popular before.I just recently become aware about this sports after a long time since I watch efren during my childhood and I skipped watching after he became less active. I will try to browse more on bookies that offers this sports before the finals will happened later. I will keep this thread open for recommendation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "January 29, 2023, 04:24:12 PM",
      "body": "If it's a world tournament, then there probably are some lines on sportsbet.io or Stake. But if it's just some other minor tournament then you will have a hard time searching for any available lines that you can bet on for billiards. It's a pretty much popular sport but I don't know why not a lot of bookies are interested in catering it. Perhaps not a lot of interest on to it? But I doubt it. Its viewership can still be huge as a lot of people still follow the sport to this day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cydrix",
      "created_time": "January 29, 2023, 04:46:45 PM",
      "body": "Efren Bata is a legend from our country. I've been trying to bet on his every game but I don't know where to. Bata is getting old his gameplay should be betted on online casino. Most of the available sport on online casino are international and world cup which has more players but I've only seen football and basketball, billiard and also chess should be added to because strategic/mind games is better to put some bet. Hoping that online casino will expand their game types.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "January 29, 2023, 05:02:08 PM",
      "body": "Quote from: Beparanf on January 29, 2023, 01:14:29 PMThere’s a hype recently in our country about our Billiard legend Efren Bata Reyes dominating the One pocket tournament of Derby City. I want to support him but sadly most of the sportsbook that I’m using doesn’t have this kind of bet offer. Do you know where to bet on this sports? Btw anyone here watching this tournament? Efren is already 68 years but he is dominating even young prodigy and still undefeated. Watching him on this level gives me a goosebumps.He is still a legend and his skills haven't diminished, on the contrary, he aged like a fine win in this sports.Unfortunately, I'm not familiar what 'known' sports bookies covered this sports. So most probably we won't be able to bet on them.And if I'm not mistaken, he finished 3rd already, although he didn't won this tournament, but yeah, at this age, he can give those young players a run for their money at any billiard disciple, specially 8 and 9 ball.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 29, 2023, 05:14:10 PM",
      "body": "Quote from: dothebeats on January 29, 2023, 04:24:12 PMIf it's a world tournament, then there probably are some lines on sportsbet.io or Stake. But if it's just some other minor tournament then you will have a hard time searching for any available lines that you can bet on for billiards. It's a pretty much popular sport but I don't know why not a lot of bookies are interested in catering it. Perhaps not a lot of interest on to it? But I doubt it. Its viewership can still be huge as a lot of people still follow the sport to this day.Billiards is a sport that has very limited interest and not everyone can play this one sport because it is a sport that is a bit complicated and requires skill to be able to play well.I have seen an international tournament in billiards on a live stream on one of the streaming provider's applications.However, I have never once seen international or local billiard event betting on any gambling platform that I have entered.Maybe in the future billiards can become one of the sports that must be included in the list of bets in casinos because at every billiards event it is certain that many people make bets directly and on average they bet with money which can be said to be quite large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "January 29, 2023, 06:02:48 PM",
      "body": "Quote from: dothebeats on January 29, 2023, 04:24:12 PMIf it's a world tournament, then there probably are some lines on sportsbet.io or Stake. But if it's just some other minor tournament then you will have a hard time searching for any available lines that you can bet on for billiards. It's a pretty much popular sport but I don't know why not a lot of bookies are interested in catering it. Perhaps not a lot of interest on to it? But I doubt it. Its viewership can still be huge as a lot of people still follow the sport to this day.It's only say snooker on sportsbet the last time I checked and there are no games in line.So yeah, maybe snooker/billiard is not that popular as compare to other sports, but definitely the name of Bata Reyes is recognized in billiards and it's amazing to see him play and places in US tournaments at this age. And I wouldn't try even a sat to those obscure casino that might offer this kind of games though, risk is too high to get scam, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "January 29, 2023, 06:02:59 PM",
      "body": "Quote from: klidex on January 29, 2023, 05:14:10 PMQuote from: dothebeats on January 29, 2023, 04:24:12 PMIf it's a world tournament, then there probably are some lines on sportsbet.io or Stake. But if it's just some other minor tournament then you will have a hard time searching for any available lines that you can bet on for billiards. It's a pretty much popular sport but I don't know why not a lot of bookies are interested in catering it. Perhaps not a lot of interest on to it? But I doubt it. Its viewership can still be huge as a lot of people still follow the sport to this day.Billiards is a sport that has very limited interest and not everyone can play this one sport because it is a sport that is a bit complicated and requires skill to be able to play well.I have seen an international tournament in billiards on a live stream on one of the streaming provider's applications.However, I have never once seen international or local billiard event betting on any gambling platform that I have entered.Maybe in the future billiards can become one of the sports that must be included in the list of bets in casinos because at every billiards event it is certain that many people make bets directly and on average they bet with money which can be said to be quite large.This is hard to learn, you have to be drunk all the time in the pub and while playing pool   Besides controlling the cue ball where to go, you have to have the muscle control enough to push and prepare to where the next ball to shoot. Not a very interesting sport since you don't get to have physical movement all the time but requires a lot of brain power. I just watch Bata Reyes on youtube, the guy is called a magician. He can put all 9 balls once it's his turn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "January 29, 2023, 06:55:44 PM",
      "body": "Quote from: Beparanf on January 29, 2023, 01:14:29 PMThere’s a hype recently in our country about our Billiard legend Efren Bata Reyes dominating the One pocket tournament of Derby City. I want to support him but sadly most of the sportsbook that I’m using doesn’t have this kind of bet offer. Do you know where to bet on this sports? Btw anyone here watching this tournament? Efren is already 68 years but he is dominating even young prodigy and still undefeated. Watching him on this level gives me a goosebumps.I searched around and the majority of sportsbooks that I saw only have snooker. perhaps if the tournament is an international competition like the world pool championship, sportsbooks might offer odds for it. anyway, I saw this on Wikipedia, Efren Reyes holds the most title of winning the tournament the most times, holds the most consecutive wins and holds the title of the oldest pool player to win the Derby City Classic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "January 29, 2023, 07:17:06 PM",
      "body": "Quote from: acroman08 on January 29, 2023, 06:55:44 PMI searched around and the majority of sportsbooks that I saw only have snooker. perhaps if the tournament is an international competition like the world pool championship, sportsbooks might offer odds for it. anyway, I saw this on Wikipedia, Efren Reyes holds the most title of winning the tournament the most times, holds the most consecutive wins and holds the title of the oldest pool player to win the Derby City Classic.The traditional billiards played with 3 balls is almost extinct. People either play pool or snooker. There's an option to bet on pool at BetOnline and they accept bitcoin deposits, but AFAIK convert them to USD and that's the currency you actually bet with. If you decide that you give up looking for biliards and can as well bet on snooker, here's some options for you. https://www.bitcoingg.com/bitcoin-games/snooker/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "January 29, 2023, 07:51:03 PM",
      "body": "Quote from: Beparanf on January 29, 2023, 01:14:29 PMThere’s a hype recently in our country about our Billiard legend Efren Bata Reyes dominating the One pocket tournament of Derby City. I want to support him but sadly most of the sportsbook that I’m using doesn’t have this kind of bet offer. Do you know where to bet on this sports? Btw anyone here watching this tournament? Efren is already 68 years but he is dominating even young prodigy and still undefeated. Watching him on this level gives me a goosebumps.As it is said by the OP, \"in our country\" and not in the world so the game is limited to only OP's country. Because if the game is world wide definitely casinos or sportbooks would added to their games list for gamblers to see. You can still look for a local sport center to fine the game. Since the tournament is not world wide it will be very difficult for people to find out . And another I can also say is that, probably the tournament is not yet mass adopted. That is why many sportbooks have not added it to their systems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "January 29, 2023, 08:13:05 PM",
      "body": "Quote from: Mate2237 on January 29, 2023, 07:51:03 PMQuote from: Beparanf on January 29, 2023, 01:14:29 PMThere’s a hype recently in our country about our Billiard legend Efren Bata Reyes dominating the One pocket tournament of Derby City. I want to support him but sadly most of the sportsbook that I’m using doesn’t have this kind of bet offer. Do you know where to bet on this sports? Btw anyone here watching this tournament? Efren is already 68 years but he is dominating even young prodigy and still undefeated. Watching him on this level gives me a goosebumps.As it is said by the OP, \"in our country\" and not in the world so the game is limited to only OP's country. Because if the game is world wide definitely casinos or sportbooks would added to their games list for gamblers to see. You can still look for a local sport center to fine the game. just to clarify, the game is not limited to OP's country, the tournament is not even happening in OP's country. also, any nationality(as far as I know) can join the tournament. the OP is from the Philippines and when he said \"There’s a hype recently in our country\" it was because Efren \"Bata\" Reyes(a Filipino) is playing on Derby City Classic which is happening in the USA.Quote from: pixie85 on January 29, 2023, 07:17:06 PMThere's an option to bet on pool at BetOnline and they accept bitcoin deposits, but AFAIK convert them to USD and that's the currency you actually bet with. do they have odds for Derby City Classic tournament?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "January 29, 2023, 09:23:04 PM",
      "body": "Quote from: cydrix on January 29, 2023, 04:46:45 PMEfren Bata is a legend from our country. I've been trying to bet on his every game but I don't know where to. Bata is getting old his gameplay should be betted on online casino. Most of the available sport on online casino are international and world cup which has more players but I've only seen football and basketball, billiard and also chess should be added to because strategic/mind games is better to put some bet. Hoping that online casino will expand their game types.Read a lot of news recently about the game, I just missed to place a bet because I thought its just a local tournament. Anyway, if there’s a site that offers this then I might get interested as well, Billiard is still a good sport and many are still playing this, I’m just wondering why there’s no site that offers this regularly. Let’s see if there’s a good recommended site here for Billiard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 29, 2023, 09:36:03 PM",
      "body": "Quote from: Beparanf on January 29, 2023, 04:12:55 PMQuote from: YuginKadoya on January 29, 2023, 02:25:17 PM, But I have seen Pool games on 1xbet I think this site is more popular in the Philippines if you know it, they have live betting as well and you can watch the game live in their site aswell, and I think they also have an eSports Pool game that you can bet aswell, if there aren't any live pool or billiard games available, 1xbet and Pnxbet are popular casino here but both connected to 1xbit which is why I’m avoiding this casino as much as possible. Yeah only snooker all I’m seeing that available on major casino but I’m surprised how billiard is not listed while it was very popular before.Yeah, i've seen lots ads from 1xbet on filipino influencers being ignorant about the reputation of the site, everytime i watched a video promoting it i eventually skip the video or wont finish it at all.And yeah, despite of the sport existence looks like its not very popular on stream and esports betting sites for some reasons",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 29, 2023, 10:51:02 PM",
      "body": "Quote from: PX-Z on January 29, 2023, 09:36:03 PMYeah, i've seen lots ads from 1xbet on filipino influencers being ignorant about the reputation of the siteSo do I.I guess they're on it for the money and just have to advertise it without doing much background checking to what they've agreed to advertise with.Quote from: PX-Z on January 29, 2023, 09:36:03 PMeverytime i watched a video promoting it i eventually skip the video or wont finish it at all.I usually ignore them when I see it or they start to talk about it. It's just too worrisome that their followers are being encouraged to visit the site. Quote from: dothebeats on January 29, 2023, 04:24:12 PMIf it's a world tournament, then there probably are some lines on sportsbet.io or Stake. But if it's just some other minor tournament then you will have a hard time searching for any available lines that you can bet on for billiards. It's a pretty much popular sport but I don't know why not a lot of bookies are interested in catering it. Perhaps not a lot of interest on to it? But I doubt it. Its viewership can still be huge as a lot of people still follow the sport to this day.I reckon, there's still vast viewership on this sport but it seems that many bookies don't have it and I guess you're right that they'll only have it if it's a major tournament or a world titled match.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "January 29, 2023, 10:54:51 PM",
      "body": "Quote from: Mate2237 on January 29, 2023, 07:51:03 PMSince the tournament is not world wide it will be very difficult for people to find out . And another I can also say is that, probably the tournament is not yet mass adopted. That is why many sportbooks have not added it to their systems. The tournament is a global competition. Competitors came from different countries and it's just that PH Efren Reyes is making hype as he's still undefeated despite playing at the age of 68 years old and young ones can't even match him.As for the topic's question, maybe because billiards events especially global tournament isn't that regularly held, bookies not listing them in most cases.Different from snooker where there are regular games in the line. Just my thought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}