{
  "id": "topic_5449050",
  "title": "Hispo",
  "author": "Hispo",
  "created_time": "April 16, 2023, 04:34:02 PM",
  "content": "Good morning, everyone.Some days ago I received an email from Binance which I did not expect to see. It was about the expiration of several depositing addresses.The mail looked legit, so I decided to log in today and check if indeed those addresses had changed and it seems that Binance has changed my Ether address.I just wanted to create this thread to give you all the heads up, in case some of your missed this email and usually transact in those networks, so you will get your new addresses and wont have any trouble getting money. The message (in Spanish) suggests that those funds sent to the old address won't be credited automatically, so maybe there is a chance to recover any money sent accidentally to the old address if we contact customer support.That is all folks, check your accounts.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449050",
  "comments": [
    {
      "author": "salad daging",
      "created_time": "April 16, 2023, 04:59:18 PM",
      "body": "Thank you for letting me know and I just realized now because there wasn't any email notification I received after checking Gmail messages so I wasn't suspicious or didn't know about a change to a new wallet for ETH, although I didn't get a notification email but after I checked on the Binance app the address has changed to a new one.Quote from: Hispo on April 16, 2023, 04:34:02 PMso maybe there is a chance to recover any money sent accidentally to the old address if we contact customer support.That is all folks, check your accounts.  If some of them don't know and make a deposit to an old wallet it may take some time for it to recover for crediting, but it's important this information is so that many people realize that Binance has announced a revamped Ethereum Wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "April 16, 2023, 05:17:43 PM",
      "body": "Thanks for the heads up! There are certainly some people out there who are saving their deposit addresses in their wallet contacts or in some kind of notes app and completely relies on it. This is another reason why you should check with your exchange first Also, I'm guessing the old addresses are no longer accessible from the deposit page? I can't check this as I don't have a verifed account with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 16, 2023, 05:24:59 PM",
      "body": "Yea I've been seeing a lot of these on Facebook and Twitter, with people being skeptical if the email is legit(better skeptical than careless!). Fortunately no one is required to click any links on the email to perform the new wallet address generation so people can just go straight to their browser/app and check the update themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "April 16, 2023, 05:26:17 PM",
      "body": "Quote from: Potato Chips on April 16, 2023, 05:17:43 PMThanks for the heads up! There are certainly some people out there who are saving their deposit addresses in their wallet contacts or in some kind of notes app and completely relies on it. This is another reason why you should check with your exchange first Also, I'm guessing the old addresses are no longer accessible from the deposit page? I can't check this as I don't have a verifed account with them.I find it hard to believe that there would be any Binance account owner without an email address, unless they are using BinanceUS. This news is crucial for those who have saved their address on other wallet or exchange platforms. It is important for them to change their address as soon as possible because impulsive coin transfers can happen. Even with the messages, some may still fall victim to this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "April 16, 2023, 05:31:42 PM",
      "body": "Quote from: Hispo on April 16, 2023, 04:34:02 PMThe message (in Spanish) suggests that those funds sent to the old address won't be credited automatically,The English email says \"may not be\". Confused lol. It seems the old address is still valid but it may not get you an automatic deposit.Quote from: Potato Chips on April 16, 2023, 05:17:43 PMThere are certainly some people out there who are saving their deposit addresses in their wallet contacts or in some kind of notes app and completely relies on it. This is another reason why you should check with your exchange first I was almost doing that mistake yesterday. I was about to send $1500 USDT to the previous ERC20 deposit address as I have saved it in my wallet address book but I got busy for a while and didn't execute the transaction. Later, suddenly I remembered what the hell I was doing lol.QuoteAlso, I'm guessing the old addresses are no longer accessible from the deposit page? I can't check this as I don't have a verifed account with them.No, there are no more old addresses on the deposit page for the coins listed below along with any other ERC20 tokens.QuoteAMB, ARBITRUM, AVAXC, BSC, CELO, CHZ, CTXC, ETC, ETH, FTM, GLMR, KLAY, MATIC, MOVR, OPTIMISM, REI, RON, RSK, THETA, TOMO, VET, WAN, WTC, XDAI",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "April 16, 2023, 06:31:45 PM",
      "body": "This often happens to Binance they usually announce it on their latest news but right now it seems they didn't publicly post this on their blog or announcement but they directly contact customers through email.Here's the old announcement before below- https://www.binance.com/en/support/announcement/existing-deposit-addresses-memo-on-selected-networks-to-be-retired-c8d82e9c6c694be8b8d2cd88227ae1eaIt seems the reason why they often change deposit addresses is to upgrade their wallet to enhanced security.This is not good if you are using Binance as a wallet if you deal with someone outside and going to receive coins make sure that use a proper wallet that you fully control before you send it to Binance to reduce the risk in the future in case one of your friends accidentally sent coins to your old address you can recover it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "April 16, 2023, 06:38:01 PM",
      "body": "Quote from: Hispo on April 16, 2023, 04:34:02 PMThe message (in Spanish) suggests that those funds sent to the old address won't be credited automatically, so maybe there is a chance to recover any money sent accidentally to the old address if we contact customer support.According to the email that I saw today from Binance:Which means that you can go to history to manually do it and it would appear on your Binance account, but it is said that the manual credity can be removed at any time. Anyone that also contact the Binance customer care would be told to do it manually for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 16, 2023, 06:40:16 PM",
      "body": "I am glad you find this information to be useful. It would be a hassle if any of us needed to deposit because were planning to sell for FIAT urgently, just to find out we would need to deal with the costumer service to solve the problem with the crypto. I invite you to inform your family a friends that use Binance to check their deposit addressed and update them, since I am sure some people may be used to transfer directly from their wallets without checking each time on Binance.  Please notice that Binance has an anti-fishing feature which allows to tag the incoming mails with a code of your choice, so you can tell easier it is an official one.It may not be a silver bullet, because that information can leak, but still helps!I am also curious why Binance would need to do this, by the way.Quote from: Little Mouse on April 16, 2023, 05:31:42 PM-snip-It may be that my wording was not completely correct when came to translating what Binance wanted to express, but we all know that the point is to be careful from now on with our addresses, thanks for pointing it out anyways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 16, 2023, 07:33:47 PM",
      "body": "Quote from: Hispo on April 16, 2023, 06:40:16 PMI am also curious why Binance would need to do this, by the way.From research it seems to be a security move. They could be changing deposit addresses which they suspect have been compromised to more secure ones. They did something similar a year ago[1], this appears to be routine activity now to shore up the stability of their wallet infrastructure. Do not store your funds there regardless.[1] https://www.binance.com/en/support/announcement/existing-deposit-addresses-memo-on-selected-networks-to-be-retired-c8d82e9c6c694be8b8d2cd88227ae1ea- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "April 16, 2023, 08:39:08 PM",
      "body": "I just logged into my email account and can't see the notification email. So, thank you OP for notifying us about this important update!It looks like binance is changing old ethereum addresses with the new TSS (threshold signature scheme) addresses which are supposed to be more secure.Anyone interested to know more about TSS and how this new technology works can read this article:https://academy.binance.com/en/articles/threshold-signatures-explained",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "April 16, 2023, 08:56:07 PM",
      "body": "I also received this email but didn't really check it. If there is a chance that the tokens sent will not be credited, it's best to just use the new ones that they actually give to us. It's interesting to know what is the difference between the new and old though.Don't you think they will ask for a fee to recover the amount sent accidentally to the old address?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "April 16, 2023, 09:33:30 PM",
      "body": "Quote from: bittraffic on April 16, 2023, 08:56:07 PMDon't you think they will ask for a fee to recover the amount sent accidentally to the old address? This doesn't seem to be the case right now but I could see it changing when an ample amount of time has passed and binance had already disabled their \"click to credit\" function for deposits coming from old addresses since it will become an extra work for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "April 17, 2023, 07:21:14 AM",
      "body": "Quote from: un_rank on April 16, 2023, 07:33:47 PMFrom research it seems to be a security move. They could be changing deposit addresses which they suspect have been compromised to more secure ones.Yes, it can be for security move, but I do not know. Although not because Binance wallet has been compromised. If the exchange wallet or one of the exchange wallets is compromised, this would lead to loss by the exchange and what people will notice next would be from Binance saying the exchange has been hacked or people to suspect that.Quote from: bittraffic on April 16, 2023, 08:56:07 PMDon't you think they will ask for a fee to recover the amount sent accidentally to the old address? If you send coins to the old address, go to the history, you can manually make the crediting occur. I believe Binance would give enough time before that would no more function. But I do not know what would happen if the click to credit is no more there again on the history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 17, 2023, 01:43:13 PM",
      "body": "Thanks I just checked my emailUsually, I dont copy my address again when I transfer to Binance, but I will be doomed if I don't see the email today. But I think there is dozen of user who didnt notice this and what happen if they keep transferring to the old address",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 17, 2023, 03:21:28 PM",
      "body": "The problem is to wait for the assurance times that make the person lazy. Instead of going to the platform and verifying the address and sending money, it sends the money address saved in notepad.This reminded me of a scam, which is that the hacker creates an incorrect transaction with your wallet, and therefore when the last address you was copied, so you copy the hackers address without verifying it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "April 17, 2023, 07:28:30 PM",
      "body": "I received an email about changing addresses, but I didn't click any links to avoid falling for a spoof. Instead, I checked the app and verified that the email was legitimate. Binance updated the addresses in accordance with the mentioned chains, which is great because I was curious about creating a new address, and now I got what I expected. It's a good practice for centralized exchanges to frequently change addresses to protect users' privacy, despite already having provided KYC. Changing addresses from time to time doesn't hurt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "April 17, 2023, 11:36:20 PM",
      "body": "I checked now my email account linked to Binance but why I didn't receive a notification about the expiration address? By the way, OP thank you for the heads up but it seems I didn't use these altcoins mentioned in the announcement and it might be the reason I didn't receive an email.Lazy people who didn't check the sending address before making the transaction might face a terrible issue in the future.  However, I'm confused now, how long is the expiration of the address after getting renewed?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "April 18, 2023, 12:26:45 AM",
      "body": "Quote from: sheenshane on April 17, 2023, 11:36:20 PMHowever, I'm confused now, how long is the expiration of the address after getting renewed?Notice email states the expiration will be on May 13th but these old/retired addresses 'could' still work even after that as long as binance has not closed their \"click to credit\" function.Ideally, you shouldn't use your retired addresses anymore because it is best to not take your chances",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "April 18, 2023, 12:51:00 AM",
      "body": "Just logged in to my Binance account to check it and this is indeed true, had to generate a new address for deposits. I am not sure why they decided to do this however I am sure there will be many people who have their Binance Deposit Address on the Whitelist and use it to deposit to Binance creating a lot of support tickets in the upcoming weeks just because of this change.One piece of advice is to always copy and paste the address from exchange instead of copying it from your past history transactions and doing a test transaction of 5% will save you from losing your everything, I know many of you love to send all in one go to save your time but you will thank me later for this in the future.Also, just go to the website directly by typing the URL instead of clicking on any direct link even on this forum, you never know when somebody sold their account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}