{
  "id": "topic_5450174",
  "title": "humanvelocity",
  "author": "humanvelocity",
  "created_time": "April 25, 2023, 09:30:17 PM",
  "content": "Hello everyone, I’ve lately been trying alot of different ways to start making money but something in me tells me trading could be really fun and exciting to get into. Unfortunately I can’t afford to invest much right now so I’ve managed to invest around 20$ to get started. I’d really appreciate if you all could let me know if what i am doing is worth it or am I just wasting time? Kind regards,Human",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450174",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 25, 2023, 09:36:57 PM",
      "body": "You wanted to start big before? That would have be the biggest mistake that you will make. Just start with $20 and use it to learn. Know that trading is very risky and I can tell you that you should first see it as gambling until you know much about it when you are making money than losing money. I have been trading for 3 years now, the truth is you should not see it as a means of getting income, find other things that can make you money, see trading as fun.Always know that you should not trade with the amount of money that you can not afford to lose.Use very small amount like $10 to begin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "April 25, 2023, 09:47:52 PM",
      "body": "At first will encourage you to ensure you the preamble of trading before you venture into trading, because trading is not something will wake one day and start trade, you have to study the system very well before you kickoff trading to avoid loss, the aspect of starting trading with $20, i think it's a nice idea since you have not much experience in trading, so therefore using what you can afford to lose is preferable than using all your funds to trade when you don't know the rudiments or been acquainted with the system of trading. You can use a YouTube video to learn some of the obstacle that can hinder you not propagate in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ololajulo",
      "created_time": "April 25, 2023, 10:03:20 PM",
      "body": "In my own view, there are some nuances to consider. While there is certainly a high level of risk associated with cryptocurrency, making wise market decisions can lead to greater initial investments than just starting with $20. However, it's worth noting that many centralized exchanges have a minimum purchase requirement of $10 for any coin. Additionally, trading inevitably incurs transaction fees, which need to be factored in. Lastly, diversification is a key risk-management strategy in trading, and $20 may not be sufficient to address the challenges that lie ahead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "April 25, 2023, 10:27:11 PM",
      "body": "Quote from: humanvelocity on April 25, 2023, 09:30:17 PM I’d really appreciate if you all could let me know if what i am doing is worth it or am I just wasting time? if you have no trading skills it will be a waste of your time and money. there is nothing wrong if you want to earn money from trading, but you have to start by learning some techniques and also how to choose trading assets. if not your small capital will just disappear without you feeling any advantage.maybe if you are interested in investing, you can buy Bitcoins consistently with your $ 20 in a certain time interval. so you can have quite a lot of Bitcoin when you are strong enough to hold the asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "April 25, 2023, 10:41:16 PM",
      "body": "Quote from: humanvelocity on April 25, 2023, 09:30:17 PMI’ve lately been trying alot of different ways to start making money but something in me tells me trading could be really fun and exciting to get into. Unfortunately I can’t afford to invest much right now so I’ve managed to invest around 20$ to get started. I’d really appreciate if you all could let me know if what i am doing is worth it or am I just wasting time? I would say make sure you don't care about losing this $20. Starting with $20 is not enough but you will learn something new from this $20. Before you start trading with this $20, you can try trading to demo balance. There are a lot of trading platforms that give you a demo balance to start trading. Start with the demo balance and learn how it works. Trading is not as easy as it sounds. You could lose this $20 in no time if you do leverage trading. Spot trading is not much profitable. But, it's the safest way to start trading. You won't make much money by doing spot trading. But, as I said it's the safest way to start trading. Be aware that You could lose your $20. So, if you cannot afford to lose, do something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "April 25, 2023, 10:47:46 PM",
      "body": "Quote from: humanvelocity on April 25, 2023, 09:30:17 PMHello everyone, I’ve lately been trying alot of different ways to start making money but something in me tells me trading could be really fun and exciting to get into. Unfortunately I can’t afford to invest much right now so I’ve managed to invest around 20$ to get started. I’d really appreciate if you all could let me know if what i am doing is worth it or am I just wasting time? Trading will be more stressful than fun. Although I personally think that there is not much room for fun here either, because when you feel the satisfaction that you have traded well, mostly the fun relaxes you and you think that you are an expert. After that, much more expensive mistakes inevitably follow.to emphasize again, risk only what you can bear to lose. I would say, in your case $20 is okay. You will learn something, earn and lose some money, however, it can't be a significant amount of money. So, fun with 20 bucks is almost guaranteed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "April 25, 2023, 11:24:32 PM",
      "body": "you can just get used with the way of trading honestly and even using demo accounts you're already set.with trading, you can find some coin with low value so that you can earn more profit from it using your capital.of course trading bitcoin isn't your option mainly because the value was too high, that i doubt your money would suffice to make one trade but there are other coin that's just potentially as good and is low capital friendly.but the most important thing in trading is that one should know the current circumstance, how it is really works, how you can content against the market so that you can make profits, otherwise even with big capital it will just vanish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "April 25, 2023, 11:32:38 PM",
      "body": "My question is, are you ready for this?  I mean, are you knowledgeable enough when it comes to trading analysis whether it's technical or fundamental?Investing $20 is a good start, but it's important to manage your expectations and not expect too much too soon.  Trading requires patience, discipline, and a solid understanding of the market, and it can take time to develop these skills.  I repeat, don't expect too much, I rather choose to gain experience with that $20 than expecting a good profit.  Trading isn't all about profit, sometimes we need to spend to gain experience and learn about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "April 25, 2023, 11:48:13 PM",
      "body": "The spot market is not too risky to start with, it's good as you start learning to try trading indicators, risk management and train mentality. You will need a lot evaluation first to choose a few technicals (1 to 3) that give you good pofits. Start trading with less volatile assets like bitcoin.Once you start to consistently profit, you can move on to the riskier futures market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 25, 2023, 11:59:39 PM",
      "body": "Start trading with 20$ is enough for you to learn the basics of trading by doing it in real account rather than demo account. The capital you are putting is into trading is very small and the profits that you will gain from your winning trades will also be little, but you will build up the confidence that will help you later on. During the trading you will learn that how to manage the risks involved in trading. You'll also master you emotions during the process of trading as mastery over the emotions is the best quality that is present in a good trader. I would also recommend you to build up your own trading plan as that will help you better while taking trading decisions than following other's trading plans. The initial capital doesn't matter as long as you are able to trade with it. In your case $20 is enough to begin crypto trading, and you can easily trade with that amount without any restrictions. I believe that lowest amount to trade on a platform like Binance is $10, and if we keep that in mind you will be able to have one trade in initial stage and with some profits you will be able to have two trades at a time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "April 26, 2023, 03:17:30 AM",
      "body": "The amount of investment is never small. Congratulations on starting an investment with twenty dollars. As you get started you can gradually increase your investments. But don't expect much profit by starting investment with $20. Even if you don't get good profit from $20 capital, you can gain a lot of experience which will be useful in your future trading.  You can get a detailed idea about this if you keep investing.  Because the concept of trading is very important before trading. Best wishes to you. Good luck with your journey in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "April 26, 2023, 03:28:54 AM",
      "body": "Quote from: humanvelocity on April 25, 2023, 09:30:17 PMI’ve lately been trying alot of different ways to start making money but something in me tells me trading could be really fun and exciting to get into. Unfortunately I can’t afford to invest much right now so I’ve managed to invest around 20$ to get started. I’d really appreciate if you all could let me know if what i am doing is worth it or am I just wasting time? It is wasting time and your health, life happiness too.With only $20, you will lose a lot in trading fee (if the exchange you use for trading does not give user 0% trading fee). Trading is stressful and if you are newbie, you will spend lot of time to watch the computer screen, chart and it costs your time. Spending too much time on your chair, with your computer will make you more sedentary which is bad for your health.With $20, let's buy a coin and hold it till it becomes bigger. In addition, you can use your salary and saving (part of it) to accumulate more bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reizella28",
      "created_time": "April 26, 2023, 03:45:03 AM",
      "body": "There's no rules that you should start investing or trading with already a huge amount of money. Which is wrong, you have to gather more experience first by starting small. Be familiarize and examine all the details when you start. $20 is not bad, in this industry you cannot be sure if the money you have put would earn profits or not. That's why there's always a risk which $20 dollar is a good start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "April 26, 2023, 05:24:20 AM",
      "body": "Quote from: BlackBoss_ on April 26, 2023, 03:28:54 AMWith $20, let's buy a coin and hold it till it becomes bigger. In addition, The problem is you don't know which coin will be bigger in the future. If you talk about Bitcoin, it won't give high ROI in the short term. It will grow over time and I agree with the DCA method. If he can accumulate more Satoshi every week or month, this is the best thing he can do with his money. But, he is talking about Trading here. $20 is small to start with. But, he is a beginner and likely to lose this money. If he is lucky, he can multiply it. Everyone has to start at some point. Starting with $20 is not too bad. This is a learning process, sometimes you can't compare profit or loss with the learning process. Let's say I lose $20, but I learned many things and its value is more than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "April 26, 2023, 05:46:09 AM",
      "body": "Quote from: Pandu Geddon on April 25, 2023, 10:27:11 PMif you have no trading skills it will be a waste of your time and money. there is nothing wrong if you want to earn money from trading, but you have to start by learning some techniques and also how to choose trading assets. if not your small capital will just disappear without you feeling any advantage.maybe if you are interested in investing, you can buy Bitcoins consistently with your $ 20 in a certain time interval. so you can have quite a lot of Bitcoin when you are strong enough to hold the asset.Uh no? I have like the similar starting money like the OP's but I still learned a skill back when I day traded. Just by learning by theory and reading around the resources in the internet would not lead you so far in your learning experience, you would still need to apply those skills into practice. Let's say I watched Youtube videos from CryptoJack back in the days and I followed the trading tools used like RSI and Bollinger Band. I invested like $20 to those just like the OP to learn.The bottomline is that it is perfectly fine to start with $20 to learn trading and it ain't no wasting time unless you really just go straight up. I would do it over just virtual trading where I would not feel any shit if I encountered losses to that.Quote from: BlackBoss_ on April 26, 2023, 03:28:54 AMIt is wasting time and your health, life happiness too.With only $20, you will lose a lot in trading fee (if the exchange you use for trading does not give user 0% trading fee). Trading is stressful and if you are newbie, you will spend lot of time to watch the computer screen, chart and it costs your time. Spending too much time on your chair, with your computer will make you more sedentary which is bad for your health.With $20, let's buy a coin and hold it till it becomes bigger. In addition, you can use your salary and saving (part of it) to accumulate more bitcoins.You got a point, but if it is for learning trading, it is not. If I have not tried day trading before, I might be curious for the rest of my life on how does it feel to watch my computer screen for almost 8 hours continuously while trying to earn.I did stop trading since it is not for me and for my work habits. Trading is still stressful even for experienced and veterans considering the market is volatile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "April 26, 2023, 06:15:18 AM",
      "body": "I'm still not sure you have the best knowledge of trading because, in my opinion, the fact that you want to start with $20 indicates that you've never used the system before. I'd prefer you hold off and go learn how trading works because, even though $20 is not a lot of money, I think you'll feel bad at least a little bit if you lose it. In other words, if you're not informed about trading, you're jeopardizing your $20.  Make sure you have the knowledge before treading since if you don't, it will be a waste of time. Quote from: humanvelocity link=topic=5450174.msg62148947#msg62148947 date=1682458217Hello everyone,  something in me tells me trading could be really fun and exciting to get into.Trading is not enjoyable, even though you might think it is while you are making money. However, trust me, trading is stressful on its own. Additionally, you must treat your work seriously; as you indicated, having fun should not be permitted to distract you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 26, 2023, 06:33:28 AM",
      "body": "Quote from: BlackBoss_ on April 26, 2023, 03:28:54 AMQuote from: humanvelocity on April 25, 2023, 09:30:17 PMI’ve lately been trying alot of different ways to start making money but something in me tells me trading could be really fun and exciting to get into. Unfortunately I can’t afford to invest much right now so I’ve managed to invest around 20$ to get started. I’d really appreciate if you all could let me know if what i am doing is worth it or am I just wasting time? It is wasting time and your health, life happiness too.With only $20, you will lose a lot in trading fee (if the exchange you use for trading does not give user 0% trading fee). Trading is stressful and if you are newbie, you will spend lot of time to watch the computer screen, chart and it costs your time. Spending too much time on your chair, with your computer will make you more sedentary which is bad for your health.With $20, let's buy a coin and hold it till it becomes bigger. In addition, you can use your salary and saving (part of it) to accumulate more bitcoins.I'm glad someone mentioned how stressful trading is. I used to trade a few years ago, during the COVID-19 quarantine, with amounts ranging from $300 to $500 at a time. My profit was approximately 8% to 10%; I was mostly aiming to make $40–$60 per trade, depending on the occasion, of course. While I managed to earn some money, I found it extremely time-consuming, stressful, and life-deteriorating, especially if you're an anxious person like me.You could possibly start with $20 just for the experience; don't expect to make any significant profit, while there's a decent chance that you'll waste your money, like others already mentioned. If you're okay with that, go ahead. However, is it worth it? I'm not exactly sure. In my opinion, I believe you should try just to experience what's being mentioned in the thread, and you'll be the one to judge if it's worth it or not. Personally, I've stuck to holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "April 26, 2023, 07:39:25 AM",
      "body": "Quote from: Ultegra134 on April 26, 2023, 06:33:28 AM...You could possibly start with $20 just for the experience; don't expect to make any significant profit, while there's a decent chance that you'll waste your money, like others already mentioned. If you're okay with that, go ahead. However, is it worth it? I'm not exactly sure. In my opinion, I believe you should try just to experience what's being mentioned in the thread, and you'll be the one to judge if it's worth it or not. Personally, I've stuck to holding.If he doesn't try, he'll never know if trading is for him or not. And $20 is good as any other amount, people should always start with the amount of money they can afford to lose. We must also know how to try something, and how to check the markers before jumping into an unfamiliar. Rushing blindly into the unknown is dangerous.And of course, it's worth it. Experience is essential, trying and learning about new stuff is important. Holding is good, but trading is also interesting, and some people are doing pretty well. The point is that OP won't know if trading is for him or not if he doesn't try it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DevilSlayer",
      "created_time": "April 26, 2023, 07:57:00 AM",
      "body": "I also started with small amount of money when I first made an investment on trading, for me what I did is good because I immediately burnt my trading account because of my poor risk management. I also advice beginners to start small just for them to be familiarise to the exchange that they are using, to experience trading during volatile time and also to experience what is the feeling when buying and selling certain cryptocurrency. I'm against on investing huge amount of money on their 1st investment because it can be considered as gambling especially if you do not have enough knowledge, background regarding trading cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}