{
  "id": "topic_5421444",
  "title": "stakecomisscam",
  "author": "stakecomisscam",
  "created_time": "November 16, 2022, 06:31:18 PM",
  "content": "HiI made deposit 11k xrp to my stake account. When I make deposit they blocked my account. They want I provide ID, selfie and proof of address. I provide all documents more times. 5 times I provide all documents, everytime they back to Level 1 verification. They hold deposit 2 months, they write me first is multiple accounts, after that they want I verify account, I send them all documents many times.I contact owner from Stake.com Mladen Vuckovic (Instagram profile @mvuckovic91), he write me, he know for my problem, but cant help. He say me will provide me support for my case, but nobody answer me. For now I contact askgamblers and Serbian Ministry of finance and authority body. Dont bet more on stakeCompany from Serbia is owner from Stake.comUlica Cara Dušana 66, 37240 TrstenikMebit d.o.o.+381 37 201014Mladen Vuckovic is owner, Edward Craven and Bijan Tehrani are co-owner with MladenThey write account is suspend, after that they want more documents and now they blocked me on live support chatSTAKE IS SCAM! They stole me deposit. I provide all proofs herehttps://i.ibb.co/884tyPK/Screenshot-20221116-175603-Instagram.jpghttps://i.ibb.co/qdwq64p/Screenshot-20221116-175610-Instagram.jpghttps://i.ibb.co/59TtDqy/20221116-190308.jpghttps://i.ibb.co/Wkm22VM/Screenshot-20221116-175615-Instagram.jpghttps://i.ibb.co/SB2ZVvN/Screenshot-20221116-175622-Instagram.jpghttps://i.ibb.co/hWshqDv/Screenshot-20221108-090333-Gallery.jpghttps://i.ibb.co/PYVknZ2/stake-1.pnghttps://i.ibb.co/XWqJxT3/stake-2.pnghttps://i.ibb.co/VDRFmdm/stake.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421444",
  "comments": [
    {
      "author": "stakecomisscam",
      "created_time": "November 16, 2022, 10:32:37 PM",
      "body": "Finally proof where stole deposithttps://i.ibb.co/kSCFrC8/stake-3.pnghttps://i.ibb.co/sjTrgVH/stake-4.pnghttps://i.ibb.co/SXTT2p6/stake-5.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 16, 2022, 10:33:47 PM",
      "body": "Wrong section for this scam accusation, we've got the proper section for it which is the  Scam Accusations .And as you move this thread there, follow the Scam Report Format (Use it to make scam reports properly).Quote from: stakecomisscam on November 16, 2022, 06:31:18 PMI contact owner from Stake.com Mladen Vuckovic (Instagram profile @mvuckovic91), Are you sure that this is the owner's IG profile? Upon searching, it appears to be this profile(@mladenv91): https://www.instagram.com/mladenv91/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "November 16, 2022, 10:47:14 PM",
      "body": "Quote from: stakecomisscam on November 16, 2022, 10:32:37 PMFinally proof where stole deposit^I don't see proof of deposit, it is all about the conversations which I don't understand because it is not the English language. If you have a deposit transaction proof much better than what is shown to your account, like crypto or fiat transaction deposit.Have you posted this on their ANN thread? Because I think you are dealing with the wrong person, not on Stake.com.They have a good reputation here and I don't know if they will let ruin it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stakecomisscam",
      "created_time": "November 16, 2022, 10:54:38 PM",
      "body": "Quote from: DoublerHunter on November 16, 2022, 10:47:14 PMQuote from: stakecomisscam on November 16, 2022, 10:32:37 PMFinally proof where stole deposit^I don't see proof of deposit, it is all about the conversations which I don't understand because it is not the English language. If you have a deposit transaction proof much better than what is shown to your account, like crypto or fiat transaction deposit.Have you posted this on their ANN thread? Because I think you are dealing with the wrong person, not on Stake.com.They have a good reputation here and I don't know if they will let ruin it.https://i.ibb.co/RSZfQXr/Screenshot-20221108-090159-Binance.jpgProof of deposit.Mladen Vuckovic is real owner from Stake.com he is from Serbia. I write him directly. They stole a lot of money many clients all world. Ann thread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "November 16, 2022, 11:28:24 PM",
      "body": "Quote from: stakecomisscam on November 16, 2022, 10:54:38 PMAnn thread?You can find the official Stake.com ANN (announcement) thread here: https://bitcointalk.org/index.php?topic=2072589.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PastyKyle",
      "created_time": "November 17, 2022, 04:13:06 AM",
      "body": "Send me a DM I can help you further",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "November 17, 2022, 04:18:00 AM",
      "body": "Quote from: PastyKyle on November 17, 2022, 04:13:06 AMSend me a DM I can help you furtherWhy you work at stake.com ? Or you have any connections with them? You also charge a commission? And yea ofc you Will charge the commission upfront and then block the client (here the OP). Never fall for such traps and scams. OP be aware.OP from your case, it purely seems like you have multi accounts, for which they blocked your account. And the accounts connected before, have already abused the casino, for which they have blocked your account with balance. Just request them to return your deposit and move on. That’s the best thing possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SweetL0u",
      "created_time": "November 17, 2022, 04:46:27 AM",
      "body": "Not enough information, where is even the deposit. Such bold accusation, and typing in CAP does not make your statement true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PastyKyle",
      "created_time": "November 17, 2022, 04:58:13 AM",
      "body": "Why would I ask for any amount of money, I might have a solution for him that can help, I've been in the casino space for a while now and I know where casinos can cross a line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "November 17, 2022, 05:33:08 AMLast edit: November 17, 2022, 06:07:05 AM by LDL",
      "body": "First of all I will give you a suggestion that you posted your post in a wrong place.  You can move your post on Scams Auctions thread. https://bitcointalk.org/index.php?board=83.0Also, your account may have been permanently banned due to some of your mistakes.  In particular, there are some trusted sites in which multiple accounts are permanently banned.  Moreover, Stake.com is an important gambling and casino site.  They spend millions of dollars every year on their site promotion.  In particular, they spend millions of dollars every year on football and various advertisements.  A small error on your part can't cause such a big site to do bad publicity.  You can review stake.com's annual performance to see how big a trusted side they are.stake.com  promoted their site on watford (England Premier League) FC on 2020-2021.Watford FC official jersey.Everton FC official jersey (2022-2023)Since Stake.com spends a lot of dollars on promotion every year, they don't want to damage their trusted side by scamming a few dollars from users like you.They running bitcointalk signature campaign since more than 103 weeks  (15/11/2022)...See: https://bitcointalk.org/index.php?topic=5400828.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SweetL0u",
      "created_time": "November 17, 2022, 07:53:22 AM",
      "body": "Honestly this thread should be locked/delete and the name of the thread change. No proof, and a new user. This could even be an other crypto casino trying to ruin Stake's reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blawpaw",
      "created_time": "November 17, 2022, 08:18:12 AM",
      "body": "cmon man, Stake is a serious company. If they are asking your for verification and the process is not finishing it means that there is something wrong withthe documents you are providing.Besides, since you've deposited that kind of amount it is normal for them to request ID as they need to knmow the origins of the funds due to compliance issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 17, 2022, 08:35:27 AM",
      "body": "Quote from: SweetL0u on November 17, 2022, 07:53:22 AMHonestly this thread should be locked/delete and the name of the thread change. No proof, and a new user. This could even be an other crypto casino trying to ruin Stake's reputation.I don't want to make a lot of comments and make accusations. I think this is part of the competition between fellow casinos, there will always be something like this, believe me  Quote from: Blawpaw on November 17, 2022, 08:18:12 AMcmon man, Stake is a serious company. If they are asking your for verification and the process is not finishing it means that there is something wrong withthe documents you are providing.Besides, since you've deposited that kind of amount it is normal for them to request ID as they need to knmow the origins of the funds due to compliance issues.there will always be a lot of threads like this every week, I think not only stake.com maybe there are other sites that will be accused of fraud, even though they are only asked to read the casino regulations before making a large deposit for example completing the documents correctly and not making multiple accounts let alone cheat",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stakecomisscam",
      "created_time": "November 17, 2022, 08:43:25 AM",
      "body": "What mean if somebody new on this forum, that is not good?. I contact Watford and Everton for my case, that provide scam company. I have all proofs about my case.I know many members they stole money. Now they send I provide fake ID, very bad explanation from Stake.com. I provide them all my documents over 5 times. I write them can video verification, but they say everytime other explanation. Yesterday they write me, they dont withdraw me. Can any casino steal your deposit?A major class action lawsuit is brewing against stake.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 17, 2022, 08:53:34 AM",
      "body": "Quote from: PastyKyle on November 17, 2022, 04:13:06 AMSend me a DM I can help you furtherBe sure to check the trust rating of this user he is good at manipulation that could invalidate your claim, don't entertain messages that promise to help you, be open with your issue, move this thread to the scam section, and pm the representative of Stake, as much as possible do not use harsh words yet, unless they deny you of your winning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "November 17, 2022, 09:04:07 AM",
      "body": "OP do the following:contact @Stunna and explains all your problem, show you proof and she can help you solve your problem, if you are right I believe that the casino will make a decision in your favor, but if you are wrong the casino will make a decision in favor of their TOS. you don't lose anything by contacting her, on this issue of contacting the teams they sponsor I think it's something you have to think about a lot, if you are wrong and they are right you can be sued by them for slander and defamation, in that case it will be you who can go to jail or pay a fine to them. Is it really worth going down this path? are you really clean on this story to go this far with it? these teams have legal advisors who can ask you a lot of questions and if you are wrong you will get hurtQuote from: PastyKyle on November 17, 2022, 04:13:06 AMSend me a DM I can help you furtheryou can't help OP because you're not a casino employee, how could you help OP when you're not a casino employee? I hope OP doesn't make the mistake of looking for you. this is a subject where only people who work in the casino can see this case and give some answer to what is happening, and in this forum there is already @Stunna who is who people who have problems with the casino can contact",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "November 17, 2022, 09:39:38 AM",
      "body": "Quote from: PastyKyle on November 17, 2022, 04:13:06 AMSend me a DM I can help you furtherWell how do you help him? are you connected to Stake?I'm not taking sides here, but in years of being in this community, seldom this a big crypto casino will stake their reputation for such a amount of money.Maybe there is something that their fraud division see, like a red flag in your account or from the source of money that's why they are asking you for a KYC.Best of luck though and hope that you can resolved your issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "November 17, 2022, 09:51:17 AM",
      "body": "Quote from: stakecomisscam on November 16, 2022, 10:32:37 PMFinally proof where stole depositQuoteDue to repeated breach of Stake's Term Of Service regarding multi-accounting, all functionality on your account has been removed.You will not be able to use Stake in any capacity, including to place bets and any transactions.Any future accounts that are created that are linked back to this account, or any other account, will receive the same restrictions.RegardsStakeI'm not here to defend anyone but just to explain.after I read from the picture above it seems you have a problem with multiple accounts. and what i know is that Stake.com has a great team to research multi account issues. so it is likely that you are suspected of having more than one account.and I suggest you to contact Stunna I think he can help you to solve all this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 17, 2022, 02:10:52 PM",
      "body": "Quote from: len01 on November 17, 2022, 09:51:17 AMQuote from: stakecomisscam on November 16, 2022, 10:32:37 PMFinally proof where stole depositQuoteDue to repeated breach of Stake's Term Of Service regarding multi-accounting, all functionality on your account has been removed.You will not be able to use Stake in any capacity, including to place bets and any transactions.Any future accounts that are created that are linked back to this account, or any other account, will receive the same restrictions.RegardsStakeI'm not here to defend anyone but just to explain.after I read from the picture above it seems you have a problem with multiple accounts. and what i know is that Stake.com has a great team to research multi account issues. so it is likely that you are suspected of having more than one account.and I suggest you to contact Stunna I think he can help you to solve all thisI think everyone also understands that no one will side with the wrong place, of course, we think again that Stake is a big casino company, what does 11k Xrp mean for them, I know actually this problem can be solved as long as it's done in a good way and the OP doesn't breaking the rules too, I think @Stunna can help to solve the problem if indeed the answers from other Stake teams don't satisfy the OP, I also see the OP has made a post in the ANN Stake thread and haven't received an answer, try again with the method above, hopefully that way it works and the problem can be solved immediately, BTW the OP username looks unfit for use if in the end the OP problem can be solved later",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}