{
  "id": "topic_5423026",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "November 24, 2022, 09:25:11 PM",
  "content": "En ünlü ürünü metamask olan Consensys şirketi bugün kullanıcılara attığı mail ile gizlilik politikasında değişikliklere gittiğini duyurdu. Kripto kullanıcıları için facia niteliğinde olan yeni maddeler aşağıdaki gibi;Kişisel bilgileriniz ( Ad-Soyad, doğum tarihi, cinsiyet v.b.)İletişim bilgileriniz (Telefon, e posta, email adresi)Kullanıcı adlarınız, ŞifrelerinizFinansal bilgilerinizİşlem bilgilerinizCüzdan adreslerinizBanka hesap numaralarınız v.b.ve çok daha fazlası...Kısaca demek istiyorlar ki gizliliğinizin tecavüze uğramasını istiyorsanız, bütün bilgilerinizi depolamamızı istiyorsanız bizi kullanın. Bundan kurtulmanın çeşitli yolları var. En iyi yolu kendi Node'unuzu oluşturmak. Alternatif en iyi yol ise infura (custom RPC) yerine Eden RPC gibi özel node'ları kullanmak. *Kaynak: https://consensys.net/privacy-policy/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423026",
  "comments": [
    {
      "author": "wolwoo",
      "created_time": "November 24, 2022, 09:30:42 PM",
      "body": "way aq borsaya kyc yaparken istemiyor bu kadarQuoteve çok daha fazlası...cinsel eğilimleri falan mı soruyor  ayak fetişistiyse olmuyormuş",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "December 02, 2022, 09:22:30 PM",
      "body": "Bu durumun regülatörler kaynaklı zorlamalar sonucu olduğunu düşünüyorum (ya da öyle düşünmek istiyorum), ekosistemin bu konuda de en tutarlı şirketlerinden birisinin birdenbire bu kadar çok şeyi merak edip depolamak istemesi bana mantıklı gelmiyor. Çünkü talepler yenilir, yutulur cinsten değil.@Bthd  Eden veya benzeri alternatiflerin getirisi/götürüsü ne olur, çok uğraşmadan kısa bilgilendirme yapabilir misin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "December 02, 2022, 10:01:48 PM",
      "body": "Quote from: bobita on December 02, 2022, 09:22:30 PMBu durumun regülatörler kaynaklı zorlamalar sonucu olduğunu düşünüyorum (ya da öyle düşünmek istiyorum), ekosistemin bu konuda de en tutarlı şirketlerinden birisinin birdenbire bu kadar çok şeyi merak edip depolamak istemesi bana mantıklı gelmiyor. Çünkü talepler yenilir, yutulur cinsten değil.@Bthd  Eden veya benzeri alternatiflerin getirisi/götürüsü ne olur, çok uğraşmadan kısa bilgilendirme yapabilir misin?İnfura ile aynı götürü ip adresiniz dahil olmak üzere gizliliğiniz ihlal edilebilir, zaten bir çoğu verileri depoluyor. Verilerin paylaşılmayacağını söyleseler bile güvenmek durumundasınız kendi node'unuzu çalıştırdığınızda ise kimseye güvenmeniz gerekmez. Chainlist RPC'lerin güncel durumlarını paylaşıyor ama tabiki büyük kısmı kendi beyanlarına göre. Yada bir node isterse sizi veya  dilediği herhangi bir kişinin işlemlerini sansürleyebilir yine kendi node'unuzu kurduğunuzda bu olasılık ortadan kalkar. Bu ihtimal normal kullanıcı için pek büyük olmasa da her zaman var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "December 03, 2022, 10:37:49 AM",
      "body": "Local olarak rpc sunucusu çalıştırıp performansını deneyen varmı? Bu işlerin sonu gelecek gibi durmuyor 2tb SSD alıp kendimiz localdr calistirmaliyiz. Birde gorseldeki gecikme bana mı fazla geliyor?  Kendi nodumuzu kurduğumuzda acaba gecikme ne durumdadır? Kaç mbpslik bir internet bizi bu konuda en one işleri tasir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "December 03, 2022, 12:43:46 PM",
      "body": "Bu iş mininge dönüp astarı yüzünden pahalıya gelmez mi? Bir cihaz ayıracaksın ve 7x24 çalıştıracaksın, bildiğim kadarıyla nodelar kapatılmaz diye bir kural yok ama bu sefer her kapatıp açtığında senkronize olmasını sağlayacaksın ve bu her şeyden önce zaman kaybettirecek.Fikir olarak kendi nodeuma sahip olmak cazip geliyor ama mantıken (yorum yapıyorum ama bu konuyla ilgili bilgimin yetersiz olduğu şerhini de koyarak yazıyorum) uygulanabilirliğinden emin değilim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "December 05, 2022, 06:40:56 AM",
      "body": "Quote from: bobita on December 03, 2022, 12:43:46 PMBu iş mininge dönüp astarı yüzünden pahalıya gelmez mi? Bir cihaz ayıracaksın ve 7x24 çalıştıracaksın, bildiğim kadarıyla nodelar kapatılmaz diye bir kural yok ama bu sefer her kapatıp açtığında senkronize olmasını sağlayacaksın ve bu her şeyden önce zaman kaybettirecek.Fikir olarak kendi nodeuma sahip olmak cazip geliyor ama mantıken (yorum yapıyorum ama bu konuyla ilgili bilgimin yetersiz olduğu şerhini de koyarak yazıyorum) uygulanabilirliğinden emin değilim.Elimde zaten 7/24 çalışan pc mevcut sadece bir tane daha ssd takarım.  Elinizde günümüz koşullarına uygun bir bilgisayar varken bir node kurabilir yanına birkaç tanede testnet çalıştırsınınz hem bedava çalıştırmış olmazsınız hemde çalıştırdığınızdan üç beş birşey kazanırsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fanatikhamsi",
      "created_time": "December 05, 2022, 06:51:54 AM",
      "body": "Borsaları geçtim, Eth blockchaini dahil tüm dapp ları tamamen merkezidir. En bariz örneği blockchainden banlanan birçok adres, transaction var.  Yani anonymous olacağım diye çok kasmayın. Tek merkezi de eth foundation ve projeleridir. Bir dakikada herşeyinizi sıfırlayabilirler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}