{
  "id": "topic_5422571",
  "title": "sabotag3x",
  "author": "sabotag3x",
  "created_time": "November 22, 2022, 11:21:25 AMLast edit: July 23, 2023, 05:09:42 PM by sabotag3x",
  "content": "Caso alguém goste de NFTs ou tenha curiosidade, o Reddit está dando NFTs da copa do mundo..Basta ir em Style avatar e selecionar a seleção que deseja.. pelo que vi são 200.000 NFTs de cada país, fora EUA e \"Earth\" que têm 1 milhão cada.A cunhagem é feita em poucos minutos na Polygon, peguei esse abaixo.. bem legal a experiência.  Acredito que não vá valer nada, mas sempre tem algum maluco que vai comprar todos para ter a coleção completa..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422571",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "November 22, 2022, 11:41:35 AM",
      "body": "Quote from: sabotag3x on November 22, 2022, 11:21:25 AMAcredito que não vá valer nada, mas sempre tem algum maluco que vai comprar todos para ter a coleção completa..Sim, quando o mercado voltar a ficar em alta, haverá de certeza quem queira obter a coleção.Qual é o link?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "November 22, 2022, 12:22:06 PMLast edit: July 23, 2023, 05:09:33 PM by sabotag3x",
      "body": "Quote from: joker_josue on November 22, 2022, 11:41:35 AMQual é o link?Tem que logar no Reddit (reddit.com) e ir em Style avatardepois escolher qual você quer:Não sei se há restrição para contas novas.. caso você não tenha uma.edit: o que é esse galo/galinha que botaram no NFT de Portugal @joker_josue? alguma parte da história do país?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 22, 2022, 02:13:13 PM",
      "body": "Maneiro sabotag3x. Vou fazer o meu e postar aqui tb. Eu curto muito o reddit,  boas fontes de informação lá.Só fico com o pé meio atrás nesses NFTs de rede social, pq é uma invasão grande na privacidade,  quando vc linka seu endereço eth a sua conta. Mas, é só não colocar no seu main address né.Quote from: sabotag3x on November 22, 2022, 12:22:06 PMedit: o que é esse galo/galinha que botaram no NFT de Portugal @joker_josue? alguma parte da história do país?Galo é o símbolo de Portugal. Não é por causa do azeite   https://www.eurodicas.com.br/galo-de-barcelos/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 22, 2022, 02:36:50 PM",
      "body": "Quote from: bitmover on November 22, 2022, 02:13:13 PMQuote from: sabotag3x on November 22, 2022, 12:22:06 PMedit: o que é esse galo/galinha que botaram no NFT de Portugal @joker_josue? alguma parte da história do país?Galo é o símbolo de Portugal. Não é por causa do azeite   https://www.eurodicas.com.br/galo-de-barcelos/O bitmover já respondeu. É um dos símbolos de Portugal pelo o mundo.Existem outros, mas esse é uns dos mais reconhecidos no estrangeiro.Achei interessante em falar do azeite. Realmente não tem nada haver, mas o Azeite Galo é dos mais conhecidos e melhores aceite de Portugal.Qualquer das formas não é o NFT mais bonito das seleções. Acho que o galo, não esta lá muito bem integrado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 20, 2022, 02:24:07 PMLast edit: July 23, 2023, 05:09:07 PM by sabotag3x",
      "body": "Aos interessados.. Reddit está dando mais um NFT, ganhei este hoje:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 20, 2022, 08:34:27 PM",
      "body": "Quote from: sabotag3x on December 20, 2022, 02:24:07 PMAos interessados.. Reddit está dando mais um NFT, ganhei este hoje:Tem pego esses NFTs com frequência? Dá para vender e conseguir algum troco que for, ou é só por que \"de graça até injeção na testa\"?  Sempre fico com preguiça de ficar pegando essas coisas (i.e todo dia tem jogo gratuito na Epic Games e acho muito trabalho ficar lembrando de abrir e pegar, todo santo dia).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 21, 2022, 03:06:11 AMLast edit: July 23, 2023, 05:09:01 PM by sabotag3x",
      "body": "Quote from: TryNinja on December 20, 2022, 08:34:27 PMTem pego esses NFTs com frequência? Dá para vender e conseguir algum troco que for, ou é só por que \"de graça até injeção na testa\"?  Sempre fico com preguiça de ficar pegando essas coisas (i.e todo dia tem jogo gratuito na Epic Games e acho muito trabalho ficar lembrando de abrir e pegar, todo santo dia).Segundo que pego.. baseado no número ali (#45783), acho difícil ganhar dinheiro  mas tem alguns mais raros dessa coleção 2022 recap (exemplo)o legal é que dá para mesclar partes de NFTs diferentes, então isso pode ajudar na demanda (dá para comprar até 6 para montar 1)Os da copa do mundo estão saindo por 0,09 MATIC (uns 30 centavos).. esse que peguei agora está 5,6 MATIC (R$ 23) na OpenSea (https://opensea.io/collection/reddit-recap-2022-x-reddit-collectible-avatars)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 21, 2022, 03:26:06 AM",
      "body": "Quote from: sabotag3x on December 21, 2022, 03:06:11 AMOs da copa do mundo estão saindo por 0,09 MATIC (uns 30 centavos).. esse que peguei agora está 5,6 MATIC (R$ 23) na OpenSea (https://opensea.io/collection/reddit-recap-2022-x-reddit-collectible-avatars)Como que pega esse último? Pela primeira vez na vida entrei no novo reddit (que negócio lagado e horroroso ), fui lá no \"Criar avatar\" e peguei o da Copa do Mundo. Esse Coin Collectors eu não achei.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 21, 2022, 03:37:31 AMLast edit: July 23, 2023, 05:08:55 PM by sabotag3x",
      "body": "Quote from: TryNinja on December 21, 2022, 03:26:06 AMComo que pega esse último? Pela primeira vez na vida entrei no novo reddit (que negócio lagado e horroroso ), fui lá no \"Criar avatar\" e peguei o da Copa do Mundo. Esse Coin Collectors eu não achei.Estão liberando aos poucos (não sei quais os critérios).. o link é esse: https://www.reddit.com/avatar/claimimagem de onde aparece para dar claim:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 21, 2022, 03:49:06 AM",
      "body": "Quote from: sabotag3x on December 21, 2022, 03:37:31 AMEstão liberando aos poucos (não sei quais os critérios)..QuoteUnfortunately you aren't selected to receive this collection at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 21, 2022, 10:24:52 AM",
      "body": "Quote from: TryNinja on December 21, 2022, 03:49:06 AMQuoteUnfortunately you aren't selected to receive this collection at this time.Eles toparam que você é um oportunista e bloquearam o acesso a esta coleção.  Depois, esperam que você gaste coins a comprar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "December 26, 2022, 02:33:33 PM",
      "body": "Acabei de ver essa matéria no site da livecoins e lembrei desse tópico:FonteDetalhe é que você pode comprar os NFTs sem ter que usar criptos necessariamente, então possivelmente, mesmo que não sabe usar criptos ou não quer, também consegue comprar e usar os NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 26, 2022, 04:04:01 PM",
      "body": "Quote from: rdluffy on December 26, 2022, 02:33:33 PMDetalhe é que você pode comprar os NFTs sem ter que usar criptos necessariamente, então possivelmente, mesmo que não sabe usar criptos ou não quer, também consegue comprar e usar os NFTs.É esse o facto que faz com que a eles estejam a ter tanto sucesso.A pessoa conseguir adquirir esses NFTs sem ter de recorrer de forma direta as cripto, acaba por ser uma mais valia. Alem disso, é uma rede onde tem muitos geeks e por isso mais dado a essas coisas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 26, 2022, 05:36:05 PM",
      "body": "Quote from: joker_josue on December 26, 2022, 04:04:01 PMÉ esse o facto que faz com que a eles estejam a ter tanto sucesso.A pessoa conseguir adquirir esses NFTs sem ter de recorrer de forma direta as cripto, acaba por ser uma mais valia. Alem disso, é uma rede onde tem muitos geeks e por isso mais dado a essas coisas.Sim, é só abrir a página e clicar no botão laranja, igual eu mesmo fiz. Se tivessem que baixar uma metamask da vida, criar conta em exchange para pegar um pouco de matic para pagar as transações, conectar a carteira em um site, e só depois pegar... com certeza o único seria bem menor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 26, 2022, 05:42:07 PM",
      "body": "Quote from: TryNinja on December 26, 2022, 05:36:05 PMSim, é só abrir a página e clicar no botão laranja, igual eu mesmo fiz. Se tivessem que baixar uma metamask da vida, criar conta em exchange para pegar um pouco de matic para pagar as transações, conectar a carteira em um site, e só depois pegar... com certeza o único seria bem menor.Eu acho que essa devia ser a norma, simplicidade no processo ao usar este tipo de tecnologia, pelo menos para coisas simples como estas.Isso aumentaria adesão e o interesse por parte de muitas pessoas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 26, 2022, 05:53:02 PM",
      "body": "Quote from: joker_josue on December 26, 2022, 05:42:07 PMEu acho que essa devia ser a norma, simplicidade no processo ao usar este tipo de tecnologia, pelo menos para coisas simples como estas.Isso aumentaria adesão e o interesse por parte de muitas pessoas.O problema é que a segurança e descentralização é o que complica o negócio. Eu consigo entrar na minha conta do reddit e imediatamente pegar o NFT pois tudo acontece de forma centralizada no banco de dados deles. Se for assim nem precisamos de NFTs. Aí claro que depois eu posso pagar a taxa para realmente pegar o NFT onchain e ter controle sobre ele, mas quase ninguém vai fazer isso se o intuito não é vender em um market como o OpenSea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 26, 2022, 06:25:37 PM",
      "body": "Quote from: TryNinja on December 26, 2022, 05:53:02 PMO problema é que a segurança e descentralização é o que complica o negócio. Eu consigo entrar na minha conta do reddit e imediatamente pegar o NFT pois tudo acontece de forma centralizada no banco de dados deles. Se for assim nem precisamos de NFTs. É mais ou menos o que a Steam faz com skins.. centraliza tudo.. e no final a experiência é bem parecida com NFTs (descentralizados)..Até na questão de segurança.. já vi alguns amigos perderem todas skins e eles não fazerem nada A meu ver, falta transparência no caso desses modelos centralizados.. ex: quantas dragon lores existem em circulação?Já alguns NFTs têm uns problemas ainda mais bizarros: https://twitter.com/jacobdotsol/status/1600526700982710273Ainda falta um pouco para chegar num padrão ideal.edit: sobre a facilidade, estes foram os primeiros NFTs que peguei.. justamente por 1) serem de graça e 2) não exigirem nenhum esforço extra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 26, 2022, 06:56:39 PM",
      "body": "Quote from: sabotag3x on December 26, 2022, 06:25:37 PMÉ mais ou menos o que a Steam faz com skins.. centraliza tudo.. e no final a experiência é bem parecida com NFTs (descentralizados)..Até na questão de segurança.. já vi alguns amigos perderem todas skins e eles não fazerem nada A meu ver, falta transparência no caso desses modelos centralizados.. ex: quantas dragon lores existem em circulação?Não só isso, mas lá em ~2016, alguns usuários estavam conseguindo dupar skins ao contatar o suporte da Steam e alegar que suas contas foram hackeadas. O suporte \"recriavam\" as skins do usuário e deixaram o \"\"hacker\"\" com o que eles levaram, resultando em no dobro de skins.Hoje em dia acontece isso ai do suporte não fazer nada, exatamente por conta de casos como esse. https://win.gg/news/valve-made-a-duped-csgo-skin-for-the-first-time-since-2016/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 26, 2022, 07:58:45 PM",
      "body": "Quote from: TryNinja on December 26, 2022, 06:56:39 PMdeixaram o \"\"hacker\"\" com o que eles levaram, resultando em no dobro de skins.O problema é justamente não tirar a primeira skin roubada.. como desculpa eles alegam que o usuário pode ter vendido por fora do mercado deles..enfim, se quisessem dar proteção, matavam esse mercado externo.. antigamente o bitskins era usado pra dumpar item roubado (agora tem KYC) e os outros mais parecem cassinos do que qualquer outra coisa..Quote from: TryNinja on December 26, 2022, 06:56:39 PM-link-Isso de resolver o problema de um único usuário pegou muito mal.. lembro de ter lido a respeito na época, estavam até congelando algumas skins..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}