{
  "id": "topic_5466546",
  "title": "mandown",
  "author": "mandown",
  "created_time": "September 12, 2023, 04:17:58 PM",
  "content": "Arkadaşlar 28 milyon dolar civarında fonu çaldırmayı başarmışlar Sanırım sıcak cüzdanlarına ait private keyi çaldırmışlar. Withrawl işlemleri durdurulmuş. Bir bakın bakiyeniz vars takip edin. Lütfen borsalarda para tutmayın. Bugün olmasa yarın başınıza gelebiliyor. Beyler bayanlar bu borsa uzun vadede açık kalamayabilir dikkatli olmakta fayda var.Not: Lan her boğa sonrası cexler patlıyor ama boğada patlayan cex duyan olmuyor ne enteresan bir durum değilmi?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466546",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "September 12, 2023, 05:21:55 PM",
      "body": "Quote from: mandown on September 12, 2023, 04:17:58 PMArkadaşlar 28 milyon dolar civarında fonu çaldırmayı başarmışlar Sanırım sıcak cüzdanlarına ait private keyi çaldırmışlar. Withrawl işlemleri durdurulmuş. Bir bakın bakiyeniz vars takip edin. Lütfen borsalarda para tutmayın. Bugün olmasa yarın başınıza gelebiliyor. Beyler bayanlar bu borsa uzun vadede açık kalamayabilir dikkatli olmakta fayda var.Not: Lan her boğa sonrası cexler patlıyor ama boğada patlayan cex duyan olmuyor ne enteresan bir durum değilmi?Boğa döneminde hack yaşasalar bile borsaya giren para miktarı çıkandan fazla olduğu için yani deposit edilen miktar withdraw edeceklerin miktarını rahatlıkla karşıladığı için işi döndürmeye devam edebiliyorlar. Ancak ayı dönemlerinde durum tam tersi olduğu için çekim yapacak kullanıcıların varlıklarını ödeyemeyip battıklarını itiraf etmek zorunda kalıyorlar yada sessizce kaçıyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "September 13, 2023, 02:41:43 PM",
      "body": "Kuzey Kore grubu Lazarus ekibinin üstlendiğini görüyoruz.Stake hack olayından sonra Coinex'den hackledikleri parayı da kendi hesaplarına aktarım yaptılar.Belki yanlışlıkla belki bilerek bunu tabiki bilemiyoruz.41 milyon dolar stake'den çaldıktan sonra 54 Milyon dolar da coinex borsasından çalmış oldular.İki hackten yaklaşık 100 milyon dolar para kaldırdılar.Resim kaynak : https://twitter.com/zachxbt/status/1701905899034390574",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}