{
  "id": "topic_5428931",
  "title": "AbuBhakar",
  "author": "AbuBhakar",
  "created_time": "December 15, 2022, 01:35:45 PM",
  "content": "Sa sunday na ang finals ng Fifa world cup 2022 sa pagitan ng defending champion France at Argentina. Sobrang init ng laban na ito dahil maglalaban ang GOAT at rising superstar. Sobrang dikit ang laban pero sa tingin ko ay Argentina ang magcha2mpion dito dahil uhaw si Messi sa title na ito dahil sa nalalapit nyang retirement. Sobrang lakas pati ng Argentina matapos silang matalo sa Saudi ay nag improve talaga ang performance nila sa highest level.Sa mga walang cable subscription para mapanood ang match. Share ko lng ang gamit kong IPTV app na libre kong napapanood ang mga sports in HD Quality. Nakita ko lng din ito sa other forum na nakalagay sa source sa ibaba. Hindi ako ang original creator ng apps at tutorial na ito.Sundin nyo lang ang guide na itoCode:1. ANY NAME LANG PO LAGAY SA PROFILE2. URL INPUT PO PORTAL URL3. INPUT MAC ADDRESS4. SAVE5. ENJOY WATCHINGAndroid APKList of Portal Address & MacSource ng Application at Tutorial",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428931",
  "comments": [
    {
      "author": "dimonstration",
      "created_time": "December 15, 2022, 02:43:47 PM",
      "body": "Mabuhay ka kabayan! Kakasarado lng kasi ng website na pinapanoodan ko ng free stream ng world cup. Hindi ko dati maintindihan itong IPTV kung paano gumagana kaya hindi ko sinusubukan. Parang simple mac address setup lng pala ito para maka connect sa channel ng ibang bansa. Sobrang solid ng 4K display at matagal pa ang expiration ng mga mac address. Sana tumagal ng gamit ito para sa NBA naman pagakatpos ng world cup.May symbianize din ako dati pero diko na ginagamit simula nung nagsara sila. Nagulat ako ng makita ko na buhay na pala sila ulit ng buksan ko yung source link mo. Anyway maraming salamat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "December 15, 2022, 03:51:00 PM",
      "body": "Quote from: dimonstration on December 15, 2022, 02:43:47 PMMabuhay ka kabayan! Kakasarado lng kasi ng website na pinapanoodan ko ng free stream ng world cup. Hindi ko dati maintindihan itong IPTV kung paano gumagana kaya hindi ko sinusubukan. Parang simple mac address setup lng pala ito para maka connect sa channel ng ibang bansa. Sobrang solid ng 4K display at matagal pa ang expiration ng mga mac address. Sana tumagal ng gamit ito para sa NBA naman pagakatpos ng world cup.May symbianize din ako dati pero diko na ginagamit simula nung nagsara sila. Nagulat ako ng makita ko na buhay na pala sila ulit ng buksan ko yung source link mo. Anyway maraming salamat. No problem bro dahil nakita ko lang din ito nung naghahanap ako ng mapapanoodan. Hindi masyadong sikat ang football dito sa atin kaya wala masyadong source ng free streaming kaya IPTV lang talaga ang nahanap ko na pwedeng pagpanoodan ng libre.Quote from: dimonstration on December 15, 2022, 02:43:47 PMMay symbianize din ako dati pero diko na ginagamit simula nung nagsara sila. Nagulat ako ng makita ko na buhay na pala sila ulit ng buksan ko yung source link mo. Anyway maraming salamat.  Matagal na bumalik ang symbianize pero minsan ay nawawala lng ulit. Unang revive nila ay naging mobilarian then nagsara tapos nag open ulit at bumalik sa original name na symbianize pero 3.0 na dahil pang tatlong version na nila ito at mukhang tatagal ito dahil sa mga bagong features na need bilhin. Madami na dn nagpopost dun tungkol sa Bitcoin. Balik loob na.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "December 18, 2022, 02:17:22 PM",
      "body": "Nice thread para sa world cup. Ngayon ko lng napansin ito ah! The best ito dahil finals na mmyang 11pm sa atin at siguradong puyatan nanaman sa pagpanood nito. Sobrang ganda ng finals na ito dahil dikit ang stats ng dalawang team at mukhang makakakita tayo ng showdown mula sa star player ng France at Argentina.Habol kayo sa Duelbits promotion para sa world cup dahil may 50$ risk free bet kayo kung magbebet kayo pre match ng worth 50$ sa kahit anong pick na may 1.5 odds pataas. Mataas ang chance na maka score pareho itong dalawang team na ito kaya halos free money nlng yung promotion na ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "December 18, 2022, 04:39:10 PMLast edit: December 18, 2022, 04:51:02 PM by Beparanf",
      "body": "Quote from: Eternad on December 18, 2022, 02:17:22 PMNice thread para sa world cup. Ngayon ko lng napansin ito ah! The best ito dahil finals na mmyang 11pm sa atin at siguradong puyatan nanaman sa pagpanood nito. Sobrang ganda ng finals na ito dahil dikit ang stats ng dalawang team at mukhang makakakita tayo ng showdown mula sa star player ng France at Argentina.Habol kayo sa Duelbits promotion para sa world cup dahil may 50$ risk free bet kayo kung magbebet kayo pre match ng worth 50$ sa kahit anong pick na may 1.5 odds pataas. Mataas ang chance na maka score pareho itong dalawang team na ito kaya halos free money nlng yung promotion na ito.Deym. Sobrang boring ng finals dahil walang magawa ang France para makabawi sa early aggression ng Argentina. Mahirap pa naman maghabol kapag half time na tapos 2 points behind kaya sureball Argentina champion at deserve naman talaga nila dahil sobrang galing ng team work nila at good lead ni Messi sa lahat ng laro nila.Mukhang delikado itong bet mo dahil halos walang chance ang France na maka attempt na tumira sa goal dahil sa sobrang higpit ng depensa ng Argentina. Although pwede din na mag giveway na ang Argentina sa final minutes para maka score ang France.EditWTF! Mbappe back to back goal sa 81 at 82 minute mark. Napaka halimaw! Congrats sa early payout lods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "December 18, 2022, 05:51:19 PM",
      "body": "Quote from: Beparanf on December 18, 2022, 04:39:10 PMWTF! Mbappe back to back goal sa 81 at 82 minute mark. Napaka halimaw! Congrats sa early payout lods.Literal na binuhat ni Mbappe ang France dalwang beses (isa sa regular time tapos sa OT). Hindi ko akalain na aabot pa sa penalty ang laro nato dahil halos hawak na ng Argentina lagi yung winning chance advantage kung hindi lang sila nalulusutan ng miracle move ni Mbappe. Sobrang dikit din ng laban ni Messi at Mbappe sa Golden Boots award. Diko lng alam kung counted yung overtime score dahil sa Mbappe na ang panalo kung kasama yun dahil may total 8 goal na sya kontra kay Messi na 7 goal lang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "December 19, 2022, 11:59:27 AM",
      "body": "Quote from: dimonstration on December 18, 2022, 05:51:19 PMQuote from: Beparanf on December 18, 2022, 04:39:10 PMWTF! Mbappe back to back goal sa 81 at 82 minute mark. Napaka halimaw! Congrats sa early payout lods.Literal na binuhat ni Mbappe ang France dalwang beses (isa sa regular time tapos sa OT). Hindi ko akalain na aabot pa sa penalty ang laro nato dahil halos hawak na ng Argentina lagi yung winning chance advantage kung hindi lang sila nalulusutan ng miracle move ni Mbappe. Sobrang dikit din ng laban ni Messi at Mbappe sa Golden Boots award. Diko lng alam kung counted yung overtime score dahil sa Mbappe na ang panalo kung kasama yun dahil may total 8 goal na sya kontra kay Messi na 7 goal lang.Counted yung goal sa overtime as per the game rules. Yung penalty kick lng ang hindi counted sa total score ng player. Sobrang intense ng laro kagabi. Hindi ko inasahan na aabot pa yung sa penalty kick round dahil nakaka lamang lagi ang Argentina na halos imposible na habulin. Sobrang halimaw lang talaga ni Mbappe para maka goal ng pressured sa oras lalo na nung overtime dahil halos pagod na ang lahat nun.Too bad lang at sa penalty kick nadali ang France dahil wala na magagawa si Mbappe sa part na yun same sa nangyari sa Brazil vs Morocco. Congrats pa dn sa mga nanalo sa bets kahapon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "December 19, 2022, 03:58:42 PM",
      "body": "Sabi ko sa inyo free bet yung kahapon na both to score dahil dikit ang stats ng dalawang na ito tapos parehol silang malakas sa offense kaya sure ball na puro aggressive play ang gagawin nila sa bawat minuto ng laro. Hindi ko ineexpect na ganoon katindi ang gagawin ni Kylian sa game na yun na sya na lahat ang gagawa para sa France pero expected ko na talaga na makaka score sya kaya malaki ang kumpyansa ko na mananalo ang bet ko. 50$ ang bet ko para sakto lang sa promo ni Duelbits pero mas oks sana kung nadagdagan ko pa lalo na nung naka early 2.0 ang Argentina.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}