{
  "id": "topic_5441156",
  "title": "mendace",
  "author": "mendace",
  "created_time": "February 24, 2023, 10:27:58 PMLast edit: February 24, 2023, 10:50:01 PM by mendace",
  "content": "NOSTRPrefazioneHo pensato un pò prima di aprire questo thread e dato che nessuno lo ha fatto mi sono deciso a farlo io (o almeno spero di aver cercato bene prima di farlo).Questo sarà un thread che aggiornerò  di volta in volta non appena avrò del tempo da dedicare, ma intanto vediamo di dare una breve spiegazione di cosa sia Nostr.Cosa è Nostr?Nostr, acronimo di Notes and other stuff transmitted by relays è un protocollo “aperto” utilizzato per creare un social network decentralizzato e «censorship-resistant», resistente alla censura.In poche parole Nostr è un protocollo come lo è Bitcoin come lo è la posta elettronica meglio conosciuta come email o come IP, TCP, HTTP insomma una serie di regole utilizzate da server e client per comunicare.Al momento su Nostr è stato costruito un social network che ricorda molto Twitter ma ciò non toglie che si possano costruire altri applicativi, la vera differenza fra Nostr e Twitter sta nel fatto che il primo è decentralizzato o distribuito quindi resistente alla censura e nessun ente centrale può controllare le azioni, il secondo è totalmente centralizzato e censurabile.Al momento sembra essere il posto preferito dei Bitcoiners specialmente dopo la presa di Elon Musk su Twitter, pensate che Jack Dorsey ha donato 14 Bitcoin per lo sviluppo di Nostr e lo ha anche twittato.]Come funziona?Per utilizzare Nostr è necessario servissi di un client, come per leggere le vostre email usate outlook o thunderbird allora anche per Nostr dovrete usare una user interface che ne faciliti la visualizzazione. A seconda del sistema operativo che state utilizzando potete servirvi del software o app dedicate oppure potete usarlo semplicemente come web application dal browser.Da questo link  potete trovare una lista dei client disponibili ma non mi sembra aggiornata dunque vi segnalo anche iris.to come web application e Amethyst per Android che potete scaricare da Fdroid oppure da Github.Ma come ci si iscrive in questo social gettonato?Semplice nessuna email o password, l'unica cosa che dovrete fare e avere cura di conservare come fate per un qualsiasi wallet Bitcoin sarà quello di creare una chiave privata. Questa sarà l'unica chiave di accesso al vostro profilo e non dovrete condividerla con nessuno altrimenti avranno accesso al vostro profilo e potranno pubblicare al vostro posto. Mentre sarà sufficiente condividere la chiave pubblica che generalmente cominicia con \"npub\" per farsi trovare, questa la troverete nel vostro profilo. Ad esempio questa è la mia e se vorrete connettervi con me vi basterà inserirla nella barra di ricerca e fare follow sul profilo. npub13tkge7eqeem5cz8gk7gdju76nytvvf064hm5mzmv3x26k2uvaxfqczet2jGià ma perchè la mia chiave pubblica è cliccabile come qualsiasi link se vi ho appena detto che si deve ricercare nella barra?Perchè diversamente da Twitter che usa la spunta blu a pagamento Nostr ha una verifica selfhosted vuol dire che ci possiamo auto verificare e il protocollo accetterà come valida quella verifica. I passaggi per farlo in self hosting richiedono un pò di manualità e qualche dote informatica ma niente di così inarrivabile, però avrete bisogno di un dominio e un hosting vostro. Potete seguire questa guida per usare Github come hosting (personalamente non l'ho provato) link.Oppure esiste un modo molto più semplice ed è quello di usare i servizi gratuiti o a pagamento che con due semplici passaggi vi permetteranno di verificarvi in un batter d'occhio. Con iris.to lo fate direttamente dal client oppure esiste http://bitcoinnostr.com o ancora https://nostr.red di Massimo Musumeci.Quello che dovrete fare è immettere il vostro nome utente scelto su Nostr e la Npub nei campi giusti del servizio e vi genererà un link da inserire nel campo Nip05 del setting del vostro profilo, salvate e avrete la spunta di verifica.Avere la verifica significa in parole pratiche di avere un link amichevole per la vostra chiave pubblica e vi permette di essere facilmente trovati anche attraverso il nome utente nel campo di ricerca oppure tramite un link diretto come questo https://iris.to/mendaceCosa è un relay?Un relay è un server che può essere di vostra proprietà o di chiunque altro; chiunque può gestire un relay. (In sostanza un nodo della rete)Si interrogano i relay per conoscere aggiornamenti sugli utenti. Un relay non fa altro che accettare i messaggi degli utilizzatori e inoltrarli ad altre persone. Non è necessario fidarsi dei relay perché le firme vengono verificate sul lato client (dove si interagisce con Nostr).Posso usare Bitcoin su Nostr?Si è possibile tippare o creare un invoice LN su Nostr semplicemente inserendo il vostro url LN nel campo LN Address oppure potete usare Alby per inserire un lightning address come questo mendace@getalby.comPerchè è importante Nostr?Nostr è importante perchè permette di pubblicare senza censure al contrario dei vari social centralizzati e pieni di passaggi pubblicitari.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441156",
  "comments": [
    {
      "author": "mendace",
      "created_time": "February 24, 2023, 10:28:19 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "February 25, 2023, 08:44:18 AM",
      "body": "Bravo bella guida, oltre ai 10 merit sei stato \"zappato\" per 1000 sat",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 25, 2023, 08:45:51 AM",
      "body": "Quote from: Plutosky on February 25, 2023, 08:44:18 AMBravo bella guida, oltre ai 10 merit sei stato \"zappato\" per 1000 sat  Aaah ecco chi era, non riuscivo a vederlo. Grazie mille, dovrò spiegare anche gli zap. Ti seguo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "February 25, 2023, 09:04:19 AM",
      "body": "Il numero di utenti è quintuplicato in un mese, siamo vicini oggi al milioneI sats zappati sono sopra i 10 milioni il giornoVenire pagati in hard money invece che cuoricini per il proprio contenuto potrebbe essere un bell' amo per molti , oltre alla libertà di contenuto. Con Alby e wallet super user friendly simili lo zapping è alla portata di tanti. Per mantenere la decentralizzazione e resistenza alla censura occorre però che i relay crescano come gli utenti.Per gli amanti delle statistiche qui ci sono tutte le info possibili sull'andamento di Nostrhttps://stats.nostr.band/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "giammangiato",
      "created_time": "February 25, 2023, 09:41:54 AM",
      "body": "Aspetta aspetta, social come facebook o social come twitterSi possono anche inviare LN? stupendo grazie per la condivisionequale client consigliate per iniziare?@mendace sei un vulcano tu, ma dormi ogni tanto la notte?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 25, 2023, 09:46:58 AM",
      "body": "Quote from: giammangiato on February 25, 2023, 09:41:54 AMAspetta aspetta, social come facebook o social come twitterSi possono anche inviare LN? stupendo grazie per la condivisionequale client consigliate per iniziare?@mendace sei un vulcano tu, ma dormi ogni tanto la notte?Ehehe dormo poco ma dormo...dipende da quale device vuoi usarlo, su IOS ti consiglio damus altrimenti su Android Amethyst oppure usa da browser altre soluzioni come https://iris.to o cerca Astrale. Poi ognuno tira le sue somme e userà quello che preferisce o che pensa essere migliore per il suo caso d'uso. E si puoi inviare satoshi su LN tippando o nel caso di Nostr meglio dire \"zap\" ai post degli utenti, proprio come ha fatto plutosky .È un bell'incentivo per chi crea contenuti interessanti, andate a vedere Der Gigi quanti zap ha già ottenuto ad esempio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jack0m",
      "created_time": "February 25, 2023, 10:44:56 AM",
      "body": "Senza dubbio argomento interessante, però scusate se faccio il rompipalle: non essendo direttamente inerente bitcoin & crypto, dovrebbe essere spostato in una sezione più appropriata imho, tipo questa: https://bitcointalk.org/index.php?board=165.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 25, 2023, 11:05:15 AM",
      "body": "Quote from: jack0m on February 25, 2023, 10:44:56 AMSenza dubbio argomento interessante, però scusate se faccio il rompipalle: non essendo direttamente inerente bitcoin & crypto, dovrebbe essere spostato in una sezione più appropriata imho, tipo questa: https://bitcointalk.org/index.php?board=165.0Se posso farlo come OP volentieri, altrimenti se deve farlo hostfat non saprei.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "February 25, 2023, 05:15:46 PM",
      "body": "Sono atterrato anche io su NOSTR, e mi sto divertendo con Damus.Ora sto lottando per attivare l’integrazione con LN, dato che ho sbagliato un dettaglio e non riesco a venirne a capo. Immagino che essendo un network decentralizzato sia normale avere una minore “efficienza”.Ma per Windows esistono dei client?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 25, 2023, 05:31:08 PM",
      "body": "Quote from: fillippone on February 25, 2023, 05:15:46 PMSono atterrato anche io su NOSTR, e mi sto divertendo con Damus.Ora sto lottando per attivare l’integrazione con LN, dato che ho sbagliato un dettaglio e non riesco a venirne a capo. Immagino che essendo un network decentralizzato sia normale avere una minore “efficienza”.Ma per Windows esistono dei client? Forse Nostr console dovrebbe essere un client per windows ma non l'ho mai provato e da quel che vedo non sembra nemmeno pratico. Adesso invece ho trovato un client web browser che mi sembra fatto veramente bene https://snort.social provate a dargli un'occhiata.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "February 25, 2023, 07:20:23 PMLast edit: May 15, 2023, 10:33:51 AM by fillippone",
      "body": "Quote from: Plutosky on February 25, 2023, 08:44:18 AMBravo bella guida, oltre ai 10 merit sei stato \"zappato\" per 1000 sat  Ehi, è un passo storico. Abbiamo il primo “prezzo” per un merit?100 sats. Non male. Quando Bitcoin varrà un milione di dollari, sarà un dollaro intero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "February 25, 2023, 08:36:38 PM",
      "body": "A me l'integrazione con lightning network piace un sacco! Grazie mendace per aver condiviso con noi preziosi consigli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "giammangiato",
      "created_time": "February 26, 2023, 08:14:32 AM",
      "body": "Quote from: mendace on February 25, 2023, 09:46:58 AMQuote from: giammangiato on February 25, 2023, 09:41:54 AMAspetta aspetta, social come facebook o social come twitterSi possono anche inviare LN? stupendo grazie per la condivisionequale client consigliate per iniziare?@mendace sei un vulcano tu, ma dormi ogni tanto la notte?Ehehe dormo poco ma dormo...dipende da quale device vuoi usarlo, su IOS ti consiglio damus altrimenti su Android Amethyst oppure usa da browser altre soluzioni come https://iris.to o cerca Astrale. Poi ognuno tira le sue somme e userà quello che preferisce o che pensa essere migliore per il suo caso d'uso. E si puoi inviare satoshi su LN tippando o nel caso di Nostr meglio dire \"zap\" ai post degli utenti, proprio come ha fatto plutosky .È un bell'incentivo per chi crea contenuti interessanti, andate a vedere Der Gigi quanti zap ha già ottenuto ad esempio.altra domanda, questi zap funzionano su tutti i client? o ci sono dei client in cui va e client in cui non va?Per ricaricare il tuo account ti basta inviare LN dal tuo client LN?me lo installo stasera quando i bambini dormono",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 26, 2023, 08:23:21 AM",
      "body": "Quote from: giammangiato on February 26, 2023, 08:14:32 AMaltra domanda, questi zap funzionano su tutti i client? o ci sono dei client in cui va e client in cui non va?Per ricaricare il tuo account ti basta inviare LN dal tuo client LN?me lo installo stasera quando i bambini dormonoNon tutti i client funzionano con LN  a questo link c'è una comparazione fra alcuni anche se non è completa di tutti https://github.com/vishalxl/Nostr-Clients-Features-List/blob/main/Readme.mdNon è l'account che si ricarica ma devi fornire un address LN per ricevere satoshi nel tuo wallet e quando vuoi fare zap ti chiede da quale wallet vuoi inviare se tu ne avessi più di di uno installato. Questo per quanto riguarda il mobile mentre per desktop se usi Alby hai add-on browser quindi tutto passerà da quel wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jack0m",
      "created_time": "February 26, 2023, 10:11:34 AM",
      "body": "Quote from: mendace on February 25, 2023, 11:05:15 AMQuote from: jack0m on February 25, 2023, 10:44:56 AMSenza dubbio argomento interessante, però scusate se faccio il rompipalle: non essendo direttamente inerente bitcoin & crypto, dovrebbe essere spostato in una sezione più appropriata imho, tipo questa: https://bitcointalk.org/index.php?board=165.0Se posso farlo come OP volentieri, altrimenti se deve farlo hostfat non saprei.Non puoi spostarlo tu in effetti, ma puoi chiederlo tramite la funzione \"Report to moderator\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 26, 2023, 10:41:14 AM",
      "body": "Vi segnalo che su Nostr è appena nato un marketplace raggiungibile a questo indirizzo https://nostr.bitejo.com/In poche parole utilizzando L’hashtag #nostrmarket potete creare un post dettagliato sul prodotto che volete vendere con tanto di foto, descrizione e prezzo in sats. Automaticamente verrà aggiunto al market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "February 27, 2023, 04:21:52 PM",
      "body": "sono entrato anche io nel magico modo di nostr, un po di tempo fama non ho avuto tempo di giocarcinon ho capito la storia del NIP05 ma cmq tanta robaCode:8a988f8adf1f085242c3884d3c9566761a75b4205d8ff35c29e1b3358c4ed7caquesto dovrei essere io",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 27, 2023, 05:02:07 PMLast edit: February 27, 2023, 05:16:52 PM by mendace",
      "body": "Quote from: babo on February 27, 2023, 04:21:52 PMsono entrato anche io nel magico modo di nostr, un po di tempo fama non ho avuto tempo di giocarcinon ho capito la storia del NIP05 ma cmq tanta robaCode:8a988f8adf1f085242c3884d3c9566761a75b4205d8ff35c29e1b3358c4ed7caquesto dovrei essere io Grandissimo babo. NIP05 è la verifica dell'account in parole povere sostituisce la spunta blu di twitter ma non c'è nessun invio di documento diciamo che tu stesso puoi dire \"io posseggo questo dominio e ne do la prova\" oppure puoi usare un servizio gratuito come nostr.plebs che inviando chiave pubblica e username di nostr ti rilascia un \"indirizzo\" simile a quello email da inserire nel campo NIP05",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plutosky",
      "created_time": "February 27, 2023, 05:37:17 PM",
      "body": "nuovo clienthttps://plebstr.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}