{
  "id": "topic_5471780",
  "title": "cheezcarls",
  "author": "cheezcarls",
  "created_time": "October 26, 2023, 06:58:57 PM",
  "content": "Because of the trend of retroactive drops rewarding big amount of airdrops to early users over the years, we're poised to farm in both testnet and mainnet without any promises or guarantees for a future airdrop.You can be qualified for a big potential airdrop by just minting an NFT (Aptos), history of transactions from start date to end date (e.g., Arbitrum, Optimism, etc.), being an early testnet user (Sei, Celestia, etc.), using a DeFi platform in the early goings (e.g., Uniswap, Shapeshift, etc.), playing a game during the early stages (e.g., Axie Infinity, Big Time, etc.) and more.As farming airdrops are a thing nowadays, the hackers are seeing an opportunity to drain our hard-earned time and money to . But there are ways for us to prevent from getting our wallets compromised.Most of us are using Metamask which is an EVM-compatible non-custodial hot wallet where only the user with the seed phrase or private key has the access. However, Metamask is vulnerable towards hacks such as sweeper bots or any other malware. Therefore, here are the tools that I use base on my experience in protecting our EVM-compatible non-custodial hot wallets from getting drained:1) Rabby Wallet - An open source wallet browser extension that provides additional layer for security measures that supports Metamask and other EVM-compatible wallets with smooth multi-chain experience without having to switch network manually and risk scanning feature for pre-transactions2) Revoke Cash - Revoke permissions from suspicious approvals and supports multi-chain with a browser extension that prevents you from signing malicious contracts.3) De.Fi - A crypto antivirus platform with shield, scanner and revoking features.4) Wallet Guard - A browser extension that protects you by successfully detecting a phishing site that you're trying to access and has simulation feature when doing a transaction.5) Pocket Universe - Another browser extension that protects you from Web3 scams and has up to $2,000 insurance for each transaction.6) Avast Premium Security - An all-in-one antivirus for your desktop or mobile that protects you from malware, ransomware, phishing and suspicious sites and more. It's a paid subscription (w/ free 1-month trial) but it's worth the investment.These tools above are meant especially for those who cannot afford to have a hardware wallet like Ledger Nano S, Trezor, etc.In your Metamask or any EVM-compatible hot wallet, make sure that you make a habit of disconnecting and revoking permissions to specific sites after you're done using their platform. And please, use a burner wallet for crypto airdrops and not the main one where you have big amount of assets in your portfolio.But the most important of all is you. If you do not know how to do your due diligence and common sense, you would still be vulnerable towards these hacks.There are cases where the hacker might persuade you to turn off your antivirus or any 3rd party layer because of statements like \"we're still in the process of making our website reliable, etc.\". They are very skilled and creative to persuade us to do this and do that by posting fake job opportunities, pretending to collaborate to KOLs and ambassadors, making a fake beta test game download and more. Speaking of downloads, it is where I fall into their trap last year in which I have lost almost $20k in my assets combined. I make sure of not experiencing that again by utilizing these crypto security tools I have mentioned.They think outside of the box and may do whatever it takes to penetrate our wallets without us knowing. However, we can also outsmart them by practicing due diligence, in-depth researching, second and third opinions, hesitancy, etc.We're still a long way to go in terms of cybersecurity in the world of crypto and Web3, but at least these tools would surely help a lot to both beginners and the experienced. P.S. Feel free to suggest other crypto security-related tools that I didn't mention on this thread that would also be very helpful to increase prevention from getting our assets drained.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471780",
  "comments": [
    {
      "author": "Catenaccio",
      "created_time": "October 27, 2023, 12:52:14 AM",
      "body": "Use wallets that only are used for airdrops and never use your main wallets to interact with smart contracts from new projects for airdrops.Use Smart Contract Revoke tools.How to Revoke Token Approvalhttps://app.unrekt.net/https://revoke.cash/https://etherscan.io/tokenapprovalchecker",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 27, 2023, 11:14:09 AM",
      "body": "Using the largest amount of altcoins in the hope that there will be an airdrop that will bring you a good income. I liken it to chasing mirages.The tools mentioned are good, but it is better to use them on a clean computer and not use it for trading or with a wallet or your personal data.It is better to try to try a limited number of altcoins that you expect to have a future rather than trying to try all, and rely on the development team, technical development and distribution of currencies more than rumors and following the news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "October 27, 2023, 11:59:08 AM",
      "body": "Most of airdrop are now unpredictable and only from tester platform things.IMO, better to use different wallet (main wallet & airdrop wallet) because chassing airdrop there always have some potential you are leading to a fake/scam airdrop and losing all of your asset.Spread your asset and wallet according to the use-case would be good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "October 27, 2023, 02:00:19 PM",
      "body": "Quote from: Husires on October 27, 2023, 11:14:09 AMUsing the largest amount of altcoins in the hope that there will be an airdrop that will bring you a good income. I liken it to chasing mirages.The tools mentioned are good, but it is better to use them on a clean computer and not use it for trading or with a wallet or your personal data.It is better to try to try a limited number of altcoins that you expect to have a future rather than trying to try all, and rely on the development team, technical development and distribution of currencies more than rumors and following the news.If you do really have the time then you could really deal with those thing then go ahead but i would really definitely be recommending on these things when it comes to security specially on your main wallet.As much as possible then never ever download things randomly and clicking up links specially on farming airdrops. Most of the time this would really be talking about testnets which it would really be still needing some bucks for you to pay up with the fees, or else you wont really be that eligible for the airdrop. The only thing i could say that would really be the best security is having your own \"COMMON SENSE\" on which you could really be able to assess on which things that are obviously scams or hacking attempts and its not really that hard to point or notice it out if you do have that common sense.In depth research would really be minimizing the scope of things that you would really be needing to research. Only spend up your time on something that it is really that worth for your time.Yes, its hard but doesnt mean that it would really be that impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "October 27, 2023, 03:10:50 PM",
      "body": "A common piece of advice to people who take part in an airdrop is to use a different wallet for airdrops. This is good and it's true but that alone won't protect you from scams and hacks. You might as well use different emails and social media accounts for airdrops but that won't also guarantee your safety.Most, if not all airdrops require you to follow their social media channels on X (Twitter), Telegram, and maybe more. You click a link to get to those sites and the link might be a phishing link, you never know. So whether you use a different email, wallet, or social media account, your device is exposed to the virus. For me, the best way to use a different device for your airdrop and don't have anything serious or important on that device. So if you can afford it and if it's worth it, a different device is best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "October 27, 2023, 05:01:21 PM",
      "body": "Quote from: cheezcarls on October 26, 2023, 06:58:57 PMBecause of the trend of retroactive drops rewarding big amount of airdrops to early users over the years, we're poised to farm in both testnet and mainnet without any promises or guarantees for a future airdrop.You can be qualified for a big potential airdrop by just minting an NFT (Aptos), history of transactions from start date to end date (e.g., Arbitrum, Optimism, etc.), being an early testnet user (Sei, Celestia, etc.), using a DeFi platform in the early goings (e.g., Uniswap, Shapeshift, etc.), playing a game during the early stages (e.g., Axie Infinity, Big Time, etc.) and more.As farming airdrops are a thing nowadays, the hackers are seeing an opportunity to drain our hard-earned time and money to . But there are ways for us to prevent from getting our wallets compromised.Most of us are using Metamask which is an EVM-compatible non-custodial hot wallet where only the user with the seed phrase or private key has the access. However, Metamask is vulnerable towards hacks such as sweeper bots or any other malware. Therefore, here are the tools that I use base on my experience in protecting our EVM-compatible non-custodial hot wallets from getting drained:1) Rabby Wallet - An open source wallet browser extension that provides additional layer for security measures that supports Metamask and other EVM-compatible wallets with smooth multi-chain experience without having to switch network manually and risk scanning feature for pre-transactions2) Revoke Cash - Revoke permissions from suspicious approvals and supports multi-chain with a browser extension that prevents you from signing malicious contracts.3) De.Fi - A crypto antivirus platform with shield, scanner and revoking features.4) Wallet Guard - A browser extension that protects you by successfully detecting a phishing site that you're trying to access and has simulation feature when doing a transaction.5) Pocket Universe - Another browser extension that protects you from Web3 scams and has up to $2,000 insurance for each transaction.6) Avast Premium Security - An all-in-one antivirus for your desktop or mobile that protects you from malware, ransomware, phishing and suspicious sites and more. It's a paid subscription (w/ free 1-month trial) but it's worth the investment.These tools above are meant especially for those who cannot afford to have a hardware wallet like Ledger Nano S, Trezor, etc.In your Metamask or any EVM-compatible hot wallet, make sure that you make a habit of disconnecting and revoking permissions to specific sites after you're done using their platform. And please, use a burner wallet for crypto airdrops and not the main one where you have big amount of assets in your portfolio.But the most important of all is you. If you do not know how to do your due diligence and common sense, you would still be vulnerable towards these hacks.There are cases where the hacker might persuade you to turn off your antivirus or any 3rd party layer because of statements like \"we're still in the process of making our website reliable, etc.\". They are very skilled and creative to persuade us to do this and do that by posting fake job opportunities, pretending to collaborate to KOLs and ambassadors, making a fake beta test game download and more. Speaking of downloads, it is where I fall into their trap last year in which I have lost almost $20k in my assets combined. I make sure of not experiencing that again by utilizing these crypto security tools I have mentioned.They think outside of the box and may do whatever it takes to penetrate our wallets without us knowing. However, we can also outsmart them by practicing due diligence, in-depth researching, second and third opinions, hesitancy, etc.We're still a long way to go in terms of cybersecurity in the world of crypto and Web3, but at least these tools would surely help a lot to both beginners and the experienced. P.S. Feel free to suggest other crypto security-related tools that I didn't mention on this thread that would also be very helpful to increase prevention from getting our assets drained. Revoking wallet accesses is always a good idea. And i am using de.fi as well for many things.. But...i understand that losing $20k would make anyone extra carfeful. I mean i would be totally paranoid after that. But...Having 3 browser expansions and avast premium just for protecting you is an overkill. I mean what could these possibly add to brave explorer security?Every internet security experts i've talked with agree that if you have windows, their own defence system is good enough these days. It just used to be a joke so people have kept that need for 3rd party applications alive.Programs are just helping you in some cases. They don't think and they can't help you if you are lured in to do something via social engineering, or if you want to make a mistake, or choose to make a mistake after those devence systems keep giving false positives. Also i am not an security expert, but have some experience with the programs, and i have to ask hey wouldn't so many defence programs just mess the system? Most important steps i've taken with my custodial wallets and exhange wallets is A. Having google 2a in everywhere. Even in my emails, backup emails and no-crypto relevant web accounts. And using lots of different emails and user names not connected to each other in any way.B. Military grade passwords that i don't store in plain text or anywhere hackable. And still i am still sometimes paranoid and trust way more to my exchanges security than my own. They have defence i could never afford, and knowhow i couldn't get with years of studying. Sure they are a bigger target that gets attacks all the time, but if you personally show your money online, people will believe you have it, and you can get targeted. And one person is way easier target than some company that is build on security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 27, 2023, 07:08:40 PM",
      "body": "Well nice advise OP. But for me eversicne I farm airdrop to retroactive one thing I always do is not to incorporate main wallet into your airdrop wallet. Always use butner wallet and dont put much fund there you dont need. Only put to protocols your fund that are necessary on your plan airdrop target. Anyways in terms of security what you input OP is a must along the way. Thumbs up!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "October 27, 2023, 11:20:08 PM",
      "body": "You post is pretty interesting but I don't see farming airdrops as a major target for myself since there are fake airdrops there that might not even have any value. Airdrops are good ways to earn some tokens from crypto projects but the majority of the bad projects had made people to lose interest in farming airdrops. There are other things we need to consider before farming any airdrop so to protect us from losing our information. Airdrops are profitable when we have good tools like these ones and we are ready for any tasks but not giving out our data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 28, 2023, 12:52:05 PM",
      "body": "Airdrops today that would get a good value are like a needle in a haystack. It just fills your wallet with shit coins and I think I am over with that. Although the proposed security measures are a good idea, I think it is still better if we keep our wallets clean from this. Stock the meaningful tokens/coins even if they are cheap in price. It's like the OP said, airdrops are a waste of time and effort and we jeopardize our wallets by receiving them. In the past, I would gladly take all the airdrops because 10 percent of them gained value in just a short amount of time, especially in the ICO era. Now, every developer just keeps on making shit coins thinking they could use it as bait to get some money from a fool investor that would buy their coin, or a shot to the moon that it could be hyped one day like other meme coins did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 28, 2023, 02:56:05 PM",
      "body": "Quote from: danherbias07 on October 28, 2023, 12:52:05 PMAirdrops today that would get a good value are like a needle in a haystack. It just fills your wallet with shit coins and I think I am over with that. Although the proposed security measures are a good idea, I think it is still better if we keep our wallets clean from this. Stock the meaningful tokens/coins even if they are cheap in price. It's like the OP said, airdrops are a waste of time and effort and we jeopardize our wallets by receiving them. In the past, I would gladly take all the airdrops because 10 percent of them gained value in just a short amount of time, especially in the ICO era. Now, every developer just keeps on making shit coins thinking they could use it as bait to get some money from a fool investor that would buy their coin, or a shot to the moon that it could be hyped one day like other meme coins did. At least not all of the airdrops are trash but just the majority of it. Maybe only less than 1% of them are reliable. Would like to mention some of the notable retroactive drops with at least decent to insane amount of rewards.- Uniswap- Axie Infinity (AXS)- Shapeshift (FOX)- DappRadar- Synthetix- Aqua- Aptos- Arbitrum- Optimism- Arkham Intelligence- Celestia- Big TimePeople are already in FOMO mode to farm these retroactive drop activities to fully cement their status to qualify even without knowing either if they’re gonna launch a token, revealing the snapshot date, etc.Now I am just being selective only to those that I want to interact like having a big funding raise, partnering eith Binance Labs and more.Doing these tasks are very time consuming to be honest especially with my previous experience on Linea testnet voyage and ended up just having a Beta commemorative NFT with no monetary value at all (but maybe a possible multiplier). Good thing I only use a burner wallet that I can afford to lose since my balance is just small only to pay for gas fees, testing Dapps, minting NFTs and more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "November 03, 2023, 07:02:44 AM",
      "body": "Quote from: Alpha Marine on October 27, 2023, 03:10:50 PMA common piece of advice to people who take part in an airdrop is to use a different wallet for airdrops. This is good and it's true but that alone won't protect you from scams and hacks. You might as well use different emails and social media accounts for airdrops but that won't also guarantee your safety.Most, if not all airdrops require you to follow their social media channels on X (Twitter), Telegram, and maybe more. You click a link to get to those sites and the link might be a phishing link, you never know. So whether you use a different email, wallet, or social media account, your device is exposed to the virus. For me, the best way to use a different device for your airdrop and don't have anything serious or important on that device. So if you can afford it and if it's worth it, a different device is best. Using a different wallet can of course protect you or your main wallet rather from getting hacked or scammed. I think it's okay to use the same email and social media account. I see no harm on it. Besides, I also find it hassle. We should always pay attention to the URL that we visit before we do some serious actions like connecting a wallet. See if it's correctly spelled so that we can avoid getting phished.We can also install anti-virus on our device to get an extra security. Some of them has an extra feature which can protect you automatically from a fake website and other malicious threats. The last in your list is alright but I prefer to just use my old device as a cold storage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 03, 2023, 10:56:20 AM",
      "body": "Quote from: cheezcarls on October 26, 2023, 06:58:57 PMIn your Metamask or any EVM-compatible hot wallet, make sure that you make a habit of disconnecting and revoking permissions to specific sites after you're done using their platform. Just connecting wallet doesn't do anything harmful, mere connecting allows dapp to view your address whether it be scammer or genuine. So there is no need worry yourself over disconnecting. Regarding permissions I agree, be careful where you give 'approval' permission and sign messages where you can't read what message says — this is where most scam lies. When you approve only approve amount for that particular transaction never say 'max'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 03, 2023, 12:38:40 PM",
      "body": "Quote from: milewilda on October 27, 2023, 02:00:19 PMMost of the time this would really be talking about testnets which it would really be still needing some bucks for you to pay up with the fees, or else you wont really be that eligible for the airdrop. The only thing i could say that would really be the best security is having your own \"COMMON SENSE\" on which you could really be able to assess on which things that are obviously scams or hacking attempts and its not really that hard to point or notice it out if you do have that common sense.This is also logical, but it requires more investment and experience from you, and this means that you may be exposed to losses, so it is not an easy and profitable way to achieve profits as many people think it is. Perhaps instead of spending more time before developing “COMMON SENSE”, developing skills such as trading, Learning a programming language or another will bring you higher profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "November 03, 2023, 03:08:24 PM",
      "body": "Quote from: Husires on November 03, 2023, 12:38:40 PMThis is also logical, but it requires more investment and experience from you, and this means that you may be exposed to losses, so it is not an easy and profitable way to achieve profits as many people think it is. Perhaps instead of spending more time before developing “COMMON SENSE”, developing skills such as trading, Learning a programming language or another will bring you higher profits.Skills that are quite easy to learn, such as trading, are better done than having to wait more time to develop COMMON SENSE. Other skills such as programming for crypto and this require consistency and in-depth study. It's not easy to learn programming from scratch, but if you have the strength, everything can be done well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "November 03, 2023, 06:10:46 PMLast edit: November 03, 2023, 06:27:05 PM by Bitstar_coin",
      "body": "Absolutely, where it is not possible to read such permission before signing any approval, it is better to use tools like wallet guard, pocket universe, revoke cash to stay protected. Some of this so-called airdrop can be wallet drainer which most people are not able to quickly detect, having this extension installed in your browser can somehow protect the user and gives you a notification over any harmful or suspicious site.Quote from: cheezcarls on October 26, 2023, 06:58:57 PMIn your Metamask or any EVM-compatible hot wallet, make sure that you make a habit of disconnecting and revoking permissions to specific sites after you're done using their platform. And speaking of common I doubt it will help much in identifying scammers if these tools are not fully utilise. And just like you, I also fall victim of download but the experience made me to be more security conscious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "November 03, 2023, 07:53:50 PM",
      "body": "The list of tools that OP suggested does the same thing so there is no point in using them all together. Those tools are really useful and I use two of them whenever I want to use any DeFi services. It is good that you have suggested those tools for the airdrop farmer as this activity requires lots of transactions in the smart contract and some of them are vulnerable to hacking and exploiting. These tools can add an extra layer of security to your wallet but there is no guarantee that they will make it immune to any potential attack. So always cross-check when interacting with any smart contact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}