{
  "id": "topic_5461264",
  "title": "Moreno233",
  "author": "Moreno233",
  "created_time": "July 28, 2023, 03:12:41 AM",
  "content": "The more businesses begin to integrate crypto payment in their daily  activities, the more we see real progress regarding the entire concept. As of today, over 60,000 electric vehicle charging stations now accept Bitcoin across Europe, thanks to Lightening Network (source: https://mycryptowallet.com.au/news/bitcoin/bitcoin-now-accepted-at-60000-ev-charging-stations-across-europe/). Many businesses are also joining this trend as they realise the advantages offered by this amazing technology. Gradually,  we will see even deeper penetration of Bitcoin and cryptocurrency at large.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461264",
  "comments": [
    {
      "author": "Yamane_Keto",
      "created_time": "July 28, 2023, 09:31:29 AM",
      "body": "The figure of 60,000 EV is not the actual number or that works, but rather out of a total of 60,000, there are a number of stations in the experimental stages, and according to the article, the number is 8898 that were experimental, however, there are no confirmations regarding the real residences and whether they are accurate.QuoteDisclaimer: Of the 60,000 EV charging points reportedly supporting Bitcoin payments in Europe, a large number is still in the experimental phase, and Satimoto is yet to publish the exact number and an updated map.QuoteAlthough the company has not yet said how many of these 60,000 charging points are experimental at the moment, the release of an updated, full map is coming soon, Satimoto said on July 26, as it celebrated reaching 2,000 Twitter followers.Source https://mycryptowallet.com.au/news/bitcoin/bitcoin-now-accepted-at-60000-ev-charging-stations-across-europe/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "July 28, 2023, 10:14:31 AM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMThe more businesses begin to integrate crypto payment in their daily  activities, the more we see real progress regarding the entire concept. As of today, over 60,000 electric vehicle charging stations now accept Bitcoin across EuropeNot all of them are already installed and operating and will they all legally now and in future. I guess they will be like Bitcoin ATMs that grow fast and latest months. They only accept Bitcoin on Lightning Network and I hope they will accept Bitcoin on mainchain too.They should have options for their users but they will have to install two different softwares, on chain and Lightning Network.Quotethanks to Lightening Network It is Lightning Network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 28, 2023, 10:58:17 AM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMThe more businesses begin to integrate crypto payment in their daily  activities, the more we see real progress regarding the entire concept. The concept is good enough and the adoption is made easy together with bitcoin lightning network everything incorporated together for the people to use, we cannot actually phantom the exact numbers of users to be precise since they are increasing everyday with adoption all over europe, this alone could be more reasons to make bitcoin users increases more and their business enterprise going well with more interested people ready to use bitcoin for payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "July 28, 2023, 11:20:35 AM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMThe more businesses begin to integrate crypto payment in their daily  activities, the more we see real progress regarding the entire concept. As of today, over 60,000 electric vehicle charging stations now accept Bitcoin across Europe, thanks to Lightening Network (source: https://mycryptowallet.com.au/news/bitcoin/bitcoin-now-accepted-at-60000-ev-charging-stations-across-europe/). Many businesses are also joining this trend as they realise the advantages offered by this amazing technology. Gradually,  we will see even deeper penetration of Bitcoin and cryptocurrency at large. We can see a deeper penetration once bitcoin became legal to major countries. But for now we cannot enjoy yet its use case so rather waiting that for come then we should look at it on other perspective like use this on investment side since this is more ideal for now rather than wait for those acceptance to come since we might get outdated or miss some opportunity when bitcoin price is so cheap and also we didn't trade for couple of times it fluctuates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 28, 2023, 11:44:03 AM",
      "body": "It’s indeed a welcomed innovation where we have more recent innovations having to incorporate systems of our times like bitcoin payment for a yet to be very regular EV charging stations. Though, I would like to note that the quote talks about a percent of the over 60,000 existing stations to have incorporated this payment media for service rendered and purchases as such, exaggerating the facts to it makes it a little sketchy @OP.Quote from: arwin100 on July 28, 2023, 11:20:35 AMWe can see a deeper penetration once bitcoin became legal to major countries. But for now we cannot enjoy yet its use case so rather waiting that for come then we should look at it on other perspective like use this on investment side since this is more ideal for now rather than wait for those acceptance to come since we might get outdated or miss some opportunity when bitcoin price is so cheap and also we didn't trade for couple of times it fluctuates.Possibly that would bring about an explosion of the bitcoin used case but that has only hindered so much especially when it has to do with businesses.One of the sides to it is, its volatile nature. Should bitcoin some day attain some stability, it would promote its usage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 28, 2023, 12:01:09 PM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMAs of today, over 60,000 electric vehicle charging stations now accept Bitcoin across Europe, 60,000 is not an actual number that is operational and effectively used, but it is likely to reach this number in the next few years. Of course this is good news, bitcoin is getting closer to massive use in the world of global paymentsIn my opinion, when the world is getting more advanced, transportation is getting easier, it requires payments that are accepted in every country. One of the many currencies owned around the world is bitcoin. So I think using bitcoin as currency for global payments is the solution of the future. Bitcoin is increasingly trusted by many people. It is only a matter of time until bitcoin will be widely used and accepted around the world. I think we hope that will happen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 28, 2023, 12:24:26 PM",
      "body": "The integration of lightning network really seems flawless for some estbalishment or business enterprise cause of its cheap and fast action. But surely the mainnet of bitcoin can be adopted too not just that. Also better if other tokens or blockchain too. Its not about bitcoin anymore but any altcoins that make progress too in the cryptocurrency and blockchain industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptospb22",
      "created_time": "July 28, 2023, 12:49:36 PM",
      "body": "Cryptocurrency is generally top, it is beautiful))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 28, 2023, 12:57:57 PM",
      "body": "Quote from: arwin100 on July 28, 2023, 11:20:35 AMWe can see a deeper penetration once bitcoin became legal to major countries. ~snip~In which of the major countries in the world is Bitcoin illegal? I know that it is officially banned for trading in China, but I am more surprised that it was ever possible to legally trade and mine Bitcoin in that country, considering how communism works.Bitcoin is not illegal in the UK, EU, US, Canada or Australia and anyone can trade with it or use it as a means of payment, and I don't see what all those countries should do to make Bitcoin penetrate even deeper, as you say. The problem is not in the laws, but in people who buy BTC as an investment and do not want to use it as a currency, and even if they want to, believe me that many are not capable of making a simple transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "July 28, 2023, 01:19:54 PM",
      "body": "That's a no brainer for businesses to do, bitcoin's been here for about a decade now and it's kind of stupid of them to not include bitcoin in their business model, what I mean by that is when you integrate bitcoin to your business is:It helps diversify your payment options, say for example there's two gas stations out there, one only accepts cash and the other accepts credit cards, who do you think will have more customers flocking in? Of course that would be the gas station that accepts credit cards for payments too. Plus, bitcoin integration in business attracts new customers which means a good thing for your business. Integration also means that you're an inclusive business, not everyone has access to traditional financial systems out there although they do have the Internet which is splendid because they can use bitcoin as a way to pay your business, better PR for your business because you're not just inclusive for the sake of being called inclusiveWhen you integrate bitcoin in your business, you're doing your part in bitcoin/crypto education because believe it or not, a lot of people are still uninformed, not aware and misinformed about bitcoin, so another PR for your business.Remember though, even if you think that it's all good for businesses to integrate bitcoin, some factors are needed to be considered like:Bitcoin is always volatile and always will be, considering that you are running a business, you really can't risk yourself losing profit because the price of bitcoin suddenly dropped so you're most likely going to convert it quickly to prevent potential losses in profitsBitcoin integration will definitely introduce you to more complexities in your taxation, it's different for each place/country so make sure that you are well-informed about the countries tax laws regarding bitcoin or cryptocurrency.Security is a bit of thing to consider and a good thing for your business but I would put it here since it's business we're talking about,you will need to invest some money for security if you want to make sure your bitcoin's are secured and that the people paying with bitcoin is safe when you're doing transaction with themQuote from: cryptoaddictchie on July 28, 2023, 12:24:26 PMIt's not about bitcoin anymore but any altcoins that make progress too in the cryptocurrency and blockchain industry.I wouldn't 100% agree with that, maybe about 50%... bitcoin's still the hot stuff of the market and no altcoin has yet ever been close to beating bitcoin when it comes to price so for now I would say that we should focus on bitcoin for now, most of the successful altcoins anyway are in a sense coattail riders. So when bitcoin becomes more successful, so will those altcoin be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 28, 2023, 01:22:18 PM",
      "body": "Quote from: Latviand on July 28, 2023, 01:19:54 PMI wouldn't 100% agree with that, maybe about 50%... bitcoin's still the hot stuff of the market and no altcoin has yet ever been close to beating bitcoin when it comes to price so for now I would say that we should focus on bitcoin for now, most of the successful altcoins anyway are in a sense coattail riders. So when bitcoin becomes more successful, so will those altcoin be.Cant disagree with that but for the sake of adoption it would be best to have more options isnt it? Of course Im talking about top projects only like ethereum. Its not like bitcoin will be forever on the top, no one can assure that as the ball is round and it could lead to somewhere in the future. Who knows what tech or innovation some altcoin can totally overtake bitcoin in terms of every aspect it has to offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "July 28, 2023, 01:27:37 PM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMThe more businesses begin to integrate crypto payment in their daily  activities, the more we see real progress regarding the entire concept. As of today, over 60,000 electric vehicle charging stations now accept Bitcoin across Europe, thanks to Lightening Network (source: https://mycryptowallet.com.au/news/bitcoin/bitcoin-now-accepted-at-60000-ev-charging-stations-across-europe/). Many businesses are also joining this trend as they realise the advantages offered by this amazing technology. Gradually,  we will see even deeper penetration of Bitcoin and cryptocurrency at large. Bitcoin as a payment mode is really something we have waited for a long time but EV technology is not much popular at least in the major global markets as Asiaian Countries are still struggling to bring this technology into common use. Lightning Network really Opened a whole new dimension of the Bitcoin use case. More likely global adoption seems not far away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 28, 2023, 01:39:21 PM",
      "body": "The beauty would be in that everyone would pay at those stations every time they top up, but as has already been said the headline is kind of clickbait, and just because the payment option is available doesn't mean that people will usually pay with it, although that's something. No matter how much facilities are implemented to pay with Bitcoin, I don't see that the use is going to be massive. What are people going to do? Spend the Bitcoin and save in fiat?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "July 28, 2023, 01:53:12 PM",
      "body": "companies are starting to see the opportunities and benefits of using the lightning network. what we are waiting for is the success of implementing this new payment system for all developing industries in the world. Satoshi's dream of using Bitcoin as a means of payment will probably come true when more and more companies will adopt this system.this may not only be for Bitcoin but cryptocurrency as a whole which has the benefit of being a viable payment alternative to Fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "July 28, 2023, 02:20:48 PM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMThe more businesses begin to integrate crypto payment in their daily  activities, the more we see real progress regarding the entire concept. As of today, over 60,000 electric vehicle charging stations now accept Bitcoin across Europe, thanks to Lightening Network (source: https://mycryptowallet.com.au/news/bitcoin/bitcoin-now-accepted-at-60000-ev-charging-stations-across-europe/). Many businesses are also joining this trend as they realise the advantages offered by this amazing technology. Gradually,  we will see even deeper penetration of Bitcoin and cryptocurrency at large. This will certainly be better for the development of Bitcoin and the technology contained therein along with a brighter future for Bitcoin from year to year. Because when people from various parties start to realize the uniqueness that Bitcoin and cryptocurrency have, of course Bitcoin and cryptocurrency users will continue to increase because people will want to accept Bitcoin and cryptocurrency in their lives in any way. And if all of Europe starts accepting Bitcoin and cryptocurrencies, whether in companies or other medium-sized businesses, it will make a big impact on the use of Bitcoins and cryptocurrencies that will spread to all corners of Europe and beyond. So that major developments in Bitcoin and cryptocurrency will be increasingly seen every year in various countries in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "July 28, 2023, 02:22:27 PM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMsource: https://mycryptowallet.com.au/news/bitcoin/bitcoin-now-accepted-at-60000-ev-charging-stations-across-europe/Quote“leveraging the security of the Bitcoin protocol and the speed of the Lightning Network to stream payments.”Even without the LN implementation, I think bitcoin mainnet is actually more applicable in the EV charging than other businesses, it allows payments to get multiple confirmations before the charging time is complete.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "July 28, 2023, 02:22:53 PM",
      "body": "Quote from: cryptospb22 on July 28, 2023, 12:49:36 PMCryptocurrency is generally top, it is beautiful))Not all cryptocurrency has a standard like Bitcoin.Bitcoin is on the top, and it will remain on the top.The dominance might go down as long as new coins appear.But it will make Bitcoin stronger.There was a saying like The more I see dogs, the more I hate humans. The more you will see shitcoins, the more you will like Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "July 28, 2023, 02:26:50 PM",
      "body": "That's the future we want to see, as only massive adoption would make Bitcoin stable and increase its value. As of now, it's still volatile like any other assets in the crypto space. The Lightning Network would help in making fast and cheap transactions, so hopefully, it will be promoted more, and more companies will adopt it.In Bitcoin, there's no limit in terms of adoption, as it's a decentralized transaction asset. The only hindrance is when the government tries to discourage people from using crypto, fearing it might result in the devaluation of their fiat assets, which are often associated with corruption. So, if we want to see crypto consistently grow in the long run, we should offer consistent support as well, whether big or small, as it's already a significant contribution to reach our goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 28, 2023, 02:45:10 PM",
      "body": "Quote from: Moreno233 on July 28, 2023, 03:12:41 AMThe more businesses begin to integrate crypto payment in their daily  activities, the more we see real progress regarding the entire concept. As of today, over 60,000 electric vehicle charging stations now accept Bitcoin across Europe, thanks to Lightening Network (source: https://mycryptowallet.com.au/news/bitcoin/bitcoin-now-accepted-at-60000-ev-charging-stations-across-europe/). Many businesses are also joining this trend as they realise the advantages offered by this amazing technology. Gradually,  we will see even deeper penetration of Bitcoin and cryptocurrency at large. Well the Bitcoin economy entirely depends on its circulation and demand. The more circulation it will have, the more demand it will generate. So it's an encouraging news to know that 60,000 EV charging stations are now accepting Bitcoin payments through LN. It's good that Europe has a crypto friendly policy. Unfortunately, for the rest of the world, cryptocurrency is still seen as a threat to the economy due to the propaganda run by the banks. Unless a crypto friendly policy is passed by the government, it would not allow merchants to accept bitcoin as a payment method. Still a long way to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}