{
  "id": "topic_5464920",
  "title": "sesterceshop",
  "author": "sesterceshop",
  "created_time": "August 29, 2023, 05:45:10 AM",
  "content": "Three former members of the PEPE community are alleged to have stolen $16 million worth of PEPE tokens from the project's multisig wallet and transferred control to the only remaining member.The anonymous founding member clarified the situation, explaining that the ex-team members stole the funds and abandoned the project, leaving control in the hands of the remaining member. The stolen funds were sent to exchanges for selling, while the remaining member and the remaining 10 trillion PEPE tokens are secured.The remaining member is now focused on moving forward in the best interest of the PEPE community. This is what happens when you trust anonymous frogs with your money.Source: https://cointelegraph.com/news/rogue-pepecoin-team-members-blamed-for-pepe-multsig-withdrawal",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464920",
  "comments": [
    {
      "author": "Husires",
      "created_time": "August 29, 2023, 06:30:44 AM",
      "body": "from the beginning they were planning to steal customers’ money, they spent a lot of money in advertising and advertising, it is time to make profits and start new scam altcoin investments, and even the only remaining developers are there to revive the project when the price of Bitcoin rises and to make easy profits.What will happen is that PEPE will turn into a dead currency until the market boom date comes when the last pump will happen before the project ends.Investing in projects that offer nothing but extensive publicity and promotion is support for these scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 29, 2023, 06:45:52 AM",
      "body": "Probably pepe would have dip more in price, but a whale bought at a lower price which might strengthen back pepe investors confidence:Quote from: https://cointelegraph.com/news/pepe-whale-seizes-dip-opportunity-buys-529k-worth-of-tokensAfter the value of the frog-themed memecoin Pepecoin dropped by approximately 15% due to recent modifications to a multisig wallet and concerns about potential developer manipulation, a significant Pepecoin holder spent 320 Ether valued at $529,000 to acquire 640 billion Pepecoin tokens.On pepe office X (formerly known asTwitter) channel, this was discussed about the second day or so that the pepe token were transfered to OKX, Binance, Kucoin and By it.https://twitter.com/pepecoineth/status/1695267128428114005?t=upfdyZg7NuVMP8CDlm0Twg&s=35The remaining coin which is 10.6 trillion peoe as been moved to another multisig wallet with the contract address 0x9f5E46E4990dee30665b2e803BA134564D1e087Fhttps://twitter.com/pepecoineth/status/1695281689151570102?t=0q6xXJlagiavCeThOlVhNQ&s=35All these may be true or lies. How can we know that the people that tweeted that are not behind the pepe sent to those four exchanges that were sold?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 29, 2023, 07:16:32 AM",
      "body": "And here we go, the problem is revealing.From the name and the project, I already know some of these shit-drama are gonna to be happened for meme project. That's why they are should be avoided in any cost, but people refusing these shit.Now, eat the the drama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VFalcon",
      "created_time": "August 29, 2023, 02:55:25 PM",
      "body": "Invest in a TFS token and you'll be happy. Do not risk investing in dubious memtokens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 30, 2023, 03:07:20 AM",
      "body": "Quote from: _act_ on August 29, 2023, 06:45:52 AMAll these may be true or lies. How can we know that the people that tweeted that are not behind the pepe sent to those four exchanges that were sold?An investment of $529,000 does not mean much for the money they spent, which may be worth $16M, and I think it is a forward maneuver to keep this currency \"alive\", but at a low price, which means that they will pump when the price rises again instead of converting it into a dead currency or fraud.Only days will reveal these things, but investing in this currency is a waste of money. Sell now or wait until the price is zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martinex",
      "created_time": "August 30, 2023, 04:25:27 AM",
      "body": "Yes. one of the other reasons for the increase in the Pepe coin price is that its inclusion on well-known stock exchanges has increased its legitimacy and opened up opportunities for a wider range of investors.Just the name meme coin and it is synonymous with having fun and this is proof of why you should be more careful with FOMO on meme coins even though some people take it seriously when they buy it and hope that there will be significant changes after hodl for a while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supianto",
      "created_time": "August 30, 2023, 06:28:09 AM",
      "body": "Finally people will see that PEPE is a shitcoin. I mean, a lot of people knew that, but some were trying to convince me that PEPE is legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 30, 2023, 09:25:19 AM",
      "body": "Quote from: Supianto on August 30, 2023, 06:28:09 AMFinally people will see that PEPE is a shitcoin. I mean, a lot of people knew that, but some were trying to convince me that PEPE is legit.It is a shitcoin and regardless whether its legit or not everyone must have a critical thinking on taking profits when you encounter something like this. We all knew that anonymous projects are tend to rug and thus type isnt different to those since Pepe become a mainstream memecoin. Imagine old members of a team stole money and give up their friendship over what $16m maybe it is worth to change heart but a very unprofessional action on their part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "August 30, 2023, 09:49:52 AM",
      "body": "From the start I warned you not to try putting your money in meme coins. Think about what capabilities and offers they can offer that would make you want to save and give them your money? Community? That's the nonsense of meme projects that can't offer any other benefits from their projects other than just a community that claims to be strong so the price will continue to rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "benalexis12",
      "created_time": "August 30, 2023, 12:53:28 PM",
      "body": "Quote from: Supianto on August 30, 2023, 06:28:09 AMFinally people will see that PEPE is a shitcoin. I mean, a lot of people knew that, but some were trying to convince me that PEPE is legit.I am not depending on Pepe, I know a lot of people who think Pepe is just one piece of sh*t. But in reality, if Pepe is shitcoin, why is this shit you called listed on different top exchanges in the crypto industry? Problems are always present in each cryptocurrency in this field of business. Many in the community have looked down on Pepe ever since it was started, but what happened was that it was all of a sudden listed as one of the top coins in cryptocurrency. And those who called Pepe a shitcoin were embarrassed. And if this happened now, I think this is just normal for the coin, and yet in the long run, we will see it survive the chance we didn't expect to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 30, 2023, 05:30:53 PM",
      "body": "Quote from: Supianto on August 30, 2023, 06:28:09 AMFinally people will see that PEPE is a shitcoin. I mean, a lot of people knew that, but some were trying to convince me that PEPE is legit.I would argue that everyone shilling it knew it was a shitcoin. It's an unspoken agreement that people don't speak ill about the coins/tokens they hold. They just keep shilling them, as you can make a ton of money with absolute useless garbage, because when it will rise from nothing (microcap to lowcap), you have already made more than enough money for that year depending what you put in originally.This is why these stories get so much press time. Everyone wants to identify with that guy who made $200 to $2M. It makes it seem possible even though it will happen for handful of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "August 30, 2023, 06:04:02 PM",
      "body": "Have you heard this news before one of the founders escaped by stealing a lot of PEPE tokens. Damn this will be a lot of drama.There is another rumor that about PEPE that the founder of FTX-SBF helped set up PEPE.Sourcehttps://twitter.com/WhaleChart/status/1695176511320371518https://twitter.com/Nebraskangooner/status/1694849312335749609More and more attributed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "August 30, 2023, 06:27:27 PM",
      "body": "The way the pepe coin really tend was amazed but I knew something would eventually happen that could bring the liquidity of the market. The hype of pepe was really great that it was the third biggest Crypto project then after Ethereum. I was really amazed and how the team were able to push the project to the moon. The hype was really big making it to trend slot. I just hope that this is not going to make investors to lose hope in the project that could lead to total downward trend. I hope to see the project up again if the team can retain the past glory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "August 30, 2023, 06:35:04 PM",
      "body": "Quote from: $crypto$ on August 30, 2023, 06:04:02 PMHave you heard this news before one of the founders escaped by stealing a lot of PEPE tokens. Damn this will be a lot of drama.There is another rumor that about PEPE that the founder of FTX-SBF helped set up PEPE.Sourcehttps://twitter.com/WhaleChart/status/1695176511320371518https://twitter.com/Nebraskangooner/status/1694849312335749609More and more attributed. There's a lot of FUD about PEPE but I'm amazed that the price didn't really go down significantly. Maybe the founders haven't really sold the stolen funds. If this news are true, I'm really expecting it to be honest since there's a lot of red flags about pepe even if it's a meme coin, sooner or later they will do an exit scam knowing that all of the project team members and the developers are anonymous. This is why I don't really like memecoins/shitcoin since it there's a lot of way that developers can leave the project or abandon it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "August 30, 2023, 07:37:23 PM",
      "body": "This is one reason why these meme coins are needed to be avoided. Because these are projects likely made for test if it will click in the market and people will invest on it.And once it is unsuccessful, they'll just abandon it and once it becomes successful, it is also unavoidable that they're going to have their own pockets filled first.Regardless of the result, it's always the investors are going to be in trouble with these dramas made by these founders, co-founders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "August 30, 2023, 07:58:06 PM",
      "body": "Not sure if this is true or not. However, I can also say that when everyone is making money amongst themselves, sooner or later there will be one or two members of the team that will do something bad, not saying that they are going to steal something, but perhaps it's human nature to be greedy when there is a lot of money involved just like in this project. Wherein it was go as it was the first BRC20 token and so everyone wanted to get on-board pushes the price and then developers seeing that huge money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 30, 2023, 08:26:19 PM",
      "body": "I fell for it & bought near to the PEPE top. I should know better, I’ve been in crypto for many years but I jumped n the hype train, thinking it would keep pumping. It wasn’t much in relation to my net worth but enough to be annoyed about. Let this be a lesson to dreamy noobs……bitcoin only, OK maybe some ETH too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "August 30, 2023, 09:27:09 PM",
      "body": "Quote from: sesterceshop on August 29, 2023, 05:45:10 AMThree former members of the PEPE community are alleged to have stolen $16 million worth of PEPE tokens from the project's multisig wallet and transferred control to the only remaining member.The anonymous founding member clarified the situation, explaining that the ex-team members stole the funds and abandoned the project, leaving control in the hands of the remaining member. The stolen funds were sent to exchanges for selling, while the remaining member and the remaining 10 trillion PEPE tokens are secured.The remaining member is now focused on moving forward in the best interest of the PEPE community. This is what happens when you trust anonymous frogs with your money.Source: https://cointelegraph.com/news/rogue-pepecoin-team-members-blamed-for-pepe-multsig-withdrawalNot shocking with these types or kinds of sentiments or events that could happen in a snap which we know that if a human being is being that blinded with those $$$$ then for sure they could easily messed up a certain project would really be just simply jumping offboard and leave everything behind for the sake of money. Its never been something new on which it would really be not that shocking anymore if there would be some sudden hacks and exploits or unauthorize on selling out those coins.Checking out the price of $PEPE on which the price hadnt really dipped down so much and considering that $16M isnt a small thing then good to see that it didnt dropped down into the floor. It turns out that those greedy shitty members cant really have a good hold into themselves and been burned down by their greed.Well, thats how human being which we do have that greediness inside. They do just waste off that opportunity on having more if $PEPE demand would becoming even more bigger but welleverything is something that cant be known.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "August 30, 2023, 09:51:03 PM",
      "body": "Quote from: sesterceshop on August 29, 2023, 05:45:10 AMThree former members of the PEPE community are alleged to have stolen $16 million worth of PEPE tokens from the project's multisig wallet and transferred control to the only remaining member.The anonymous founding member clarified the situation, explaining that the ex-team members stole the funds and abandoned the project, leaving control in the hands of the remaining member. The stolen funds were sent to exchanges for selling, while the remaining member and the remaining 10 trillion PEPE tokens are secured.The remaining member is now focused on moving forward in the best interest of the PEPE community. This is what happens when you trust anonymous frogs with your money.Source: https://cointelegraph.com/news/rogue-pepecoin-team-members-blamed-for-pepe-multsig-withdrawalThere are still people who hold/buy it till today? I honestly thought people would've realized it was done and over after that initial pump from release (which was basically manipulation imo). It was an absolute shtfest when it was released and while I think people could've profited off of it early on if they were lucky, anything past that would've been nothing but losses. Even a minor profit would be considered a loss considering the time spent imo, I'd much rather move on to other coins isntead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}