{
  "id": "topic_5497782",
  "title": "Kevystia",
  "author": "Kevystia",
  "created_time": "May 25, 2024, 08:23:23 PM",
  "content": "Deutsche Bank analysts looked for the reasons that explain the surge in the cryptocurrency bitcoin, whose price has approached in recent days to reach a new all-time high of $69,000. They identified five possible reasons for this surge: 1:The influx of capital into bitcoin ETFs. 2: An increase in the number of ETFs linked to cryptocurrency. 3:An increase in the scarcity of bitcoins 4: Easing of financial conditions 5:Advances in regulation          Since the approval by the SEC of ETFs tracking the price of bitcoin in the United States, passive instruments that track the cryptocurrency have seen capital flow in, with nearly 7,  9 billion dollars according to the bank. In a note published on February 29, Bank of America Securities strategists noted that year-to-date flows of $7.7 billion into bitcoin ETFs exceeded the previous record inflow of $5.2 billion.  observed in 2021.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5497782",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "May 25, 2024, 08:43:03 PM",
      "body": "Quote from: Kevystia on May 25, 2024, 08:23:23 PMwhose price has approached in recent days to reach a new all-time high of $69,000.Bitcoin has been above $69,000 for quite a while now and it hit a new all time high of $73,750 on March 14, 2024, according to Coin Market, that should be about 2 months since then. While the factors you mentioned may have influenced Bitcoins price surge, I believe many investors were anticipating a bull market. There is already a longstanding belief that bull markets follow Bitcoin halving events, which drove many new investors to buy Bitcoin before the halving. Actually,the approval of Bitcoin ETFs also significantly contributed to the bull market as seen when Bitcoin price rose from around $30,000 to $40,000 in late 2023 and has been rising since then",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "May 26, 2024, 10:54:42 AM",
      "body": "Quote from: Hatchy on May 25, 2024, 08:43:03 PMQuote from: Kevystia on May 25, 2024, 08:23:23 PMwhose price has approached in recent days to reach a new all-time high of $69,000.Bitcoin has been above $69,000 for quite a while now and it hit a new all time high of $73,750 on March 14, 2024, according to Coin Market, that should be about 2 months since then. While the factors you mentioned may have influenced Bitcoins price surge, I believe many investors were anticipating a bull market. There is already a longstanding belief that bull markets follow Bitcoin halving events, which drove many new investors to buy Bitcoin before the halving.It’s all that everyone could talk about.Following the past halvings, it was observed that they all kick started the bull run. So people started encouraging people to buy or accumulate bitcoin as much as they can because they were all expecting it to reach a ath past halving. What everyone didn’t expect is that it would hit a new ath even before the halving which occurred during month of april. So many people believe that the early record of ath may have been a product of etf approval.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Filippo Spina",
      "created_time": "May 26, 2024, 02:27:56 PM",
      "body": "Don't listen to the analysis of a bank when determining how bitcoin is doing.Bitcoin is more than the price, which yes it does look beautiful doesn't it?But, to stay on topic, you listed many ways the price of BTC is affected.You didn't mention, however, that price attribution and resistance can also be affected by projects that are being worked on in private that may or may not affect the price in the future.We're all playing against people/whales/software developers that are all talking to each other in secret chats on Telegram/Signal, as Vitalik said in a Lex Fridman interview. Hell, some don't even use that and stick to purely PGP communication.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}