{
  "id": "topic_5402347",
  "title": "Maestro75",
  "author": "Maestro75",
  "created_time": "June 13, 2022, 06:34:51 AM",
  "content": "I do not know if this topic has been shared here before but it is something that has given me serious concern. Eventhough I have been registered here a long time ago, I still find it difficult learning and understanding bitcoin technical aspect, the blockchain and development. I know this is a shame to admit but that is what am faced with. I once tried to read the white paper but could not make much meaning out of it. Is this just only me as someone who has zero knowledge of science or there are also people who are in science but still find learning bitcoin confusing and challenging? Is there a way out of this? Please am not asking for books to read. I need real life experiences of those who passed through this and overcame it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402347",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "June 13, 2022, 06:53:25 AM",
      "body": "Quote from: Maestro75 on June 13, 2022, 06:34:51 AMI know this is a shame to admit but that is what am faced with.There is no shame in having less knowledge in a certain field or having trouble learning that field. We are not all supposed to be best at everything.QuoteI once tried to read the white paper but could not make much meaning out of it. Is this just only me as someone who has zero knowledge of science or there are also people who are in science but still find learning bitcoin confusing and challenging?Bitcoin paper is a bit hard to understand, it is too abstract and not written in a newbie friendly way. I suppose every newcomer has trouble fully understanding everything about it.QuoteIs there a way out of this? Please am not asking for books to read. I need real life experiences of those who passed through this and overcame it.It depends on how much you want to learn. To have a general idea of how the technology works there are some websites that have good information like Coindesk's learn section in user friendly language.Obviously if you want to learn more and take a deeper dive into the technology, your work becomes increasingly harder and you have to find a book to read like Mastering Bitcoin by Andreas Antonopoulos.The way I learned was by selecting a small topic and focusing on that. For example focusing on wallets and basic cryptography used in a wallet like what private keys are, how they are created and how does that create an address. Then moved on to addresses, their types and bitcoin scripts. In this process, for a long time since mining didn't interest me I had no idea how it worked although I knew almost everything else.I don't think there is a solution that fits everyone, you just have to first decide how much you want to learn and then slowly start gathering knowledge and keep asking others to help you on specific topics (instead of a general question).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "June 13, 2022, 07:25:16 AM",
      "body": "I also had the same question before[1][2], but you know what? I have realized that it is up to you to decide what specific area of knowledge in crypto you want to dive in and what approach you need to take to best absorb the knowledge like a sponge. In general, cryptocurrency is a multifaceted discipline that includes themes such as finance, economics, investing, trading, security, cryptography, and whatnot.Personally, since my course is inclined toward the technical aspects (e.g., programming, hardware, etc..) and is interested in trading; I chose both fields where I read 1 article related to them per day. Joined a Reddit community that has access to quality resources, and I've been watching videos to supplement what I've learned because I grasp the concept better with visuals and narration.It might be overwhelming at first, but as long as you learned something new, the knowledge you get will surely accumulate overtime  . Hope that helps[1] https://bitcointalk.org/index.php?topic=3315217.0[2] https://bitcointalk.org/index.php?topic=5253901.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "June 13, 2022, 09:28:47 AM",
      "body": "Quote from: Maestro75 on June 13, 2022, 06:34:51 AM Eventhough I have been registered here a long time ago, I still find it difficult learning and understanding bitcoin technical aspect, the blockchain and development. I know this is a shame to admit but that is what am faced with. I once tried to read the white paper but could not make much meaning out of it.There is no shame in it buddy, bitcoin whitepaper is tehnical indeed and you need some prior knowledge to understand it properly. But even understanding every aspect of bitcoin, you can use it without any issues whatsoever as you you really have to know is how to secure your bitcoins and how not to overpay transactions. After all, vast majority of people that that are using fiat have no idea how its created yet it doesn't stop them from using it. So don't let lack of deeper bitcoin understanding stop you from using it.Quote from: Maestro75 on June 13, 2022, 06:34:51 AMIs there a way out of this? Please am not asking for books to read. I need real life experiences of those who passed through this and overcame it.If you are not fan of reading the books, I suggest you to check  series of YouTube videos Bitcoin for Beginners Playlist: Intro to Bitcoin, Satoshi, Security, Mining and More in which Andreas Antonopoulos covers Bitcoin basics in layman terms. His videos (and books) were a great help for me and it can probably help you as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "June 13, 2022, 09:38:01 AM",
      "body": "Quote from: Maestro75 on June 13, 2022, 06:34:51 AMI do not know if this topic has been shared here before but it is something that has given me serious concern. Eventhough I have been registered here a long time ago, I still find it difficult learning and understanding bitcoin technical aspect, the blockchain and development. I know this is a shame to admit but that is what am faced with. I once tried to read the white paper but could not make much meaning out of it. Is this just only me as someone who has zero knowledge of science or there are also people who are in science but still find learning bitcoin confusing and challenging? Is there a way out of this? Please am not asking for books to read. I need real life experiences of those who passed through this and overcame it.There's no need to learn deeper on technicality as long as you know the basics and how to use it properly. Not all user here has the programming skills to fully understand the code and math behind Bitcoin specifically blockchain. I myself am not familiar with the technicalities, especially the code but I know how the blockchain works and what's Bitcoin feature, Further than that is I already leave it to developers and people who have worked in the same field.Let's sight some examples here. Smartphone, You knew how to use it and what its part but do you even bother how it's inside work, especially its program?  We don't need to know everything but it's always good to have a knowledge on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 13, 2022, 09:55:42 AM",
      "body": "Quote from: Maestro75 on June 13, 2022, 06:34:51 AMI still find it difficult learning and understanding bitcoin technical aspectLearning bitcoin is just as thesame procedures required in general learning in life which has to be from the basics down to the advance level of a system, bitcoin is what one can encourage newbies to start by learning what cryptocurrency means and how bitcoin stand out of all other cryptos, learn about wallet and types, learn some basic terms in bitcoin, how to buy and sell it, exchanges and their types and so on, one cannot start with the technical aspects without the basics fundamental knowledge first which is more easier to learn than the technical aspects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 13, 2022, 10:52:24 AM",
      "body": "Don't force yourself to understand it all, because not everyone have same brain to understand it all in exact times. Keep slowly learning at the small thing by understanding how it's work and how to use it, how to secure your coins etc. Honestly an average Joe doesn't really need to understand the whole whitepaper in order to use Bitcoin, but there's nothing wrong if you want to understand the technical stuff. I'm also in learning progress to learn everything in the Bitcoin whitepaper, foremost you need to understand some alien words e.g. node, hash, nonce etc that really help you. For me, every time I learn each part or sentence about Bitcoin, I wrote down in my own words with a deeper research to understand more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "June 13, 2022, 11:21:27 AM",
      "body": "I also faced the same kind of struggles you are currently battling with, but i guess the reason was that i kept doing things wrongly then, trying to learn everything all at once, even when i am pretty sure that i am not tech-savvy, thus i just decided to go with the basics of Bitcoin, without delving into anything complex, and that was when i understood that i had been taking the wrong approach to learning Bitcoin, i learnt all i needed to know about how to use Bitcoin, how to store it safely, the best kind of wallets and the most secure of them, how to secure/protect my funds, etc.Mastering Bitcoin by Andreas Antonopoulus is a somewhat complex book divided into different chapters, but mind you that it is not all of its chapters that are complex, some are easy to understand and should get you to understand what is very necessary about Bitcoin, it is even written in the book that:QuoteMastering Bitcoin is a book for developers, although the first two chapters cover bitcoin at a level that is also approachable to non-programmers. Anyone with a basic understanding of technology can read the first two chapters to get a great understanding of bitcoin.So i can recommend that you read the first two chapters, and chapter 11 too that covers \"Bitcoin security\" which is a very important aspect for any Bitcoin enthusiast, this three chapters are easy to understand and will be of great help.Chapter one:  https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch01.asciidocChapter two:  https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch02.asciidocChapter eleven: https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch11.asciidoc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "June 13, 2022, 07:31:18 PM",
      "body": "I can relate, OP. I'm in Bitcoin world for relatively long time, but I can't say that my knowledge is advanced. Actually, I'm not even trying to go deep into technical details - it's dark forest for me. I'm not geek and these complicated technical things is difficult for me.And I don't think that all this advantage knowledge is needed for average user. For geeks, yes, it's interesting, but not everyone can be geek. Same like you don't have to know how to build your PC from scratch in order to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 13, 2022, 08:38:48 PM",
      "body": "I must commend that your doing okay. To have discovered that, you've got difficulty in grasping what is about a particular aspect of the cryptocurrency industry and you are actually making moves to its understanding is a welcomed development on your path @OP. You know, not so many care about visiting these boards. I ca tell you, I left it at a time and the more I do now is trying to read and see if I could link ideas from previous articles or threads to make sense. Don't just limit it to the forum alone, you could search out confusing terms using Google search engine and see how well you could follow. The cryptocurrency industry is such a vast one and it's forever evolving and one has got to be willing to go the length to understand what is really contained in it. Keep pushing and you'll sure to get the hang of it in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rufsilf",
      "created_time": "June 13, 2022, 09:44:18 PM",
      "body": "You can't be a multi-learner at times. Just like the other said, choose the area that you think suits you and have an idea about it. I know it was fun learning new things but if it does not our interests, I'm not sure if it will absorb into our minds, which probably will disappear after. Even for me, the technical aspect of Bitcoin is hard, I can do reading but to figure out how it was been doing, I can't. I could see some limitations which I consider myself about this. Oh, I accept the thing that I can't do things like that so I move on and focus on the area where I think I was good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "June 13, 2022, 10:14:22 PM",
      "body": "Learning is a gradual process especially when you are determine to learn cryptocurrency, you will have a specific directions or part you want to understand fully. I believe that bitcoin is something education you can achieve when you are conscious to learn. The technical aspects of bitcoin or cryptocurrency will say it's the hardened part of it, and if you are a good observer you will notice that even majority of users who create topic and thread here doesn't respond or create topic in technically board of bitcoin. But i believe that with attention you learn and understand the rudiments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Masplanc",
      "created_time": "June 13, 2022, 10:27:34 PM",
      "body": "Bitcoin technical is a big challenge to me, I tried reading books to get knowledge about the technical aspect of bitcoin but it was very complicated for me to understand it, since then I gave up about it. I think to learn it requires more time which some person may not have because of other daily activities consuming time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "June 13, 2022, 11:35:33 PM",
      "body": "I'll admit you just expressed the way I feel and what am currently passing through about Bitcoin trading.Like the technicality is one that overwhelms me.I'll love to read through others experience to add to my own personal growth in this business. So pls I look forward to see more encouraging live experienced and thoughtful comments.Thank to OP for such thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "June 14, 2022, 04:16:54 AM",
      "body": "I don't understand and don't care either, it's ok to not understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "June 14, 2022, 08:08:39 AM",
      "body": "Quote from: Masplanc on June 13, 2022, 10:27:34 PMBitcoin technical is a big challenge to me, I tried reading books to get knowledge about the technical aspect of bitcoin but it was very complicated for me to understand it, since then I gave up about it.Yes, books make it even worse. And that was why I said I did not want book recommendations. But it is a relief to read from people here to know that am not the only one who finds it difficult understanding bitcoin. Though I have invested in some tokens which are all down now, I do not want to end only at this level. I want to be able to know more so I can also teach and mentor others. Am not going to allow my blockhead stop me here. I will keep watching and learning. Thank you all for all your contributions. Am happy people took their time to respond to my issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 14, 2022, 08:19:28 PM",
      "body": "Quote from: Maestro75 on June 13, 2022, 06:34:51 AMIs there a way out of this?Of course and there is; it depends on how much time you're willing to devote for learning more about bitcoin. Things like how cryptography works theoretically, how a Bitcoin client works, how other software work etc. One thing that's also recommended is to make questions. You can't learn something if you're not willing to question it.I strongly recommend reading learnmeabitcoin.com, the Bitcoin wiki and lopp's Bitcoin information. Also, Mastering Bitcoin is a must-read. For questions, I suggest visiting this forum often and for more technical, stackexchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kasabus",
      "created_time": "June 14, 2022, 09:11:50 PM",
      "body": "Quote from: Maestro75 on June 13, 2022, 06:34:51 AMI do not know if this topic has been shared here before but it is something that has given me serious concern. Eventhough I have been registered here a long time ago, I still find it difficult learning and understanding bitcoin technical aspect, the blockchain and development. I know this is a shame to admit but that is what am faced with. I once tried to read the white paper but could not make much meaning out of it. Is this just only me as someone who has zero knowledge of science or there are also people who are in science but still find learning bitcoin confusing and challenging? Is there a way out of this? Please am not asking for books to read. I need real life experiences of those who passed through this and overcame it. It's never easy to learn bitcoin actually. Even if you keep reading the whole time, that won't be a guarantee that you'll know bitcoin well. That is why we have to gain not only knowledge but definitely more on skills as we can be more confident if we have a lot of experiences that will teach us valuable lessons from the past mistakes we did. But i believe if you are really eager to learn, reading is a good start and by that time you will gain a lot of ideas that will be more possible if you also supplement it with youtube demos and videos that are readily available on the internet. Always create the first steps and you'll eventually discover that you are learning already every now and then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 14, 2022, 09:15:18 PM",
      "body": "First off.  If you have a general question about Bitcoin then start researching yourself.  Google or Bitcoin Talk search are your best friends in this case.  See if the question has ever been answered before, and I am almost convinced it has since you are new to Bitcoin's technical side, and if the question does not exist anywhere then ask us over here.There are a few members on the forum who insisted with a ton of questions and all of them are usually answered, unless they are trolling or asking really dumb questions.  Even if some will mock you, if your ultimate goal is learning and some are happy to help then who cares.Second of all.  What I strongly suggest is risking a few dollars to test out Bitcoin thoroughly.  Install Bitcoin Core, install Electrum, put some dollars on these two and start trying everything out.  When you do not know what a function of the wallet does, ask Google or Bitcoin Talk.  To me at least, the key to easy learning of technical stuff is simply doing some practice.  Or if you want to do this without risking the money, I am pretty sure you can get some testnet Bitcoin to do it all for free.There must be no shame in your mind about not knowing more about Bitcoin.  None of us have been born with the complicated stuff in our brains so we all had to begin from the same point, zero knowledge.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "June 14, 2022, 10:11:26 PM",
      "body": "Quote from: Maestro75 on June 13, 2022, 06:34:51 AM~It's the same thing as being confused when you are trying to learn how the paper money is printed and the whole economy itself. Don't worry about it too much, bud. This forum is open for everyone trying to learn or just trying to have a discussion.I, myself, am just interested in blockchain programming but that's it. I do not know a lot about the technical stuffs in Bitcoin, but it does not worry me same goes on how I learn programming in general. It would be beneficial to learn a lot, but you don't need to nor should feel bad about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}