{
  "id": "topic_5452975",
  "title": "Kara3",
  "author": "Kara3",
  "created_time": "May 16, 2023, 06:10:04 PM",
  "content": "Financial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452975",
  "comments": [
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 16, 2023, 06:21:36 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education or 1million dollarsI will take the $1 million, then use some to aquire financial education and how to expand the money through business, Bitcoin investment and other investment. It's as simple as that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "May 16, 2023, 06:43:54 PM",
      "body": "Money still needs a compass to navigate in the right direction. The role of financial education is like a foundational cornerstone that serves as a benchmark for one's financial strength. It is a crucial knowledge to ensure that individuals spend their money wisely. Here are some key points in financial education:Set financial goals for yourself.Create a detailed budget plan and adhere to it.Manage debt effectively to prevent it from becoming a burden.Learn about investment options that align with your risk profile.Enhance your financial knowledge through attending seminars or reading books.Consult with financial experts to receive advice tailored to your situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 16, 2023, 06:45:40 PM",
      "body": "The fact is that education is the mother of financial stability and if your goal is to have financial independence then there is a need to have financial and other basic education and I will say for any individual to be able to act responsibly with his/her financial dealings both in making the money and also in spending it all need some levels of education to succeed in them.1 million dollars may be an abv amount and can change the financial life of anyone but only those with the knowledge of financial management can utilize that money to make something good out of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "May 16, 2023, 06:52:20 PM",
      "body": "Quote from: Ojima-ojo on May 16, 2023, 06:45:40 PMThe fact is that education is the mother of financial stability and if your goal is to have financial independence then there is a need to have financial and other basic education and I will say for any individual to be able to act responsibly with his/her financial dealings both in making the money and also in spending it all need some levels of education to succeed in them.1 million dollars may be an abv amount and can change the financial life of anyone but only those with the knowledge of financial management can utilize that money to make something good out of it.And that means, it is better to have financial education rather than tons of money.Because if you don't know what you're doing such big amount will be gone later on. And if the person is financially educated, even if he doesn't a lot of money, he can survive.But when the person with 1M $s lost such money, he won't know what to do anymore with his life.So better equip yourself with financial education as it can help your life no matter what you encounter in life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 16, 2023, 06:52:45 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?There’s nothing that beats having knowledge but I would say knowledge is best acquired through experience. Financial education isn’t something like an engineering or other course that one who does goes to college to study wouldn’t have a glimpse of it. The issue with the type of people you mentioned that loses their money is not lack of financial education but they choose to squander it.With the one million some who has all before then been thinking of how to expand himself will judiciously use that money properly. The only thing that could turn that money into flames is when you invest in total into a business you don’t have any idea of. But with the money I would set up a business with little capital and then learn gradually as I gain experience",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "May 16, 2023, 07:08:11 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on May 16, 2023, 06:21:36 PMQuote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education or 1million dollarsI will take the $1 million, then use some to aquire financial education and how to expand the money through business, Bitcoin investment and other investment. It's as simple as that.Your thinking pattern shows that you already have financial intelligence. A man that lacks financial education will never think of learning about investment. His only aim is to lavish money on luxuries and unnecessary wants. Some of these opportunists invest in projects they know nothing about because they were told maybe by friends that it will be profitable. Financial education is the ability to do your research, seek financial details, and learn the operations of a business before investing. Quote from: Ojima-ojo on May 16, 2023, 06:45:40 PMThe fact is that education is the mother of financial stability and if your goal is to have financial independence then there is a need to have financial and other basic education and I will say for any individual to be able to act responsibly with his/her financial dealings both in making the money and also in spending it all need some levels of education to succeed in them.1 million dollars may be an abv amount and can change the financial life of anyone but only those with the knowledge of financial management can utilize that money to make something good out of it.I hope your idea of education is not limited to attending conventional schools. The informal education sector is a standard financial intelligence learning institution. This is because I have seen great businessmen without basic education. They learned financial education through mentorship, apprenticeship, and observation. A particular tribe in my country controls the business sector but most of them don't have formal education. These so-called illiterates have the best financial education due to years of serving successful businessmen as apprentices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "May 16, 2023, 07:33:01 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do? Not gonna be the dumbass who thinks he can make the 1 million bucks after learning how to be financially smart. I'd take the 1 million dollars, and learn my way into becoming financially-educated along the way. I'm not gonna spend a dime from that money, as I am on a full-time pay and would like to make sure that every single penny from that pile will be spent good and saved great. As for lottery winners who find themselves burning through their prize winnings without anything left after, I'd say it's not only because of the financial illiteracy but also because they are blind-sided by the sheer amount of money they just won, at least up to a certain level where they think this money they won will never go away. Hence they spend lavishly, they buy things that aren't needed, they treat people that don't even deserve a seat at their table, and they lose the money in the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kara3",
      "created_time": "May 16, 2023, 07:46:50 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on May 16, 2023, 06:21:36 PMQuote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education or 1million dollarsI will take the $1 million, then use some to aquire financial education and how to expand the money through business, Bitcoin investment and other investment. It's as simple as that.You made a very good point here,  but you need to understand what not many people think this way, most people don't know that the most successful people in life pays more for knowledge before even engaging their funds.Even in the award winning book title Rich Dad poor dad, the author was spot on, because he knew the concept of financial education, he knew that formal education alone can't take him out of the rat race, so he devote more of his time after school in learning financial education from his friends dad, which is the rich dad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "May 16, 2023, 08:39:33 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?You can learn financial education while sitting on one million dollars which will go a long way if you eek it out. There are plenty of people who smartened up when it came to finances after running into big sums of money. If you have a million dollars, there are lots of very reliable places (like the biggest banks on wallstreet) that will pay you $50k a year just to hold your money while you learn about stocks, bonds and investing. One million dollars can mean vastly different things depending on where you live, in San Francisco it might buy you a small apartment, in the countryside of Chile it could buy you a palatial mansion with massive grounds, so location is key to this question as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "May 16, 2023, 08:53:25 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMIt's not very obvious that a lot of these happens in our world. There are those that would be given that money and they would know just how to engage it and make the money work for them. Still, there are those that would be given a whole some and they won't be able to make anything out of it. This is as old as man himself as far as history goes.Money not invested is wasted money. Yeah, money finishes and if you ain't getting some regular income even not in regular amounts, your gradually getting bankedrupt and it only tells when your close to your least.Money management is a must known for those who hope to make the most put of the little or much they have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "May 16, 2023, 08:59:21 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?Does depend because not all people who dont have able to step into college or having that proper education do always end up on demise because there are ones who do have that kind of realistic approach on things in life or simply that being aware on how reality works despite of lacking some educational background. This is why it isnt really that right on making up some conclusions because we cant really tellon what would things happen ahead.There are people who are really that good on handling out their finances despite of lacking some financial background on something.We know that these things arent really that hard to learn up as long you do have the money and you do have the resources.It is really just a matter of choice whether you would really like to learn or would really be just making yourself play dumb and want to spend just like a mad man and minding that you do have lots of money and it wont be something that it would be easyto go zero until you would really be realizing that all of those amounts been spent and gone and now you would be that poor again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "May 16, 2023, 09:05:36 PM",
      "body": "In many parts of the world, people cannot even earn a million dollars in their lifetime. But I agree that it is very difficult for someone to have financial stability without education. Not all because I also heard stories of success from people with limited educational backgrounds but they are only a few of the millions or maybe billions of poor people around the world. That is how important education is, especially financial education.That being said if I were to leave a million dollars to my child or provide him a full education up to college, I will choose the latter. I don't mind my child not becoming a millionaire in dollars in the future for as long as it can take to go to school and then go to college with his own preference based on his skills and interests.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 16, 2023, 09:18:43 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?Actually you are of good point concerning educating your offsprings or children of financial management,  do you know that some children who has someone that render a good financial management advice to them doesn't take it serious, the things I know very well is that any child that is destined to be successful in life will definitely be successful because of the carrier it chose to be like, in the aspect of parental advice concerning financial management not all the children of rich person wants to be rich, so this is applicable to gospel preachers who their biological children deviate from what was expected them to be, many of them become wayward because of they find themselves in a golden environment, so that make many prominent people today they children lack the knowledge of management from my perspective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 16, 2023, 09:29:09 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMOn the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?I do.It's like this, give someone who's not financially educated a million dollars and he might just lose that within less than a year.While you don't give nothing to a financial educated person and he might reach that goal in no time. And that's because he's knowledgeable and aware on how to make his finances well including increasing his source of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "May 16, 2023, 09:33:00 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?education is very important in every aspect of life, everyone goes blind if they don't have good knowledge of something, besides that not everyone who has good financial education will become rich and those who have 1 million dollars will become poor without financial education....for example, the lottery winner becomes poor because his lifestyle increased in 1 night which caused him to run out of all his winning money so in this case lifestyle (lifestyle, it is something that everyone must pay attention to) also greatly affects a person being rich or poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "May 16, 2023, 10:05:55 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMOn the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?Exactly, this money can be lost completely if one does not have financial education to guide him/her through the process. There are people who swear to their lives that they can handle large sums of money or that acquiring it will lift them out of poverty for the rest of their lives, but this is not always the case because some lack financial education and squander the money on things they don't need just to impress the masses. I don't need any additional financial knowledge to be able to advise myself on how to spend a million dollars. I'll invest it wisely in a profitable business and take further financial management classes if necessary to learn how to double my earnings over time once the investment has started off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "May 16, 2023, 10:20:52 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.Have you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.On the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?You don't need to have one or the other. If you are giving huge amounts to your kids you could just give them to a trustee with a necessary skills. Someone who could oversee that your kids get the education before and weekly allowance before they can get their hands on real money. Financial education itself doesn't guarantee you a future. People can be erratic and things like unmedicated ADHD or Bipolar disorder can make you lose everything you have, no matter how educated or smart you are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "May 16, 2023, 10:24:55 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMHave you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.I see this as an imagination or a total fabricated lies which is caused by the lack of proper understanding of the word Finaance and Education. Financial education doesn't stop some one from going bankruptcy and lack of financial education doesn't stop anyone from becoming successful because I have seen a lot of people who have had the opportunity to attain some level of financial education yet they still struggle to be successful in terms of their business and company but on the other hand someone who has no financial education has been able to be successful because he's able to do his business with diligence and accountability.Some reasons why most people who were lucky to be lottery winners go back to square one as said by the Op is their greed and addiction to gambling, and to rich kids, they always fail to make use of their inheritance properly because they never worked for it and because they never worked to make the money they will always want to waste the money because it didn't cost them anything to make it not because they lack financial education.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "May 16, 2023, 10:45:38 PM",
      "body": "Quote from: Kara3 on May 16, 2023, 06:10:04 PMFinancial education has always been a game changer in the financial state of a man, it is the best education a father can give to his children because once you are financially educated, it's near impossible not to be financially stable.That's true people spend a fortune to get the right education for their children, education is everything it's a lifetime fortune, and being financially educated also means you have graduated and had a stable job.QuoteHave you wonder why most lottery winners have gone back to square one after winning or most rich kids losing their inheritance due to poor/bad management of funds, it's because they lack financial education.Not handling your fortune properly is the worst that can happen to you, you have no control over your spending and you basically get the things you want, financially educated is all about keeping what you have and growing it, it's getting the things you need and controlling what you wantQuoteOn the other hand 1million dollars is truly a life changing amount of money but if you are not financially educated, you will lose it all on  the long run,I don't know if anyone sees it the same way I do?$1 million is small for the financially educated and they know if they will not spend, save or invest it properly it will soon get out of their hands, and it is too big for the uneducated because they think its a lot of money and they can spend more than what they need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}