{
  "id": "topic_5419015",
  "title": "sima_sara",
  "author": "sima_sara",
  "created_time": "November 01, 2022, 05:28:56 AM",
  "content": "A friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  does it mean he has shit load of bitcoin in his wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419015",
  "comments": [
    {
      "author": "mk4",
      "created_time": "November 01, 2022, 05:40:42 AM",
      "body": "There's really no such thing. Unless he's referring to his centralized exchange wallet. Pretty much something like those \"platinum\" credit cards which mostly requires you a certain amount of maintaining balance and/or a certain amount of monthly/annual income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 01, 2022, 06:39:58 AM",
      "body": "That's the first time to hear that there's sort of level of wallet. We've got different wallets, desktop wallets, mobile wallets, hardware wallets, web wallets, paper wallets and exchange wallets. Quote from: sima_sara on November 01, 2022, 05:28:56 AMdoes it mean he has shit load of bitcoin in his wallet? No one knows but only him and if he's honest to you and tells you and proves it that he's got tons of it. For you to have reference as you discuss with him, you can use bitcoin.org's wallet suggestion/references.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "November 01, 2022, 08:49:08 AM",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMA friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  does it mean he has shit load of bitcoin in his wallet? Gold level wallet? nah, I don't think there is such a thing, it's either you have custodial or non-custodial wallet.And it's up to you how your are going to protect your wallet even if it has shitload of bitcoin or just .0000001 sats.Maybe your friend is just bullshitting you or he doesn't know what is the different kind of bitcoin wallet. And it's good that you have asked the community, so that you will be corrected in the very beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 01, 2022, 09:23:26 AM",
      "body": "Nope! Never heard of such type of wallets. Your friend is probably speaking about some multi-level-marketing company which deals into something else in the disguise of crypto or bitcoin. Because in bitcoin, there is no such thing available. I am curious though to know what exactly your friend is using. Can you please enquire the exact name and let us know? As per my experience, it is definitely some MLM or Ponzi scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 01, 2022, 09:27:33 AM",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMwhat does this mean?  Why don't you ask him what he meant by that?I suppose there is also a language barrier here so what your friend might imply by the gold or premium thing would mean something totally different.But, what the hell, there are two possibilities:- he has some web wallet that offers interest for stacking coins and the rewards are based on the amount, or for the amount traded, or cash spent for example even Wirex had premium and elite for their bitcoin cards* Might be wrong about this but RH had a gold account and it did allow crypto trading. - he got tricked into some Ponzi-like scheme and deposited BTC to a site with gold, and platinum plans that promise 100% or 1000% APY returns.I do hope it's the first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "November 01, 2022, 09:32:45 AMLast edit: November 01, 2022, 12:16:56 PM by ETFbitcoin",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMA friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  He probably refer to custodial service where he either,1. Choose specific pricing tier.2. Obtain specific membership tier, which usually based on total stored Bitcoin or total transaction.Non-custodial wallet (where you have full control over your key) usually do not promote their wallet software with such term.Quote from: sima_sara on November 01, 2022, 05:28:56 AMdoes it mean he has shit load of bitcoin in his wallet? We don't know. You have to ask him which wallet/custodial service he use, then do your own research or ask about the wallet/custodial service here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 01, 2022, 09:43:25 AM",
      "body": "I've only seen exchanges to use such terms to describe what they call \"wallet\" but they are not wallets since they do own your money and also to get those features (like reaching an elevated account level) you would have to jump through a lot of hoops including full KYC verification, high trade volume, etc. Then they offer you some extra benefits like lower trading fee or something meaningless like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 01, 2022, 09:51:37 AM",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMA friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  does it mean he has shit load of bitcoin in his wallet? Big words for something that's not even a proper wallet, but hey, that's how advertising works.As said, it's most probably an account on a custodial service. I don't call it proper wallet because I expect your friend doesn't have access to the private keys (or seed) for that wallet, hence it's not really his.And no, that name is not related to the amount of coins. It can be related to a trading tier or some subscription fee he may be paying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 01, 2022, 12:06:28 PM",
      "body": "A real non custodial wallet, open source and created by trusted developer doesn't have any restriction. Even if you only have $1 worth of Bitcoin and someone have $100,000 worth of Bitcoin on the same wallet, both of you can use same feature which the wallet offer and there's no limit how much Bitcoin you can have on your wallet. If there's such premium, tier or level on your wallet, it must be a centralized wallet, ponzi or scam wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "November 01, 2022, 12:26:03 PM",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMA friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  It is scam very likely.With Bitcoin, you will have custodial wallets and non custodial wallets.What you mentioned are similar to Ponzi scheme and I guess they are wallets for people who open accounts in Ponzi companies which try to use Bitcoin as a tool to scam naively and unknowledgeable people.Custodial vs. Non-Custodial Wallets: What's the Difference?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 01, 2022, 10:52:58 PM",
      "body": "Bitcoin protocol doesn't know anything about any \"wallets\". From the point of view of the network, only addresses exist, and what we call \"wallets\" are just tools for managing addresses. There's no premium addresses on the network, so there's no premium wallets. Maybe your friend meant a vanity address? A vanity address is an address with pre-generated text in it, unlike regular addresses which are random-looking. Anyone can get a vanity address, you only need to run a software that generates one, and the longer the text part, the more computing power you need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "November 02, 2022, 12:17:59 AM",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMA friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  does it mean he has shit load of bitcoin in his wallet? A wallet is basically a tool that allows you to interact with the Bitcoin network in an easy way.At the end of the day there's Bitcoin addresses and the private key that controls the bitcoin at those addresses. That's it. Any wallet will allow you to send and receive bitcoin.There are no \"ranks\" of Bitcoin wallets, just different software that implements different features and GUIs, but at the end of the day basically it's all just addresses and private keys to access them.What your friend is referring to is probably some kind of company that has some card attached to it or something like that. There seems to be some fiat component in that \"premium\" wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "November 02, 2022, 12:56:53 AM",
      "body": "i never found that kind of wallet there is ranking in centralized exchange that you hold amount of coin or if you using app like NexoBank or Celcius there is Rank that decide gold or platinum useror maybe your friend tell about address domain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "November 02, 2022, 03:20:56 AM",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMA friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  does it mean he has shit load of bitcoin in his wallet? I have been in the market for a long time and have also used a lot of wallets for storage from exchange wallets to non-custodial wallets but I have never heard of so-called premium wallets or gold or silver wallets...It sounds like your friend is participating in a certain Ponzi project, ponzi projects often use the phrases diamond, gold, silver ... to classify ranks.Remember storage wallets are the same and we have hardware wallets, software wallets and hardware wallets which are the most secure wallets available today and they have no concept of premium wallets or non-premium wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sima_sara",
      "created_time": "November 04, 2022, 06:02:45 AM",
      "body": "thanks for everyone for the answers.   I need to check again.  Probably a misunderstanding on my part.  I am 99% certain that there is no Ponzi scheme here.  will report back once I learn more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "November 05, 2022, 05:19:44 AM",
      "body": "Quote from: sima_sara on November 01, 2022, 05:28:56 AMA friend told me that he has an \"premium\" bitcoin wallet.  sometimes he called it gold level wallet.  what does this mean?  does it mean he has shit load of bitcoin in his wallet? Hopefully, it doesn't mean he is a \"premium\" or \"gold\" member of a pyramid or ponzi scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "November 05, 2022, 05:44:20 AM",
      "body": "Quote from: sima_sara on November 04, 2022, 06:02:45 AMthanks for everyone for the answers.   I need to check again.  Probably a misunderstanding on my part.  I am 99% certain that there is no Ponzi scheme here.  will report back once I learn more. Hopefully, it's just a misunderstanding, but if what you say is true, then your friend is definitely involved in the Ponzi project, and you should stay away from it as far as possible. Do not be tempted by it, or think that you can make a lot of money from it, if you join, you will regret it. As everyone has already explained to you, there is no such thing as a gold, silver, or diamond wallet or a premium wallet on the market. We only have custodial and non-custodial wallets, hardware wallets and software wallets. That's all we have for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}