{
  "id": "topic_5449681",
  "title": "unknowncustomer",
  "author": "unknowncustomer",
  "created_time": "April 21, 2023, 09:57:27 AM",
  "content": "Hello,Is there any means (website for example ?) to check someone's hot wallet IP address ?For example if I type a reception address or public key I find the IP addressThanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449681",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "April 21, 2023, 10:06:23 AMLast edit: April 21, 2023, 10:18:12 AM by Charles-Tim",
      "body": "Quote from: unknowncustomer on April 21, 2023, 09:57:27 AMIs there any means (website for example ?) to check someone's hot wallet IP address ?IP address linked to bitcoin address(es)? No site that I know of but possible if Chainanlysis company want to do that. If you use an SPV wallet, centralized server can know your bitcoin addresses and IP addresses used. But what if the person is using Bitcoin Core with Tor which is a way to privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "April 21, 2023, 11:37:24 AM",
      "body": "Quote from: unknowncustomer on April 21, 2023, 09:57:27 AMIs there any means (website for example ?) to check someone's hot wallet IP address ?You need to run lots of Bitcoin node and Electrum server, then log every broadcasted transaction by other node/SPV user along with it's timestamp. Few blockchain analysis company do that, but i doubt they'll share their logged data.On a side note, blockchain.info (today it's blockchain.com) used to log IP address of IP which send transaction data to blockchain.info node. But it seems they no longer do that and they don't show such data on older transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "unknowncustomer",
      "created_time": "April 21, 2023, 04:13:39 PM",
      "body": "My concern is that if I setup an online electrum wallet, someone can track and spy me ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 21, 2023, 04:37:42 PM",
      "body": "Quote from: unknowncustomer on April 21, 2023, 04:13:39 PMMy concern is that if I setup an online electrum wallet, someone can track and spy me ?If you are worried then you can use tor: https://electrum.readthedocs.io/en/latest/tor.htmlOr you can setup your own back end server and do it yourself: https://bitcointalk.org/index.php?topic=5366854.0For the most part since you usually connect to a random server anyway it's not that big a deal.Keep in mind, there are a lot of ways to be tracked, so unless you are doing something to separate the coins from you if the government is looking for you through your BTC spending just doing a little is about as good as doing nothing.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "April 22, 2023, 11:34:05 AM",
      "body": "Quote from: DaveF on April 21, 2023, 04:37:42 PMQuote from: unknowncustomer on April 21, 2023, 04:13:39 PMMy concern is that if I setup an online electrum wallet, someone can track and spy me ?If you are worried then you can use tor: https://electrum.readthedocs.io/en/latest/tor.htmlOr you can setup your own back end server and do it yourself: https://bitcointalk.org/index.php?topic=5366854.0For the most part since you usually connect to a random server anyway it's not that big a deal.Take note even if someone use Tor on Electrum, server still know list of Bitcoin address on your wallet belong to same person/entity.Quote from: Hatchy on April 21, 2023, 07:56:15 PMQuote from: unknowncustomer on April 21, 2023, 04:13:39 PMMy concern is that if I setup an online electrum wallet, someone can track and spy me ?The question you are asking seems to be impossible, it would be very difficult to trace back the IP of a hot wallet. It might be possible to get the IP of the blockchain node used for transactions .But using your wallet ip to spy on you, how?How? Someone just need to replace running bunch of node with running bunch of Electrum server.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "April 24, 2023, 01:45:03 AM",
      "body": "Quote from: unknowncustomer on April 21, 2023, 04:13:39 PMMy concern is that if I setup an online electrum wallet, someone can track and spy me ?If you want peace or rest of mind, choose a hardware wallet, I'll tell you this for free. The possibility of being tracked or spied on won't worry you so much like when you use an online electrum wallet. This is so because your private keys are stored offline, and an additional security measure a tiny chip is added to further prevent access to your private keys by unauthorized people or organizations. Only when you wish to complete a transaction are they linked to the internet. Please note that, there is no assurance that you won't be tracked or spied on by hackers, the government, or other parties if the device or network utilized to perform a transaction is hacked and you disclose your Bitcoin address there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "April 24, 2023, 12:10:06 PM",
      "body": "Quote from: Davidvictorson on April 24, 2023, 01:45:03 AMIf you want peace or rest of mind, choose a hardware wallet, I'll tell you this for free. The possibility of being tracked or spied on won't worry you so much like when you use an online electrum wallet.Electrum (if it's used properly as a cold storage) is secure enough and note that OP's concern is about privacy, not security. If you use a hardware wallet and you don't run your own node, you still have to connect to a server and the server can link your addresses together. If you connect to the server with your real IP address, the server can even link your addresses to your IP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "May 04, 2023, 09:20:14 PM",
      "body": "Quote from: hosseinimr93 on April 24, 2023, 12:10:06 PMElectrum (if it's used properly as a cold storage) is secure enough and note that OP's concern is about privacy, not security. Electrum may be secure enough as a cold storage option, but what is the use of that when your IP can be tracked in the second that you send a transaction and therefore have to connect electrum to the internet. The only solution then seems to use a vpn or use different addresses so the person that does want to trade you can’t know your current address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 04, 2023, 09:28:25 PM",
      "body": "Quote from: hZti on May 04, 2023, 09:20:14 PMbut what is the use of that when your IP can be tracked in the second that you send a transaction and therefore have to connect electrum to the internet. As long as you use a SPV wallet, you have to connect the a server and send your addresses to the server. That's inevitable. Note that even if you use a VPN, your addresses are linked together and that may hurt your privacy. If you want to protect your privacy, you should run your own server.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 05, 2023, 01:31:08 AM",
      "body": "Quote from: unknowncustomer on April 21, 2023, 09:57:27 AMIs there any means (website for example ?) to check someone's hot wallet IP address ?For example if I type a reception address or public key I find the IP addressYou, as a regular user, will not be able to obtain this information, and if there is a service that provides such information, know that it is a trap to collect more information about you. I will give example with https://www.walletexplorer.com/ which is a honeypot according to this document.https://www.coindesk.com/business/2021/09/21/leaked-slides-show-how-chainalysis-flags-crypto-suspects-for-cops/Electrum is bad when it came to privacy Chainalysis runs Electrum nodes. QuoteAnother way Chainalysis captures Bitcoin user data is by running nodes that verify transactions, the documents confirm. This allows the company to capture data leaks on the publicly accessible internet, or clearnet, from users’ simplified payment verification (SPV) wallets. Those services were designed to prioritize easy storage over foolproof security (although to be fair they are arguably more secure than wallets that rely on APIs to verify transactions).“The downside to this design is that when the user wallet connects to the network, a variety of information is revealed - the user’s IP address, the full set of addresses in the wallet (used and unused) and the version of the wallet software,” according to the slide deck. “Chainalysis runs a series of nodes on the Bitcoin network ... and if a user connects to one of our nodes, we receive the above information.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "May 05, 2023, 02:55:50 AM",
      "body": "So if I understand correctly I can only evade this issue by running my own dedicated node, or can this also be solved by running bitcoin core that downloads the whole blockchain? The issue for me at this point would be that the cheapest setup for a node will still set you back more than 100 USD (raspi) or is there a cheaper (and convenient) option?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "May 05, 2023, 12:06:00 PM",
      "body": "Quote from: hZti on May 05, 2023, 02:55:50 AMSo if I understand correctly I can only evade this issue by running my own dedicated node, or can this also be solved by running bitcoin core that downloads the whole blockchain?Both option you mention are same thing, since Bitcoin Core is software to run full node. Although wallet which implement BIP-158 and use Tor/VPN already offer better privacy than most lightweight wallet (such as Electrum).Quote from: hZti on May 05, 2023, 02:55:50 AMThe issue for me at this point would be that the cheapest setup for a node will still set you back more than 100 USD (raspi) or is there a cheaper (and convenient) option?Cheaper (lower than $100)? In this case, you should use computer or laptop your already have and optionally buy 1 TB SSD or HDD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 05, 2023, 12:58:40 PM",
      "body": "Quote from: hZti on May 05, 2023, 02:55:50 AMThe issue for me at this point would be that the cheapest setup for a node will still set you back more than 100 USD (raspi) or is there a cheaper (and convenient) option?Quote from: ETFbitcoin on May 05, 2023, 12:06:00 PMCheaper (lower than $100)? In this case, you should use computer or laptop your already have and optionally buy 1 TB SSD or HDD.Using https://raspibolt.org  will be inexpensive in the long run. I think $60 is enough to get you to run a full node and is better than using an old laptop. You only need an external 1 terabyte or two if you intend to keep the node for more than 10 years.https://github.com/rootzoll/raspiblitz/tree/dev/alternative.platforms#amd64-imageassume that the price of electricity in your country is 20c/kWh and old PC run with 50 W/hour then:12Wh * 24 * 365 = 21 USD50Wh * 24 * 365 = 87 USD87-21= 66 USD which is considered enough to buy raspibolt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "May 05, 2023, 01:19:31 PM",
      "body": "Quote from: ETFbitcoin on April 21, 2023, 11:37:24 AMQuote from: unknowncustomer on April 21, 2023, 09:57:27 AMIs there any means (website for example ?) to check someone's hot wallet IP address ?You need to run lots of Bitcoin node and Electrum server, then log every broadcasted transaction by other node/SPV user along with it's timestamp. Few blockchain analysis company do that, but i doubt they'll share their logged data.On a side note, blockchain.info (today it's blockchain.com) used to log IP address of IP which send transaction data to blockchain.info node. But it seems they no longer do that and they don't show such data on older transaction.So, does that mean that for example when someone uses a light version of Electrum or any other wallet, his IP address is leaked? There are lots of nodes loaded in Electrum wallet, so that means all those node runners know users IP, right? And blockchain analyze companies get the data from those node runners, filter it, etc.But if I use Bitcoin Core wallet and run my own node, then is it still possible for someone to know my IP address? And as I understand, logically, if someone uses a light Electrum wallet and uses a bitcoin mixer at the same time, actually sees 0 benefit in terms of privacy, right? This is something that's rarely discussed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "May 06, 2023, 10:01:09 AM",
      "body": "Quote from: ETFbitcoin on May 06, 2023, 08:57:35 AMQuote from: Synchronice on May 05, 2023, 01:19:31 PMThere are lots of nodes loaded in Electrum wallet, so that means all those node runners know users IP, right?Technically yes, although we don't know which Electrum server actually perform IP/Bitcoin address logging.Quote from: Synchronice on May 05, 2023, 01:19:31 PMAnd blockchain analyze companies get the data from those node runners, filter it, etc.Only if those Electrum server is owned by blockchain analysis company or owner of the Electrum server share logged data with blockchain analysis company.For security purpose, let's assume that every Electrum node logs transaction and Electrum server shares logged data with BCA companies.Long story short, as I understand, we shouldn't be lazy and mean and should run our node for enhanced security.Quote from: ETFbitcoin on May 06, 2023, 08:57:35 AMQuote from: Synchronice on May 05, 2023, 01:19:31 PMBut if I use Bitcoin Core wallet and run my own node, then is it still possible for someone to know my IP address?Theoretically it's possible. But in practice it's very difficult task since ISP or other node don't know whether your node broadcast either your own transaction or someone else transaction.Aren't transactions processed by all nodes?Btw there is a thing I want to clarify. So, it's possible for node to know the IP of person who makes transaction but overall this is not something that's automatically logged in the Blockchain, right? If I open node and download all the data, there won't be any logs of IPs but the day I start to run my node, I'll be able to log IPs if someone connects to my node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "May 06, 2023, 09:15:51 PM",
      "body": "Quote from: unknowncustomer on April 21, 2023, 09:57:27 AMHello,Is there any means (website for example ?) to check someone's hot wallet IP address ?For example if I type a reception address or public key I find the IP addressThanksInteresting discussion, I will follow it. I'm not aware of any publicly available website to check for IPs associated with Bitcoin addresses. So, in theory, if you're running a software wallet like Electrum and don't send/receive funds from/to exchanges you should be able to remain anonymous. Steps to improve privacy were already mentioned in this thread: use VPN/Tor and run your own full node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 07, 2023, 03:59:57 AM",
      "body": "Quote from: serveria.com on May 06, 2023, 09:15:51 PMI'm not aware of any publicly available website to check for IPs associated with Bitcoin addresses. And you will never find such a website because such a thing is never made public. It is usually a service run for profit by companies including blockchain analysis companies where they sell said information. Not to mention that others that are \"deanonymizing\" bitcoin transactions are doing it covertly since if it becomes public that they are being monitored through a certain method, people would avoid those methods (eg. using a certain SPV implementation that is single server dependent).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}