{
  "id": "topic_5414072",
  "title": "BitcoinMoses",
  "author": "BitcoinMoses",
  "created_time": "September 19, 2022, 07:55:01 AM",
  "content": "Bitcoin is an encrypted database in the Blockchain. It is not paper ledger. By nature Bitcoin Blockchain is tamper proof and fully immutable. Bitcoin Blockchain is not stored in single server, it is distributed under a decentralised systemised architecture. No individual can alter any data after it is blockchained in the database. Therefore, it is a globalised ledger technology which can not be controlled or own by any individual participant node. No single nation-stste country or its court has jurisdiction on Bitcoin Blockchain. Every member node must respect and unite under the consensus based agreement to manage all the affairs of Bitcoin Blockchain.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414072",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "September 19, 2022, 08:06:37 AM",
      "body": "One remark: the database isn't encrypted... Your wallet file is encrypted, and you can store the blockchain on an encrypted partition, but the ledger isn't encrypted: anybody who has access to the blocks can read them without decrypting them first. And if you don't have access to the ledger, you can install a full node and the other nodes will just send you all data you need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 19, 2022, 08:15:38 AM",
      "body": "Quote from: mocacinno on September 19, 2022, 08:06:37 AMOne remark: the database isn't encrypted... Your wallet file is encrypted, and you can store the blockchain on an encrypted partition, but the ledger isn't encrypted: anybody who has access to the blocks can read them without decrypting them first. And if you don't have access to the ledger, you can install a full node and the other nodes will just send you all data you need.Satoshi knows all these. But BitcoinMoses is reading very hard to know what bitcoin is, or not having enough proper knowledge about bitcoin. BitcoinMoses's posts alone is enough to know that he is Faketoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinMoses",
      "created_time": "September 19, 2022, 08:55:40 AM",
      "body": "Quote from: Charles-Tim on September 19, 2022, 08:15:38 AMQuote from: mocacinno on September 19, 2022, 08:06:37 AMOne remark: the database isn't encrypted... Your wallet file is encrypted, and you can store the blockchain on an encrypted partition, but the ledger isn't encrypted: anybody who has access to the blocks can read them without decrypting them first. And if you don't have access to the ledger, you can install a full node and the other nodes will just send you all data you need.Satoshi knows all these. But BitcoinMoses is reading very hard to know what bitcoin is, or not having enough proper knowledge about bitcoin. BitcoinMoses's posts alone is enough to know that he is Faketoshi. Any one can say to any one who is claiming to be Satoshi. If you claim to be Satoshi, then many people also will tell you that you are Faketoshi. After all the truth is, 'an extraordinary claim require an extraordinary proof of evidence to prove the authenticity of the claim. As you know, that you do not know who is behind the pseudonym Satoshi Nakamoto so it is better for you be a bit wise and not be fool by commenting anything foolishly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 19, 2022, 10:16:52 AM",
      "body": "You cannot just claim to be Satoshi and then post disinformation such as bitcoin being an \"encrypted database\". There is no encryption anywhere, no AES anywhere (elliptic curve cryptography and hashing are not encryption). Get the facts straight.Quote from: BitcoinMoses on September 19, 2022, 08:55:40 AMAfter all the truth is, 'an extraordinary claim require an extraordinary proof of evidence to prove the authenticity of the claim. As you know, that you do not know who is behind the pseudonym Satoshi Nakamoto so it is better for you be a bit wise and not be fool by commenting anything foolishly. I think your providing extraordinary evidence to demonstrate bitcoin being an encrypted database is warranted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 19, 2022, 01:37:25 PM",
      "body": "Quote from: BitcoinMoses on September 19, 2022, 07:55:01 AMSnipped. I thought this will be coming actually from Satoshi Nakamoto account here but to my surprise, it was published by bitcoinmoses whom we did not know, no wonder everything here is full of jackrobinson that will never emerge from Satoshi, just take a look at all you're saying, mixing things up, wrong spelling, wrong theories and misconception everywhere, this shows clearly that you don't even understand the clear difference between bitcoin, wallet and the blockchain, you're not asking a question neither were you saying the right thing and you're not Satoshi, so where do you belong OP?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}