{
  "id": "topic_5439754",
  "title": "RapTarX",
  "author": "RapTarX",
  "created_time": "February 13, 2023, 06:49:45 PM",
  "content": "Coindesk just published an article where they claimed Blender.io has been relaunched as Sinbad; they directly didn't say sinbad.io though.Here's the article- https://www.coindesk.com/business/2023/02/13/sanctioned-mixer-blender-re-launched-as-sinbad-elliptic-says/Coindesk sourced information from elliptic. They claimed they have found coincidences including some linked wallet with Sinbad & Blender.io; why would a mixer link themselves on the first place?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439754",
  "comments": [
    {
      "author": "Husires",
      "created_time": "February 13, 2023, 08:07:09 PM",
      "body": "QuoteThere are signs the same people might be behind Sinbad and Blender.io, Elliptic said. For example, before Sinbad was launched officially, its wallet received bitcoin from a wallet “believed to be controlled by the operator of Blender.” The founders might have been testing the new service, Elliptic suggested.All of them are based on speculations, but there are no clear connections. I expected stronger evidence, but it is the tip of the thread for information that is difficult to be verified by ordinary people.However, it does not seem that the Elliptic themselves are sure of the information because they did not give strong evidence, and all of them are attempts to link them to Russia or the context of what is happening in the war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "February 13, 2023, 08:29:52 PM",
      "body": "Quote from: Husires on February 13, 2023, 08:07:09 PMAll of them are based on speculations, but there are no clear connections. Fact 1: the signature campaign for sinbad.io was paid with funds coming from Blender's walletCoincidence? Blender's admin is so kind that he decided to pay the campaign's participants? For a service he has nothing to do with?Blender decided to become a charity person?Fact 2: almost all of the early incoming TXs to Sinbad were coming from the suspected Blender's wallet.Suspected, but blockchain forensics companies are rarely wrongFact 3: Both use approximatively the same methods to obfuscate their transactionsFact 4: Both use a 10 digit mixer codesI could add other facts but it's unnecessary (for now)And for reference, adding a question I asked to @sinbad.ioQuote from: LeGaulois on February 12, 2023, 02:44:45 PM@Sinbad.io (or Mehdi  )Hello,I would like you explain the following point because I find it a bit ambiguous.Wired.com sent an email to you. Basically, it was to talk about the funds coming from the north korean's hacks. (the $10-15 million sent to your service)You explained your point of view about privacy, and that was a good one.But you also said this:QuoteIn case I receive a request from [Chainalysis] or any other institution I will investigate the matter and make my opinion on itTo snitch or not to snitch.The sentence I posted basically means you're not sure if you will do it. And you need 'to investigate' to decide if you will do itThe bitcoin mixers industry is based on trust. Am I supposed to trust a service that could potentially report something to LE.Don't take it wrong, but your opinion is ambiguous",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 14, 2023, 02:52:19 PM",
      "body": "If this is true, I am still trying to understand why they had to go through the long road of relaunching as a brand-new mixer yet the old name had already gained recognition?This was their last announcement;Quote from: blenderio on April 05, 2022, 01:15:17 PMServices blender.io and blenderwallet.io are closed for maintenance. Completion dates for technical work will be announced later.Your funds in Blender Wallet are safe. You can wait for the service to open or access them with a mnemonic and passphrase in the Electrum wallet or any other compatible wallet.For those who have not received mixing results, they will be sent when the service starts.We apologize for the inconvenience, please do not worry, the services will be resumed in the near futureWhy not just come out of maintenance and continue with the service as normal?Did they sense that they were being tracked by law enforcement?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "February 14, 2023, 03:44:11 PM",
      "body": "Quote from: Bitcoin_Arena on February 14, 2023, 02:52:19 PMBecause blender.io has been sanctionned by the U.S. Treasury and its website sized.Better to keep low profile because the police would love to find the owner.I would prefer to start from scratch, instead to say \"hello, I'm blender.io admin, and back on track!\"I aslo won't be criticized by forum users saying I have a failed project, making my business at risk (the risk that people don not trust me anymore)my 2 cents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "February 14, 2023, 07:25:33 PM",
      "body": "Given all the uncertainty surrounding it (connection to North Korean hackers, the U.S. sanctioning, etc.), I can understand why the did not go with \"Blender\". It is better to start from scratch with a clean slate rather than try to repair the shaken trust of users by using an old name. No one wants to use a service that can potentially link them to notorious hacker groups!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 14, 2023, 07:50:02 PM",
      "body": "I think I was the first person who asked that question to Sinbad in forum few days ago, if there are any connections with Blender and Sinbad mixer, but they still didn't reply anything so far.There are many similarities if you compare this two mixing services, but I would still like to hear what Sinbad has to say about this.We are not officials working for government agency so we won't sanction and judge anyone Quote from: dkbit98 on February 11, 2023, 09:52:09 PM@Sinbad can you say more about claims I found posted on twatter by ErgoBTC.They claim that Sinbad mixer is working very similar like previously sanctioned Blender, with only difference being use of script type bech32 instead of P2SH.There are also claims of abusing coinjoins services like Wasabi and Whirlpool with purpose of fooling analytics.More information and links of transactions can be found in public, but they basically say that Blender is now Sinbad:https://twitter.censors.us/ErgoBTC/status/1624415264103190528#mQuote from: Bitcoin_Arena on February 14, 2023, 02:52:19 PMWhy not just come out of maintenance and continue with the service as normal?It's obvious why, to mitigate sanctions and operate as long as they can under new domain name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "February 14, 2023, 08:32:38 PM",
      "body": "Quote from: dkbit98 on February 14, 2023, 07:50:02 PMWe are not officials working for government agency so we won't sanction and judge anyone ...Just the internet is not forgetting and Sinbad guys may be afraid that somebody from the government agencies may read their answer on Bitcointalk sooner or later.(Of course, I may be wrong and they're just busy or somewhere else.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "February 14, 2023, 11:42:41 PM",
      "body": "For someone like me promoting the Sinbad brand I had no idea of this and btw this is definitely someone's opinion and not a fact And reading some parts of the article raised some eyebrows...how does a mixer get sanctioned as if these are regulated business setups, is this really possible to put such a business out?The article was insightful, but how did it go from \"The North Korean hackers used Tornado Cash and Sinbad to launder the crypto they stole from Horizon\" when blender was the mixer involved  have they already concluded the change of company names here and before you know it they express doubt in themselves \"There are signs the same people might be behind Sinbad and Blender\" quite confusing tbh???Nice write up Elliptic or is it coindesk  Is this how bitmixer went out too??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "February 15, 2023, 04:30:14 PM",
      "body": "Quote from: Woodie on February 14, 2023, 11:42:41 PMThe article was insightful, but how did it go from \"The North Korean hackers used Tornado Cash and Sinbad to launder the crypto they stole from Horizon\" when blender was the mixer involved  have they already concluded the change of company names here and before you know it they express doubt in themselves \"There are signs the same people might be behind Sinbad and Blender\" quite confusing tbh???That's what someone says when they have a hidden benefit from anything and clearly they are biased in their research statement and it's more like USA vs Russia agenda.Quote from: Woodie on February 14, 2023, 11:42:41 PMNice write up Elliptic or is it coindesk  Elliptic started, coindesk borrowed the idea.But whatever it is, blender.io was a nice mixer back in the time and it will be a good news for bitcoin ecosystem if they are back. Who cares about USA vs rest of the world as long as Bitcoin exists.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "February 15, 2023, 07:14:57 PM",
      "body": "Quote from: Woodie on Today at 12:42:41 AMQuoteSo you think Elliptic is wrong? Because just to say: it's not the only company with the same conclusion. Everyone is wrong? What a bad luck.The Blockchain is like statistics. It has data and it can't have an opinion. That's something only a human can have.Mathematics never lie: 1+1=2 and there is no other truthI posted a few facts.You don't need to be a registered business to be sanctionned by any governmental agency. Otherwise, I could say \"Hey, I'm a criminal and I killed someone. You can't do anything because I have no company\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "February 16, 2023, 03:54:27 AM",
      "body": "It is completely understandable for Blender.io to rebrand and relaunch under a new name Sinbad.io. There's nothing surprising with that; they want to get around sanctions. What's ironic is that they are into a business of erasing tracks, of wiping out traces and links which could lead to any user's identity, of privacy in other words, but they somehow failed to do that themselves. That Sinbad.io is the old Blender.io may or may not be true at all, but with all the coincidences mentioned by LeGaulois it seems they failed to clean their own tracks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "February 16, 2023, 09:47:40 AM",
      "body": "If that evidence is true, it's sad that they can't cover their own tracks. That doesn't exactly speak for the team. In itself I don't think it's a bad thing if blender.io continues under a new name, but if the report is correct and sinbad.io have washed the coins from the horizon hack, it's certainly only a matter of time before sinbad.io affected by sanctions. Either way, blender.io should have covered their tracks better, because the hints are quite clear and people who operate a mixer should actually be good at covering tracks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uyi4yrdd",
      "created_time": "February 16, 2023, 11:56:44 AM",
      "body": "Quote from: Bitcoin_Arena on February 14, 2023, 02:52:19 PMThis was their last announcement;Quote from: blenderio on April 05, 2022, 01:15:17 PMServices blender.io and blenderwallet.io are closed for maintenance. Completion dates for technical work will be announced later.Your funds in Blender Wallet are safe. You can wait for the service to open or access them with a mnemonic and passphrase in the Electrum wallet or any other compatible wallet.For those who have not received mixing results, they will be sent when the service starts.We apologize for the inconvenience, please do not worry, the services will be resumed in the near futureBlender stole from users. They closed for \"maintenance\" and never came back.If Sinbad.io = Blender.io why should it be trusted?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RapTarX",
      "created_time": "February 16, 2023, 05:53:51 PM",
      "body": "Quote from: Bitcoin_Arena on February 14, 2023, 02:52:19 PMIf this is true, I am still trying to understand why they had to go through the long road of relaunching as a brand-new mixer yet the old name had already gained recognition?They started Sinbad quite a long time ago if I'm correct. They were forced to stop their other domains; hence, started their business under the new name.But I don't get why they used the same wallet to pay expenses. It's easier to get away from the trace.Quote from: uyi4yrdd on February 16, 2023, 11:56:44 AMBlender stole from users. They closed for \"maintenance\" and never came back.If Sinbad.io = Blender.io why should it be trusted?Did they? I can see their forum profile is clear and that's what matters. Feel free to put some proof on your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "February 16, 2023, 06:19:58 PM",
      "body": "Quote from: RapTarX on February 16, 2023, 05:53:51 PMQuote from: Bitcoin_Arena on February 14, 2023, 02:52:19 PMIf this is true, I am still trying to understand why they had to go through the long road of relaunching as a brand-new mixer yet the old name had already gained recognition?They started Sinbad quite a long time ago if I'm correct. They were forced to stop their other domains; hence, started their business under the new name.But I don't get why they used the same wallet to pay expenses. It's easier to get away from the trace.Quote from: uyi4yrdd on February 16, 2023, 11:56:44 AMBlender stole from users. They closed for \"maintenance\" and never came back.If Sinbad.io = Blender.io why should it be trusted?Did they? I can see their forum profile is clear and that's what matters. Feel free to put some proof on your post.Blender was trusted though, I don't see Sinbad to be not the same as the previous if indeed they are the same. But I guess they'd be sanctioned as well. Did the government expect a mixer to report that a transaction going into their service comes from a hacker group Lazarus and so they will not allow it to be mixed?  Any mixer who would do this will not be trusted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "February 16, 2023, 09:31:49 PM",
      "body": "Quote from: Darker45 on February 16, 2023, 03:54:27 AMWhat's ironic is that they are into a business of erasing tracks, of wiping out traces and links which could lead to any user's identity, of privacy in other words, but they somehow failed to do that themselves. That Sinbad.io is the old Blender.io may or may not be true at all, but with all the coincidences mentioned by LeGaulois it seems they failed to clean their own tracks. That's the first thing I thought of also, if you're a mixer and you can't obfuscate your own payments, which obviously lead to your entire camouflage and rebranding being blown away, one would really ask himself how good they are with other stuff that's mixing related. Now, when they say the funds have come from Blender, the mixer was previously hacked, are those coins that have been on the run since then or coins that have been \"left' there when the site shut down? Would be rather ironic to have funds that have been stolen from them mixed through their revamped mixer.Quote from: Bitcoin_Arena on February 14, 2023, 02:52:19 PMIf this is true, I am still trying to understand why they had to go through the long road of relaunching as a brand-new mixer yet the old name had already gained recognition?Cause it got two kinds of recognition, and while one could get you a lot of clients the second one can land you on a most wanted list.The moment they would brag about being the same guys, haha, you can't stop us, we're still here it would definitely make a few higher-ups in the US agencies pissed, with this outcome everyone is happy, blender was a success story of shutting down a website, Sinbad is one of the tens of mixers around, till now nobody cares and things go on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 16, 2023, 11:14:02 PM",
      "body": "Quote from: dkbit98 on February 14, 2023, 07:50:02 PMQuote from: Bitcoin_Arena on February 14, 2023, 02:52:19 PMWhy not just come out of maintenance and continue with the service as normal?It's obvious why, to mitigate sanctions and operate as long as they can under new domain name.This makes perfect sense now. I had completely forgotten that they were the first Bitcoin mixer to be sanctioned a while back  What's funny is that they decided to shut down way before the U.S. Treasury issued the sanctions. It looks like they knew what was coming Quote from: uyi4yrdd on February 16, 2023, 11:56:44 AMBlender stole from users. They closed for \"maintenance\" and never came back.If Sinbad.io = Blender.io why should it be trusted?Show us the users they \"stole\" from",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 24, 2023, 11:59:32 PMLast edit: March 25, 2023, 02:34:33 AM by PX-Z",
      "body": "Quote from: Bitcoin_Arena on February 16, 2023, 11:14:02 PMQuote from: uyi4yrdd on February 16, 2023, 11:56:44 AMBlender stole from users. They closed for \"maintenance\" and never came back.If Sinbad.io = Blender.io why should it be trusted?Show us the users they \"stole\" from  Here[1] is one of the open scam accusations though. And there are lots of list if it will be compiled.[1] https://bitcointalk.org/index.php?topic=5153756.0[2] https://bitcointalk.org/index.php?topic=5446173.0Edit: Just made a reply because of the new thread[2] related to this opened earlier.Edit2: i stand corrected, just misread and confused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "March 25, 2023, 01:23:16 AM",
      "body": "Quote from: PX-Z on March 24, 2023, 11:59:32 PMYou're confusing 2 mixers and both are not related to each other:We're talking about Blender.io in this topic.The topic's link you posted is about @DarkStar_ creating a flag against BitBlender.io (forum username @blender)Hence the title \"blender - Ran off with user's funds after shutting down\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}