{
  "id": "topic_5454170",
  "title": "yhiaali3",
  "author": "yhiaali3",
  "created_time": "May 27, 2023, 09:37:13 AM",
  "content": "بمناسبة يوم بيتزا البيتكوين الذي صادف 22 من هذا الشهر الجميع يتداول قصة شراء البيتزا بمبلغ 10000 بيتكوين ، لم أجد موضوع يحكي القصة كاملة في القسم العربي لذلك أحببت أن أشاركها هنا وخاصة أن الجميع تقريبا يعرف من اشترى البيتزا لكن القليل جدا يعرف من باعها وماذا فعل بمبلغ 10000 بيتكوين، هذه هي القصة باختصار: في 18 مايو 2010 ، على موقع Bitcointalk.org ، قدم هانييتس - أحد المساهمين في المنتدى - الطلب ، بما في ذلك تفضيلاته الخاصة: \"أحب أشياء مثل البصل ، والفلفل ، والسجق ، والفطر ، والطماطم ، والبيبروني ، وما إلى ذلك. غريب الأسماك تتصدر أو أي شيء من هذا القبيل.في مايو 2010 ، لاحظ طالب كاليفورنيا جيريمي ستورديفانت ، الذي كان آنذاك 19 عامًا ، طلبًا غريبًا على منتدى bitcointalk.org  يمكنه الحصول على 10000 بيتكوين ، في ذلك الوقت يُقال إن قيمتها 41 دولارًا ، مقابل توصيل اثنين من البيتزا الكبيرة إلى لازلو هانييتش المقيم في فلوريدا.قال Sturdivant لصحيفة Telegraph في عام 2018 عن إنفاق أرباحه في رحلة برية مع صديقته: \"إذا كنت قد تعاملت مع الأمر كاستثمار ، فربما كنت سأحتفظ به لفترة أطول قليلاً\". \"لم أكن لأظن أبدًا أن نفس العدد من البيتكوين سيكون له قوة شرائية على طلب العقارات.\"طبعا الجميع يعرف شاري البيتزا Laszlo Hanyecz وهذه صورة له مع أولاده وقت شراء البيتزا التاريخية المشهورة: تم تصوير لازلو هانييتش في عام 2010 مع أطفاله وبيتزا بابا جون التي تم شراؤها بـ 10000 بيتكوين - والتي تكلف ما يعادل مئات الملايين من الدولارات اليوم.                                                    القليل جدا يعرفون من الذي قام ببيع البيزا الشهيرة (Jeremy Sturdivant) وهذه صورة له وعمره تقريبا 30 سنة:                                                   المصدر: https://nypost.com/2021/05/24/bitcoin-pizza-guy-who-squandered-365m-has-no-regrets/تخيلوا Sturdivant قام ببيع 10000 بيتكوين مقابل 41$ وكان يظن نفسه قد عمل صفقة رابحة، ثم أنفق المبلغ على صديقته!!!! لابد أنه يكرهها جدا الآن لكن البائع والشاري قالا أنهما غير نادمين (مع أني لا أصدقهم) وأنهم سعداء لأنهم كانوا جزء من تاريخ البيتكوين.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454170",
  "comments": [
    {
      "author": "Ulven",
      "created_time": "May 27, 2023, 02:59:24 PM",
      "body": "أحسنت عملاً أخي يحيى نعم رغم قدم القصة إلا أنها حكاية حقيقية دخلت من الباب الواسع المنظومة التاريخية للبتكوين، من كان يتوقع في 2010 أن البتكوين سيحقق سعر خيالي في المستقبل. أصبح تاريخ هذه القصة يتم الإحتفال بها سنويا و تقديم عروض ترويجية بخصوصها لمستخدم العملة الرقمية. أما قضية الندم بالنسبة لشخصيات هذه القصة ربما سيكونان محقان في قولهما و لا أدري أيضاً إن كانا يكذبان",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 27, 2023, 08:41:15 PM",
      "body": "رمزية القصة في كونها تمثل اول عملية شراء منتج حقيقي باستخدام البيتكوين على الانترنت العادي و تحديدا من خلال هذا المنتدى. في ذلك الوقت لم تكن هناك منصات تداول اصلا تدعم البيتكوين حتى ظهور MtGox و كل العمليات كانت تحصل بصيغة الند للند و غالبا يكون هذا في الواب الاسود DarkWeb حيث يتم استعمال البيتكوين للانشطة الغير مشروعة مثل بيع المخدرات على Road Of Silk.أن تكون جزءا من تاريخ البيتكوين بالتأكيد يقدم شعورا بالسعادة بشكل او باخر لان كثيرين غيرهم قد انفقوا الاف البيتكوين مقابل مبالغ اقل من 41 دولار بكثير و لا نعرف عنهم شيئا الا في احيان قليلة حين تظهر قصة احدهم. و لك ان تتخيل الناس الذين باعوا بيتكويناتهم حين وصل سعر البيتكوين الى 1 دولار او حتى اكثر بقليل. هم في اذهانهم قد حققوا ارباحا كثيرة و لا تصور لديهم او لدى غيرهم ان البيتكوين سيصل الى ما وصل اليه اليوم او حتى خلال سنواته الاولى الى حدود 2013 حين تجاوز سعلر 1 بيتكوين 1000 دولار لأول مرة.الجميع يعرفون انه انفق 10.000 بيتكوين لشراء قطعتي بيتزا و لكن لا احد يعرف كم يملك حقا لانه من المنطقي انه فقط انفق ذلك المبلغ و ايتعد تماما عن المجال.من الجيد انك نشرت تفاصيل القصة في القسم العربي لانه ليس هناك نسخة مفصلة عن القصة حتى في الانترنت.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "May 27, 2023, 10:16:03 PM",
      "body": "أحبها كثيرا هذه القصة صراحة، وبها عبرة كبيرة بأن البيتكوين هو الذهب الرقمي وهو الاستثمار الذي خلق المليونيرات والمليارديرات حول العالم، كل من آمن البيتكوين وتقنيته على المدى الطويل وتغلب على الخوف والشك وعدم اليقين هو من أصبح له ثروة ضخمة الآن، ربما يكون جيريمي ستورديفانت غير نادم على ما فعله من بيع ألف قطعة من البيتكوين بهذا السعر لأنه نال الشهرة وتم تسجيل اسمه في صفحات تاريخ البيتكوين والعملات الرقمية وها نحن اليوم نسرد اسمه وقصته بيننا بعد مرور أعوام. لكن غيره من فقد عدد من البيتكوين بهذا السعر فمن المؤكد أنه يعاتب ويلوم نفسه حتي اليوم، لأنه يمكن لعدد من حبات البيتكوين التي خزنها منذ 2010 إلى يومنا هذا أن تجعله قيمتها بأن يقوم بشراء سلسة من مطاعم البيتزا في منطقته وأن يغير حياته المعيشية إلى الأفضل، في رئي لم تنته الفرص بعد، ومن الممكن بعد مرور أعوام أخرى كهذه فالمستقبل نشهد انفجار سعر البيتكوين إلى أكثر مما هو عليه الآن، فهل نحن نفضل أن نكون مثل جيريمي أم نكون نحن ملاك المطاعم في المستقبل؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "May 27, 2023, 11:01:12 PM",
      "body": "جزيل الشكر على الموضوع وتلخيص القصة التي تعتبر اشهر حادثة للبيتكوين وتشجع العديد من الاشخاص على جمع البيتكوين حتى ولو كمية قليلة. كما ان الجميل في الامر وهو وجود يوم عالمي و مسابقات سنوية للاحتفال بهذه الحادثة كما نتمنى ان تنتشر بقدر اكثر كل سنة ويتضاعف سعر البيتكوين في المستقبل.لكن اضن ان ما حدث للطرفين البائع والمشتري لا يمكن تجنبه واقصد ان لا احد منهم كان يتوقع ان البيتكوين سوف يرتفع سعره بتلك السرعة والقيمة الجنونية التي هو فيه حاليا علما ان سعره انذاك كان قريب من العدم ومجرد ارقام وانا متاكد ان اي شخص بيننا كان ليفضل تلك البيتزا على كمية البيتكوين تلك التي ليس لديها اي قيمة حالياكما يمكنني اعطائكم مثال حاليا : مثلا : ماذا تفضل الان ان اقوم بارسال بيتزا بسعر 10$ لبيت منزلك او عملة قيمتها 0.01 $",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 28, 2023, 01:35:24 AM",
      "body": "نعم صحيح هذه القصة تزيد من جمال البيتكوين وتعطيه مسحة أسطورية نوعا ما، هذه القصة أصبحت أيقونة من أيقونات البيتكوين وتحولت إلى عيد عالمي للبيتكوين يتم الاحتفال به هنا في المنتدى وفي أغلب المنصات تقريبا عن طريق إقامة المسابقات وتوزيع الهدايا والجوائز. بصراحة أنا لا ألومهم على بيع البيتكوين لو كنت مكانهم لفعلت نفس الشيء لأنه لا أحد كان يتخيل مجرد تخيل ما الذي سيصبح عليه البيتكوين في المستقبل، أتوقع أن معظم الناس الأوائل الذين امتلكوا كميات كبيرة من البيتكوين في بدايته قد باعوا كمياتهم مع أول ارتفاع والقلة القليلة منهم احتفظوا بكمياتهم حتى الآن.قصة جميلة بالفعل وأنا شخصيا أكون سعيد جدا عندما أرويها كل مرة للأشخاص الذين يتعرفون حديثا على البيتكوين في مجتمعي.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}