{
  "id": "topic_5475920",
  "title": "TopTort777",
  "author": "TopTort777",
  "created_time": "November 29, 2023, 11:14:29 AMLast edit: November 29, 2023, 08:01:55 PM by TopTort777",
  "content": "I was surfing on the Instagram and found this:(source: https://www.instagram.com/reel/CyzDDHfOU0c/?igshid=ZDE1MWVjZGVmZQ==)I understand that this is fake and was made for a joke. But some people dont know what jokes should be ended or are inappropriate... However, since some casinos have \"special\" section in sports betting (why this is in sports betting anyway?), and allow to place bets on election outcome, or on Oscar winner, or on music event like Eurovision, I would not be much surprised that in 5 or 10 years we would really have such absurd betting options. And most important what scares me, that casinos will hide behind \"there is a demand on such betting\" and there really be people who will find this demanding. Edit:As people did not bother real whole post, I will make it more visibleSOMEBODY PHOTOSHOPPED THIS. THIS IS NOT A REAL BET.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475920",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 29, 2023, 11:22:57 AM",
      "body": "Betting on war? How can bookies be providing service for their customers to be betting on war. Betting on who to win election, who to be the next miss world and something entertaining is better, but betting on war is just not appropriate and not entertaining at all. But people are people, they like to be full of something surprising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "November 29, 2023, 11:26:55 AM",
      "body": "It is absolutely no surprise to me at all to know or say that in the current world we live in today, if gambling casinos were to make a section avaliable on where gamblers will able to bet in wars, that is, when a war is ongoing, gamblers are able to bet on which country will win the war, I trust and believe that a lot of gamblers will wholeheartedly jump on it, most especially, if it comes with some really good odds.The truth of the matter is, most people in the world today no longer care or give a damn about other people's welfare, they just wanna make money for themselves at every given opportunity, and it doesnt matter who is dying, as long as its not them or their relatives, they wil have fun with it if given the opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "November 29, 2023, 11:50:33 AM",
      "body": "I find it inappropriate to offer a betting option on the winner of a war; it's just edited, and the screenshot isn't even clear. Regarding other betting options, such as elections, Oscar winners, or music event winners, I don't see anything wrong with that, as people enjoy betting on various events.What I believe is that a regulated casino won't joke around on serious matters, especially those that involve the lives of many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kasabus",
      "created_time": "November 29, 2023, 12:08:06 PM",
      "body": "Quote from: TopTort777 on November 29, 2023, 11:14:29 AMI was surfing on the Instagram and found this:(source: https://www.instagram.com/reel/CyzDDHfOU0c/?igshid=ZDE1MWVjZGVmZQ==)I understand that this is fake and was made for a joke. But some people dont know what jokes should be ended or are inappropriate... However, since some casinos have \"special\" section in sports betting (why this is in sports betting anyway?), and allow to place bets on election outcome, or on Oscar winner, or on music event like Eurovision, I would not be much surprised that in 5 or 10 years we would really have such absurd betting options. And most important what scares me, that casinos will hide behind \"there is a demand on such betting\" and there really be people who will find this demanding.  Jokes are made for fun, but I think this one is not funny at all. Reputable casinos do not entertain this kind of bet as it could only offend those countries involved and might trigger for another war. And obviously no one wins in a war, as both countries have put their people in danger.However, if you do this kind of bet between your friends, this could be possible but I still see it very inappropriate when people bet on war while seeing those countries affected still struggling to survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopTort777",
      "created_time": "November 29, 2023, 12:26:15 PM",
      "body": "Quote from: Oshosondy on November 29, 2023, 11:22:57 AMBetting on war? How can bookies be providing service for their customers to be betting on war. Betting on who to win election, who to be the next miss world and something entertaining is better, but betting on war is just not appropriate and not entertaining at all. But people are people, they like to be full of something surprising.Like I've said, this is just a joke, a photoshopped stake.com UI. But I would not be surprised if one day joke will turn into reality. For those who did not understand the message of the topic - dont focus on just betting on war, think more wide. What is a joke today, tomorrow will turn into betting on nonsense. Well, I dont know, for example, to place a bet on if someone will cut his leg or not. If people want this and be ready to bet, will casinos add such nonsense bets, or they have concept of morality after all? Will casinos do everything to earn or not? For those who cant read what is written on screenshot and find it unclear, I have left a source link to Instagram video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 29, 2023, 12:34:31 PM",
      "body": "I have just later think of this, it is true that war is not good, but people that are using it to bet are not the one causing the war, their bet do not add any benefit or harm to the war. If they bet on it, I do not think there is anything bad about it. If people do not want such a bet, they should tell the governments of the world not to go against each other in a way that will lead to war, but that is not possible. But if there is no war, there will be no bet like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "November 29, 2023, 12:51:05 PM",
      "body": "Quote from: TopTort777 on November 29, 2023, 11:14:29 AM I would not be much surprised that in 5 or 10 years we would really have such absurd betting options. And most important what scares me, that casinos will hide behind \"there is a demand on such betting\" and there really be people who will find this demanding. You don’t need to wait for 5 to 10 years because Futuur provides a prediction in almost every aspect of life such as life on mars  to movie and politics specifics betting option.The betting option that you provide is very special occasions just in case it will be a norm in the future since a world war will make the earth destroy in general due to the mass destruction weapon available in every rich country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "November 29, 2023, 01:03:37 PM",
      "body": "Quote from: Ojima-ojo on November 29, 2023, 11:26:55 AMIt is absolutely no surprise to me at all to know or say that in the current world we live in today, if gambling casinos were to make a section avaliable on where gamblers will able to bet in wars, that is, when a war is ongoing, gamblers are able to bet on which country will win the war, I trust and believe that a lot of gamblers will wholeheartedly jump on it, most especially, if it comes with some really good odds.Sure, mate, it’s not surprising the betting war on which country will win such a game given the fact that people bet on wrestling. However, the way gamblers are dealing with their gambling activities nowadays, they do it just to get some money to cover things up, but most people will be betting this kind of thing for the sake of making money. Gamblers who do it fun won’t stake something like this.QuoteThe truth of the matter is, most people in the world today no longer care or give a damn about other people's welfare, they just wanna make money for themselves at every given opportunity, and it doesnt matter who is dying, as long as its not them or their relatives, they wil have fun with it if given the opportunity. Some people will gamble this even if it’s related to them; some people don’t care; they only need money and want to utilise any single opportunity that comes their way, and you know how they are going with this inflation. Now every gambler won’t hesitate to use it and make money, but that is for those gamblers that are using gambling money to feed people or to meet their needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "November 29, 2023, 01:26:23 PM",
      "body": "War. There were many tragic incidents in it, infrastructure was destroyed, the wheels of the economy stopped, many lives were lost in vain, children experienced extraordinary traumatized. From several of these events that can be caused by war, in my opinion it is not worth betting on certain parties who prioritize war. War is a human tragedy, it is inhumane to expect one party to destroy the other party in order to win a bet. It is clear that it makes no sense to bet on war, everyone knows that war is a very serious matter, because many innocent lives have to be separated from their bodies. I think war is not to make some kind of bet or joke and casinos will not make jokes like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "November 29, 2023, 01:34:56 PM",
      "body": "Quote from: Oshosondy on November 29, 2023, 11:22:57 AMBetting on war? How can bookies be providing service for their customers to be betting on war. Betting on who to win election, who to be the next miss world and something entertaining is better, but betting on war is just not appropriate and not entertaining at all. But people are people, they like to be full of something surprising.I guess when there's a side that will win or lose, betting will never know no bounds, pretty sure that there are people out there that's doing bets with their friends on this kind of stuff, these betting site just happens to want to make a profit out of it, although deplorable we can't blame these soulless people to do this kind of stuff. I don't know how to deal with this, probably just ignoring it might work as even if we were to make a big deal out of it, it's not going to help those that are affected by the war anyway, better if you donate in the relief fund for those affected by the war than be mad about this crazy bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 29, 2023, 01:41:42 PM",
      "body": "Quote from: TopTort777 on November 29, 2023, 12:26:15 PMLike I've said, this is just a joke, a photoshopped stake.com UI. But I would not be surprised if one day joke will turn into reality. For those who did not understand the message of the topic - dont focus on just betting on war, think more wide. What is a joke today, tomorrow will turn into betting on nonsense. Well, I dont know, for example, to place a bet on if someone will cut his leg or not. If they want to chase clouts, then let them use something else because I don’t see why anyone with a sane mind would go to his system and design something like this and upload to their social media handle. Honestly, there are things that should be done and some that should be off limit or just keep it to your self and don’t display them to the public. QuoteIf people want this and be ready to bet, will casinos add such nonsense bets, or they have concept of morality after all? Will casinos do everything to earn or not? If their traffic from those sites are not that much they could decide to introduce the game but it will be at the risk of them losing everyone from that country that use them as a bookie.  On a more realistic note I don’t think anything like this will happen like you said it’s just someone fooling around on the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "November 29, 2023, 01:47:07 PM",
      "body": "Betting on war never makes sense at all. And what kind of casino that is expected to deal on this, if there's any then that could be an illegal one. And those who probably bet on this have no sense of right thinking as they chose to make fun of the event despite of how many people that have lost their lives on a war.Although I still believe that betting on this sensitive topic is still possible, but they must have done it in shady areas as only those fools who are eager to win in gambling suicide to enter this kind of betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "November 29, 2023, 02:06:44 PM",
      "body": "I assume the guy who posted this on Instagram is not the one who made the edited images. whoever made those images is a POS, not only it is insensitive, but he/she is also making a mockery of the suffering of the people who are suffering from the war. also, jokes are supposed to be funny.Quote from: TopTort777 on November 29, 2023, 11:14:29 AM And most important what scares me, that casinos will hide behind \"there is a demand on such betting\" and there really be people who will find this demanding. if casino owners online or not have any kind of human decency they wouldn't allow it despite having a demand for such betting from bettors, but who knows, there are people who are greedy and as long as they are not physically affected by the war I doubt they will understand how scary a war is and it is not something that you should bet on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 29, 2023, 02:23:49 PM",
      "body": "Quote from: TopTort777 on November 29, 2023, 11:14:29 AMAnd most important what scares me, that casinos will hide behind \"there is a demand on such betting\" and there really be people who will find this demanding. It's only possible when the casino is using western regulation, but if the war attacking one of western country it will be impossible.With the current generation where money is the most important, there's a possibility they might add it in the future. Girls selling nudes or videos in Onlyfans and people who fool themselves to earn traffic are already normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "November 29, 2023, 02:27:51 PM",
      "body": "Gambling is not limited to sports alone. Gamblers can bet on anything including war. I have seen cases where Gamblers place bets on women, especially those ones that prove to be too hard to get. Anyone who is able to convince the woman wins the bet. As ridiculous as it may seem, that's gambling for you and many derive fun doing this.This now becomes a matter of personal decision to decide on what exactly to bet on. It is not morally right to gamble on humans especially when the victims are being affected negatively. During wars, lives and properties are lost, people become internally displaced along with other negative effects of war. This is a time they need our prayers,  moral support and even resources. Making money from this situation shows no regards for humanity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "November 29, 2023, 02:31:57 PM",
      "body": "I understand that casinos are for business at the end of the day but I still think the owners are realistic and have some common sense. Wars are not like sport matches that you can clearly determine the winner because there is a time limit and a scoring system. Imagine if they opened a line for two warring countries like Ukraine and Russia and the bets wouldn't be settled for more than 2 years or more. It's just not practical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "November 29, 2023, 02:36:41 PM",
      "body": "Quote from: Oshosondy on November 29, 2023, 11:22:57 AMBetting on war? How can bookies be providing service for their customers to be betting on war. Betting on who to win election, who to be the next miss world and something entertaining is better, but betting on war is just not appropriate and not entertaining at all. But people are people, they like to be full of something surprising. Probably they will do it like war video game where gamblers will select their side and play the game the best and the skillful players will win the game. It will look like a football game station where gamblers pay for the service and play to have funs and bet in it if they want. Smile! Yes I have also seen people betting on election day who to win. But in election, if there is no manipulation the winner is always clear to know. And that is not a lucky game but a sure win. Really betting on war is ridiculous because you don't know who will win. And as I said, it will be a video game and not for live bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 29, 2023, 02:45:49 PM",
      "body": "Yes, fortunately it was just a joke, if there was a possibility that the bet really existed I would not bet on a bet that involved war, that's why I think war can't be a joke because it also involves innocent victims, so I don't think it's appropriate made into a joke but everyone is free to do it as long as they have full responsibility for their behavior, I'm not really interested in betting on that bet.I think sports betting is more fun and makes sense for me, after all this not only fulfills my gambling needs for something different and extreme, but it is better to gamble on what we usually bet on, for example football and the many leagues available today as well as other sporting events. what could possibly be bet on compared to a bet like this about war, it's not really that interesting, the world of gambling is getting weirder by the day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "November 29, 2023, 02:46:52 PM",
      "body": "This is not the first time bookies have provided a place for betting on war, as far as I know on the Ukrainian and Russian wars there were several bookies that provided bets on who would win or how many casualties would fall on either side. This is disgusting, how could someone have the heart to post a bet like this. What if this happened to them? Don't they have a little heart to grieve? or at least just ignore it if they don't think it's important.I think the bookies should take action against this, because it's disgusting how these fools bet on something that really shouldn't be bet on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}