{
  "id": "topic_5455769",
  "title": "memzbuck",
  "author": "memzbuck",
  "created_time": "June 08, 2023, 04:22:30 PMLast edit: June 09, 2023, 12:21:50 PM by memzbuck",
  "content": "As you see below, 20 accounts are used by me. Every week, a giveaway of at least 200 satoshis (most times 300 sats) via QR code on their Twitter page @EarnWithBM are released to the public per account holder. So I make 20 times what the average Joe makes. What is Bitcoin Magazine's business model? Just giving away money? Something just doesn't add up here.https://imgur.com/a/CAOFSC4Bitcoin Magazine is one of the original news and print magazine publishers covering Bitcoin and digital currencies. You can earn sats by Flash Fridays (at least 200 sats) and Daily read (50 sats)50 sats x 7 days = 350 sats300 sats per week = 200 sats (most times is 300 sats per week)50 sats bonus per week after retweet quota = 50 satsTotal per account: 700 sats700 sats x 20 = 14,000 sats (almost US$3.00) (a lot for a 3rd world country)I have already successfully made withdrawals to Wallet of Satoshi from all 20 accounts. This is a way for persons in 3rd world countries to try lightning. Anyhow, an IP address restriction must be put in place to deter bad players.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455769",
  "comments": [
    {
      "author": "LTU_btc",
      "created_time": "June 08, 2023, 09:54:26 PM",
      "body": "I'm not familiar with Bitcoin Magazine giveaway, so I don't really know why they're doing it. I guess that such giveaway help them to get quite signficant traffic and level of abuse so far didn't reached such level thatthey can't afford to pay anymore. But usually such good things come to the end sooner or later, it can't last forever. So, you can milk cow as it still gives something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidjame",
      "created_time": "June 08, 2023, 11:46:54 PM",
      "body": "Quote from: memzbuck on June 08, 2023, 04:22:30 PMAs you see below, 20 accounts are used by me. Every week, a giveaway of at least 200 satoshis via QR code on their Twitter page @EarnWithBM are released to the public per account holder. So I make 20 times what the average Joe makes. What is Bitcoin Magazine's business model? Just giving away money? Something just doesn't add up here.They are generous and lack of tools to detect cheating from their giveaway.If you want to have answer, ask them. They will response and you will no longer to use 20 accounts to claim their giveaway. Maybe they did not think about cheating but if they are aware of such, they will response promptly.Is 200 satoshi sent directly to your address when you claim it or it is only a number in your account and you'll have to submit withdrawal request to Bitcoin Magazine later?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "memzbuck",
      "created_time": "June 09, 2023, 01:53:05 AM",
      "body": "Q: Is 200 satoshi sent directly to your address when you claim it or it is only a number in your account and you'll have to submit withdrawal request to Bitcoin Magazine later?A: First of all, there is only a minimum of 500 satoshis to be able to withdraw. Second, once the account is older than four days, you can withdraw. A QR code is generated instantly and used as receiving invoice to receive coins to your Wallet of Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 09, 2023, 04:01:02 AM",
      "body": "You risk the possibility that all your accounts will be banned in the future due to violating the terms of use, so I do not advise you to continue.What is the maximum profit you achieved and what is the average time to manage 20 accounts and average profits? 200 satoshi is a small amount, but it is enough to do a lot even if it is multiplied by 20.You can collect more by learning a skill or at least participating here or in competitions instead of creating more accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 09, 2023, 04:22:54 AM",
      "body": "Quote from: memzbuck on June 08, 2023, 04:22:30 PMBitcoin Magazine is one of the original news and print magazine publishers covering Bitcoin and digital currencies. You can earn sats by Flash Fridays (at least 200 sats) and Daily read (50 sats)Why you are wasting your precious time for that less amount of Satoshi? Even if you have 100 accounts you won't be able to make enough from those and one day when they catch you, they will ban all of your accounts and blacklist your IP address and subnet. It isn't good to get such penalty for that low amount of Satoshi. I recommend you to learn a proper skill and then prove your services to earn far more than that from this forum or from any freelancing site. That way you won't get ban or blacklisted but earn substantial income by proving services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "June 09, 2023, 04:41:28 AM",
      "body": "Because Bitcoin Magazine don't have a multiple account rule, they only restrict other people using someone account.Quote from: https://b.tc/termsYou also acknowledge that your account is personal to you and agree not to provide any other person with access to our websites or portions of them using your user name, password or other security information. Quote from: SamReomo on June 09, 2023, 04:22:54 AMWhy you are wasting your precious time for that less amount of Satoshi? Even if you have 100 accounts you won't be able to make enough from those and one day when they catch you, they will ban all of your accounts and blacklist your IP address and subnet. It isn't good to get such penalty for that low amount of Satoshi. I recommend you to learn a proper skill and then prove your services to earn far more than that from this forum or from any freelancing site. That way you won't get ban or blacklisted but earn substantial income by proving services. You're wrong, if such amount isn't worth for @OP, he will not create 20 accounts to earn some 50-200 satoshis, this mean such amount is really worth for him in third world country. If he able to create 100 accounts, then he can earn more money.  It's true learning a proper skill will help him to get a better job, but not everyone is diligent and want to learn a new thing, most people are lazy and want to make a quick money like @OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 09, 2023, 04:57:41 AM",
      "body": "They probably aren’t enforcing it because it’s only 200 sats which is like 4 Pennies. So with 20 accounts you don’t even make a full dollar. Not worth the headache really. People used to do this with Bitcoin casinos like dice sites. They gave a faucet of like 1000 sats. And people would gamble with it to hit the min withdraw. Eventually people started to abuse it and they had to remove it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "June 09, 2023, 05:17:30 AM",
      "body": "Damn, you must be a millionaire by now. 200 satoshi per account for 20 accounts is a lot. This Bitcoin Magazine is giving away such low amounts that they simply don't care about their giveaway system being abused.Having an account limit per IP address, won't stop the abuse, because residential proxy networks are a thing(even though there's no point wasting residential proxies for such low reward). I know how to create multiple accounts and keep my browser fingerprints for getting tracked, but I wouldn't waste my time for several thousand satoshis. I'm sure that there are more lucrative ways to make easy crypto money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 09, 2023, 07:48:37 AM",
      "body": "Frankly, I have no background on Bitcoin Magazine, so my response will be limited to this point:Quote from: Plaguedeath on June 09, 2023, 04:41:28 AMQuote from: https://b.tc/termsYou also acknowledge that your account is personal to you and agree not to provide any other person with access to our websites or portions of them using your user name, password or other security information. Since the site mentioned that the account is personal and it is not allowed to give your account to another user, it immediately means that the user is allowed to create one account and not more than one account, which is decided in the hypothesis of this theory is the IP address restriction if there are any restrictions on creating more than one account from the same IP (which should be) then you shouldn't.In general, there are better ways to waste time and earn more. I advise the user to at least learn a programming language.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "memzbuck",
      "created_time": "June 09, 2023, 12:27:42 PM",
      "body": "Quote from: Husires on June 09, 2023, 04:01:02 AMYou risk the possibility that all your accounts will be banned in the future due to violating the terms of use, so I do not advise you to continue.What is the maximum profit you achieved and what is the average time to manage 20 accounts and average profits? 200 satoshi is a small amount, but it is enough to do a lot even if it is multiplied by 20.You can collect more by learning a skill or at least participating here or in competitions instead of creating more accounts.It takes only like 10 minutes a day. On Flash Fridays though It takes like less than 15 minutes. Or I could do half of the work in the morning and the other half of the work in the afternoon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "memzbuck",
      "created_time": "June 09, 2023, 12:34:58 PM",
      "body": "Quote from: adaseb on June 09, 2023, 04:57:41 AMThey probably aren’t enforcing it because it’s only 200 sats which is like 4 Pennies. So with 20 accounts you don’t even make a full dollar. Not worth the headache really. People used to do this with Bitcoin casinos like dice sites. They gave a faucet of like 1000 sats. And people would gamble with it to hit the min withdraw. Eventually people started to abuse it and they had to remove it.See my updated post. I make at least 10,000 a week (at least US$1.00) so something for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "June 10, 2023, 12:08:43 AM",
      "body": "Quote from: memzbuck on June 09, 2023, 12:34:58 PMSee my updated post. I make at least 10,000 a week (at least US$1.00) so something for sure.I think this basically answers your question. The cost they spend to encourage users to read/visit their website is incredibly small compared to the visibility that they get. There is little to no incentive for them to actively find users who abuse the system unless you explicitly abuse it with bots or something. But yeah, at the end of the day, nobody knows unless you ask them.If $1 per week is a lot for you, I suggest looking at remote workers like raters who usually don't need a lot of job history. You'll earn a lot more and that should allow you to spend more of your time learning something else, even if it is not related to crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 10, 2023, 12:17:37 AM",
      "body": "Quote from: memzbuck on June 09, 2023, 12:27:42 PMIt takes only like 10 minutes a day. On Flash Fridays though It takes like less than 15 minutes. Or I could do half of the work in the morning and the other half of the work in the afternoon.10 minutes a day for one account or for all 20 accounts? If you have 20 accounts and you are happy with this work, no one will prevent you from continuing, but there are alternatives that give you more money, but if it is for each account, then it is about 3 and a half hours per day, which is a lot compared to the return.It is good that you are trying to help others, even if we differ in the way in which you achieve this profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "memzbuck",
      "created_time": "June 10, 2023, 12:50:17 AM",
      "body": "Quote from: Husires on June 10, 2023, 12:17:37 AMQuote from: memzbuck on June 09, 2023, 12:27:42 PMIt takes only like 10 minutes a day. On Flash Fridays though It takes like less than 15 minutes. Or I could do half of the work in the morning and the other half of the work in the afternoon.10 minutes a day for one account or for all 20 accounts? If you have 20 accounts and you are happy with this work, no one will prevent you from continuing, but there are alternatives that give you more money, but if it is for each account, then it is about 3 and a half hours per day, which is a lot compared to the return.It is good that you are trying to help others, even if we differ in the way in which you achieve this profit.It takes 10 minutes for all 20 accounts combined. In other words each account takes more or less 30 seconds. So quick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "memzbuck",
      "created_time": "July 18, 2023, 11:00:50 PM",
      "body": "Update: Bitcoin Magazine as of July 14, 2023 decided to ban all my accounts. I milked it while it lasted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "July 19, 2023, 02:57:45 AM",
      "body": "Quote from: memzbuck on July 18, 2023, 11:00:50 PMUpdate: Bitcoin Magazine as of July 14, 2023 decided to ban all my accounts. I milked it while it lasted.Well, maybe one of their staff got wind of your activities and must have read this post of yours and that is why they decided to blocked your accounts. anyway, I believe that one's generosity should never be exploited as there are now many ways to confirm if one is following the right mechanism. Plus they can impose some form of KYC to make sure they are not dealing with fake people or with bots. I am advising you to hold on to the BTC you got since it would soon be exploding in value...maybe even more the former BTC ATH of 60K$.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 19, 2023, 05:51:13 PM",
      "body": "Quote from: memzbuck on July 18, 2023, 11:00:50 PMUpdate: Bitcoin Magazine as of July 14, 2023 decided to ban all my accounts. I milked it while it lasted.This was to be expected, I mean even if a service is laid back in the way they enforce the rules at some point they are going to do it if they see the abuse from their clients is too high, it seems that for you it was worth it to do this but there are many people which would have never done it, either because the possible gains were too low or simply because they will never think about abusing the good will of a service like that, anyway it seems that you will have no option but to find a legitimate way to earn some money online, something which is not difficult to do these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 19, 2023, 06:03:18 PM",
      "body": "their game play is simplethe math you show is $3 over 20 accounts = $0.15 per accountthese media sites make alot more then $0.15 revenue per account from their advertisers. so if they can clickbait people into reading articles multiple times they can multiply their own revenue. thus giving the reader a small % of the media revenue is mutually beneficial. the benefit is that although its not worth the effort for first world countries to do it, the 3rd world countries create a whole new employment sector of click-pay jobs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 20, 2023, 03:52:27 AM",
      "body": "This reminds me of that free Bitcoin faucet back in the day. It sent you like 1 Bitcoin per 24 hours. If you wanted another one you just need to reboot your modem and if you had dynamic IP with your ISP you could claim another one.You would think people did that for hours right? No. Nobody wanted even the free Bitcoin because at the time it wasn’t worth anything. It was mostly there so you could try out the network and to build publicity. Crazy how times have changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}