{
  "id": "topic_5414092",
  "title": "348Judah",
  "author": "348Judah",
  "created_time": "September 19, 2022, 11:03:00 AM",
  "content": "Welcome to another restaurant in England where bitcoin acceptability is made freely with \"Satoshi's Place\" serving as the brand name and their three main cardinal goals were: onboarding, educating and supporting\" in all applicable areas where bitcoin could make the perfect suitability to the running of the economy and career within the society, they also provide the uniqueness in their services rendered to customers in the areas of:What They Offer 1. Workshops and Events2. Food and drinks lightning Bar3. Lightning Gaming Arcade4. Framework for Merchant Adoption5. Hot Desk Space6. Crypto Art GallerysourceThe mindset we made towards positive impression for a change in the economy doings, bring about quality result on us while others are lamenting bad economy, this business is a lucrative idea that comes in with solution to some daily lives activities a cryptopreneurs could enjoy, the above listed six areas of concentration are thier main focus that they majors on with their services to cover, where other aspect are still under development to effect action sooner, you could so find attached, the link to their official website to explore. https://satoshisplace.co.uk/index.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414092",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "September 19, 2022, 01:03:32 PM",
      "body": "Why this thread if there is already one that was opened by the owner and is in the Bitcoin discussion? I know you mention a lucrative idea in this whole project, but the question is, can the owner expect some kind of extra profitable business or is it just something he does out of pure passion for Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "September 19, 2022, 01:09:49 PM",
      "body": "it's very interesting to see how bitcoin is actually used in real world transactions.. but what concerns me is how is it regulated? did the local government not reprimand this place for not using the pound sterling? .. i'm really interested about that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "September 19, 2022, 04:04:57 PM",
      "body": "The only way where people would take this idea on a global level is when they will start having cards with Bitcoins in them which they can spend in real world without paying anything else since Visa is honestly taking over, there have been bad time for visa cards as well but at the end of the day the popularity depends on how well you are able to handle the whole demand of the public and provide better rates. Now we do have cards that you can load with Bitcoins but only available in big countries and they are also charging some membership fee, but then again more options are coming over and people are changing as well. Let's see how far we can take it, we can always make paper wallets and exchange them for things, just an idea it would just be a physical bitcoin, like cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "September 19, 2022, 11:08:37 PMLast edit: September 19, 2022, 11:22:54 PM by Hydrogen",
      "body": "Quote from: 348Judah on September 19, 2022, 11:03:00 AMWhat They Offer What I wish they would offerPrecious Metals ExchangeA booth for buying and selling precious metals like gold, silver and platinum. HODL assets.Scrap Metals ExchangeA booth for buying and selling normal metals like copper, aluminum, steel. HODL assets.Commomdities ExchangeNot certain on the regulation or legality. But it would be very cool if they had a market where commodities could be bought and sold in lower quantities than the typical delivery size which may only make commodities trades accessible to accredited investors or those who already have sizable assets.GPU, ASIC, PSU mining equpimentBuying and selling of GPUs, ASICs, PSUs and other equipment and software for crypto mining.Plant and Tree ExchangeIf food shortages hit. Plants and trees could become HODL assets....Inflation protection being one of bitcoin's main selling points. It could make sense to structure conditions around that theme if the goal is to create a place in Satoshi's honor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "September 19, 2022, 11:27:16 PM",
      "body": "That would require security because those goods could add up to alot quite easily but facilitating trade would be a positive so long as people are able to get there fairly easily.   It would be a more involved operation as deals can easily go bad by accident or after a while (some) people will try to take advantage.    I used to go to a place like this in the early days of the internet and they made more on the drinks and food then anything else, ironically just having a point to draw people in was the main money maker;  we mostly used the computers offline lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 25, 2022, 06:41:50 PM",
      "body": "It's a Lucrative idea but if a restaurant's promotional policies are purely Bitcoin based they should change their marketing plans or else they will shut down quickly.Holding the events while the restaurant is operating normally with the possibility of paying in all other ways, and then organizing weekly workshops and celebrations will make the place unique and attractiveI will later check out their site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 26, 2022, 12:39:16 AM",
      "body": "Quote from: 348Judah on September 19, 2022, 11:03:00 AMWelcome to another restaurant in England where bitcoin acceptability is made freely with \"Satoshi's Place\" serving as the brand name and their three main cardinal goals were: onboarding, educating and supporting\" in all applicable areas where bitcoin could make the perfect suitability to the running of the economy and career within the society, they also provide the uniqueness in their services rendered to customers in the areas of:What They Offer 1. Workshops and Events2. Food and drinks lightning Bar3. Lightning Gaming Arcade4. Framework for Merchant Adoption5. Hot Desk Space6. Crypto Art GallerysourceThe mindset we made towards positive impression for a change in the economy doings, bring about quality result on us while others are lamenting bad economy, this business is a lucrative idea that comes in with solution to some daily lives activities a cryptopreneurs could enjoy, the above listed six areas of concentration are thier main focus that they majors on with their services to cover, where other aspect are still under development to effect action sooner, you could so find attached, the link to their official website to explore. https://satoshisplace.co.uk/index.html In earnest, ideas that show the endless possibilities of Bitcoin in commerce is what the world needs right now as the rate at which inflation has taken over the prices of goods and services surges. Whether the business makes cash profits or not, the satisfaction of the services they offer as listed, is just to express to anyone considering the true efficacy If its use or as it regards its adoption in nations and the worldwide.I do employ other persons who have great ideas, to try to infuse the use of bitcoin or other crypto currencies in their commercial dealings. Although I don't know how crypto regulations now can impact this, but if it is worth a shot, why not try it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "September 26, 2022, 04:10:04 AM",
      "body": "Pretty cool concept hopefully they don't end up like other crypto inspired/infused places that only builds hype but delivers disappointment after sometime. I mean look at the restaurant made by the NFT Bored Apes, nobody talks about it anymore and even my friend who I asked right now if he knows about it hasn't even heard of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 30, 2022, 12:15:20 PM",
      "body": "Quote from: hugeblack on September 25, 2022, 06:41:50 PMIt's a Lucrative idea but if a restaurant's promotional policies are purely Bitcoin based they should change their marketing plans or else they will shut down quicklyI actually thought about this also that they could have another alternative means for accepting payment aside bitcoin but I can't establish this fact since some of their services were still coming up onboard, but i think they wantbto be uniquely known and identified for receiving bitcoin as means for their payments, but can't say if there's any alternative as at now.Quote from: amishmanish on September 26, 2022, 03:38:01 AMI wish to visit this place someday, can we access some of its services online???pretty well, you can go through their website from the provided link and surf their page althrough varieties of services being offered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}