{
  "id": "topic_5419188",
  "title": "Rengar0722",
  "author": "Rengar0722",
  "created_time": "November 02, 2022, 01:58:34 PM",
  "content": "Hi I am the operation specialist from one DeFi project, just wondering if we are going to post the bounty campaign here, is campaign manager necessary or we can post and operate everything by our own marketing team?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419188",
  "comments": [
    {
      "author": "TheUltraElite",
      "created_time": "November 02, 2022, 03:49:13 PM",
      "body": "Quote from: Rengar0722 on November 02, 2022, 01:58:34 PMHi I am the operation specialist from one DeFi project, just wondering if we are going to post the bounty campaign here, is campaign manager necessary or we can post and operate everything by our own marketing team?  You can post on your own but hiring a bounty manager has its own advantages, like so:1. Most bounty managers are well reputed and known widely in this forum. Hiring one of them means hiring their repute and name too.2. Bounty managers have been organizing such campaigns every day for several projects. They have years of experience and the skills needed to do produce a successful campaign.3. The bounty participants usually keep the managers post pages bookmarked to keep track of what new projects they are publishing, so you can be sure that your project will immediately get the recognition is deserves.4. Participants feel safe working under a reputed manager compared to a newbie account posting about a project.Comparing to these advantages, the only disadvantage is that you need pay the manager and keep the bounty payment in escrow. But I think that is a good trade-off.Good luck on your project!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "November 02, 2022, 09:10:41 PM",
      "body": "Quote from: Rengar0722 on November 02, 2022, 01:58:34 PMHi I am the operation specialist from one DeFi project, just wondering if we are going to post the bounty campaign here, is campaign manager necessary or we can post and operate everything by our own marketing team? It depends whether you would be hiring a manager or you are the ones who would really be running such bounty program but in my opinion, if you dont have that much knowledge or awareness on howthis forum works or being familiar on boards and threads or even with the rules and how things works around then it would be ideal and preferable on hiring reputablebounty managers of this forum.Although, dont make yourself that expect about success rate is high when hiring managers but i could assure you that majority of them would really be ableto handle out the bounty campaign professionally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 02, 2022, 10:43:24 PM",
      "body": "Quote from: Rengar0722 on November 02, 2022, 01:58:34 PMHi I am the operation specialist from one DeFi project, just wondering if we are going to post the bounty campaign here, is campaign manager necessary or we can post and operate everything by our own marketing team? You can operate on your own if you think that you can handle it well. But, it's always giving the benefit for the project if you're going to hire a known campaign manager. Why? Because they've got a solid background on how to run these campaigns well and stuck to their names their reputation will definitely be used for your project because your project is being run by them. However, the assessment of being a good project will depend on them, as a good campaign and reputable manager will study your proposal and the project itself before they accept to run your campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengar0722",
      "created_time": "November 03, 2022, 07:28:53 AM",
      "body": "Thank you guys for explaining me carefully! BTW I still have a question on how to create a signature and how can I attach it to my profile?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 03, 2022, 11:13:43 AM",
      "body": "Quote from: Rengar0722 on November 03, 2022, 07:28:53 AMThank you guys for explaining me carefully! BTW I still have a question on how to create a signature and how can I attach it to my profile?You cannot wear a signature yet with your rank. Check these links before to understand about ranks and merits and signature spaces.- Forum ranks/positions/badges (What do those shiny coins under my name mean?)- Merit & new rank requirementsYou're only allowed to wear a signature when you rank up to Jr.member but that's a limited space and it's not yet colorful unlike full members and above ranks. But even you're a newbie, you can bypass the merit and activity requirement and you'll be eligible to have the benefits the same as the member rank through purchasing of the Copper membership and get  Enhanced newbie restrictions & requirements. For additional info of Copper membership: https://bitcointalk.org/index.php?action=credit;promoteAnd for the signature designers, we've got plenty in the forum: Overview of Bitcointalk Designers(Signature,Avatar,etc)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 06, 2022, 09:01:34 AM",
      "body": "It's fine if you want to manage the campaign yourself, but make sure you're pay the participants with Bitcoin or top 10 cryptocurrency and escrow the bounty rewards to trusted user. This would make a good impression since no one will think you're a scammer and it's better if you run a long term campaign with higher payout among the active campaign right now. If you only run for few weeks and only pay small money, you mostly only get spammer and wouldn't give a good impact to your project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 06, 2022, 02:09:14 PM",
      "body": "Quote from: Rengar0722 on November 03, 2022, 07:28:53 AMhow to create a signatureThe basic lessons can be found here. https://bitcointalk.org/index.php?topic=1727100I can also do it for $35, 1 set of signature designs for all ranks. PM me if you need it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 08, 2022, 08:15:02 AM",
      "body": "Quote from: Rengar0722 on November 03, 2022, 07:28:53 AMThank you guys for explaining me carefully! BTW I still have a question on how to create a signature and how can I attach it to my profile?Newbies can't wear signature, you have to atleast to be a member ranked user to have clickable link in your signature but you can buy the feature with copper membership as mentioned above.Signatures are nothing but the bbcodes and if you're not aware of how to create signatures then better hire a signature creator which usually starts very minimum amount from experienced members but since you don't have any experience then better let the manager to handle everything but it comes with a cost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengar0722",
      "created_time": "November 10, 2022, 08:12:14 AM",
      "body": "OK THX guys, but one more question I would like to ask:What is the stake representing for? Is it like the rewards will be distributed proportionally by the total stakes in the pool?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "November 10, 2022, 11:55:12 PM",
      "body": "Quote from: Rengar0722 on November 10, 2022, 08:12:14 AMOK THX guys, but one more question I would like to ask:What is the stake representing for? Is it like the rewards will be distributed proportionally by the total stakes in the pool?Stake will determine how much reward will be acquired by the participants. Yes it is, total reward being pooled will be divided with the total stakes that already collected by all of participants in section then final reward will be calculated based on that formula. Sometimes there are some campaigns that were also using fixed reward distribution based on per task that has been done by the participants but i would prefer stake as this is much more easier to calculate the final reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "November 15, 2022, 11:10:23 AM",
      "body": "Quote from: Rengar0722 on November 10, 2022, 08:12:14 AMOK THX guys, but one more question I would like to ask:What is the stake representing for? Is it like the rewards will be distributed proportionally by the total stakes in the pool?you have so much question that you did not put in one post , instead of asking from here and there you should Edit the OP so there will be one answer completely for what you wanted .and also about this staking? just refer to bounty section and check how much they allocate for every bounty they provided though there are different percentage depend on your company discretion .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 15, 2022, 02:33:26 PM",
      "body": "Quote from: Rengar0722 on November 10, 2022, 08:12:14 AMOK THX guys, but one more question I would like to ask:What is the stake representing for? Is it like the rewards will be distributed proportionally by the total stakes in the pool? One stake represents your share of the total bounty pool. So more stakes mean more rewards but be aware that the bounty pool might also be a large number and once the bounty ends, the total stakes you collected divided by the total stakes distributed in all is the fraction which you receive from the bounty pool. There are usually limitations as per your rank on how many stakes you can collect and the number of activities you could perform.Since you are preparing for a bounty, this is the better economic method compared to the fixed rewards method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 17, 2022, 11:51:02 PM",
      "body": "Quote from: Rengar0722 on November 10, 2022, 08:12:14 AMOK THX guys, but one more question I would like to ask:What is the stake representing for? Is it like the rewards will be distributed proportionally by the total stakes in the pool?Not trying to be rude but if you need to ask how to wear signature and what stakes are, you most DEFINITELY need a bounty manager. There are lots of ways for your campaign to go south, and you will encounter way more complex issues that you probably haven't thought of and they will happen first time in the middle of that bounty program.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "November 18, 2022, 09:52:37 AM",
      "body": "Having a reputable bounty manager is somehow needed but not necessary since this could increase the confidence of bounty participants to join on your campaigns. There's a lot of scam campaigns which can possibly affect your program if this is not been handle well by experience person. But its not mandatory but if you think your team is good enough and can handle the job then its fine you can run a campaign on your own but make sure you have an escrow to secure the funds of participants so that the community can tell that you are serious with the campaign you are running willing to pay everyone who made efforts on your marketing campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "November 19, 2022, 05:26:24 PM",
      "body": "Quote from: Rengar0722 on November 10, 2022, 08:12:14 AMOK THX guys, but one more question I would like to ask:What is the stake representing for? Is it like the rewards will be distributed proportionally by the total stakes in the pool?It seems you don't have too much knowledge to open a bounty campaign here, my advice is to go see the bounty managers on the forum. They will have the right instructions for you and your project, you will save a lot of time on your project development. If you are confident with your project, then find reputable managers, they will help your project reach more customers, the hunters here also prioritize participating in bounty campaigns managed by the reputation manager. All you need to find here:https://bitcointalk.org/index.php?board=52.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blowon",
      "created_time": "November 20, 2022, 12:42:14 PM",
      "body": "it would be better if you have a trusted enough bounty manager on the bitcointalk forum, have good trust, it will affect the number of participants you get, there are many best managers in this forum you can hire them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tam31",
      "created_time": "November 21, 2022, 05:59:06 PM",
      "body": "Quote from: Taskford on November 18, 2022, 09:52:37 AMHaving a reputable bounty manager is somehow needed but not necessary since this could increase the confidence of bounty participants to join on your campaigns. There's a lot of scam campaigns which can possibly affect your program if this is not been handle well by experience person. But its not mandatory but if you think your team is good enough and can handle the job then its fine you can run a campaign on your own but make sure you have an escrow to secure the funds of participants so that the community can tell that you are serious with the campaign you are running willing to pay everyone who made efforts on your marketing campaign.I just noticed that you are saying that a reputable bounty manager is not necessary and not mandatory. Tell me, do you have a hidden hate with some of the reputable managers? Or maybe you are hiding something from us here? Hhmm. It come to your own mouth that a reputable bounty manager can attract participants but isn't that a good thing for the project? This means they will be promoted properly.Another thing which can help attract participants in a campaign is when the participants see that the funds are escrowed but there are some participants who will check first if the escrowed tokens are listed on a good exchange or it has a good volume or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "November 25, 2022, 02:49:29 PM",
      "body": "Quote from: Rengar0722 on November 02, 2022, 01:58:34 PMHi I am the operation specialist from one DeFi project, just wondering if we are going to post the bounty campaign here, is campaign manager necessary or we can post and operate everything by our own marketing team? It is not necessary that anyone can publish any bounty they like on the Bounties (Altcoins) board, but you and your marketing team must have experience in managing the bounty and in creating and updating spreadsheets, and calculating and dividing the stakes for each member, it will be difficult if they do not have Previous experience, so I advise you to hire a bounty manager who has a good reputation in the forum, such as Hhampuz, yahoo62278, irfan_pak10. Quote from: Rengar0722 on November 03, 2022, 07:28:53 AMI still have a question on how to create a signature and how can I attach it to my profile?To create signature codes, there are many lessons on the forum, use the search option above to find these topics.Your Newbie member rank does not allow you to wear a signature, so I advise you to post useful posts in this forum until you get a lot of Merits in order to get a higher rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "November 25, 2022, 04:07:33 PM",
      "body": "Quote from: Rengar0722 on November 02, 2022, 01:58:34 PMHi I am the operation specialist from one DeFi project, just wondering if we are going to post the bounty campaign here, is campaign manager necessary or we can post and operate everything by our own marketing team? A manager is not 100% necessary, but it does save you loads of time and headache. On top of that you bring more reputation to your product that you wouldn't have with no manager. So the real question becomes, why wouldn't you want to spend a little money to have a manager?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}