{
  "id": "topic_5459432",
  "title": "CryptoHFs",
  "author": "CryptoHFs",
  "created_time": "July 11, 2023, 02:51:39 PM",
  "content": "هل قام احد بتجربه كروت OWNR Wallethttps://bitcointalk.org/index.php?topic=5145162.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459432",
  "comments": [
    {
      "author": "GxSTxV",
      "created_time": "July 12, 2023, 11:05:04 PM",
      "body": "شكرا على مشاركة البطاقة والموضوع القيم لكن حبذا لو انك قمت بترجمة الموضوع وتجربة البطاقة اولا لتقديم معلومات افضل وادق لنا والسبب اننا نختلف كثيرا على الدول الاجنبية فهذه البطاقة لهم لن تكون منافسة للخدمات والشركات الاخرى التي ربما تقدم اشياء افضل.المهم سوف اقوم باعطاء رأيي واشارك تجربتي عندما يكون لدي متسع من الوقت لاني حاليا فقط قمت بتحميل التطبيق الشيء الاول المميز والمختلف عن بطاقة PYYPL التي يعتبرها العديد منا عن كونها الحل الوحيد كبطاقة تدعم العملات المشفرة ويمكن الحصول عليها بسهولة لانها افتراضية بطاقة OWNR بلاستيكية فقط ولا تقدم بطاقة افتراضية وهذا امر سلبي لنا لعدة اسباب منها دعم جميع الدول العربية لانها ربما ستكون محظورة في العديد من المناطق وايضا حجزها من طرف الجماركالبطاقة لديها تطبيق على الهاتف كما يمكن استخدمها في اجهزة الويندوز واللينوكس عكس بطاقة PYYPL يبقى الان تجربتها والحصول عليها لتقديم رأي كامل للبطاقة",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "July 16, 2023, 05:00:53 PM",
      "body": "Quote from: GxSTxV on July 12, 2023, 11:05:04 PMشكرا على مشاركة البطاقة والموضوع القيم لكن حبذا لو انك قمت بترجمة الموضوع وتجربة البطاقة اولا لتقديم معلومات افضل وادق لنا والسبب اننا نختلف كثيرا على الدول الاجنبية فهذه البطاقة لهم لن تكون منافسة للخدمات والشركات الاخرى التي ربما تقدم اشياء افضل.المهم سوف اقوم باعطاء رأيي واشارك تجربتي عندما يكون لدي متسع من الوقت لاني حاليا فقط قمت بتحميل التطبيق الشيء الاول المميز والمختلف عن بطاقة PYYPL التي يعتبرها العديد منا عن كونها الحل الوحيد كبطاقة تدعم العملات المشفرة ويمكن الحصول عليها بسهولة لانها افتراضية بطاقة OWNR بلاستيكية فقط ولا تقدم بطاقة افتراضية وهذا امر سلبي لنا لعدة اسباب منها دعم جميع الدول العربية لانها ربما ستكون محظورة في العديد من المناطق وايضا حجزها من طرف الجماركأشاركك الرأي في النقطة الأخيرة بخصوص بطاقة OWNR البلاستيكية و الذي يجعل منها لا تصلح كبديل. على الأقل بما أنها لا تقد خدمات افتراضية. البطاقات البلاستيكية فضلا على أنه غالبا ما يتم حجزها من الجمارك فان اكبر مشاكل استخدامها هو فقدان جانب الأمان و الخصوصية بما ان جميع السحوبات يمكن للبنك المركزي مراقبتها و قد لا يتردد باثارة تتبع قانوني حول مصدر الأموال المسحوبة. هناك اصلا دول لا تدعم البنوك الدولية و لا غرابة ان تتوقف البطاقة عن العمل فيها.شخصيا لا أبحث عن بدائل لأن أفضل الحلول سيكون على درجة من المخاطرة اذا كنا في دول لا تدعم تحويلات الكريبتو و تفرض رقابة على نشاط بطاقات البنوك الدولية. الأمل الكبير اليوم في ان تتبع الدول خطوات الامرات العربية المتحدة في تقنين خدمات الكريبتو و دعم انشطة الشركات العاملة في مجال العملات المشفرة و بالتالي تحرير منظومات الدفع. هذا متوقع جدا خصوصا ان العديد من الدول العربية لديها شراكات اقتصادية و استراتيجية مالية مع الامارات المتحدة و أعتقد أنها في لحظة ما ستجد نفسها مضطرة للقيام بذلك.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "July 16, 2023, 06:06:08 PM",
      "body": "Quote from: Kavelj22 on July 16, 2023, 05:00:53 PMأشاركك الرأي في النقطة الأخيرة بخصوص بطاقة OWNR البلاستيكية و الذي يجعل منها لا تصلح كبديل. على الأقل بما أنها لا تقد خدمات افتراضية. البطاقات البلاستيكية فضلا على أنه غالبا ما يتم حجزها من الجمارك فان اكبر مشاكل استخدامها هو فقدان جانب الأمان و الخصوصية بما ان جميع السحوبات يمكن للبنك المركزي مراقبتها و قد لا يتردد باثارة تتبع قانوني حول مصدر الأموال المسحوبة. هناك اصلا دول لا تدعم البنوك الدولية و لا غرابة ان تتوقف البطاقة عن العمل فيها.شخصيا لا أبحث عن بدائل لأن أفضل الحلول سيكون على درجة من المخاطرة اذا كنا في دول لا تدعم تحويلات الكريبتو و تفرض رقابة على نشاط بطاقات البنوك الدولية. الأمل الكبير اليوم في ان تتبع الدول خطوات الامرات العربية المتحدة في تقنين خدمات الكريبتو و دعم انشطة الشركات العاملة في مجال العملات المشفرة و بالتالي تحرير منظومات الدفع. هذا متوقع جدا خصوصا ان العديد من الدول العربية لديها شراكات اقتصادية و استراتيجية مالية مع الامارات المتحدة و أعتقد أنها في لحظة ما ستجد نفسها مضطرة للقيام بذلك.صراحة لا ارى اي فائدة من هذه البطاقات البلاستيكية ايضا. الامر الوحيد الذي يجعلك تمتلك بطاقة على الاقل تكون افتراضية هي عدم دعم العملات المشفرة من طرف معظم الخدمات مثل نتلفكس او جوجل بلاي كابسط مثال.وهذا ما يدفعنا الى الحصول على بطاقة بنكية رغم المشاكل والمحدودية فيها وبطاقة OWNR غير صالحة إطلاقا لتكون الحل : حيث اني قمت بفتح حساب وتحميل التطبيق الخاص بهم لكي اجد ان جميع البلدان العربية ومعظم الدول لا تدعمها البطاقة ولا يمتلكون بطاقة افتراضية لهذا اتمنى غلق الموضوع وعدم تضييع الوقت معها",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}