{
  "id": "topic_5438141",
  "title": "abadon666999",
  "author": "abadon666999",
  "created_time": "February 05, 2023, 10:38:15 AM",
  "content": "i have 1 btc privatekey with lost the last 6  characters...i know that there are 2 btc but i can't remember address...is there 1 solution?  thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438141",
  "comments": [
    {
      "author": "ABCbits",
      "created_time": "February 05, 2023, 12:11:53 PM",
      "body": "Brute force using software such as btcrecover[1] is the solution.[1] https://btcrecover.readthedocs.io/en/latest/Usage_Examples/basic_password_recoveries/#raw-private-keys",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "February 05, 2023, 01:57:11 PM",
      "body": "Quote from: abadon666999 on February 05, 2023, 10:38:15 AM i have 1 btc privatekey with lost the last 6  characters...i know that there are 2 btc but i can't remember address...is there 1 solution?  thanksThis should be very easy to brute force, even without knowing the address. I would also use btcrecover as ETF has suggested above.What format is your private key in? Is it hexadecimal (only containing the characters 0-9 and A-F), or is it in WIF (containing a mix of numbers and letters, and starting with \"5\", \"K\", or \"L\")?If it is hexademical, then 6 missing characters is only 16^6 = 16.8 million possibilities. Even an average home computer could exhaust this search space in a matter of minutes. If it is WIF, then the last 5 or 6 characters are checksum, so the number of actual possibilities will only be a handful and completely trivial to brute force.Do you know if the address begins with \"1\",\"3\", or \"bc1\"? It will be quicker to not have to derive and look up all three address types, but still easy enough to check all three if you don't know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "February 05, 2023, 02:10:50 PM",
      "body": "How many of these \"private keys\" do you have? It seems like every now and then you come here with another key missing arbitrary number of characters trying to \"find\" or sometimes try to sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "February 05, 2023, 02:20:42 PM",
      "body": "Quote from: pooya87 on February 05, 2023, 02:10:50 PMHow many of these \"private keys\" do you have? It seems like every now and then you come here with another key missing arbitrary number of characters trying to \"find\" or sometimes try to sell. Yea seems to be recurring thing with this user.looks like they have pissed a couple of people off in the past attempting to help too. Looks like broken promises for bounties for help that have never been paid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}