{
  "id": "topic_5476067",
  "title": "albon",
  "author": "albon",
  "created_time": "November 30, 2023, 01:55:21 PM",
  "content": "مرحبا إخواني الأعزاء، سلام الله عليكم ورحمته وبركاتههذا الموضوع لمناقشة نظام ال DT في المنتدى وقد أنشأته خصيصاً نظراً لأن هناك أعضاء قلة ما وجدتهم في القسم العربي منخرطون في نظام ال DT هذا ولنتبادل المعرفة ولكي يسعى أعضاء قسمنا المبجلين من الوصول لرتب ال DT التي تشمل DT1 + DT2 فمن خلال هذه القائمة الافتراضية يصبح أحكامك وتقيماتك للأعضاء الاخرىن افتراضية وموثوقة من خلال التقيمات التى ترسلها بهم، وهذا ليس بالضرورة انهم اشخاص موثوقة من حيث التعاملات وغيره, ويمكنك إضافة واستبعاد أي عضو حسب ثقتك بأحكامه وبتقيماته التي يرسلها للأعضاء الآخرين ويمكنك التصويت لعضو ما ليضاف بهذه القائمة التى تضم الأعضاء الاكثر سمعة وشعبية فى المنتدى،  فهناك شروط أن توفرت يتم إضافتك لهذه القائمة الافتراضية DT والتي سأقتبسها من موضوع الأخ Mikeywith الذي تطرق لهذا الموضوع منذ سنوات وايضاً اقتباس لما يجب فعله ومالا يجب فعله من موضوع الأخ Zwei وأيضا سأضيف المزيد من المراجع لفهم النظام أكثر.Quote from: mikeywith on April 01, 2019, 01:46:42 AMشروط لوجودك في القائمة (يتم تصعيد الاعضاء كل شهر تقريبي):-يجب ان تكون رتبتك \"عضو\" او اعلى- يجب ان تكون قد تواجدت في المنتدى عى الاقل مرة وحدة خلال اخر 3 ايام-يجب ان تكون قائمة الثقة الخاصة بك تحتوي عن مالا يقل 10 اشخاص تتق بهم ( الاشخاص الدي تتق بهم لا يتم حسابهم من ال10)-يجب ان تكون قد شاركت باي محتوى في اخر 30 يوم-يجب ان تكون موجود في 10 قوائم تقة لعشرة اعضاء لديهم على الاقل 10 نقاط جدارة ( النقاط التي ترسلها انت لهم لا يتم حسابها)-يجب ان تكون موجود في قائمة شخصين (2) يمتلكون مالا يقل عن 250 نقطة جدارة  (النقاط التي ترسلها انت لهم لا يتم حسابها )Quote from: Zwei on December 05, 2019, 05:53:52 PMما يجب فعله و ما لا يجب فعلهلا تضيف أعضاء إلى قائمة ثقتك لأنهم أضافوك!لا تستبعد عضو من قائمة ثقتك على أساس الانتقام. لا بأس أن تثق في حكم شخص ما، حتى ادا كان لا يثق في حكمك.لا تضف أي شخص إلى قائمة ثقتك لأنك كان لديك تجارة معهم. حتى لو كنت تثق بهم بالمال، فإن هذا لا يعني أنه يجب أن تثق في حكمهم على الآخرين. أعتقد أن هذا هو الخطأ الأكثر شيوعًا الذي يتم ارتكابه!لا بأس في تضمين حسابك البديل في قائمة ثقتك. هذا يعني أنك تثق في التعليقات التي اضفتها من هذا الحساب.لا تقم باضافة حسابك الرئيسي من حسابك (حساباتك) البديلة. يمكن أن يؤثر ذلك على تصويت DT1 ، على الرغم من أن هذا ليس جزءًا من هذا الدليل, لا تقم بذلك.المراجع يرجى الإطلاع عليها:[1] https://bitcointalk.org/index.php?topic=5126715.0[2] https://bitcointalk.org/index.php?topic=5096445.0[3] https://bitcointalk.org/index.php?topic=5207247.0الآن... لماذا لا تبدءون في بناء قائمة الثقة الافتراضية الخاصة بكم؟",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476067",
  "comments": [
    {
      "author": "mikeywith",
      "created_time": "November 30, 2023, 02:12:49 PM",
      "body": "اود ان اصحح جملة قد كنت كتبتها بالخطاء وهيQuote-يجب ان تكون قائمة الثقة الخاصة بك تحتوي عن مالا يقل 10 اشخاص تتق بهم ( الاشخاص الدي تتق بهم لا يتم حسابهم من الالاشخاص الذين لا ثتق بهم لا يتم حسابهم وليس العكس.يتعني لكي تصبح عضو DTيجب ان تحتوي قائمة الثقة الخاصة بك على عشرة اعضاء ثتق بهم.شكرا albon على تلخيص الموضوعانصح كل الاعضاء العرب بالانخراط في نظام الثقة وتفعيل قوائمهمالوصول الى قائمة الثقة الافتراضية امر سهل نسبيا, وهوا حق ومسؤولية لكل عضو في المنتدى, المهم هوا عند وصولك لهده القائمة يجب تتصرف بعقلانية ولا تظلم احد بتقيماتك..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "November 30, 2023, 11:56:30 PM",
      "body": "اود اولا ان اشكرك على اعادة طرح هذا الموضوع لأنه من الأهمية بمكان أن تتم اعادة تحديثه دوريا على الأقل للتذكير أو لتبيان ذلك للقادمين الجدد. و بالرغم من أن مواضيع نظام الثقة متكررة في أقسام عديدة من الواجهة الرئيسية فان تخلف العديدين عن الانتباه لذلك يمكن ملاحظتها بسهولة.نظام الثقة و على الرغم من اهميته فان اغلب الاعضاء لا يعيرون له اهمية بما فيهم الأعضاء النشيطين و ربما لان الاغلبية ينتظرون نتائج مباشرة لذلك كأن يتم ادماجهم ضمن قوائم الثقة الرسمية و هو ما ليس واردا لعدة اعتبارات طبعا.أنا مثلا و بالرغم من كوني عضوا ذو أقدمية منذ 2018 الا انني حديثا حين قمت باعداد قائمة ثقة خاصة بي خصوصا و انني لم اكن من اللذين ينتظرون ان يضيفني الاعضاء الذين اضفتهم الى قائمتي ان يضيفوني الى قائمة الثقة لديهم بالمثل.سوف لن اقول ان الاهتمام بهذه القائمة مهم بدرجة كبيرة و لكن يمكن القول بانه ممكن و سهل و يمكن لاي عضو القيام به مهما كانت رتبته و هو يضيف حتميا للمنتدى لأنه يؤسس لنظام ثقة لامركزي يمكن الاعتماد عليه اثناء استنتاج التقييمات.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 06, 2023, 09:24:49 AM",
      "body": "شكرا لك على الموضوع الهام والشرح الجيد أخي albonبالفعل نظام الثقة مهم جدا في المنتدى ولكن للأسف هناك الكثيرون لا يعلمون شيئا حوله حتى من الأعضاء القدامى، أنا أيضا مثل الأخ Kavelj22 بقيت فترة طويلة في المنتدى ولا أعلم الكثير عنه حتى قرأت موضوع الأخ ميكي وتعرفت على نظام الثقة وأنشأت قائمة الثقة الخاصة بي منذ فترة قريبة فقط. لذلك كل الشكر لك وللأخ ميكي على شرح نظام الثقة في المنتدى.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 07, 2023, 10:03:58 PM",
      "body": "Quote from: yhiaali3 on December 06, 2023, 09:24:49 AMبالفعل نظام الثقة مهم جدا في المنتدى ولكن للأسف هناك الكثيرون لا يعلمون شيئا حوله حتى من الأعضاء القدامى، أنا أيضا مثل الأخ Kavelj22 بقيت فترة طويلة في المنتدى ولا أعلم الكثير عنه حتى قرأت موضوع الأخ ميكي وتعرفت على نظام الثقة وأنشأت قائمة الثقة الخاصة بي منذ فترة قريبة فقط. صحيح ان نظام الثقة فعال للغاية و يؤدي دورا مهما في الحفاظ على المنتدى كمساحة حرة خالية من الشبهات بما ان النظام يسمح للاعضاء باضافة تقييمات على اي بروفيل دون ان تكون هناك اي صلاحية لتغيير او محو التقييم الا من صاحب التقييم نفسه و حتى الادارة لا تستطيع القيام بذلك. نظام الثقة يمكن بعض الاعضاء من ان تكون لهم صلاحيات ان يظهر تقييمهم على واجهة البروفيل و الذين هم اعضاء dt1 و dt2 و لذلك فانه تشكلت العديد من الدراما بسبب هذا النظام او لنقل بسبب الاعضاء الذين يريدون استغلال هذا النظام اما لتحقيق غايات شخصية كأن يسيطروا على نتائج النظام من خلال اضافة حساباتهم البديلة الى القائمة او لتدمير سمعة احدى البروفيلات من خلال عرض تقييمات خاطئة على بروفيله. و بما ان قوائم الثقة ظاهرة و يمكن لاي شخص ان يطلع على جميع قوائم الثقة فانه اصبحت هناك تحالفات و مؤامرات تؤثث مناخ الدراما في المنتدى و التي يزخر بها قسم السمعة Reputation.هذه الاسباب جعلت العديد يعزفون عن ان تكون لديهم قائمة ثقة من انتاجهم الخاص خوفا من ان يجدوا انفسهم اطرافا في قصص درامية لا علاقة لهم بها او ان يتم اتهامهم بدعم طرف عن اخر خصوصا ان اي عضو يستطيع اي اضافة اي عضو الى قائمة ثقته حتو لو كان ثابتا انه متحيل او عديم الثقة. هذا ما يفسر وجود العديد من الحسابات التي ليست اهلا للثقة او هي اصلا حسابات محضورة على قوائم dt و هو ما يسيل الكثير من الحبر في العديد من النقاشات.بالرغم من ذلك لازلت اشجع الجميع على اعداد قوائم الثقة الخاصة بهم لأن هذا فيه دعم للمنتدى و يمكن النأي بأنفسنا عن تلك المعارك التي تدور بين بعض الاعضاء.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 08, 2023, 04:00:08 AM",
      "body": "Quote from: Kavelj22 on December 07, 2023, 10:03:58 PMو بما ان قوائم الثقة ظاهرة و يمكن لاي شخص ان يطلع على جميع قوائم الثقة فانه اصبحت هناك تحالفات و مؤامرات تؤثث مناخ الدراما في المنتدى و التي يزخر بها قسم السمعة Reputation.هذه الاسباب جعلت العديد يعزفون عن ان تكون لديهم قائمة ثقة من انتاجهم الخاص خوفا من ان يجدوا انفسهم اطرافا في قصص درامية لا علاقة لهم بها او ان يتم اتهامهم بدعم طرف عن اخر خصوصا ان اي عضو يستطيع اي اضافة اي عضو الى قائمة ثقته حتو لو كان ثابتا انه متحيل او عديم الثقة. هذا ما يفسر وجود العديد من الحسابات التي ليست اهلا للثقة او هي اصلا حسابات محضورة على قوائم dt و هو ما يسيل الكثير من الحبر في العديد من النقاشات.بالرغم من ذلك لازلت اشجع الجميع على اعداد قوائم الثقة الخاصة بهم لأن هذا فيه دعم للمنتدى و يمكن النأي بأنفسنا عن تلك المعارك التي تدور بين بعض الاعضاء.بما أنك ذكرت هذه النقطة، فالحقيقة أنا مستغرب بشدة مما يحصل في قسم السمعة بالمنتدى، لقد تابعت عدة قصص درامية وكثير من المهاترات التي تحدث هناك ببين الأعضاء وبعضهم أعضاء قدامى ومعروفين جيدا في المنتدى، رغم ذلك تتطور تلك المشاحنات وتخرج في كثير من الأحيان عن نطاق الادب ويتم استخدام أوصاف وكلمات بذيئة. في الحقيقة ما يحصل في ذلك القسم معيب بحق المنتدى حتى أن بعض الأعضاء سماه قسم النميمة  لذلك كما قلت أخي من الأفضل ان ننأى بأنفسنا عن كل تلك القصص ونبقى متفرجين. لأن من يدخل فيها سيدخل في دوامة صعب الخروج منها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 08, 2023, 10:14:36 PM",
      "body": "شكرا على الموضوع اخي albon سبق ان تحدثنا على هذا الموضوع من قبل لكن لم اتمكن من فهم عمل  نظام الثقة حتى لو اني عضو منذ اكثر من عام لكن لم انتبه جيدا للامر وايضا لانه معقد جدا وتكثر فيه الشروط وقوانين تتغير حسب الوضعيات وما يظنه الاغلبية من الاعضاء انه الافضل او الاصح.لكن حاليا او الاونة الاخيرة هناك وضعيات اين بعض الاعضاء المعروفين قاموا بالتلاعب مع هذا النظام بشكل من الاشكال ولم يكن هناك عقوبات او فرصة للاخرين وضع ارائهم خوفا على حساباتهم من الحصول على تقييمات سلبية.الانتقام حاليا صار معروفا ويوجد مع الاسف قبليات وفرق تسيطر على النظام وحتى لو كان عضو منهم مخطئ وهذا حسب ظني لانه من الممكن ان وراء القصص اشياء اخرى ودلائل مختلفة.افضل وضع الاعدادات الافتراضية حاليا",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "December 09, 2023, 12:19:49 AM",
      "body": "Quote from: yhiaali3 on December 08, 2023, 04:00:08 AMلذلك كما قلت أخي من الأفضل ان ننأى بأنفسنا عن كل تلك القصص ونبقى متفرجين. لأن من يدخل فيها سيدخل في دوامة صعب الخروج منها. اختلف معك اخي بشدة اخي, فعندما يكون هناك نظام ديموقراطي فأن عدم مشاركته فيه يتيح الفرصة للاخرين ان يستغلوك, وهدا مايحدث في الانتخبات مثلا في الدول المتخلفة, تجد شخص يترشح للبرلمان ب 500 صوت فقط في بلد عدد سكانه عشرين مليون, لان الاغلبية يقولون (لافائدة من تصويتنا, لانريد المشاكل و و و ) وهدا مايحدث هنا تماما, ان تجاهلنا جميعا مسؤولياتنا في التصويت للاشخاص الجيدين سوف نترك الساحة للاشخاص السيئين.يجب ايضا ان تعي ان الابتعاد عن قوائم الثقة لايعني انك في مأمن, العديد من الاعضاء تحصلو على تقيمات سلبية من بعض اعضاء الثقة الافتراضية فقط لاسباب سياسية او بمجرد اختلاف راي في موضوع معين, لذلك الانخراط في هدا النظام واجب على كل الاعضاء خصوصا القداما الذين لديهم فعلا قائمة بالاشخاص الذين يثقون بتقيماتهم حتى وان كانت تلك القائمة في مخيلتهم ولم تجد طريقها للتبطيق الفعلي على المنتدى.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 09, 2023, 02:12:16 AM",
      "body": "Quote from: mikeywith on December 09, 2023, 12:19:49 AMيجب ايضا ان تعي ان الابتعاد عن قوائم الثقة لايعني انك في مأمن, العديد من الاعضاء تحصلو على تقيمات سلبية من بعض اعضاء الثقة الافتراضية فقط لاسباب سياسية او بمجرد اختلاف راي في موضوع معين, لذلك الانخراط في هدا النظام واجب على كل الاعضاء خصوصا القداما الذين لديهم فعلا قائمة بالاشخاص الذين يثقون بتقيماتهم حتى وان كانت تلك القائمة في مخيلتهم ولم تجد طريقها للتبطيق الفعلي على المنتدى.صدقني انني افقد الأمل في هذا النظام كلما اطلعت على احدى قصص الدراما على المنتدى حين يستغل البعض نظام الثقة وفقا لاراء شخصية ذات طابع عنصري او ايديولوجي من اي نوع. هذا يتكرر دوما و لا يبدو ان الناس تعتبر او ان الجميع يريد المحافظة على هذا الفضاء امنا و نظيفا قدر المستطاع.كنت تابعت ذات مرة كيف ان احد الاقسام المحلية (اي بلغة محلية لن اذكر اسمها) كانوا يضيفون بعضهم الى قوائم الثقة و بمجرد ارتقاء بعض الاعضاء الى رتبة DT1 فقد وجد البقية انفسهم اعضاء DT ايضا بالرغم من انه اما لا يتركون اصلا تقييمات على بروفيلات الاخرين او ان تقييماتهم تفتقد للموضوعية و النزاهة. كان ذلك مهزلة و لم يتمكن احد من تغيير الوضع بما ان اولئك الاعضاء في ذلك القسم و عصابة معهم يدافعون عن نزاهة العملية.أيضا تابعنا جميعنا ما حصل معك انت شخصيا مؤخرا مع احد الاعضاء بسبب اختلاف موقفكما حول قضية معينة لانصدم بعد ذلك من تصرفاته التي اقل ما يمكن ان اقول عنها انها صبيانية و انا فعلا كنت اقدره كثيرا و اتابع منشوراته و اقرأ له باستمرار.أخيرا، لا يجب ان اكون محبطا كثيرا لان لهذا النظام مزاياه التي تفوق استخداماته السيئة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 09, 2023, 04:19:15 AM",
      "body": "Quote from: mikeywith on December 09, 2023, 12:19:49 AMQuote from: yhiaali3 on December 08, 2023, 04:00:08 AMلذلك كما قلت أخي من الأفضل ان ننأى بأنفسنا عن كل تلك القصص ونبقى متفرجين. لأن من يدخل فيها سيدخل في دوامة صعب الخروج منها. اختلف معك اخي بشدة اخي, فعندما يكون هناك نظام ديموقراطي فأن عدم مشاركته فيه يتيح الفرصة للاخرين ان يستغلوك, وهدا مايحدث في الانتخبات مثلا في الدول المتخلفة, تجد شخص يترشح للبرلمان ب 500 صوت فقط في بلد عدد سكانه عشرين مليون, لان الاغلبية يقولون (لافائدة من تصويتنا, لانريد المشاكل و و و ) وهدا مايحدث هنا تماما, ان تجاهلنا جميعا مسؤولياتنا في التصويت للاشخاص الجيدين سوف نترك الساحة للاشخاص السيئين.يجب ايضا ان تعي ان الابتعاد عن قوائم الثقة لايعني انك في مأمن, العديد من الاعضاء تحصلو على تقيمات سلبية من بعض اعضاء الثقة الافتراضية فقط لاسباب سياسية او بمجرد اختلاف راي في موضوع معين, لذلك الانخراط في هدا النظام واجب على كل الاعضاء خصوصا القداما الذين لديهم فعلا قائمة بالاشخاص الذين يثقون بتقيماتهم حتى وان كانت تلك القائمة في مخيلتهم ولم تجد طريقها للتبطيق الفعلي على المنتدى.طبعا احترم رأيك بشدة أخي ميكي وأويد كلامك، لكن لكل إنسان طبيعته الخاصة ، أنا طبيعيتي لا أحب الدخول في المجادلات أو المناقشات الحادة وخاصة تلك التي تكون لها خلفيات شخصية أو سياسية لأنني أشعر أنها مضيعة للوقت وكل طرف سيظل متمسك برأيه ولن يغير موقفه ولن يتمكن من تغيير موقف الطرف الآخر أيضا. كما ذكرت أنت أخي ميكي \" العديد من الاعضاء تحصلو على تقيمات سلبية من بعض اعضاء الثقة الافتراضية فقط لاسباب سياسية او بمجرد اختلاف راي في موضوع معين\"، لذلك أنا لا أقول أنه يجب الابتعاد عن نظام الثقة أو عدم إنشاء قوائم الثقة ولكن أقول أن ننأى عن المجادلات والمهاترات التي تحصل بين الأعضاء بسبب مواقف سياسية أو قضايا شخصية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 09, 2023, 06:09:10 PM",
      "body": "Quote from: mikeywith on December 09, 2023, 12:19:49 AMيجب ايضا ان تعي ان الابتعاد عن قوائم الثقة لايعني انك في مأمن, العديد من الاعضاء تحصلو على تقيمات سلبية من بعض اعضاء الثقة الافتراضية فقط لاسباب سياسية او بمجرد اختلاف راي في موضوع معين, لذلك الانخراط في هدا النظام واجب على كل الاعضاء خصوصا القداما الذين لديهم فعلا قائمة بالاشخاص الذين يثقون بتقيماتهم حتى وان كانت تلك القائمة في مخيلتهم ولم تجد طريقها للتبطيق الفعلي على المنتدى.انا حاليا هذا ما افعله لاني صراحة متخوف من الدخول في صراع سياسي ضد شخص اخر او الاسوء جماعة من الاعضاء ضد افكاري علما انها ليست ضد اي قانون في المنتدى او حتى نظام الثقة لكن بمجرد ان تلك الجماعة لديه عضو او اكثر في نظام DT1 او DT2 يمكنهم وضع ثقة سلبية وحسابك هنا لن يكون لديه قيمة لان كل آرائك او تعليقاتك ليست موثوقة وكما نرى حاليا هذا ما يحدث.لكن من جهة اخرى اذا كان هناك عدم تحيز سيكون النظام ممتاز ولن تحدث اي مشاكل بل العكس سيتم تفادي اي عضو نصاب او مشاريع مثل 1xbit والاعضاء الذين يحاولون الترويج لشيء متحيل.حسب رأيي النظام الديموقراطي حبر على ورق فقط ولن يتم تطبيقه بسبب الانحياز وتعدد الافكار، اللغات، والثقافات مجتمعة في المنتدى",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "December 10, 2023, 12:14:42 AM",
      "body": "Quote from: Kavelj22 on December 09, 2023, 02:12:16 AMكنت تابعت ذات مرة كيف ان احد الاقسام المحلية (اي بلغة محلية لن اذكر اسمها) بكل تأكيد هدا الشيء يحدث في كل الاقسام, حتى في الاقسام الرئيسية الانجليزية هناك تحالفات واحزاب و و , فهدا امر طبيعي , ولكن ان يتم ترك الساحة فارغة لهاؤولاء يعني اننا جميعا سنكون ضحايا لهم في وقت ما!Quoteأيضا تابعنا جميعنا ما حصل معك انت شخصيا مؤخرا مع احد الاعضاء بسبب اختلاف موقفكما حول قضية معينة لانصدم بعد ذلك من تصرفاته التي اقل ما يمكن ان اقول عنها انها صبيانية و انا فعلا كنت اقدره كثيرا و اتابع منشوراته و اقرأ له باستمرار.ذلك الشخص استمر في ظلمه وابتزازه للاعضاء الضعفاء لان اغلبية الاعضاء في هدا المنتدى لايريدون الانخراط في هده الامور وهم يتقبلون الظلم والابتزاز فقط لكي يتمكنو من التواجد في حملات التوقيع, وامثال مثل ذلك الشخص وغيره يعرفون نقاط الضعف هده ويستغلونها ضد الاعضاء الضعفاء, ولكن لو كان لكل شخص قائمة ثقة ويمارسون التصويت ضد كل من يسيء استخدام النظام لما وجد شخص مثله مكانا في هده القائمة. اخي يحى, انا مثلك ايضا لا اخوض في هده النقاشات الى القليل الناذر ولكن عندما ارا الظلم لايمكنني ان اسكت عنه مهما كانت العواقب, والشخص الظالم لن يتوقف عن ظلمه حتى يتم مواجهته, التواجد في اقسام ال repuation وغيرها ليس امر ضروري وليس له علاقة باستخدام نظام الثقة بالطريقة الصحيحة.GxSTxVطالما ان اغلبية الاعضاء يمتنوع عن التصويت والمشاركة في هدا النظام فلا يحق لهم ان يطالبو بالعدل, وطالما وجدث السلطة في ايادي بعض الاشخاص فسوف يتم استغلالها واساءة استخدامها هدا الامر طبيعي ومتوقع لذلك طلب الادمن من الجميع الانخراط في هدا النظام ولكن ماحدث ان قلة قليلة فقط فعلت ذلك, وهدا ساهم في وصول بعض الاعضاء الذين لايستحقون هدا المكان, ولكن بالمجمل اغلبهم اشخاص جيدون واكفاء.بكل تأكيد اتفهم موقف اي شخص لايريد حتى انشاء قائمة ثقة خاصة به والاعتماد كليا على قرارات الاخرين فهدا ايضا حق مكفول, انا فقط اردت ان اوضح نقطة معينة وهي انه بعدم انخراطكم في التصويت تفقد حقك في المطالبة في العدالة وتفرط في حقوقك لصالح هاؤولاء الذين مارسو حقوقهم في التصويت.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 12, 2023, 07:27:16 PM",
      "body": "Quote from: mikeywith on December 10, 2023, 12:14:42 AMطالما ان اغلبية الاعضاء يمتنوع عن التصويت والمشاركة في هدا النظام فلا يحق لهم ان يطالبو بالعدل, وطالما وجدث السلطة في ايادي بعض الاشخاص فسوف يتم استغلالها واساءة استخدامها هدا الامر طبيعي ومتوقع لذلك طلب الادمن من الجميع الانخراط في هدا النظام ولكن ماحدث ان قلة قليلة فقط فعلت ذلك, وهدا ساهم في وصول بعض الاعضاء الذين لايستحقون هدا المكان, ولكن بالمجمل اغلبهم اشخاص جيدون واكفاء.أتفق تماماً، وما أراه أن سكوتنا عن الحق وعدم مشاركتنا في التصويت لنظام الثقة هو نصرة للظالم، فلا نلوم من يسيء استخدام سلطته في قمع الأعضاء وتكميم الأفواه طالما تركنا له الساحة هو وأعوانه يفعلون ما يشاءون ضد أي شخص مظلوم، إضافة إذا ما لم يكن أي عضو في الثقة الافتراضية فهو ربما يوماً ما يتعرض لظلم أي عضو في هذه الثقة الافتراضية كما حدث لغيره... والآن كيف يطالب بالعدالة وكيف يتم أخذ أقواله على محمل الجد طالما تجاهل أن ينخرط في هذه القائمة وتنازل عن إبداء صوته واكتسب داعمين له، فالآن صوته بلا قيمة حتى بالدفاع عن نفسه!من ينشأ هذه القائمة ليس بالضرورة أن ينخرط في موضوعات قسم السمعة أو يدخل نفسه في أي دراما، فقط ليكون له الأحقية في التصويت لكي يصل الأعضاء الأكثر استحقاقاً لهذه الرتبة لها ويتم سحب الرتبة من الأعضاء الذين يسيئون استخدامها وهذا لا يمنع أنهم من الممكن أن يكونوا أعضائاً قدامى لديهم خبرات ومعلومات جيدة في المجال لكنهم لا يؤمنون بأن (اختلاف الرأي لا يفسد للود قضية) ولديهم التفرقة العنصرية وعدم الحيادية... شكرا لكم",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 12, 2023, 11:45:13 PM",
      "body": "Quote from: mikeywith on December 10, 2023, 12:14:42 AMQuote from: Kavelj22 on December 09, 2023, 02:12:16 AMكنت تابعت ذات مرة كيف ان احد الاقسام المحلية (اي بلغة محلية لن اذكر اسمها) بكل تأكيد هدا الشيء يحدث في كل الاقسام, حتى في الاقسام الرئيسية الانجليزية هناك تحالفات واحزاب و و , فهدا امر طبيعي , ولكن ان يتم ترك الساحة فارغة لهاؤولاء يعني اننا جميعا سنكون ضحايا لهم في وقت ما!Quoteأيضا تابعنا جميعنا ما حصل معك انت شخصيا مؤخرا مع احد الاعضاء بسبب اختلاف موقفكما حول قضية معينة لانصدم بعد ذلك من تصرفاته التي اقل ما يمكن ان اقول عنها انها صبيانية و انا فعلا كنت اقدره كثيرا و اتابع منشوراته و اقرأ له باستمرار.ذلك الشخص استمر في ظلمه وابتزازه للاعضاء الضعفاء لان اغلبية الاعضاء في هدا المنتدى لايريدون الانخراط في هده الامور وهم يتقبلون الظلم والابتزاز فقط لكي يتمكنو من التواجد في حملات التوقيع, وامثال مثل ذلك الشخص وغيره يعرفون نقاط الضعف هده ويستغلونها ضد الاعضاء الضعفاء, ولكن لو كان لكل شخص قائمة ثقة ويمارسون التصويت ضد كل من يسيء استخدام النظام لما وجد شخص مثله مكانا في هده القائمة. انا اتفق معك في تحليلك و كنت اتمنى ان اكون بنفس حماسك. بالرجوع الى عدد الاعضاء النشيطين فان نظام الثقة سيكون دائما عرضة للتلاعب و احد الانظمة التي لن يتوقف التلاعب بها. النظام يمكن ان ينجح بالمطلق لو كان اغلبية الاعضاء النشيطين يحرصون على انشاء قوائم ثقة خاصة بهم. انشاء قائمة الثقة اختياري و الاعضاء احرار في تعزيز هذا النظام او صرف النظر عنه. الامر كان سيكون افضل لو مثلا فرضت الادارة انشاء قائمة ثقة بعد الوصول الى عضوية مرتفعه كHero او Legendary.هذا ليس سهلا بالتأكيد و لن يكون التأسيس له سهلا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}