{
  "id": "topic_5401869",
  "title": "MikeJ_NpC",
  "author": "MikeJ_NpC",
  "created_time": "June 08, 2022, 11:42:25 PM",
  "content": "Can someone be so kind and point me in the right direction in regards to secret to sec calculations, and what other variables are required to walk the secret into the sec?  Basically i would like to cross check and ensure the result i am ending up is correct, which this can be done from the secret. Im told there are a few ways this can be done, but have not found too much in regards to formula/layout or the other variable(s) which are required for this. I mean if you have the secret the rest should be easier than ensuring that is correct to the wallet....   So can someone please enlighten me on that aspect. I think my sec is incorrect but the secret is right so i would like to cross check and ensure sec goes with the address .....    so any help would be appreciated on it..   Thank you in advance.    ps yes ive looked   lol ... .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401869",
  "comments": [
    {
      "author": "jackg",
      "created_time": "June 09, 2022, 12:03:07 AM",
      "body": "Do you know what these are you're trying to convert and why you actually need them? Where did the \"sec\" term come from, what wallet are you using?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "June 09, 2022, 01:16:12 AM",
      "body": "By \"sec\", do you mean \"private key\"? And, by \"secret\", do you mean Bitcoin Core's extended private key?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 09, 2022, 05:35:48 AM",
      "body": "Do you mean \"sec\" which describes the WIF private key in the quoted message in this reply of yours: /index.php?topic=161030Then based from the OP, the \"secret\" is the ECDSA private key?If so, you can refer to these documentations:learnmeabitcoin.com/technical/wifen.bitcoin.it/wiki/Wallet_import_format",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}