{
  "id": "topic_5411474",
  "title": "GreatArkansas",
  "author": "GreatArkansas",
  "created_time": "August 28, 2022, 02:53:39 AM",
  "content": "Bitcoin (Right) and Banks (Left) works.This image is a very simple illustration of how Bitcoin and Banks differ from each other, this is showing how Bitcoin and banks work.If you take a look at how banks work, it is clearly showing that they rely on one centralized entity which for sure it's a centralized database where all the information.But Bitcoin, it's decentralized, no centralized entity that can become only one source of truth.What are your thoughts about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411474",
  "comments": [
    {
      "author": "The Cryptovator",
      "created_time": "August 28, 2022, 03:27:16 AM",
      "body": "Decentralization makes difference between fiat and cryptocurrency. Yea, a picture describes the whole story of decentralization. Traditional fiat won't work without centralization, otherwise, the government can't control everything as they want. We can see one more thing on the picture, it's a borderless transaction on the Bitcoin picture, and fiat has a border where it has to be through a pass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 28, 2022, 04:52:24 AM",
      "body": "Probably one of the most common(and effective) Bitcoin-related illustrations I've seen. Surprisingly I haven't seen a version for central banks vs bitcoin (supply cap vs no supply cap, static inflation vs dynamic inflation, etc).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 28, 2022, 05:27:38 AM",
      "body": "Centralized and decentralizedCensorship and non-censorshipRely on banks or Be your own bank (with your keys)[/i]Above are very basic differences between Banks and Bitcoin. Also remember some centralized platforms even don't actually give you services with which you actually buy and hold Bitcoin but many people think they spend money to buy real Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "August 28, 2022, 05:59:59 AM",
      "body": "Don't compare the Bitcoin Core blockchain to banks.Compare the cryptocurrency exchange platforms to the banks. The crypto exchanges are as centralized as banks and they are following the same KYC procedures as banks. The majority of the crypto users are using crypto exchange platforms, not cold wallets.The banks are winning the battle against crypto trading platforms, because the governments are supporting them. If the bank gets bankrupt, your funds are guaranteed by the central bank/government up to 100K USD/EUR. If a crypto exchange platform gets bankrupt, you won't get anything in most cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 28, 2022, 06:23:50 AM",
      "body": "Quote from: davis196 on August 28, 2022, 05:59:59 AMDon't compare the Bitcoin Core blockchain to banks.Compare the cryptocurrency exchange platforms to the banks. The crypto exchanges are as centralized as banks and they are following the same KYC procedures as banks. The majority of the crypto users are using crypto exchange platforms, not cold wallets.The banks are winning the battle against crypto trading platforms, because the governments are supporting them. If the bank gets bankrupt, your funds are guaranteed by the central bank/government up to 100K USD/EUR. If a crypto exchange platform gets bankrupt, you won't get anything in most cases. Bitcoin is using blockchain to record every transactions, similar like fiat is using banks to record every transactions, so there's a correlation between Bitcoin core blockchain and banks. Anyway which person did suggest to use centralized exchanges in the first place? not me, I always suggest to use Bisq as long as you're not a regular trader. It's their risk to use centralized exchanges that they think SAFU will always back up every coins if a sudden hack happen.You wouldn't lose your coins as long as you're using decentralized exchanges and hold your coins on hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "August 28, 2022, 07:16:41 AM",
      "body": "Quote from: GreatArkansas on August 28, 2022, 02:53:39 AMWhat are your thoughts about this?I am not sure what you mean. Are you afraid of the security risk that banks are centralised and have one big server where they store all the information? This might seem risky based on your graphic, but there are backups for all information. It's not like one hacker attack could wipe out all the information and your bank balance is 0. The centralisation of banks comes from the aspect that it has a different ownership structure than crypto currencies. The bank is being owned by it's shareholders, who are liable for their capital they put into the bank. They need to follow laws based on the country they operate in and demand dividends to compensate for the risk they take. This form of ownership also means that there is one person in charge at the top of the hierachy. Whereas in the crypto world the decentralisation aspect means that we will not have one boss who can control everything. Banks and centralisation seem to be a thing from the past where one person held all the power. The future will look different where the power is shared and more people can participate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "August 28, 2022, 07:40:05 AM",
      "body": "It’s really great to see that Bitcoins are way ahead of Banks.Thanks to Satoshi for which we are enjoying these awesome features and are having full access to our money.Earlier also I used to hate banks, due to taxes and ample of laws. Banks are always abided by the government and follows it’s order like a dog, on the other hand due to the decentralised nature of Bitcoins, no government can ever find out how much BTC I have.BTC will always be ahead of banks and also after a later period of time, the comparison won’t exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "August 28, 2022, 08:08:27 AM",
      "body": "Quote from: GreatArkansas on August 28, 2022, 02:53:39 AM~snip~If I look at the illustration on the right side, it is very much like a mesh topology and its benefit is that users are free from any central control, similarly in the case of Bitcoin, these people can do their financial transactions without any control from the bank. And that's why bitcoin is gaining popularity day by day . I am also think that there is more safety on bitcoin but I also think some time we faces problem with the volatilities of bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 28, 2022, 10:31:28 AM",
      "body": "Quote from: GreatArkansas on August 28, 2022, 02:53:39 AM~snip~What are your thoughts about this?I saw that picture a few days ago in WO and I don't think it has any importance in the sense that someone will understand Bitcoin better if you show them that banks are centralized and Bitcoin is decentralized. The fact that according to some research 99% of people in the world who have access to banks still prefer a centralized system over Bitcoin speaks for itself.Some of these people certainly don't understand Bitcoin or haven't heard that it even exists, but most are not ready to be their own bank. Put a Bitcoin wallet with $100 on one side and a bank card with the same amount on the other and offer it to the average person on the street, what do you think they will choose?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 28, 2022, 10:59:52 AM",
      "body": "No wonder, all bank owners and politicians discourage users from investing in cryptocurrencies, citing the same findings as evidence. But the truth is that they are afraid of losing customers and total control, which will lead to losses for banks. The beauty of bitcoin is to make transactions between people, they do not need to leave their homes, go to the bank, present documents, and experience other difficulties, without denying that the bank can also prohibit the transfer of money. All this a person can do on their own, without wasting time, without the participation of a third party. And of course, the third party today called the bank will eventually be moved away from involvement in people's lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "August 28, 2022, 11:19:52 AM",
      "body": "Quote from: lovesmayfamilis on August 28, 2022, 10:59:52 AMNo wonder, all bank owners and politicians discourage users from investing in cryptocurrencies, citing the same findings as evidence. Definitely, because banks and the government knows about this, and in other to continue generating the revenue gotten from transaction fees and to have total control over the funds of the masses, discourage cryptocurrency/Bitcoin. But all thanks to decentralized exchanges such as \"bisq\" which makes crypto to Fiat transactions easily accessible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "August 28, 2022, 11:29:51 AM",
      "body": "This is the main reason why banks hates Bitcoin decentralized idea because it cuts a huge fee from being the middleman between party. Besides they will not have access to a huge unused money of user on decentralized way because people can use non custodial wallet to save there money unlike fiat that needs to be deposit on bank account just to make the digitalized and safe.In reality, Banks will never win to Bitcoin but since there’s a huge people behind banking industry, They will not allow to destroy there business for something decentralized which Government is not in favor too due to tax purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 28, 2022, 11:43:05 AM",
      "body": "Bitcoin is too perfect for its own good. Humans are definitely far from being perfect. We lie, we get jealous, we don't want to get punished for our mistakes.That's why bitcoin will never be as big as banks because humans will always prefer corruption&lies over perfection&honesty.I am sorry but banks will win this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "August 28, 2022, 11:51:25 AM",
      "body": "Quote from: GreatArkansas on August 28, 2022, 02:53:39 AMWhat are your thoughts about this?at the end of the day, for the person to buy bitcoin, they need to have a bank account (in the same centralized bank, annoying, and the person will still need to go through KYC to have a bank account. in my country to have documents to open a bank account Is a very stressful process, first the person needs to go to the head of the neighborhood, then the person takes the document from the head of the neighborhood and goes to the head of the block where they give you the declaration of residence and then the person has to take ID + the declaration of residency + money and copy of ID to bank. these are the requirements to open an account in my country's bank) and after the person has opened a bank account, the person needs to create an account in a centralized exchange where KYC: ID \" passport , honestly, dealing with passport in many countries is not so fast and has costs \" + declaration of residence, which is also another headache, the person needs to have their own house to be able to have a water and electricity bill in the name of the person or have internet service on behalf of the person.after all this headache, the person is ready to buy bitcoin using the bank and when withdrawing we also need the bank. Today we are moving towards the centralization of everything, so bitcoin itself can be decentralized, but to be able to buy and withdraw it? we need everything centralized, even to use casinos we need to be willing to do KYC. at the end of the day centralization wins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 28, 2022, 01:30:11 PM",
      "body": "Quote from: mindrust on August 28, 2022, 11:43:05 AMBitcoin is too perfect for its own good. Humans are definitely far from being perfect. We lie, we get jealous, we don't want to get punished for our mistakes.That's why bitcoin will never be as big as banks because humans will always prefer corruption&lies over perfection&honesty.I am sorry but banks will win this one.Banks may be struggling to some extent with Bitcoin, but is Bitcoin fighting the banks? Although there is some opinion that Bitcoin was created to be a single world currency, and that the banks should be defeated in some imaginary war, I would not agree that those who think so are right. In most cases, banks only act as intermediaries between investors in Bitcoin and crypto exchanges, which means that they actually help as many people as possible come into possession of the same.Banks will not win in anything because there is no war that some imagine, but Bitcoin on the other hand wins every time someone understands the difference between fiat and Bitcoin and decides to accept the alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 28, 2022, 01:43:12 PM",
      "body": "I really don't see it as an US vs THEM.I see it as an US+THEM = BETTER FOR BOTHBanks and banking services and similar things will always be needed for some things in today's world.However, BTC and crypto in general, for lack of better wording will keep them 'more honest'.Perfect example is foreign exchange fees have been slowly decreasing over the last few years. Do you think that banks want to lower fees or is it beacuse there are now so many ways of sending funds all over the planet that they had to adapt?-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 28, 2022, 01:53:15 PM",
      "body": "One of the great way on illustrating how decentralization and centralisation differ from one another which is also why most banks are against cryptocurrencies especially bitcoin. On the illustration you've shown is just an example for 9 users, imagine if it were to be the amount of the population of bank users and crypto users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wahyuagung26",
      "created_time": "August 28, 2022, 01:56:56 PM",
      "body": "There are several main factors on each side of the two things above, and each of them certainly has very different virtues, and one of them is that Decentralization makes the difference between cryptocurrency and fiat, according to the picture above there are differences in terms of transactions, and Bitcoin transactions here. unlimited, while transactions with fiat have borders that must be passed.The picture shows the very basic difference between Bitcoin and Bank, and it is also seen that the illustration is very superior to Bitcoin in front of the Bank. I can see that Bitcoin is perfect for the good of people, especially I have really felt the perfection of Bitcoin.It seems as though in reality, Bitcoin will remain at the forefront, and banks will never win from a Bitcoin standpoint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 28, 2022, 02:06:15 PM",
      "body": "Bitcoin, people, Satoshi and Central Bank, let's give it a closer lookhttps://twitter.com/TheBitcoinConf/status/1562847352448118785?t=rSf2d2GnbPr8O6On-P7VNQ&s=19Over several years, many has been battling with various challenges from central banks, their system and mode of operations which is a steping stone on human rights to financial freedom, not until Satoshi stand out and raise an alternative which is bitcoin that now gives people confidence and boldness to make it all through in regaining back their taken confidence and boldness regarding their finances from the government centralized system, now the adoption has increases and the confidence is good and convincing enough about future privileges ahead with bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}