{
  "id": "topic_5528429",
  "title": "Pterosphere",
  "author": "Pterosphere",
  "created_time": "February 01, 2025, 09:49:41 AM",
  "content": "if one starts out with a single signature cold wallet, and later, bitcoin rises a lot, or one acquires more bitcoin, or both, and it becomes more worth it to switch to multisig, what would be the best way to do that? Can anyone refer us to some good articles or tutorials on how we should go about that? thnx",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5528429",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "February 01, 2025, 09:52:41 AM",
      "body": "For 2-of-2 multisig: https://electrum.readthedocs.io/en/latest/multisig.htmlFor 2-of-3 multisig: https://bitcoinelectrum.com/creating-a-multisig-wallet/Make sure you backup all the seed phrases and master public keys appropriately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "February 01, 2025, 11:30:30 AM",
      "body": "Quote from: Pterosphere on February 01, 2025, 09:49:41 AMif one starts out with a single signature cold wallet, and later, bitcoin rises a lot, or one acquires more bitcoin, or both, and it becomes more worth it to switch to multisig, what would be the best way to do that? Can anyone refer us to some good articles or tutorials on how we should go about that? thnxIf you start with a single signature cold wallet, stick with it. Why do you think that you need a multisig wallet? For extra security? But do you have another person with whom you are willing to share the second wallet details? Or do you plan to hold both signatures? If you plan to hold both signatures, then there is no point to upgrade to multisig and if you are going to give it to someone else, keep in mind that you rely on them, which is not safer option to my mind.Also, always keep in mind that increased security comes with increased responsibilities (I tell you in case if you really decide to increase your wallet's security).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "February 02, 2025, 08:17:42 PM",
      "body": "Quote from: Pterosphere on February 01, 2025, 09:49:41 AMif one starts out with a single signature cold wallet, and later, bitcoin rises a lot, or one acquires more bitcoin, or both, and it becomes more worth it to switch to multisig, what would be the best way to do that? Can anyone refer us to some good articles or tutorials on how we should go about that? thnxThe first reply has given a guide on different multi sig and between the two i will advice you go for the 2-of-3 multisig, my reason been that even without access to one of the keys the remaining two keys can be used to make transactions from the wallet. Another thing is multi sig is definitely more secure than single sig depending on how it is setup was done and how the wallet is protected, you can’t use the same device to actually set up multi sig walle, each co-signer should have a different device for the wallet to avoid a single point of failure if anything arises. So if the devices for the multi sig aren’t available just simply set up a single sig cold wallet and add passphrase to the wallet as secondary layer to it. This way the wallet is at least more secure than the normal single sig wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "February 03, 2025, 02:05:27 AM",
      "body": "Quote from: Pterosphere on February 01, 2025, 09:49:41 AMif one starts out with a single signature cold wallet, and later, bitcoin rises a lot, or one acquires more bitcoin, or both, and it becomes more worth it to switch to multisig, what would be the best way to do that? Can anyone refer us to some good articles or tutorials on how we should go about that? thnxWhen you use a multisig wallet, you will have to pay more satoshi for transaction fees later.If you consider it worths to pay extra transaction fee for better security of your Bitcoin wallet and Bitcoin fund, let's use a multisig wallet.Single signature wallet or multi signature (multisig) wallet, you must backup your wallet well. Well means you have usable backups for wallet recovery later, and it means during your backup procedure, you test your backup usability too.How to backup a seed phrase?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "February 03, 2025, 04:03:26 AM",
      "body": "You're better off just using a well protected cold storage if you're looking to store coins yourself. Multi-sig preferably requires each of the keys to be kept, and signed in isolation or the security would be equivalent to a normal cold storage. If you are not confident of doing either, consider using a hardware wallet. These are pretty simple to use and provides more security than most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}