{
  "id": "topic_5406915",
  "title": "soyfifi",
  "author": "soyfifi",
  "created_time": "July 19, 2022, 10:24:30 PM",
  "content": "Hello,I have problems to enter my account, it gives me an error: Incorrect login details. It's not just my account, all the accounts that have been created in my family. Nobody has access. Could it be by entering through the same internet line? The only thing I know is that we have invested in the accounts, in buying fun token. Now no one from my family accesses. Can you explain to me what is the reason? Does anyone know a support email to talk to freebitcoin? Can you help me. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406915",
  "comments": [
    {
      "author": "_act_",
      "created_time": "July 19, 2022, 10:30:00 PM",
      "body": "Freebitco is a faucet and a gambling site, why using it for investing? That is wrong. If what you are saying is true, you can ask the question here: https://bitcointalk.org/index.php?topic=320959.msg3436171#msg3436171If you want to invest, use a noncustodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 19, 2022, 10:47:14 PM",
      "body": "Quote from: _act_ on July 19, 2022, 10:30:00 PMFreebitco is a faucet and a gambling site, why using it for investing? That is wrong. He might be attracted to this Code:EARN INTEREST ON YOUR DEPOSITSDeposit BTC in your FreeBitco.in wallet and we'll give you 4.08% annual interest on your balance, compounded daily.It is on the first page of Freebitco.in and I think what they invest is the fun token and only use Freebitco.in because you can able to play there with that token or your case is the same as this one Freebitco.in Scam!!It would be better if you can discuss this in their thread and provide some proof. I can't even seem to find any terms from freebitco.in which we don't know the reason for accounts removal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 19, 2022, 11:54:29 PM",
      "body": "Quote from: soyfifi on July 19, 2022, 10:24:30 PMCould it be by entering through the same internet line? The only thing I know is that we have invested in the accounts, in buying fun token. Now no one from my family accesses. Can you explain to me what is the reason? It's very likely they detected your accounts as multiple accounts since you used the same line, and it's against their terms. This is what they say;I think all your accounts were deleted. Talk to support for clarificationQuote from: soyfifi on July 19, 2022, 10:24:30 PMDoes anyone know a support email to talk to freebitcoin? Can you help me. Thanks.Send a PM to him - https://bitcointalk.org/index.php?action=profile;u=143168",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 20, 2022, 12:43:24 AM",
      "body": "Quote from: soyfifi on July 19, 2022, 10:24:30 PMHello,I have problems to enter my account, it gives me an error: Incorrect login details. It's not just my account, all the accounts that have been created in my family. Nobody has access. Could it be by entering through the same internet line? The only thing I know is that we have invested in the accounts, in buying fun token. Now no one from my family accesses. Can you explain to me what is the reason? Does anyone know a support email to talk to freebitcoin? Can you help me. Thanks.Try to log in from a different IP address or try to create a new account also from different IP. I would say that all your accounts are most likely suspended. nobody believes in the story that your whole family claims free coins from this site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "July 20, 2022, 02:06:40 AM",
      "body": "Quote from: soyfifi on July 19, 2022, 10:24:30 PM~ Could it be by entering through the same internet line?I guess that's the main reason. They are pretty tough when it comes to cases like that. I remember they had some promotions that I couldn't join because of IP address issue.Quote from: soyfifi on July 19, 2022, 10:24:30 PMThe only thing I know is that we have invested in the accounts, in buying fun token. Now no one from my family accesses.Asking for a refund of tokens from all accounts is probably your only option here.Quote from: _act_ on July 19, 2022, 10:30:00 PMFreebitco is a faucet and a gambling site, why using it for investing? That is wrong. In addition to the interest on BTC that @BitMaxz said, buying FUN tokens and locking it on Freebitco.in gives you free spins daily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 20, 2022, 12:02:42 PM",
      "body": "It may be a false alarm from their security system but it is better that you clear the cookies, check you local time time, and restart your device, if it does not work, contact the support team and make sure that your country has no restrictions.You can solve the problem easily by using a clean VPN and browsing in private window mode, but you will expose yourself to problems in the future, so I advise you to contact the support team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 20, 2022, 12:28:01 PM",
      "body": "Quote from: Bitcoin_Arena on July 19, 2022, 11:54:29 PMIt's very likely they detected your accounts as multiple accounts since you used the same line, and it's against their terms. This is what they say;It's weird I can't even find these terms on their website I have an old account on them and tried to check every corner of their website but I can't find this term. I tried to log in today but my old password seems also does not work. So I decided to reset it and then I receive a different random password to log in and it works just fine. @soyfifi I think, try to reset it first before contacting them it might also work for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "July 20, 2022, 02:36:16 PM",
      "body": "Quote from: BitMaxz on July 20, 2022, 12:28:01 PMIt's weird I can't even find these terms on their website I have an old account on them and tried to check every corner of their website but I can't find this term.  I guess you're check bottom of the page isn't? since most of sites list their TOS on the bottom pages, but it's different with Freebitco since their TOS is under the login menu and you can view by logout from your account firstI think using of multiple accounts and want to maximize the profit by investing with Fun token can be categorized as cheating, so it's not surprised why they're close all of your accounts. I don't believe anything about such family stories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 20, 2022, 09:58:35 PM",
      "body": "Quote from: Apocollapse on July 20, 2022, 02:36:16 PMI guess you're check bottom of the page isn't? since most of sites list their TOS on the bottom pages, but it's different with Freebitco since their TOS is under the login menu and you can view by logout from your account firstyeah, their terms of service are a little hard to locate if you don't know and are already logged in. I had a hard time too locating them sometime back, but I made a suggestion about itWell, it was irrelevant according to their representative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 21, 2022, 07:38:25 AM",
      "body": "Quote from: soyfifi on July 19, 2022, 10:24:30 PMHello,I have problems to enter my account, it gives me an error: Incorrect login details. It's not just my account, all the accounts that have been created in my family. Nobody has access. Could it be by entering through the same internet line? The only thing I know is that we have invested in the accounts, in buying fun token. Now no one from my family accesses. Can you explain to me what is the reason? Does anyone know a support email to talk to freebitcoin? Can you help me. Thanks.Have you been able to log into your account again?contacting them via email or contacting via representatives on this forum will not help because their security system detects all the accounts as multi accounts and it violates their rules, family members are often used as an excuse to defend themselves, if you register all of these accounts on one of the referral links of the suspended account, this further proves the fraud they have detected, and making all of these accounts have FUN tokens is also a way to take advantage because if you are at level 1 which is 2,500 FUN will get 1 WoF every day and having 20 accounts will be more profitable because it will get 20 WoF compared to one account with the highest level that must have 500,000 FUN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "July 23, 2022, 04:17:14 PM",
      "body": "Quote from: JeromeTash on July 20, 2022, 09:58:35 PMQuote from: Apocollapse on July 20, 2022, 02:36:16 PMI guess you're check bottom of the page isn't? since most of sites list their TOS on the bottom pages, but it's different with Freebitco since their TOS is under the login menu and you can view by logout from your account firstyeah, their terms of service are a little hard to locate if you don't know and are already logged in. I had a hard time too locating them sometime back, but I made a suggestion about itWell, it was irrelevant according to their representative.Faucets like this are hard on multiple accounts so even if I don't read their terms of service I just knew that using multiple accounts is a big no and you can get yourself ban if you do this, people should have asked support or emailed them if they cannot see their TOS to verify if they don't allow the use of VPN or multi-account, so far I'm good using Freebitcoin it's my first faucet still using it after a year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 23, 2022, 08:52:36 PM",
      "body": "Quote from: Saisher on July 23, 2022, 04:17:14 PMpeople should have asked support or emailed themMaybe I am the blind one here, can you please help us locate a dedicated support button or email in their website. Only thing I know you need to be a bitcointalk member in order to be able to reach out to them through their thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "July 24, 2022, 08:49:38 AM",
      "body": "Quote from: JeromeTash on July 23, 2022, 08:52:36 PMMaybe I am the blind one here, can you please help us locate a dedicated support button or email in their website. Only thing I know you need to be a bitcointalk member in order to be able to reach out to them through their thread.It's not the easiest to locate either. The contact form is within their FAQ page and you need to be logged in for it to show up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judeafante",
      "created_time": "July 24, 2022, 11:01:16 PM",
      "body": "Quote from: Potato Chips on July 24, 2022, 08:49:38 AMQuote from: JeromeTash on July 23, 2022, 08:52:36 PMMaybe I am the blind one here, can you please help us locate a dedicated support button or email in their website. Only thing I know you need to be a bitcointalk member in order to be able to reach out to them through their thread.It's not the easiest to locate either. The contact form is within their FAQ page and you need to be logged in for it to show up.That's true you cannot see it if you are not a member it's not visible you have to click the more page to see the FAQ and from there you can click there's no URL for the FAQ page either, I wonder why they configure it that way it should be visible to avoid miscommunication and to fully understand how the site works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 31, 2022, 11:23:45 PM",
      "body": "It's pretty obvious you can't register more than one account through the same internet line or IP, because freebitcoin isn't solely a casino, investment platform or exchange, but a faucet which rewards free satoshis prizes hourly.The account limitation per household is a necessary measure to keep the site operational and sustainable, otherwise everyone could create dozen of accounts and justify they belong to their relatives...Sadly, this kind of traffic is one of the reasons why faucets have died or are so difficult and bureaucratic to be used nowadays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Killredillla",
      "created_time": "August 07, 2022, 11:46:32 AM",
      "body": "Quote from: soyfifi on July 19, 2022, 10:24:30 PMHello,I have problems to enter my account, it gives me an error: Incorrect login details. It's not just my account, all the accounts that have been created in my family. Nobody has access. Could it be by entering through the same internet line? The only thing I know is that we have invested in the accounts, in buying fun token. Now no one from my family accesses. Can you explain to me what is the reason? Does anyone know a support email to talk to freebitcoin? Can you help me. Thanks.They've probably closed your account and your Alts \"family members\" cough, accounts as well. its pretty clear that in their TOS they state that \"only one account per user,ip, household\" so you should've probably read it before.I'm surprised they even let you use the platform for a long time as this behaviours usually results in an instant ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "August 07, 2022, 09:02:16 PM",
      "body": "Quote from: uneng on July 31, 2022, 11:23:45 PMIt's pretty obvious you can't register more than one account through the same internet line or IP, because freebitcoin isn't solely a casino, investment platform or exchange, but a faucet which rewards free satoshis prizes hourly.The account limitation per household is a necessary measure to keep the site operational and sustainable, otherwise everyone could create dozen of accounts and justify they belong to their relatives...Sadly, this kind of traffic is one of the reasons why faucets have died or are so difficult and bureaucratic to be used nowadays.It's not forbidden to have more than one account (if nothing has changed) as long as you're not abusing faucet, self referring and abuse their website in other ways. But offcourse, if you will get caught abusing website with multiple accounts, all your accounts will be banned.Quote from: Potato Chips on July 24, 2022, 08:49:38 AMIt's not the easiest to locate either. The contact form is within their FAQ page and you need to be logged in for it to show up.Good point about contact form, it's not that easy to find. And considering that who need to access it often don't have access to their accounts. They also have email support@freebitco.in, but I don't see it listed somewhere on their website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trainingranplan",
      "created_time": "March 09, 2023, 11:26:59 AM",
      "body": "Hello In fact I faced such issue where typo error in signup accounts (I wrote @Gmail.cm without \"o\") and I sent PM to TheQuin, then directly I got his support and fixed this issue. while I supposed its not possible to recover this account especially I made credit around 0.046.thanks for Mr. TheQuin for his credibility @BRQuote from: soyfifi on July 19, 2022, 10:24:30 PMHello,I have problems to enter my account, it gives me an error: Incorrect login details. It's not just my account, all the accounts that have been created in my family. Nobody has access. Could it be by entering through the same internet line? The only thing I know is that we have invested in the accounts, in buying fun token. Now no one from my family accesses. Can you explain to me what is the reason? Does anyone know a support email to talk to freebitcoin? Can you help me. Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "March 09, 2023, 07:37:11 PM",
      "body": "Quote from: Trainingranplan on March 09, 2023, 11:26:59 AMHello In fact I faced such issue where typo error in signup accounts (I wrote @Gmail.cm without \"o\") and I sent PM to TheQuin, then directly I got his support and fixed this issue. while I supposed its not possible to recover this account especially I made credit around 0.046.thanks for Mr. TheQuin for his credibility @It is good that your problem has been fixed. Yes, if you write the email correctly, you will be able to log in or register for Freebitcoin. I have been working on this site for years, and frankly, my experience with it is not good. I have personally convinced that it is a waste of time or a systematic scam. You POLL the faucet every hour and you get 0.00000050BTC and it never happened before that I got a lucky number that has a good payout, in addition, the betting game to multiply your bitcoins is very complicated and may make you lose everything you have, so try with a small amount that you can lose instead of 0.046BTC, just a piece of advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}