{
  "id": "topic_5411073",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "August 24, 2022, 05:30:26 PM",
  "content": "I am becoming increasing concerned with the extent some employees with gambling addiction go to satisfy their addiction. That is, some of these employees go as far as defrauding, and stealing from their employers and go ahead to gamble with the money. Some time ago, a close buddy of mine narrated how he caught his colleague adjusting the sales records after removing some cash. After he confronted him, the colleague confessed that he usually use the money for betting. Below are several similar cases.1- UK Addict Stole from JD Sports to Gamble on CryptoQuoteA gambling addict from the United Kingdom stole his company’s money to wager on cryptocurrencies. However, his employers eventually learned of his schemes.Mahmood Stole over $33,000 Siraj Mahmood used to work at a JD Sports retail in Manchester. His job was to help unsatisfied customers who had issues with the company’s products or wanted a refund. It seems that Mahmood’s salary wasn’t sufficient to cover his gambling expenses, causing him to instead steal from the company.2- Gambling Addict Goes to Jail for Stealing Company MoneyQuoteSwindling company money would cost you jail time – that was the message Deputy Circuit Judge Neil Bidder QC sent out when he sentenced a financial director who stole over £800,000 to satisfy gambling addiction. Lauren Farr, 34, of Spring Grove, Cwmbran, Monmouthshire, was sentenced to 32 months in prison after admitting to defrauding company We Fight Any Claim out of £825,751.60 between March 2016 and October 2019, while working at the firm as a senior executive. The mother-of-two who had started at the company as a junior admin and worked her way up to the earning £70,000 per year financial director position, gambled around £1.5 million online, through operators such as Paddy Power and Betfred, police financial investigators who looked into her finances uncovered.3 - Addict Fueled Gambling by Scamming an Elderly ManQuoteA nefarious gambling addict by the name of Brian James Wilson scammed an elderly man and took all of his savings. He lied that he was about to invest the money in groundbreaking projects but, in fact, used it to fuel his gambling addiction. Wilson Took Almost $2M from His Victim Wilson first met his victim in 2018. Back then, the 82-year-old man was selling his mortgage-free Mount Martha home for $1.6 million. Once the sale was complete, Wilson helped the man move to a retirement village. A few months later, the scam began.I'd like to know your thoughts -  Do you think that employers should screen potential employees for problem gambling before employment?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411073",
  "comments": [
    {
      "author": "BITCOIN4X",
      "created_time": "August 24, 2022, 05:38:07 PM",
      "body": "I've applied for several jobs so far at different places and no one has asked me if I like gambling or anything like that. I only got questions about what my hobbies are and what I can do as other skills, it makes a lot more sense to me than anything else.A trick question is what's bad about you, it's a gray question to tell them about all our bad behavior so far. So basically they don't ask if we gamble or not, but every company wants employees who are honest and well behaved both outside and in the workplace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 24, 2022, 05:47:12 PM",
      "body": "One big question, HOW?Most of the people who are gambling, especially gambling online really make their activity is private. Makes nobody, even their closer friend don't know do a gambling and someone who got addiction always keep their problem secret until there has some problem of their financial (Got some debts).I think some company have taken \"Credits score\" on their jobs requirement, I know that's a requirement is not focused for gambling addiction person. But, is for targeting person who have a bad score kredits before they can work on their company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 24, 2022, 05:49:12 PM",
      "body": "Quote from: Davidvictorson on August 24, 2022, 05:30:26 PMI'd like to know your thoughts -  Do you think that employers should screen potential employees for problem gambling before employment?It is difficulty to know gambling addicts? I was an addict before, no member of my family knew for over 5 years until I gambled with the money I supposed not to gamble with. The employers can not know. The best is for the employers to take care of their business by making sure that no employee steal their money, gambling addicts are difficulty to know, if they want you not to know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "August 24, 2022, 05:52:01 PM",
      "body": "I feel like this is too much and its against basic human rights. You may think I am exaggerating this but think about this: People's hobbies are their private life outside working life. If you don't mix each other and mess your life you should be freely do anything you want. And all these so called scammer gamblers are scammers at first, gamblers at second. Being gambler doesn't automatically turn you into scammer/fraud. It is about personality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 24, 2022, 06:00:03 PM",
      "body": "Quote from: Pierre 2 on August 24, 2022, 05:52:01 PMI feel like this is too much and its against basic human rights. You may think I am exaggerating this but think about this: People's hobbies are their private life outside working life. If you don't mix each other and mess your life you should be freely do anything you want. And all these so called scammer gamblers are scammers at first, gamblers at second. Being gambler doesn't automatically turn you into scammer/fraud. It is about personality.You are right, but what if anything like that is indirectly asked during interview, but I expect addicts to know the right thing to say which would be in a way that they are not gambling at all. There are few questions that may be asked which the employers may see  necessary for not to accept any interviewee that failed it. But it would be weird if employers are looking towards that direction, but anything can happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 24, 2022, 06:37:24 PM",
      "body": "Quote from: Davidvictorson on August 24, 2022, 05:30:26 PMI'd like to know your thoughts -  Do you think that employers should screen potential employees for problem gambling before employment?I think it is very important that you take that assessment of a potential employee before he/she is given a job, the motive should not be  to completely penalize him/her but to understand if they are suitable for the position especially if it is a position regarding management of finance. People with gambling problems can be suitable for other positions that don't involve money, but never positions that involve money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "August 24, 2022, 06:51:03 PM",
      "body": "Quote from: BITCOIN4X on August 24, 2022, 05:38:07 PMI've applied for several jobs so far at different places and no one has asked me if I like gambling or anything like that. I only got questions about what my hobbies are and what I can do as other skills, it makes a lot more sense to me than anything else.A trick question is what's bad about you, it's a gray question to tell them about all our bad behavior so far. So basically they don't ask if we gamble or not, but every company wants employees who are honest and well behaved both outside and in the workplace.Same here, I've been through lots of interviews in the past years but I never came across some questions related to gambling or if I'm into any of these activities. There may be companies who will ask that upon the interview but I think that just rarely happen because the company is thinking that it is not any of their business as long as the employee if they passed the interview will uphold and do their jobs/tasks that was given to them in like a daily basis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "August 24, 2022, 07:14:40 PM",
      "body": "I don't like that idea. It's a clear violation of our privacy. It's unethical for me to ask that question to their applicants and used that as basis if they will accept that person or not. What if that person properly passed the initial interview that leads them to be qualify at the final interview.If that question is being asked, these employers are already judging the book by its cover.Refer to their performance later on, if they are not doing their properly their work, then take an action.That's the reason there's a probation period for around 3-5 months at most, before upgrading the employee into regular status.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "August 24, 2022, 07:16:59 PM",
      "body": "Quote from: Davidvictorson on August 24, 2022, 05:30:26 PMI am becoming increasing concerned with the extent some employees with gambling addiction go to satisfy their addiction. That is, some of these employees go as far as defrauding, and stealing from their employers and go ahead to gamble with the money. Some time ago, a close buddy of mine narrated how he caught his colleague adjusting the sales records after removing some cash. After he confronted him, the colleague confessed that he usually use the money for betting. Below are several similar cases.QuoteA gambling addict from the United Kingdom stole his company’s money to wager on cryptocurrencies. However, his employers eventually learned of his schemes.Mahmood Stole over $33,000 Siraj Mahmood used to work at a JD Sports retail in Manchester. His job was to help unsatisfied customers who had issues with the company’s products or wanted a refund. It seems that Mahmood’s salary wasn’t sufficient to cover his gambling expenses, causing him to instead steal from the company.QuoteSwindling company money would cost you jail time – that was the message Deputy Circuit Judge Neil Bidder QC sent out when he sentenced a financial director who stole over £800,000 to satisfy gambling addiction. Lauren Farr, 34, of Spring Grove, Cwmbran, Monmouthshire, was sentenced to 32 months in prison after admitting to defrauding company We Fight Any Claim out of £825,751.60 between March 2016 and October 2019, while working at the firm as a senior executive. The mother-of-two who had started at the company as a junior admin and worked her way up to the earning £70,000 per year financial director position, gambled around £1.5 million online, through operators such as Paddy Power and Betfred, police financial investigators who looked into her finances uncovered.QuoteA nefarious gambling addict by the name of Brian James Wilson scammed an elderly man and took all of his savings. He lied that he was about to invest the money in groundbreaking projects but, in fact, used it to fuel his gambling addiction. Wilson Took Almost $2M from His Victim Wilson first met his victim in 2018. Back then, the 82-year-old man was selling his mortgage-free Mount Martha home for $1.6 million. Once the sale was complete, Wilson helped the man move to a retirement village. A few months later, the scam began.I'd like to know your thoughts -  Do you think that employers should screen potential employees for problem gambling before employment?It's extremely dependent on the job type on whether they should have access to this sort of sensitive information or require a declaration from the employee. In certain scenarios like finance it can be important to weed out people who have these sort of problems, because they could potentially have access to vast sums of money and if they cannot control their own finances, they should not be allowed access to many other peoples. There are other jobs as well, like working for the security services in sensitive roles, that could make someone vulnerable to foreign powers if they are known to have a gambling addiction. This sort of vetting is usually declared up front and like with finance roles is required by law or insurance necessity, so if someone is not comfortable with it then they simply have to find a position that does not do such checks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "August 24, 2022, 07:37:12 PM",
      "body": "Quote from: Botnake on August 24, 2022, 06:51:03 PMQuote from: BITCOIN4X on August 24, 2022, 05:38:07 PMI've applied for several jobs so far at different places and no one has asked me if I like gambling or anything like that. I only got questions about what my hobbies are and what I can do as other skills, it makes a lot more sense to me than anything else.A trick question is what's bad about you, it's a gray question to tell them about all our bad behavior so far. So basically they don't ask if we gamble or not, but every company wants employees who are honest and well behaved both outside and in the workplace.Same here, I've been through lots of interviews in the past years but I never came across some questions related to gambling or if I'm into any of these activities. There may be companies who will ask that upon the interview but I think that just rarely happen because the company is thinking that it is not any of their business as long as the employee if they passed the interview will uphold and do their jobs/tasks that was given to them in like a daily basis.Its odd or something that you cant really hear from an interview but since we havent tested out on applying on a finance based or firm type of company then there might be those kind of questions but its not really something that we could really say that this is something needed for it to be asked on any applicant since this is a personal matter.Stick with those important details or information rather than on focusing on this onewhen it comes to screening but since they are the ones who do run off the business then its their right or have the full authority nor have the choice whether they would be asking it out or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "August 24, 2022, 08:02:02 PM",
      "body": "Employers are mostly looking for good credentials. They won't surely bother with our activities in our personal life as long as they see us suitable and fit on the work we are applying for. Even for let's say that question will be asked, I think there's an employee who will admit they have a gambling problem.Companies should be opened at all. In the interview, they can tell already if that employee is worth to hire. If some shit happened involving that employee after being hired, then that's time to consider putting that person into watchlist as companies can't just fired their employee even if they want to as part of the Labor Act depending on per country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "August 24, 2022, 08:19:21 PM",
      "body": "Quote from: Davidvictorson on August 24, 2022, 05:30:26 PM -skip-I'd like to know your thoughts -  Do you think that employers should screen potential employees for problem gambling before employment?What percentage of problems is associated with an employee's gambling addiction? I don't think it's so common that a separate screening for this parameter is required. In addition, in various jurisdictions, this can have negative consequences for the employer, since such an interest in the employee's private life may be perceived as illegal. And in jurisdictions where gambling addiction is considered a disease, it will also be an attempt to violate medical confidentiality, right? After all, if an employee has passed a medical examination and has all the necessary permits (including from a psychiatrist), then the employer should not independently dig into these cases for the details of interest to him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "August 24, 2022, 08:48:05 PM",
      "body": "Private companies didn’t care that much about the personal interest of the applicant as long as its qualified for the position, I think only banks and government agencies are strict with regards to this. Gambling addiction can happen once you already hired since you have now the money to support your addiction which probably can affect your job if left unattended. There’s actually no way for the employer to know if you are a gambling addict, especially if you are just doing it online and in crypto gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "August 24, 2022, 08:52:10 PM",
      "body": "Quote from: Johnyz on August 24, 2022, 08:48:05 PMPrivate companies didn’t care that much about the personal interest of the applicant as long as its qualified for the position, I think only banks and government agencies are strict with regards to this. Gambling addiction can happen once you already hired since you have now the money to support your addiction which probably can affect your job if left unattended. There’s actually no way for the employer to know if you are a gambling addict, especially if you are just doing it online and in crypto gambling.Anyone could really deny if they do see that they had been testing out or trying out to be screened on whats your personal interest.It might really be that crossing the line but since you are applying for a job then you wont really be having any choice but to answer but you arent that dumb on not to notice on what they are trying to avoid specially when we do talk about Gambling addiction then you would be surely trying out tocover up yourself or trying out to deny that you are an addicted person since you know that it would really be decreasing out the chance or odds on getting hired once they do know that you are an addicted one.So far i havent experience this kind of question of all the screenings and interviews that i had encountered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "August 24, 2022, 08:58:35 PM",
      "body": "Should employers screen employees for gambling problems before hiring them?The fact that people ask questions like that shows how incorrigible and corrupt our ideas of employment are. Why should anyone get to pry into someone's life like that?What's next, do employers get a list of my medical history and my bank statements for the last 10 years?I think employers should not be given such rights. It's in human nature to make mistakes. We should not be penalized by random strangers in the future for them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "August 24, 2022, 09:09:28 PM",
      "body": "If that employee work in accounting matter and will hand the money for the company that can be asked but of course the applicant will not disclose it because for sure he wants to stay private and if he is already addict in gambling, maybe he is just trying to find a job so he can start working away from gambling and change his lifestyle. We should not judge them and instead if you see someone getting into gambling, educate them about the possible risk especially on losing the job if he get caught. Gambling is a private matter, though companies have their own rules so if its not allowed in the company better to stop it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 24, 2022, 09:11:49 PM",
      "body": "This is a nice question but for people that only play with crypto and are patient enough to only play at home at their own comfy environment and with their home IP and not with the IP in work this can easily be bypassed by any gambler who want to apply for a job and don't like to let their boss know that he likes to gamble.That is as easy as this.If you are addicted and you can't resist the urge of gambling no matter where you are and you also gamble at work chances are high that your boss will find out eventually and you will be kicked out and fired from the position or job you are covering.Unfortunately there is no middle way,there is either the option to be happy to just gamble at home or the other one which you are addicted and keep playing whenever you are and whenever you have the possibility to do so.The employer though has no right to screen or further investigate people what hobbies they have in their private life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "August 24, 2022, 09:24:39 PM",
      "body": "Quote from: Davidvictorson on August 24, 2022, 05:30:26 PM~snip~I'd like to know your thoughts -  Do you think that employers should screen potential employees for problem gambling before employment?^ If related to finance or in accounting, it should be trusted and there is no negative background but I think this will earn a reputation by the time it is not quickly hired. When we talk about money even though not a gambling addict possible theft because people do crimes for money when they need it most so potentially even not a gambling addict can steal money from their company, we have a greedy attitude when it comes to money.So screening would be good also to know your employee before you hired them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "August 24, 2022, 09:26:45 PM",
      "body": "I'm not sure about it though, I mean when we apply there are some psychological test that you need to passed. So maybe there could be some signs already there that could alarm the employer already not to hire the individual. But there could be someone that can't be caught initially before it's too late. So it's going to be extremely difficult really, even if they would screen applicants rigorously, it's not a sure fire formula to caught this gamblers. And yeah, your addiction could start right after you are hired by the company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}