{
  "id": "topic_5462049",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "August 04, 2023, 10:33:39 AM",
  "content": "Об чем вообще эта тема? Ну, запилили бабы спектакль (про што? Увы, не знаю...) какие-то там девки. Решили зачем-то (в этой стране) поднять бабла. Что удивительно – именно В ЭТОЙ стране. А их обломали. И посадили. За дело или нет – пусть теперь решит суд. Самый справедливый, однако, почему-то не пепрецедентный. То есть, не выносящий вердикты не основе прошлых прецедентов. А вот рассматривающий каждый конкретный случай в индивидуальном порядке. О чем это говорит? А только об том, что для одних людей ЗАКОН – он один, а вот для других людей – закон он совсем другой. Но лично мне на это все пофиг. Но они, бабы-дуры – решили РИСКНУТЬ именно в ЭТОЙ стране. И прогадали. Не срослось. Не получилось. НЕ вышло. Спектакль заблокировали. Дык. А вы что хотели? Чтобы вас поддержали и вам дали бабла и госконтрактов и дополнительно еще  овербабла?   Это не всегда так работает. Ну, то есть работает, только в случае мелких, копеечных контрактов, либо не в «этой стране», либо если вы есть «Чертов Гений». Во всех остальных случаях, система, как обычно, работает только на откатах. Дал откат – получил контракт. Не дал откат – получил геморрой. Только так, и никак иначе. Знаю из личного многолетнего опыта работы с госконтрактами.   Зх, бабы-бабы... ну что вам не  сиделось на завалинке и не лузгалось вам семечков? Пошто решили вы воспрыгнуть выше своих бабьих возможностей? Ведь еще давным-давно было свыше определено, что суть женская – это Кухня, Ребенок и Церковь (KKK), а не спектакли в театрах. Как говорится  - тут мои полномочия - ВСЕ. Тут я вам уже ничем помочь не могу. Да и не хочу, если честно. Вы рискнули – и вы конкретно обосрались и прогадали. И будете за это наказаны системой. Увы...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462049",
  "comments": [
    {
      "author": "nakitalk",
      "created_time": "October 14, 2023, 07:30:20 AM",
      "body": "Ну друг, есть здоровый феминизм без шизы, а есть шиза - что объясняется просто модой на это и не несет никакой смысловой нагрузки. Норм фемки борятся за права и 2/3 реально вещи говорят.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}