{
  "id": "topic_5407825",
  "title": "Gerceklerisoyleyen",
  "author": "Gerceklerisoyleyen",
  "created_time": "July 27, 2022, 02:31:09 PM",
  "content": "Dikkat çeken nokta bakan nebati koltugunda oturup rahat tavırlar sergilerken CZ nin ayakta dikilmesi gözlerden kaçmadı.https://twitter.com/NureddinNebati/status/1552245925854281730",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407825",
  "comments": [
    {
      "author": "Gencecikmen",
      "created_time": "July 27, 2022, 03:56:00 PM",
      "body": "Normal bir ülke de böyle bir toplantı kripto dünyası için olumlu bir işaret olabilir. Ama toplantı bizim ülke de olunca ve gözleri parlayan bir ekonomi bakanımız olduğu için acaba binance hesabımı kapatsam mı sorusunu içten içe bana düşündürtmüştür. Umarım kripto ile uğraşan insanları üzecek bir şey çıkmaz altından.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "July 27, 2022, 04:18:00 PM",
      "body": "Binance tr üzerinden bir muhabbet gerçekleşmiştir. neden bize vergiyi az veriyorsunuz bakın gözümü kapatıyorum 6 ay sonra daha farklı bir binance hayal ediyorum. keşke gözümüzü kapatsak, 6 ay öteye gitsek diye bir açıklama yapıp kandırmaya çalışmıştır czyi. ama cz yer mi anadolu çocuğu ataları orta asyalı bir kere akıllı adam atlatır bir şekilde",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "July 27, 2022, 08:31:12 PM",
      "body": "Bu adamın doktora tezini bu forumda gördükten sonra isterse direkt dünya ekonomi başkanı ile temas kursun benim için hiç bir anlam taşımıyor.Doktorluk hediye edilen adamın Bitcoin nedir sorusuna cevabı herhalde alakasız olur.Ben Blockchain ile konuştuğu hiç bir şeyi tam olarak anladığını da düşünmüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "July 27, 2022, 08:50:03 PM",
      "body": "Toplantıda konuşulanlar hakkında açıklama yapılmamış, düzenlemeler hakkında görüştüler büyük ihtimalle ve kripto paraları yurt içinde tutmak için neler yapabilir diye konuştuklarını düşünüyorum çünkü millet kripto paralar ile kolaylıkla ülkeyi terk ediyor/edebilir, kesin milleti sıkıntıya sokacak şeyler konuştular, bu adam başka bir şey konuşmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "July 28, 2022, 12:59:27 AM",
      "body": "Quote from: MK-74 on July 27, 2022, 08:50:03 PMToplantıda konuşulanlar hakkında açıklama yapılmamış, düzenlemeler hakkında görüştüler büyük ihtimalle ve kripto paraları yurt içinde tutmak için neler yapabilir diye konuştuklarını düşünüyorum çünkü millet kripto paralar ile kolaylıkla ülkeyi terk ediyor/edebilir, kesin milleti sıkıntıya sokacak şeyler konuştular, bu adam başka bir şey konuşmaz.Enflasyonu veya kriptoparaları günlük hayata nasıl ekleriz demeyeceğine göre ya czden yatırım tavsiyesi aldı ya da nasıl Türkiye’de vergi alabileceğinden, borsaların işleyişlerinden falan bahsetmiştir daha fazlasını beklemek mantık sınırları dışında olur. Yurt içindeki paranın Binance girmesini engellemek istemiştir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "July 28, 2022, 05:42:58 AM",
      "body": "CZ'nin anlattıklarını anlayabilecek bir kapasitelerinin olduğunu sanmıyorum. Bu zihniyetle hiç bir şey yapılmaz, benim düşüncem buralardan nasıl daha çok vergilendirmez yaparız konusunda görüşme sağlanmış olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "July 28, 2022, 06:36:12 AM",
      "body": "Ben de kriptoparalarda nasıl vergi düzenlemeleri yapılabileceğini konuştuklarını tahmin ediyorum muhtemelen Binance bizim devletle iyi anlaşarak buradan çok kar edeceğini düşünüyor ama ben güvenilir bulmuyorum eğer vergiyle ilgili bir düzenleme geçerse paramı ledger a ve farklı exchange lere atmayı düşünüyorum ama şimdilik kaygı duyacak çok bir durum yok. İleride değerlendiririz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "August 01, 2022, 08:27:34 AM",
      "body": "Binance’in sistem içerisinde çok büyük bir payı ve kârı var. Türkiye de kriptoda hatırı sayılır kullanıcı kitlesine sahip. Bu durumda buradan gelecek olan paranın veya verginin ne derseniz ön hazılığı konuşulmuş olabilir bence. İnsanları kriptoya küstürmeden oluşturulacak bir vergi sisteminin üzerinde çalışılması gerektiğini düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "August 01, 2022, 09:12:07 AM",
      "body": "Bence bu toplantı nedeniyle şöyle bir açıklama yaptı CZ: https://twitter.com/cz_binance/status/1553749538590138371\"Etkileşimlerimizden bazı ülkeler ayrılmış bir sipariş defteri (likidite) istiyor. Bu, birkaç nedenden dolayı KÖTÜ bir FİKİRDİR.\"Binance'in ışıl ışıl nebatiyi dinleyeceğini sanmıyorum. Görüşmeleri bile lütuf olmuş ve toplantı sonrasında cz yanındakilere 'lan ne adamlar ülke yönetiyor ya' gibi bir şey demediyse ben bir şey bilmiyorum. En büyük 20 ekonomiden biriyken yeni düşmüş bir ülkeyi böyle adamların yönettiğine şaşırmıştır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "August 01, 2022, 09:20:29 AM",
      "body": "Quote from: püsür on August 01, 2022, 09:12:07 AMBence bu toplantı nedeniyle şöyle bir açıklama yaptı CZ: https://twitter.com/cz_binance/status/1553749538590138371\"Etkileşimlerimizden bazı ülkeler ayrılmış bir sipariş defteri (likidite) istiyor. Bu, birkaç nedenden dolayı KÖTÜ bir FİKİRDİR.\"Binance'in ışıl ışıl nebatiyi dinleyeceğini sanmıyorum. Görüşmeleri bile lütuf olmuş ve toplantı sonrasında cz yanındakilere 'lan ne adamlar ülke yönetiyor ya' gibi bir şey demediyse ben bir şey bilmiyorum. En büyük 20 ekonomiden biriyken yeni düşmüş bir ülkeyi böyle adamların yönettiğine şaşırmıştır.Demek istediği sanırım şöyle madem bizim kullanıcıları kullanıyorsun ozaman türkiyede banka hesabında o oranda tl tutmak zorundasın. İş inada binerse tutacak tutmayacan yasaklayabilirler binanceyi. Çünki CZ gibi adamlar gidipte TL almaz. TL alacak birde onu bankada tutacak  durdugu yerde - yazar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 01, 2022, 10:54:03 AMLast edit: August 01, 2022, 08:40:12 PM by Gencecikmen",
      "body": "Quote from: Gencecikmen on July 27, 2022, 03:56:00 PMNormal bir ülke de böyle bir toplantı kripto dünyası için olumlu bir işaret olabilir. Ama toplantı bizim ülke de olunca ve gözleri parlayan bir ekonomi bakanımız olduğu için acaba binance hesabımı kapatsam mı sorusunu içten içe bana düşündürtmüştür. Umarım kripto ile uğraşan insanları üzecek bir şey çıkmaz altından.Bu toplantı üzerine kıllanmıştım. CZ tarafından atılan tweetlere bakılırsa kıllanmakta haklı imişim. Kaynak: https://twitter.com/cz_binance/status/1553749538590138371?t=WEUs1YcIaO_GIUVaWfO49Q&s=19Tweette kısaca Zhao abimiz:\"Bazı ülkeler kendileri için ayrıcalıklı bir likidite kanalı istiyor\" demiş. Zhao abimizde tweetlerde bunun neden olmayacağını anlatmış.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "August 01, 2022, 08:34:30 PM",
      "body": "Quote from: Gencecikmen on August 01, 2022, 10:54:03 AMQuote from: Gencecikmen on July 27, 2022, 03:56:00 PMNormal bir ülke de böyle bir toplantı kripto dünyası için olumlu bir işaret olabilir. Ama toplantı bizim ülke de olunca ve gözleri parlayan bir ekonomi bakanımız olduğu için acaba binance hesabımı kapatsam mı sorusunu içten içe bana düşündürtmüştür. Umarım kripto ile uğraşan insanları üzecek bir şey çıkmaz altından.Bu toplantı üzerine kullanmıştım. CZ tarafından atılan tweetlere bakılırsa kıllanmakta haklı imişim. Kaynak: https://twitter.com/cz_binance/status/1553749538590138371?t=WEUs1YcIaO_GIUVaWfO49Q&s=19Tweette kısaca Zhao abimiz:\"Bazı ülkeler kendileri için ayrıcalıklı bir likidite kanalı istiyor\" demiş. Zhao abimizde tweetlerde bunun neden olmayacağını anlatmış.Birşeyler istendiği az çok belliydi de ben CZ’den böyle bir ricada bulunabileceklerini düşünmemiştim, gerçi kendisi de isim vermemiş sadece bazı ülkeler demekle yetinmiş belki de Türkiye’de böyle bir istek olmadı, CZ’de gereken cevabı güzelce vermiş, böyle bir kayırmacılık olamazdı zaten bunun beklenilmesi de doğru değil,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}