{
  "id": "topic_5468416",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "September 28, 2023, 11:51:43 AM",
  "content": "Sam Bankman-Fried, the mop-haired, nerdy maths genius who set out to transform the world of crypto but ended up being its biggest loser, is facing the prospect of a lengthy prison sentence. On the eve of his trial for fraud and money laundering in New York, this programme reveals the breakneck rise and sensational fall of his $40 billion company, FTX, which he had boasted would take crypto into the mainstream but crashed, leaving more than a million customers with nothing. Through detailed research and interviews with his former associates, staffers and insiders, the film examines the numerous red flags that were overlooked, including how his scruffy image, celebrity hype and promises to give billions away to charity, blinded the world to alleged crimes that have plunged crypto into crisishttps://www.bbc.co.uk/iplayer/episode/p0gffn3y/panorama-downfall-of-the-crypto-king-extended-version",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468416",
  "comments": [
    {
      "author": "Jating",
      "created_time": "September 28, 2023, 12:57:00 PM",
      "body": "I'm not really sure if BBC has covered things that we didn't know already. It must be good for newbies in investment though so they can see how this scammers really work behind. They can disguised like what SBF is, and then getting a lot of friends, sport personalities, Hollywood actors/actresses and how his background get himself to some major politicians to really bring himself to be the saviour and give supposedly billions to charities and make a lot of humanitarian works that his company or the money that he will get. But it all failed as everything crumbled last year causing billions upon billions of money lost from the downfall of SBF. I wouldn't watch it though to be honest, I'm not a victim but I don't want to see him being glorified in some kind of documentary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "September 28, 2023, 02:01:04 PM",
      "body": "I hope this is good and educational because we are in need of such documentaries where everything is there for the newbies to understand the concept of how to prevent themselves from falling into such same ordeal. Just as the other scam projects where the owners are friendly and always keep their community updated with what is going on with the projects whether in Telegram or Twitter. I think this documentary will help them realize not to easily get hyped whenever there is a new trend in the crypto industry in terms of new investment and they are going to make sure that whenever they decide to invest, they have already gone through lots of personal research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "September 28, 2023, 02:39:32 PM",
      "body": "Is he the biggest loser? Because with the right lawyers and influence, he might end up not going to jail or just getting a minimal sentence. Either way, the documentary is a good thing. That's if it's very detailed and touches every dirty secret that led us to things point. People need to realize that not all fraudulent people sit behind a screen and try to scam others for money, some put on suits and come in the form of people who want to change the world. I hope SBF gets what he deserves not just because of the harm people like him cause, but it should be as a lesson to others that you can't just fraud people of their money and walk away freely. Also, other financial company managers should know the risks involved before they make careless decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 28, 2023, 05:38:28 PM",
      "body": "Quote from: Jating on September 28, 2023, 12:57:00 PMI'm not really sure if BBC has covered things that we didn't know already. It must be good for newbies in investment though so they can see how this scammers really work behind. They can disguised like what SBF is, and then getting a lot of friends, sport personalities, Hollywood actors/actresses and how his background get himself to some major politicians to really bring himself to be the saviour and give supposedly billions to charities and make a lot of humanitarian works that his company or the money that he will get. But it all failed as everything crumbled last year causing billions upon billions of money lost from the downfall of SBF. I wouldn't watch it though to be honest, I'm not a victim but I don't want to see him being glorified in some kind of documentary.Often when i am watching anything crypto related from mainstream media i have second-hand embarrassment as all they want is a scoop and a villain. Then they need to quickly to learn the lingo, and try to explain something they have no experience with, like they know what they are talking about. And watching that makes me nauseous. I am afraid this will be one of those, but i watch it as it's from bbc and that usually means quality. So thanks for the link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 28, 2023, 08:14:53 PM",
      "body": "BBC should just release these docus whenever there's something off and a red flag that they've noticed for one specific personality and the service that it has been working with. Quote from: Alpha Marine on September 28, 2023, 02:39:32 PMIs he the biggest loser? Because with the right lawyers and influence, he might end up not going to jail or just getting a minimal sentence. We've seen that he's been with the powerful ones and he seems to be untouchable because of the influence and friends that he's got. Thanks to the donation that he has made from the money of the FTX customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "September 28, 2023, 08:24:37 PM",
      "body": "Quote from: yazher on September 28, 2023, 02:01:04 PMI hope this is good and educational because we are in need of such documentaries where everything is there for the newbies to understand the concept of how to prevent themselves from falling into such same ordeal. Just as the other scam projects where the owners are friendly and always keep their community updated with what is going on with the projects whether in Telegram or Twitter. I think this documentary will help them realize not to easily get hyped whenever there is a new trend in the crypto industry in terms of new investment and they are going to make sure that whenever they decide to invest, they have already gone through lots of personal research.Or this documentary should be well research and they should interview people involved or even close to it so that we will see the glimpse the world of SBF, specially the influence he had to other people that we think he is going to be the next Elon Musk as far as wealth goes. Unfortunately, it was all just a facade, a make believed world and hopefully if someone watch the documentary, they will learn a thing or do about investing and what is hype and if there are red flags then they should avoid it at any cost. And it's good if someone has seen the documentary to give us what its all about and perhaps if we nail some details here. Hopefully the OP can come back here and watch the show itself. And maybe the biggest question is, will SBF be sentenced for a long time? Like Faruk Fatih Özer, who is the founder of Thodex.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "September 28, 2023, 10:44:24 PM",
      "body": "Quote from: Alpha Marine on September 28, 2023, 02:39:32 PM-snip-Let me guess.Pay some fee, and then the sentence around 5-8 years ended up he still own a lot money maybe on his family and other. It's always like that for the fraud-case, we know the end very welll.I'm pretty sure, with 8 years sentence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 28, 2023, 10:57:46 PM",
      "body": "I know a BBC documentaries was coming. It took a while but good thing it's here. Although the documentary will be mostly be a refresher for us, the interviews will do justice to it. I will take a look at it and report back with my feedback . ^^Quote from: blockman on September 28, 2023, 08:14:53 PMBBC should just release these docus whenever there's something off and a red flag that they've noticed for one specific personality and the service that it has been working with. The fact that BBC is not a crypto-native media will make it harder for them to do documentaries before the incident (if any) that's why they do post-mortems. I doubt that they even have crypto focused researchers or engineer that will aid them in that regard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 29, 2023, 08:26:43 PM",
      "body": "Quote from: nelson4lov on September 28, 2023, 10:57:46 PMQuote from: blockman on September 28, 2023, 08:14:53 PMBBC should just release these docus whenever there's something off and a red flag that they've noticed for one specific personality and the service that it has been working with. The fact that BBC is not a crypto-native media will make it harder for them to do documentaries before the incident (if any) that's why they do post-mortems. I doubt that they even have crypto focused researchers or engineer that will aid them in that regard.Who knows but if they've started this one. I think that's the initiative from them and they are seeing that there's a lot of audience for them if the topic or docu is all about cryptocurrencies. While with these controversies, it's not really all about dealing the crypto community but all about these cons like SBF that they're covering.But maybe, this could give them the idea that they should start to investigate and get to know more into the crypto market to know more if anomalies like this are existing before they popped out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 29, 2023, 10:04:02 PM",
      "body": "I hope they don't twist facts about SBF and make SBF look like the victim of consequences.  I would like to see in this document the expose' of SBF's lies about him being the boy genius and the conspiracy theory behind it.  Also how SBF cheated their customer by misappropriation of funds draining FTX funds and transfering them to their created ALMEDA company and how SBF use the funds of FTX to make himself influential by donating it to a political cause.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}