{
  "id": "topic_5452546",
  "title": "CryptopreneurBrainboss",
  "author": "CryptopreneurBrainboss",
  "created_time": "May 12, 2023, 10:47:34 PMLast edit: May 12, 2023, 11:22:13 PM by CryptopreneurBrainboss",
  "content": "My people, if you dun run transaction in the last one week, you go dun see say miners dun turn POS operative in regards to the kind transaction fee dem dey charge. To get transaction confirm in the fastest time dey cost reach like $200 last week as I dey see screenshots everywhere (like the screenshot above wey person been send me) even me self check am and confirm am. People wey been get all their money for BTC the thing worry dem well well. How far, you do transaction last week and if yes how much you pay for fee. Also which wallet wey you use run the transaction so maybe others fit download incase this kind thing repeat him self for future. Edit: I notice those wey dey use trustwallet dey get this over high fee issue as dem no get control over setting their fees Another matta wey I wan bring here na, from this experience of high fees na say, wetin be your stand on getting some stablecoin for hand as e fit help in situations like this. People wey been get stablecoin just dey do their things as normal like nothing happen and dey wait for the fee to come down (e dun reduce small now) before dem begin the use the network again. How you see the idea to they hold stablecoin as you dey hold your BTC.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452546",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 12, 2023, 11:33:55 PMLast edit: May 13, 2023, 12:20:25 AM by Charles-Tim",
      "body": "Quote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMTo get transaction confirm in the fastest time dey cost reach like $200 last week as I dey see screenshots everywhere (like the screenshot above wey person been send me) even me self check am and confirm am.The highest fee that I noticed at 500 sat/vbyte for 1 input 2 outputs for native segwit to native segwit addresses was around $23, if bitcoin is at $28000.Probably he used a wallet that has a wrong fee estimation as that is not up to $50 for legacy address to legacy address which can possibly has the highest fee for 1 input and 2 outputs.Or the transaction has many inputs and/or many outputs. It is good to consolidate inputs if mempool is not congested.Quote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMAlso which wallet wey you use run the transaction so maybe others fit download incase this kind thing repeat him self for future.Desktop Electrum has fee customization. Bluewallet wallet that is available on Android, iOS and MacOS has fee customization as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "May 13, 2023, 02:46:52 PM",
      "body": "Quote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMMy people, if you dun run transaction in the last one week, you go dun see say miners dun turn POS operative in regards to the kind transaction fee dem dey charge. To get transaction confirm in the fastest time dey cost reach like $200 last week as I dey see screenshots everywhere (like the screenshot above wey person been send me) even me self check am and confirm am.I use Desktop Electrum wallet last week and the fee for small $40 na $5. I nor know whether na because say I do am for early mormor that is 5am. Before the fee nor even reach $1.  But since that time sha I don abandon any BTC transaction for the now make person go die. Wetin dey happen sha dey encourage hodling by fire by force.QuoteHow you see the idea to they hold stablecoin as you dey hold your BTC. Stable coin na Idan now o. Na wetin I dey use and the transactions dey seamless as if say nothing dey happen. But e dey possible say we fit experience this kind congestion for stablecoin like say USDT if plenty people start to dey use am?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 13, 2023, 03:30:19 PM",
      "body": "Quote from: Davidvictorson on May 13, 2023, 02:46:52 PMI use Desktop Electrum wallet last week and the fee for small $40 na $5. I nor know whether na because say I do am for early mormor that is 5am. Before the fee nor even reach $1.  But since that time sha I don abandon any BTC transaction for the now make person go die. Wetin dey happen sha dey encourage hodling by fire by force.Bitcoin transaction fee is based on transaction virtual size or weight, not the amount of coins that you want to send.Bitcoin transaction has never been a problem for me as the transaction size is not more than 500 bytes, using 16 to 20 sat/vbyte and ViaBTC free accelerator to accelerate it. The last time I did it, it was around $0.6 in fee when many people are using over $20 as fee to get faster confirmation.Quote from: Davidvictorson on May 13, 2023, 02:46:52 PMBut e dey possible say we fit experience this kind congestion for stablecoin like say USDT if plenty people start to dey use am?No. Altcoins are more scalable. Another thing is that most stable coins are tokens on several blockchains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "May 13, 2023, 06:41:44 PM",
      "body": "My brother this issues really strong o, like this our payment never even arrived since Wednesday till today and I no know how e go be me for body. Usually If I am holding any bitcoin in exchange is just to convert to stablecoin like usdt and send to person I wish to send to than withdrawing bitcoin because I noticed the charges alone can real make you forget your password 🤣.So, if not for transaction and payment there's no need holding stablecoin, as a matter of fact this is even the right time to buy and hold bitcoin.Quote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMEdit: I notice those wey dey use trustwallet dey get this over high fee issue as dem no get control over setting their fees Few transaction that I made during higher gas fee I adjusted them by myself, although it was through Trustwallet I made it. I reduced it to around 10k sat and it took about 40hrs to confirm my transactions and I don't just allow those miners to impose unnecessary charges on my head. Is so annoying watching miners sharing your money 50/50 taking half and giving you half.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "May 13, 2023, 06:53:45 PM",
      "body": "I don too here about this gas fee too much because I just dey see people dey post am I never do any transaction to witness am before. But anyhow the thing be I know say e go soon drop or even to stop self, I come also see this odinal of a thing though no too get idea but wetin just see wet come my mind na network congestion. But ontop of this matter I go like make una play safe and also find out another means of transactions to fit balance the condition wey dey ground.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 13, 2023, 07:46:25 PM",
      "body": "Quote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMEdit: I notice those wey dey use trustwallet dey get this over high fee issue as dem no get control over setting their fees You can customize the fee on Trustwallet. When you want to make the transaction, after you click on 'continue', click on the  settings icon at the upper right corner to customize the fee.Trustwallet is one of the less useful bitcoin wallet that can become frustrating. It is also close source and not recommendable at all when it is about bitcoin. There are better wallets like Electrum, Bluewallet and many other open source wallets. Quote from: Adbitco on May 13, 2023, 06:41:44 PMMy brother this issues really strong o, like this our payment never even arrived since Wednesday till today and I no know how e go be me for body. Usually If I am holding any bitcoin in exchange is just to convert to stablecoin like usdt and send to person I wish to send to than withdrawing bitcoin because I noticed the charges alone can real make you forget your password .So, if not for transaction and payment there's no need holding stablecoin, as a matter of fact this is even the right time to buy and hold bitcoin.The fee rate used is 12 sat/vbyte. Let us expect the transaction would be confirmed tomorrow. Although, I do not know if it is going to, but the mempool is becoming less congested, and mostly less congested more on Sundays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "May 13, 2023, 08:23:11 PM",
      "body": "Boss di matter no bi here. Me I do transaction of 0.0038 bitcoin and the fee wey pay am na 0.0005064 with 106 sat and with 25 blocks. Di matter hook me for throat. As dis palava I don make transactions well well and also cancelled up to three transactions and all the cancelled transactions I still double pay the fee to cancel them. Di thing e no dey easy. As e bi like dis transaction wey I send go another wallet still dey pending (unconfirmed) since morning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 13, 2023, 08:49:21 PM",
      "body": "E day good that the transaction fee price has started to go back to normal and with time it would fully go back to the usual Transaction fees we are well accustomed to, the Bitcoin transaction was really a thing of worry and had the whole ecosystem in concern.I go talk say I no too panic I knew the main cause of the Transaction fee was the NFT and other factors that was on the Bitcoin network, I believe the rush for them would fade off. My main coping mechanism during this high transaction fee period was try as much as possible not to perform any transaction, this was the effective way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "May 13, 2023, 10:40:50 PM",
      "body": "You can imagine, how person go pay $184 for just fees, na some secondary school teachers six months salary be that. This high fees wahala dey really bother me, I dey pray say na this month e go end cos we no go fit continue like this. Na now I come dey see the importance of stable coins o. I sure say the increased fees go affect p2p price, question to the traders for the house, how una take dey calculate profits with the fee costs when customer won buy bitcoin from you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 13, 2023, 10:45:48 PM",
      "body": "Quote from: SatoPrincess on May 13, 2023, 10:40:50 PMI sure say the increased fees go affect p2p price, question to the traders for the house, how una take dey calculate profits with the fee costs when customer won buy bitcoin from you?Dollar parallel market rate is used, nothing affected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "May 14, 2023, 05:59:22 AM",
      "body": "Quote from: SatoPrincess on May 13, 2023, 10:40:50 PMYou can imagine, how person go pay $184 for just fees, na some secondary school teachers six months salary be that. This high fees wahala dey really bother me, I dey pray say na this month e go end cos we no go fit continue like this. Na now I come dey see the importance of stable coins o. I sure say the increased fees go affect p2p price, question to the traders for the house, how una take dey calculate profits with the fee costs when customer won buy bitcoin from you?   no be small oo, but na truth wey you talk sha, 184$ no be small money and the funny about this amount be say na actually my three and half month salary when I been day teach for one secondary school for my area and just imagine how I go come use the kind amount take transact my bitcoin from my electrum wallet go my binance exchange to change the coins, e just better say I leave am there make I use am as long term investment dey go until this problem die down which I know say no be anytime soon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "May 14, 2023, 06:53:15 AM",
      "body": "Quote from: Charles-Tim on May 13, 2023, 07:46:25 PMQuote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMEdit: I notice those wey dey use trustwallet dey get this over high fee issue as dem no get control over setting their fees You can customize the fee on Trustwallet. When you want to make the transaction, after you click on 'continue', click on the  settings icon at the upper right corner to customize the fee.Trustwallet is one of the less useful bitcoin wallet that can become frustrating. It is also close source and not recommendable at all when it is about bitcoin. There are better wallets like Electrum, Bluewallet and many other open source wallets. Quote from: Adbitco on May 13, 2023, 06:41:44 PMMy brother this issues really strong o, like this our payment never even arrived since Wednesday till today and I no know how e go be me for body. Usually If I am holding any bitcoin in exchange is just to convert to stablecoin like usdt and send to person I wish to send to than withdrawing bitcoin because I noticed the charges alone can real make you forget your password .So, if not for transaction and payment there's no need holding stablecoin, as a matter of fact this is even the right time to buy and hold bitcoin.The fee rate used is 12 sat/vbyte. Let us expect the transaction would be confirmed tomorrow. Although, I do not know if it is going to, but the mempool is becoming less congested, and mostly less congested more on Sundays.My brother as it's now ehh is really holding me at the bad point because of this confirmation issues check from blockchain explorer you would see the balance reflected to account but yet to be confirmed. At this point we had no other options than to wait till it confirmed, but just as you have said we have to exercise patient praying this Sunday should be a happy one to us. Transaction spent 5 days to confirm omo this one shocked me o.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "May 14, 2023, 09:52:13 PM",
      "body": "Quote from: Charles-Tim on May 12, 2023, 11:33:55 PMQuote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMTo get transaction confirm in the fastest time dey cost reach like $200 last week as I dey see screenshots everywhere (like the screenshot above wey person been send me) even me self check am and confirm am.The highest fee that I noticed at 500 sat/vbyte for 1 input 2 outputs for native segwit to native segwit addresses was around $23, if bitcoin is at $28000.Belike you no follow news, people that were looking for very fast confirmation payed at some point more than above what's on the OP. Many people no get patience and dem no get time to dey find accelerators. We no dey use the bitcoin blockchain, e get people wey dey depend on am very well and any moment wasted fit affect their reputation. Take Hhampuz as example, he's known as a fast paying signature manager and to keep his reputation intact, una see the kind money wey him dey pour for transaction fees just to make sure there's no delay in transaction while other managers dey delay their participants payment and you no go blame them, dey no get reputation to protect. Quote from: Charles-Tim on May 13, 2023, 07:46:25 PMQuote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMEdit: I notice those wey dey use trustwallet dey get this over high fee issue as dem no get control over setting their fees You can customize the fee on Trustwallet. When you want to make the transaction, after you click on 'continue', click on the  settings icon at the upper right corner to customize the fee.Nice I no get dat update oh, I think say trustwallet na still dat crazy wallet wey no dey allow their customers to set their own transaction fees. I know say dem sabi recommend fees to use and during the hike in transaction fee they recommended were outrageous as I confirm am myself. Quote from: Davidvictorson on May 13, 2023, 02:46:52 PMQuoteHow you see the idea to they hold stablecoin as you dey hold your BTC. Stable coin na Idan now o. Na wetin I dey use and the transactions dey seamless as if say nothing dey happen. But e dey possible say we fit experience this kind congestion for stablecoin like say USDT if plenty people start to dey use am?Practically E fit happen, any blockchain can get congested, the thing be say most blockchain for this industry no get better activities but their develops just they manufacture high numbers to push rubbish agenda so people go feel say the blockchain na coco but nothing dey dem. See Ethereum na, immediately better people start they use am, na so congestion wan kill the blockchain. Using USDT as example, make we just assume say USDT transaction on other blockchain was stopped and na only Ethereum wey people prefer pass or dem dey use, already Ethereum get problem with congestion wey dem dey try solve so e fit get similar issues too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "May 15, 2023, 12:05:29 PM",
      "body": "The bitcoin high transaction fee last week really worry me too much as I take the see how my bitcoin just d reduce for price and I no fit send am go exchange to change am to stablecoin because of sae I d use trustwallet. Anyway, the bitcoin transaction fee don reduce sha, as of today na $2.30cent wey I spend to run my bitcoin transaction Quote from: Charles-Tim on May 13, 2023, 07:46:25 PMQuote from: CryptopreneurBrainboss on May 12, 2023, 10:47:34 PMEdit: I notice those wey dey use trustwallet dey get this over high fee issue as dem no get control over setting their fees You can customize the fee on Trustwallet. When you want to make the transaction, after you click on 'continue', click on the  settings icon at the upper right corner to customize the fee.Na few days ago, wey I know sae peso go fit customize em transaction fee for trustwallet. All this while I no know sae peso fit reduce em transaction fee. Since all my dealings with bitcoin transaction I never experience this kind high fees before, na small small cent wey peso d pay to run em bitcoin transaction. When this one happen(high fees), I was really confused of the whole thing. I no know where to start until a friend tell me sae, I go fit reduce my bitcoin transaction fee for trustwallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 15, 2023, 12:29:03 PM",
      "body": "Quote from: Marykeller on May 15, 2023, 12:05:29 PMWhen this one happen(high fees), I was really confused of the whole thing. I no know where to start until a friend tell me sae, I go fit reduce my bitcoin transaction fee for trustwalletBut better to move your coins out of Trustwallet because it is one of the bitcoin wallets that is trash. It supports only one address for bitcoin which means no privacy. It collect users information which can be given to the government and third parties. It does not support RBF. Not supporting CPFP. Not supporting coin control. It is close source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "May 17, 2023, 01:05:39 PM",
      "body": "I know say my level  as a newbie never reach to contribute to this topic, because I never dey trade. But as I just dey read through una comments on this topic, the thing come make me dey fear small, unto say the risk wey dey involved for trading in bitcoin dey real, because if you no calculate well, you fit to loose plenty money. E de rush me for body to start to dey trade immediately, but e be like say I need to take am easy and learn more, as I de do now from senior members like una.Anyway if I fit to contribute small, I for say if dem dey charge high fee for one wallet and e get alternative for another wallet, wey go give a better deal at that time, na to change to that one sharply. Because una make me to understand here say e dey possible to move from one wallet to another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 17, 2023, 02:50:59 PM",
      "body": "Omo during that high fee period,na only one transaction I do and when I see the fee like 25% of my transaction, I won mad but I no get option than to just do am because I need small thing to use hold my side. After that transaction,I no free do any  one gain. I go borrow fiat currency from somebody wey trust me and I tell am say I get bank issues which he understand with me. Na just last weekend na e I do my first transaction after that one. Omo as I see say the fee don do down,I no even bother to adjust my transaction fee once na e I broadcast my transaction so that I go for pay up that my guy. I dey use electrum wallet and I no just dey alright with that high fee,omo I nearly give Hamphuz my binance wallet btc address to use dey transfer my funds. I just reason am say e no go make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 17, 2023, 02:54:36 PM",
      "body": "Omo.. I no go lie, the last past few weeks have been both a hell and blessing in disguise to me, in the sense that I was able to save more and spend less unlike before that if I need small money, ah go just run Btc transfer and swap am immediately to fiat in less than 10minutes. But I swear, has few weeks did actually show me shege, as you dey see say you get rubbers oh, but yet no fit transfer or swap an into fiat due to very high transaction fee. Because I fit remember trying to transfer my fund from Trust Wallet (I.e my first campaign BTC wallet address and I yet still maintaining it) to Remitano, and I noticed that the fee to transfer #12,000 was #3000 (i.e something wey dey cost #260 before oh), and I stopped, hoping that next day fee go don drop back to normal, but only for me to check and I noticed say fee done skyrocket 4x from #3000 to be #10,000 as fee oh to transfer that same amount of #12000.Check out belowBut it was just of recently I noticed that you can equally select the amount of fee you wish to pay while using \"Trust wallet\" (i.e after the fee fell back to around #1500), as you can see in the arrow given in the image below, as that button is meant for fee, and it can be used to reduce or increase your Bitcoin transaction fee on trust wallet. And that was how I was able to reduce my fee from #1325 to #500 on Monday 15th May, transferred and got it confirmed in less than an hour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 17, 2023, 08:18:57 PM",
      "body": "I will always advice Nigerians to stop using Trustwallet for bitcoin, it is one of the worst bitcoin wallet that I have seen.@CryptoHeadlineNewsI like it that you are estimation your coins and fee in naira, but did you know that the exchanges and wallets that I have seen naira, including Binance and Trustwallet are all using CBN (official) rate? Which is 461 as of today. The last parallel (black) market price of United States dollar to Nigerian naira was 753. That can be misleading. You are not wrong, but I am just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}