{
  "id": "topic_5437413",
  "title": "Question:",
  "author": "bisdak40",
  "created_time": "January 31, 2023, 01:21:17 AMLast edit: January 31, 2023, 09:27:15 PM by bisdak40",
  "content": "cttoDate: March 4, 2023Venue: Toyota Arena, Ontario CaliforniaSo, this is now official as PBC has announced that this fight will take place this coming March 4.For fans of Mark Magsayo, i know that you are eager to watch him rebound on his recent loss to Vargas but for me this is not an easy fight for him.https://www.boxingscene.com/brandon-figueroa-vs-mark-margsayo-showtime-tripleheader-official-march-4--172155",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437413",
  "comments": [
    {
      "author": "joeperry",
      "created_time": "January 31, 2023, 05:11:45 AM",
      "body": "This is going to be a good match as they are #2 and #3 overall ranking for featherweight division and both are #1 in their country both is a great fighter and honestly I am not sure win who's gonna win in this match. Unfortunately I can't see where I can place bets to this match as they are not available on the market, maybe it will be available when the match is near though I am curious what's the odd of each fighter. Maybe you could add a gambling site where we can place bet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "January 31, 2023, 09:33:52 PM",
      "body": "Quote from: joeperry on January 31, 2023, 05:11:45 AMThis is going to be a good match as they are #2 and #3 overall ranking for featherweight division and both are #1 in their country both is a great fighter and honestly I am not sure win who's gonna win in this match. Unfortunately I can't see where I can place bets to this match as they are not available on the market, maybe it will be available when the match is near though Yeah, this is a 50-50 fight where it's hard to predict whose gonna win the fight but for sure Filipinos will be happy as their very own Mark Magsayo is back in the ring to take a chance to grab that WBC belt once again. They maybe have a contrasting style as Magsayo is known to be a KO artist while Figueroa is a volume puncher so this is another acid test for the Filipino slugger.Quote from: joeperry on January 31, 2023, 05:11:45 AMI am curious what's the odd of each fighter. Maybe you could add a gambling site where we can place bet? I've browsed some sportbookies and unfortunately they have not yet placed any odds for this fight but rest assured that they will cover this one as the fight is approaching near.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "January 31, 2023, 11:05:51 PM",
      "body": "Quote from: bisdak40 on January 31, 2023, 01:21:17 AMcttoDate: March 4, 2023Venue: Toyota Arena, Ontario CaliforniaSo, this is now official as PBC has announced that this fight will take place this coming March 4.For fans of Mark Magsayo, i know that you are eager to watch him rebound on his recent loss to Vargas but for me this is not an easy fight for him.https://www.boxingscene.com/brandon-figueroa-vs-mark-margsayo-showtime-tripleheader-official-march-4--172155This isn't an easy fight for Brandon but so is Figueroa, Brandon is not a hard puncher and loves to fight inside and mix it up, if Magsayo is going to win against Brandon he better make sure that he can last a full 12 rounds because Brandon can keep up as we have seen on his match against Fulton.Brandon throws a lot of punches like Vargas so he should impose himself by connecting big shots, this fight is 50/50 for me but I'm hoping that Magsayo can bring on his best form because Brandon is one tough fighter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "January 31, 2023, 11:20:02 PM",
      "body": "This is going to be very tough for Magsayo as Figueroa is a volume puncher and rugged inside boxer. But it suits Magsayo's style because he is a inside operator as well. The thing for me or the advantage of Mark is that he has the power and could score a knock out victory.He needs this win, to stay on top, otherwise it will be very difficult for him to get another belt in this division.So hopefully he can bounce back again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "January 31, 2023, 11:54:15 PM",
      "body": "Yes, I agree that this is not an easy fight, Figueroa gave Fulton one hell of a fight and there are fans who says that he was robbed on that win. Nevertheless he has move on already and for added motivation, this is for the vacant WBC featherweight championship.So I expect a lot of fireworks in this fight. Yes, Figueroa might not have the power, but he is going up in weight at 126 lbs so maybe the added pounds will have some effect on his power punches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "February 01, 2023, 01:08:30 AM",
      "body": "I will give the slight advantage to Magsayo in terms of power, but for the work rate, it's Figueroa here. This is probably like the Ceja war, going back and forth and then Mark will caught Figueroa later with a big left causing him to go down and kiss the canvass and not make it.Interim belt and probably after this the winner will against fighting Rey Vargas, and if my chance my prediction will happen, it will be a trilogy for Vargas vs Magsayo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "February 01, 2023, 11:10:54 AM",
      "body": "Both fighters need this win, especially Magsayo who just lost a split decision against Vargas this is a very even fight both fighters are capable of delivering a knockout and both fighters can go the distance, the fight could go either way because they have the same style and power, of course, I'm in favor of Magsayo, this is going to be a much tougher fight for Magsayo, Figueroa loves to break down his opponent with his body shots so I hope Magsayo is ready for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "February 01, 2023, 12:07:58 PM",
      "body": "That was quick. Probably both protagonists are already training earlier when the WBC announced mandatories for Vargas-Foster, Fulton-Figueroa II, and Magsayo-Dogboe. Things changed when Fulton opted to remain in his division and defend his WBO and WBC belts to Naoya Inoue. Magsayo then replaced Fulton to challenge Figueroa which makes sense because Dogboe might be difficult to stage since it is handled by a rival promoter Top Rank. I think Dogboe is not interested in a WBC eliminator since he might get a real shot at the vacant WBO belt. I want Magsayo to win but as always, I am not convinced by his skills and stamina. Magsayo is just like Deontay Wilder, low-skilled and relied on their power punches to land hoping their opponents can't take it. So just like when I voted for Vargas earlier to beat Magsayo, I think Figueroa stops Magsayo this time. This fight might be a war if Figueroa decides to brawl. Although Magsayo is probably the bigger guy and Brandon might not be able to take heavy punches in his new division. May the best man win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "February 01, 2023, 12:17:13 PM",
      "body": "Quote from: aioc on February 01, 2023, 11:10:54 AMBoth fighters need this win, especially Magsayo who just lost a split decision against Vargas this is a very even fight both fighters are capable of delivering a knockout and both fighters can go the distance, the fight could go either way because they have the same style and power, of course, I'm in favor of Magsayo, this is going to be a much tougher fight for Magsayo, Figueroa loves to break down his opponent with his body shots so I hope Magsayo is ready for this.Magsayo's gas tank is questionable though, he might get tire as the rounds go, as compare to Brandon Figueroa who is known to have a deep lungs. So it will be dangerous of Mark if the fight goes to distance as he might lose again on the decision.So for him, it's better to rely on his power here. Yeah, I know he feel in love with his knock out power. And when it didn't come that's where the problem is. Just like against Vargas. It was a war but at the end, the judges gave it to Vargas because of accuracy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "February 01, 2023, 12:41:12 PM",
      "body": "Quote from: inthelongrun on February 01, 2023, 12:07:58 PMI want Magsayo to win but as always, I am not convinced by his skills and stamina. Magsayo is just like Deontay Wilder, low-skilled and relied on their power punches to land hoping their opponents can't take it. So just like when I voted for Vargas earlier to beat Magsayo, I think Figueroa stops Magsayo this time. This fight might be a war if Figueroa decides to brawl. Although Magsayo is probably the bigger guy and Brandon might not be able to take heavy punches in his new division. May the best man win.Lol, that's a bit sarcastic bro but i definitely agree with the bolded text above. Magsayo has always had problems with his stamina, have observed that when he was still with the defunct ALA stable but in fairness to him, he has improved a little with this department but he can't be with the big boys if he always gassed out in the championship rounds.Just realized that Figueroa and Magsayo have a common opponent in Ceja which if we gauge that one, Figueroa has the advantage as he almost won on that one while Magsayo won by KO but Ceja was leading in the score card which makes me think that it was just a lucky punch that made him won that match.Being a compatriot of Magsayo i hope that he could land those heavy blows to do some damage to Figueroa and won by knockout as this is the only way for him to win and become a two time world champion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "February 01, 2023, 01:01:09 PM",
      "body": "Quote from: cryptomaniac_xxx on February 01, 2023, 12:17:13 PMQuote from: aioc on February 01, 2023, 11:10:54 AMBoth fighters need this win, especially Magsayo who just lost a split decision against Vargas this is a very even fight both fighters are capable of delivering a knockout and both fighters can go the distance, the fight could go either way because they have the same style and power, of course, I'm in favor of Magsayo, this is going to be a much tougher fight for Magsayo, Figueroa loves to break down his opponent with his body shots so I hope Magsayo is ready for this.Magsayo's gas tank is questionable though, he might get tire as the rounds go, as compare to Brandon Figueroa who is known to have a deep lungs. So it will be dangerous of Mark if the fight goes to distance as he might lose again on the decision.So for him, it's better to rely on his power here. Yeah, I know he feel in love with his knock out power. And when it didn't come that's where the problem is. Just like against Vargas. It was a war but at the end, the judges gave it to Vargas because of accuracy.I’m sure Magsayo team knew exactly what’s their weakness and probably focus on increasing his stamina for his training camp. That weakness only highlighted on the recent match since he have a pretty good run before that split decision match happened. This is same when Manny Pacquiao first lose to Morales, Pacquiao team focus on how to counter Morales aggressiveness by improving Pacquiao footwork to catch up Morales.Having a explosive punch is a great disadvantage on boxing since everyone can improve their stamina through proper training. I will bet for Magsayo this time since many people just criticize him because of his recent loss neglecting all his previous good run. I really believe on training improvements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "February 01, 2023, 01:22:02 PM",
      "body": "Even though Mark Magsayo has the power to knock out Figueroa, he still has a lot to do concerning his training because if he can't execute those power punches, it won't be his secret weapon. This guy is good and really needs to work harder to improve because he has the potential to become a phenomenal champion if only he can get straight wins via K.O. But he always gets nervous and loses focus when the battle begins, giving his opponents some chances to score against him and eventually win against him as he does in his last fight. He better learn to finish his opponent until the judges no longer have doubt in their decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "February 01, 2023, 04:53:25 PM",
      "body": "Quote from: yazher on February 01, 2023, 01:22:02 PMEven though Mark Magsayo has the power to knock out Figueroa, he still has a lot to do concerning his training because if he can't execute those power punches, it won't be his secret weapon. This guy is good and really needs to work harder to improve because he has the potential to become a phenomenal champion if only he can get straight wins via K.O. But he always gets nervous and loses focus when the battle begins, giving his opponents some chances to score against him and eventually win against him as he does in his last fight. He better learn to finish his opponent until the judges no longer have doubt in their decisions.Just the problem with fighters who just rely on their power, it that failed, they don't have a plan B just like what Magsayo. Figueroa has a solid chin, and he really moves a lot, and if I'm not mistaken, could be a bit taller which is a weakness of Magsayo as well as he had difficulty fighting against boxers that is taller than him. And if it goes to the judges score card, I doubt that Magsayo can also get the decision. So this fight is all or nothing for him at this stage of his career, a lost will put his career on a standstill as he will not to proved himself ready for title shots again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "February 01, 2023, 05:16:26 PM",
      "body": "Quote from: bisdak40 on February 01, 2023, 12:41:12 PMQuote from: inthelongrun on February 01, 2023, 12:07:58 PMI want Magsayo to win but as always, I am not convinced by his skills and stamina. Magsayo is just like Deontay Wilder, low-skilled and relied on their power punches to land hoping their opponents can't take it. So just like when I voted for Vargas earlier to beat Magsayo, I think Figueroa stops Magsayo this time. This fight might be a war if Figueroa decides to brawl. Although Magsayo is probably the bigger guy and Brandon might not be able to take heavy punches in his new division. May the best man win.Lol, that's a bit sarcastic bro but i definitely agree with the bolded text above. Magsayo has always had problems with his stamina, have observed that when he was still with the defunct ALA stable but in fairness to him, he has improved a little with this department but he can't be with the big boys if he always gassed out in the championship rounds.Just realized that Figueroa and Magsayo have a common opponent in Ceja which if we gauge that one, Figueroa has the advantage as he almost won on that one while Magsayo won by KO but Ceja was leading in the score card which makes me think that it was just a lucky punch that made him won that match.Being a compatriot of Magsayo i hope that he could land those heavy blows to do some damage to Figueroa and won by knockout as this is the only way for him to win and become a two time world champion. And maybe we can say that Magsayo got lucky on the Ceja fight? when he caught Ceja late with that and knocking him out? yeah, we can call it lucky punch. But against Figueroa, Magsayo might not get lucky because Figueroa is a different fighter.He should go for that knockout here, or at least damage Figueroa early and then go for the knockout later.Magsayo can't allow Figueroa dictate the tempo of the fight, he should be one dominating from the start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "February 01, 2023, 10:45:30 PM",
      "body": "Quote from: bisdak40 on January 31, 2023, 09:33:52 PMQuote from: joeperry on January 31, 2023, 05:11:45 AMThis is going to be a good match as they are #2 and #3 overall ranking for featherweight division and both are #1 in their country both is a great fighter and honestly I am not sure win who's gonna win in this match. Unfortunately I can't see where I can place bets to this match as they are not available on the market, maybe it will be available when the match is near though Yeah, this is a 50-50 fight where it's hard to predict whose gonna win the fight but for sure Filipinos will be happy as their very own Mark Magsayo is back in the ring to take a chance to grab that WBC belt once again. They maybe have a contrasting style as Magsayo is known to be a KO artist while Figueroa is a volume puncher so this is another acid test for the Filipino slugger.Quote from: joeperry on January 31, 2023, 05:11:45 AMI am curious what's the odd of each fighter. Maybe you could add a gambling site where we can place bet? I've browsed some sportbookies and unfortunately they have not yet placed any odds for this fight but rest assured that they will cover this one as the fight is approaching near.Right, still 50/50 fight, and maybe if Figueroa will be the favorite, it's going to be small that we can say that it's going to be close. Brandon Figueroa is known to be a slow starter, just like in the Fulton fight. And it allowed Fulton to get some scores in the judges early and take the lead. But then he started to get hot in the middle going into full 12 rounds.So this might be the biggest chance of Mark Magsayo, to used his power to get early and maybe look for the knockout. He needs a statement win here to be relevant in this division. So this is going to be exciting and it could be fight of the year candidate if it goes to the distance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "February 01, 2023, 10:53:48 PMLast edit: February 01, 2023, 11:13:39 PM by AmoreJaz",
      "body": "Quote from: btc_angela on February 01, 2023, 05:16:26 PMQuote from: bisdak40 on February 01, 2023, 12:41:12 PMQuote from: inthelongrun on February 01, 2023, 12:07:58 PMI want Magsayo to win but as always, I am not convinced by his skills and stamina. Magsayo is just like Deontay Wilder, low-skilled and relied on their power punches to land hoping their opponents can't take it. So just like when I voted for Vargas earlier to beat Magsayo, I think Figueroa stops Magsayo this time. This fight might be a war if Figueroa decides to brawl. Although Magsayo is probably the bigger guy and Brandon might not be able to take heavy punches in his new division. May the best man win.Lol, that's a bit sarcastic bro but i definitely agree with the bolded text above. Magsayo has always had problems with his stamina, have observed that when he was still with the defunct ALA stable but in fairness to him, he has improved a little with this department but he can't be with the big boys if he always gassed out in the championship rounds.Just realized that Figueroa and Magsayo have a common opponent in Ceja which if we gauge that one, Figueroa has the advantage as he almost won on that one while Magsayo won by KO but Ceja was leading in the score card which makes me think that it was just a lucky punch that made him won that match.Being a compatriot of Magsayo i hope that he could land those heavy blows to do some damage to Figueroa and won by knockout as this is the only way for him to win and become a two time world champion. And maybe we can say that Magsayo got lucky on the Ceja fight? when he caught Ceja late with that and knocking him out? yeah, we can call it lucky punch. But against Figueroa, Magsayo might not get lucky because Figueroa is a different fighter.He should go for that knockout here, or at least damage Figueroa early and then go for the knockout later.Magsayo can't allow Figueroa dictate the tempo of the fight, he should be one dominating from the start.magsayo should not really wait for the right timing to punch the opponent. as much as possible, ko figueroa in the early rounds. if this will go the distance, figueroa might win by UD or TKO. some boxing analysts are already favouring figueroa on this match. but who knows, magsayo can pull it off. should aim for the early round KO though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "February 03, 2023, 07:53:35 PM",
      "body": "Quote from: AmoreJaz on February 01, 2023, 10:53:48 PMQuote from: btc_angela on February 01, 2023, 05:16:26 PMQuote from: bisdak40 on February 01, 2023, 12:41:12 PMQuote from: inthelongrun on February 01, 2023, 12:07:58 PMI want Magsayo to win but as always, I am not convinced by his skills and stamina. Magsayo is just like Deontay Wilder, low-skilled and relied on their power punches to land hoping their opponents can't take it. So just like when I voted for Vargas earlier to beat Magsayo, I think Figueroa stops Magsayo this time. This fight might be a war if Figueroa decides to brawl. Although Magsayo is probably the bigger guy and Brandon might not be able to take heavy punches in his new division. May the best man win.Lol, that's a bit sarcastic bro but i definitely agree with the bolded text above. Magsayo has always had problems with his stamina, have observed that when he was still with the defunct ALA stable but in fairness to him, he has improved a little with this department but he can't be with the big boys if he always gassed out in the championship rounds.Just realized that Figueroa and Magsayo have a common opponent in Ceja which if we gauge that one, Figueroa has the advantage as he almost won on that one while Magsayo won by KO but Ceja was leading in the score card which makes me think that it was just a lucky punch that made him won that match.Being a compatriot of Magsayo i hope that he could land those heavy blows to do some damage to Figueroa and won by knockout as this is the only way for him to win and become a two time world champion. And maybe we can say that Magsayo got lucky on the Ceja fight? when he caught Ceja late with that and knocking him out? yeah, we can call it lucky punch. But against Figueroa, Magsayo might not get lucky because Figueroa is a different fighter.He should go for that knockout here, or at least damage Figueroa early and then go for the knockout later.Magsayo can't allow Figueroa dictate the tempo of the fight, he should be one dominating from the start.magsayo should not really wait for the right timing to punch the opponent. as much as possible, ko figueroa in the early rounds. if this will go the distance, figueroa might win by UD or TKO. some boxing analysts are already favouring figueroa on this match. but who knows, magsayo can pull it off. should aim for the early round KO though.If stamina was his problem for sure they have addressed it before they'll fight Figueroa or they are on the case of improving it. I tend to agree that it would be best for Magsayo if he could KO him earlier but the thing is, Figueroa would not be an easy feat he's a younger brother of a former world champion after all, it's in his lineage or maybe he will surpass his brother.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "February 03, 2023, 08:18:45 PM",
      "body": "This is one of those very difficult matches to predict and most times it because of their rankings and both of them are really great fighters and they are both raked as number one in their various countries and I'm so sure that it wouldn't be an easy fight at all.I really don't think it will be a great fight for megsayo but rather a very difficult one and I'm sure that at his level in his career I'm sure a defeat at this point wouldn't be a nice one for him as it might seem his not ready for the tittle awaiting him and it might be withhold his promotion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "February 03, 2023, 08:59:57 PM",
      "body": "I don't know anything about Figueroa but I've seen Magsayo fight. Magsayo is a good fighter(despite his recent loss) but still needs a lot of improvement if he plans to dominate during his career. anyway, I'll be biased here and vote for Magsayo to win by decision, it'll be an interesting match to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}