{
  "id": "topic_5446455",
  "title": "l008com II",
  "author": "l008com II",
  "created_time": "March 27, 2023, 09:36:00 AM",
  "content": "I've been thinking about adding a little bit of low power, high efficiency GPU power to my Gridcoin setup, something I could run 24/7 without blowing up the electric bill. Something like this: https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T1/images/I/617WtB7jm2L._AC_SL1000_.jpgI have two primary questions about these setups:1) The part that goes into the \"real\" PCI slot, and then has a USB port on it.... is this some custom hack sort of part, or is that just giving you a regular old USB3 port? Or to ask this question another way, if my computer had a bunch of native USB3 ports, unused, where each port had it's own dedicated bus, could I just plug one of those riser boards directly into that external USB3 port? 2) Do these setups work entirely in hardware or do they require some sort of special software to allow the computer to \"see\" the GPU PCI card when connected via USB? Or to ask that question another way, will this work on a Mac? What I want to do is start very simple and get one of these riser cards, stick a very modest RX 550 GPU in there, plug it into the back of a Mac mini using a regular USB3 port and do some BOINC science with that. And maybe also pop it in to my Mac Pro and compare to see if there seems to be any fatal bottlenecks. If that works, then I'll come up with a plan for a much more ambitions setup. BUT if the USB ports these risers plug in to are *not* standard USB3 ports, or if special software is required to get this setup to work, software that is not available for macOS, that that nixes this whole plan.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446455",
  "comments": [
    {
      "author": "JayDDee",
      "created_time": "March 27, 2023, 05:34:14 PM",
      "body": "Quote from: l008com II on March 27, 2023, 09:36:00 AM is this some custom hack sort of part, or is that just giving you a regular old USB3 port?It's not USB protocol, just a different cable. Don't ever plug a PCIe riser ino a USB port.If you use lamp cord for speaker wire it doesn't mean you can plug your speakers into the wall socket. Same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}