{
  "id": "topic_5452293",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "May 10, 2023, 07:28:24 PM",
  "content": "On May 8th the crypto community was greeted with the news that Cryptocurrency exchange Bittrex filed for bankruptcy. It was one of the biggest crypto exchanges to exist before Binance. It joins other crypto exchanges like FTX, platforms Celsius Network, Voyager Digital, Three Arrows Capital and BlockFi that filed for bankruptcy in 2022. Unlike FTX, Bittrex informed her customers to withdraw their funds before April 30th and even those who didn't would still be able to get their funds back in full.QuoteIn April, Bittrex told its U.S. customers to withdraw their funds by Apr. 30, when the company shut down its operations, according to its website. For customers who didn’t withdraw by the end of last month, Bittrex said on Apr. 8 that their funds \"remain safe and secure” and that its top priority is to ensure that they are made whole.I know that many other centralized exchanges may declare bankruptcy - but let's ignore this for a moment and assume that these companies gets back in business would you patronize them? Would you still do business with them? I know the whole talk of move your bitcoin off centralized exchanges but we cannot denial the fact they that they still play an important role in the crypto community. . https://www.thestreet.com/investing/cryptocurrency/big-crypto-exchange-goes-bankrupt#:~:text=Besides%20FTX%2C%20platforms%20Celsius%20Network,BlockFi%20went%20bankrupt%20in%202022.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452293",
  "comments": [
    {
      "author": "BIT-BENDER",
      "created_time": "May 10, 2023, 07:39:53 PM",
      "body": "Actually they were kind enough to tell people to withdraw their funds from the exchange but this goes to still repeat that it’s very risky to leave your funds on exchange, sad to see an exchange filling for bankruptcy but what’s the reason for bankruptcy going by the way FTX went bankrupt and the mismanagement of funds it draws attention also to this case.I would not Trust and do business anymore with a crypto-currency  exchange that has gone bankrupt, I won’t do business with a centralized exchange because I don’t believe in the centralized system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 10, 2023, 07:53:44 PM",
      "body": "This is a story that repeats itself and will continue for a long time.  The centralized are greedy scammers who have no heart and think only of their business so why should I help their pockets with a means of payment that expresses the concept of freedom?  If you are smart, you will continue to accumulate Bitcoins but above all you will have to commit yourself to giving birth to a circular economy in your city, only in this way can mass adoption take place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 10, 2023, 08:03:33 PM",
      "body": "Quote from: alastantiger on May 10, 2023, 07:28:24 PMOn May 8th the crypto community was greeted with the news that Cryptocurrency exchange Bittrex filed for bankruptcy. It was one of the biggest crypto exchanges to exist before Binance. It joins other crypto exchanges like FTX, platforms Celsius Network, Voyager Digital, Three Arrows Capital and BlockFi that filed for bankruptcy in 2022. Unlike FTX, Bittrex informed her customers to withdraw their funds before April 30th and even those who didn't would still be able to get their funds back in full.This exchange is even fair to its users by informing them to withdraw their funds before the specified date, unlike others who simply went bankrupt and went with people's funds without a refund; however, just because they inform their users to withdraw their funds does not make them special.QuoteI know that many other centralized exchanges may declare bankruptcy - but let's ignore this for a moment and assume that these companies gets back in business would you patronize them? Would you still do business with them? I know the whole talk of move your bitcoin off centralized exchanges but we cannot denial the fact they that they still play an important role in the crypto community. Traders are drawn to centralized exchanges because it is simple to trade on them. However, some argue that due to Bitcoin Network congestion and high transaction fees, most people will shift their focus to altcoins; now that the exchanges are going bankrupt, who else can trust them? I believe we should just keep faith and hold our Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "May 10, 2023, 08:03:43 PM",
      "body": "It's important to stay informed: Bittrex has had separate US and Global exchange platforms for over two years now. It's the US exchange that is claiming bankruptcy, not the Global exchange. Many believe that the US government's unfavorable stance towards cryptocurrency may hinder its potential for growth, causing the country to miss out on the tax revenue and other benefits the industry could offer in the future. If this continues, there's a possibility that the US may try to retaliate when they see other countries profiting from the cryptocurrency space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "May 10, 2023, 08:10:13 PM",
      "body": "The trust issue is that when broken it can not be replaced or amended, but then we have to consider several things in all the exchange's bankruptcy which is the nature at which their handle customers' refunds, and the cause of the bankruptcy because exchanges have been under regulation attack for a while now most especially cryptocurrency exchanges.so for that like bitterness that made a clear declaration of their intended closer and given customers enough time to withdraw the funds and also a promised refund to customers that failed to meet the deadline.This indicates that the exchange can be trusted with customers' funds and if they could make a comeback, there is a high possibility for them to get the clients back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "May 10, 2023, 08:24:17 PM",
      "body": "For an exchange like bittrex, I do not see why I would do business with them if they get back in business, bittrex has a great reputation as a crypto exchange, I remember like the op said, they were one of the biggest exchange before the emergence of Binance, why many of this OG exchanges allowed binance to take the crown from them, I really don't know, but the fact remains that bittrex is a great exchange, and I will do business with them, as long as they didn't steal money from their customers.And besides, it's the US arm of bittrex that filed for bankruptcy, not the global version, if the global version of bittrex file for bankruptcy, that would have cost a lot of unrest in the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 10, 2023, 08:41:57 PM",
      "body": "I am not a customer of Bittrex, but Ofcus' customers will definitely still do business with them if they come back because they have served their customers well by asking them to withdraw their assets before they can officially short down. Most exchanges have failed, and not all were able to ask users to withdraw their assets before going down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 10, 2023, 09:25:16 PM",
      "body": "I know that bittrex plays a role for the history of the crypto market as they're one of the biggest exchange before Binance became one. But, I wouldn't step any on their territories when they come back to business. Just no for me and I wouldn't even think twice with that. Even if they'll comeback with such good offers and promotions, that wouldn't enticed me of using them and that's even going to give me the thought that they're trying hard for it but still, not gonna push me into using them back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "May 10, 2023, 09:31:46 PM",
      "body": "Quote from: BIT-BENDER on May 10, 2023, 07:39:53 PMActually they were kind enough to tell people to withdraw their funds from the exchange but this goes to still repeat that it’s very risky to leave your funds on exchange, sad to see an exchange filling for bankruptcy but what’s the reason for bankruptcy going by the way FTX went bankrupt and the mismanagement of funds it draws attention also to this case.I would not Trust and do business anymore with a crypto-currency  exchange that has gone bankrupt, I won’t do business with a centralized exchange because I don’t believe in the centralized system.  At least they were responsible enough to return the funds that were actually not their ownership. Still thankful for that. However, if they will operate again, I would not dare to put my funds again in their exchange because I already know that there are no security with centralized exchanges. Although they can be trusting at first, but it’s risky to think that we should always be alert to withdraw our funds in case the exchange will be put into danger again. I would rather create my own hardware wallet that is more secured and free from online scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "May 10, 2023, 09:42:26 PM",
      "body": "Quote from: alastantiger on May 10, 2023, 07:28:24 PMI know that many other centralized exchanges may declare bankruptcy - but let's ignore this for a moment and assume that these companies gets back in business would you patronize them? Would you still do business with them? I know the whole talk of move your bitcoin off centralized exchanges but we cannot denial the fact they that they still play an important role in the crypto community. Don't know about anyone else here, but personally I was pleased to here this news. It's long overdue based on Bittrex's reputation over the years that has been steadily declining. It was indeed one of the largest exchanges when altcoins were booming in 2017, as was one of the few exchanges offering hundreds of different shitcoins, whereas as now there are literally hundreds of exchanges doing this.Ultimately the interface was always archaic, nobody liked going there in order to buy a shitcoin anyway - it was more of a \"needs must\" as the first exchange for many new coins if you wanted to get in early - and otherwise went from a Top 10 exchange so not even in the Top 50, eventually replaced by the likes of Binance, Kraken, OKX, Bitfinex, Huobi, literally every other major exchange, even Coinbase.I'm otherwise far from surprised they can't manage their books based on their reputation. Even with $10m+ volume per day they still couldn't stay in business and turn profit.. It's pathetic really.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "May 10, 2023, 10:11:30 PM",
      "body": "Quote from: royalfestus on May 10, 2023, 08:03:43 PMIt's important to stay informed: Bittrex has had separate US and Global exchange platforms for over two years now. It's the US exchange that is claiming bankruptcy, not the Global exchange. Many believe that the US government's unfavorable stance towards cryptocurrency may hinder its potential for growth, causing the country to miss out on the tax revenue and other benefits the industry could offer in the future. If this continues, there's a possibility that the US may try to retaliate when they see other countries profiting from the cryptocurrency space.This is the important part!OP is talking like bittrex, one of the biggest exchanges is going bankrupt but it's not. Bittrex US was having problems for months and the Biden administration and the SEC was slowly suffocating it. The result of this war will be the exodus of all but the most centralized and obedient exchanges from the US and US citizens will have to trade using exchanges in other countries. Good thing is that there are 2 presidential candidates who like bitcoin and I doubt people are going to vote for senile Biden once again, so chances are in a few years the president will be a bitcoiner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "May 10, 2023, 10:28:00 PM",
      "body": "Quote from: alastantiger on May 10, 2023, 07:28:24 PMOn May 8th the crypto community was greeted with the news that Cryptocurrency exchange Bittrex filed for bankruptcy. It was one of the biggest crypto exchanges to exist before Binance. It joins other crypto exchanges like FTX, platforms Celsius Network, Voyager Digital, Three Arrows Capital and BlockFi that filed for bankruptcy in 2022. Unlike FTX, Bittrex informed her customers to withdraw their funds before April 30th and even those who didn't would still be able to get their funds back in full.QuoteIn April, Bittrex told its U.S. customers to withdraw their funds by Apr. 30, when the company shut down its operations, according to its website. For customers who didn’t withdraw by the end of last month, Bittrex said on Apr. 8 that their funds \"remain safe and secure” and that its top priority is to ensure that they are made whole.I know that many other centralized exchanges may declare bankruptcy - but let's ignore this for a moment and assume that these companies gets back in business would you patronize them? Would you still do business with them? I know the whole talk of move your bitcoin off centralized exchanges but we cannot denial the fact they that they still play an important role in the crypto community. . https://www.thestreet.com/investing/cryptocurrency/big-crypto-exchange-goes-bankrupt#:~:text=Besides%20FTX%2C%20platforms%20Celsius%20Network,BlockFi%20went%20bankrupt%20in%202022.Whenever a a centralized platform filed up for bankruptcy then as a user or client who had been using up their platform and have funds inside the exchange then dont expect that everything would go smooth.If ever they would be giving out some ample time to make withdrawals then its a good one rather than on making yourself on the situation just like with those Mt.Gox funds that had been pending for how many years.I wasnt aware if those Bittrex funds been holding have totally given out into their users or there are some pending issues but basing up on my awareness they arent really that having that much issue in regarding to it,unlike into those people who get stucked with FTX.In speaking about trusting them once again then i would definitely 100% be skipping out, if ever they would be deciding to have some restarting of their business. I cant just afford on trustingagain on a company which does have filed up some bankruptcy in the past and now they are trying out to run the business again just like that there's nothing happened? lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 10, 2023, 11:07:30 PM",
      "body": "Although the Bittrex exchange inform their customers about withdrawing their funds but there's something wrong with the mode of operation of some centralized exchange because they appear to be playing with user's funds because the Bittrex exchange filed for bankruptcy after the US SEC look into exchange services in the foreign affiliate and Bittrex Global after they failed to register as a national securities exchange and the next thing is that they filed for bankruptcy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supreemo",
      "created_time": "May 10, 2023, 11:40:37 PM",
      "body": "of course i will still do business with them, the issue about KYC and being a centralized exchange only applies is only risky for me if i were doing some shady things which i refuse others to know. aside from that, the company is trusted and operates diligently. i was even using bittrex way back 2018 to do transactions since there are wide variety of coins i can choose from and it is much easier to transfer coins from my wallet to that exchange compared to other exchanges existed today. it is just sad to hear that bittrex slowly fall out of the competition, but regardless i was still happy doing transactions back then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "May 11, 2023, 03:50:47 AM",
      "body": "Quote from: alastantiger on May 10, 2023, 07:28:24 PMUnlike FTX, Bittrex informed her customers to withdraw their funds before April 30th and even those who didn't would still be able to get their funds back in full.It is Bittrex US. not Bittrex Global which will continue to provide their exchange service for global users who are not from the USA.About Bittrex exchange, they have interesting history in 2017 when they took over a first position from Poloniex. Poloniex used to be a very big exchange but they failed to prepare and expand their infrastructures for 2017 bull market. When massive demands from new users came, their platform was overloaded and broken. That caused losses on their users who use Margin trading.Bittrex took that opportunity and became a biggest exchange in 2017 but they failed to scam ICO tokens. They did not learn from Poloniex and lost their position to Binance very easily within a few months.They made their history worse in many people when they forced users to do KYC. Many people failed with KYC on Bittrex and were unable to withdraw money out of Bittrex.Bittrex - source of funds. They did bad things in 2019 and 2020 on many customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 11, 2023, 03:58:59 AMLast edit: May 11, 2023, 04:13:34 AM by Husires",
      "body": "Quote from: alastantiger on May 10, 2023, 07:28:24 PM Bittrex informed her customers to withdraw their funds before April 30th and even those who didn't would still be able to get their funds back in full.April 30 of which year this year or next year?For the platform to go bankrupt means to file for bankruptcy according to Chapter 11 of the US Companies Law https://www.uscourts.gov/services-forms/bankruptcy/bankruptcy-basics/chapter-11-bankruptcy-basics , something that did not happen in Bittrex case.Bittrex US (not Bittrex Global)  is the one who stopped working, in which SEC does a lot of work to dry up crypto exchanges and therefore closing the .US is logical.we ignore COVID-19, the cost of living, price fluctuations, inflation rates and the difficulty in obtaining loans effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 11, 2023, 04:06:19 AM",
      "body": "Can't really answer that question without having enough information.* Why did they go bust in the first place?* Is the CEO/leadership team a new team, or a different one?* Is there a specific reason on why I should go back into using the exchange?* etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "May 11, 2023, 05:24:02 AM",
      "body": "The most of the centralised exchanges are facing the same issue but the thing is they themselves are not losing anything even if they file for bankruptcy but users funds are confiscated with it and marked as loss so if you trust them again it's your mistake.The market crash or general reasons can be treated separately but they are going down because of internal operations or any other reasons even it's US exchange only so the people are at loss in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "May 11, 2023, 05:49:20 AM",
      "body": "Quote from: tabas on May 10, 2023, 09:25:16 PMI know that bittrex plays a role for the history of the crypto market as they're one of the biggest exchange before Binance became one. But, I wouldn't step any on their territories when they come back to business. Just no for me and I wouldn't even think twice with that. Even if they'll comeback with such good offers and promotions, that wouldn't enticed me of using them and that's even going to give me the thought that they're trying hard for it but still, not gonna push me into using them back. Bittrex was once among the top crypto exchanges with high regards in its security, so I think it’s still reasonable to do business with them and trust my funds again into their exchange. However, maybe this time I will be more cautious not to put all my funds to them so that if this scenario will repeat, then I won’t have to deal with regrets from losing huge amount. I know Bittrex was very stable way back then, but still it’s safer not to put all in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}