{
  "id": "topic_5448809",
  "title": "Mustang Shelby",
  "author": "Mustang Shelby",
  "created_time": "April 14, 2023, 10:47:16 AM",
  "content": "Arkadaşlar yaklaşık 6 ay önce bir miktar birikmişimi kripto para birimi olarak yatırım kararı aldım. Aklıma gelen ilk seçenek ise tabii ki Bitcoin oldu. Bitcoin olarak kendimce bir birikim miktarını kenara ayırdım, o orada duruyor ve diğer gelirler ile ara sıra şu anda altcoinlere yatırımlar yapıyorum. Bir çok kişi tarafından akıl verilmişliğim oldu. Genellikle çevremdeki bayanlar garantici olduğu için altın konusunda ısrar ettiler. Bir arkadaşım KKM’ye yatır dedi. Euro olarak tutmam gerektiğini söyleyenler de oldu. Hatta para öyle dursun diyen bile oldu da ona güldüm geçtim. Ben ise neden Bitcoin’i seçtim? Seçerken neleri göze aldım? 1- Seçmemde ana etken döviz ile endekslenmiş ve Türk Lirasından uzak durması oldu. Yani param aslında ana cins olarak dolar olarak duracaktı ve Bitcoin’in durumuna göre hareketlenecekti. Burada aldığım iki risk vardı :A) Bitcoin artacaktı bu durumda tadı tuzu ayrı güzeldi. Bitcoin artacak, dolar da yerinde durmayacak ( benim düşünceme göre ) çifte artış yaşayacak ve olumlu bir senaryoda mutlu olacaktım. Paramı ne altında, ne Euro veya KKM’de bu kadar arttırabileceğimi düşünmüyordum.B) Bitcoin azalacaktı ve bu durumda da sabrımı korumam ve elimdekilerin birer “Bitcoin” olduğunu ve ben aslında değer kaybetmediğimi kendime anlatacaktım. Öngörüme göre değer kaybı yaşasam da dolar artacaktı ve biraz olsun zararım hafifleyecekti.2- Bitcoin’in fiyatının ucuz olduğunu düşünüyordum, geleceğe dair daha çok duyacağımıza inanıyordum. 3- Bitcoin ile bu forumdaki gelişmeler ile birlikte daha yakından takibini sağlayabilir, herhangi bir durumda kendime göre alternatif yol haritalarını kafamda oluşturabilirdim.Bu süreçte bu paraya hiç dokunmayacaktım. Ne olursa olsun 6 ay vade ile kalacaktı, 6 ay sonunda duruma göre hareket edecektim. Şimdi son 6 aydır işler yolunda gidiyor. Altın veya diğer senaryolarda eminim bu kadar kazanamazdım. Bu herkes Bitcoin alsın veya Bitcoin hep kazandırır başlığı değil, kendime göre aldığım riskleri, neden bitcoine yatırım yaptığıma dair bir başlıktır. Bu konuda körü körüne de Bitcoin’i savunmuyorum. Şu anda da gelecek sene olacak yarılanma için aklımda türlü türlü düşünceler var belki bir miktar daha elimdekini arttırma yoluna gidebilirim. YTD. Siz yatırım yapanlar neden yatırım yapıyorsunuz peki?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448809",
  "comments": [
    {
      "author": "Pulsar77",
      "created_time": "April 17, 2023, 03:34:50 PM",
      "body": "Bitcoin yatırımı benim de aklıma yatan yatırım türlerinden birisi açıkçası. Çünkü uzun vadede kazandırma açısından şu ana kadar kendini kanıtlamış bir kripto para birimi. Tabi ki kripto paraların tek amacı yatırım değil ama çoğunlukla yatırım aracı olarak kullanılıyorlar ve ben de en azından şu an için biraz o gözle bakıyorum.Uzun vadeli yatırımlar için döviz, altın gibi çok iyi seçeneklerin yanına bence Bitcoin de eklenebilir. Tabi sabırlı bir insan için Bitcoin'e uzun vadeli yatırım mantıklı. Çünkü eğer belli bir hedef konulmazsa çok ciddi şekilde bir fiyat artışını beklemek oldukça uzun sürebilir. Ben bu bahsettiğim 3 yatırım aracını da tercih etmiş birisiyim diye de ekleyeyim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "April 17, 2023, 06:24:26 PM",
      "body": "Bitcoin, size kendi kendinizin bankası olma imkanı sunan iyi bir değer saklama aracıdır. Bkz: https://www.btcturk.com/bilgi-platformu/deger-saklama-araci-olarak-bitcoin/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "April 18, 2023, 06:14:36 AM",
      "body": "Quote from: onurgozupek on April 17, 2023, 06:24:26 PMBitcoin, size kendi kendinizin bankası olma imkanı sunan iyi bir değer saklama aracıdır. Bkz: https://www.btcturk.com/bilgi-platformu/deger-saklama-araci-olarak-bitcoin/En güzeli aslında bu yazdığınız cümle. Bitcoin kendi kendimizin bankası olma özelliğini bize veren yegane teknoloji ürünüdür. Sistemi her zaman söyleyebileceğimiz gibi en güzel şekilde dizayn edilmiş, uzun vadeli gelecek nesillere bırakabileceğimiz kenara biraz ayırabileceğimiz evladiyelik bir yatırım aracı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "April 18, 2023, 06:26:32 AM",
      "body": "Hocam BTC'ye yatırım yaptın tamam. Mesela kaçı gördüğü zaman satmayı planlıyorsun ya da ne kadar süre tutabileceksin? Diyelim ki 30 bin dolardan aldın ve btc de sallıyorum 1-2 ay içinde 100 bin dolar oldu. Elinde tutmaya devam edebilecek misin? Bunu sorma sebebim hodl gerçekten çok zor. Hodl yapabiliyor musun sabırlı bir şekilde. Bir de uzun vade yatırım da ciddi meblağ koymak lazım ki olursa 3-5 sene sonra yine bir işe yarasın. 1-2 bin TL'lik btc tutmak ne bileyim pek bir şey yapmaz gibi. Bilmiyorum belki de yanılıyorumdur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "April 18, 2023, 06:41:30 AM",
      "body": "Quote from: ajanwalker on April 18, 2023, 06:26:32 AMHocam BTC'ye yatırım yaptın tamam. Mesela kaçı gördüğü zaman satmayı planlıyorsun ya da ne kadar süre tutabileceksin? Diyelim ki 30 bin dolardan aldın ve btc de sallıyorum 1-2 ay içinde 100 bin dolar oldu. Elinde tutmaya devam edebilecek misin? Bunu sorma sebebim hodl gerçekten çok zor. Hodl yapabiliyor musun sabırlı bir şekilde. Bir de uzun vade yatırım da ciddi meblağ koymak lazım ki olursa 3-5 sene sonra yine bir işe yarasın. 1-2 bin TL'lik btc tutmak ne bileyim pek bir şey yapmaz gibi. Bilmiyorum belki de yanılıyorumdur.1-2 bin liralık Bitcoin devri 10 sene önceydi  Artık 1-2 bin liralık Bitcoin devri sona erdi. Uzun vadeli düşünülüyorsa bence de en az 0.5 Btc kenara ayırmak gerekiyor. Bu kadar bir Btc ayıramıyorsak gelecekten çok umutlu olmaya gerek yok bence. 10 bin liralık btc alsanız kenara atsanız, Bitcoin 300 bin dolar olursa paranız 100 bin lira olacak. Bu durumda da yaşayacağınız pişmanlık keşke daha fazla Bitcoin kenara atsaydık olacak. Bu yüzden baştan uzun vadeli yatırımı sağlam tutmak gerekiyor bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "April 18, 2023, 07:33:14 AM",
      "body": "Quote from: ajanwalker on April 18, 2023, 06:26:32 AMHocam BTC'ye yatırım yaptın tamam. Mesela kaçı gördüğü zaman satmayı planlıyorsun ya da ne kadar süre tutabileceksin? Diyelim ki 30 bin dolardan aldın ve btc de sallıyorum 1-2 ay içinde 100 bin dolar oldu. Elinde tutmaya devam edebilecek misin? Bunu sorma sebebim hodl gerçekten çok zor. Hodl yapabiliyor musun sabırlı bir şekilde. Bir de uzun vade yatırım da ciddi meblağ koymak lazım ki olursa 3-5 sene sonra yine bir işe yarasın. 1-2 bin TL'lik btc tutmak ne bileyim pek bir şey yapmaz gibi. Bilmiyorum belki de yanılıyorumdur.Burada strateji önemli. Ne yapmak istiyorsun?Sermayeni;Ne kadarı uzun vade?Ne kadarı orta vade?Ne kadarı kısa vade?Artı;Ne kadar ek yapmayı planlıyorsun?Düzenli olarak alım yapacak mısın?Kısa vade düşünüyorsan, al, fiyat artınca sat, düşünce adet artır.Orta vade düşünüyorsan, kendine bir kar ve zarar yüzdesi belirle. (Örn. %5) Maliyetin %5 altına düştüğü an yükselir mi alçalır mı diye düşünmeden sat! Maliyetin %5 üstüne çıktığında ise o civarlara stop koy. Altına düşünce satılsın. Fiyat yükselirse stop'unu yükselt. Böylece pozisyonun en az belirlediğin oranda karla kapanmış olur. Diyelim ki stop oldun ve fiyat yükseliyor. Yine kendi stratejine göre, bir yerden giriş yap ve yukarıda anlattığım kuralı takip ederek stop'unu gir ve fiyatı takip et.Bu döngü sana orta vadede para kazandırır.Uzun vade içinse, her ay (ya da belirli aralıklarla) fiyata bakmadan düzenli alım yapmak gerekiyor. Uzun vadeden kastım 1-2 sene değil. En azından 1 döngü (4 yıl) ilerisi için plan yapmalısınız. Ya da örneğin çocuğunuz için 18 yaşına gelene kadar, üniversiteden mezun olana kadar vs. süreler ile birikim yapabilirsiniz. Maliyet tabi ki artacaktır, ancak ortalamanız hep güncel fiyatın çok altında kalacaktır.Örnek olarak 100₺'lik hesaplama için bir önceki mesajımda paylaştığım sayfayı ziyaret edebilirsiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "April 18, 2023, 08:25:29 AM",
      "body": "Quote from: ajanwalker on April 18, 2023, 06:26:32 AMHocam BTC'ye yatırım yaptın tamam. Mesela kaçı gördüğü zaman satmayı planlıyorsun ya da ne kadar süre tutabileceksin? Diyelim ki 30 bin dolardan aldın ve btc de sallıyorum 1-2 ay içinde 100 bin dolar oldu. Elinde tutmaya devam edebilecek misin? Bunu sorma sebebim hodl gerçekten çok zor. Hodl yapabiliyor musun sabırlı bir şekilde. Bir de uzun vade yatırım da ciddi meblağ koymak lazım ki olursa 3-5 sene sonra yine bir işe yarasın. 1-2 bin TL'lik btc tutmak ne bileyim pek bir şey yapmaz gibi. Bilmiyorum belki de yanılıyorumdur.Benim şahsi satış fiyatım ve vadem uzun aslında. Satış için minimum 100 bin dolar hedefim var bir kısmı için, diğer kısmı için de satış hedefsiz uzun vade bekletilecek birikim olarak planlıyorum. Ne olursa olsun düşsün veya yükselsin fark etmez bekleyeceğim çünkü inanıyorum. Gelecekte daha rahat yaşamak için sabırlı olmak gerekiyorsa olacağım. Bu arada düşük bir para ile beklemenin mantıksız olduğunu bende düşünüyorum bu yüzden kendime göre ciddi sayılabilecek bir birikimimi buna ayırdım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "April 21, 2023, 12:23:14 PM",
      "body": "Yaptığım tüm yatırımlarda ilk hedefim cebimden koydugumu tekrar sistemden geri almak, tabi bunun için bir de maksimum zaman limiti de belirliyorum, bu arada kayıp halinde panik yaptırmayacak, hataya sürüklemeyecek ve mevcut hayat standardimi bozmayacak miktarla yatırım yapmak en önemli kriterim, sonrasında örneğin 10k USD lik bir BTC yatırımı yaptım, zaman limitimin de rahat olduğunu düşünelim, arkadaşların yazdığı gibi 100k USD ye gelmesine gerek yok, ana parayı kurtaracak düzeye geldikten sonra ana parayı geri al, kalan miktar risksiz miktar, sonra nereye çıkarsa çıksın en kotu kardan zarar ederim...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "May 04, 2023, 05:53:43 PM",
      "body": "Hocam nedenlerinizi ve aldığınız riskleri çok güzel bir biçim de sıralamışsınız ve güzel bir paylaşım olmuş, ilk önce bu güzel paylaşım için teşekkür ederim. Kaybedilecek para, ekonominizi ve yaşantınızı etkilemeyecek bir miktarda olduğu sürece risk alınarak yapılan her yatırımı mantıklı bulan biri olarak sistematik bir yatırım yaptığınızı bu yüzden de er geç sizin için olumlu sonuçlanacağını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 05, 2023, 01:32:05 AM",
      "body": "Benim şu an için yatırım mantığım, değeri en zirve noktalarda olduğu için Dolar ağırlıklı seyrediyor. Yatırım yapmıyorum da dolar alıp geçiyorum diyebilirim. Bitcoin lerimi biraz boşalttım. Açıkçası şu ortamda ben sepet yapılması taraftarıyım, çok büyük gelişmeler bizi bekliyor seçim sonrası: Kılıçdaroğlu kazanırsa biste mutlaka girip ihracat ağırlıklı şirketlere yatırım yapılmalıdır. Keza enerji şirketleri de boş geçilmemeli. Bist30 a girin 5 yıl unutun o derece.Altın ve gümüş, fiziksel olarak mutlak alınmalı. Nadirgold aklınızda bulunsun derim. Portföyde değerli maden ol-ma-lı.Bitcoinsiz halving dönemine girilmez. Şimdiki fiyat bir tık pahalı bence, 20-25 bin seviyelerinden mutlaka bitcoin bulundurulmalıdır.İsviçre frangı! En iyi para birimi.. Biraz alınmalı.Küresel kriz sonrası dönemde mutlaka nasdaq a girilmeli teknoloji firmaları takip edilmeli vs. Aklıma gelenler bunlar.Bitcoin söylediğim gibi kafama esen yerde mutlaka alırım. 2024 bitcoin yılı çünkü.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}